{"name": "The Owners", "titleId": "tt09806370", "reviews": [{"id": 0, "text": "This is only unpredictable if you've never watched anything else of the genre. It rips off Villains, poorly, but tries to have a twist ending. A twist that was as dumb as everything else.Doesn't help that the third act was cropped to a 4:3 ratio for no discernable reason."}, {"id": 1, "text": "This is the British version of Don't Breath only not as good. I love Maisie Williams and her acting was great but there is nothing unique about this movie at all."}, {"id": 2, "text": "I thought with Williams as the lead the rest of the cast would be low budget level actors but they all do a fine job, particularly McCoy who was Dr Who few years after Tom Baker. It has the usual idiot trope consisting of an utter tool, a mild tool, the coward that gets roped into dumb things by his tool friends, and the girlfriend that didn't want to be there in the first place. Follows a fairly standard formula of a house robbery gone wrong but without being predictable and it ramps up the tension quite well as the violence escalates. Enjoyable thriller overall."}, {"id": 3, "text": "It's shame to see the people who did such a great job of acting in GoT get stuck with these garbage roles, I'm pretty sure they wanted better for themselves, this is so far beneath Maisie Williams talents"}, {"id": 4, "text": "No action , no horror .very bad movie .i think if you watch that you will loss your time"}, {"id": 5, "text": "Credit to Mccoy the former dr who and childrens tv presenter, he was dark, convincing and methodical in his actions, as well as his partner, i just felt the rest of the cast let them down.The typical break into the rich peoples house, and what can go wrong, for everything to go wrong, was highly predictable, and the owners to be sadistic murderers protecting, house, wealth and hidden secret not a surprise at all.As slowly the cast fell one by one, the usual rookie mistakes continued. Opportunities still came for a happier ending and escape, and one by one they screwed themselves over as was the general feel of the film.For all the owners effort, and the partners madness, i honestly was disappointed by both story and acting of the others. With even the surprise at the end not really a secret with the emphasis around Kate."}, {"id": 6, "text": "This movie has been made a bunch of times already. break into a house to steal something and turn into prey."}, {"id": 7, "text": "I found it entertaining, predictable but still it kept me wanting to continue watching... I gave it five stars.. when I find a movie that can't keep my interest than I stop it! This definitely kept me entertained and that's what movies are supposed to do!"}, {"id": 8, "text": "*** I guess spoilers?Depressingly poor from the start. Good acting from the ones that matter (you'll know who) and the others were pointless and awful. Performance aside I found myself shouting at the screen asking why she'd give another chance to the idiot who tried to assault her? Confusing rubbish that shouldn't have made if to air, stay away!"}, {"id": 9, "text": "Waw, didn't expect much from this type of movie but at least it should have had a plot, a twist something....."}, {"id": 10, "text": "The premise isn't terribly original, but it's worth watch for the incredibly creepy performance of the actor who plays the old man, and it never got boring"}, {"id": 11, "text": "What I didn't enjoy about The Owners is how big of a letdown it is after the film embraces its latter half twists. The first half is heist+home invasion clichés galore - a bunch of thugs looking to make some quick money by robbing a rich house fail to realize that the resident couple has some secrets of their own to hide. This plotline has now nearly run its course and needs truckloads of inventiveness to be taken seriously. While there have been a few surprises in this subgenre such as Don't Breathe and Villains, I don't think this film makes it to that list.The screenplay meanders, the characters are all unlikeable (the film uses the pregnancy ploy to make audiences care for Mary, the character played by Maisie Williams, but it doesn't work), and the overall slackening of pace do the film no favours. There are zero scares and it's some bloodshed alone that tags it under the horror category. Watch one of the films mentioned above (or M.N Shyamalan's The Visit) instead."}, {"id": 12, "text": "I was, of course, attracted to the movie by its poster, showing a global star Maisie who for a decade was one of the main protagonists in the best fantasy series ever. So, naturally, from the star of this level, I was expecting nothing else than at least a decent movie. However, what I saw was a disastrous movie. Bad casting (except Williams), superbad screenplay, especially the dialogues, soo shallow. The most part of the movie I was just waiting for it to end, there was not EVEN suspense, just the naked curiosity of the ending (still not believing the movie is SO bad). Just a big waste of time. Watch better Hereditary, The Lodge, Elie, Reliq..."}, {"id": 13, "text": "I could tell this movie tried to be different and I don't usually care about originality unless I expect it. It was the lack of suspense and momentum for me. Also, I hope Maisie Williams never do a movie like this again. She deserves better"}, {"id": 14, "text": "People write unwarranted bad reviews about this movie? And to be honest, said reviews put me off going to watch it 😔 but, giving the stellar cast, I thought it couldn't be that bad? I was thankfully wrong, it was very good Infact, soon as the old couple return to the house and the action started, I was hook on the film, till the brilliant ending, thank you"}, {"id": 15, "text": "What on earth are Maisie Williams and Sylvester McCoy doing in this?! Dull and ridiculous. Does has the odd moment which is why I gave it 2 rather than 1 stars, but honestly, don't bother. Go watch some grass grow instead."}, {"id": 16, "text": "This movie has nothing... Boring, stupid, slow... Unfortunately this is the kind of horror we have, nowadays... This is not a 1 out of 10...it's -10 out of 10. Run away from this crap"}, {"id": 17, "text": "While the setting and the story is is somewhat similar the focus is not where it is in Don't Breathe. This one builds it up nicely, there's dynamics between the characters etc.. Not the best movie but definitely worth a watch!"}, {"id": 18, "text": "Many people compared this movie to dont breath but it is nowhere near as good as dont breath. dont breath had originality and bad ass character.here we have an unoriginal movie and we know from the beginning what will be the destiny of each character. very predictable. acting is bad but i guess the story reason for actors to not to leave any acting space.one more thing to indy horror movie producers, please stop trying to finish the movies with bad ending just for the sake of bad ending tradition. it became so much cliche"}, {"id": 19, "text": "Poor acting...poor set pieces....nonsense story. Just so bad."}, {"id": 20, "text": "I hate myself for sitting through the whole movie when it obviously looked crap from the first minute"}, {"id": 21, "text": "A twisted enjoyable psychopathic acting masterclass from sylvester McCoy some parts predictable yet a must watch can't miss a beat film, plays with your mind and emotions bring on a sequel!"}, {"id": 22, "text": "...of being mislead by reviews. No not the IMDB ones from folks like me, but the professional reviews that said this was a worth while movie. The only bit of truth in any of them was that it was nothing new. Fine. But to praise anything else was deception.The idea that rich people keep lots of money in their house is pretty ridicules. But it has made many a film plot, notably Don't Breathe. Are there bozos out there who think Bill Gates has a safe full of millions in his house?? Maybe. But I bet he does not! Rich folks have investment portfolios where their money is making more for them and not sitting in safes gathering dust. Maybe they have a few hundred around just in case, but all else is platinum cards, etc.When the poop goes down, the film truly stops making sense. That the would be robbers would now trust the homeowner whom they just terrorized with helping them is absurd. Once things went sideways, the robbers would have knocked the old folks out (or killed them) and fled.That the owners knew two of the robbers makes me feel killing them would have been the option.But no. Other than one psycho, these are just desperate kids out for money to improve their dreadful lives. No hardened killers.Maisie Williams whom I have seen in other roles besides GOT, and has been great in all, is the best thing about the movie. But even she cannot make a terribly stupid plot enjoyable."}, {"id": 23, "text": "I don't know if its because of how convoluted the plot became or the unrealistic decisions of certain characters but this movie sucks. I honestly can't recommend it to anyone. Do not waste your time on this, even Maisie Williams from Game of Thrones fame can't save this dumpster fire."}, {"id": 24, "text": "Thematically felt like watching Tales of the Unexpected or a Hammer short. Some really original cinematography tricks really ramped up the tension.The way the film's protaganists shifted (cant say too much, spoilers!) was brilliantly executed. Some great performances married with excellent suspense and reveal....just a great film."}, {"id": 25, "text": "I must say, the headline of my review is perfect. it came into my mind just 1 minute ago. it pretty much describes the movie in 3 words. but it sounds better than it is. the actors are ok, anyways, it is not a great movie. its a low budget, bloody and violent movie with a dubious story. the burglars behave dumb. the victims, the grandpa and his wife are mentally ill. the girlfriend seems to be the only one who behaves normal. all in all: watchable, but not a must watch."}, {"id": 26, "text": "I feel sorry for maisie williams being involved with this excuse for a film.the other young actors were so painfully annoying I just wanted them all to die quickly."}, {"id": 27, "text": "This is one infuriating film. Maisie Williams (Mary) is the most famous actor in this confusing mess of a film. Whilst I watched this I could not help but think of it as the British version of Don't Breathe (which is superior in Every aspect of this genre of film) without the blind man. Instead you have 2 creepy older eccentric characters Richard Huggins (Sylvester McCoy) &amp; Ellen Huggins (Rita Tushingham).Gaz (Jane Curran) is the unhinged character within this group &amp; he does a convincing portrayal of this perhaps maybe a bit ott. Whereas Nathan (Ian Kenny) plays Mary's boyfriend &amp; Terry (Andrew Ellis) the tag-along of this dysfunctional social group.What annoyed me most is Terry whose decision process throughout this film beggars all belief/ beyond stupidity. Why would he choose and obey the 2 strangers that he met for the first time over his close friends of many years?! Maisie Williams is the only shining star of this film but even she cannot stop this Titanic of film from sinking beyond mediocrity. Maisie, you deserve to be in a much better film than this!"}, {"id": 28, "text": "A great little British film, with a few twists thrown though out it. Though Maisie Williams is billed as the star of the film, it should be Sylvester McCoy who stole the show as the doctor/owner of this big house (though I misread the opening titles as Sylvester Stallone (which would of been a whole other movie). Rita Tushingham also plays the doctors wife well here as well. I spent the film swapping sides with who I wanted to get revenge/win, although there were many times a character did something forehead slappingly stupid that annoys me like it does in many a film. Gaz is also played particularly well also for his over-nastiness from his violence to the disregard he has to property, Mary was okay in it, and the other 2 guys were just sort of there to annoy me. Give the film a try, it's not the best film out there, but it's certainly not the worst either. No spoilers, but I'd of preferred if they cut the last 5 minutes from the film, it wasn't really needed, I'd of rather be left in limbo not knowing if there was an escape or not."}, {"id": 29, "text": "Whoever wrote and directed this: quit your day job, and attack whoever gave you money for this filth. Maisy you are an idiot. You are also done. Wow. I wanty money back FiOS. Barf"}, {"id": 30, "text": "One time watch. A lot of dumb decisions and mistakes were made. Please Challenge our intelligent as fans of movies."}, {"id": 31, "text": "The character Terry. If you have seen this movie I should have to say no more. One of the most irritating characters in a horror movie I have ever witnessed. I could barely make it through this movie because every decision a character makes is unbelievable. The film is not scary or thrilling in the slightest. The twist ending was dumb and did not make it worth the effort of sitting through this terribly unoriginal piece of trash. I spent $8 so you don't have to. Seriously avoid this at all costs and watch Don't Breathe instead."}, {"id": 32, "text": "I'd file this more in weird tales than straight up horror. This is a film that has been made albeit with minor details changed slot in the last few years. This one starts off with a bang with some good acting then proceeds to get sillier in the second part. It's not as bad as some are saying but there is better - The Visit for example."}, {"id": 33, "text": "As Halloween nears more scary films are being released with the intent of frightening film lovers. Some will be good, some will be bad and some will be in between. Consider the film THE OWNERS to fall into that last category.In England a group of 20 somethings decides to break in a house when the owners leave. The mother of Terry (Andrew Ellis), one of the group's members, is the house cleaner there and he knows from her that there is a large safe in the house. As they wait for the owners to leave the girlfriend of one, Mary (Maisie Williams) shows up telling her boyfriend Nathan (Ian Kenny) to come away and take her to work. He leaves her to enter the house as the couple who own the house leave.Led by Gaz (Jake Curran) the group breaks into the house and goes on a destructive bent. Smashing things, knocking things off of shelves and more they search for this safe when it becomes apparent Terry has no clue where it is. Throughout this rampage Mary tries to convince them to leave to no avail. Eventually they find the safe in the basement but before they can break into it the owners of the house return.Taking them captive we learn that the aging couple are Dr. Huggins (Sylvester McCoy) and his wife Ellen (Rita Tushingham). Tying them up they attempt to force the doctor to give them the combination to the safe. Refusing to do so the Gaz threatens them, urging Nathan to cut off one of Ellen's fingers. As the tension rises between the members of the group a fight follows with Gaz stabbing Nathan. Without revealing what takes place next suffice to say Mary comes to the rescue and releases the hostages.But this is one of those films where everything is not what it appears to be. Once released the tables slowly turn and the hunters become prey to this elderly couple. Not in an action packed way but slowly, methodically. It seems they have a secret that they've kept hidden. Now the gang has to worry not about just surviving but escaping as well. And the odds are stacked against them.The move is well crafted and looks great with some nice cinematography going on. But a great movie needs more than just that. Plot wise we have a theme that's been used in the past in other films with a few slight tweaks to change things up a bit. It still makes for an interesting story though.I found that the weakest point of the film was the dialogue. For me the overuse of bad language, in particular the F bomb, is a sign of lazy writing. Yes, people do talk like this. No they don't use it every third word. If that's what is used to convey that these are lower working class characters there are better ways of doing so. Instead the use here becomes repetitive and useless.With the exception of the two actors playing the elderly couple (Sylvester was once a Dr. Who and Tushingham was well known in the 60s for films like A TASTE OF HONEY and DOCTOR ZHIVAGO) the main selling point here is Williams coming fresh off the success in the HBO series GAME OF THRONES. There she starred as Arya Stark and made a name for herself. This film feels a bit below her status if she hopes to move on to cashing in on her fame from that series.In the end the movie does provide a few scares and a decent story even if a familiar one. If you're looking for something to watch and noticing that the titles available these days are limited you might want to give this one a try. Just don't set your expectations high and you'll find it worth watching."}, {"id": 34, "text": "There are scary, creepy, thrilling, funny, and unpredictable parts. Something I expected from horror or thriller movie But as a whole this is nonsense and looks unfinished. Not scary enough. Not solved. Not explained. Just few random thriller and horror ideas mixed up. Nice actors with each having unique personality, and the most interesting and funny was that meanest guy in the beginning."}, {"id": 35, "text": "It starts well. I like Maisie Williams. I wish she had appeared in a better movie."}, {"id": 36, "text": "I expected a lot from this movie and certainly when Maisie Williams was one of the actresses. But .... disappointment with intergalactic proportions. Really bad acting, shouting and messing up things doesn't make a movie, movie missed an entertaining factor.... Sylvester McCoy played the best role here: stayed calm under any circumstances compared to the brutal and violent actions of the teenagers, knew what he was doing (he played the doctor), but did not brought the movie to a higher level as what I expected from it. So a poor 2 star"}, {"id": 37, "text": "As an American I have watched and enjoyed, often in a perverse way, British movies with outlandish characters and outlandish story lines. Trainspotting and Snatch are two that come to mind. If you are in the right frame of mind they can be very entertaining.This one, The Owners, does not come very high up to the standard but is fun because (1) you can see quickly how amateurish and sloppy the would-be thieves are and (2) you just know the owners, the old short meek doctor and his half-crazy wife, will somehow get the best of the intruders.Much of it is funny but in total it is a very dark story, as the movie ends the doctor and his wife are found needing to plant three new bushes in their backyard garden.I watched it at home on DVD from my public library, my wife skipped. I enjoyed it as a diversion, for something quite different from mainstream movies. But in truth it isn't a very good movie."}, {"id": 38, "text": "Garbage from the very beginning. Little to no plot, fairly boring, nothing we haven't seen before. Generic."}, {"id": 39, "text": "It is a standard Suspense movie with some surprises and a good dark humor"}, {"id": 40, "text": "Low budget, didn't expect much. I was highly pleased with what I got here. It reminds me of the 'not really scary' horror movies that I grew up with in the 1970's. And, by not really scary, I mean no CGI, no exploding heads, no gooey guts hanging out. But, there is a subtle horror to it in the 'what's to come feeling'. I won't give up the spoiler ending. I'll just say that I enjoyed. It was a little predictable, as others here have said. And, I like that in my 'B' horror movies. I would recommend it."}, {"id": 41, "text": "First up the performances are excellent in this not very horrific horror. It starts strongly but then seems to meander into nothing much. Great to see Rita Tushingham in anything to be honest but she's not really given much to do here."}, {"id": 42, "text": "Very well, if that's what you want. What I wanted was to see 2020's unforeseen The Owners. What can I say, it really got me enthused. Then it got me thinking it was a little contrived.Anywho, Owners is something else (I'm not sure if that's always a good thing). It starts out as a despairing home invasion thriller only to become a psychological horror flick and a damaging one at that. Sans any civil characters, its diegesis involves four desperate thieves who decide to break into an old English abode. They get more than they bargain for when the keepers of said abode are even more messed up than the four offenders robbing them.The Owners is well cast with equally young and elderly actors. They effectively blur the lines between restraint, sheer madness, and sheer lack of self-control. The real star however, is probably the London Victorian mansion where Owners was filmed. It comes off as drab, cold, and dusty, a sort of never-ending labyrinth where cockroaches and silverfish love to hang out at.So yeah, The Owners is directed by Frenchman Julius Berg. A veteran of TV, this is his first feature film and it's a fervent, mixed mess. Using one location (when one location was probably all that was needed), Berg pushes the twisty envelope by giving us something adjacent to a Twilight Zone episode that might have been helmed by Eli Roth. Heck, you could even compare Owners to stuff like Don't Breathe, Straw Dogs, Saw, or The Shining.Bottom line: Owners is violent, blood-soaked, frustrating, and belligerently creepy (look for the closing credits which are done in reverse). As an ode to all things horror mumbo jumbo, it leaves you scratching your head as to how much more nastily polished it could've been. To each their own."}, {"id": 43, "text": "Nathan (Ian Kenny) leads a group of his mates on another home break-in. They opt for Dr. Huggins who they believe has a safe full of cash that they can all retire on. Terry (Andrew Ellis) who knew about the safe has no idea where it is located. They eventually find a huge safe in the basement, but it is not electronic so they can't open it. They decide to wait for the elderly couple to come home and coerce the combination from them. If you have ever seen a horror film there is enough clues for us to know what id in the safe. As expected the group becomes divided over how much coercion is required. And in all home break-ins. The table gets turned.Everyone is raving over Maisie Williams. I wish she would do something with her eyebrows. After things turn about the film drops off. I was no longer in it.Guide: F-word. No sex or nudity."}, {"id": 44, "text": "I'll keep it simple... There's an almost limitless amount of stupid decisions happening on screen... Ok, pretty standard for horror movies right? Sure, I can take some dumb decisions helping advancing the plot. Problem is... Once you're not given enough reason to care about the character, all the movie manages to do is turn you against them.If seeing old people get smacked in the head with a frying pan is not your thing, don't waste your time and stay away from this one cause that's the most entertaining thing it has to offer."}, {"id": 45, "text": "I just don't know how this movie can be so bad, since the beginning things didn't make sense, but things just got worse within the rest of the movie, it just got more and more bored and with a lot of discrepancies during the history time."}, {"id": 46, "text": "The Owners is a mostly boring petty-crime thriller (not horror) done in British style so you have stupid/ignorant English crockens and weird old people doing sometimes horrendous things, but many are implied, it's boring, I can barely remember the final scene. Julius Berg is a French tv show director and attempts the big screen with this, but nope, maybe next time."}, {"id": 47, "text": "Of all the projects Maisie Williams could have signed on for, she chose this mess. It starts off in generic fashion and goes downhill from there. The twists are not interesting or cohesive and the way this was put together is sloppy and confusing. At one point, the old woman is tied up and gets the false teeth slapped out of her mouth and in the next scene she's wearing them. This is just as confusing as the writing, so maybe it was intended to be another indecipherable 'twist'. Who knows.No effort was put into this story on any level and why Maisie Williams signed on to this is a mystery. I'm an avid fan of horror/thrillers and I thought with her in it, it couldn't fail. Boy, was I wrong. It's like they went out of their way to make this a bad movie.And if Maisie is reading this, please fire your agent. They're destroying your career and clout."}, {"id": 48, "text": "This is the story of three boys who want to rub a safe in a house. The owners of the house are a doctor and his wife. Those boys confront many issues trying to rub the safe. Maisie Williams was awesome. In my opinion, choosing Sylvester McCoy for the role of the doctor was a very good choice. I felt the horror elements in most of the scenes. Most of the story is happening in an old house. I liked the background music. In summary, I recommend this movie to horror genre fans."}, {"id": 49, "text": "There isn't one. Gore with no real story. Predictable, stupid and nothing is coherent."}, {"id": 50, "text": "I loved it ! A bit like the visit. Recommend if you liked The visit."}, {"id": 51, "text": "Better not watch, last 10 minute is waste of movie."}, {"id": 52, "text": "I kinda guessed there was another side to the story with the old couple from the beginning, but the movie ended it with only being a mystery. Needed more blood and a bit more of a payoff on what they were doing with the girls."}, {"id": 53, "text": "Just do not waste your time! Its that bad !!! So poor"}, {"id": 54, "text": "Very lame, uninteresting and unimaginative story. I just could not find anything interesting in this film. I was fighting heavy eyelids trying to reach the end. Seems like this was a small project between bigger projects for Maisie. {Yawn}"}, {"id": 55, "text": "I watched it because I read the positive reviews, oh boy what a mistake that was. The movie is interesting but truly bonkers. Towards the end when most of the action happens the ratio changes to 4:3, so you get a nice square box, you lose about %40 of the viewing area.Honestly it is just a weird poor movie, not a unexpected ending since you should be able to figure out what will happen. Acting is fine by the way.Need to stop watching British movies if I want something entertaining."}, {"id": 56, "text": "Phew...a lot of negative reviews but I found it entertaining , later half was a bit dragged too much but overall i would say it's good thriller. I only wish it had a happy ending :)"}, {"id": 57, "text": "They wasted so many good chances of escape or simply aborting the mission. Most of the characters are so annoying they don't know what they're doing, classic stuff. So in the end you really don't feel sorry except for the main girl, the others all deserved it for their stupidity."}, {"id": 58, "text": "Interesting enough to keep you focused. Things at times are predictable and viewers might not like that. The whole film you are just waiting for the owners to do something but the ending was kind of a let down."}, {"id": 59, "text": "It did however keep me gripped wondering what was going to happen next. Characters. Well I hated most of them from the start. Nasty scumbag chavs on the rob. Hardly makes you root for them. I couldnt wait til they got into trouble. Ha ha Maisie did a good job as the lead. And surprisingly Sylvester McCoy didnt annoy me like he usually does. Ha. Haf sone tense moment but was mostly frustration as characters made the usual idiotic decisions.Ending wasn't really that much of a surprise as they thought it was ......in fact it felt lazy and unfulfilling.Far worse out there and well filmed, acted and couple of nice bloody effects. Worth a watch but don't rush."}, {"id": 60, "text": "I can't understand some of the harsh reviews here. It's a small budget UK movie and people are comparing it to bigger budget American ones. l enjoyed seeing the two familiar veteran actors in very different roles. Maisie is of course terrific and the bad guy was appropriately vile. I was disappointed that Stacha Hicks had such a small role towards the end, she is such an under-used actress. I first saw her as Florence Nightingale in an Agatha Christie movie and I didnt know her name but I never forgot her exquisite facial features and the sensitivity she portrays in her roles. Casting directors note - more roles for Stasha Hicks please!"}, {"id": 61, "text": "Nice idea and the actors are playing quite good. The only thing I didnt like was the end... We should see more from what happened with the others. But its worth watching and has a good story behind even is not complete and there are missing some aspects. 👍🏼"}, {"id": 62, "text": "I have never seen which everyone seems to agree that this is a remake. I thought it was very good. Some of the parts definitely stuck to the typical cliches. I normally sit here and can figure out the ending. For once I didn't see it coming. You will just have to rent it and form your own opinion. I thought it was worth the money. You will have to sort it out for yourself."}, {"id": 63, "text": "This story is very unlikely sand unconvincing. It is more weird than scary."}, {"id": 64, "text": "I am a huge Maisie Williams fan, so I was thrilled to see that The Owners made an early release on Amazon, but not so thrilled after I watched it. As usual, Maisie does a nice job, but she doesn't have much of a character to work with this time. I was hoping for things that never happened. I had more fun watching The Babysitter: Killer Queen, which was meant to be over the top bad. Perhaps part of the problem with The Owners is I had a few more expectations. This was a cross between a teen slasher movie and the bumbling crooks from Home Alone. If Maisie wasn't in this movie, I would have had to give it a zero."}, {"id": 65, "text": "After about 30 minutes it just got soooo bad. How is it, that Maisie Williams signed up for something like this? Bad dialogues, bad story, desperately TRYING to keep the tension up, which failed. Not a good cast, annoyingly bad ending. I hated it."}, {"id": 66, "text": "I love this movie, I love movie if the psychopath wins! lol"}, {"id": 67, "text": "End of every single scene, i think, okay.. now its going to be interesting.... Eventually, the end card was displayed and then it was really interesting. Such a worst movie."}, {"id": 68, "text": "Excellent performance by the very talented Maisie Williams. Some of the other cast performed their roles well too.But the direction was sloppy and unprofessional, and the story could have been much better.I hope to see Maisie Williams working in better movies in the future."}, {"id": 69, "text": "One of the worst horror movies i have seen in a long time, couldnt wait for it to end."}, {"id": 70, "text": "The Owners was Well directed well filmed extremely memorable ,great character development and acting, the story was fantastic and realistic. looking forward to the The Owners part 2"}, {"id": 71, "text": "She is only scare thing in this movierespectable her character"}, {"id": 72, "text": "Really enjoyed 'the owners' great effects and storyline and excellent acting from all of the cast. the plot twist at the end gave a satisfying conclusion. Its great to see a decent British horror the pace will keep you on the edge of your seat throughout."}, {"id": 73, "text": "I love a good Home Invasion movie and as good as I enjoyed this film, it's not one of the best ones I've seen but it's got a great cast with great acting. Fairly slow for the second-half of the movie but the ending makes up for it with a great unexpected twist."}, {"id": 74, "text": "A waste of time, simple like that. You hope something that will never happen on this film"}, {"id": 75, "text": "This film start with a bunch of people spying at a house in a car, and a girl Mary talking to them scene! As turnout, this film is about two old kidnappers(Richard and Ellen)ruin the plan of a bunch of thieves try to steal from their house, and eventually they tribute Terry(one of the person try to steal from the house) for the girl they lock in the safe Jane! Entire film full of boring conversation, and annoying overuse scene! Such as, overuse of the singing scene, overuse of the smashing things scene, overuse of the staring scene, overuse of the yelling scene, overuse of the shouting name scene, and overuse of the song playing at the background scene! Make the film unwatchable! Barely intense scene is, Mary killing Gaz with a hammer! At the end, Richard and Ellen rewarded Terry with Jane in the safe! That's it! Wasting time to watch!"}, {"id": 76, "text": "Great little flick. Some twists that i enjoyed. Better than I expected it to be. Thought all the actors did a fantastic job. I feel as if people hate the movie because of the choices made by some of the characters. Maybe I'm wrong. It ends the way a horror movie should. Not a happy ending."}, {"id": 77, "text": "Waste of time Waste of time Waste of time Waste of time"}, {"id": 78, "text": "I can't give a score lower than one.This one is a complete disaster of cinematography and storytelling. The acting is abysmal, as well as the plot.This may be my worst film of 2020.1/10 what is happening to cinema?"}, {"id": 79, "text": "I Liked this movie! Little bit creepy, sometimes more funny. A little, maybe predictable, but fun twist at the end. Overall good acting. I'm a sucker for anything made by the Brits though, I'll take a small British indie ANYDAY over Ocean's pick-a-number or anything else of big budget Hollywood. 10 because it deserves way better than a 4.8."}, {"id": 80, "text": "The wrost movie i ever seen in 30 years , waste of time"}, {"id": 81, "text": "Not a good movie. That's all I can say. Save your time"}, {"id": 82, "text": "What started off as a promising 'home invasion' film descended very quickly into a complete and utter mess. This is just another 'stupid people do stupid things' schlock horror film. The 'fatter' lad has played this same dim character in any film i've seen him in( which in fairness i think has only been this and one other). The 'Game of Thones' Actress shows what a poor performer she is. Sylvester McCoy plays a similar character to his one in Still Game. The story was...well non existent in effect.Poor film. Best avoided."}, {"id": 83, "text": "Believe it or not, home invasion movies are not a new phenomenon. In fact, one of the earliest examples of the genre was silent movie director D. W. Griffith's 8-minute length film The Lonely Villa (1909). Basically, location dictates whether a movie can qualify as a home invasion thriller. If the location is a home of some sort, the film meets the requirements as a home invasion epic. Movies about people stranded in public places, such as either tornado shelters or confined in public facilities aren't designated as home invasion films. Typically, since Hollywood holds little sacred, filmmakers have tweaked the formula so that shelters, hotels, and public facilities stand in as hybrid-home invasion thrillers. A legitimate home invasion thriller must transpire on property which a family either owns or rents. For example, Assault on Precinct 13 (1976) and its 2005 remake aren't home invasion thrillers since they take place in public facilities. As a movie genre, home invasion thrillers-particularly those made over the past twenty years-have waxed increasingly violent, and these life and death clashes tend to be more personal since the occupants are fighting for their lives in a last-ditch effort to survive. Movies like The Desperate Hours (1955), Straw Dogs (1971) and its 2011 remake, Funny Games (2007), The Strangers (2008), The Collector (2009), Don't Breathe (2016), and The Purge (2013) exemplify these violent, personal thrillers with life and death stakes. Mind you, filmmakers complicate the home invasion formula when they divide our sympathies between the occupants and the trespassers. French director Julius Berg's home invasion thriller The Owners plays out at an isolated country estate in England, and daredevil teenagers craving excitement and cash are the perpetrators. Meanwhile, Berg inverts the standard-issue home invasion formula and springs one surprise after another at audiences.The Owners opens with a scenic long shot of the English countryside. Mary Shelley lenser David Ungaro pans his camera 180 degrees away from a mansion nestled in a cluster of trees to a compact, four-door, red car parked on a hillside. Seated behind the wheel is wannabe rapper Nathan (Ian Kenny of Solo: A Star Wars Story), while Terry (Andrew Ellis of Demons Never Die) sits alongside him, and tall, gawky Gaz (Jake Curran of Stardust) babbles on in the backseat. The guys have been getting high while they watch the residence of Dr. Richard Huggins (Sylvester McCoy of The Hobbit trilogy) and his wife, Ellen (Rita Tushingham of Dr. Zhivago) with binoculars. The Huggins are about to depart the premises to dine out. Nathan has borrowed Mary's car, and she insists he return it because she is already late to her job. Mary (Maisie Williams of The New Mutants) knows they are up to no good, but Nathan convinces her to let him hang onto her wheels for another hour. Grudgingly, Mary relents, and the guys cruise off over the hill and break into the Huggins' residence. Gaz is a one-man wrecking crew as he enters the sprawling house and smashes objects, overturns furniture, and basically trashes every room in his search for the fabled wall safe. Terry's mom, Jean (Stacha Hicks of Captain Phillips), is the Huggins' housekeeper, and she mentioned the wall safe to her son. When Terry stumbles upon it, Gaz is frustrated because his safecracking equipment was designed to open vaults with electronic codes rather than a combination dial. This is the first of many obstacles with which these ill-fated burglars must contend. Since he took the car keys, Mary bursts into the house and rebukes Nathan about vandalizing the Huggins' home.The Huggins return home sooner than Nathan expected, and he and his thugs take them hostage and grille the doctor about the safe. At one point, Gaz assumes command of the operation, browbeating Nathan because he lets Mary interfere with their efforts, and then chiding him for his reluctance to sever Ellen's ring finger with a box cutter. Suddenly, Gaz and Nathan tangle in a knockdown drag out fight that leaves Nathan with the box cutter jammed in his stomach. Mary lashes out at Gaz with a sledgehammer, and he poses no more problems for anybody. During this fracas, Dr. Huggins manages to free himself and attend to Nathan. Initially, it looked like these reckless hellions were going to rule the day, but Berg turns the tables.Dream Kids scenarist Mathieu Gompel, High Life scribe Geoff Cox, and Berg based The Owners on Belgian artist Hermann Huppen's 2011 comic book Une Nuit de Pleine lune Translated into English, the title means Night of the Full Moon. Berg never treats any of the revelations in this grim melodrama seriously, and he saves the best revelation for last. Were this movie a success, it would be stimulating to see how Berg could develop a sequel. The Owners constitutes a triumph of style over sadism. Rita Tushingham delivers a feisty performance as the unsavory teens threaten her with bodily harm, and Berg milks these scenes for all the suspense and hysteria he can conjure up. The macabre humor and the witty dialogue take some of the sting out of the sadism.Meantime, the two blood-splattered corpses which they have to step over constitutes most of the gore. Throughout The Owners, Sylvester McCoy disarms our fears as a garrulous old physician who struggles keep everybody calm about their predicament. You almost forget you're watching a vicious horror chiller without a rating as Dr. Huggins putters and prattles about the place. Huggins' rants about an infestation problem with all sorts of creepy crawlies is laden with irony. Without being specific, Dr. Huggins is alluding to the notorious trespassers. Ultimately, Berg and company subvert our expectations in what resembles the aforementioned film Don't Breathe, but from the perspective of the residents who ultimately wrestle the upper hand from their adversaries. Mind you, as obnoxious as these mean-spirited teens are, The Owners emerges as a palatable Twilight Zone take on the home invasion scenario."}, {"id": 84, "text": "This movie made no sense. I am mad at myself for paying to watch this."}, {"id": 85, "text": "This could of been a very good film but nobody turned the light on, so most of the time you can't see anything."}, {"id": 86, "text": "It starts off kinda good but gets dull after that. Plus of this flick are a few funny parts. I rewound a couple of times😄😄😄. 5/10"}, {"id": 87, "text": "Was better than I expected it to be but not what I expected it to be. A few of the scenes made me angry and thought it was stupid"}, {"id": 88, "text": "So much creepy freaky, very cartoonish even. I really didn't know what to think of this by the movie poster itself, and then I thought, why not? It's really fun, and the sound effects and pacing is, well, sort of compressive. A lot of films do this, we have seen it before, but this works well especially at it gets weirder through the film. Don't get salty, get into it, enjoy this horror film."}, {"id": 89, "text": "This movie started off well with some great acting from all concerned; the bad guy was particularly vile and that boded well for a good bloodbath/massacre but it all went downhill rather quickly as nothing much except a bit of a drama out of a crisis unfolded with little to no real horror; more of a comedy with a bit of drama and a smidgin' of horror thrown in for good measure.Sylvester McCoy makes the film and I have always liked him; even as Doctor Who as he brings a lot more to the table than most actors these days but all of the actors were really spot on but they just had nothing to really work with scriptwise and I don't know about anyone else but I figured out what was possibly behind the safe from the beginning so the mystery was gone for me quite early on.Disappointed as it looked like this could be a rival to the USA Don't Breathe movie but it has absolutely nothing in common but it does get an average 5 hatchets out of 10 as it will fill an average Friday nights viewing."}, {"id": 90, "text": "There is nothing wrong with redoing a movie, making an adaptation or making a new film from an unoriginal idea, but doing so not just badly but appallingly is pointless and really an affront to films before it.This film really does a bad job with this old notion of home invasion and the result is fairly difficult to watch. There are some fair performances, by the cast Maisie Williams doesn't really stand out here like she does in GOT and personally her career will flounder and fail unless she goes to America and forgets the British film industry, which she should have done after GOT. Richard McCoy who plays Dr Huggins is probably the worst of the cast followed by Andrew Ellis who plays Terry. None of them play believable or realistic representations performances of the characters and it gives the film a very amateur feel. I think poor direction and screen writing are also to blame here since from the outset all the cast feel like caricatures.The worst aspect of the film is the lack of suspense caused by screen-time padding where characters do unrealistic, stupid or clearly contrived things to advance the film because there isn't much of an underlying plot to work with.To say it's a total mess would be unfair, it isn't. it is good to a point but goes down hill pretty quickly forty minutes in after events take a significant turn. (no spoilers sorry)Unfortunately it's definitely not worth watching"}, {"id": 91, "text": "If you have lived to as old as i am, you will for sure remember the 1970's thames televisions short novel crime series ''tales of the unexpected'', and then you might think what an old sodder i am, but that series took the hold of many peole back then, and this maybe a newave or reviwal of the concept. on imdb its voted low, and i can understand that due to lack of slash and gory horror, and the pace aint high, but its extremely bizarre and twisted in its revenge and conclusions.its a story about 4 friends, one stupid ,one bossy , one psychopatic and a girl with some conscience planning to do a nick on a old mansion somewhers rural britain. but their scouting and surveillance efforts hasnt been good enough sdpoiling more than this would ruin the whole shabang, just say its nifty businessthe acting of the small cast and the choice of locations are brilliant, and the use of miss williams as the female part of the break in squad are just enriching the whole story.the screening format differs along the way, you wont notice so easily but on a small screen it will be visual. the filmography and soundwork, the score and set management do make this a gloryspot of british crime fun horror done the british wayif you are on the pivotal point choosing between this and other british movies of today, this one os clever, there are no way of survival, and how its done is just immense. a recommend from the grumpy old man"}, {"id": 92, "text": "Well, I wasn't really sure what exactly I was in for when I sat down to watch the 2020 movie titled The Owners. However, I was intrigued by the movie's cover/poster, and it definitely had some appeal to me. And it looking like a horror movie, of course I was interested.So I sat down to watch The Owners, and yeah I was entertained by the movie. Writers Mathieu Gompel, Julius Berg and Geoff Cox definitely had managed to put together something that turned out to be interesting. Well, right up to a point, then the movie just started to lose momentum and settled into auto-pilot, then the movie just grew stale. That happened at the stage right after the big reveal of what was really going on.The storyline was entertaining, sure, but up to a certain point about halfway through the movie - as I mentioned earlier. It was a shame really, because director Julius Berg really was phenomenal at setting the stage and lining up the suspense by gradually adding to the story. But once the reveal of the events took place, the air just escaped from the balloon, and the storyline became flaccid and sort of monotonous.It should be said, though, that The Owners is a movie that is driven more by its strong and noteworthy acting performances than it was driven by the storyline. The movie had some very nice actors and actresses on the cast list, with the likes of Sylvester McCoy and Rita Tushingham. But most outstanding was Jake Curran, as he really stole the show with his performance.The movie is labeled as a horror/thriller. I would say it has more emphasis on the thriller aspect than it does the horror. If you expect a scary horror movie, then The Owners is not the right cup of tea. However, if you are looking for a suspenseful thriller that has some punch to it, then this is definitely a movie well-worth watching.I am rating The Owners a mediocre five out of ten stars. I would have given it six, but what happened after the great reveal midway through the movie, it just felt too monotonous and uneventful really. Mind you, this is not a boring movie. It does have some strong and good things to it, it was just a shame that director Julius Berg set the movie for auto-pilot halfway to the finish line."}, {"id": 93, "text": "4.6/10 (the current IMDb rating for this film) is criminally low. I strongly believe this is another case of people not liking character's decisions and blaming the movie for that. News flash: people don't always make the best decisions in real life either. Sure the movie wasn't perfect but for the most part I thought this was a ripping good time.Maisie Williams being in this was what attracted me to see it, but in reality the real stars of the show were Sylvester McCoy and Rita Tushingham. I love it when some older actors are given roles that they can actually do something with. Too often older actors are basically just playing the stereotypical older person, but that's certainly not the case here. They were given great amounts of freedom to work with and they nailed it.This movie was tense, found goods levels of violence without ever being gratuitous, had a feeling that anything could happen and that no character was safe, and had a nice little twist at the end for the cherry on top. Please don't see the rating for this movie and think it is one to avoid. You will be missing a gem of a film. I highly recommend this one."}, {"id": 94, "text": "Sometimes I just can't believe the scores here on IMDb.Don't believe the negative hype, this movie is awesome!Maisie Williams absolutely kills it. I think she's going to be a big deal. She relly is a great actor. 2 seconds after she appears on screen I just knew she would be great. And she was. (she is also the best thing in The New Mutants)Some movies you just like from the get-go.. this is one of those. Mere minutes into the movie I got a really good feeling about it. It just entertained me from the very start. I also got a feeling it might get uncomfortable, and it does.I knew almost nothing about it before I watched it (the right way to watch a movie btw) so I never knew what was going to happen.The performances are great. Maisie WIlliams, as already mentioned, is just fantastic. Jake Curran played the most obnoxious character I've seen in a while. Sylvester McCoy is also a joy to watch. He has that thing where you just want to hear him speak, because he has.. charisma I guess. The rest of the cast is also great.The Owners has a fantastic build up, it takes it's time, which really makes the tense scenes work. And boy is there some tension! I almost got a little stressed a couple times.I loved this movie, even though it didn't quite go where I was hoping for. It just has so much of what I love in a horror movie, some of it I can't get into because I don't want to spoil this little gem for ya."}, {"id": 95, "text": "Looking for a perfect score, a group of thugs breaks into a remote mansion owned by an older couple and begin looting the place, but when the homeowners return early the group find themselves forced to endure a series of nightmarish torture as the elderly owners turn the tables on them.This was a highly problematic and troublesome entry. One of the biggest problems here is the unappealing group of main characters we're supposed to be following around and feel sympathy towards. Brash, arrogant and hot-headed to the point of being caricatures of British thugs rather than real people which makes for a complete disconnect with them the second they show up on-screen, there's never a sense of even caring about their plight with the exaggerated way they break into the house and start tearing things up or even cracking jokes on each other that are in no way funny. Since these are the people we're following for the majority of the film and are supposed to feel sympathy towards once it starts getting crazy, it's a tough sell to get to care about what's going on here. This turns into the other big problem here in the lack of anything original or creative in what's going on. This is entirely predictable and riddled with cliches, from the disarray between the group that puts the captives in charge of the captors, the secretive nature of the elderly couple who foreshadow what's to come, the psychological mind-games that bring the group down as they pit the kids against each other. It's incredibly easy to see where this one is about to go every chance it gets and doesn't do anything to change the script for what keeps happening as the storyline plays out exactly as you think, causing the film to feel incredibly dull and plodding as a result. These are the films' biggest drawbacks while it does manage a few noticeable positives. Among the biggest aspects found here is the fine use of mind-games that come into play which keeps an appropriate air of suspense about their true intentions. While being obvious the entire point is the series of mind-games based on their kindly demeanor hiding their true intentions, the change in tone and behavior becomes far more fun with the aggressive bent to their attitude once it shifts into their darker plans. Enhancing the action with some enjoyable confrontations that make for a fun time here with some extra bloodshed thrown in, although it's too little too late to save this one.Rated Unrated/R: Extreme Graphic Language and Graphic Violence."}, {"id": 96, "text": "I don't know why they keep putting actors from GoT in these terrible movies. From the lousy X-Men sequels to Terminator 5 to countless low budget thrillers like this, I can't recall a single good film headlined by any of these actors, aside from Dredd, which also flopped. But I digress, let's review this film.The script is atrocious. There isn't one likeable character, which makes staying with these characters a chore. After the twist in the middle, the film meanders to the end without any kind of wit or surprise. It's an unoriginal take on an unoriginal scenario done countless times before. From Mike Mendez' Killers to Don't Breathe. The direction is barely serviceable. Not very atmospheric, you have the feeling you've seen it all before. The acting is bad. Like student theatre bad.The first few minutes at least hold some suspense, but if you've seen the trailer, you've seen the film."}, {"id": 97, "text": "I watched this last night and have struggled with my review of it. Overall, I found it to be visually interesting, with some tense scenes especially at the beginning. The acting was very good, although I feel like these characters needed more space to shine - we only get glimpses of brilliance from each of them.There are some truly brilliant moments of direction and acting, and I really wish those were leaned into a bit more. The cinematography was lovely overall but could have used some more time in the editing room - especially the very ending, which felt abrupt and disjointed.It's an exciting film, but not wholly satisfying overall. I loved the portrayals of some of these characters, but they are not done justice in the end. Also, for taking place in an enormous mansion, it felt shockingly small and like the setting was not utilized as well as it could have been. We're stuck in the same few rooms for most of the film, which really brings it down some.I went into this knowing very little, and was somewhat pleasantly surprised, but feeling like it did not live up to its full potential. Not a bad film, but not great either. Wish the payoff was worth the sum of its parts."}, {"id": 98, "text": "1.5 out of 5 stars.The Owners is a home invasion thriller with a twist. Has been done before like The Collector or Dont Breathe. The Owners fails to capture any thrills.About a group of dead beat teens who break into a home. Cant open the safe. So they wait for the owners to come home which is an elderly couple. They threaten the couple to open the safe. Only to come across them manipulating and playing cat and mouse to there twisted torment.Plot does offer some wtf moments. Especially in the end. But the script and direction is so boring. And dull. It is difficult to care for the characters. Or care about what even happens to them.Maise Williams did okay with her cast. While the rest of the cast was forgettable."}, {"id": 99, "text": "Similar concept to other home invasion gone wrong movies. Several differences:(1) None of the characters are likeable. Williams' character comes the closest, but you keep wondering why she's even there, since it makes no sense. I recognize that characters don't have to be likeable, but in this case it meant I just didn't care about any of them.(2) It's not that the characters always make bad decisions, but rather that there's no apparent reason why they're making the decisions they do. It becomes aggravating watching people constantly do things that seem at odds with their personality, and crucially, that discrepancy is never explained.(3) The movie crops the screen to 4:3 (without rescaling) for the last 20 minutes for no apparent reason. I'm guessing it's supposed to look artsy but instead it just seemed annoying.3 stars for good acting and creativity. But overall an unpleasant movie to watch that never makes the unpleasantness, your money, or your time worth it."}, {"id": 100, "text": "REVIEW - THE OWNERSA group of young adults decide to break into the house owned by the village doctor hoping to make some easy money, finding a huge safe in the basement they decide to stay to scare the elderly doctor and his wife into giving them the combination.Superb start with the suspense slowly being ramped up where the elderly couple who you think are the victims suddenly turn the tide on the young adults by......What is in the safe to risk the life of his wife?Great little British film until......Suddenly towards the end tear gas starts to be used and from here on in it honestly gets a little silly which is a real shame because up to this point I was really enjoying this film, why???As we have seen with many films it's as if they have either run out of money or time and seem to suddenly decide to end the film and unfortunately that is what it feels like happened here, such a shame because it was so good at it start middle but the whole ending!!!!! NO!!Don't waste your money at the cinema or paying for this on streaming beverage the ending will sadly disappoint.Rating 6 out of 10"}, {"id": 101, "text": "The Owners is a fine little film with some great elements. The acting was top-notch, as well as was the production quality and the cinematography.The story is sampled from a basic evil owners concept that has been done a million times already. This time the film is mostly carried by the acting and additional subplots that tried to establish more character ties.The beginning of the film was quite engaging, I was interested in what they will try to do with the tired idea. But from the second act and on all the characters just make the stupidest possible decisions and act like children. Most of the things that happen make no sense, they are just there to push the story.In the third act, the film goes into a 4:3 aspect ratio, which is probably due to the fact that this film is based on a comic book or a graphic novel, but all it did was just literally reduce the field of view for me. If I wanted to read a comic I'd read a comic, when I'm watching a movie I'd like to see the whole screen. They were probably trying to merge printed elements with movie ones like in Creepshow (1982), but they failed to justify this artistic choice.The ending was very predictable, and although the filmmakers tried to convince me otherwise, I was just waiting for it to wrap up. Actually, I expected a much worse and more ridiculous ending, but they have decided not to assault my brain with stupidity even more.I can see why so many people hated this film, but I approached it open-minded so it didn't annoy me enough to hate it.5 stars for the acting and the looks of the film, and one star for writing the most annoying and hated characters in the history of cinema."}], "reviews_amount": 102}