{"name": "A Soldier's Revenge", "titleId": "tt09302994", "reviews": [{"id": 0, "text": "The first 5 minutes of the movie told me all I needed to know. It's crap, pure and simple. I've seen 6 year olds act better. I saved 2 hours and 15 minutes I can use on watching something better."}, {"id": 1, "text": "A garbage revenge, is the perfect title for this movie 👍"}, {"id": 2, "text": "I am really surprised how bad this film is. Poor acting, poor direction, poor everything ... Don't waste your time."}, {"id": 3, "text": "I watched this movie because it had high rating on IMDB. It was my mistake. I don't know what is worse, scenario, direction or acting. But the result is not satisfying. Not at all."}, {"id": 4, "text": "Turned it off at the 45 min mark as enough of my time had been wasted."}, {"id": 5, "text": "I found at least 8 bots with one week of imdb as users, rating this movie as 9 or 10. This movie is awful and does not deserve nothing over 4. Check yourself and rate it accordingly in order to teach a lesson to fake reviewers."}, {"id": 6, "text": "Frank Connor (Neal Bledsoe) served in the Civil War, Texas, second rifle. He suffers from PTSD and hunts fugitives. He is impossible to live with. Mr. Briggs (Rob Mayes )is a bad guy who works for the government. He sells rifles to the hostiles instead of settlers. Their lives are intertwined and Briggs wants Frank dead.The plot was weak. Val Kilmer was a caricature. Rob Mayes did fairly well pretending to be Dicaprio, but the rest lacked from a decent script.Guide: F-word. No sex or nudity."}, {"id": 7, "text": "Acting is so terrible. It's hard to describe how bad the acting is. It's like a primary school decided to put on a play.The script is even worse and the plot makes no sense."}, {"id": 8, "text": "Boring and acting was horrible ....I couldn't finish watching it."}, {"id": 9, "text": "The movie was too long more than 2 hours for nothing, and the worst thing is the leading actor is an amateur like he just new"}, {"id": 10, "text": "Boring, nonsensical story. I lasted to almost the 2-hour mark. No build-up of anything, no attachment to any of the characters, silly dialogue. Avoid."}, {"id": 11, "text": "I like a good Western, this is a Western but it misses the good part. It is very slow and I hate computer generated fake gun fire but I know it's cheaper and safer but it looks so bad. As for the actors I did not care for the two children or their mother, everyone else is ok. Good to see Val Kilmer in the film, hard to believe he was Batman now he's an old grandpa. I think I understood the story line, as for watching it I'm not saying yes or no, I watched it once and that was enough."}, {"id": 12, "text": "Please don't waste time watching this movie I am surprised how this movie got 6.1 ratings..It is really bad scene,storyline and bad acting😔"}, {"id": 13, "text": "Terrible acting, couldn't get a grip on the storyline, lasted an hour (only because I wasn't able to pay full attention). Do yourself a favour and find something else to watch."}, {"id": 14, "text": "The hero wasn't Terrible he just had nothing to work with, Kilmer is unrecognizable at best and adds horrible awkwardness, McCord is obviously a model with 0 talent, just wondering who she slept with, must've been Pfiefer? Busey is obviously B movie actor, disappointed. Movie has no redeeming qualities at all. Absolutely like a teenager made a bad western."}, {"id": 15, "text": "I seriously can't tell you what is worse - plot, dialogue, acting, soundtrack or the fact it is allowed to be shown on Prime."}, {"id": 16, "text": "I wonder how much money was wasted in making this trash? Pathetic and boring, bad acting and even dips below the mark of amateur."}, {"id": 17, "text": "Not worth the powder to blow ot to hell. The actors should have been paid about a buck each."}, {"id": 18, "text": "Agree with others that this is a terrible film but although the acting is poor the script they were given is even worse. In any compilation of the worst this belongs in the top tier."}, {"id": 19, "text": "Great story line! had me very engaged throughout the whole film!"}, {"id": 20, "text": "I was expecting a plain old action western and instead got a movie with adventure, heart and a charm that is reminiscent of classic western films! A great story and important subject with a soldier who struggles with PTSD. I would highly recommend!"}, {"id": 21, "text": "I thought the performances were great - especially Neal Bledsoe - the good guy with some personal flaws that make him hard to figure out at first. I also liked the supporting cast - all of them real tough, western-looking characters. Solid performances all around. I thought Val Kilmer's appearance was poignant and very touching. The photography was wonderful, the colors rich and vibrant. I think people who like westerns will enjoy it. The movie doesn't zip along - it takes its time. Many westerns do - nothing happened fast in the old west.!"}, {"id": 22, "text": "I don't usually have the patience to sit through movies that are over 2 hours long. But, this one kept me in the story for the whole time. I was so intrigued with the character Frank and his struggle to deal with his flash backs from battles in war. I don't want to give it away, but there is a lot more than just that going on. Rob Mayes plays a fantastic villain and Val Kilmer is a charming grandpa! The whole cast did a great job and the direction, cinematography, costuming and music are all great! A good date night movie!"}, {"id": 23, "text": "I used to sit around on Sunday afternoons and watch Westerns with my dad. As I got older and moved away, a good western always takes me back to those days. I loved this movie, it had all the good parts of Westerns from the past, with a really current feel to it. Following the story of a Post Civil War soldier and the effects that war can have on a life made for some very powerful messages. I got lost in the scenery, the horses, the music. It was a wonderful afternoon spent."}, {"id": 24, "text": "Whenever we talk about PTSD we often think of the horrific psychological effects of recent wars. This beautifully shot movie shows us that no matter what era, no matter what place, war has a devastating effect on the soldiers and, eventually, on their loved ones. The Western theme is ingenious and the love story is deftly threaded through the horrors of war and the greed on men. I loved the characters; gritty, realistic and believable. Strong performances from everyone; wonderful to see Val Kilmer in such a touching role. The sound production and editing were on the mark, and the score was simply outstanding! I actually found myself humming the love theme the next day. Do yourself a favor, and see A Soldier's Revenge."}, {"id": 25, "text": "Great story and emotionally charged performances by the actors! This is a little gem here!!"}, {"id": 26, "text": "This is such a good movie!!!! Definitely will watch again!! :)"}, {"id": 27, "text": "The actors did an amazing job of bringing all of the dynamic aspects of this movie together! it had heart and a relatability that I was not expecting from a western. Even the music helped pull it all together. Usually it's not something I would notice in a movie, however this score stood out and kept me engaged throughout every scene. Will be highly recommending this movie to many of my friends and family, as well as you! You'll truly be in for a treat with this one:)"}, {"id": 28, "text": "Westerns aren't usually my cup of tea, but I was shocked at the depth of the story! I felt connected to the characters, especially the lead and the uncovering of his traumatic past. The love story was also very endearing and touching. It added a soft side to a usually rough-world subject matter. Do I recommend? Yes!!"}, {"id": 29, "text": "This film is such a gem. It will have you hooked from the start till the end and Frank's story will touch your heart. I highly recommend it!"}, {"id": 30, "text": "I lasted a bit over 12 minutes. That was 11 minutes too long."}, {"id": 31, "text": "Moves along slowly but worth the watch. I didn't even recognize Val Kilmer, and he played such a small role. Hokey everyone rides off into the sunset end but leaves a good feeling."}, {"id": 32, "text": "Its a clear b-movie, loas of cowboys a renegades, with neiter cow or guts. meaness it has but at a shallow depth, the story aint good, the acting likewise, and the big miss in contrary to qverwhelmingly made westerns is the choice of score. my childhood memories wher either a decent symphonical or a crude steelguitar based score. here its just a cheap meeeow of a synthizeiser, that trashes the golden transition from scene to scene.its a blur of close up shooting camera angles, and use of focus is almost absent.the cast would have impressed me if they had it in their eyes but they dont. thats why clint'ern caught his audience, you wont be caught by this.playtime here are 137 minutes, coulve been easily compressed into 85 mins without a problem, so here its quantity over quality believe me. inexperience deluxe from the director and editors, make this sub western saga a blimp and no more than that.its made for the cowboy nerds, and the cast and crews families, a weak 3 for stamina from the grumpy old man saying that watching a bit of bonaza wouldnt hurt. its pretty decent compared to this. recomende?no."}], "reviews_amount": 33}