{"name": "Cuties", "titleId": "tt09196192", "reviews": [{"id": 0, "text": "I watched this because of the fuss over on social media with people wanting to cancel Netflix. The biggest problem with this film is how it was so poorly mis-marketed. The film is actually a disturbing look at a young girl rebelling against her broken family.You watch this sweet, innocent girl fall in with the wrong crowd. A group of swearing kids who are entering a dancing contest. The language changes, her appearance does, her behaviour nose-drives - all the time, she is enticed because of how media sexualises women (models etc in skimpy outfits).Some of the scenes are questionable for sure but I'm not exactly surprised given this is from the country that made Baise Moi. There is no nudity (thank God) and we're shown just enough to know what is going on (such as a young girl taking pictures of her privates to upload to the internet). Unfortunately this is highlighting a real problem in the world though. There are kids doing this because they feel peer pressure. This isn't a make believe film. It's a very real and uncomfortable film. It's deeply unnerving to watch and powerful. I can see why it gets the awards and nominations that it did but - that being said - it is a film I never want to watch again.Bottom line is: keep an eye on your children and the influences that drive them."}, {"id": 1, "text": "I decided to watch Cuties to see what the fuss is all about. While I agree with many reviewers that it is disturbing to see what these 11/12 year old girls are up to, I think it's realistic. I remember being that age, and being curious and trying to find my way. The idea that the actresses were exploited in the making of the film is an interesting question, but not really relevant in the assessment of the film itself. The film is a well done exploration of being a pre-teen/teenage girl in this day in age. For those who are disturbed by it, well yes, you probably should be. But you can't expect to surround girls with images of sexuality and not have an impact on how they perceive themselves and behave. Don't be mad at the film makers for reflecting reality -- instead go back to the media, fashion, social media and all of the other places little girls get their self image."}, {"id": 2, "text": "The movie shows a young muslim girl about 12 years old, dancing and twerking, not listening to her mom and doing things a kid of that age should not do. Really disturbing!"}, {"id": 3, "text": "Sometimes uncomfortable and others too radical, 'Cuties' is a riveting, thoughtful coming-of-age film that portrays a disturbing reality about the the power, the danger, and the limitations of a child's gaze - everything it can discover, absorb, and misinterpret. People should be concerned, not at the movie itself, but at the realities that it clearly reflects."}, {"id": 4, "text": "Things were even this way years ago when I was growing up. The desire to belong and fit in was so important. All important. To fit in was Everything. To be pretty was Everything. Still is. Society creates an ideal of what a beautiful and desired female should be. That ideal is presented to young girls via magazines, movies, commercials, the internet, etc. It's enacted by every one of us every single day when we complain about our weight, when we purchase those special diet plans advertised on TV, when we discuss our beauty spa appointments for botox, when we sponsor our little girls in toddler beauty pageants. WE perpetuate these ideals for young girls and to young girls. One reason this movie is uncomfortable, because it shows young girls dancing in an explicitly suggestive manner. Maybe the dancing should have been portrayed in a more sort of implied manner. But don't fool yourselves if you think that girls this age aren't really doing these things. And don't think they haven't been doing it for years. This is neither condoning nor condemning, only stating fact. The (over)sexualization of females isn't new. Is the other reason this movie so uncomfortable, because it doesn't sugarcoat the subject? The only thing that's changed is the technology."}, {"id": 5, "text": "Shaming this movie for what it depicts it's like blaming a thermometer because it says we have fever. This is just a picture of our horrible reality."}, {"id": 6, "text": "The actresses in this movie aren't even old enough to watch what they are doing on the TV, let alone do it!"}, {"id": 7, "text": "If you haven't seen the final dance routine it will turn your stomach at the close-up crotch and butt shots. There is an 11 year old with her legs wide apart in several scenes. Dry humping and slapping each other's bottoms. The film could have made its point without the inappropriate close filming. I have never been more shocked and angry and repulsed by a movie before."}, {"id": 8, "text": "Once I heard it was a French film it didn't surprise me Americans would freak out. You can have a film about a child killing people including their parents and no problems in America . But put an 11yr old in a dance scene in a movie with mature content and take a few clips out of context and we freak out . It was a surprisingly good film and I'm not surprised on the awards. And after watching it I feel that those that are posting the short clips and pictures of the film are exploiting the kids more than the film does or ever will."}, {"id": 9, "text": "I can understand the reality this movie portrays for young girls (and even you boys), and can appreciate the pressures of today's society that are placed on children. I also understand the argument by supporters of this film which say this movie sheds light on those issues. However, sexualizing children in the way this movie did is not the way to address these issues. I can look past the context and reality of this movie, but can't look past how the director shot this movie and what they chose to focus their cameras on. The message in this movie, if done a little more tastefully, could have been a good one. But it was outdone by the hypersexualization of these girls. IF, the cameras didn't focus on the things they did in the way they did, then I would rate this movie 5 stars. Excluding the major controversy surrounding this film, it really wasn't a great movie, just average. My 1 star rating is because these girls were used in a way they shouldn't have been which was uncomfortable to watch, regardless of how real it may be."}, {"id": 10, "text": "Everyone knows about the twerking scene and them exploiting little girls for the movie. There is absolutely no reason why they had to show the girls twerking throughout the movie. They could've showed the audience or other people reacting to what they were seeing, or have other people talk about what they saw, and no one would hate this movie. But at the same time no one would've saw this movie because there is very little substance apart from the controversy. There is virtually no repercussions for what the characters were doing, the drama isn't interesting or engaging, and overall was just a boring movie. It's clear the director sexually exploited the little girls just to gain controversy and get people to watch the movie. It's sad and disgusting."}, {"id": 11, "text": "Thanks to all of the insane outrage associated with this title, I got to watch a very decent movie I most likely would have not watched otherwise. The film is shot from the perspective of an 11 yr old girl desperately trying to fit in, culturally, socially while having to navigate through the confusion of her changing body and everything that goes along with it. The film illustrates that, in reality, neither culture (traditional African Muslim vs. modern Western European) is particularly friendly to women and their bodies and this reflects heavily on young girls trying to find themselves and their place in this world. Yes, we live in a misogynistic world and the outrage surrounding this movie only proves the point. It seems that we can't even have an open and honest conversation about how young girls get to experience the world around them without people losing their minds."}, {"id": 12, "text": "I went into this movie expecting to be disturbed. I'd heard all of the commentary on it, but I wanted to watch the film in its entirety before passing judgment.This movie is actually very impressive. The acting is incredible; the directing and cinematography are great. The message is important. Despite what people say, at least 50% of the film is about a Muslim family's customs, traditions, and lifestyle. The other half is about a young girl rebelling.The startling imagery is meant to be just that - startling. It is meant to send a message to the audience about the way sexuality permeates younger and younger demographics.In conclusion, I did not expect to be impressed but I was. There is a lot more meaning to this film than what the critics are claiming."}, {"id": 13, "text": "As seen backlash for this film due to its very misleading trailer, and after seeing the film, it is far better and less racy than expected. Much of the hate seemed to stem from people judging without having actually watching the film.As the film it may be quite uncomfortable at times but as a whole, the acting and storytelling is quite engaging and keeps us entertained. It is more of a film of a young and innocent child being exposed and rebellion from a broken family due to peer pressure by exposure of other more mature girls. This may be a star turning performance by the lead actress.If you watch the film with an open mind and put your biases aside, you can see this is a well made film and the message being sent is evident. There is a reason as to why this film has been praised by critics and is receiving strong reviews."}, {"id": 14, "text": "Lost in all the hubbub here is that the director is attempting to depict a real problem faced by many girls in societies that have customs that we find objectionable. She should be commended for her effort. The idea that the girls are being exploited is absurd. Many of those here that are being critical would probably object to the girls gymnastics tournaments that my daughter performs in. If someone is looking for something to object to, they can always find it."}, {"id": 15, "text": "This movie was really good. It's message is trying to tell parents that this is reality. Wether you like it or not this is the world we live in. Amy is confused about who she wants to be. In the end she chose correctly. I have no issue with this movie and if you haven't seen it then don't comment on it. Tim Treakle"}, {"id": 16, "text": "This film delves deep into the repercussions of young women being left with little to no guidance other than media, as well as what sexual repression in religion can do to a child entering the beginning stages of puberty. Fighting to be noticed and taken seriously, these young women end up doing the opposite, their acting out can only get them so far and they learn the hard way. We also get a great insight look into bullying culture in the age of social media. It is a cautionary tale with a surprisingly freeing ending."}, {"id": 17, "text": "A real representation of the modern day influences of music video and social media culture on children and adolescents. A well made movie that rightly makes the viewer feel uncomfortable. Rather than attacking the movie and it's makers perhaps more needs to be done to address this discomfort in real terms to preserve the innocence of young girls and boys.I enjoyed the Senegalese Muslim cultural influence on the movie and would have liked the movie to explore the topic of polygamy in more detail. This is especially as the behaviour of the main chatacter Amy/ Aminata was influenced by her father's impending second marriage with herself and her mother expected to attend and welcome the second wife into their home."}, {"id": 18, "text": "That middle school relationship infightings...I remember those times. The film performance is not very mature, but you can see it portrays to the audience this kind of dance competition, this form of dancing, the hypersexuality derived from a society that objectifies women and its influence on young and growing children. Why do these seemingly commonplace social phenomena give the audience a sense of discomfort when they're reflected in children? Afterall, we are the models upon which kids learn how to conduct themselves. Should we feel normal for this kind of universal hypersexual performance in adults?"}, {"id": 19, "text": "Worst movie ever seen , violence and harmful sexuality content"}, {"id": 20, "text": "After seeing all the outrage and disgust on social media and elsewhere regarding Cuties, I watched Cuties with the mindset that it'd be terrible based off the trailer. After watching it, I can honestly say it really isn't that bad. Everyone that's commenting on it has not had to grow up with social media and felt a collective pressure to fit in.Most Gen-Z can probably relate to this movie in that the main character felt the need emulate what she was seeing on her screen. She along with the other girls in the movie were just doing what they thought it'd take to win. Not only that, but Amy was doing it to rebel. She's growing up in a Muslim Senegalese household, by nature it will be very traditionalist and conservative.This along with the apathy she receives from her mom and her overwhelming need to fit in with the other Cuties (the friend group) serve as the catalyst for her behavior.She wants to reject the traditionalist and conservative mindsets forced on her by her family so she turns to Western hypersexuality. This is where things start to go downhill (for the viewer and Amy).Even though I am gay, I still felt uncomfortable watching tween girls touch themselves and dance provocatively. Anyone would. But, that behavior is becoming increasingly more common in today's society. I think that's what the film was trying to comment on, young people (especially girls) feeling the need to copy what they see in the media in order to fit in, but it was sadly mistaken as an attempt to normalize pre-pubescent sexual behavior.In the end of the movie, we see Amy reject the Western hypersexuality and the traditional, conservative ways of her family. She just wears a shirt and jeans. Nothing outrageous like in other scenes of the movie. She'll take her own path, not one decided for her. The scene of her jumping rope and gradually jumping higher up is sort of a metaphor for her being able to break a glass ceiling of sorts now that there's nothing holding her back.There are of course things wrong with the movie. There were a lot of plotholes and things that weren't fully explained. Also, the scene where the girls danced for a middle-aged man was very......honestly, uncomfy. I've seen a lot of the things that happened in the movie in real life, but posting sexually explicit pictures for EVERYONE to see? That's new. Those were really the only things that I found wrong.If you watch this movie with an open mind and no preconceived notions, you'll really understand its message.All in all, this movie is probably 7/10, in my opinion. If the plot was better and more things were explained and it was more tamed, I'd give it a 10P.S. To all the hypocrites who say you don't need to depict sexual behavior to comment on it, where's that energy for Toddlers &amp; Tiaras where there's little girls wearing veneers and fake tans or for Unbroken, where the prisoner is tortured? No one is required to depict anything in anyway, it's done to convey a message."}, {"id": 21, "text": "I took time to watch Cuties last evening on Netfiix. The right-wingers are on an all out campaign to destroy this film. It now has a 2.6 rating on IMDB--the lowest I've ever seen.This film is a very well done coming of age story about a 11 year-old girl growing up in a observant Moslem family in a Paris suburb. Her father has taken a second wife and she is searching for her own identity. She gets involved with a group of girls who behave and dance a bit outrageously.Yes, the dancing is suggestive but clearly a mark of adolescent rebellion and very much of today. The acting, script and production values are first rate as is the resolution of the story. I highly recommend this film."}, {"id": 22, "text": "The movie tried to send a message about the dangers of child molestation, but it failed miserably. I do not recommend watching the movie. The movie was a waste of my time. I hope Netflix focuses on making works of the level of the Irishman and marriage story instead of this bad movie."}, {"id": 23, "text": "I'm not gonna talk about exploitation etc. There's been a lot of films that have done worse. This is a foreign film. Wasn't well received in America.With that out of the way, this film... is not good.I liked that it explored a young woman heavily affected by modern day influences of a hyper-sexualized society BUT like all these movies that get lost in the focus, it just didn't have adequate balance. There's very little integration of the characters into school life which makes school just seem like a prop more than an environment that should have an effect on these girls.I also feel that the plot could have used some work. I'm left with a sour feeling at the end... So you mean to tell me that your aspiration of being a sexy popular dancer girl was thwarted by some glitter!? It doesn't make sense. Her reason for breaking free from influence was weak and ill-timed. I'd have made it so the previously ostracized girl partially avoids getting pushed into the water and, using her bigger size, overpowers our MC and says something that triggers her to reevaluate her position in the group. She'd then meet the crew, face hostility, have friend mitigate hostility while saying more stuff to prompt reevaluation, and then the crowd reaction to the suggestive performance would be the final nail in the coffin that prompts her to return home.Also, about the return home... WHAT? Why is the mother calming the aunt down? Didn't she get really cross with the daughter and combo-breaker her??? It should have been the aunt calming the mother down and, in combination with seeing her daughter's tears, the mother eventually doing so.Another point is the phone theft. I like that the daughter did it. It shows youthful impulse and desperation. I just think that the guy who got robbed should have been an older gentleman. He looks young enough to know what find my phone is.I don't like that the camera overdid the panning in on the provocative shots during the dance. I feel it should have just been done without the focus or less focus than it had been BUT that may be me affected by current sentiment. I'd like to think not though. I also 100% DID NOT LIKE the fact that she was willing to give herself to the phone guy for the phone. She is just a kid, not an experienced hooker. An adult is upset at you and is approaching you demanding and making an effort to take his phone back. As a kid, I know my reaction would have been to either run or freeze up and return the device. Both scenarios would involve crying and begging him not to tell my parents.I also had a problem with her dropping her mother's phone out the window. She should have gotten that whoopin. This film was dubbed. The dubbing was extremely poorly done. I didn't watch this off of netflix but from what I saw and understood, netflix version was dubbed. Piss poor dubbing left me somewhat disconnected from the film.I also felt that the only parts that should have been a cause for concern is the attempted seduction of the phone chap and the intensely provocative performance not expected from young girls at the end. The rest of the film with the girls dressing too big for their age and the exploration of sexual themes and the bullying scenes are things I've seen similarities of. HOWEVER, we'd notify the parents (was teaching) and send these girls home if possible. It would have been good to see them getting in trouble with how they were dressed. Schools do that a lot. Again, school should have been a proper environment.All in all, the film was pretty bad plot-wise for me. I don't like how the resolution tried to be all cutesy. NO. You just messed your friends' hopes and dreams. NOT COOL! She also stole money and a phone and should have gotten whooped. In addition to this, she went missing during a wedding (her parents don't seem to care much when she comes and goes). Dubbing was awful and it just felt robotic and unrealistic at times. Disappointing film."}, {"id": 24, "text": "The movies showcases two young girls in bad home situations, and how the lack of parenting skills and the normalization of sexy behaviors of pre-teen girls could cause these girls to look for approval in other not-so-nice situations. Pushed on society by marketing and in social media 'likes', with Toddlers in Tiaras type shows and back to school tshirts for young girls, cropped and stenciled with Sexy shows how this behavior has become normal. This movie is a dire warning on how this could happen to your child."}, {"id": 25, "text": "The decline and fall of any empire starts insidiously. No one notices. But by bit. What was condemned is all of a sudden ignored and then eventually tolerated. Suddenly it's encouraged and no one even noticed the transition. Well I have. You want to know why I cancelled Netflix? My tiny contribution to saying enough.Here's my warning.As consumers of entertainment, we need to band together and demand that producers of the muck ladled our to us pulls back from the brink a bit. We want new stories, decent scripts, and engaging characters that don't have to resort to filth to evoke emotion. The best art is subtle. We've lost that. It's hideous."}, {"id": 26, "text": "Beautiful film about a French Senegalese 11 year old with a touch of magical realism. Watch it before you draw any culturally inadequate conclusions from what certain people in America have said about it (have they even seen it?), completely denying the realities of life."}, {"id": 27, "text": "This is an award-winning film that shows the coming of age of an 11 year old Senagalese girl. She doesn't want to follow her families traditions and latches on with a group of three classmates to try to win a dance contest. It's a film that can be a bit uncomfortable at times, but that's what life often is for 11 year olds. There is a dance scene that's no different than hundreds of YouTube videos of tween dance contests. If I had an 11 year old daughter, I would encourage her to watch this with me. It's an excellent film."}, {"id": 28, "text": "After fully watching the movie Cuties, I found it to be far more inappropriate than I initially imagined. It sexualizes children under the guise of coming to age story. There are several dance scenes in which 11-year old girls are doing acts that are highly sexual in nature, such as grabbing private parts, sticking their fingers in their mouths in a seductive manner, biting theirs lips, bouncing up and down from the floor on their knees, and twerking while the camera deliberately zoomed in on such acts conducted by these children. It was not only disturbing, but sickening to watch kids do things that no kid should ever do. I am beyond shocked this type of acting was allowed by children in the entertainment industry.My take on this is that this show sexualizes and exploits children for the sake of making a film and I would not recommend it to anyone."}, {"id": 29, "text": "The movie is so miserable I mean .. the idea of sexual exploitation of children is a forbidden idea for all cultures and religions .. Underestimating such a thing is a thing at the top of ugliness"}, {"id": 30, "text": "The girls in the movie are elder than 11 years old while performing an 18 years old movie. No way child's will act this way, those scenes are not child friendly"}, {"id": 31, "text": "This movie is so bad . It's ideas made me want to vomit everytime I saw the screen , this movie shouldn't have been made to begin with ."}, {"id": 32, "text": "If you watch the film with an open mind, it is a very well done critique of our society and our youth is sexualized. Yes, there are uncomfortable scenes in that are very much meant to be uncomfortable to watch as that really is the only way to effectively get the message across.Without those scenes, people would be ignoring this and its very relevant message. The vast majority of the claims I have seen out there are false, as there is no under aged nudity or sex scenes. In fact you can go to Youtube and finds hundreds of videos with far worst sexualization of young girls, often younger than 11, called cheer competitions, as well as there was a reality show I just found out about called Dancing Moms that was far worse as well. There is nothing new in this film, but it wants you notice it and get you thinking about the issue as it points the finger about how society is failing in this area."}, {"id": 33, "text": "The movie attempted to show case, which is understandable. But a rated MA 15+ movie acted by 15- kids that pushed toward child pornography did not make any sense to me at all... Using female bodies (especially kids) to make money is not acceptable at all."}, {"id": 34, "text": "Don't usually review movies but when i saw this movie i realised 90% of the ratings here are ratings of morals and not of the actual movie. The acting is top notch and that is also considering the majority of the actors are young, the adult actors are on the same level, believable and well scripted. So far as the plot i believe this an all to common environment for young girls which i think most people see in their community's so it is not as if this movie is extreme or out of place or the like just a reflection of the current society."}, {"id": 35, "text": "The movie is very dangerous for children that gives bad idea and bad behavior unfortunately I didn't expect that bad , extremely sexual behavior for children and all parts of the film doesn't have any idea , the main actors are children and the movie +18 how come? I hop that Netflix will remove it from there list."}, {"id": 36, "text": "It was cringey and the storyline was lacking.A young black girl named Amy who has a conservative background is interested in dancing after seeing four girls dance. She meets one of them who wears glasses in the laundry room.This girl irons her hair on the table and dances provocatively. This perks up interest for Amy, as she imitate her moves and ironing later on.The girls egg Amy on to take a picture of a boy using the urinal.Amy starts wearing crop tops and short shorts.The mother is devastated over her husband finding a second wife.Amy introduces to the girls twerking. Amy also gets her period and the aunt chuckles seeing her stained jeans.Amy gets laughed at when during a fistfight, her pants get dragged down and her panties and bum are exposed. This gets the Cuties to go shopping and buy panties and bras using money Amy took from her mom.On the day of her father's wedding, Amy goes to the competition. She pushes the bigger girl into the water and is dressed in purple. Purple hair and makeup as well. She stops during the performance and runs back home. Her mother is dressed beautifully in golden. Golden eyelids, dress, accessories. The wedding baskets look beautiful too.Amy is unable to continue the performance with the Cuties on the stage and runs back home.Amy dresses in modern Western clothing and goes outside to skip rope with other girls outside her building."}, {"id": 37, "text": "If I could rate it 0, I would, bad movie, bad story, making kids do 18+ things, it's just messed up movie"}, {"id": 38, "text": "Every thing is bad and disgusting The conservative families could be from different religions I don't know why they choose Islam"}, {"id": 39, "text": "When I first saw the advertisement for this film, I thought just another dance teen movie. Far from that! I only watched because of all the controversy. I agree, Netflix was shady for their initial portrayal. I agree, the dance sequence at end of film made me uncomfortable as grown woman. But truth! This is what our young coming of age girls are dealing with in adolescents. WAP! Need I saw more?! This film dealt with so much more. Culture, religion and adolescents as a young woman. It worth a watch! These low ratings are coming from the awkwardness of dance, not the subject matter of the film."}, {"id": 40, "text": "I liked this movie and thought it did a good job of showing how the girls didn't really even understand why the dance moves were sexual or what that even means.They were all interested in being liked and fitting in. I love how in the last scene it shows Amy's dance outfit and the dress she was supposed to wear to the wedding side by side, and she was finally wearing something modern and age appropriate as she went to play jump rope and go back to being a kid.I can understand why people didn't like it or were made to feel uncomfortable. There were some similarities between this movie and Thirteen in the coming of age story. Child beauty pageant stars and dance crew members do these kinds of moves all the time and people don't seem so outraged. .. which I believe was part of the message."}, {"id": 41, "text": "Disgusting, Lots of inappropriate shots, just Disgusting ,that's all I can say."}, {"id": 42, "text": "It's well-made and depicts a very major issue in real life. Kudos to that. But I have a problem with how they produced it. Some of the nudity is, arguably, excessive; they could have portrayed the issue without as much. It also opens up the possibility that the child actresses are being exploited."}, {"id": 43, "text": "It's sad the number of people giving one star who admit to not watching this film. An adolescent girl tries to navigate puberty, family issues, and a new culture with nothing but media as a role model. She is drawn to the toughest, coolest girls in her school and emulates and then eventually outdoes them trying to fit in. The story is difficult and your heart aches for young Amy. There's nothing salacious about this film, it's awkward and painful, as is the journey of the protagonist. This same story plays out over and over in the US for young girls, so I'm surprised that rather than face this as an issue, people are reacting with outrage. There's nothing titillating about this film and the dance moves and costumes are no more explicit than what you often see teen girls wearing or doing in pageants, dance recitals, or high school half-time shows here. The ending is also an incredibly hopeful turning point."}, {"id": 44, "text": "I just finished watching the film in its entirety. Outside of the dance scenes, this is an incredible film. The acting was amazing and the story was very compelling. I empathize with Amy and her friends. My heart broke for her mother's struggles. The cautionary theme surrounding the effects of technology and social media on pre-teens was on-point.That said, the dance scenes were downright stomach churning and, in my opinion, did not need to be anywhere near as graphic as they were to support the plot. I'm not going to pretend that pre-teen children aren't beginning to discover their sexuality at this age. It's a natural part of life and, in an appropriate fashion, is reasonable to address in a coming-of-age story. But to have child actresses dance more provocatively than many women in music videos crossed the line and ruined the film for me."}, {"id": 45, "text": "This is such a beautiful movie. Remembering myself as an 11 year old girl, I completely relate to this. This is close to REAL life and how I experienced pressure over my peers, my looks, internet culture and being seen as a 'cool woman' during that age.The dances are uncomfortable to watch but I remember being pushed to dance similar like that when I was younger, trying to mimic Beyonce and Shakira. It's probably even worse nowadays cause of this social media 'sexy influencer' culture.This movie basically speaks a big message. That yes the world pressures females either young/old to be hyper sexualised. But at the end of the day, we as females can choose to fight these pressures and expectations to be ourselves.To choose to take it slow and grow at our own pace.The story is worth watching and left me crying so much.Especially for POCs with immigrant parents."}, {"id": 46, "text": "I watched it. It was cringey at times - an not because of the dancing scenes only - but mostly raw and real. It doesn't deserve the backlash it got. The scenes can be seen as both playful/clumsy and sexual, depends what your mindset before seeing the movie is. If you were poisoned by the media and online faketivists, it'll look like sexualisation. If the poster would have never come out, possibly there'd be not more than like a couple of offended reviews about the dancing scenes.And you know what? I'm glad it got the backlash, because these online fighters will in a matter of weeks find something else to be offended about, while the rest will give it a try and see it for what it is."}, {"id": 47, "text": "Spoilers ahead...I actually thought this was a good movie personally, it's just copped a lot of flack because of how it was advertised on Netflix. The story itself is actually a rather layered one, and I'll admit that there a few scenes that definitely could've been toned down and still kept the story complete (eg Amy showing her vagina online, or the unnecessary close ups of the girls while they were dancing), but it was still good.The plot itself...I think it was less about the dancing and more of a coming-of-age story. 11yr old Amy is trying to find herself and feels that she doesn't belong in the conservative Muslim Senegalese world with all its customs and rules her Auntie so badly is trying to enforce on her - and that her mother wilfully accepts (to the point of even putting on a happy face when she finds out her husband is bringing over a second wife from Senegal). So she rebels by joining the most opposite community she can find - a dance group at school called The Cuties. They don't cover their bodies and insist on looking much older than their actual age, they talk back to everybody, they constantly get into trouble, and they freely discuss the fact that a lot of them have already hit puberty and are interested in the opposite sex. She's fascinated by them and enjoys spending time with them, but never becomes close enough with any of them except one (Angelica) to ever even hint about any of her home problems. She also finds herself struggling to fit into their world too as she doesn't understand the rules (eg how to speak to boys, what to wear, what is and isn't ok to post online) that the other girls just assume she should know. She seems to find something of a happy medium at the end, having felt free to make a choice for the first time openly not as a Senegalese daughter in the community or as a member of The Cuties, but just Amy. There's some unresolved threads, but it feels okay. It feels like a real life ending. Like she's grown a little and has decided to just take things one day at a time."}, {"id": 48, "text": "After reading all these comments about Cuties i had to watch it to see for myself if Netflix would play a movie that promotes abuse of children and as usual people got it dead wrong. I dont know how many persons actually watched the movie before jumping to conculsions but this movie shows how parents are be so wrapped up in their own worlds till the dont even realize their kids are hurting or struggling. Its so powerful and has such a strong message for parents of pre-teens. To buy into what people that obviously have not seen this movie is just absolutely silly. I would recommend this to all parents raising pre-teens."}, {"id": 49, "text": "I honestly decided to watch this movie because of the whole cancl my Netflix bull. This is a beautiful story. It clearly shows how social media and music influences our youth. This was in no way a movie for pedos. Films like Taxi Driver, Lolita or Thirteen are far worst based on theme. Taxi Driver has a 12 year old prositude. Lolita tells the story of a man and his sexual relationship with his 14 year old step daughter and Thirteen tells the story of a 13 year old girl and her getting evolved with sexual activies. So Cuties and showing girls dancing like what they saw in music videos and dressing like girls dress today doesnt deserve the backlash its getting but praise for showing us whats going on with our youth."}, {"id": 50, "text": "When I watched it I set aside all the mad things people said about the movie and only based it on the message it was trying to send. Before watching i knew the message was a coming of age story and breaking tradition. But boy oh boy did it mess that up. The whole movie was about how she didn't like her family life so she found girls who twerk. I found it disgusting and terrible. The whole message I got was that they wanted to sexualize kids. It was messed up and Netflix should take some responsibility for allowing this on their streaming service."}, {"id": 51, "text": "I'm gonna come out and say it - I liked this movie. Now before you come at me with pitchforks, hear me out. I really appreciate this movie's message - a coming of age story that tries to address the issues of child exploitation and the sexualization of young girls. I was honestly greatly reminded of my own experiences in middle school and high school - I remember knowing quite a few students who were similar to the Cuties: the popular girls who tended to be rather promiscuous and went out of their way to try and act more adult than they actually were.I genuinely enjoyed following Amy's character arc - like any girl her age, she desires acceptance from her peers and a sense of belonging. The Cuties have seemingly achieved these goals, and so Amy is driven to try and become one of them. She starts acting more rebellious and more openly sexual, because she thinks that will garner the approval of her peers, since it seemingly worked for the Cuties. Eventually Amy realizes that being a Cutie does not make her truly happy, and she decides to go back to being a kid again. The final scene of Amy going outside and playing jump rope with the other kids genuinely made me feel happy.But as much as I admire Mignonnes for the story and lessons it's trying to tell, I am not very fond of how it was told. In trying to criticize the exploitation and sexualization of young girls, it ends up exploiting and sexualizing young girls - the very thing it is preaching against. Usually in movies teenagers aren't actually played by teenagers, especially in movies where those teenagers are shown doing more adult things like having sex. I'm not sure why the same couldn't be done for Mignonnes. It was completely unnecessary to cast actual young girls in a film that focuses on how young girls tend to be sexualized. I honestly feel awful for these poor actresses... I can't even start to imagine the kinds of things people say to them. And let's not forget the Netflix marketing disaster.In conclusion - I respect this movie's story and message, but it should have been handled A LOT better. I do not recommend it; the story is not worth seeing actual young girls being exploited."}, {"id": 52, "text": "Peer pressure in the world of social media, a clash of cultures, the agony of your father taking a second wife. Exploiting young girls? No worse than any Miley Cyrus music video. A great coming of age film with talented actors"}, {"id": 53, "text": "This movie has very disgusting content, like the actresses twerking and other horrible stuff. I recommend everyone to avoid this movie at all costs."}, {"id": 54, "text": "I barely was able to finish this movie. The sexualization of these 11 year olds is awful. The dancing, costume, and camera work is what you would normally see of 20 year olds. I felt uncomfortable watching it at times. Netflix needs to take this down."}, {"id": 55, "text": "This is Horrible, worst if you're a man seeing kids dancing like showing... man this is crazy."}, {"id": 56, "text": "No other words. Absolutely disgusting. Netflix bye bye."}, {"id": 57, "text": "I watched Mignonnes. I watched it afraid of the outcome. I watched as a Conservative who LOVES movies. It is a Beautiful work of Art. Kids &amp; Teenagers will only imitate what society sells as Trending. This movie is about staying a naive child, and jumping rope while living in a world of Social ratings, Cardy Bs and WAPs. Even more if they have broken families, or social issues. Stop repeating without checking first. Finish the movie and then decide. Dont blame the director who shows you a mirror."}, {"id": 58, "text": "No stars. I rate this movie a zero. Low budget trash depicting very young girls in a vile and disturbing sexual manner."}, {"id": 59, "text": "If the cast were male it would've been a non issue. I've seen reviews saying to cast the 12 year old girls with 18year olds? How would that work exactly? With all the controversy I thought I'd see something worse than what's on 10 million tik tok accounts. There's never anybody screaming to cancel tik tok or periscope or twitter or Facebook or instagram for the same reasons they want Netflix canceled. What the lead character goes through with her ultra religious and conservative traditional mother is heart breaking. And she gives a fantastic acting performance. I would've never have heard of this movie or seen it if it wasn't for people losing their minds over it."}, {"id": 60, "text": "...that are in the age range that they actually come of age in: 10-13 years old. So in that sense Cuties is both a rare film and an important one (would recommend to parents and their daughters).It's not as risqué as its made out to be. I was prepared to not even make it through the film, much less like it given all the outrage. Like it was a Lars Von Trier, Larry Clark, or Vincent Gallo movie with 11 year old girls.Now don't get me wrong, there's definitely some age inappropriate dancing in tight outfits but any normal adult male who can contextualize little girls for what they are, young children, not sex objects, should have little to no trouble sitting through it. Who knows you might even like Cuties. It's a good film and speaks to an segment of the population that is not given these types of stories."}, {"id": 61, "text": "It's not exploitation and nowhere near it. The movie is simply bad. There is no real friendship between any of the girls to speak of. They all seem horribly conceited and more concerned with winning a dance contest than anything. By the end of the movie, you don't even know if they wont the contest that the entire fim was about. Maybe the main character slightly evolves her moral compass at the very end, but there is no evidence of it... This movie is absolute garbage."}, {"id": 62, "text": "Wanted to give this movie a fair shot but the dance scenes are disgusting. I literally felt sick to my stomach watching them exploit these young girls in such a sexual way."}, {"id": 63, "text": "Darn disgusting....first time I have ever wished I could give something negative stars.People hosting/streaming this garbage should be ashamed....."}, {"id": 64, "text": "In fact, the reality is even more unbelievable than the film, there are some things that Maïmouna Doucouré couldn't depict in this film, she only vaguely brushes the surface. She shows what could happen rather than what happens, and that is a strong point of the film because there is no need to fall into what some might have considered a paranoiac case studyHowever, the way it filmed divided me, there is too much to make a light-hearted film, but not enough to revolt.Indeed, this is not a masterpiece, but I think that everyone should watch this open-minded."}, {"id": 65, "text": "Beautiful film highlighting unsentimentally the impact of trauma and poverty combined ."}, {"id": 66, "text": "First, ill point out what is the main issue here, it's unnecessary low age of the girls, they would make the same point of girls was at least 14 years old, 11 years is way too young, however we could find out that in some Muslim societies young children of that age are already given to the future husband and they are ready for the marriage which makes Your blood boil. As for the acting, cinematography, editing it is 10/10 very well done indees"}, {"id": 67, "text": "Absolutely garbage and should never have been made"}, {"id": 68, "text": "This is not by any means a 1 star. It's a 0, Don't watch it."}, {"id": 69, "text": "There comes a time in all forms of media consumtion, when you are so utterly shocked by an event taking place, when there are so many things wrong with it, that you don't have words and just Scream: NOUGH!!"}, {"id": 70, "text": "The movie is good. The thing reflects a horrible problem: the objectification of the female body. The way it does that works dramatically and portrays a horrible reality many women suffer everyday in the banality of social media. The movie shows how these social networks are toxic specially for young women. All of you people saying this is child exploitation you clearly haven't heard about Maladolescenza, a real child exploitation and very wrong movie."}, {"id": 71, "text": "The film is indeed a beautiful portrait of a girl who is in a certain conflict between the traditional world in which her mother grew up and in which her aunt forces her to become a woman and the world that social media more or less gives to a generation of young girls. In other words, it offers the viewer a view of the world of a girl who is sensitive (like so many girls) to the world presented in social media. Whether or not driven by the inherent insecurity (for whatever reason) that seems to be common to many young girls. A certain promiscuity is an expression of this in this film. Anyone who watches the movie will see a portrait of a beautiful and powerful girl who will probably eventually navigate between these Scylla and Charybdis. A very beautiful and especially brave film ... with a beautiful transcendent ending"}, {"id": 72, "text": "This is a brilliant movie.Period. It is very deep,sincere and creative.I dont spoil anything but people who are criticizing this movie are just out of fashion. Anything new must be confronted by these old people,but eventually good things get through.Just watch it and free yourself!"}, {"id": 73, "text": "Cuties is an excellent coming of age film. Amy is trying to find her place in the world and joins a neighborhood dance group. The girls don't know what they don't know and make significant stumbles along the way. Kind spirited and engaging, I like this film."}, {"id": 74, "text": "I think it's a great movie and people who criticizes are not familiar with conservative and non caring families' children's struggle to fit in the society. It's a sad story because it shows us how the popular culture affects children's psychology and attitudes. I really don't understand people's perception of child abuse about this movie since we're always exposed to rape or murder scenes in movies but that doesn't mean that they are justifying murder or rape."}, {"id": 75, "text": "I suspect Cuties needs no introduction (or Mignonnes if you want the real title). It is the most talked-about, attention-pleating, and tumultuous film release to not get derailed by the COVID crisis, either through delays in production or unnecessary ones in distribution (unnecessary because, I assure you, streaming will do just fine while crowded multiplexes are unsafe). The movie, which appeared to sexualize underage girls, was devastatingly mismarketed by Netflix and it was too little too late when we learned that the movie itself is being ironic.Yes, this strange French film is actually about how wrong it is to rob kids of what little innocence modern pop culture and social media let them keep; to dress them up in stripperesque outfits and have them shake what their mamas indeed gave them. Syke, b-tch! Bet you thought this film about twerking 11-year-olds was really about twerking 11-year-olds.I'll talk about the satirical effectiveness of the material later in this post. First, let's be fairer on the plot and what it actually is: in Paris, a young refugee girl (Fathia Youssuff, who acts just fine) is invited to her more free-spirited neighbor's twerk group (reminding me just slightly, but still too much, of the Swedish film Kidz in da Hood). This product of a hypersexualized culture seems antithetical to the values the girl was taught by her devout Muslim mother, particularly those about the subservient female role, but the defiance adds to her fascination.I can honestly see potential in this premise, mostly due to the short-circuiting that may occur in political spheres. And newbie director Maïmouna Doucouré does indeed confront the popular false dichotomy between promiscuity and religious cowls. The movie sometimes works as a shocking, Larry Clark-style coming-of-age saga but I posit that delivering this message by doing the very thing you're condemning is unlikely to result in much, outside of the online drama that indeed transpired and didn't end well for Netflix.Some have argued, nonetheless, that Cuties ain't no biggie because it isn't the end of the world that young kids become aware of sexuality, or even erotic dance routines.If Cuties does intend to satirize the very sexualization it itself is guilty of (which I might've found more admirably f?cked-up if it was clearer or more outwardly dismal, à la perhaps the Paris Hilton episode of South Park), the confessed intent may not be enough. If Neo-Nazis can't tell facetious Hitler salutes in a YouTube video from the real deal, why did Cuties come to pass? And how?You aren't going to stick it to the pervs or Spaceys by giving them what they like and then going this is actually bad, nor is every critic who defends this movie aware that it's being negative - rather than a defiant display of child sexuality, as one critic named it. The problem is too real to be efficiently addressed with mere irony (that isn't always legible in an occasionally upbeat text), but I will say this: it might be part of Doucoré's point to show how one film so easily can add gasoline to the flames.Yes, pedos may roll with it without feeling attacked, but so might modern-day parents who film their kids dancing to Anaconda (to then become TikTok sensations at age 16). If Cuties had had the girls hang around RuPaul and/or gyrate their hips as a Cardi B-style empowerment move, it might've had even more fans."}, {"id": 76, "text": "As a movie, not terrible. the dancing wasn't too much, it's what every young girl is doing on video nowadays."}, {"id": 77, "text": "I really doubt netflix cares about how this movie is not wrong on a moral level as it is on personal level. If I wanted to be on a list this is the movie I would watch but then I forget that we have to clap. I won't clap the movie is trash nothing more nothing less."}, {"id": 78, "text": "As an older woman, it's very refreshing to see new fine talent on the big screen. I really enjoyed the movie. It made me feel young again. I particularly liked their outfits and strong attitudes."}, {"id": 79, "text": "Cuties is not an appropriate movie about children. The pre-teenage girls in this movie should not be engaged in sexually provocative twerking and dancing. This film exploits children. It is wrong to do so, and to put money in the pockets of people who take away the innocence of the children who made this movie.I am not sure what is wrong with my review that it has been deleted 11 times now, but I guess Google and IMDb must own stock in Netflix? Dozens of other critical reviews have been deleted also."}, {"id": 80, "text": "While watching the movie, I had to shut it off numerous times. I understand the message to the film but the way, they went about it was not right."}, {"id": 81, "text": "Filming a teenage girl with an identity dilemma who doesn't feel any belongings of any culture, stuck in the middle with a religious family and so-called modern life is not an issue at all. Whoever finds this movie like 11 years old twerking, they got problems. The movie messages how affecting the people, especially kids, when they force to do something in this era. I believe people got offended just because she's a Muslim character. At the end, when she was skipping in normal dress, refusing to attend the wedding, finding her way and smile on her face was just priceless. Good movie"}, {"id": 82, "text": "The idea and storyline behind the film itself was good however the director felt to establish the line between 'shock value' and inappropriate. The scenes of the girls dancing provocatively felt uncomfortable and unnecessarily prolonged. The ending fitted nicely with the story line of her battle with tradition and trying to find herself in western society. However the actual content within the film was very disturbing."}, {"id": 83, "text": "I innerstand the outrage coming from people all over. But I also innerstand the heart behind this film. You cannot control how everyone views or uses your art, unfortunately. Perspectives are shaped by experiences and many other things.Could it have been filmed differently? Absolutely. But it also would lose a lot of context necessary for analyzing and interpreting the film. Lessons that could be applied and learned would also be missed. When I took my emotions out of this, I started to realize this isn't the first time I have seen this. Certainly won't be the last, especially with the time we're in."}, {"id": 84, "text": "I honestly do not understand why all the fuss. It is a well played movie. The protagonists is a girl that makes some bad decisions and hangs out with some problematic girls but in the end realizes that this way of living is wrong. The leading actress is truly amazing. All this fuss because of a two minute provocative dance? Really? In which century do you people live? Have you noticed how kids dance nowadays? Or was it Lolita, call me by your name and moonlight any different? Get a life!! It's a beautiful movie that is worth watching."}, {"id": 85, "text": "Sexualizing minors to show that sexualizing minors is bad. Big brain"}, {"id": 86, "text": "Usually with films like this that have controversy there is a hidden message or something. and with that there is one but it's difficult to determine what that message is at the end. Is it respect others for who they are? Is it get your crap together? I find it difficult that people actually like this and say its good when films like parasite have been released causing a need for more high standard films. Half way through the film the girls are watching their competitors dance off on video. The issue is one of the underage actors flashed her breast. This shattered my disbelieve permanently through the rest of the film. I don't think netflix should be cancelled over this though. Maybe ban the movie in countries that are strict with this stuff for sensitive viewers. Bottom line is this film is bad."}, {"id": 87, "text": "The films actually interesting and very real. It's 100% Anti the over sexualization if children but does point out that we live in a world where many young girls are desperate to grow up too soon. It's confronting but it's meant to be to show us how many people are just ok with children being turned into objects of sexual desire and how casually we treat it. I found a lot of it very relatable and remember being as confused about sex as these girls but trying to act like I knew it all and always wanting to be grown up and wear things like I saw on tv. I agree with some it could have been done with older children playing younger but I don't know if it would have been as confronting and the point of the film is to make us uncomfortable and reflect on the world as it is."}, {"id": 88, "text": "Keep an open mind if you're going to watch it. It is not what people have made it out to be. It's hard, it's real, and at times, yes it's very uncomfortable. However, it's also soft, and upbeat while showing imagery that many find objectionable. It takes on things that people are afraid of, as the backlash has shown. It's a story about a girl trying to find her place in the world, trying to find her identity and ultimately learning what her identity isn't. A movie about culture shock that's managed to alienate everyone. Well played."}, {"id": 89, "text": "I feel like this show is trying to encourage rebellious behavior against traditional family values. Or, even worse, open up certain parents to the idea of allowing such a thing for their child. This stuff is bad for their brain, and the family structure. The results are always going to be insecurity and anxiety in the later years of these childrens childhood."}, {"id": 90, "text": "I get the message, the filmmakers wanted to convey but there are many objectionable actions and camera angles that could have been avoided without even affecting the efficacy of storytelling..."}, {"id": 91, "text": "I practiced patience in viewing this movie to have ammunition to properly comment because of all the reactions expressed by many. Those reactions are sadly fully justified because whatever claimed intent those who produced this insipidity it is simply a fast track to use young girls to get the attention of a specific selected few. You have a girl (Amy) who is allegedly in a Muslim restrictive environment and suddenly she would be able to just switch to join flaky girls who gyrate, hump, and are simply vulgar without facing the wrath of the Islamic culture. Not in this real world. Won't happen. And in that insipid scenario you have that Muslim mother who almost threatens to kill the girl and later stands against an older lady who wants to bring sense to that very daughter. These are mere distraction between the incessant suggestive dances of those young nubile girls that are the main topic of this whole charade. Trying to give credit to this semblance of alleged message to prevent sex-exploitation of children (or young girls in this case) is an hypocritical claim to cover the real destination that movie has taken. Not a good one."}, {"id": 92, "text": "The story is the story of the mother, not the daughter. Yet, at a certain point somebody decided that sexing up very young women would make it a way better movie. I simply don't get French cinematography in the last two decades. So many movies who lack a plot, but are very concerned with the sex lives of people 6 to 16.As for empowering women, this is the precise opposite. It simply plays the role of the abusive old woman who would cut the clitoris off the young woman if she were from East Africa instead of West Africa. It is about keeping women in their place, obedient and voila! you get bliss."}, {"id": 93, "text": "This movie was about a young girl trying to fit in. The movie was true to what is going on in the world. People who find this movie disturbing. It's people or have an issue with themselves. Very good movie."}, {"id": 94, "text": "Why does this exist. Why does it have a good score from critics. This is probably possessed by Jeff Epstein and probably produced by Daniel Schneider. Chris Hansen, please help us. We stray further from God every day."}, {"id": 95, "text": "It's very hard to watch it but such a good critique to today's society in the teens world, it really makes you think,"}, {"id": 96, "text": "I'm going to start by saying that this movie is totally misrepresented. It's a coming of age story for those becoming young women. There isn't child nudity, and the sexual themes are way lighter than what you see in things like good boys, which is way more disturbing to me as a parent than this could ever be. I'm a thirty year old man, and am pretty unaware of how growing up like a young muslim refugee can be. This movie is important, it's REAL and the woman that wrote it deserves every award she's gotten. If you manage to sexualize THIS film, the problem lies with you, not the film maker. It's a great film, about things I'd never have understood in the slightest without them being depicted. In a country where the media is bad, you probably shouldn't listen to your friends on social either. Good job Maimouna, I hope to see more, and you deserved more than this country is apparently capable of giving. Thank you"}, {"id": 97, "text": "Let me be clear: I do not support Netflix and I have never have. Not only did this film reinforce my opinion on Netflix, The First Temptation of Christ did as well. How can Netflix show such disrespect towards religious beliefs, and not only that, how can they promote something this terrible? If only they had common sense and saw that this is just plain wrong. It's a simple fact: this should not be promoted. Why was it? I don't know why. What I do know though is that I will NEVER support Netflix."}, {"id": 98, "text": "Cuties tells the story of Aminata, AKA Amy, an 11-year-old Senegalese girl, living with her mother and two younger brothers in the majority-immigrant Paris banlieues.Her father went back to Africa, to come back with, and marry a woman he chose to be his second wife; the idea is that they would all live together, polygamously under the same roof.Empathizing with her mother's rejection at her father's choice, Aminata finds herself living between two cultures; traditional Islamic Senegalese culture, and the strange subculture of a clique of tween dancers, who eventually accept her admission into their crew.In their subculture, these young girls are more rebellious than their same-age peers, and are somewhat reminiscent of mean girls.They're too young to truly understand sexuality, and it shows in their childish dialogue-exchange, but they're in a hurry to be grown up-and-they live in the age of the Internet.The young clique dresses and dances all too sexually for their age, but in their own minds, they're competing with a group of older, more mature girls, who won a group dance/choreography-contest the previous year.This year, the young girls are entered in the same competition, under the dance-team name Cuties (Mignonnes in French).The girls draw their choreographic inspiration from music culture they find online. Their choices are way too sexual for their age or their childish bodies.With no one to guide her in the culture of the world outside her home, Aminata, living between cultures-as her peers are as well-is living her own coming of age. In seeking group acceptance, Aminata becomes even more outrageous and delinquent than her peers.The film ends in a dialectical return to a middle-ground, as the protagonist comes of age in the complex sets of worlds she negotiates.The film is not perfect. The acting is quite good, and the story seems quite realistic in the age of Snapchat. The plot actually relays a toned-down version of the director's own real-life experience.The grievance being voiced and going crazy online, is not completely wrong; the camera dwell-time feels a little too lingering and creepy, focusing on the dancing body parts of the young, tween dancers.No viewer watching the choreography will feel comfortable, but this makes the reaction of revulsion, expressed by the bulk of the spectators at the competition, understandable.The film is overly-criticized by many conspiracy theorists who haven't seen it. It's an okay film, and is a good effort for this new female director's first film."}, {"id": 99, "text": "Outrage culture strikes again, people are judging this movie without even watching it. If you watch the movie with an open mind and can actually appreciate the art. You will find a deeply touching and thought provoking movie that touches some hard subjects the society is clearly not ready to talk about yet. So we just ignore it.If you watch the movie until the end you will realize it is actually the opposite of what it's being accused of. It definitely does not deserve the type of ignorant condemnation it sadly endured."}, {"id": 100, "text": "I enjoyed the film. The movie is actually making a statement against the pressures girls are faced with in regards to sexualization. It's silly how people are protesting this film. Especially since their protest is in agreement with the point of the film."}, {"id": 101, "text": "I watched this due to so many bad back lashing This movie is a winner of 1 girl who wants to fit in with her muslim family and social world that is now Being judged is hard enough but what the Netflix poster did was a bad light on a movie not on the dancing but simple girls in a place growing up . I cried to sad moments in movie .My review don't believe a cover until u read it"}, {"id": 102, "text": "Even though some of these scenes might be hard to watch for parents I think it's very important that they do. If you think this isn't happening throughout the world, you need to open your eyes. Sometimes it's even younger!"}, {"id": 103, "text": "Is absolutely disgusting. Don't know how it won an award. Don't waste your time."}, {"id": 104, "text": "I've seen French movies about adolescent girls (Catherine Breillat's Une Vraie Fille, 36 Fillette, and À Ma Soeur! to name three) that make this film look like Sesame Street. I give it a thumbs down due to its copout ending, but for a while it looked like it might be an interesting treatise on the impossibility of maintaining Muslim values across generations in western society. The campaign some puritans are waging against it is nothing less than Hays Office 2. Especially contemptible is Ted Cruz attempting to make political hay off of it without ever seeing it. Let's not let streaming movies go down the same path that theatrical movies did long ago or let this film become a political football."}, {"id": 105, "text": "Deep idea, shocking at the same time, but I believe that what we need. It's really happening out there."}, {"id": 106, "text": "Watched it to see what all of the b.s.was about.it had some extremely inappropriate stuff in it that 11year olds should not do.bad acting inappropriate child dancing,costumes were too revealing.I"}, {"id": 107, "text": "The RottenTomatoes description - A thoughtful look at the intricacies of girlhood in the modern age, Cuties is a coming-of-age film that confronts its themes with poignancy and nuance - is very good. But somehow short... there is much more in it! The objectification of women at any age, the role brutally given to them at any age, the social stupidity that impose unreachable models (for example, the young girls that want to be older, and the elderly that want to be young), the religious ignorance that leads to the extreme (where the priest is more tolerant than the preachers). And much more... till finding, well hidden under all this garbage, the poetry that girls are still girls, if they are let alone. But will be they?"}, {"id": 108, "text": "It is interesting that this film has received so a number of rating that are more than the number of views of the film! Obviously people are rating without watching it, or just by watching clips on YouTube.The film is French, which is probably why there is such a fuss being made in the US through an ignorance of the culture and art of producing thought provoking cinema. This is not a brain-dead Hollywood offering they are used to.The film is hard hitting, and as you watch it you will cringe at the antics the girls get up to in their innocence as they pursue false aspirations that are so prevalent in our societies right now.By the end of it you should be seriously questioning the way society is."}, {"id": 109, "text": "The movie have multiple identities, on one side it's a drama about Coming-of-age story about a muslim girl and on the other side it's hardcore feminist fantasy showing how brave women are and how they learn from their horrible mistakes!! The most triggering and offensive about it the most screaming thing about it is 11 year old girls twerking. The defense for the movie is bad and disgusting from any angle. The interesting thing about the movie it have been received very well in France."}, {"id": 110, "text": "Forget all the child exposure thing. Movie is slow and boring as hell. Just don't watch."}, {"id": 111, "text": "If I hadn't read the article in the NYT today concerning the controversy I wouldn't have thought to watch this film.But it is actually good.I might have rated it 7.5 or so, but I rated it 8 to offset 1's by people who did not watch it.Spoiler alert - there is no sex in this move.There was one image of a child lifting her top and her nipple may have been exposed for a portion of a second. No real nudity. No sexual activity whatsoever. Some prepubescent girls twerked. But that is pretty much it.This movie is not about sex. This movie is actually pretty good exploration of the difficulties prepubescent girls have growing up in our current complex society.The subject is an 11 year old girl growing up in a Muslim family in Paris. She is conflicted between her family and her society.Children emulate adults. I never considered the difficulties girls might have in such a situation.But given today's culture, 11 year old girls pretending to be 20-something dancers is not too different from 11 year old boys pretending to be soldiers.Of course there are many who do not want people to consider our current reality. They say that climate change is a hoax and there is no such thing as white privilege.. They wouldn't watch this movie but would give it a 1 rating.Please consider our reality. Watch this movie. Vote."}, {"id": 112, "text": "It does not have an ounce of comedy in it. Its basically a drama, and only this. Despite the polemic it is a coming of age kind of movie."}, {"id": 113, "text": "I saw the controversy on Twitter and decided to judge by myself. I was a bit reluctant as I have two young girls and was afraid it would have inappropriate sections.I think the criticism is baseless. The story line has a couple of holes but overall it's well written, the main actress is superb and the director does a good job at conveying the problem. It doesn't come across as anything else than a critic of the overly sexualised lifestyle you get from the music industry and social media and how that can influence younger kids.At times it makes some for some uncomfortable viewing, but it's in my view important to be aware of what is happening with pre-teens and keep an eye on your own kids to avoid that happening to them."}, {"id": 114, "text": "It makes Mason uncomfortable, in Richard Linklater's Boyhood, when his sister Samantha goes into her Britney Spears routine. He throws a pillow at her. Samantha doesn't know the power of Oops, I Did It Again, but her older brother does. He wants Samantha to stop. So does the audience.The audience starts to boo. The dancing is neither more nor less racy than what preceded the four girls on stage, gyrating and contorting their bodies with aplomb and familiarity. Problem is, they're too young, the dance troupe who call themselves Cuties, the namesake of this coming-of-age drama, directed by Maimouna Doucoure, making her feature film debut. These strangers don't know Aminada, who desperately needs to shed her skin, the same skin that her mother and mother's mother passed on to this shy African girl. She needs a new hide. She needs a new name. It doesn't suit Amy anymore. How can this audience know that they're witnesses to an act of performative feminism, albeit misguided and extreme? The moves, of course, look preternatural because they're adult moves, executed by children. If this scenario looks familiar, it's because we have seen it before. Hate the culture, not the girls, who are doing what the culture taught them to do. Entertain men. Don't hate the filmmaker either. She's just the messenger. That's the whole point of Cuties.Five seconds tops, that's all it takes for Frank Ginsberg(Steve Carrell) and his nephew Dwayne can stomach before they take their leave from the beauty pageant showroom in Little Miss Sunshine, the 2006 comedy-drama road film that scathingly indicts America's hyper-********* culture with barbed highwire. Richard Hoover, Dwayne's father, already seated, cocks his head this way and that. wincing noticeably, at the spectacle that is the child beauty pageant. Young girls in swimsuits, heavy makeup, and elaborate hairdos, catwalk provocatively down a runway to the pulsing beat of a song that promotes their own objectification. It's grotesque, and he's the only one in the room who recognizes this ritualized indoctrination of subjugating young girls to a patriarchal stamp of approval, as such. Everybody is complicit, everybody knows what these girls are selling. Olive Hooper is the last contestant to perform in the talent section. Olive asks the lecherous emcee to hand her the mic. She'd like to say a few words.I'd like to dedicate this to my grandpa, who showed me these moves.Cue the music. Nobody can hardly believe their ears. Rick James, from beyond the grave, speaks the truth. Now we know why the deejay questioned Olive: This? Did 'you' choose this? when she hands him the CD. No, my grandpa did, Olive, a regional Little Miss Sunshine is told that she's the most beautiful girl in the world, not because of her brains or personality. Olive learns the wrongheaded lesson that beauty is not skin deep. Grandpa, it should be noted, snorted heroin. Is he here? Where is your grandpa right now, the pageant host(Matt Winston) asks.In the trunk of our car.Amy sits in a prayer circle, her head covered as mandated by interpreters of the scripture. She sits among the womenfolk living in the same Parisian tenement building. A woman must be pious, the high priestess insists, adding: Because in hell, there will be more women than men. Amy's eyes turn upwards, but all she sees is the ceiling. After the religious meeting convenes, she passes a girl in the laundry room, dancing without inhibition to a jam as the wash washes. Right away, Amy recognizes the tool that can bust through ceilings put in place by her ancestors. Tired of being a good girl, tired of being pious, Angela becomes Amy's new best friend. She joins the Cuties, which not only is a dance troupe, but an ethos for life, a faster life in which nobody can tell her how to dress and act. The girl doesn't want to end up like Mariam, Amy's mother, who goes through life suffering indignity after indignity because that is the lot of all pious women. You grin and bear it. When she receives the news of her husband's engagement to a second wife, the aunt expects the daughter-in-law to be selfless and greet the news with a sunny disposition. After all, it's a woman's duty to forgive all of man's transgressions unconditionally. The aunt is hardwired to think this way. The aunt regales Amy with the tale of her greatest achievement; her wedding day. Amy, though, can see that her mother has grown tired of their religion's tenets, skewered as they are, like so many religions, in the man's favor. Getting ready for bedtime, Mariam doesn't realize she's being observed. The garland of flowers that her daughter laid down on the bedspread goes unacknowledged, now just scatterings on the floor signifying nothing. Because of her mother's disregard and torpor, the arrangement of cut flora loses its intended meaning; to welcome the new addition to their household. Earlier in the day, with her mother-in-law's encouragement, Mariam made the customary phone calls to announce the blessed news. Privately, however, Amy's mother starts to question this sanctifying tradition, which is, in essence, a woman cooperating in her own debasement. So does Amy. Without realizing it, Mariam's covert rebellion gives her daughter the green light to rebel.To Angela and the other girls, it's just dancing, a pleasurable activity to occupy their time afterschool, a kinetic surrogate for life-altering shenanigans. It keeps them out of trouble. Unlike Olive, who hasn't yet learned about the cultural currency of a woman's body, these girls, despite being far from naive, they don't cash in on their ruse, which is to look older than their chronological age. That's because they're good girls. They instead sublimate their hormones through contemporary dance, which can be provocative and risque, but it keeps the girls' clothes on; tight-fitting and inappropriate for their tender age, sure, yet nevertheless, on. These are good girls, acting out. We are not in the world of Kids. The Cuties have no ideology; they dance for dance's sake. That all changes, unbeknownst to everybody, when Amy replaces Yasmine and supplants Angela as team leader.The dress in Amy's closet breathes, it even bleeds. A ghost inhabits that dress. The ghost gets its... Amy rejects the frock; the frock that her father bought for his wedding. If the dark-skinned Parisian wears this traditional Senegalese dress at the upcoming ceremony, the liberated migrant is afraid that she'll turn invisible like all women from past generations, those conscripted ancestors, and even worse, dislocate her from time and space. The search for a new role model ends with Amy wanting to be like the girl on Angela's phone, the lead dance for their rival, the Sweety Swags, older girls at least four years their senior who attend the same school as the Cuties. The head Swag goes too far in the posted video. But Amy notices that it received a lot of likes. Amy, above all else, wants to be liked. Like the drug-addled grandfather in Little Miss Sunshine, the Sweety Swags know what sells. Amy takes over as the dance troupe's choreographer, showing them moves, the same moves that cause an uproar at the outdoor dance contest. Amy then makes the same mistake as females from western an westernized cultures, hoodwinked, all of them, by the next wave of feminists who insist that objectification is in the eye of the beholder. Amy misconstrues bared skin as a political statement. She takes a selfie and posts it online as a categorical declaration of her freedom from the patriarchal construct that is organized religion. The problem, however, is that the person who sees Amy's exposed self, doesn't know the context, and worse, doesn't care. Men make-up the rules in the secular world, too.The bigger picture, of course, is the film itself. Depending on who you are, Cuties can either be experienced as a neo-realistic film about female friendships in the digital age, or an exploitation flick, sight unseen. Like Little Miss Sunshine, Cuties, too, shows off its true colors, a moral compass that doesn't have even the slightest patina of blue, and furthermore, points in the direction of higher ground without being hamfisted or obvious about it. Both films employ a stand-in, representative of actual world deviants who have a prurient interest in girls well-below the age of consent. In the Dayton/Faris film, it's the guy in the audience with no familial ties to any of the Little Miss Sunshine contestants who gives Olive a standing ovation an yells: Yeah! Alright! with misplaced enthusiasm. In Cuties, it's the laser tag facility manager who leers at Amy when she uses her advanced dance skills to get herself and the other cuties out of trouble for illegally entering the premises. Really? his employer asks. The good guy in Little Miss Sunshine is Kirby, the deejay who voiced his concern about the appropriateness of Superfreak. He, too, claps heartily; not out of lechery, but out of knowledge that Olive just exposed the latent sickness that lies just beneath the child beauty pageant surfaces.Halfway through their routine, over the soundtrack, we hear Amy's interior radio picking up the high priestess' frequency, in which her chanting competes with the pop music blaring from the onstage speakers for the young girl's attention. The dissonance stops Amy cold. It's a reckoning, incited by an exorcism, perhaps. Who made Amy push Yasmine into the canal? If not for the buoy, the girl could have drowned. Amy returns home, late for her father's wedding. She strikes a compromise. The dress remains in the closet, choosing an outfit more suitable for an eleven-year-old girl. Amy walks past her aunts dressed accordingly, dancing in praise of bigamy. It's not for her.She goes outside. Two girls are swinging a jump rope. When it's her turn, she takes it, jumping higher and higher, as if trying to reach heaven.On her own terms."}, {"id": 115, "text": "Both disturbed and confounded by this movie! The message did not come through at all, and in the end I felt I watched a bunch of disturbing shots of 11 year old girls' overly inappropriate shots that left me really empty. Amy's rebellion was lost in translation for me with a sudden awakening in a story that lacked the ability to self modulate massively. I'd say it was more of a lack of parenting than the devout Muslim claim."}, {"id": 116, "text": "I think it's a really fantastic and unique movie that gave me insights into a world I do not know much about: Modern day Paris, the life of first generation immigrants from Africa and their children trying to adapt to the new culture and the tensions among the different generations within the families. The clash between traditions and the demands of the social media era. I felt uncomfortable watching it because it deals with difficult realities of growing up today in general. Please don't listen to the rantings of people who haven't seen the movie. You may not like end up liking it, but at least judge it for yourself. It's a French art-house film, not a mainstream popcorn movie."}, {"id": 117, "text": "I knew nothing about this film before watching it except that it sexualised children. However I wanted to know what the hulla baloo was about because Hollywood has been sexualising them for years. As it turns out i think this is a fantastic film with a really strong message that the overly dramatic and faux moralistic brigade will have missed because they don't think further than a Sun headline. I could talk all night about how this film simply shows in very clear terms what society is doing to our kids, but the ones who need to listen won't. If you want this type of film, which reflects real life, to stop, then stop Rihanna who's very highly sexualised moves has inspired young pre teen girls for years. Stop Rihanna, stop Miley Cyrus, stop all of the people who basically sell their sex and inspire ever younger children to emulate them. This film does not sexualise young girls, it shows how the world is sexualising pre teens. If you want to find fault find fault there."}, {"id": 118, "text": "It's amazing that such a banal, hackneyed, vapid film would be getting so much attention. Honestly, even with the brief moments of ghetto culture dancing, it's essentially a modern version of the ABC After School Special in terms of tone and narrative. It's almost as if the screenplay were written by an 11 year old child, and they even shot this on film! What?!?!?"}, {"id": 119, "text": "This movie follows a girl named Amy who basically just wants to be part of a dance team and be popular and escape the pressure of how she feels at home with a strict Muslim mother, whose husband is taking a new wife and they both are to attend the ceremony, neither wanting to.She sees these girls at school who call themselves the Cuties and are popular (or seem to be, they are in their minds, they're confident and she's drawn to them, and wants to be like them, and be friends with them).Throughout this girl's journey she eventually finds herself winding up rejecting the whole dancing and attempts to be someone else in a vain attempt to be popular, and even just to be accepted (as she did not fit in early on, hence her changing her way of dress etc.), with her leaving the stage of this dance contest in the middle of it, as her roots and upbringing came back to her, and made it clear to her that as tough as her life at home was, here she was lost and just trying to fit in, she had lost herself, her own true identity.There is a most beautiful scene near the end shortly after she leaves crying from this dance that she and her new friends spent so much time training for, a scene after she goes home, it cuts to later where she's watching a couple of kids jumping rope and decides to join them - she regains her innocence - something she always was, innocent, she just didn't know even what the whole look and everything, the dancing, the posing, represented, it was beyond her years and her grasp.This movie is *not* about sexualizing or the exploitation of children, it's actually just the opposite, it's against it!Too many people are in arms over a movie they haven't even seen.I think this movie is excellent, and the part at the end moved me to some tears; it was beautiful to see her being a kid again, and dropping all the pretenses she tried, in such a vain attempt at popularity and a feeling of freedom, when it wasn't really her."}, {"id": 120, "text": "Very nice movie. Hopefully they'll improve it in part 2. Is Cuties 2 coming out soon?"}, {"id": 121, "text": "Although sexualizing 11 years old is disturbing, this is a strong movie with a bigger message. It's not the movie that is wrong, it's our society that is. These girls are acting very sexual for their age although they don't see it that way (when Amy watches her other friends perform when she was late, it looked innocent from her eyes but when it's performed in front of an audience, she realizes how wrong that is). In the world we live in today, it is hard to know right from wrong especially when your parents don't even know the difference."}, {"id": 122, "text": "This film shows current and real dilemmas, fantasies and a pre-pubescent girls' needs for acceptance and popularity. It presents very different cultural acceptances and priorities between Amy's family and the families of her friends. The desperation that she feels is completely recognizable as a blooming pre-teen. The depiction of the girls as being overly sexual is what make this movie so relevant. They're trying so hard to be what they think their society finds pleasing, and Amy delves too deep. But the alternating comradery and ostracization of the girls is also so truly realistic and on point for the current international culture. Pre-teen girls are pre-teen girls, no matter where in the world they are. And everywhere, these girls are horrible and delightful synchronously."}, {"id": 123, "text": "I was surprised to see how much a hate a movie that denounces the exploitation of girls is getting, until I read that there seems to be a campaign from the extreme right in America, trying to portray this as something it isn't. As someone who has seen this movie, let me tell you that this is actually a very sensitive portrayal of a young girl, being torn between the traditions of her home country and her traditions and the temptations of Western society. Apparently the hysteria and the divisiveness wer're seeing in todays political culture, especially in America, is not a good climate for any artistic ambivalence."}, {"id": 124, "text": "This movie does a great job of showing the pressures young girls show as well as the dangers of poor parenting. The message is missed by many who review this without seeing it. The movie's message is against the sexualization of children, but it also doesn't ignore it like many boomers want to."}, {"id": 125, "text": "I watched this film before reading any reviews and was really surprised to see it only had a 2.7 rating- that's the lowest I think I've ever seen, at least for a movie I've watched! I think many people rated it low because of the ethical concerns about content. I understand that. However I think it was a really interesting film, so well acted, with lots of engaging story. Amy, the 11 year old girl, doesn't fit in anywhere. This was a film about belonging and not belonging and had a lot of depth and levels to it, which were really well done. Depth in simplicity. It's a coming-of-age drama for an age where the lines between childhood and adulthood are often very blurred. There is a moment in the film where Aunty tells Amy that at her age she was engaged. There is outrage, perhaps justifiably, about the dances these child actresses were doing in the film (very very uncomfortable viewing)- yet elsewhere in the world girls of the same age may well be preparing for marriage. Pre teens are not children, they're also not adults or even teenagers. They've grown up with cultures and expectations that they begin to question. The world starts getting larger, and also smaller. Friendships are fragile because emotional maturity is still a way off. Bodies and boundaries are changing. This film is a warning about what fills voids when we're not paying attention. Or worse, when we are yet simply don't care."}, {"id": 126, "text": "The spoilers will only be in the second half of this review. I watched the edited trailer released by Netflix as well as the interview with the director and decided to give this movie a chance despite the mass of terrible reviews. The beginning was very interesting to me, and I found myself rooting for this child (who comes from a very conservative culture) as she finds something expressive and simply sees freedom. This part was done so well, and I was really looking forward to how they addressed the rest of the movie. As it ventures further, however, it really loses sight of its own message. Camera angles become aggressive , questionable, and borderline exploitative. The vulgarity and oversexualization in certain scenes I could almost brush off because I felt it was the point of the movie to make the viewer uncomfortable during these points, but this is also only effective to an extent. Frankly, the movie takes some of these too far, and the message becomes lost in flashing lights, close-ups of children, and just how much it can comment on in the span of 96 minutes. It tackles too much, and some of it is never addressed again that absolutely needs to be. The ending is poor, unresolved, and rushed, enough so to lose the message altogether. I am truly disappointed because I genuinely thought this movie had a lot of potential, but the execution lost it.SPOILER ALERT There are quite a few scenes in this movie never touched on again that could just as effectively be removed. I think it is an interesting take to show the different ways that we, as adults, impact children and just how easy it is to forget this, in everything from music videos to social media to simply leaving condoms on the ground (though I hope most of us refrain from this one). The condom scene could be removed, however, as well as the split second we hear Yasmine throwing up in the girls' bathroom after she rejoins her friends. For it to never be mentioned again, something like bulimia is a serious topic to introduce. The same goes for child pornography. While I understand it was essential to the plot she be removed from the group, posting a nude of an 11 year old girl online is a serious charge, especially when one considers that the phone belongs to a much older boy. There were other ways to reach the plot goal. Even at the end, as she stops dancing during the finale, there's nothing specific to cause this. To us, she seems to simply snap put of it, but I would have liked to see more of a realization there. As she returns home, her mother has somehow come to terms with her father's second marriage but tells her she does not have to go, so she simply doesn't. I love the growth in her mother of being able to stand up to her aunt and the portrayal of duty and responsibility in her, though it is unclear where it comes from. For all of this, we never see what happens when her father or step-mother join them in the living space afterward and how they handle her non-appearance or her reconciliation with the dance group after she left them onstage out of nowhere. The movie ends with her simply jumping rope, and I admire the symbolism in allowing her to let her natural hair down in this scene and still be a child, but it is overall undue seeing as the movie is incomplete. I had high expectations for this movie, but it bit off more than it could chew, proved even more so by the lack of a real ending."}, {"id": 127, "text": "CUTIES is no worse (nor better) than any other mature audiences film involving young actors. First off - it's a French film and Europeans are MUCH more comfortable with this subject matter than Americans. This is obvious due to the number of triggered conservatives posting their pearl-clutching reviews. Most, if not all, of these reviewers didn't even watch the film and only heard about it from some rant on Facebook.Secondly, the fact that the main character is a Black Muslim girl might have a teeny tiny something to do with the conservatives' disgust. Please.Ironically, if it wasn't for all the righteous indignation about CUTIES most of us would have never even seen it. Thank you for the heads up."}, {"id": 128, "text": "Story well told and well executed, original and not something we are accustomed to watch. People who claim to be shocked obviously don't have a clue about the life of kids today and the impact pop culture imposes. To grow up today in such a conflicted world is no walk in the park. Giving it bad rating is just hypocritical. Grow up."}, {"id": 129, "text": "I enjoyed this excellent and thoughtful film. Great to see African women get such good roles in a film, the acting was excellent from everybody. I wonder why people who have only watched the first 10 minutes would write 1 star reviews about the film? Watch it for yourself."}, {"id": 130, "text": "This movie is about a 11-13 year old Muslim girl that join some sort of twerking dance group. The girls in this movie are severely sexualized! Whoever was in the production needs to be investigated ASAP! Also to the parents of the actress, HOW DARE YOU PUT YOUR CHILD IN THIS MESS!"}, {"id": 131, "text": "Controversial, funny, touching and realistic, it's a beautiful coming of age tale but also difficult to digest and accept. Of course children this age are experiencing these sort of things, so it would be hypocritical to boycott this contemporary, accurate and timely account on Millennials lack of decency, ambitions towards technology and liberalism. I just wish the film would've shown a better positive message against such influential dancing culture."}, {"id": 132, "text": "I just watched it and regret not having my daughter watch it with me. We will watch it together for a family night.Anyone who finds this film objectionable is the problem that this film is trying to expose. I see why those people are so concerned about it. They should look deep within themselves and confront thier own demons.This film is exactly what society needs. Wake up to what is happening in our culture. Anyone who is afraid of this film is the person to be afraid of, not this film."}, {"id": 133, "text": "When Amy's mother fell on the floor and she didn't help her, my foot would be so far up her ass. The parents who all their children to be in this, need to be locked up. The kids need their asses beat. Wouldn't be surprised if we hear some of them are pregnant. This is one film that didn't need to be made."}, {"id": 134, "text": "Please don't pay attention to the reviews that blankly paint this movie as bad. The depictions in this movie does not endorse the sexualization of women and young girls, it criticises it. I wouldn't suggest anyone who is sensitive to shocking scenes to watch this, because it does contain a lot of shocking scenes. THAT IS THE PURPOSE OF THE MOVIE! It shows how a humble conservative little girl can easily lose her innocence and be transformed by the society and its lewd culture. As a Christian, and a father of a baby girl, I am certainly more aware of the types of challenges women face today, as well as what my little girl might have to face growing up."}, {"id": 135, "text": "Did these people even watch the whole movie? She realized she wants to be a kid again and runs back to her mom crying....then when ahe is playing with the other kids she smiles for the 1st time in the whole movie! There wasnt even that much dancing in it. People overreact to stuff"}, {"id": 136, "text": "I read enough reviews to know this movie should not be out or even released to children or the public at all. i canceled my subscription with Netflix in protest of this sick movie! And the others have as well let's stop these creeps in their tracks they're trying to normalize this stuff and we can't let them!!!"}, {"id": 137, "text": "It is not an easy story to tell, especially by such young people, and in my opinion it was done brilliantly. Great acting music just the whole movie is a on big plus. In my opinion, only a person who did not understand the message could give a low grade. I suggest to all consider what the director wanted to do ? To shock us or show the world of children on the verge of adulthood with their own eyes ..."}, {"id": 138, "text": "I just saw the controversial film Lindinhas! But the film shocks precisely because children are already so influenced by social networks, are more connected in aesthetics, in SEXUALITY, losing the charm of childhood. And it is a reality.Film seen on September 16, 2020."}, {"id": 139, "text": "I watched this movie because of the controversy. I feel this is a true depiction of how some little girls are at times. Especially, little girls that grow up in strict religious households. They feel like they are missing out and want to belong. When I was growing up it, we wanted to be like Madonna or 90210 females. Now they have the Kardashians and all those images on social media. Wanting to portray Madonna compared to today's images is like Little Red Riding Hood vs Iggy Azalea, Megan the Stallion, Kim Kardashian and Lil Kim. Madonna's image was nothing compared to today. This was a really great film about finding yourself, perils /fight of keeping innocence in a hyper sexual world. I believe the writer-director received the bad end of the spectrum due to the poster that caused all the criticism. People are prone to jump on a negative bandwagon to tear someone down."}, {"id": 140, "text": "Social criticism made with great sensitivity. The scenes of the dancing children are as uncomfortable as they are in reality that they reproduce. Extreme right-wing hatred was expected, but not justified"}, {"id": 141, "text": "A short story that shows us the problems that girls can suffer in today's world."}, {"id": 142, "text": "I tried to watch the movie because I was super curious and I must say, I was highly uncomfortable. The camera focussed on the bums of the kids a lot, I mean if I was one of them, I'd be ashamed to be in this movie.Things were not making sense at all, such as taking a picture of her ***** with the cousins phone. Or why Amy was suddenly tearing up and stormed off during the competition.Even though it's reality or not, this film encourages kids to do things more they shouldn't."}, {"id": 143, "text": "Just because it includes very young ladies shaking their a*s and wanting to be more grown than they are, doesn't make it a bad movie. People giving it a 1 star..have you seen Taxi Driver? I just don't get the hate, this was a great film. Kudos."}, {"id": 144, "text": "I've seen this movie because of its controversy, wanted to see if it's really as shocking as everyone says. I don't know, maybe I grew up in Indonesia's culture, so it's so provocative for me. Good coming of age story, but no matter the message of a story, for sexualizing children (even in acting) is wrong, but it's 2020 after all."}, {"id": 145, "text": "Good film. Great acting. You feel you are watching real life. The main girl in the film is a fabulous actor but actually all the characters are. Its a directorial debut and I think she has hit on exactly on the experience of being a girl of this age. In a new school etc. The ending is good too but I wont say more for avoidance of any spoilers !Give it a watch. Ignore the controversy as it's no worse than what is happening in life anyway and it shows how the girls deal with all this.Great film - please give it a try."}, {"id": 146, "text": "This movie is an honest slice of life with a compelling story. Don't listen to all the virtue signalling reviews. The girls in it always have more clothing than people on the beach. And yes, they do some adult dance moves that are intentionally OMG inducing moments. But still, they're just dance moves. It's actually quite hilarious to see preadolescent girls trying to be adult because it's absurd looking! And that's the point. People who are just starting to grow into adults sometimes try too hard, especially when a difficult home life or other personal struggles are involved. Clearly, all the actors and their parents and the producers were comfortable with and adult enough to handle the production of this movie. Nobody else gets to speak on their behalf. The acting skill that every single character had firmly implies their level of professionalism. In all, this was a good movie with a story worth telling in an honest way."}, {"id": 147, "text": "People (women) are so false. So hypocritical. One second they claim twerking is only dancing, its nothing sexual. Now because the girls in this movie twerks, they go full Karen-mode and scream that it's sexualizing the children blababla..Dont listen to the Karens. Just watch it, it's nothing bad, just some sexy dancing by the girls. No nude scenes or nothing"}, {"id": 148, "text": "'Cuties:' Why we should be focusing less on how pedophiles will use this movie as soft porn and instead target our relentless culture and the pressures of image on young women. Yes, I watched it and yes, it was disturbing, although, I did not find it desensitizing.This movie touches on female sexuality and the pressures that come with it not excluding eating disorders, conformity, culture clash, fecundity.As a coming of age story follows an 11-year-old Aminata, torn between her Muslim family's traditional beliefs and a new group of friends whose aspirations are to make it big and gain fame as a free-spirited dance clique, Amy struggles to find her place and takes up sexualized dancing to escape her family's dysfunctions. Her newfound influences lead to Amy acting out, lying and stealing from her mother, attacking classmates, and as her mother puts it, behaving like a whore.In contrast, one of the most profound moments is when young Amy doesn't come home on time and her doctrinal aunt waits for her to return so they may begin preparations for Amy's father's wedding to his second wife (besides her mother). Upon Amy's arrival, auntie notices she has started her period and begins to tell the story of how she was her age when she was engaged. I was barely taller than you. A few years later, they washed me, dressed me, and covered me in a white cloth, from my head down to my feet. Then they took me to my husband to get married. When he lifted the white covering, he presented me to his friends, his guests, his family. And continues with, It was a grandiose wedding. I wish that God grant you the same destiny.As Amy runs from her family's traditional views, her acting out worsens and after stabbing a male classmate in the hand with a pen the scene ends and cuts to her mother in her traditional garb slapping Amy and shouting, You want to humiliate me, your mother? And your father who blames me for everything! And who takes another wife! Before auntie has to intervene saying, Leave her alone, Amy's mother continues to ask who she is and that she isn't her daughter and that she should kill her for causing so much suffering to the family.Talk about pressure. Talk about a disconnect. Amy is expected to be fit as a bride in her culture and possibly be one of multiple spouses to her future husband and here we are outraged at the fact these young girls are finding their femininity on social media as if it isn't our own culture fueling this behavior in our young women.11-year-old girls all over the world are these girls in 'Cuties.' That is the issue. We should not be focusing on taking such a movie down because pedos will watch. YOU need to watch it. This movie puts into light what is actually happening in the private lives of young girls and women.Young people are highly influenced and this movie isn't for them. It is for you, the sound adult. We should be so lucky to have such a raw glimpse into what our teenagers are faced with today.In the film Amy breaks down on stage after the crowd is appalled by her group's dance routine (as most adults in the movie are throughout), the dance music fades and Amy is left motionless realizing she must return to her family and with the very last scene as a heartwarming image of a group of young children playing jump rope in the street and Amy joining in. Such a visual contrast of Amy's growth from immoral naivety to childlike limpidness.Watch the movie and do something about it.Disclaimer: for those saying these young actors should not have been put in this situation, maybe this movie should have been a book. Maybe it would have been easier to digest. But what are the chances you'd pick up a book over a Netflix original?Objectively this film was very artistic, included authentic actors and exceptional cinematography."}, {"id": 149, "text": "Don't need to explain why. Don't ever try to watch this, it's disgusting. Just take my word for it. Read the other one star reviews or spoil the movie for yourself on purpose if you want more detail for why this film is vile."}, {"id": 150, "text": "This is a good story. Some of these young ladies will become great actors someday. I like artsy films sometimes. This French com-dram fits the bill. It has subtle yet awesome foreshadowing effects! By the end of the film I was invested in the characters &amp; would love to know what happened next in their life."}, {"id": 151, "text": "I wanted to see what all the hoopla was about so I watch the whole movie, it was mostly sad &amp; heartbreaking to me because you see a preteen girl adjusting to adolescence under extraordinary circumstances, new home, trying to make friends, family dynamics changing unwillingly &amp; all the while trying to still be a good daughter/sister. It was hard to watch some of the actions she took but sadly its what the majority of girls her age go through every day, it's called hormones! But it's also what they see every day, on TV, music videos, video games, movies, celebrities, older siblings, parents, other family members, friends, at school, on the streets, in everyday life sadly &amp; especially the media.Its not childporn, but it is too risque for the age of the actors, in my opinion. But unless you live in a dark colored bubble this type of thing happens all around us all day long sadly.If you read the info about the movie in depth as I did before watching it you'd see the author was speaking from what she went through &amp; is trying to bring awareness to parents about what their kids are most likely experiencing so that maybe the parents will be more attentive to their kids, especially in this day &amp; age of every one having access to the internet &amp; then having a TV, computer/video games babysit their kids, which is in almost 80% of the households nowadays.The dubbing was horrible truthfully, even worse with the outdated terms &amp; lingo they were using for the English language dubbing. The videography was normal looking to me but looked like it was done from the '90s. The culture differences were very apparent in their geography/language compared to what I'm use to in the USA, &amp; yes somewhat shocking as to what the Auntie did with the Shaman but it may be normal in their culture.A lot of people are jumping on a bandwagon they don't or won't try to understand about the true meaning behind the movie before deciding to destroy it &amp; that's not right."}, {"id": 152, "text": "A young girl,Aimee, 11 Muslim who just started a new school and moved to a new apartment with her Mom and little brother,and waiting for their dad to join from Senegal. She comes across a group of girls who are the opposite of everything she was raised to believe a girl could be. They all have cellphones,listen to pop music,wear clothing that doesn't cover everything from head to toe and they dance! Fascinated, she becomes friends with them and starts to adopt some of the new culture they have grown up in,but since she is new to it she sometimes takes the wrong message from the mass media she consumes in order to fit in(she thinks)To me the movie is not over sexual. The themes are more about how the girls parents are letting media teach their children about sex and their bodies,leaving the girls ignorant of the journey to adulthood as women. The kids are great, the lead actress very poignant. I liked it."}, {"id": 153, "text": "No just no. It's absolute disgusting. Who even thought this was a good idea"}, {"id": 154, "text": "This film is about a group of 11 year old girls who are trying to conform to what they believe society expects of the them. They try hard to look and act sexy while also clearly not understanding even the basics of how sex works. The film shows how young girls and women can fall into the trap of thinking their body and appearances are the only worthwhile thing they have to offer. The girls' poverty contributes even more to this situation. The film does not promote pedophilia, in fact, every male In the film is repulsed by the girls trying to hit on them. I watched the film with my child and they loved the message it communicated, that women are so much more than our bodies."}, {"id": 155, "text": "Firat time I write a review after seeing how dumb people are. This is a beautiful movie that shows the reality of what little girls look like and despite the way they behave and they education they jave they should be treated with the reapect and care any children deserves. I saw this movie with love and empathy, and after watching it I remember the society we live in (at least in France) doesn't condemn as pedophile people raping 12 yo girls. Well this movie shows that 11 yo are children, whatever the way they dance and the way they dress."}, {"id": 156, "text": "Is it terribly uncomfortable to watch? Of course. Especially if you have pre-teen kids. Is what the kids in the movie are exposed to (and attempting to emulate) also what our kids are exposed to? Yes.As a court-appointed advocate for children, I know that this movie depicts reality for so many kids, even in my area. This movie should motivate parents to check in with their kids: how much access to apps and internet do their kids have? Who are their children's friends? How open is your communication with their child?Watch any teen movie (Marketed to teens and depicting teens) from 1970 to today... tell me what is different?"}, {"id": 157, "text": "I can understand the idea of the movie, but I think they focused too much on the dirty dancing of the underage girls. This seems very unnecessary to get the message across."}, {"id": 158, "text": "Great movie that understands the heart of children coming of age into the world of adulthood. It's honest and brave."}, {"id": 159, "text": "Definitely a coming of age movie. No pedophile, nothing that shows sex, nothing inappropriate. It was a good movie about fitting in and other cultures. The girls were just trying to fit in and make friends. I watched this with my teenage daughter. She saw nothing truly inappropriate. Ultra conservatives need not review the movie but definitely watch it."}, {"id": 160, "text": "This movie has been misjudged by a biased view of the theme it addresses: the difficulty an 11 year old African girl of adjusting to a different culture and morals... A great movie!"}, {"id": 161, "text": "A disturbing, and much needed, look at the sexualisation of young girls in todays society. It chronicles the depression and mental breakdown of Amy, an 11 year old Muslim girl in France, dealing with religious pressure as her father marries again and will soon be coming to live with them with his second wife. When she meets up with some young girls she starts to act out. Trying to meet the standards set of society. Whilst the dance scenes are sexualised, which is why there is do much controversy, its no more than what is normally deemed acceptable in most places. It is harsh viewing and uncomfortable to watch. But this does need to be talked about. This is a serious problem in society and films like this need to shine a light on it as it normally gets dismissed as harmless fun for young girls. The film is well acted and well scripted with the young actresses tackling some intense material. The film does abruptly end with the mother finally understanding her daughter is struggling and why. With just one olive branch offered we get a shot of Amy feeling better. Is thusvthe happy ending? I don't feel like she has addressed any real issues. Nude selfies at 11 and two cases of assault. One stabbing and another a near fatal drowning??? Other than an abrupt ending, his is a good film."}, {"id": 162, "text": "Pretty great. Most people who are outraged, did not even actually watch the movie. Other people don't quite understand things like... movies, fiction, art, acting, and like to interpret things quite literally, instead of looking for actual meanings and themes. The movie is raw and real, and just like life and reality is, it ain't always pretty."}, {"id": 163, "text": "Beautiful coming of age film. Very nuanced and female centered. The same people who hate this thought Mcloving was a perfect character in superbad. I wish there were more female centric coming if age movies. Absolutely on my multiple watch list."}, {"id": 164, "text": "This is not a film that is pornographic, even if marketing portrayed it as such. Do not judge it until you've watched it. It is an extremely important message about how girls are sexualizing themselves way earlier than they should, as a result of the social pressure."}, {"id": 165, "text": "I don't know where this hate comes from. These girls aren't even partially naked. It's just a dance. I remember movies with totally naked teenage boys and nobody hated those movies back then. In Cuties, although there is no nudity, people hate the movie. This is unacceptable. This is a great and beautiful movie, don't be influenced by negative opinions."}, {"id": 166, "text": "Not sure why the film is getting so much hate. I throughly enjoyed it as did my 11 year old son. Cancel culture is real....support real filmmakers people. Anything below a 7 is harsh.Edit: please watch it before they get rid of it on Netflix. I think a film that succeeds at making people feel uncomfortable is a success. Me and my son watched it for a second time last weekend and we enjoyed it even more. The hardest part for us to understand why their is so much backlash to this film. It's won several awards and it has received positive reviews from top critics. Don't let the negativity fool you. This is art."}, {"id": 167, "text": "Well... i liked it! Alot.. i mean, whats not to like?"}, {"id": 168, "text": "The movie shows the reality and journey of a girl and a family where she finds her true meanings in life. If everyone takes notice of the plot rather than scenes which can be upsetting for them then they'll understand many realities of life and stereotypical society."}, {"id": 169, "text": "This film truly understand and sheds light on the ways young girls imitate what they see on screens big and small. 26 years ago when I was eleven I was a relatively good girl. nonetheless, this film accurately depicted so much of the reality I observed at that age. I can only imagine how much harder it is for tweens and teens these days, now that the consumption and recreation of provocative content is so readily available.The script and acting were both fantastic. Perhaps my favorite film I've seen thus far this year."}, {"id": 170, "text": "Really people !, This movie is very moralistic, they did not understand it, it seems that the critics did not see it or only watched Avengers, it is uncomfortable, because it tries to expose the sexualization of children, I give it 10 stars just for all this people who follow the wave of censorship and cancel culture and do not understand how art or cinema works."}, {"id": 171, "text": "I actually enjoyed watching this movie with my 10 year old daughter. I used it to educate her."}, {"id": 172, "text": "People are quick to join the PC bandwagon on this one. It seems they have either not watched it or not understood Cuties. If you felt uncomfortable watching this film, that's the point. It is depicting the strange and difficult times the youth are growing up in today (especially with hyper-sexualisation 0f younger females). This movie is calling out these issues. If anything, I would say it is pro-feminism. As a movie itself, the storyline is pretty average, but the character development and acting more than makes up for it.Bottom line: If you're looking for a fun movie, this isn't the one. But if you're looking to open your mind to how it *could* be growing up as a female in today's world, it's worth a watch."}, {"id": 173, "text": "I watched and enjoyed this movie. Kids just want to have fun and are innocent. Unfortunately some people will look at it with bad ideas. Not a must see movie but at least an honest one.I Europe no one takes offence and see the beauty of kids enjoying themselves."}, {"id": 174, "text": "What a performance from the young girl playing Amy. It defies her years. I hope this is the beginning of a stellar career for her.The film isn't about sex. It doesn't promote sexualising young girls. It explores the sexualisation of pre pubescent girls through mainstream culture. This is Something that happens In the real world, and the film seems to critique French/reality culture in particular with respects to this. This exploration is made even more interesting by viewing it through the lense of a girl born into a culture completely at odds with this culture of girls only finding value through their sex appeal.I also feel It also explores the difficult nature of friendships and prevalence of bullying and difficulty with school and friendships and fitting in. Especially for an immigrant child, coming into this in a difficult family situation.It's on Netflix. If some of the dancing scenes shots go on a bit too long it's not difficult just to skip forwards. The story and performance is interesting.It was interesting to watch a film where they show a matriarchal side of Islam rather than it being dominated by male characters."}, {"id": 175, "text": "Mignonnes has talented actresses, a good cinematography. But, by far, the worst mistake of this film is the direction, which goes against the very message that the story tries to convey. This fatal error appears right at the beginning of the film, with totally not necessary scenes of child sexualization. And this is repeated until the end of the film. Although this is the theme of the film, it was never necessary for the direction to follow this path."}, {"id": 176, "text": "It's fairly simple if you actually watch it and apply critical thought to it at the level of pretty much an 11 year old.You got strong, polar opposites. Radical islam trying to brainwash young girls into being slaves to men as they take other wives, showing how it destroys them but nonetheless abides by this cultural aspect. Parenting that is lacking, emotionally, psychologically, and a young just bordering teenager girl who hates it and wants something else, and as per textbook, she goes from 1 extreme to another. This film, while not a masterpiece and quite annoying for me personally since I'm 29 and hardly watch these teen flicks and the music that does my head in, nonetheless manages to capture an important societal element.A problem, you could argue.Within social-studies we call this double-socialization. What happens at home and what happens outside. And we see a complete MESS of both here. Polar opposites pushing against eachother and the girl has no idea what she gotta do as she tries to just get one foot down before being steamrolled by nutty grandparents and extremely superficial children who act far older than they actually are.We see the issue of social media, we see the issue of radical religion, of cultures clashing, of total tone-deafness to the needs and shapening of a young child. How moldable they are, how dangerous it can be to throw so much at them at an early age or restrict them the joy of being young and explorative.The key word here is Balance and it's absolutely nowhere to be found in this film. And I can relate to this film, and I bet many others can to if they look back on their own childhood. How much balance did you have if you were a gamer back in the early 2000s? We were bullied to freaking oblivion. We didn't fit in at home because parents said we'g go blind from looking at the screen or lose friends. Go out and play some soccer, why dont ya!And outside we'd get mocked for not enjoying sports, have many friends, or merely liking other things because guess what people. Being different, a geek was not a fun life 20 years ago. Hell even 10 years ago and to some extent even today.So what do you do? You do the best you can and you fall... a lot. And try to get back up. You make a lot of mistakes and hopefully in the end you make it. But it's a rough god damn ride when you're all alone and feel like everything around you is completely over the top and it keeps pushing you. Stimulating you, as is what society does. Ever trying to change you.And that's what this film captures well. The individual being completely lost in a journey that should be calm but instead ends up chaotic and nobody... understands. At all.What people take issue with here is not the film or execution, but the specific visual aspects concerning children copying dancers in hip hop and miley cyrus stuff. I can understand that. But honestly, you've been living under a rock if you think this film introduces anything new. You can go to Youtube... and search for this kinda stuff. Young teen cheerleaders, hip hop dancers and ballerinas. And the funny part about this is that this stuff has existed and will continue to exist because nobody really cares until a mass outrage appears.Just like it did on Youtube about 1-2 years ago when a guy called it ignored child pornography and there were some wormholes into a mass recommended teen ballerina doing splits type content that Youtube shut down within 48 hours after the whole internet lost its mind.But the thing is it's still there. And many of the videos wont be taken down because of the dillemma I'm about to magnify. How do you differenciate between chiild exploitation and teens just growing up and testing limits?Some say it's super easy and in drastic examples it totally is. But then what happens when we look at Cuties here? People are freaking out over the camera shots, angles etc. Well thats cinematography of girls replicating professional dancers. The things they do is done daily by many other young girls, cheerleaders, in dance clubs, people watching youtube. It's delusiuonal to think twerking and it's massive explosion on the internet hasn't had an effect on kids. Of course it has.And that's what people dont get. The shots, the cinematography, it's all meant to shock you. To show you how early these kids get affected. And if you dont like that. GOOD! That's the bloody idea, people.If you hate the film, by all means. But trying to call it child-explotation or erotica and calling for it to be banned it utterly idiotic because you're trying to HIDE the prioblem that exists ..LITERALLY EVERYDAY.... EVERYWHERE.So. How about you take the message seriously, let others judge for themselves and try to keep an eye on your kid, watch them, listen to them and dont try to mess up their minds with radicalism from either super left or super right from a political standpoint.Because that's exactly what this film captures so eloquently in the first 20 minutes... for crying out loud.,This film wants to annoy you, trigger you, bother you. And it has done so successfully. Question is what you're going to do about it? Learn from the message? Or just call for bans and censorship and follow the blind outrage mob and learn absolutely nothing.This isn't child exploitation. People who like this movie are not pedophiles. Sure some might be because of the scenes. But such people will get off on anything any teen flick shows.And by the way, it isn't the first time we've seen girls dress so wild and act crazy.One of my favorite films when I was younger was good ol' Thirteen with Rachel Evans. That film is a god damn mastepiece in my book. And the reason I mention this is, if you want to tell a new story about a coming of age girl in a messed up society you gotta do 3 things.Nr 1: Try and be original, Nr 2: Be bold and do something new Nr 3: Try to shock.If we tell the same story again and hold back, nobody will watch the movie. I'm personally sick to death of coming of age flicks. They are boring mostly because they are safe.But this one knew it wanted to shock, cause people to be mad. It took what others have done before and went a bit furhter, or a lot futher in other ways. And that's the recipe for keeping a genre or franchise alive. You continue pushing a bit further. Otherwise you stagnate and nobody will go see your movie.Did it go too far? That's up to the viewer to decide. Personally the very fact that this film got made to begin with says it all for me. People just love to be outraged and the mass attack on people who defend it, calling us pedophiles is absurd and extremely stupid.It's as stupid as calling people who hated Star Wars: The Last Jedi a bunch of sexists and racists. Instead of hearing out the reviews or opinions.But yes. 6 out of 10. Above average coming of age flick. Thirteen was better imo. had more emotional weight. Was done more artistically.But Cuties gets the point across well. Parents... stop messing up your kids, stop brainwashing them! Restricting them, or forcing them to be things they dont want to be.Because when you feel like you're choking, you'll do anything, go anywhere, to get away. It's a fight and flight response. And in such an age, we do crazy things. It's up to YOU as parents to learn, do better.Take a long look at yourselves instead of calling for censorship of this film. This ...reflects society. The far right and far left alike This is where your eyes should be aimed at.At preserving balance and healthy growth of young people so they dont end up in these absurd situations. I hope Netflix keeps up the film, but if they dont, well. The outrage mob wins again and nothing will remotely be learned from this.Final thoughts: I find it absurd to argue that this film was filmed and directed by child exploitators. Who intentionally made these clips, zooms and what not to cater to sick people who make up an insane minority of the population.I'm seeing people argue Hollywood corruption, and twisting young minds, normalizing sexualization of teens.All I have to say to ALL of you people.You did not watch this movie. At all. You just read reviews and listened to some rants and think you know the full story. But if you actually watched the ending of this you'd know it does the EXACT opposite.It's because of people like you that Rotten Tomatoes has a verified ticket box on their reviews now, to tell the reader if the review is actually genuine.If you're going to be outraged and spass out online, then at the very least, know all the facts first to make sure your criticism is correct. It's like reading the front cover of Fifty Shades of Grey and say it's a book about female abuse lol.Good lord, people. 6 out of 10. Go watch the film for yourselves and make up your own mind.And parents, stop messing up your kids!"}, {"id": 177, "text": "I love the movie , It would be a great Movie series As they get older and stuff it would be great I enjoy it"}, {"id": 178, "text": "A brilliant film. I can't believe Maïmouna is a debutant director. It's super emotional. It shows us the fake, plastic world we have created for ourselves. The entertainment industry over sexualizes and objectifies women which in turn affects coming of age children. It also depicts how even children can use and discard their best friend just to fit into society. I'll be rattled if it doesn't win an Oscar (foreign category). It's a must watch. Take a bow Maïmouna."}, {"id": 179, "text": "This movie is nothing your average kid isn't doing today. I'm giving a honest review, not jumping on the bandwagon and bashing it just because that's what everyone else is doing. I see kids today dressed exactly like this. No one seems to have a problem with tv dance show kids dressed like this. Kids also imitate other singers and dancers they see on the tv. Instead of bashing this movie why not check in on your own kids and see what they are really up to."}, {"id": 180, "text": "This movie is really, really bad. Should have been made and even breaks laws."}, {"id": 181, "text": "The RottenTomatoes description A thoughtful look at the intricacies of girlhood in the modern age, Cuties is a coming-of-age film that confronts its themes with poignancy and nuance is very good. But somehow short... there is much more in it! The objectification of women at any age, the role brutally given to them at any age, the social stupidity that impose unreachable models (for example, the young girls that want to be older, and the elderly that want to be young), the religious ignorance that leads to the extreme (where the priest is more tolerant than the preachers). And much more... till finding, well hidden under all this merde, the poetry that girls are still girls, if they are let alone. But will be they?"}, {"id": 182, "text": "Most people hate the movie but I think this movies is great, cause it really explains how mostly young female, act in life. Look at the show Dance Moms and Bring It there is a similar situation as the movie cuties as well. If people are disgusted with the movie then why aren't they disgusted with Dance Moms and Bring It with how the young females are dress and dancing. The movie is great but if people are disgusted by it then they should be disgusted as well on the show Dance Moms and Bring It as well."}, {"id": 183, "text": "Give this movie a chance! Its beautifully done, stunning soundtrack.There is more to this movie than provocative dancing from adolescents. Netflix messed up on the marketing for this one but it still deserves a chance"}, {"id": 184, "text": "Something is way off in the way they are describing the movie Cuties. FIRST up, the group of girls before Amy was included were just regular dancing, a regular routine, no twerking, nothing sexual, just dancing. I'm not sure exactly what caused the fight between Vanessa and Angela so bad that Vanessa got kicked out, it wasn't really explained. That was a minus, no explanation.SECOND UP, it is Amy that does a twerk move and Angela asks her what are you doing and then it is Amy that is teaching the other girls the hyper sexual twerking routine. NOT the other way around. Someone wants to call it sexualized blah blah, no, this is a black culture thing. Amy was teaching it to the others - NOT the other way around. Remember, when Amy first saw Angela dancing to Latin music, Angela was doing moves you can see in Tango, or other Latin dancing. Newsflash, in the 1950s I would break out in that kind of dance Angela was doing, it was LATIN dance, nothing wrong with it. They can call what Amy taught them twerking, but I tend to see it as booty booty and well, there is nothing graceful about it, eg, like Latin dances.Amy has a telling conversation with her grandmother or elder aunt - after she gets her period. The older woman describes that now Amy is a woman and when she was young, she was shortly married after that. So, Amy is 11 and she is now a WOMAN. We can't ignore this conversation and just focus on the dancing.STOP AND GRASP THAT BEFORE YOU KEEP GLOMING ONTO LITTLE GIRLS DANCING SEXY. That is made pretty clear and it is NOT so much the culture of the girls she is hanging with, but HER OWN ETHNIC culture. SHE IS A WOMAN NOW AND IN HER CULTURE, SHE MIGHT BE MARRIED IN A FEW MONTHS.It is Amy, again and again that does odd things, the fight with the other dance group where her underwear got exposed. Stabbing a kid in school. Taking a picture of her vagina and posting it. And what about her sexual moves, not dance moves, outright sex moves in front of her elders that caused them to call in a cleric who said she was not possessed. Sheesh. Note that the cleric links all of it to her father's second marriage.The other girls wanted her OUT after all that. But let's top that off with ALMOST drowning Vanessa - like wow. Nobody so far explains that stuff falling in front of Amy's face in the middle of the dance routine. OR the woman in all white that Amy saw before she ran out.So, SOMEONE explaining this movie has got a few things backwards. Her reverting to jumping rope like a child is to show what, the childification of western culture these days? she doesn't want to be the woman she is and perhaps get pushed into a marriage? In her own culture she might be married off in a few months - seen as a WOMAN IN HER OWN CULTURE.Reviewers seem to want to skip the whole bit about her father taking a second wife - and her mother has DUTIES toward that union. There is too much NOT explaned and reviews focus TOO much on the dance routines."}, {"id": 185, "text": "Why does this movie have such a low rating? In a way it reminded me of 1995 film Kids. The story follows a young girl who is raised in a highly conservative religion trying to fit in with the cool girls in school. Communication is so important! The protagonist could have use someone to talk to about what was going on in her life. This girl was going through so much (watching her mother breakdown for becoming second wife, father being absent with his new wife, taking care of her siblings, going through her menstruation, social outcast) just trying to figure out where she fits in the world. Why so many people are disturbed by this film when we live in a society that praises keeping up with the hoes is beyond me? We as a society need my programs where young girls can get proper guidance and a safe place where they can express what they're going through and not use social media or the internet as a guidance."}, {"id": 186, "text": "I just finished watching the film Cuties (2020) on Netflix. Directed by Maïmouna Doucouré, the film stars Fathia Youssouf, as Amy, an 11 year old girl torn between her conservative, traditional family and a group of dancers at school who call themselves the cuties. The film is well written and beautifully directed. This feels like an honest depiction of a girl growing up and trying to fit in. Fathia Youssouf is fantastic, believable, and sympathetic. The other young girls in the film are very good too. The film has depth, heart, and is always engaging and compelling. Doucouré does a great job of bringing out the humour in some of the film's lighter moments. And for those who were concerned or confused by the marketing of the film, Cuties does not in exploit/sexualize children or condone pedophilia in any way, shape or form. If you have not seen the film, you should not be judging, rating, or reviewing it. Now that the film is available on Netflix, go watch it and decide for yourself! My rating is a 9/10."}, {"id": 187, "text": "You should watch this movie , don't judge t without watching it please ."}, {"id": 188, "text": "Movie was a bit slow and chaotic for me, very powerfull message though. End was a bit rushed in my opinion. Proper symbolism and cultural references.A lot of overreacting in the reviews though, its very realistic. The biggest problem was the dancing was the camera trying to highlight the adult dance moves too much.Overal, not a movie i would recommend, but its not an affront to humanity as many other people try to make it out to be. It's just not really good with a few iffy parts."}, {"id": 189, "text": "Its a good story about a lonely girl growing up in foreign country. She try's very hard to have friends like any other child. She has many challenges to overcome and learn. In the end she finds her home."}, {"id": 190, "text": "I am not that familiar with French cinematography but as independent viewer I will just judge it for what it is.The plot is interesting, culture conflict, Amy, shielded from the sick culture by religion and conservative tradition gets confronted by exploitative sexuality. Culture that is cheered in the modern west, lacking any morality.It touches a lot of themes. Self gratification through social media, imitation of others to get social acknowledgement, not understanding the consequences of own actions. The final message seems to be that kids should stay kids and it is probably better for everyone to not cave to popularity.But it seems kinda dragged for too long."}, {"id": 191, "text": "A reminder- the film Lolita has a 6 star average on this website. And not even a coming of age film."}, {"id": 192, "text": "A good watch to see how other people live, it will hold your attention thru the end. Bumped up my rating a star to make up for all of the prudes rating Cuties 1-star, cause they're so offended by the movie."}, {"id": 193, "text": "I have seen many types of films throughout my life. I've seen regular mainstream films, Independents, foreign (to the U.S.) films of many nationalities. I've seen highly religious and/or restrictive films, and one's that have hovered over lines but didn't cross them. I've seen sexploitation films, softcore/hardcore pornographic films; I've seen probably every genre that could be thought up or has been. I'm saying all this 'cause I know when a film is taking advantage of a set of people for a negative reason; and all the hype of this film says it exploits young prepubescent girls. Is it true?I guess it would really depend on who you are as a person. Me, I'm a film lover; I do not like all the films I've seen (my mostly negative reviews prove that) but I do try to walk away with some sort of understanding from the story being told. This film starts off by showing a young girl who comes from a conservative religious family and is introduced to something a bit more liberal than what she has been exposed to from her family. She sees a young girl (wearing clothes young girls typically wear) dancing to music in the laundry. She sees a sort of Flash scene at her school of kids posing or ceasing a dance. Some other girls throw rocks at her that she may admire and at home she starts wearing clothes like the young girls she admires that show her stomach which for her family would be too much. Also, this may be a longshot but I think the main character is attracted to the girl in her building and that's why she wants to be around the other girls to be closer to her; one can tell she never wants to disappoint her. Yes, she tries to get that phone back by stripping down (for a sexual act) but she wanted the phone. Is the dance at the end sexual? Yeah but most dances are--what they were created for to begin with.There's no sexploitation in this film, in my opinion. Netflix's promotion of the film seemed to sexualize these young girls in the film but the film itself does not exploit young girls. It's just about a young girl coming from a strict religious background who starts, in small ways at first, rebelling against her upbringing. The outfits the girls wear in dancing is no different than what any young girl from most democracies currently wear. There are scenes where the buttocks (clothes worn) shown, such as the main character watching during prayers on her phone of women twerking and then she stares at a woman wearing a red dress that has sizable buttocks; though I'm thinking she's imagining the woman twerking and when we get to the first rehearsal of the girls attempting to twerk--yes, if you have perverted thoughts or you're a conservative person, I can see how one would think that's a sexualization of young girls but I grew up in a more liberal household, I guess.What I found disturbing in this film is the blood on the dress. What I found disturbing was how women in conservative religious denominations are treated. Also, what I found disturbing is the fact that in many competitions (like beauty pageants) young girls are told by adults that they have to be more like adults and less like the children that they are. This film showcases that quite well. The girls in this act more like the older dancers so they can become popular and be noticed. That's current reality, and has been for quite a long time, which is sad.A history lesson: twerking came from the 1980s in New Orleans, Louisiana, and by the 1990s became a very popular dance in most of the Southern United States amongst the African-American community. Caucasians started to adopt the dancing style by 2013 when Miley Cyrus made it popular (though in the South it was probably already popular amongst Caucasians, she just brought it to a wider arena.) However, twerking may originally come from Senegal, and the lead character in this is Senegalese.I had no intention of watching this film but I like controversy and those yelling for people to boycott Netflix and this film made me want to watch it. The film trailer did not. I had no interest in the film based on the story and/or trailer.Overall, it's an okay film."}, {"id": 194, "text": "Like many other Netflix subscribers I got intrigued by the hysterical reactions, like 'promoting pedophilia'. Well, that's absolute nonsense. Yes, the young girls perform some very salacious dance acts, but the obvious point is to show the contrast with the very conservative islamic culture of the lead player. The last scene of this well done drama says it all: this is not about sex, but about finding balance in a confusing world of contrasting values. People who call this movie 'sexualizing kids' obviously didn't watch it."}, {"id": 195, "text": "Yes this film has upset a tiny energetic minority who seem hell bent on rubbishing it - hence the low review figure. Other film review sights score it very highly and justifiably so. Simple, honest and even naive film that deals with emotional conflicts as a young girl grows up. It's a bit clunky but high praise to all those involved - more than worth a watch."}, {"id": 196, "text": "This is good! 👍Best movie of the year. Only good thing this year"}, {"id": 197, "text": "Good film I enjoy it,It drag but the movie itself is pretty good"}, {"id": 198, "text": "I watched out of pure curiosity on why everyone was so outraged because I like to go by facts first, before speaking on it. So...I watched...this is reality. Sadly, most girls go through this and are probably doing things like these behind your back, no matter how much you swear left and right my child would never!! There were not that many inappropriate shots, but one is too many and I don't think it was necessary to zoom into their booty, waist...etc to get the point of the movie across, even though I have seen worst things in movies in the past and no one was outraged. I would def agree that some pervs will probably be watching. Even though this is a reality, I don't think it was appropriate for the camera to focus so much on the little girls intimate parts and put it out there on film."}, {"id": 199, "text": "This is a coming of age film in which a young girl rebels against the suppressive religion she is brought up in while having to deal with her father is marrying another woman. Most of the time this genre would limit to playing out a divorce, but this film also shows how the young girl is forced to deal with old traditions and the adults in the family's failure to properly integrate into the French and western society they immigrated to, which further confuses the girl, because her peers lead a very different life, one that is more attractive to her as well. While dealing with the family issues, the film also unashamedly puts a spotlight on where we are today in western society, making it easier and easier for young children to make poor decisions with a smartphone, there's one scene which I won't spoil, but it deals with an exposure problem that young girls don't really care or understand the consequences of at that age. I don't want to write an essay on why this film deserves to exist but I find that the same kind of people hating on this film are also mainly the same ones that shout loudly that children of the same age (and younger!) should be able to make a life changing decision on what gender they associate as, without understanding the very nature of children doing and deciding things without properly understanding the long term consequences. This film shows all of this wrapped in a package of ignorance by adults forcing a religion on a child that makes little sense to her surroundings."}, {"id": 200, "text": "I watched this film from start to finish after having digested days of extreme opposite views online. I'm not one to jump on an internet bandwagon of dissent or praise without getting the facts so the choice was either ignore the topic or watch it.As an adult male it brought back memories of my time as an 11/12 year old boy, and how the girls (and boys) behaved back then. I suspect that since they used child-actors for this movie, the actors need only to have applied the plot line to their present personality state.To the people who said there was something of worth in this movie, you were correct. This is a story that reflects the world we live in.To the people who said this movie needlessly sexualised children, you were also correct. They most certainly could have forgone some of the more gratuitous camerawork/scenes during the dancing, and I think it's a valid critique that this is so much worse when child actors are involved.I rated 5/10, because it feels at least in my mind that the mistake of overdoing the sexual dancing matches the brilliance of the film."}, {"id": 201, "text": "I watched the movie after I listened to the Dark Horse podcast where the hosts (Heather and Bret) were both disgusted with Cuties. Since this movie was already the topic du jour, I watched it and was amazed how well directed and acted it was. I grew up with Fassbinder and Schloendorff, and Tarkovski and Kubrik, and they made some controversial movies, but Cuties is not even that. It deals with the topic of over-sexed teenagers, the influence of social media and different cultures. And if you watch the movie, watch it to the very end: the last minute of the movie is crucial to the development of it's main character."}, {"id": 202, "text": "I gave this movie 5 stars because I am open minded to the fact of what the movie TRIED to do but I am disgusted with the method. This is the movie version of all those side affects you hear about a drug that appear to be worse than the disease.In this case, the film was suppose to be about little girls seeking attention and being in sexual situations well beyond their comprehension. I'm this era of #MeToo, to purposely focus on the private areas of little girls and show men leering at them was too much. The director should have alluded to these inappropriate situations rather that actually show this.The ending reminded me of the Prodigal son. When the little girl realizes all that she has done and strayed away from her path and returns home. The mother embraces her and she goes back to being a little girl."}, {"id": 203, "text": "A rare case where a film transcends itself. I'm sure most people are happy to rate and assess this film without even having seen it. A very interesting phenomenon.I have no desire to see the whole thing but I'm sure the truth lies somewhere between the extremes of opinion. More interesting to analyse the reaction to the film than to analyse the film itself. To stir up this level of vitriol is an accomplishment in itself! So kudos on that!"}, {"id": 204, "text": "Let's be REAL, women know exactly how horrific the realities of what a WOMAN should be are. Although this movie did a weird way of showing it, at the end of the day, little girls nowadays DO this. They mimic social media just like when I was a girl wanting to be like the women in music videos. It shows how easy it is for a little girl to be influenced, regardless of how she was raised. Seems like to me the people reviewing this movie didn't even really watch it. There are so many clear signs that this movie was SUPPOSED to make you want to throw up. Even in the end when the girls were bumping and grinding at the talent show, the audience shook their heads and boo'd. And then guess what? She had an epiphany? She just wanted to be a little girl again. And at the end of the movie, that's exactly what she did. I loved how they ended the movie with her jumping rope and laughing, on top of her getting a whole new set of friends just as quickly as she got her first friends. MAYBE you guys should actually give this movie and chance and some DAMN CREDIT! People are so afraid of the real world."}, {"id": 205, "text": "'Cuties', a French production about tweenage girls trying to fit into our world that limits childhood and is bent out of moral shape.Before its release, radical liberalism showed its stupid and nasty side with an uproar against the poster. People protested Netflix for the sexualisation of kids before watching the movie which was against the sexualisation of kids.Although inadvertently, 'Cuties' gave me another reason why I don't belong to any ideology in this crazy life that is increasingly non-sensical and hysterical. And, if I find this life challenging, then I can only imagine how difficult it is for tweenagers.'Cuties' is a solid and necessary movie."}, {"id": 206, "text": "Cuties is a riveting and very artistically written and directed film. While there is certainly an aspect of it that can seem titillating, the film proves to be both character and social commentary. It is pretty masterfully put together. Well worth a watch unless you just can't get by the sexualization thing. It's about how cultures clash. It's also a commentary of sorts on the state of our collective culture. A global revolution is neigh!"}, {"id": 207, "text": "A generic coming of age story where a girl from an ultra-conservative family gets into an ill-mannered company as a rebellion against literal third-world patriarchy.A new penniless kid comes to a new school. Of course there are problems at home. Only bullies pay any attention to her while representing the freedom as opposed to conservative punishment at home. Bullying turns into servitude and once the servant offers something bullies need they feint friendship. Instead of the generic hooliganism and illegal schemes to get rich with crime fast, this story uses a sports-hobby as an outlet fore rebellion. Rich kid from Dead Poets Society wanted to act, these girls go for modern dancing, which especially offends protagonist's muslim household. And this is where the secondary structure kicks in. Basically middle part is a generic rise to stardom biopic. First success, then fall from grace, then self-destructive behavior. By then end the protagonist is more or less excused from the oppressive patriarchy and mellows out from a rebellion into a basic baseline normalcy.Most of the run-time kinematography is pretty generic too, for both of the genres. A lot of handheld and all the traditional dance shots. Also this film treats the internet fame as explosive magic old-media fame. But there are several magic realism scenes accompanied with wolof music."}, {"id": 208, "text": "Here's the thing. All of the topics in this movie are by no means okay, but it is the sad reality of what is going on in the real world. You just need to accept that. Especially as all of the actors are NOT 11. This movie is just a portrayal of what is going on in a young girl's mind. One thing to also accept is that this movie is foreign. Not everything is the same in those countries. It's not like you would go to a country where there is a lower age of consent than you would like and start disrespecting everyone who engaged in sexual activity at the legal age.I think it is very obvious that not many parents know that their kids are and will be sexual at that age. It's normal. And something I did not appreciate when watching this movie was the Aunt or grandmother (whoever she was) laughing at the young girl's period. This can really bring down self esteem and should not be encouraged. I think parents should be more considerate and accept that this is the life of most normal teenagers. Cheers."}, {"id": 209, "text": "This was the best movie ever. Love the dancing and great actors. Would Watch afasin, is there goding to be a second movie? I hope so."}, {"id": 210, "text": "This is a pretty decent but not great movie.This is NOT a family film. It is NOT about sexual exploitation. The backlash against it is ridiculous. I suspect a lot of people don't watch a lot of movies based on what I'm reading here. Stuff like this comes out often, perhaps just not as publicly as Netflix, but more like late at night on an HBO sub channel and it rarely gets noticed.This is a coming of age film about a girl whose friends and their dancing and modern less traditional behavior conflicts with her family's very traditional way of life and religion as she reaches her puberty and her teen years when girls would possibly experience a similar situation. The story is about her internal and external conflict and emotional development in regards to this.The film is decent in that regard, it's a little over the top but you're using young actors and actresses for the most part. Some of the stuff is obviously intended to be presented the way it is to create a more extreme picture of her conflicted mindset.I'm not really sure if people are even actually watching this or just bandwagon jumping against Netflix."}, {"id": 211, "text": "This movie at its core is about the performative expectations of young women in modern society and the conflict those expectations can cause. The main character, Amy, is raised in a traditional Senegalese household and is taught that the exposed female form is to be derided and shamed. On the flip-side she is also a child in the late-2010's bombarded with the expectations of social media, and modern culture at large that prizes raw sexuality and fetishizes youth.Through the course of the film Amy finds that no matter which side she attempts to please or conform to, she finds herself fundamentally unhappy and both cultures, traditional and modern, find her lacking the necessary grace to be accepted.This film discusses the real world struggles for identity and acceptance that many girls deal with on a day-to-day basis, and highlights the stark contrast between the modern performative expectations of sexuality and a girl coming to own her sexuality in a healthy constructive way. Similarly, we see how even when cloistered from modern society in a Senegalese closed-community the expectations of sexual ownership and femininity are similarly fraught. This is displayed most prominently as Amy's mother finds her husband has taken a second wife without her approval and she (Amy's mother) is expected to carry this burden with grace and without protest.As for as the over-sexualization of the child performers is concerned, I can agree that some of the filmography lingers unnecessarily. I believe a greater distance from the performers would have given the audience a better perspective on what our culture expects (See: Tiktok, Instagram) versus the youth of the performers themselves. The film does not glorify the over-sexualized actions, it condemns them. The film never encourages you to enjoy these scenes, but to be made uncomfortable for good reason. Young girls should not have societal pressure to be performatively sexual enough for society. They deserve to come to explore and own their sexuality for themselves and themselves only.This is a nuanced film that deserves a nuanced viewing, and yes, a viewing. If you have not watched this movie in whole you should not be speaking on it. You are speaking from a position of chosen ignorance and even if your feelings about the film don't change after you have seen it, at least you have watched the source material whole-cloth.This is a story about individuality and shrugging off the mantle of societal expectation both modern and traditional.This is a very well told story and I give this movie an 8/10."}, {"id": 212, "text": "Let's start with this - I am a parent and I am a huge fan of the French Cinema. Over the years they have proven, that in France they can do really good movies. This one however, while good and with a point, went so much over the edge, that I seriously want this movie to be banned. Let me tell you why.First of all, I got the wrong impression this is gonna be a reality show, like Toddlers and Tiaras, because the original Netflix promo graphic was so misleading. No, it is not. It is a full-blown movie, with a generally well told story and a point. Basically it tells the story of a modern-day immigrant Muslim family from Senegal, living in Paris, France. The main character is an eleven-years old girl. The family is poor and the mother is struggling to live in the big city, as the father is absent, also struggling with her personal drama. At some point the girl meets the coolest local girls in her school. All of them - eleven years old and they want to win a dance competition, for which they formed a dance group. Their name - Cuties (original French: Mignones). Their ideals - the modern hip-hop overly sexualized internet celebrities. Basically, we are shown the drama of some of the Cuties - one of them confesses that she is not approved by her own parents, for which she craves the approval (the likes) of Internet and the audience, when she dance. And one way or another, this is basically the drama of all of them - the Cuties - they crave the approval (likes) of their audience, because they lack the approval at home. And they are determined to get these likes. The girl does her best to integrate in their company and since they value the good dancers, she becomes a dancer too. Main thing is, she is trapped in between this modern sexualized internet culture and her own Senegalese Muslim culture. In the end she chose to be something in between - her very own version.Basically the movie is one of these Coming-Out-Of-Age stories, focusing on the girlhood this time. I would say, basically the concept is really really good, but as often, from the concept to the realization there is a gap. Today I have read, that Netflix pushes back the critics backlash with the words that most of us miss the point. Well, this is the reason I decided to watch the entire movie and yes - there is a point in the end, however to get there, the story and especially the visuals (A serious warning here!!!) go so much over the edge of sanity, that I seriously think this movie should be banned. If the director just wanted to make a splash and attract attention with a scandal - there she goes, it happened. But if she really wanted to tell this otherwise nice story, why don't she chose a more mature and elegant visual line to say it? But no, here we go now.I want to write a very bold line here - THIS MOVIE HAVE EXTREMELY SEXUALIZED VISUALS ! PLEASE ALL PARENTS BE ADVISED !! (No, there are no sex acts, however such were suggested at few points to be about to happen with - again - eleven year old girls, so what I mean are other - both clothing wise and acting wise visuals)Is this where we are at? Is this where we are going to? Is this what our children are? Is this what our children are going to be ? And JUST AT THE AGE OF ELEVEN ??? Hell no !!Even just watching this movie is dangerous for younger audiences. Sure, they can watch similar things on internet, but Hell, putting it also as a movie is too much, especially in our homes, as Netflix did.And yet, can we say something good about this movie? Yes, we can. As I said, the concept is actually good, well told too. I just wish the visuals were put to a mature and acceptable level. Also, I just need to mention the music. Basically there are two types of music in the movie - the modern hip-hop music and Senegalese music. True to be told - the Senegalese music in this movie is really good. It was a honey to my ears to hear it, especially the final credits song - exceptionally good song ! The other good thing I would say is the acting - everybody acted well, at least my opinion. The cameraman was also doing a good job. And that's about it. The director - please do not give this person to direct a movie again.PS: I just saw trailers for the director past movies and discovered, that actually half of the main story is just a re-iteration of her movie Mother(s) (Maman(s)) 2015. So why re-telling half of the story in a new movie? Was this movie just to show the new super-exaggerated visuals? Makes absolutely no sense to me. Please stop making movies.Thanks."}, {"id": 213, "text": "This film amazingly captures and exposes a rare look into a wide spread pandemic/sub-culture of kids that this generation wants to pretend doesn't exist that are not only influenced by tik-tok, youtube, instagram, twitter, etc.... but are constantly forced to idolize Disney role models like Miley Cyrus, Bell Thorne, and let's not pretend nor forget how music videos are constantly shoved down their throats on their social media feeds on a daily basis from Iggy Azalea, Nicki Minaj, Rhianna, Cardi B, Megan Thee Stallion, Ariana Grande, etc., sound familiar? and then all the hypocrites want to act surprise when young kids turn out like the role models you constantly feed them and pretend it doesn't exist, just like you were shocked when Marilyn Manson appeared on the scene even though you've constantly been throwing it down kids throats for years, gotta love the blatant hypocrisy there lol. Just go on tik-tok and see all the evidence yourself. That's not to point the finger at any of the previously listed role models but this film cleverly points the finger at hypocritical culture itself, because you have to be totally be asleep to not see this coming.The even more interesting fact regarding this film is also how it beautifully brings all the hypocritical, pathetic, two faced, sheep out of the wood-work and to the fore-front, as they all pretend and act like this film is so shocking or surprised at a film could expose such culture that in most cases actually realistically reflects the very childhood that most people don't wanna admit they have either lived themselves or their kids are currently living right now, make no mistake...well guess what.... IT'S NOT A SECRET!!! this film is right on point with our culture to the point it's probably reflecting a huge turning point of the new norm that's here to stay so again why all the uproar? If you find this film offensive perhaps you should look in the mirror. Due to this fact, the rating is totally biased and inaccurate.So as for the film itself, it was a very well scripted piece of cinema, the kids did an amazing job acting out their roles for such a tough subject matter. Love the french accents."}, {"id": 214, "text": "If I'm being honest, I watched this film because of the controversy that it sparked. However, as the saying goes, you cannot judge a book by its cover (or in this case, it's movie poster) and I was pleasantly surprised. This film tackles the subject of young girls growing up in a world with cell phones and social media and a predisposed image of what womanhood is. It also shows what happens when there is little genuine parental guidance given to a child who is struggling to discover who they are and where they belong. However, the film predominantly focuses on one girl who comes from a unique background. This girl is from a Senegalese family who has very different cultural values and beliefs than the country that she is now living in, which is France. This girl struggles with going from one extreme to another, as her home life is very different from the life she experiences at school and elsewhere. At first glance, the film may only appear to focus on provocative dancing. inappropriate behaviors, and a slew of crop tops displayed by a group of children. But these very mature dances, behaviors and clothing are clearly the result of what has been shown to these girls through social media and viral videos that they have come to follow and idolize. This is a very real depiction of what happens in today's world where children as young as 10 are given phones and laptops and access to this kind of material. And by the way, some of the dancing is SUPPOSED to make you uncomfortable. You are supposed to feel like what you are seeing isn't right. You are supposed to feel the same emotions that many of the side characters feel when they show disgust and disappointment with the girls' actions. I don't think these scenes are glorifying their behavior by any means.These scenes are showing you exactly what is happening in real life. Young girls are learning these dance moves from online. Young girls are wearing crop tops and short shorts and teaching each other how to twerk. This is real life. If you are a parent, you need to pay attention, because this is how social media can influence your child, especially if they are young girls because the only representation they have for what a woman is and what they are supposed to become is what mainstream media is showing them. I personally know this as I am a young woman myself and also struggled with the hyper sexual culture that I felt pressured to adhere to as a preteen. This film does not endorse or glorify the sexualization of young children. It is a film showing how social media and different cultures can shape a child and why it is so important for the rest of the world to take notes. Overall, I think it is an important movie that is worth watching. It is risky, bold and in some scenes uncomfortable, but it is also very realistic in many ways."}, {"id": 215, "text": "Yes I watched this. When you've watched you can no other than conclude it is an amazing movie. It shows the conflict of a young girl Amy coming of age within the modern society in the suburbs of a french town, and her traditional family that is in struggles because the husband takes a 2nd wife. As protest and not knowing how to deal with the situation the girl joins a dancing group. Now the acting of the mother is a bit dull, but the young girls shine, they do an amazing job and you really feel a part of them. Also you can really feel the struggle Amy has with her family and the life she's confronted with in school and the dancing group that goes too far in their performance, copying sexual music clips. In the end we see her become a young girl again but also able, and allowed, to make her own choice.Now I do understand the criticism that certainly the last dancing scene is over the top. Yet I also understand why they choose to put it in. Without it the message of the movie would have been lost and it would have been about a girl joining a dance group. This is the reality that girls of 11-12, that for the first time are confronted with the sexuality of their bodies, are confronted with on youtube, Facebook and other social media. And are unaware of reality of how older people relate to it, certainly in lower classes where there is less education and awareness taught by the parents.The puritan, religious forces out there will be quick to condemn this movie for sure, often without having it seen. I can understand some people will be shocked by some scene's. Yet it is good to realize this exists, and think how to avoid or at least better educate young children that are coming of age.What people often miss in this movie it is not just about what young girls are confronted with and coming of age. But also the pressure they feel in a group to go beyond a certain point, the conflict of tradition with more loose morals, suppression of women (we need to be submissive to our man), and the misery of poor suburbsok puritan and religious armies...now press no"}, {"id": 216, "text": "Mignonnes also known as Cuties is an unusual film, not only in its subject matter but also the kind of film this is. There really hasn't been a movie this honest about coming of age since 1995s film Welcome to the Dollhouse by Todd Solondz. In the film we follow Amy Yiop a 11 year old Sengali Muslim girl living in a housing project with her mother and two younger brothers. Amy is very much an outsider in her community and finds herself unable to find comfort in her home life due not only to the overbearing presence of her younger brothers, but also of her mother and her religion's strict and conservative structure. However once Amy meets Angelica and her dance troupe known as the Cuties she finds herself in an uncomfortable place between her family's traditional values and the more exploitative world created by popular trends both in a real life and online space.The movie is certainly an uncomfortable sit, and that's by design. Much like the aforementioned Welcome to the Dollhouse this is a de romanticized coming of age story that is presented without the nostalgic filters and softer edges that many seem incapable of escaping. Even so called gritty coming of age stories like Jack the Bear, Radio Flyer, The War, or The Book of Henry despite having darker subject matter are still accompanied by a level of polish that makes them feel more like updates on Grimm Faerie Tales than actual slices of life.As someone who grew up with a younger sister who was this age when I was two years older than her, this movie is true to life and growing up when Britney Spears was all the rage my sister did EVERYTHING she could to emulate the pop idol flavors of the month despite the fact it was garnering her the wrong kind of attention, but as many of us know the middle school years are not exactly a spawning ground for good decision making. The Middle school years for better or worse are a no mans land as far as childhood is concerned, you no longer have the excuse of kids being kids nor do you have the rights and privileges of a teenagers, it's a state of flux that's as uncomfortable for the child as the parents if not more so. And since you're no longer considered a full on child we rebel against our established status quo because in our naivety that's what adults do. It's Amy's discovery of demystifying and discovering the world beyond her protective and strict childhood bubble that makes the movie feel honest on a level we haven't seen in a while.On a side note: For those claiming Hollywood has sunk to a new low, this ISN'T a Hollywood movie! It's a French production! You're entitled to your opinion, but learn basic geography and maybe actually try SEEING the movie before booking a ticket on the outrage train. As former Mormon director Ken Gire once said I would rather be told an R-rated truth than a G-rated lie. Lies are sweet, but they're ultimately empty."}, {"id": 217, "text": "Let me just start off by saying that this film is quite literally borderline child pornography. Several times throughout the film the girls dance seductively, sometimes in front of grown men, there are close up shots of their private parts, and they engage in activities that no eleven year old should be doing, especially in a film. I will give the film some credit however, when the children are actually given real scenes to act in, as opposed to just dancing seductively, they do very well. They are all relatively unknown actors, which can always be risky, especially with child actors, but they all give fairly believable performances. From the way critics talked about the film, it sounded as if it was trying to get across some sort of feminist message, but in my eyes, as well as the eyes of most casual viewers, the directors of the film, Maïmouna Doucouré and Denny Shoopman, do the exact opposite of that. I believe that there are many times throughout the film where they choose to just portray these young girls as objects, and sexualize them, which is totally not feminism. It is even worse that they are such young children too, and that is why it has been considered to be borderline child pornographic. One thing I will say is that they definitely TRIED to get a good message across, and there is a good movie and story in there somewhere, they really just went about it in many wrong ways."}, {"id": 218, "text": "Revelations abound in Cuties, screen played and directed by Ms. Doucoure: Senegalese culture; Moslem women praying together (an unfamiliar scene to most Christians); laic French schools rocked by volatile, cruel, energetic, unpredictable, creative teenagers; younger minds hugely influenced by social networks, and all this mixed with explosive hip-hop or soothing Vivaldi score and sensualized dancing. I agree that, at times, cameras focused insistently too long on anatomic (clothed) body parts of the teenager dancers. Calling for a Netflix boycott, though, is as wacky as the 1999 NYC Mayor Giuliani (yes, that same Trump lawyer) threat to defund the Brooklyn Museum of Art, when it exhibited a painting from the London Royal Academy of Arts, representing the Virgin Mary. I wrote then against curtailing art, and I do so now. America is still the land of free expression, I hope. Anyway, to refreshingly return to France and Senegal, the story shows how old culture, represented by an implacable old aunt, can oppress the younger generation, both sweet and conflicted mother and joie-de-vivre daughter Amy, into believing that men can do whatever they want and that women (especially immigrant and dependent) must abide by their will. In this instance, it is Amy's father bringing home a second wife, which the first wife must accept, actually with joy. Amy is distraught at her mother's tears, which sobs she overhears while hiding under a bed. Amy starts acting irrationally, mostly by expressing herself through wild dancing, stealing, and disrespecting the gathering as women pray Allah. It comes to a moment when her family thinks she was possessed by evil. In a short but intensely emotional scene, a spiritual man is called in to evaluate the devil in Amy. Amalgamating his Moslem and Senegalese ancestral beliefs, he reaches a stunning conclusion. Towards the movie's end, the climax generated by all violent competing cultures, music, dance, youth irrationality, converges into a maternal scene that would grab your heart. Ms. Doucoure won the Directing Award at the Sundance Film Festival in 2020. At this writing, it has an 88% Rotten Tomatoes rating."}, {"id": 219, "text": "In this review I am not speaking to anyone personally ok? I know everybody's different. I am just trying to make a general point I think might be important. Because I feel this movie wants you to think about something that seems to mostly get missed and lost into something else.A little story for you:A lot of you come here and review this movie into the ground, even down to a 2,7 general rating now. And your reasons all seem so understandable! This makes me sick! Kids are being objectified! Disgusting! How can you oversexualize children like this?? This is disturbing! All very valid concerns.Yet at the very same time, probably most of our 11-year old girls are big fans of people like Miley Cyrus and Ariana Grande. Who are all about stuff like Look at my hot (---)! I want to (----) you from side tot side Watch me twerk my (---) up your (----) And much more of this, all while sticking out their tongues and wearing as little fabric as possible. Little girls of that age are going to those people's concerts even. And yet I can't remember ever hearing this many complaints about that fact at all! Naah, that is all completely fine and totally normal and accepted. It's THIS MOVIE that is pure evil.End of the story.Now I am not judging ANYONE. I have absolutely nothing against the previously mentioned pop-artists. Heck, I am a man and I have no kids myself. If it were up to me, and me alone, Miley could twerk it 'till next sunday and wear even less while doing so! But still there's something really off in the story above don't you think? Like something that doesn't seem to make any sense at all to me... if only I could put my finger on exactly what that is.... Maybe we should all think about that a moment, see if together, we can figure out what's wrong with it.Of course you already see what I'm geting at. I think this might be EXACTLY, what this movie wanted to make you think about. What this movie wanted to make you FEEL. And yes, judging by many reviews it seems to me you ALL felt it, no doubt! But most of you seem to have completely denied the actual point in sheer outrage.I thought this actually was a pretty good movie! And for me personally, reading the reviews almost made me afraid to go watch this. But I never really felt like I was just watching 'sexualized little girls'. Not ever, for one moment even. And that is because the movie just kept me captivated in constantly being a pretty interesting story about so many complex human emotions and issues! When I remember Natalie Portman as a child in the movie 'Leon', or some movie Chloe Grace Moretz was in when she was still underage, I really don't feel this was that much worse..?End conclusion: I simply think this was a good movie. With a very real, and valid point it is trying to get across. I think this movie does NOT deserve this terribly low rating."}, {"id": 220, "text": "I have to step in on this. I watched this, even if it's not my kind of movie because i saw a headline about Netflix being charged for streaming it.Please, if you have not seen it but instead ended up here reading the comments, read mine also.First of all, there is no underage sex in this movie. The girls are not interested in sex and rhe movie does not promote sexual abuse or seriously underage sex. THIS WOULD be disturbing. The girls ARE interested in social acceptance, social popularity and like many pubescent teens they try achieving this with sex-appeal, something that it's new to them as they are growing up. The girls in this movie are not prebuescent children. They all are in a phase between child and woman wich, as we watch the movie we learn (or remember) its a difficult phase.Yes, the director decided to show us how much they try to sexualize their performance. not to give us a free pedophile treat but to make us understand that this is real ,this is happening. 11 year old girls with changing bodies DO sexualize their behaviour in order to achieve popularity. It's straightforward because it's european and we dont care about this so much, sorry.The story is good and the performances are brilliant as they clearly tried to actually cast girls as close in age as the leads.In the end, i am sorry to say this - the world is not crumbling upon our lack of morals but, if you ask me, it does because our new habbit to get offended each and every time we get the chance!"}, {"id": 221, "text": "Let's get this out of the way first. Before they are satisfying, safe entertainment, movies are art and art's job is not to please or to satisfy, but to provoke, incite, dare and contribute to social, cultural and--in case of masterpieces--existential progress. Needless to say, if you scuff at this movie based on its surface level presentation and (admittedly) unwise marketing campaign then you are completely missing the point.Great, now that we are on the same page, let's actually start the review. Maïmouna Doucouré's Mignonnes deals with one of art's oldest themes--religion meets consumerism, or faith meets secularism or, not to over-dramatize, conservatism meets modernism. Like all great movies, its themes are not directly thrown in your face, but are shown at work. Here, on 11-year old Amy (Fathia Youssouf) who lives in Paris with her Senegalese mother Mariam (Maïmouna Gueye) as they await her husband coming home with his second wife--they are practicing a polygamous faith heavy on abstinence--but only for the women--not surprising considering how most of these faiths are paragons of misogyny. But Paris is not a conservative or misogynistic town. It's a melting pot of cultures, liberation, prosperity and--in its extremes--promiscuity. It is only a matter of time until Amy discovers it.As she inevitably does, when she meets a group of 11-year old girls at her local school. They call themselves Mignonnes--Cuties. At her age, Amy is easily influenced by their tight clothes, multi-colored hair and sheer attitude. At first, the girls gawk at her, but over time, due to her insistence driven by desperation and hunger for freedom, they join her into their entourage. They are break-dancing amateurs, fascinated with the world of overly-sexualized dancing and twerking.But what Amy discovers is not the real world. She is stuck between extremism on both sides--on one, a heavily restrictive and ancient faith, and on the other, a world driven by the excess of internet consumption and modernity. But, as far as she is concerned, she only considers the former extremism. This is the though life lesson the movie throws at her. As she becomes more engulfed with the outside world, it transforms her. But what she wants is not that life--what she actually wants is an escape from her current overly-zealous life and she fears her destiny of becoming just like her mother. A character which bears many sorrows of which she cannot discuss because it would conflict with her faith. While Amy is a force to be reconned with as the lead, her mother Miriam often steals the show by showcasing true, unfiltered womanhood power--which all to often is defined by women suffering in silence. Her character is worthy of respect. How can a woman--or any human being, really--can be expected to bless the marriage of his/her spouse with another person. This line of narrative sparks a parallel idea to that of Amy--the eons-old mortal burden of faith and just what to make of it, how much can you take it? How much SHOULD you take it? It's philosophy's dream and agnosticism's nightmare and the movie is richer for it.But coming back to Amy, the movie climaxes with her and the rest of the Cuties doing their dance routine at the competition they've been practicing for all time. Their dancing involves internet videos-inspired pelvic thrusts, fingers-in-the-mouth and twerking. This is stuff which they obviously have no idea what it means. It is a premature coming-of-age, brought in by corrupted expectations of maturity and just childish innocence. I admit, it was difficult to watch, but I persevered and I was soon rewarded with a moment of epiphany.Without spoiling it, the movie proves it's worthiness by providing Amy with a cathartic release. With an ending as simple and obvious as it is ebullient, the movie wraps itself up unpretentiously and it is simply beautiful. For those of you who got to that point, I congratulate you--you guys get it. For the others, please, do yourselves a favor by setting aside your prejudices and just go watch it already."}, {"id": 222, "text": "If you're focusing on the movie's message and not the thoughts of So we made a movie about sexualizing children, sexualizing children then you need serious help. This movie does not deserve any positive attention whatsoever and it bothers me that everyone is trying to make us look stupid. Y'all don't realize that defending this film is also you trying to normalize child sexualization. I totally get where everyone is coming from with the story and message and what the movie is about speaking against it with the young girls and their troubled life and family which they are forced to dance but the filmmakers literally went out of control and decided to sexualize the children dancing seductively just to make a movie against sexualizing children. And I'm not just talking about that one scene where the camera zooms up on their lower regions, I'm referring to every sexualized scene of any child actor in this movie. You people can't be normalizing stuff like this! All this is doing is making Hollywood even more corrupted. It's gotten bad enough as it is. And Netflix is proud of it. But this film has no excuse to be given a positive review. All you're doing is making France, Hollywood, and Netflix look completely harmless!"}, {"id": 223, "text": "This film is meant to show how this generation's effect on young girls (Over-Sexualization). For the most part, it does this quite well. As a minor myself, I have seen (not directly, both on and offline) situations, people, and places that correlate with what this film is portraying. This film is somewhat accurate in it's portrayal of the Sexualization of minors, and it's impact on them. The direction is good and the script is compelling.With that being said, no one has to actually SEE the sexualization for this movie to be effective. Like really, the director could have just implied some stuff, or just tone down the sexualization. If she did this then the movie would still get it's point across without bordering on exploitation.Overall there is an insightful movie to be made out of this movie's themes and ideas. BUT, it's clear that the director is to disconnected from her subject on a personal level. She injected some of her own beliefs into the script that don't really work well like her religion and experience as a refugee. She does have legitimate insights about the sexualization of minors but they are mired in her world view which, since she is in her thirties, was formed in a very different generation.It says on Wikipedia that she did a lot of research on the subject, but no amount of research can make up for the perspective of personal experience. As I stated before, I am a minor and I have seen real situations like this. Albeit they are different from the movie but deal with the same subjects. I think that this movie's problem (among other things...) is that it was made to early, and by the wrong person. In 15 or so years my generation will be adults and some of those adults will be filmmakers. If those hypothetical adults who experienced what this movie tries to convey made a movie about this stuff, it's at least certain that it would be more informed and accurate than this movie."}, {"id": 224, "text": "First of all, coming to this page I was very suprised about the low rating - especially the curious (dubious) number of 1 Star ratings. I have to say that I'm from Europe and didn't realize that there was a such controversy in the US right now, surrounding this movie. (Here, it is received quite well by almost everybody who has seen it) A rule of thumb: If there is a large number of extreme reviews that clearly do not reflect the overall quality of a movie (RT score 85%), something fishy is going on. I had to dig a little bit deeper to find out that there seems to be a concerted effort of some religious fringe groups trying to badmouth this film for no apparent reason other than it somehow collides with their sense of morality. That I find really disturbing, but nothing Netflix should be concerned about. They have to be applauded for not only pushing Hollywood blockbusters but also such fine arthouse films. This will certainly rather boost their image than damage it.Now for the movie itself. Mignonnes is primarily a coming-of-age drama about a girl (Amy) from Senegal who is offered the choice of two extreme life styles and is torn between them. Added to that is portrait of the working class, which, without much perspective in life, simply tries to get by day to day somehow. The world of dancing is offering Amy not only a mark of identity but also the opportunity to escape her dreary surroundings. The film offers us both the perspective of a young girl who is in a difficult transition phase, as well a criticism of patriarchal societies and other questionable systems.Should be watched especially by parents, ideally with their daughters together. So don't get fooled. I'm sure, over time troll ratings of religious extremists will be drowned out by actual movie watchers who appreciate entertaining art."}, {"id": 225, "text": "This very controversial Sundance dramatic director award winning movie is most definitely one of the hardest to watch movies to come along in a decade. The issue with many viewers is likely its apparently derogatory and salacious content, not its decent production or directorial value. But like those boundary-violating movies or events that cross generations, James Dean's Rebel Without a Cause (1955) or the musical beginnings of Jazz and its purported depiction of debauchery of the youth, Cuties if courageously watched through to the ending offers up a similar departure for those coming of age movies. The moral tone throughout most of the movie appears to encourage graphic and blatant lying, stealing, sexual permissiveness, disrespect of tradition, bullying and even physical violence and disregard of human life. Yet this hardcore mirror on real life and the struggles that cultural differences and the complexities of growing up in prepubescence in modern European society offers a cruel and un-sanitized look at such a world that offers little in the way of moral guidance, direction, or understanding for the modern age youth. But in the final unexpected scenes, there is found some manner of (unfortunately) underdeveloped redemption. Surprisingly the ultimate movie offers not an endorsement of its presenting conflicts and controversial acts and behaviors on the screen, but a stirring message of realization of the necessity of looking deeper inside the turmoil and conflicts experienced by young girls and the understanding and love that may come from those responsible for them."}, {"id": 226, "text": "A lot of unnecessary hate because of the hyper sensitivity revolving around the sexualization of children. We should say that's rightfully so but we should be making sure to attack the proper sources of said problem. Everything is perspective and my own is that this is more about showcasing certain problems that lead young girls (could be said for boys as well) to making dumb choices. The movie is actually very solid and is about so much more than just that.A few things to take note of: 1. Very solid storytelling about culture/religion and the potential impact on a child's upbringing 2. Solid acting all the way around especially from the children and lead actress 3. Definitely some uncomfortable moments that should make you scratch your head as being unnecessary (close ups during dance sequences and the water scene). Someone should have made better judgement calls and included the scenes but take a little better approach in how they are filmed. I guess one could argue that it is to make the viewer uncomfortable and falls in line with us seeing a child struggle through her own learning experience of what sexuality is supposed to be. 4. Written AND directed by a woman so it's not some male fantasy movie and rather about the story showcased. 5. Depressing and sad tale about a child being influenced negatively by ignorance and her families struggles.A solid movie that both my wife and I enjoyed for what it was without losing focus on the story because of a few uncomfortable scenes. There is other content out there like Dance Moms and other YouTube videos/TV shows that are worse than the depiction in this film."}, {"id": 227, "text": "💯% Practical Reality of the Blind Society &amp; Realising Finding Ones own Unique Place in this Society.At First one must have the Maturity Level to understand this Movie.It's an Whole Movie, which has all the aspects of Life.Only 10% of the People Realise, Find Themselves &amp; Live an Matured or Sensible Life, like shown in the Climax.All the other 60% lives &amp; dies Blindly. Rest 30% getting used to it.At first someone must have the guts to present this kind of Movie, dumbasses, Blind Brains will never ever Understand this. Coz. They r used to it or they will be already blind.Hope this World gets more good Movies from this director in the near Future.💯 Life"}, {"id": 228, "text": "This film is somewhere in the middle of what the conflicting reviews are stating, clearly confused on what it is exactly trying to be. Cuties eventually had a point to be made, but it took an extremely long time to get there, along with far too many contradictions. If filmmakers want to teach lessons with their work, they must also apply those same standards to themselves. Objectifying children to prove a point against objectifying children is a rather problematic way to go about it. To be fair, it was never as graphic as its critics would have everyone believe, and I would advise everyone of both sides to refrain from getting too biased about a movie without actually seeing it. Regardless, whatever point the director was trying to make would have been better expressed with some nuance.Now, imagine a version of Cuties without the controversy. What is left? Not much of anything, to be honest. It is simply a basic coming-of-age tale, only this one had an exceptionally poor script that lacked the realism necessary for the genre, plus some extremely unlikeable characters to boot.If any credit can be given to this movie's content, it is that art is in the eye of the beholder. From the perspective of young women who have experienced similar upbringings, this may have very well been a form of art spoken just for them. Regardless, the controversy was the best thing that could have happened to Cuties, otherwise it would have faded into indie film obscurity, because it was simply not that well made of a product."}, {"id": 229, "text": "There's nothing wrong with this movie. It is a very good film about cultural differences. And 11-year-old girls ... being 11-year-old girls!Some write 11-year-olds do not dance that way. Yes they do. I have acquaintances with children of that age. So I know. By the way, there have been YouTube videos with girls of that age - and younger - dancing like that, for many years. You see the same in talent shows on tv. Well, maybe not in the hysterical United States. Can see someone writing he should not risk seeing it and being registered by the CIA. Is that really how it is in the US? If so, I really feel sorry for you!11-year-old girls also focus on their bodies. Shouldn't they be allowed to? Yes they should! And the camera guidance? It may be a bit controversial. But it is not in any way repulsive. It fits the story. It suits the film. And thank goodness someone dares to make an honest portrait of reality. It is needed in these times where everyone is being offended by everything.If you think this movie sexualizes children, there is someone wrong with your mindset. Not with the movie."}, {"id": 230, "text": "STAR RATING: ***** Saturday Night **** Friday Night *** Friday Morning ** Sunday Night * Monday MorningAmy (Fathia Youssouf) is a young girl living in a French suburb, with her devout, conservative Muslim family. Her lack of awareness of the outside world makes her come off as an outsider, until one day she happens upon a group of free spirited girls, including Angelica (Medina El Aidi), Yasmine (Myriam Hamma), Jess (IIanh Cami-Goursolas) and Coumba (Esther Gohourou) who want to form a girl group. Initially spurned by them, they gradually form a bond, as Amy becomes more aware of her femininity and sexuality, putting her on a collision course with her home life, where a woman's modesty is valued above all else.If any group is going to set out to launch a smear campaign against any piece of art, they should never forget the maxim of 'no publicity like bad publicity.' The more something is condemned, the more eager it makes some, like myself, to get to the bottom of what all the fuss is about. Writer/director Maimouna Doucoure's coming of age tale has caused an uproar among right wing online commentators, accusing it of outright promotion of paedophilia and telling people to cancel their Netflix subscriptions, leaving you wondering if the largely minority cast is just a coincidence.All the outrage honestly comes off as largely overblown, the girls skimpy outfits and 'twerking' sequences merely reflections of the sexualization of numourous girl groups in music videos, that girls of that age, being the target demographic, naturally want to imitate. All it really ends up coming off as is an average but effective drama, about staying true to your individual identity rather than changing to fit in.It's not a film I probably would have bothered with if it hadn't been for what seems like a lot of manufactured publicity, and so the online activists seem to have failed in their quest. In that regard, I'm pleased to have seen a fairly affecting, life affirming little film to lift the soul. ***"}, {"id": 231, "text": "Brilliant, just brilliant, one of the best movies for years. I can surely understand why this is praised by people who has _watched_ the movie - and yelled at by people who just saw the poster and got in the I am offended-mode.This is Maïmouna Doucouré first feature film and she is clearly a talented instructor.The movie is about a young Muslim girl which is trying to find a way out of social control. Her mother is keeping up appearances but is deeply unhappy and miserable. In the mosque, they are told what real women are and the girl looks behind the facade and sees all the lies. She gets fascinated by 4 girls the same age which is training to a contest and is trying to get in the group.The way a troubled child screams for help. The grown-up's reactions that they have no idea what happened in their children's life. The parallel society is shown brilliantly. The movie is in that way very realistic. The children acts very well.If you have watched this movie and you find the scary part is a child's bellybutton, you really need to watch it again and make sure to watch it til the end.Brilliant movie."}, {"id": 232, "text": "Disturbing? True A slap in the face? True Totally unconfortable? TrueTo those who see erotism or exploitation in this movie, you've missed totally the point and perhaps should question yourself about some of your ghosts.This movie is nothing about erotism or sex, but all about parenthood, cultural and religious beliefs, society and integration.It's about the role that parents have in their children lives. About the pressure and expectations of society. About being a child alone in the world, in one of the most delicated moments of life, and make decisions. Good or bad.A must see movie to all parents, with open and critic mind. If you can't see beyond the images, walk away from this movie."}, {"id": 233, "text": "It isn't often that Netflix manages to ruin a thing just by marketing it, but it totally did in the case of Mignonnes. I tracked the film because it did well at Sundance, but I almost didn't see it because of the unfortunate Netflix marketing campaign. (Seriously, whoever was responsible for that needs to be suspended until they get professional help.) When it premiered, however, I decided to give it a chance and I'm glad I did.Without going too deeply into the movie's plot, it is a coming of age movie for children in the digital age and it does venture into the complications of that. It accurately describes the problems of raising children who have access to so much that may be harmful to them at their age, although it doesn't give us answers or propose solutions. To be fair, I'm not sure it was the film's intention to do so. The net effect is that the viewers are apprised of the dangers out there but that's it. No resolution, no neat conclusion--maybe that's why some viewers are so frustrated and equate that frustration with them having seen a bad film.There are deeply uncomfortable scenes in this movie and it certainly depicts sexualized children. However, a lot of criticism of this film is off-base because this movie does NOT glorify the sexualization of children. In fact, one of its core messages is that the sexualization of children through their exposure to adult content is harmful and wrong. Saying a movie is bad because it depicts problematic content would put 90% of what's out there in the trash bin. Would I skip a movie simply because it depicts war? Would I skip a movie simply because it depicts murder, child abuse, sexual assault, and so on? Lolita (both the novel and the Kubrick adaptation) was leagues more provocative than this and there was still enough merit in it not for it to be canned outright.So yes, this film isn't going to be a family film and you may still hate it after having seen it. But give it a chance."}, {"id": 234, "text": "This is a sensitive coming of age film revolving around an 11 year old Senegalese Muslim girl living with her mother in France. It's a very complex situation as Amy seeks social acceptance with 4 other girls of different nationalities and faiths who form a competitive dance team. Throw in the fact that Amy has her first period and that her father (never seen) is back in Senegal preparing to take a second wife. Lots of stress. Amy, as any child, makes a number of mistakes in her life. The highly hyped last competitive dance is totally taken out of context in the current public controversy. Watch the film and you'll see the wonderful resolution.The depiction of different cultures is well developed as are the main characters. Fatima Youssouf (Amy) and Medina El Adi-Azouni (Angelica) give amazing performances as actual 11 year old girls making their first movie. The script is solid and the direction is very very good. This is definitely a PG-13 level film, not an R. Highly recommended.As to the current controversy, people have a valid reason to be angry/disgusted with the way Netflix publicized this film, BUT, in my opinion, that anger/disgust cannot be extended the movie per se when it is considered as a whole work."}, {"id": 235, "text": "It's a story about a socially inept, naive girl making bad choices in her interactions with her peer group, escalating her behavior, and paying the price. She's coping with issues at home poorly. These actions are predominately NOT sexual in nature, despite what the recent manufactured outrage would suggest.Being hypercritical and attentive to the cries of 'child porn'... There was one dance where the camera lingered longer than I felt it needed to make its point. The dance on the stairs felt more for the audience than it did for the characters which admittedly feels weird when the dancers are 11 years old. And the final dance is probably the most provocative, but it pretty skillfully acted as the climax where the realization of her wrong direction dawns on her. Up until this point we are experiencing the movie through the tumultuous mind of Amy, and it's not until this final dance that the view from the world around her starts to permeate, she is able to see herself from outside herself, and it finally breaks her feverish pace toward her heretofore unseen corruption.One listen of Cardi B's new #1 Billboard Hot 100 hit WAP does immeasurably more damage, and promotes infinitely more sexualization of young females that this movie ever could. (Look up the lyrics at your peril.)I gave it a 7/10, but I can't recommend it unless you're up for a painful portrayal of a troubled girl growing up in the modern world.Final thought: It's funny to me that it took an entire nation's outrage to get me to watch a movie about dancing."}, {"id": 236, "text": "The film is beautiful. The actresses were wonderful despite their young age. Can't wait to see them in other movies.Having the opportunity to work in a safe environment for a powerful message product is definitely better than having a sexi dance on Tik Tok without any supervision for some likes.I'm sure the girls weren't hurt by the role they played, quite the opposite! Given their talents in emotional management and representation, I'm sure they will be rewarded with a thriving career.I hope that the audience of this film are intelligent and critically minded parents who instead of clogging Twitter with hashtags can reflect and act on the conduct of their little daughters to protect them from the true evils of society.It will be an unpopular opinion but it takes more of these films."}, {"id": 237, "text": "I decided to give this movie a 5 for the following reasons:1) I do not think the purpose of the movie was to celebrate the sexualisation of children, the message of the movie is actually the opposite of that.2) I don't think the extremely negative reviews are fair, the movie doesn't deserve a rating of 1. I'm pretty sure most people who rated it 1 didn't watch the movie at all or they didn't watch it until the end. Those who watched it all and rated it 1 probably misunderstood the message (as I've already said, the message of the film is not to sexualise children)3) The movie is not all about twerking. It tackles some important issues: religion, the oppression of women, toxic masculinity (and yes, toxic femininity too), sexuality... yes they are very sensitive issues, but I don't think they should be censored.The problems with the movie are:1) Some scenes are way too cringy... and yes, the camera angles are disturbing. I guess it was a voluntary choice to shock the audience, but it was a wrong choice.2) How the movie was promoted by Netflix obviously ruined it3) The clothes chosen were too inappropriate for 11 year-olds. They could have conveyed the same message without dressing little girls like that (I don't think they are allowed to dress like that in French schools, are they? That would never happen in my country)In conclusion: I see why people find it disturbing, I found it disturbing too. The movie wants to denounce how women are oppressed in different societies (sexualisation of women in a Western society is a form of oppression just like religious obligations in a Muslim society are) so its message is actually a very important one, it was just conveyed in a wrong way."}, {"id": 238, "text": "The hysteria over this perfectly lovely and reverent portrait of adolescence is inexcusable. If you have not viewed this film, SHUT UP and watch it before rendering your verdict. 90% of people are slamming based on reviews and articles they saw on Facebook. If you HAVE viewed it and still believe it sexualizes children or is a pedophile's dream, I hold no hope for you, your kids, or your future.This is a tender and touching film. Yes, these kids dance provocatively in mimicry of older teens and American rap videos. Yes, they dress older than their ages. But I am so confused why the very same people who love Dance Moms and pageants are outraged at this. Have none of you ever known or been around middle schoolers??Honestly, the Evangelical crowd so opposed to this has more of an issue with the Senegalise Muslim focus than little girls mimicking twerking. They cannot possibly have compassion for another worldview. That is the real problem."}, {"id": 239, "text": "Cuties is this years Beasts of the Southern Wild and the only thing offensive about this gem of a movie is the morally idiotic poor reviews. For those who turned it off after 10 mins, you missed the surprise package of 2020. This is a film about cultural constraints, fitting in, falling down and fighting through it. It 's an astounding film of strength in the face of tradition and it's a truly heartbreaking insight into growing up in a world that doesn't always want you in it.Amy is an 11yr old Muslim girl caught between the claustrophobic traditions of her culture and a modern society almost devoid of tradition and integrity. Brilliantly and powerfully played by Fathia Youssouf in her first role, Amy is equally at odds with both worlds and Cuties/Mignonnes voices it's objection to the exploitation of children far more poignantly than any outraged reviewer. Amy's struggle to find her own place in the world is an emotional powerhouse and the final scenes are simply unforgettable. Fantastic cast and a brave script written and directed by Maïmouna Doucouré in a film that will divide audiences for all the wrong reasons. Just watch the movie and make an informed opinion whatever that should be."}, {"id": 240, "text": "I hate this movie. It is a miserable film with not one single moment of levity. But quite frankly if you're going to make this movie, that's the way to go.The only thing more deplorable than these monstrous children are the adults they audition for partway through. There are real heartfelt moments regarding the family drama of the main character that make you feel for her but at no point is it anything but a punishing slog. I expected something vaguely akin to Billy Elliot but Somali and French but there is very, very little of that and only in the first act.My main takeaway is that it's a cautionary tale about sheltered children growing up in religious conservative families lacking any of the tools to deal with the real world, trying to be grown up in rebellion, yet becoming monsters.Does this make for good art? I suppose it does. But there is no enjoyment to be had from this film. Not one bit. Just a sigh of relief as it ends."}, {"id": 241, "text": "I tried to watch this because of all the hype and anger. I had to fast forward through much of it as it was deeply disturbing. Disturbing not because of supposed sexualisation of young girls. I have no clue how anyone could find tragic young girls with absolutely no understanding of the concept of sex, as the movie very pointedly emphasises, in any way desirous.The enraged conservatives obviously do find these young confused girls to be sexually arousing to them. The fact that they are aroused and therefore enraged ironically doesn't register in their warped universe. 🙄So, I was disturbed, because of the misguided criticism around non-existent sexualisation, but because of the director's willingness to explore real issues that I doubt anyone wants to see. This is not entertainment but a really sad insight into the confusion and pressures facing young girls from conservative backgrounds trying to fit into a modern, social media and sexually charged music video driven world.A desperately sad, horrifying and tragic movie.I do not recommend it as entertainment but certainly as a warning to parents unaware of the extreme pressure facing children in a social media world particularly those with problems at home."}, {"id": 242, "text": "Growing up and navigating the different arenas of life sure isn't easy for 11-year old Amy (Fathia Youssouf), a Parisian with Senegalese background. She has no friends in her school's very combative schoolyard, she's expected to undergo a very traditional training in antiquated Muslim values and gender-roles at the hands of her strictly religious aunt, and then she's got the hormones of puberty raging through her body, tickling her curiosity for sex and all that this entails with regard to popularity and social positioning. Trying to juggle these conflicting interests and expectations has always been hard, but try doing it in the midst of the Internet culture and you're almost certain to fail. That is what writer/director Maïmouna Doucouré wants to (or rather is compelled to) tell us with her hard-hitting, at times provocative, but always poignant and weighty film Mignonnes. The way Doucouré is able to invite us under Amy's skin and into her ostensibly well-hidden frustrations and despairs is a testament to the veracity of her story and of how well she understands not only the dilemmas and cultural collisions at hand, but also how she remembers how it was to be thrown into puberty armed with little more than the knowledge of childhood. Doucouré gets a fantastic performance from the immensely talented Fathia Youssouf as we get to follow her quest for finding an in-group, her new self, and her place in a viable middle-ground between archaic religious practices and a desensitized social media era."}, {"id": 243, "text": "The movie was touching. The struggle between the old archaic ways the Main Character was isolated by, her desire to experience things that she had an interest in, her desire to fit in with her friends, and her desire to be loved by her mother despite her differences was so very well expressed.The girls showed undeniable talent in their dancing, especially in the final dance scene which was brilliantly executed with an amazing level of skill. I dare say they did even better than Maddie Zeigler and the gang in Dance Moms. They should be proud of their accomplishments in this film. I am sure they have a long career ahead of them.It is shameful that people in their own perverted minds and sickening hatred of things that do not align with their personal world view seek to rob these attractive young actresses of their much deserved credit in executing flawless dance techniques in an astonishing work of art."}, {"id": 244, "text": "Nineteen hundred seventy-four is the year that they are now planning for sex on the streets in every major city from coast to coast. And - get ready for a shock - the music that they're planning to use to crumble the morals of America is this rotten, filthy, dirty, lewd, lascivious junk called rock and roll.This is a quote we all laugh at now, but it was An Important Message by Dr. Jack Van Impe (1974), a TV/Radio preacher. Music has certainly improved since, depending on who you ask and it plays a significant role in the world of today's youth.'Mignonnes' (Cuties) is the name of a dance group consisting of four 11-year old girls. Every school has them: a few boys and girls that are the baddest/daring ones. This is such a story, but nothing like what we were used to in the 80s/90s like Mallrats (1995) or sugarcoated cheerleader movies. No, step into today's world of an 11-year old girl, finding her way in a world between devote religion, MTV-content and 'Social' Media (likes), copying their role models and trying to find something to excel in.There is certainly a funny condom scene in the woods, some sad scenes and of course the awkward scene (where even the audience in the movie is somewhat uncomfortable) but overall well worth watching and an eye opener for people who really are oblivious to what goes on in the minds of 11-year olds (thanks to the wonderful 'educational' world of the internet!').The only thing to keep in mind is not to blame kids for wanting to be, and trying to become adults."}, {"id": 245, "text": "Hear me out... In terms of a fully realized movie, it's not the greatest thing, but it's still not this dripping child pron experience that people are claiming. It's really about a girl growing up, trying to navigate the world, her familial traditions vs her reality... finding herself, discovering herself, yadda, yadda, yadda - This movie could've been really good, but it ended up just being weird. (The girls fighting.. LOLOL, that was crazy awkward and hilarious)Yes, yes.. the dancing is suggestive, but hey, that's what kids do, we emulate, and in the beginning with Ami/Amy was teaching the girls the new moves she saw from the older girls - well, it was very much 11 year olds trying to dance like grownups, and by that, I mean, NOT SEXUAL AT ALL. the dancing had a point in the whole thing.. I think what's worse than the dancing was the lingering camera angles.. that was kind of and interesting choice.I'm speaking from personal experience there: little girls are annoying and always trying to grow up too fast, so, everything cringe in the movie made sense in the grander scheme of the story.I guess I just hope for the sake of everyone involved in the movie that all the backlash is coming from people who actually watched it.. If you've see it and think it's bad, that's fine, but if you're basing this off of that poster and mob mentality, then you, my friend, have got some issues."}, {"id": 246, "text": "I had a lot of heat on my last review. So I'll make another one.Cuties was a good movie not the best or great but good enough to learn from. Although the main character girls looked like boys.It's just about girl who becomes anti social and dresses like how women dress today. Due to home dysfunction and coming into a new world. Like any girl and women they will do anything for attention. When rewarded they continue and dig deeper for more attention. And the main girl does and it backfires. Most people never realize they screwed up until they are 70 and miserable and end up reporting every internet comment they disagree with.We can all learn from the main girl. Trying to be what you aren't will make you feel awful.People are taking offense when they haven't even seen the movie. Or they don't have the mind to understand the message.Verdict: Anyways It was cringy because the so called girls looked like boys. Its a good movie that is relatable to many girls today. Even boys who are open minded can take something from this movie. A movie shouldn't be blamed for your own actions or anyone else's. Just like shooting movies and rape movies don't make you shoot and rape. If it does you are the problem."}, {"id": 247, "text": "_Mignonnes_ is a coming-of-age story about a Senegalese immigrant girl in France as she absorbs messages about what it means to be a girl and a woman. Getting your period means you are a woman, but an 11-year-old is too young to dance suggestively. Popular girls act sexy, but they don't have sex. Women should be submissive, even when their husbands disrespect them. Nothing in the movie is exaggerated. There are a few surrealist elements, but _Mignonnes_ is basically a cinema verite account of the tensions of growing up, of inter-generational and cross-cultural conflict, and of trying to fit in with one's peers. It gestures toward the trope of underdogs competing against a powerhouse--but turns that on its head. I could imagine assigning Maïmouna Doucouré's film in a college course on girlhood. It is not a feel-good movie, but there are reasons why it won an award at Sundance. It should become a classic, because pre-teens in many times and places teeter between childhood and young adulthood.Confidential to the reviewers offended by the dance scenes: Doucouré chose to film them in order to make a point. If she had not filmed them, that does not mean that similar scenes do not play out everyday online and in real life. If you are bothered that girls don't have other, better role models than dancers in popular music videos on social media, are you prepared to picket dance studios where parents pay money for their children to learn to move like this? Are you boycotting TLC over Toddlers and Tiaras? Are you investing time and money into wholesome activities for latchkey girls whose parents have to work long hours to earn enough money to shelter, feed, and clothe them? It's pretty obvious from the film that, above all, Amy and her friends are looking for love and attention. They just find it in all the wrong places."}, {"id": 248, "text": "This film is a quiet masterpiece. On the surface it is a coming of age story of a young girl who has to navigate between her conservative religious upbringing and the hypersexualization of modern youth culture. But, in reality it tells the story of an immigrant family and the challenges of womanhood.The main plot is about the Amy and her integration into her girl squad leading up to the dance competition. Underneath, there is the story about how Amy's father, who does not appear in the film, is getting a second marriage in Senegal and is bringing his new wife with him to France. The story of the film is how Amy and her mother deal with this traumatic event that they have no control on but is nonetheless inevitable. It is story about womanhood and about immigration. It tells the story of childhood versus adulthood and Western culture versus African customs. African customs: mainly marriage/family traditions and polygamy.There are a lot of overlapping themes in this film, which is what makes them powerful. The film shows how Amy wants to escape her family situation, and how by doing that she stumbles into this provocative sexy dance world she is too immature to understand.The film themes are heavy, but the film does not feel bloated or bleak. The film is mostly endearing and amusing, because it looks on the world from an eleven year old point of view. It is mostly a movie about eleven year olds being unsupervised eleven year olds, and there is something charming about it. But there are also parts that are uncomfortable. There are, of course, a number of dancing scenes that made this movie controversial, but they are rather limited and far between. There are also a number of uncomfortable scenes that don't include dancing at all, and the theme is that these young naïve girls simply don't understand what they are doing. They have seen music video clips, they have seen the way adult women dress themselves and they think that that is what people want or that it is desirable, without understanding the sexual nature of it. They have appropriated the sexual provocation without understanding it. They don't know what this behavior is a reference to; they just think that that is how people dance. But why I think the film is close to a masterpiece: because it does not shy away from any of it. It takes these awkward situations and pushes them through. It pushes its characters to the limits of sensibility and appropriateness and then it goes beyond. It shows how the Cuties use their sex, mimicking grown women, and it is gross and uncomfortable to sit through. But then it shows their downfall. And it is still not satisfying or comforting. It is an ugly mess through and through. Because at every step you see plainly what the girls are doing, what they think they're doing and how wrong and twisted it it. You want these little girls to be little girls. The whole movie's tension is built like that, not between characters but between the protagonist and the audience. As the movie goes on it becomes clearer that the resolution lays elsewhere: in the family drama. That is why when the dance competition arrives, it feels anti-climatic, it become apparent that it's not the movie's core.I think the controversy is somewhat interesting, because in essence the movie delivers a very strong emotional punch. Which invites two opposite types reactions: either you are able to absorb the shock, and see the thematic subtlety of the film. Or you don't see the emotional arc and you are left watching girls trying to be inappropiately sexyAt the end I really enjoyed this film. I am not going ot watch every day, but I appreciate the journey it took me through."}, {"id": 249, "text": "There must have been an online campaign against this film that herded a large number of people to tear it down based on superficial, misleading, or virtue-signaling talking points. For those who are uncomfortable with the sexualized behavior of the young characters in this film, how many of you watched the whole thing? And for the smaller percentage of those who did watch it all, how many engaged it with a mind to understand? Clearly this movie - made by and about women of color - is a critique of and warning against the ways by which youth are influenced by a hyper-sexualizing, Western mass media culture. The protagonist is on the cusp of adolescence and struggles to find her way through a confusing and confused world of pre-teens who flaunt and style themselves after any number of music videos that glamorize the sexualization and objectification of women. This happens. And yes, it's problematic. And - spoiler alert! - the film is all about that problem. Young girls are influenced by glamorous emblems of sex from mass media. And this film - in very sympathetically human ways - brings a critical lens to the issue, going so far as to point out how social institutions themselves (ie, the producers of the dance competition) actively encourage and reward the programming of sexualized behavior.If anything is 'uncomfortable' here, it's the fact that the hysterics who have risen against this movie don't perceive (what we might imagine is) their alignment with the clear message of the film: that there are serious issues with young girls in our society feeling pressured to act older and more sexual than they can understand. Amy, the young immigrant from Senegal, suffers from these pressures. Fortunately she learns to rise above them to reach her own graceful transformation. The movie communicates its moral clearly with pathos, sympathy and artful sensitivity.This film isn't controversial. The uncomprehending campaign against it is the real controversy."}, {"id": 250, "text": "CUTIES is an award winning movie for a REASON. If you have not watched it don't be hating on it!Due to Netflix re-design of the movie poster, This movie is being vilified as Kiddie Porn. Nothing could be further from the truth. (But it does serve as the perfect example of the power of suggestion, without context, that we see so much of today, particularly in the political war between the Left and the Right) Still, I must admit being grateful for the controversy, as I would have dismissed this movie as just another cute coming of age chick flick.It's actually a brilliant, sensitive and moving portrayal of a young girl struggling to build a self image that falls somewhere between her strict religious family and her more liberal friends at school.11 year old Amy, lives in a Muslim family and has no cell phone, or access to social media and therefore she cannot fit in with her middle school peers. Desperate to belong, She steals a cell phone, that her cousin leaves lying out, and we see her upload her first provocative selfie, a pouty duck face... Instantly, the likes start pouring in. Amy is elated, and slips the phone under her mattress and tries to go to sleep.She's a hit the next day, at school and eventually wins a place in a dance group that calls themselves Cuties. The group enters a contest, and guided by what Amy is seeing on Instagram, (influencers are called that for a REASON people!), The group practices become more and more inappropriately seductive. BUT these are little girls! They don't quite know what they are doing is wrong. They upload the practice videos and are hugely rewarded with Likes.And then Amy's cousin sees her with his phone, and he's pissed. You stole my phone?! She pleads with him to let her keep it, Please! I need it! Seeing that she's not going to win this one, she runs to the bathroom, locks the door to take one last selfie. She wants to make this one count. She snaps a pic of herself naked from the waist down, ( nothing is shown except from the waist up, but we get it.), There is an excruciating two second as she hovers over the Publish button, squeezes her eyes shut and hits publish.She then scrambles over, unlocks the door and tosses the phone out to her cousin, then re-locks the door and sits balled up in a corner, with a look of both excited anticipation and sheer terror, over what she has just done. Without the phone, she has no idea of how that snap is being received, she has high hopes because she has seen so many social media accounts get followers and likes, for this kind of thing, but is she also terrified because deep down she knows it feels wrong, and could backfire. (And it does. Hugely!).The three minute dance contest segment people are going all Karen over, necessarily shows the shocking result of internet influence on the dance they perform, and when Amy sees the horrified reaction of the audience, she looks down at herself, and her costume, wells up with shame and starts to cry. She runs off stage, and home to her Mother and Grandmother.I am gobsmacked that people think this is porn. It was a beautiful, truthful depiction of anxieties, missteps and heartaches, girls face as they try to understand who they are, who they want to be and their place in the world. I may even watch it again. My hat is off to the new young writer/director Maïmouna Doucouré, and the lead actress, Fathia Youssouf, is someone to keep your eye on, as she was amazing!"}, {"id": 251, "text": "Unlike others who watched the movie just to see what the fuss is all about, I did watch the movie to see young girls twerk :PPeople who think this movie contain explicated scenes have not seen what kids do on social media nowadays,Anyhow, the movie is NOT about young girls dancing, it is more about cultures, and children want to copy others,I think the movie is worth to watch if you have young children, it will give you a little idea what children are going throw these days, in reality it is even more.I rated 10 to balance the bad reviews, but this movie is an 8, maybe a 9 if you have children."}, {"id": 252, "text": "This movie is supposed to be a commentary or criticism somehow of the exploitation of children, according to the director.Instead, it is a movie about a Muslim girl wanting to break away from her traditions and suffocating family, and join a dance crew called the Cuties, because she watches videos of adults twerking and thinks that if she imitates what she sees on the internet, she will escape.Through the help of a few well-placed plot points, she gets in to the Cuties, with the help of the glasses-wearing leader who befriends her, in typical 11 year old girl fashion.Then the film starts to show signs of possible trouble up ahead, only to completely derail thirty minutes before it's over. Whatever intentions the director has for what she has made, they are poorly delivered here, leaving me scratching my head as to what all the fuss is about.How can the claim be made about exploitation of children, if the only person doing it is the director herself?The characters in the plot make their own choices. Nobody is forcing these girls to behave the way they are acting, they just CHOOSE to. Nobody is threatening the girls in some way, or attempting to gain something insidious from their performances.In fact, the point is continually reinforced again and again throughout the film that these children are being outright REJECTED by those that see them behaving this way, from the teenagers they try to lie to about their age, to the audience members that watch them twerk on stage. Nobody in the film is giving any kind of support to the girls' behavior.So I'm lost as to the purpose behind it, to the delivery of it, and to all the backlash that's happened as a result. This is a movie about the foolishness of childhood, and the influence of the world on that childhood, if left unsupervised. It's less a matter of tragedy and more an attempt at telling a story about how growing up is hard when you're stuck between the age of being a kid and becoming a young adult.I don't know where the offense is supposed to be, save all the very questionable shots that the director makes of the girls as they dance. If she was trying to make a point here, she missed completely.Either way, I can't give you a good reason to watch it."}, {"id": 253, "text": "Perhaps, it's not surprising that Cuties has been received by controversy when Netflix takes, among other poor decisions, one of the most scandalous images from the movie, when the foursome of 11-year-old girls perform a sexualized pop-music dance for a contest--a scene that is met with obvious discomfort and rebuke across the faces of much of the surrogate audience in the movie--out of context and place it on the poster advertising its release on the streaming channel. Indeed, the poster suggests the sexual exploitation of children. It also may not be surprising that other people on the internet are obtuse, too, and rush to be wannabe censors and stir up a hullabaloo--and reportedly worse--out of a frequently similar apparent ignorance. Besides, how often have attempts to boycott a movie not just invited more interest in seeing it. I mean, a French-language film festival winner doesn't tend to trend this much in Netflix's bigger English-speaking market. I saw Atlantics (2019), too, for instance, but it doesn't look as though very many others did. Anyways, that said, for what I'm sure will become an interesting film history footnote and an unappealing one in that of internet trolling, the actual movie is an often uneasy balancing act that dances with exploitation in its coming-of-age tale of a girl, Amy, between two dangerous adult worlds she doesn't fully comprehend: the sexual dancing and religious patriarchy.It might be only because I've recently been on a binge of viewing adaptations since reading the books and at the risk of this being misinterpreted from any further foolishness (oh, whom am I kidding, most people who up or down vote any such reviews longer than a few sentences probably don't read them--especially if they're already prejudging the movie), but I see some slight indications of or parallels between Cuties and Lewis Carroll's Alice in Wonderland. A seeming allusion is made with the dropping of items, as did the White Rabbit, which Amy picks up and which lead her to wonder at the sight of her peers provocatively dressed and prancing. Like Alice, she begins in a repressive society and enters another of nonsense. In either, however, both are bombarded by the nonsense of the adult world. In one, Amy is pushed to become an adult by assuming a traditional role in the kitchen and to wear traditional clothes, told that she should go to school with the ambition to end up supporting her mother, and finds frightening her introduction to a system of polygyny. In the other, her desire for belonging and fascination with dance are corrupted by body shaming and fashion-designed discrimination, as well as the vast glut of crud available at her fingertips over the phone (an unfortunately apt plotline given the movie's marketing and reception) and sex.Without the dreamworld abstraction of Wonderland, however, and because of the sexual content, Cuties risks devolving into exploitation of the very societal ills it proclaims to criticize. Given that the movie is about 11 year olds, and there's no camp here, I'll assume that the filmmakers didn't intend this in the traditional sense of exploitation cinema such as, say, Reefer Madness (1936), which purported to proscribe drugs and sex but actually reveled in it. I also wouldn't think it as disconcerting of exploitation as something along the lines of the NC-17 rated Kids (1995). Nevertheless, there are some questionable scenes in Cuties. I would think it difficult, for example, to claim it necessary to feature Amy twerking in her underwear after being pelted with some substance by her mother and aunt. One wonders whether there weren't less suggestive ways to film much of the rest, too. A little gyration goes a long way; no need to repeat it over and over again with such unfortunate camera placement. It's a thin line even for not a first-time feature director. Plenty of supposedly anti-war films, after all, have actually romanticized or otherwise made violence thrilling. On the other hand, the condom scene and the ending are thematically effective, and Cuties has a point about society's highly sexualized culture and the pop-music and social-media scenes in particular and their effects on adolescents. There's a debate to be had on whether Cuties isn't actually part of that problem. Yet, that doesn't seem to be the argument that's actually happening."}, {"id": 254, "text": "Simply put, every film, and i mean every film ever made was made for a reason, i have seen some awful movies, and some excellent movies, as we all have. This movie is what i would term, a coming of age movie. It is not for me to judge how others perceive the subject matter, we all have our own inner beliefs, but i say the only way you can see society, and humanity for the reality of today, is to watch even the most extreme films. I wouldn't say this is in that category. I really do not see what all the fuss is about, other than snowflakers jumping on their high horses and telling the rest of us what, and how we should think. It was a fairly boring movie, the old age storyline of impossible things coming true and family life, growing up and school bullies. There was some questionable camera angles, but nothing too untoward, just camera work that makes you feel uncomfortable. There was a brief pair of knockers, blink and they were missed, but they were on a person who was of an age that was acceptable. I cannot recommend this film, for the simple reason it was boring. I would recommend it to a young person, perhaps in their early teens, as it might give them guidance to any issues they have in their life. Why netflix courted this subject matter?...no one else would touch it, and i think it is high time we accepted them for being so brave. They make reasonable content on the whole, not this time, but usually they keep people from falling asleep while watching with their content. Go watch this, and judge for yourself, i didn't see any hidden agenda, i simply saw some teenagers acting, and acting fairly competently at that, and maybe a few of them will go on to have a career in the film industry from this....that's not a bad thing...talent needs identifying at some stage, no worse than Hollywood has been in the past with the Shirey temples and Natalie Portman in Leon the professional, Jodie Foster in Taxi Driver, she was 12!,Brooke shields in Pretty baby..the list is quite a lot longer, i won't bore you any more."}, {"id": 255, "text": "Connection Terminated. I'm sorry to interrupt you, Elizabeth, if you still even remember that name, but I'm afraid you've been misinformed. You're not here to receive a gift, nor have you been called here by the individual you assume, altough you have indeed been called. You've all been called here. In a labirint of sounds, smells, misdirection and misfortune. A labyrinth with no exit, a maze with no prize. You don't even realize that you were trapped. Your lust for blood has driven you in endless circles, chasing the cries of children in an unseen chamber, that always seems to near, yet somehow out of reach. You will never find it. None of you will. This is where your story ends. And to you, my brave volunteer, who somehow found this job listing not directed to you, altough there was a way out planned for you, I have a feeling that's not what you want. I have a feeling that you're exactly where you're supposed to be. I am remaining as well. I am nearby. This place will not be remembered, and the memory of everything that started this can finally begun to fade away, as the agony of every tragedy should. And you monsters trapped in the corridor, be still and give up your spirits. They don't belong to you. For most of you, I believe there is peace and perhaps more waiting for you after the smoke clears. Altough for one of you, the darkest pit of hell has opened to swallow you whole, so don't keep the devil waiting, old friend. My daughter, if you can hear me, I knew you would return as well. It's in your nature to protect the innocents. I'm sorry that that day, the day you were shut out and left to die, none was there to lift you into their arms, as you lifted others into yours. And then, what became of you. I knew you wouldn't content to disappear, not my daughter. I couldn't save you then, so let me save you now. It's time to rest, for you, and for those you have carried in your arms. This ends, for all of us. End communication."}, {"id": 256, "text": "This movie has received a raw deal.I happened to catch the trailer for this on dailymotion before it blew up everywhere and I didn't think twice about it.If I had just seen it in theatres before anyone else this would be a much shorter review. But I want to get a few things off my chest.The negativity about this movie is just ridiculous. No movie is for everyone but no one seems to be actually talking about the movie, just one very superficial detail.Dudes...they're just dancing...that's really it. It's not meaningfully different to if they were doing ballet or ballroom except in how we perceive it and that's just cultural bias.Yes, the suggestive nature of the dancing is no coincidence. That's the point, it's about rebellion, fitting in and cultural expectations. We begin with the familiar religious misogyny (stated by a woman interestingly enough). This movie is not anti-religious and nor am I, it just reminds us of the ugliness that still exists in society.The movie doesn't even depict Les Mignonnes very positively. They are a spiteful, antagonistic and often malicious group. The only feminine thing about them is their physical self expression in dance and clothes. Oh, and the grammatical gender of their name. And again: that is the point. Amy is exposed to toxicity from both sides; one sex-negative, the other what everyone is desperate to brand as degenerate.Interestingly, it is a holy man that seems to be the most understanding and level headed person present, though he is in it only briefly.What especially annoys me is how people go on about child abuse but ignore the physical (non-sexual) abuse hurled on Amy by her mother so people are very selective about what they get mad about.I thought this movie was a well observed exploration of youthful friendships and fitting that reminds us that the personal is political. There is an especially poignant scene where the girl in the glasses talks about how her parents don't have any time for her because they are too busy with their restaurant.Ironically enough there is something infantile about the people who hate this movie the most. This movie at no point even seems to suggest this dancing is a good thing. It is admirably neutral as it should be because, you know, it's a movie, not propaganda. That's what grown up movies do, they simply put the elements there for you to make your own conclusions with the faith that if what the author believes to be true is true then you will make that conclusion as well.It's like how Rocky was not about boxing; he just happens to box, it's about the journey. The same thing goes here. Would you be OK with Rocky having no actual boxing shown in it?Being part of Les Mignonnes brings out the worst in Amy just as it brought out the worst in the global public.I only ask you to actually watch it and try not to let your knee jerk reactions govern you completely."}], "reviews_amount": 257}