{"name": "Breach", "titleId": "tt09820556", "reviews": [{"id": 0, "text": "Die Hard in Space this is not. Truly a terrible, terrible movie. I'm embarrassed for Bruce"}, {"id": 1, "text": "It's like a kid in high school did the CGI and prop work.The writing is like a teenage boy doing nofap and putting his frustration into a script.Truly terrible with nothing redeeming. If you're going to see it, take drugs first."}, {"id": 2, "text": "This movie is utter garbage. The acting is bad. Even Bruce Willis is acting bad? The settings look like something made in home class for a 6th grader. Its boring, Its lame, its a complete waste of time. How did they get Bruce Willis to act in this crap? He was one of the greatest action heroes. He was John Mclaine in Die hard. And now this??? WFT. Alien, wich was made 41 years before this movie, is a 1000 times better in all aspects. Avoid this crap. And Bruce...why???"}, {"id": 3, "text": "These guys definitely know how to put a trailer together shame the full movie is a pile of garbage, Thomas Jane blew himself up just to get out of this snorefest, dear old Bruce needs a decent director to get him to show any acting talent, shame there wasn't one on hand. Standard sci-fi drivel from the eighties, cheap effects, cheap cgi, looks like they managed to find some left over sets from the original alien movie to use, nothing new, nothing interesting. Produced by the same pair that wrote this tripe, this is not their 1st writing or producing credit, isn't the point of doing something to get better at it, if you're not learning from the previous bad work &amp; are just going to keep writing &amp; producing more garbage then the only thing you're going to get better at is creating more garbage, at least strive to make the movie as good as the trailer."}, {"id": 4, "text": "Bad. Horrible. Terrible. Sophomoric. Embarrassing. Cheap. Cable access channel level. Too awful for even MST3K to mock. Anyone involved with this film even in the minutest way should be launched into the sun. Imagine the ppl that could have been fed or housed with the money that was deplorably flushed into the eternal crap hole of death that was this...whatever the whatever this was."}, {"id": 5, "text": "I can't beleive both Bruce Willis and Thomas Jane would involve in such a horrible movie ,not only the movie tried to be an aliens movie copy but it has the worst acting and visual effects ever knowing that the producers tried to relay on the reputation of two big actors whom in this movie look more like ghosts of themselves ,they did not even try or give any effort to show any acting skills so bad i regret watching it ."}, {"id": 6, "text": "Anti-Life is mostly a complete waste of time, space and film. In the 2240s a space ship leaves a plague infested earth carrying the future inhabitants of new earth. 180 days from their destination a skeleton crew is running the ship while the passengers are in hyper sleep. Soon the crew members start dying and killing eachother and the survivors end up battling an alien life form that overtakes and imitates its host and is trying to kill them all.The movie is badly filmed with terrible sound and poor visual effects which are similar to what bad sci-fi movies had in the late 1980s or early 1990s. The editing is choppy as well. The movie basically borrows ideas from The Thing, Alien, Pandorum and many other superior films and copies some elements poorly. Actors like Bruce Willis, Rachel Nichols, Collin Mullvey and Thomas Jane among others have little to do and have terrible dialogue and story to contend with.There are a few chuckles but other than that there are hardly any redeeming points to this. Honestly, Leprechaun 4: In Space was more entertaining and better and it was made in 1996."}, {"id": 7, "text": "Really. It's bad from start, but hard to believe that is that bad. Everything. I forced myself to the end to have a new reference for a bad movie. I must have lost a lot of brain cells watching. It's painful."}, {"id": 8, "text": "The cinematography, lighting and editing make this one a chore to sit through.Willis is sleepwalking, as has become his standard MO."}, {"id": 9, "text": "I've seen a lot of movies in my day- some good, some bad, some just ok. This one is in a category of its own. It's truly an insult to all of us that someone allowed this movie to be released."}, {"id": 10, "text": "Where to start... well you can tell right from the start it s low budget affair. the lack of polish is obvious everywhere. Bruce Willis keeps dinking his special moonshine from a flask.i don't blame him. by the end of this i wanted whatever he was drinking... its just bad. it get weirder and weirder by the end. and what is up with movies like this and dumbest ending. without any spoilers. if you wanted to see this for Bruce. just don't bother!"}, {"id": 11, "text": "One of the worst movies that i saw this year.. it looks like they wanted to remake Aliens with some space zombies, but did that in Asylum company's mockbusters way.. Bruce Willis now acting in some student level movies.. plot? well there are no plot, only plot holes, CGI is laughable, acting is bad also.. rated 3/10 just for the last words that were said in a movie, which made me laugh"}, {"id": 12, "text": "Pretty awful and very low budget. They should had sent Bruce Willis into the air vent and give him the old line from Die Hard come to the coast have a few laughs... "}, {"id": 13, "text": "If they gave out awards for movies this bad, it would hold the record until the sun burns out."}, {"id": 14, "text": "We all need to do stuff sometimes because we have to. I'm thinking one of several things are going on here. 1. Bruce needed money to pay his taxes. 2. He needed a loss to write off. 3. He owed someone. 4. He did someone a favour. 5. He lost a bet. 6. He signed this contract when he was drunk. 7. Someone held a gun to his head. It has to be one of those because there is no way, Bruce action star Willis, would look at this script and say..Hey! this is the best, can't wait to put my name on it! What an absolute load of cow manure! Bruce should buy up all copies, burn them; put a full page ad in the Times apologizing to his fans, friends, fellow actors, family and unborn grandchildren as well as give us all refunds! Utter garbage!!!!... sorry Bruce, I'm only telling you this because I've loved you since Moonlighting... I'm also probably not saying anything you didn't already know about this movie."}, {"id": 15, "text": "Why the heck would Bruce appear in such a c grade piece of tripe like this? had to turn it of it was so bad. Forget spoilers, this movie is one big spoiled egg. do not bother peeps."}, {"id": 16, "text": "It looks like Willis will take any role in any movie nowadays. Nothing to watch. Just boring. Poor CGI."}, {"id": 17, "text": "Sad to see Bruce Willis in this one. He's got to have problems earning enough to pay his rent but was this really necessary?Story... Totally incomprehensible, Acting... Well. Set and CGI... Poor! Don't waste your time on this one."}, {"id": 18, "text": "I lasted 24 minutes. I knew it was bad within 2 minutes but gave it the benefit of doubt. I turned it off shortly after I spotted a cameraman in the mirror around 22 minutes. I hadn't seen this type of amateurish mistake since the 1980s. The acting is outrageously bad and would give Hollyoaks a run for it's money. I feel sorry for Bruce Willis that he feel he needs to be involved in such paff. Watched Kevin Costner a hour earlier in the brilliant LET HIM GO. Bruce should retire. This is as bad as it gets."}, {"id": 19, "text": "So these directors/producrs are just getting these 80s action starts to be in their movies just to push some kind of profit. Stop already with this garbage."}, {"id": 20, "text": "This crap gets an F for physics. Gravity without a wheel? They hyperjumped just once and then just floated? High caliber rifles inside of a space ship??? That's where I had to bail out."}, {"id": 21, "text": "Made it barely half way thru, don't waste your time. The acting and special effects are on a new level of horrible.."}, {"id": 22, "text": "Worst movie ever ,bad acting,bad storyline bad cgi I just can't believe bruce and Jane acted in this atrocity"}, {"id": 23, "text": "Omg, what has happened to Bruce Willis? Just bad, bad movie, bad script, bad acting, bad cgi. Do yourself a favour and steer clear"}, {"id": 24, "text": "The entire movie, you are left wondering how Bruce could have been ok even being in this movie. Some of the worst acting, cinematography, writing, and cast, I've ever had the pleasure of viewing. The set was alright, but the camera made it look cheap. Special effects look like they were done by somone in grade school.Just wow..."}, {"id": 25, "text": "A movie made by a 6th grader. W t ef Bruce? And who is the director how he get the budget was it only 10k?"}, {"id": 26, "text": "Looks like the entire budget went into the trailer. Don't be fool! It's REALLY BAD. Didn't even finish it."}, {"id": 27, "text": "How come they got all these actors together and paid them? Probably thats where most of the movie budget went...B- movie with A-list actors. The sets in the movie are hilarious, the dialogue is just not right, the editing seems incomplete and the camera shots are weird enough and repetitive. It 's a 3-star movie just because the story is not that bad and literally 3 scenes of the movie are good. But i can't recommend this to anyone with a taste in sci-fi. Watch Pandorum instead or re-watch another sci-fi and avoid the disappointment. 3/10"}, {"id": 28, "text": "That's an epitome of how low things could get...and they did ! Bruce is completely deranged nowadays...to perform in such a stupidity...and to plan another 6 or 7 such projects for 2021 ?!? Bruce, go to a deep sleep and dream about yr Moonlighning and hope that even C. Sheperd would forgive yr actual decrepit state !"}, {"id": 29, "text": "This is a conversation between a Hollywood producer (or whatever company is behind this) and a script writer:-Hi... We need to make a sci fi movie... Can you write the script? -Yes, sure! -It will be like Alien, but with some Zombies also... You know, is fashionable. -Hmmm... Ok, no problem. -But, we need you to finish the script today, because tomorrow we start shooting. -Oh, wow, wait... Don't you think...? -I know what you are thinking, but don't worry... We will do as we usually do: false advertisement, we say is the best movie ever, bla, bla, bla... And we just put a movie star there... I think Bruce Willis is available. -Ok... so, let's do it!"}, {"id": 30, "text": "I cannot believe how bad this is. I can't even make a list of what was done badly. It's easier to list the positives.....the trailer. I like most of the 1950's and 60's sci-fi, but this was not up to their standard. Waste of $6.99 on Prime. Wait till its free."}, {"id": 31, "text": "Wooden acting, tired tropes and really bad dialogue.Had to wonder how much Willis, Jane and Nichols needed a paycheck.I have seen better special effects in 1990's B grade movies."}, {"id": 32, "text": "Was Bruce Willis hard up for cash to be in this garbage. I couldn't even watch it all the way through. Poorly written even worse directed. The Thomas Jane character the admiral what a joke."}, {"id": 33, "text": "... so I'm giving it 2 instead of 1/10. Really hoped that they would realize that only lager will dissolve the vindaloo monster."}, {"id": 34, "text": "Don't go into this hoping to see a good movie. It's one of those films that is fun to watch if you're making fun of it with your friends, and eating snacks. Yes the cgi is bad, but the acting is surprisingly competent. The story is a rip off of every alien or zombie movie ever made. I liked the characters cause the acting was good, but the weakest part were the zombie aliens. The extras gave over the top corny performances. And because of the creatures were just rip offs of other well done monster movies, the action sequences were boring. The build up to the action was a lot more effective. The ending was pretty good though"}, {"id": 35, "text": "Why would he do this??? Its so bad and not in a future good way."}, {"id": 36, "text": "Don't know what triggered all the hate from in other reviews. Maybe they're extinction rebellion extremists...Average movie. Worth a watch if you're in the mood for an interstellar alien horror movie. Acting is averageStory is averageAliens are kind of like in PrometheusAction reminds me of Doom"}, {"id": 37, "text": "This moment, when one of the best actors team up with some random non-actors, take some drugs and want to recreate Aliens in 2020. I thought that pandemic was already bad, but this is way worse..."}, {"id": 38, "text": "Just watch the trailer, much better than the movie."}, {"id": 39, "text": "I just wasted seven bucks on this piece of garbage. Idiot plot, bad acting, and extremely cheesy special effects. I do wonder how this thing ever got made."}, {"id": 40, "text": "$75? Does BW work for food these days? I guess so."}, {"id": 41, "text": "I'll make this quick. I rented this film and watched it with my buddy. Fun little Syfy film, but come the last 5 min you will ask yourself wtf happened?! Did they change writers last minute. Worth a Redbox rental."}, {"id": 42, "text": "I think most of the user reviewers need to ditch their love hate relationship with mr.Willis and try to relax and enjoy themselves. Are you seriously expecting Aliens here??? Bruce has been doing many straight to VOD style films for over a decade now, please don't act like its his first time. He actually has a decent amount of screen time and brings it with this film ' its a lot better than the majority of other VOD titles he has done as of late. This film is clearly competent and a fun no thought process needed type of film' reminiscent of the 90 style films made for a lot more than I'm sure this budget had even back then. I think it deserves at least a 6 so I bump it up to 8 based on all the hate. Lots of negative people reviewing too, have a look at most of their other reviews of other films, totally negative stuff. Don't pass because of them and their emotional attachment to what they think a Bruce Willis film should be in 2020."}, {"id": 43, "text": "I'm probably a bit biased, but I love cheesy scifi movies. The fact that Bruce Willis and Thomas Jane were in this one makes it all the better.It was a bit dry, but this wasn't going for any Oscars or anything.Passed an hour and a half and I'll probably watch it again at some point."}, {"id": 44, "text": "If you want to watch a cheesy Bruce movie and have an extra 10 bucks around go ahead. CGI was subpar. I feel the like the characters in Southpark had a better budget during season 1 than in this movie. There was some parts of the movie that didn't make sense, during a part someone was crawling through the vent and the infected heard him and that was the end of it. I wish they showed this movie to some people before releasing it. Especially having some big names in it. To Bruce, from die hard to this??????? I am really disappointed."}, {"id": 45, "text": "WOW. This is not a good WOW BTW. I'm almost lost for words. This film is horrendous. I can't believe how far Bruce has fallen, is he skint, producing, doing a favour for friends, what is it? Some of these actors have actually done good films. It's so cheap, pealing stickers over the brand of TV monitors, wobbly sets, I'm pretty sure they use NERF guns as weapons. Terrible beyond belief!"}, {"id": 46, "text": "If you could compare years with movies, well, this one would be 2020..."}, {"id": 47, "text": "Do yourself a favour . . . just say no. It is so, so very bad."}, {"id": 48, "text": "You said if they gave out awards for bad movies this would win.. those awards are called The Razzies. They give out awards for such things as Worst Movie, Worst Actor &amp; Actress etc.Also, could tell this movie sucks just by previewing the trailer for 10 seconds. Every Bruce Willis led films these days are consistently awful. He will take any role he is offered. He's the new Nicholas Cage. Except Cage is the type of awful that you can laugh at. With Willis it's just embarrassing and depressing."}, {"id": 49, "text": "That's the only way to explain all of this. He has an imposter churning out movies like a child playing with the toilet paper roll. For a long time now, seeing his name or face on a movie poster was the only review you needed to know it was going to be a huge disappointment."}, {"id": 50, "text": "It's a B-movie... what do people expect? If you like Ghosts of Mars or Pandorum, this is pretty much a rip off of those. It's entertaining enough. Yes, there are things that don't make sense, but it's a Scifi movie, they don't have to. And Bruce Willis has never been a good actor, so again... what do people expect?!"}, {"id": 51, "text": "I honestly thought about padding the rating with a few stars because this movie isn't THAT bad. Of course, as someone who has watched a lot of SyFy original movies, I've learned to read between the lines and set my expectations accordingly. So this movie was pretty much exactly what I thought it would be.It definitely borrows from Alien, The Thing, Dead Space, zombie movies, and generic dystopia. Some actors clearly took their roles too seriously, but several appeared to be having fun chewing the scenery. The story is pretty certain it makes sense, and only a couple times tries to be more than what it is.If you're wanting some genuine scifi action-adventure, skip the hell out of this one. But if you just want to munch on popcorn and riff on a movie with friends, then this might hit the spot."}, {"id": 52, "text": "The only reason to have Bruce Willis in a movie like this is its a tax write off and it shows...."}, {"id": 53, "text": "Oh my God, Buget for this must have been less than a dinner at an expensive restaurant, actors must have done a favor for director. I dont see how some known names in Hollywood must have played in this pure Garbage of a movie. It looked awful from the beginning but i watched to see how deep the hole goes, it,s very very deep. Don't watch this, its more entertaining to watch a blank white wall."}, {"id": 54, "text": "Truly, truly appalling film - there is absolutely nothing to commend. The sets are laughable - plywood with cross-head screws visible, sprayed appliance/tv foam packing stuck to walls, and a reactor made from neon tubes! The acting is even worse. The best that could happen to this is the fate other turkeys befall at Christmas."}, {"id": 55, "text": "Worst rental I have paid for and still can't figure why Bruce Willis agreed to star in it. When he looks back at it I bet he will be embarrassed."}, {"id": 56, "text": "I regret not turning it off... Don't make the same mistake!"}, {"id": 57, "text": "DREADFUL, PITIFUL, AWFUL, HORRIBLE, MISCARRIAGE, UTTER ABOMINATION PRETTY MUCH SUMS OF THIS STEAMING PILE OF CRAP! Good God Bruce Willis and Thomas Jane must have huge debts to be cast. Needs to me removed and burned in public. Arrest the director and producers for inflicting harm on the public"}, {"id": 58, "text": "No really. I enjoyed it because at this level of bad i wanted to watch the all thing. Like experimental art project. I particularly liked the quantum reactor made of 3 blinking neon you could find in a brothel. And the dirty windows on the ship. It's compelling. So i give a ten even if it deserves one."}, {"id": 59, "text": "Cheeky and exactly what I wanted from a Bruce Willis in space action film. The dialogue was funny, a lot of gold moments. Ending was meh but I don't regret buying it."}, {"id": 60, "text": "I hated every bit of this movie. This was more annoying than anything else."}, {"id": 61, "text": "What on earth was Willis thinking ? This film was absolutely dire on every single level. There is nothing redeeming about this pile of crap. Avoid at all costs."}, {"id": 62, "text": "Quite possibly one of the worst films I've ever watched! What happened to Bruce Willis!"}, {"id": 63, "text": "Do not rent, buy, or even watch for free!! Complete waste of time. Horrible horrible horrible. Wouldn't even give it 1 star!"}, {"id": 64, "text": "This is so bad, im wondering what the actors did to been force to fo this movie. Bruce Willis god damit, wtf did you do? Its not possible to do this badly with todays free software! I could so better with a indie developed after effects in my toilet in the dark, no actors... Dont belive me? See this trash and let me Know!"}, {"id": 65, "text": "About five minutes into this film you can already tell how bad it is. The CGI was so bad it felt like placeholders that never got the actual animations. I couldn't finish it I had to stop it was so bad. There are so many things wrong with this film, the acting is horrible, the cinematography is disgusting and the camera work is always shacking. The general, when he tried to yell to assert dominance on the crowd was so laughably bad it was my final straw. I had to stop this train wreck. DONT WASTE YOUR TIME ON THIS, DONT EVEN TORRENT IT!."}, {"id": 66, "text": "I saw Bruce Willis and thought hey a great action movie. Cheesy graphics, horrible story line, terrible acting and special affects looked high school. Don't rent!!!!! Horrible movie"}, {"id": 67, "text": "What on earth is Bruce Willis doing in this? Has he blown through his fortune and forced into doing those subpar films?This films tries to be Aliens 3 minus the storyline &amp; actual aliens mixed with the living dead virus. Although that does sound like an interesting premise the end result is less that a bargain bucket discarded block bluster film. The special effects are laughable. The storyline is uninspired and had been done before but more importantly better than what this film gives you!"}, {"id": 68, "text": "The trailer for Breach had me thinking it might be OK and while 4 stars is generous for this obviously low budget Sci-fi horror film, it does deserve credit for effort and several funny lines that had me laughing. Unlike films where he gets star billing and shows up for 10 minutes, Bruce Willis is a major player in this and I have no idea why. This movie is so beneath him I can only think he needs to pay some bills and even then how much could they have paid him for this. The acting throughout this is uniformly bad and Thomas Jane in his small role is embarrassing himself. Maybe they expected more, because the plot itself isn't bad but camera work is shoddy, lots of unnecessary shaky camera, poor direction and cheap looking sets, like vinyl, cardboard and plastic bad. I have no idea why actor Cody Kearsley is the star of this because he can't act, has no charisma and can't carry the movie which he's required to. In the end though, it was interesting enough and at times was bad in funny ways. Bruce still has it in him to deliver a good sarcastic line."}, {"id": 69, "text": "From opening scene to end, it was low budget B movie."}, {"id": 70, "text": "This is what happens when an amature screen writer comes up with. Nothing but a jock filled, foul mouthed, grand stand, mosh pit kind of film. Bruce has really let his standards drop as of late. It doesn't take a genius to write sentences and replace important words with the four letter ones as a means of being lazy. Most of the film had some action to keep an interest, and the only thing that was even remotely satisfying was the cro room.Aside from the obvious the characters needed a whole lot of work when they presented their lines.In the first ten minutes I couldn't stand the loud obnoxious speeches of the old haggard soldiers trying to compare war stories with one another. If I didn't know better, that the screen writer was someone sent overseas and came home deciding to write something other than what he experienced in another country. Except he chose to use the Sci-ci trope.This was a bad movie. A bad investment. What surprised me though was when they first made their hump into hyperspace. The scene where bruce was sitting in front of a very dirty, and scratched up port window. Who the hell made the choice of keeping such trashy appearances? On an angle shot it looked like it was what everyone else was thinking.... nothing but polymer plastic.The sets were down right shabby and on any other ship I have seen of past sci-fi flicks, that the pipes were held in place using bracket hooks. I have to give this one out of ten stars mainly for the theme of the film. The plot has been overdone on so many levels in other movies as well as giving a thumbs down for both bruce and thomas jane. Their roles did not fit their profiles, and neither of them looked like they were happy to be in the role.Truly, a sad day for sci-fi."}, {"id": 71, "text": "There is no many bad movies with a good idea, this is one of them. I give it a 3 coz of not so bad idea and story but what Bruce Willis doing in this movie I cant figure out... I dont know...maybe this is some school project, if it is then this is great movie."}, {"id": 72, "text": "I saw Breach, starring Cody Kearsley-Riverdale_tv, Power Rangers_2017; Bruce Willis-Death Wish_2018, G.I.Joe:Retaliation; Rachel Nichols-Alex Cross, G.I.Joe:The Rise of Cobra and Thomas Jane-The Expanse_tv, The Punisher_2014. This is a cheap 'B' grade movie with some normally good actors working with a bad script made of Swiss cheese. You can usually tell a lot about a movie by who gets top billing and who doesn't. It takes place in the not so distant future-about 2245 if I remember correctly-when the earth is dying because of plagues and other things we humans have done to it. They build an interstellar space ark to carry the surviving humans to a distant planet called New Earth, in hopes of starting over. Thomas plays the admiral of the ship but he spends most of his screen time in cryogenic sleep. Cody plays a janitor on board that is hoping to start a new life on New Earth with his girlfriend-she is on board too, but in cryogenic sleep. Bruce has worked for 10 years or more as a soldier but has been demoted for his insubordination and is now in charge of the janitors-Cody specifically-and usually drinks while Cody is working. Rachel is the nurse on board that has to deal with an alien life form that starts infecting people, turning them into space zombies that go around infecting more people. If you are thinking, 'Wow, Bruce Willis fighting Zombies in space!', forget it. There is very little of that kind of action. It's more like as if a person from another country looked at several American action movies and tried to make one of their own, using different pieces from each one. There is a commander who likes to smoke a cigar, an alien menace that can't be stopped by bullets-but is defenseless against something simple, a man that uses one liners while shooting the alien, etc. It's rated R for language and bloody violence and has a running time of 1 hour &amp; 32 minutes. It's not one that I would buy on DVD. I don't think I would rent it either. If you really want to see it, I would wait until it is on cable."}, {"id": 73, "text": "Lots of awful movies this year FRIENDSGIVING, CHICK FIGHT, all that crap from the DNC. This was down there, wresting with them for the slop. Bruce Willis and Jane have bottomed out. It is ALIENS without special effects and a discernable plot. Do not pay money to see this."}, {"id": 74, "text": "I'm hoping this was a tax-scam. Maybe some investment company from Shanghai paid a lot of money for this? I think the director could do a decent soap commercial..."}, {"id": 75, "text": "After a dull start Bruce shows up, His appearence made me watch the movie a bit longer. its one of the few movies i had to fast forward as i realized that it would not get better. I would call it an embaressment."}, {"id": 76, "text": "This is one of the most bizarre and lacklustre movies that has Bruce willis in it.The acting is absolutely atrocious and the CGI blue screen special effects are terrible. The camera is always looking the wrong way, presumably to save budget.Dear lord who keeps funding these awful scripts? There are some generic alien blob things on a spaceship, and the heroes have blue flame flamethrowers.Bruce is so out of place in this.2/ 10 not the worst of 2020, but my word it's close."}, {"id": 77, "text": "As long as you have low expectations you will have fun! Silly horror syfy! Look alike actors too, with a Jodie Foster (Chambers) and a Billy Zane/Matthew McConaughey (Teek). Cheesy action!"}, {"id": 78, "text": "A very bad ripoff of the 1980's Alien ripoffs. Bruce Willis must have lost a bet."}, {"id": 79, "text": "I only half watched this movie, but seriously it's unbelievably bad. Why did Bruce Willis not break his contract to get out of it? He really should have. I'm amazed how bad one can make a movie."}, {"id": 80, "text": "It's so bad it's good. I'm not sure if cheesy hilarious was what they were going for, but if you want a few laughs definitely watch this."}, {"id": 81, "text": "Did it try to be some kind of a cult movie ? The set, the acting, what did we watch. What was this.."}, {"id": 82, "text": "I am a die hard fan and other Bruce's film since I was a child. However, watching this Movie made me feel so sick."}, {"id": 83, "text": "...a fun film in every scene. None of the actors seemed to know how to play their roles; Jane and Murphy seemed firmly tongue in cheek, while Willis said lines as if they were on cue cards, and everyone else tried to fall somewhere in the middle. A few homages to better films and a few humorous scenes weren't enough to make this a 'so bad it's good' film, just a very bad film. A decent script and competent production could have turned this into an enjoyable little popcorn movie, and I hope the people responsible for this mess never make another film."}, {"id": 84, "text": "Watched the whole thing so that my review would be utterly 0, that's ZERO, lower than one and worse than a funny bad D movie. Bad on every level. Direction couldn't evince a performance from ANYONE. Editing made you wonder if the editor was stoned, drunk, smoking crack, snorting PCP, masturbating on the console, stuffing large objects into his nether regions . . . someone please tell us how or why anyone would have stayed on this production past the first day of shooting. Props: piano hinges and laminated particle board for 'Future Cryogenic Chambers'?! What in the Hell is Bruce Willis getting for this . . . 98% of the budget?! Cause there wasn't ANY budget spent on sets, editing, production, script, props, script, ANYTHING."}, {"id": 85, "text": "In the year 2242 the last 300,000 people are leaving Earth for New Earth. Noah (Cody Kearsley) who works as a custodian is technically a stowaway, His pregnant girlfriend is on board, the admiral's daughter. About halfway through their trip they blab something about Fermi's paradox therefore there are aliens. They infect humans and make them want to kill other humans in zombie like fashion.I hate anything with an ark and Noah in it. It is just poor writing. Pandorum was much better.Guide: F-word. No sex or nudity."}, {"id": 86, "text": "I don't understand why Bruce is engaging in these kind of movies. I mean, actors acying so bad, that made him look bad too"}, {"id": 87, "text": "I like alien movies and am really a fan of them. This film tries its way to be a bad copy of them but even there are some direct to video movies which achieve that better than this one. Bruce Wills plays an old drunken elite and drinks and swears through the whole film. No horror no action no acting no plot no cgi qnd special effects... Some teenage theatre show would be more interesting than wasting your time with this garbage. Thomas Jane and Bruce Wills are on their way to be new Nicolas Cage it seems."}, {"id": 88, "text": "Total BS. Possibly the worst movie ever. Bad acting, Bad writing, Bad everything."}, {"id": 89, "text": "This film start with a people talking about human extinction, and a couple(Noah, and Hayley) been separated scene! As turnout, this film is about Noah need to survive and save Hayley from a bunch of people possess by alien parasite! Entire film full of boring conversation, and annoying overuse scene! Such as, overuse of the searching scene, overuse of the walking scene, overuse of the dining scene, overuse of the hologram scene, and overuse of the long angle spaceship flying scene! Make the film unwatchable! All the shooting, and burning scene have blood at certain point, but overall quite messy, portray by sideways, and just saw the light and fire! Make the film quite frustrated to watch! At the end, Noah, and Hayley land on the place still have alien! That's it! Wasting time to watch!"}, {"id": 90, "text": "Wow. Logic? None. Common Sense? Zero. Started out okay. Some pandemic on earth, people bailing on interstellar ships. Got it. Guy sneaks aboard. How? Not really explained; just shows up. People enter cryo-sleep by simply flooding the chamber with some foggy gas. They come out of it by simply opening the chamber. The alien... Where'd it come from? No explanation. One guy confesses to bringing it aboard, but how? When? No explanation.They try shooting the alien-possessed people. Bullets don't stop them. Nobody thinks of shooting them in the eyes, or spinal cord. Apparently their training says shoot the torso, so that's all they can do.First few 'dead' infected people take lots of time to become animated again. By the end, it takes only seconds.Moxacell (corrosive cleaner). Had some potential there when a guy discovered it dissolves the aliens in seconds. Guy discovered that by splashing some on an alien above him, but somehow none of it splashed back down on him. Then they load moonshine made with Moxacell into flame-throwers to shoot blue flame (with some success) at the aliens instead of just splashing some on them. Blue flame somehow works better on human-infected aliens than it does on a reassembled alien.Alien reassembling; they sit and watch as human body parts magically draw closer together on the floor. Bio-magnetism? Hmm... Let's not keep the parts separate, lets just run away and let them assemble into something bigger.Escape pod from a ship traveling faster than the speed of light has no trouble decelerating so it doesn't smash into the destination planet at lightspeed.Lame. Not thought out at all. Apparently everyone leaving earth in 2251 or whatever is an idiot.Oh, then the New Earth arrival... Giant alien (think Godzilla). Girl says, What do we do? Guy says, Burn 'em all. Good thing his handheld flamethrowing gun has unlimited capacity. Going to burn 15 million infected people, then start the whole human race with a gene pool of 2. Good plan."}, {"id": 91, "text": "I gave up after 30 minutes of watching this movie. From the start of the movie I felt there was something wrong. When people are boarding a space craft, a voice is saying 3 minutes until departure, while people are still outside waiting for boarding. Then the voice says 1 minute before departing and you see a crowd breaking the fences around the spacecraft. And the next shot is the spacecraft departure. Really? Did I just see this nonsense?30 minutes in the movie and I gave up. The storyline is going nowhere and most actors are giving such crappy performances, that it is unbearable to watch. Bruce Willis never convinces, not even as an alcoholic macho man. Not for one minute his character is believable. So no idea how the movie ends, because I switched it off."}, {"id": 92, "text": "Worst sci-fi movie ever. Bruce Willis must hard up for cash to be in this one."}, {"id": 93, "text": "...But i tried anyway because it's about space and aliens and Bruce could be good in a Looper way. It is clearly not the case here! Incredibly bad movie, everything is bad starting by the acting. CGI is horrible, Ain't no photography it could have been shot with a phone by students, soundtrack is zero and i didn't mention any storytelling of course. Do not waste your time."}, {"id": 94, "text": "After survive the night I thought Bruce would have some recollection and won't play in movies below his level. I was wrong, so wrong. This movie is bad. It hurts to watch it. It hurts even more after the last scene. If you have SM tendencies, go for it, you will fulfil your desires of being spanked in the face with bad acting, bad plot, and stupid story. There are some many other ways of wasting my life. Maybe I will try to run the Cyberpunk 2077 on my PS3 to recover after this movie."}, {"id": 95, "text": "Bruce's third budgetless movie in the last one year that makes you wonder what has happened to Bruce"}, {"id": 96, "text": "Bruce W???Thomas J???Timothy M??? Seriously guys??? what the hell were you guys thinking??? I don't get it.. I am speechless...I wish I did NOT see this film....what a disaster... I really am embarrassed for these guys..."}, {"id": 97, "text": "It's the year 2242 and Earth is in chaos. Those who could leave have left for a planet known as New Earth. Noah (Cody Kearsley) is a janitor on the last spaceship leaving Earth. The passengers are in cryo-sleep while he is part of a skeleton crew maintaining the ship.This is a sci-fi B-movie reminiscent of the many during late 80's and 90s trying to piggyback the Alien franchise and others like it. The story is simple and yet has too many sci-fi elements. The special effects are inferior as expected. There are good actors here but the lead is not one of them and I'm not sure if Bruce Willis is one anymore. The set designs are weak. Even the props are poor. I'm not as disappointed as most since I never had much expectations for this movie. This is a B-movie pure and simple but there are much worst out there."}, {"id": 98, "text": "I actually managed to see the whole thing. This could have been a lot better if they had better cinematography and CGI and maybe a bit more background info to the story and carachters. The acting is actually pretty descent"}, {"id": 99, "text": "I thought that Bruce Willys wouldn't do a bad movie. I was wrong. The characters have zero to little background story. The virus on Earth is not explained. The alien thing is not explained. The plot is boring."}, {"id": 100, "text": "I don't think i've laughed so much for ages. Half the actors can't act, WIllis and Thomas Jane seem to know it's cheap and the writing is terrible. Hell, the editing and lighting man need shooting.However, it is so funny for this reason.You get some actors hamming it up, others just bad. Jane and Willis clearly have a great presence (Jane doesn't star much).The Quantum drive looks like the Netflix logo. lol. THe windows on the ship are all dirty and the star of the show is a cleaner. haha.You couldn't make it up.The best bit is the low level CGI when the zombies are blown up and come back together in a T2 style montage, to chase them round the 1 corridor the prop department had time to make up.I haven't laughed so much in ages."}, {"id": 101, "text": "Bruce Willis plays a down and out drunk. Demoted from the big leagues and ending up working in toilets... That is just how he ended up in this role. Bruce... I am deeply ashamed of you for having accepted a role in this pathetic drivel. I would assume that Bruce Willis was cast because his fee was far lower than the cost of having to produce something credible and worth watching plus advertising. People see Bruce Willis's face and get reeled in.Whilst Bruce Willis managed to play to his usual acting standards, the rest of the cast appeared to have been expelled from a 3rd rate acting school for bad grades. The budget seemed to be almost enough to cover the storyline which in of itself wasn't overly horrendous, however, whoever was in charge of the execution should be banned from working in the entertainment industry for life."}, {"id": 102, "text": "I don't think I've seen a sci-fi film with such poor production values in some time. I'm sure this was shot on a very limited budget but its difficult to suspend disbelief when you are watching a spaceship with concrete walls and chipboard hyper sleep chambers.Bruce Willis is actually in this one quite a bit, rather then the one scene films he usually appears in these days, but he doesn't really have much to do and most scenes are just him sipping from a hip flask and watching someone else work. I suppose you could watch this as a drinking game film and take a drink every time Bruce does, maybe thats what the writers were going for.The plot doesn't seem to make much sense, why would you need five janitors to clean the bathrooms of 15 other people. How much mess can they make - clearly a lot as the protagonist has to spend a year cleaning toilets. Odd.I thought the directors last film, 3022, was pretty good and was surprised its the same director of photography on this film as it just looks so bad and the shots are terrible.I can only guess perhaps the budget wasn't there for this film or it was shot in a hurry for whatever reason. Either way its not much fun to watch unless you enjoy looking at how to cheaply make an unconvincing spaceship set."}, {"id": 103, "text": "Hey, Bruce is one-note, one-song guy with a standard shtick of action plasma running through him. It's always been that way, and he does it well. When he doesn't, it's because he has crap to work with. Most science fiction movies are utter garbage, or at least just barely watchable if you know how to drink your way through them. Or write a little poetry, or talk to your mom during the romantic parts. This doesn't pretend to be something it's not, and thus, doesn't take itself too seriously. When I saw the ratings and looked at the trailer, I thought Wait, something is a bit off here! I rarely review anymore because over the years there are more and more whiners and princesses, and self-entitled primadonnas who are 100% negative, and that is NOT a review of a film! Complaining and belittling of any creative effort, no matter HOW seemingly bad something might be doesn't create a whole picture of an experience using the objective mindset needed to accurately explain an 'opinion' that is worthy of being taken seriously. Meaning, that too often it's ALL about the reviewer's emotions and expectations and creative 'fragility', and NOT about the movie itself. This was fun and perfectly campy, well written well acted. Everything was pretty believable and didn't insult your intelligence by pretending it was anything other than it was. It was simple and genuine and the writer knew his characters fairly well. And he wrote accordingly. The strongest arm of the movie is that it had genuine suspense! I was certainly not expecting that. Sadly, there are more and more princesses in the world writing reviews and less and less castles for them to feel safe in so they won't be SO disappointed and bereaved when a movies falls short of their narcissistic demand that it should have been better. I give it a six. The extra star is for the fact that it didn't insult expectations I never had in the first place."}, {"id": 104, "text": "Oh my giddy aunt!!! This is bad, just bad everything - I am lost for words!It is like some 70's low budget made for tv crapola and that is an insult to some of the great Roger Corman classics.Poor old Bruce looks like my grandpa now and even gramps has more life than poor old Bruce, he truly has lost his sparkle but like most actors they cannot give up the limelight and grow old gracefully and bow out with style.I know all the great acts from yesteryear like Lance Henriksen, Ron Perlman, John Cusack and Nicolas Cage are taking any old duffers now to pay the yacht mooring fees but I seriously dont think any of them would have taken the paycheque for this howler monkey.This is what I would describe as a career killer; a 6 foot deep one and all that is missing is the headstone Here Lies Bruce Willis Died Hard In 2020 R.I.P."}, {"id": 105, "text": "Breach, or Ant-Life, whatever it's called...has no redeeming qualities...at all.The story doesn't make sense, the first 30 minutes of the film absolutely nothing happens while the dialogue that was supposed to establish character ties was a random disjointed mess.While the scenes were semi-coherent the actors tried to perform, but at some point, everybody gave just gave up.Bruce also looked like he was having fun, but he got bored even faster than I did.And I'm not saying that the film is bad because they did not have the budget to do good CGI muzzle flashes, no.It's just only boring. Not intentionally funny or entertaining, not full of action or tension.For some reason, they also found it funny to insert occasional Alien references and even full scenes, seeing those really hurt me.I won't say they did not try, but this is clearly the case of this looked so much better on paper or oh, this is how it turned out?."}, {"id": 106, "text": "Cody, Bruce, Timothy and Thomas for the most part did their part. However even the presence of A+ and B+ actors did not make this movie watchable.The acting of the people mentioned was fine, perhaps a couple of more people put an effort also. Since there is little CGI i guess it's fine also. Same with the environment, and decorations. The rest of the movie is bad.The plot is terrible, the motives and actions of people are idiotic, the villain and monsters are virtually flat. At times this movie feels like a parody, as none of the jokes, or conversations were executed well.It just feels cheap on almost all levels. And it's a shame really, because if some of the scenes would have been deleted, a better monster was chosen with some suspense added - this could have been a pandorum lookalike.In general I cannot recommend this to anyone except those few who are hardcore fans of Bruce Willis. All of the rest should avoid this movie.With better writing, more suspense and less stupid and forced action this could have been watchable as at times it does feel like a horror movie. However for the most part it's neither scary nor fun to watch. I give it 4 and it's only out of the respect for the leading actors. That's how bad this movie is. Unfortunately that is."}, {"id": 107, "text": "First, let me tell you that I like Bruce Willis.BUTHe must have really needed some quick money badly. I think this might just be his worst movie to date!If you want to watch this movie because Bruce Willis is in it, DON'T. It's better to remember how he was in better movies he was in.I am giving this movie 2 stars ONLY BECAUSE they at least went through the motions to try to make a movie.This movie is truly bad! You have been warned!You will never get these 92 minutes back!I'm not even going to waste my time listing all the reasons that it IS bad because I have already wasted too much time TRYING to watch it.I couldn't watch more than 15 minutes of it! In fact, I wanted to stop watching it after about 8-10 minutes, but I decided to see if by some chance it might get any better.NOPE!Everyone who knows Bruce Willis knows he is capable of much better acting then he shows in this movie.But you can only work with what you are given,And he was given a truly terrible script! Even he couldn't save this movie! I should have known by the fact that he got 2nd billing after an UNKNOWN actor!If you don't believe me and want to watch it anyway, then you go right ahead.And if you do, I am officially telling you right now ahead of time;I TOLD YOU SO!"}, {"id": 108, "text": "Once upon a time, critics tore apart a young director named Edward Davis Wood, Jr., for making what they called the worst movie ever. Well compared to this, Ed Wood is a genius. Ed Wood's worst movie is good next to this one. Ed Wood could not launch his career sunk by critics, but the director of this film seems to enjoy unknown privileges. Why? Doesn't Hollywood say you're only as good as your last job? For unknown reasons, this terrible director and producer goes on and on working with stars the size of Bruce Willies. (Poor Bruce) Aren't there better directors in Hollywood? there must be thousands much more talented who are being ignored. Why does this person have a job? Weren't there better and brighter scripts to film or invest money in? Unfortunately I think this more often every day. I always try to see things from a positive point of view but it is getting harder and harder. I hoped that this movie was actually a joke, and I tried to see it from this perspective ... was useless. And those who invested money, don't they regret it? Please Mr. Willis, don't end your professional career by burying yourself under this heap of bad productions. This is not cinema, nor entertainment, it is a scam. A scam for those who invested the money, a scam for the audience, a scam for the professionals who worked in it ... What is happening to the film industry? Is the imagination over? Is this movie the best they can do? Really? What is the excuse in this current age, for not doing things right? Not to make good CG? There are children who with their phones are capable of making better effects ... It's sad to see so much waste."}, {"id": 109, "text": "I have actually watched this movie twice, and trust me when I tell you that it doesn't get any better with repeat viewings.I have nothing against low-budget indie flicks, and I have watched enough of them to know that they can be just as enjoyable as big budget, studio-backed blockbusters - but this one did everything wrong.Okay, almost everything, because I actually liked the set design and the lighting; I'm a sucker for grimy, grungy sci-fi settings, and Breach delivered on that front. Some commenters have mentioned how cheap the sets looked, but I used to be a Trekkie; I was 100% willing to run with a reactor consisting of three red neon lines, and accept the general aesthetic as fitting a ship where crew comfort wasn't exactly a priority.But everything else was a disappointment.Plenty of other people have already mentioned the CGI and the poor editing and pacing, but the filmmakers apparently didn't even care about a trivial little thing called 'continuity' either, and at one point, Commander Stanley is referred to as 'Captain Stanley'. It's such a small thing, so why couldn't they be bothered to get it right?And speaking of small things; they even managed to spell one of their own actors' names wrong at the start of the movie, which is a very special kind of cluck up.The fight choreography is also poor, but I wasn't expecting much in that department anyway. Nor was I expecting much from Mr Willis, and yet he still somehow managed to disappoint.In fact, the acting is the most frustrating part of the entire experience--even more so than the storyline, which we'll get to next. The filmmakers squandered good actors, although how much of the blame should lie with the writers and how much with the director, I don't know. What I do know is that someone should have: a) told Tim V Murphy and Thomas Jane to tone down their cartoonish accents. b) given Rachel Nichols more to do than be Willis' little shadow. c) actually told the actors what kind of movie they were making, because this movie just doesn't know what it wants to be.Is it a serious space-based horror? Kearsley, Clementi, Nichols and Mulvey seem to think so, and they're all (re)acting accordingly. Then you have Murphy and Jane who are just chewing the scenery because apparently they didn't get the same memo, and the aforementioned Mr Willis who is just there, whose acting ranges from 'grumpy' to 'surly' regardless of what is supposedly happening around him, and whose one-liners are simply cringe-inducing.And the less said about the Admiral's 'elite commando team', the better...Now, onto the storyline, and I was again 100% onboard with the premise. I didn't care that it wasn't original, so long as it was well-executed and entertaining. Well, it was neither. Character motivations are paper-thin at best, incomprehensible at worst. Characterisations seem to flip on a dime, too - so you didn't care about leaving 19 billion people behind, but you DO care about 300,000 on this ship? Right. The alien gets free shortly after leaving Earth but waits months to start wreaking havoc? Give me a break.You know, writing all this out makes me think something must have happened at some stage of the production. Last-minute rewrites, perhaps. I just can't believe that anyone would set out to create the mess this turned out to be, unless they were aiming to deliberately tank some careers, and I feel genuinely sorry for the less well-known cast members; I hope they don't end up being haunted by this thing.Lastly, I'd say watch it drunk, but I tried that the second time round and it was still bad. So just...avoid it."}, {"id": 110, "text": "This film should be used as an example for some film class. Budget special effects and sets aside, this film fails on so many different levels. The writing is bare bones soulless drivel, but that's pretty typical among these low rent scifi movies. To make the poorly paced writing worse, however, is some absolutely awful editing. The first 30 minutes of the movie feels like someone went at it with a chainsaw, leaving you wondering if you dozed off and missed something. It's possible that the script alone may have been merely bad if it had decent editing, rather than truly awful. The walls are papered with flat characters that serve nothing more than to become fodder later. Character motivations are flimsy at best. The camera work is at times passable, and at times seem like someone forgot they were operating a camera. Color grading ranges from jarring and off putting to I recognize that preset. It's so predictable I could have told you the ending at the 30 minute mark. It's entirely forgettable. I just finished watching it about 10 minutes ago and already can't remember any of the character's names.This film basically offers nothing memorable or noteworthy, not even brainless action fun. A solid skip in my book. If it's on someone else's dime, perhaps it may be worth the time investment if you just need some background noise."}, {"id": 111, "text": "And not wow in a good way!When I sat down to watch the 2020 movie Breach from writers Edward Drake and Corey Large I must admit that I was expecting a lot more from the movie that what director John Suits delivered. Why was that? Well, I mean a movie that had both Bruce Willis and Thomas Jane on the cast list? What could possibly go wrong here? What would there be not to like?Apparently if you take the movies Alien and 28 Days Later and mix them together, you'd have the formula for Breach (aka Anti-Life), except that Breach lacked the intensity and entertainment that both those movie have. Breach just feels like a watered down hybrid version of those two movies, where all energy has been sucked away.The storyline in Breach was as unoriginal as anything could be. Again, I redirect your attention to the Alien and 28 Days Later movies and you have the storyline that writers Edward Drake and Corey Large managed to come up with. I am especially impressed that something like this would pass today and make it to the screen.Thomas Jane was not really all that much in the movie, which was good, as this movie will not tarnish his movie record all that much. Bruce Willis, however, was there almost all the time, and this movie was a swing and a miss from him, and it doesn't make a great addition to his repertoire of movies.I managed to sit through the movie to the very end, though I was hardly entertained by Breach. In fact, I was more dumbfounded that a movie so blatantly ripping off two established movies could see the light of day. And the ending of the movie, now that was just a slap to the face. The storyline have you beaten down and stepped upon, but the ending just brings a cold, dead fish to the game and slaps your face repeatedly. That ending was just abysmal. Not only was it generic and predictable, but it was just saying that the audience watching it deserved no better.You might want to do yourself a favor and give Breach a wide berth. It is not worth the time, money or effort, believe you me. My rating of this 2020 movie lands on a generous three out of ten stars."}], "reviews_amount": 112}