{"name": "Andhaghaaram", "titleId": "tt09110340", "reviews": [{"id": 0, "text": "Felt like watching a DC movie in Tamil. Runtime may appear to be a bit long. But if you sit tight and get through the first hour, it'll be an unforgettable movie. Wise choice of actors. Specially Arjun Pooja and and Vinod Kishan. Just loved the movie."}, {"id": 1, "text": "It remains me a screen play of dark series we can also do that thing proof here unique story, dark premise,if miss one frame u should rewind worth watching"}, {"id": 2, "text": "A complete supernatural thriller after a long long long time... hats off to the team... truly this movie is like meeting a lion inside it's own cage... direction and cinematography mind blowing... awesome movie thanks a lot for a good entertainer... waiting to see more future projects from this amazing team... 👏👏👏"}, {"id": 3, "text": "The only thing that works it the cinematography and lead actors' acting and that's the end of it. Poorly written half-baked script which is neither supernatural, neither thriller, nor psychological. The supernatural angle is rather hilarious and made no sense to the plot built in initial two hours.Had high hopes because of the reviews but a truly terrible movie. Not recommended for any serious movie lover."}, {"id": 4, "text": "Complete movie is off, poorly written script. Nothing will make not sense, too much of patch multiple story naration but not properly focused on subject, many time you feel like what is actually happening.I feel it would have been a great movie with clear story with proper depth, Amazing direction, cinematography and sound acting superb."}, {"id": 5, "text": "I am writing this about an hour into the movie. It has an intriguing dark premise and has not been predictable so far. Thankfully, the movie is also without gimmicks and excessive melodrama so far. The actors have acted well and fit their parts. Hoping that it gets better.Update: The second half gets a bit tiring and at places convoluted. Could have been edited by around 20 minutes and the big reveal could have been more effectively explained. Watchable but the second half pulls it down."}, {"id": 6, "text": "So much confusions in logic and understanding the movie. Even you can find if you watch again. Not sure the villain is doctor or his patient. Why does he have to kill the patients. Because he says, you or raping and killing people and why do you need to live. So he need to kill them not the patients. What did hero do. Why is he threatening. So many many logical mistakes and no twist no finding outs interesting things. But they've made it to feel like nice movie. So 5 for 10"}, {"id": 7, "text": "Nothing but movie is for waste 2:50 hrs of ur life"}, {"id": 8, "text": "Really, i had to sit 3 hours to know about the ghost who talks through the phone as medium. Just by playing around with the screenplay directors these days feel they can create a great movie with a stupid illogical script."}, {"id": 9, "text": "I had too much expectation for this movie, but all gone in vain. Whole movie moved with Character analysis, bits and pieces of scenes. I find it very confusing and long. positive aspect: all the characters acted so good and involved, especially Vinod and Arjun Das. And the camera and lighting at its best. I consider this movie as confusing rather than engaging."}, {"id": 10, "text": "It's soo long. Acting by the cast is brilliant cinematography very well done. If it's a crime thriller it would be an masterpiece. But story line was so weak. Climax scenes was not soo thrilling. Due to overall super natural element and for overall thriller it's one time watchable. My rating 5/10"}, {"id": 11, "text": "Very well executed. Great work done by the teams and crews. Connected all the dots...An must watch filmKudos guys"}, {"id": 12, "text": "Keeps you on the edge. Intriguing plot. Convincing performances. Fresh characters. A bit long but enjoyable. Go watch it."}, {"id": 13, "text": "Direction-9/10 Story-10/10 Acting-9/10 Sound effects-8/10 Music-10/10 Editing-10/10 Screenplay-7/10 Cinematography-9/10Overall-9/10A superb story, Experience a unique movie, The duration is a minus for the movie but you will enjoy when you are watching the movie......."}, {"id": 14, "text": "This is one of the best movie I have ever watched. Must watch for all the thriller lovers."}, {"id": 15, "text": "If you want waste 2hr watch this movie it's like a short film and pathetic story ghost calling using a telephone and Arjun das is over acting its too much for a movie worst film I have ever watched"}, {"id": 16, "text": "Pefrection from the movie Title Andhaghaaram (darkness, absence of light) . Quote (Devil is in the details ), execution and hardwark of all departments for almost 5 years has given a top notch thriller from a Debut director Vignarajan.My advise for any movie lovers to watch this mvoie with patience without pause and forards. Most importantly use headphones to enjoy the thrill and background music."}, {"id": 17, "text": "First of all it's almost looks like an A24 thriller with left field visual and mystery growing with respect to time. Well written characters and lame less narration. Kudos to director and producer for presentin a non compromised cinema."}, {"id": 18, "text": "Screenplay vera level.... Sema movie .. super story.."}, {"id": 19, "text": "When we see the duration , it is 2h 51m , We feel it is a bit long ! But... The Screenplay is so awful That Overshadows the duration and Make us witness the Good Supernatural thriller! The performance of Arjundas is a highlighted one! Go for a watch! I'm sure This film will satisfy You ! WORTH A WATCH !!!!"}, {"id": 20, "text": "Pros - Acting , Different plot , music , non linear screenplay , twisted climaxCons - length of the movie ,Verdict- According to me .. different from usual Tamil mysteries, one time watchable ( due to length ) , lots of terrific scenes , good movie"}, {"id": 21, "text": "The genre of supernatural thriller is not new for Tamil Cinema; right from Mohini till Kanchana, we had several versions of supernatural stories on screen but the genre was not properly explored enough. The movie Zero came close in that aspect, in exploring something new but it failed to impress many. However, Andhaghaaram does it right - exploring the unexplored.Right from the beginning, the setup of the movie is straight and clear - to provide a dark and intense thriller. The gripping camera work assisted by some sharp editing pattern, keeps us guessing throughout the movie. Though there are instances where one might feel distracted, one gets pulled into the action right after that. With a well-written screenplay and a powerful background score, Andhaghaaram explores the supernatural and psychological elements of our life - nothing new, yet refreshing when put-together."}, {"id": 22, "text": "Package of HURROR,THRILLER, MYSTERY....EVEVRYTHING... EVERY DOUBT WE HAVE AT THE BEGGINING WE'LL GET THE CLEAR CLARIFICATION AT THE END🔥..TWIST💥"}, {"id": 23, "text": "A very good thriller movie which keeps you glued till the end. Arjun Das steals the show with equal performance from Vinoth Kishan. Good storyline which helps to keep us engaged till the end."}, {"id": 24, "text": "Positive: Superb story, well acting by both arjun and vinod, Nice BGM, last 1.5 hr will really increase the hype. Nice camera work, intense portions available, last 20 min is just mind blowing, the wait for the end is really blow your mind, Family watch 100%Negative: Little lengthy but really worth to watch, Screenplay would be little better not bad but little better would get good reach of the flim."}, {"id": 25, "text": "A best thriller in recent times and bgm acting are main highlight of the film"}, {"id": 26, "text": "Brilliantly written non linear script, only flaw that I could find is casting of pooja Ramachandran as elder sister should have choosed someone with older look and finally this movie is better than the most of the cheap action flicks in recent Tamil cinema."}, {"id": 27, "text": "I want to enjoy the movie , I don't want to research it. Repeating and confusing scenes which does not make any sense."}, {"id": 28, "text": "Story &amp; screen play was very slow. Arjun das acting &amp; sound was very good but cheractor bilding was very slow and bad but krishan (selva ) cheractor perfomnce was so good. But movie will slow leag and movie story plot was different but not accetable, 2:51 the time length of the film and many place will have leag. Time dureation will small movie will get more good"}, {"id": 29, "text": "Screenplay was horrible, in the beginning part camera was shaking left right and diagonally when dialogue were on between characters, too much fade-away and fade-in In the name of new generation movie make stop crucifying audiences with such bad screenplay If you cant get this simple aspect of movie making dont make movies"}, {"id": 30, "text": "A truly remarkable movie from a debutant V.Vignarajan. No jump scares for a supernatural genre and that's what makes the movie outstanding. The plot is non-linear with scenes switching back and forth from present to past. One might say it's a little slow inbetween but not tedious. Arjun Das &amp; Vinoth Krishnan showed their best with Arjun being a depressed youngster on the verge of breakdown and Vinoth Krishnan with his powerful performance of a blind guy striving against all the odds and Kumar Natarajan as Dr.Indran not bad with his performance. A must watch film.."}, {"id": 31, "text": "First of all its a long drawn 2 hr 50 minutes..its not worth it. Just drag and drag with same phone call and different unnecessary conversations. Then drag again with all actors expression..its director and editor fault. Where the climax revealed in 3 minutes,its not worth it 2 hr 45 minutes. Could've done it in 2hrs.. Bcz its in Netflix glad i can fast forward it. Bcz of duration felt all actors performance repetitive and at time boring."}, {"id": 32, "text": "Andhaghaaram - It's a new experience for Kollywood Audience. The screenplay is slow yet it didn't at all felt boring. Last 30 minutes will be more interesting. Selvam, Vinod characters was well played. Pradeep Kumar - He did his best in BGM Scoring as he does in singing 💚. Cinematography was top notch. Editing was good. Watch out for the detailing works in the first 10 minutes🔥"}, {"id": 33, "text": "Finally watched today #Andhagaaram @vvignarajan awesome movie with good categories like mystery,thriller&amp;horror, your screenplay is outstanding level especially story moving way in non-linear path 👌🏻 Rally I missed out this movie in theater experience &amp; another backbone is BGM 👌🏻@iam_arjundas really you're unlocked the mystery in #Andhagaaram after #kaithi movie i become your fan, now more &amp; more lot's, I become goosebumps in 1 scene once you hit the phone by cricket bat &amp; teacher said as Selvam ghost at your room @vinoth_kishan you too nailed in acting skill"}, {"id": 34, "text": "The standard of Tamil cinema will rise from now on from the so called masala flicks to the mind engaging movies. I have watched it like a hollywood movie. Really brilliantly made. Planning to watch it again. All actors had lived into the characters...even a minor charactor had never let us down. Hats of the the full team"}, {"id": 35, "text": "An extraordinary psychological thriller and horror movie since the Ratshasan ,every actors have delivered their full potential and the cinematography was fantastic must watchable movie 💯"}, {"id": 36, "text": "One of the best supernatural films I've ever seen! Everything was excellent especially music, cinematography and direction. Casting was also perfect for this film. Don't miss this film, highly recommended. Very intriguing Storyline. It would've been perfect if the movie was a bit longer at the end as the climax was rushed due to not exceeding the 3 hour duration. The first half isn't slow, I'd say it's the character development within the story. I'd watch this even if it was 3 and half hours film. Kudos!"}, {"id": 37, "text": "The movie should have started with a note - For better experience use headphones. The sound design and editing was amazing right from the scene they show a blood drop. But, there are some aspects of the film which looks like the film is set in the 90s. It was that hard to accept the retro landline fact, and manual call list, internet centers. The movie goes on and on, like 3 parallel stories, only to connect and surprise you. Vinoth and Arjun Das were best in their roles. Credits to the dialogue that makes you pity for Vinod. One of the best performances and writing with minimal characters. You would like it if you like slow burn movies!!"}, {"id": 38, "text": "A Must Watch Movie 🍿 Treat For AClass Audience . Enjoyed it...But it Doesn't satisfy People Who love Village stories"}, {"id": 39, "text": "Story is good.....but slow burn only for movie....if you have patience it's for you...really love the film"}, {"id": 40, "text": "This is not the regular Spooky movie. Every actor has done justice to their role, Especially Dr. Indran , Selvam, Vinod... Music played vital role in this movie . First one hour was clueless then the movie picks up the pace. Director Vignarajan won first race comfortably."}, {"id": 41, "text": "One of the best thriller movie in Tamil Miss the movie to watch Theatre"}, {"id": 42, "text": "One of best thriller movie in tamil Miss the movie in theater"}, {"id": 43, "text": "What a screen play. Very good background score. Vinoth and Arjun dass good performance."}, {"id": 44, "text": "Really u nailed it vinod kishan acting semma vera level performance....... Ultimate story very scary😱😱 but interesting tooo. I really like this movie. Arjun acting is also nice."}, {"id": 45, "text": "A Decent supernatural thriller, with proper technical values and good production values, as a film it may seem lengthy but if we think we are watching a mini series its a good watch, nothing to complain."}, {"id": 46, "text": "The acting camera bgm dialogue everything is top level must watch nail biting thriller every shot is great . Well done team"}, {"id": 47, "text": "I saw the trailer and watched it as I liked the trailer. It is a suspense thriller with some horror. What's good: 1. The story is good. It isn't great but if you want to watch something different, it's for you. 2. The performances of all actors is good especially Vinod Kishan. 3. The director needs to be appreciated for trying to make something different. What's bad: 1. The film does get boring and confusing sometimes as it is almost 3 hours long. People don't have that much patience nowadays. It would have been great if the film was around 2 hours."}, {"id": 48, "text": "Cons:- The movie logic is that the ghost cannot kill anyone but in the climax can kill...i didn't get that...The hero tells the psychologist that he's just a ghost ,he cant do anything..but selva the other ghost can kill his enemies...could have made a better climax ...climax disappointed me..But unlike some hollywood movies ,this movie ends with the good people winning...Pros:- Didn't find any lagging scenes..i actually planned to skip and watch the movie...but after minutes into the movie ,i couldn't skip any scenes....found some reviews that the script is really confusing and was hard to follow up,but the same reviewers appreciates nolan movies bcoz of its complexities...i was like what is happening right now..i like this kind of movies..This movie made my brain to work hard...Ignoring the climax logic ,the movie is a great attempt.."}, {"id": 49, "text": "Probably a rare kollywood movie. Absolute brain stunner, with twists and excellent balancing in the timelines. A much worthy movie as well as much underrated movie. A must watch in theatre."}, {"id": 50, "text": "True to its Title,the film throughout makes sure the viewer is as alert and vigilant as a person who is lost in complete darkness..The director makes sure that the audience is kept engaged across every scene with riveting scenes &amp; screenplay..The slightly long run time is completely justified after comprehending the entire storyline..Stellar performances by the leads who live in their characters till the end..Surely a great watch in recent times..Waiting for more from this director.👌🏻👌🏻👌🏻"}, {"id": 51, "text": "What a movie from debut director. He crafted this movie. Complexity story and non linear screenplay. Even I have to watch this movie 2 times to understand. Strong acting and excellent music. Kudos to entire team."}, {"id": 52, "text": "This movie remembered me 13B movie spirit in mobile &amp; Land-line."}, {"id": 53, "text": "Best mystery+supernatural combo movie of the year. Omg! Selvam was such a lovable character. I wonder what happened to his house at the end. Bdw, to all those wondering if they should watch it, well u must. The movie is very mysterious and the story is also very good. Even at 2 hours past, I couldn't understand the connection between all the three stories. It was that brilliant. I do had one doubt if the movie is from a Tamil industry or Malayalam because they kept mentioning Kerala here n there so I wasn't sure. I know, I know it wasn't exactly a scary or horror type but still I felt very scared at many points in the movie. And actors were very believable. They all looked like common people. I like these kind of movies with realistic type characters. These days I am interested to watch regional movies more."}, {"id": 54, "text": "Brilliant acting by entire team. Movie is pretty much detailed and layed out at right locations. This is not momento or any other film adaptation asi see it."}, {"id": 55, "text": "Good supernatural thriller. This is a very different movie, not scary monsters but it has really good scare"}, {"id": 56, "text": "One of the best thriller movie I ever watched. It will keep you engaged till the end. Though, the field duration is little long as compared to the movie we have been watching recently, but you wont feel it.Do watch it."}, {"id": 57, "text": "Like mentioned by many its a lengthy movie but well scripted! The film keeps you thrilled with beautiful narration which also compensated the screen time. Feel good watching a beautiful thriller in Tamil!"}, {"id": 58, "text": "Nicely written and nice work by cast and crew worth watch"}, {"id": 59, "text": "Its time to ditch heroism cult and start supporting this type of movie. Should get best screenplay award or at least nomination in national level. Not an usual horror movie template. Difficult for a director to make a person sit for 3 hour continuously, but he did it without any fuss. Kudos to director and not even a single unwanted character in the 3 hour journey. I created an account in imdb just for writing a review for this movie. Worth a watch and good review."}, {"id": 60, "text": "Awesome movie, Fantastic acting, direction and screenplay is fantabulous. Very Different thriller genre. Conceptually felt new."}, {"id": 61, "text": "Amazing movie, Thrilling, Twist and very interesting movie"}, {"id": 62, "text": "One of the brilliant movies of tamil cinema... That definitely needs to be celebrated like anything... Kudos to the entire team...!"}, {"id": 63, "text": "Andhaghaaram is a very good,well written psychological horror/thriller what so ever.It also had a very good casting.Andhaghaaram is a revival of the horror genre or lets call it a neo-horror.It is said to be very long,draggy by others.but i didnt feel the same.if you are very impatient,you are missing a good masterpiece.Good things come to those who waits.If you want a new experience,you're welcome."}, {"id": 64, "text": "As tamil audience as bored of same stories of masala sentimental stories .This stands alone.. Superb plot it takes time to understand context is mixed in sometimes ..but in the end it feel good film as a thriller and voice of arjun das as actor and as doctor hard voice ...It is something we need in stories.. it just feels sooooooooo good.WATCH IT ...and thanks to atlee for making this movie . It is surprise from that production."}, {"id": 65, "text": "First of all the movie was amazing, especially the acting of arjun das and Vinod kishan was great, the movie was slow but will be lovable for cinema lovers overall the whole team of andhaghaaram gives the different cinema for kollywood...."}, {"id": 66, "text": "This movie will take you to another level of experience. It is not just horror movie it's also a psychological thriller. The narration was excellent"}, {"id": 67, "text": "It is really enjoyable and supernatural effect also worked in this film. Strong content movies was definitely succeed so this one added on that list. Each actors performed their jobs very nice. Duration doesn't matter in this film.Worth to watch."}, {"id": 68, "text": "A great effort but as everyone says the run time is little long it is the only negative point of the movie but the story and the screenplay and the acting was great arjun das killed it . A must watch movie and a new type of story."}, {"id": 69, "text": "Love the screenplay and the moment the mystery unveiled."}, {"id": 70, "text": "If you love movies with complex story this one if for you...making style of this film makes it a must watch ... duration is long but there not a single dull moment in the movie...every scene is somehow connected you just have to wait for bomb climax 🔥🔥"}, {"id": 71, "text": "THIS MOVIE IS EXECUTED WITH A COMPLICATED SCRIPT WHICH WE CAN'T JUDGE THE ACTUAL STORY OF THE MOVIE. 3 HRS IS MAXIMUM BUT IT NEEDS THIS DURATION . SLOW BURN THRILLER FANS WILL SURELY LIKE THIS."}, {"id": 72, "text": "Superb movie every one want watch , superb direction"}, {"id": 73, "text": "Oh my god I'm now see complete this movie very much screen play and predeep background bgms and many twist and story = twist"}, {"id": 74, "text": "Some audience may not like coz of lengthy still it justified why it was lengthy casting was superb no doubt of their acting even editing and cinematography was superb"}, {"id": 75, "text": "Amazing screen play and story one of the best movie and good plot twist"}, {"id": 76, "text": "THRILLER LIKE NEVER BEFORE I WATCHED TILL NOW. SUSPENSE / FANTASY / HORROR ..........NO THERE IS NO ACTUAL WORD RELATED TO THIS, TO BE NAMED AFTER THIS CONCEPT IN ENGLISH BUT DEEP DARK SCIENCE ......YES."}, {"id": 77, "text": "Brilliant movie, you will never guess what's gonna happen next. Watched it in Telugu it's a long movie nearly 3 hours, slow in the beginning but goes very fast after one hour, you'll feel like wish it's longer. What a movie! Kudos to the director, amazing screenplay. All the actors did an extra ordinary job. I feel like I have watched a good movie after so long. This should be the best movie of this year."}, {"id": 78, "text": "Andhaghaaram is the kind of thriller that pauses for a couple of seconds to gaze at smoke curling out of a cigarette. Some would call that stylish. Others will say those couple of seconds could have been axed to add some momentum to the proceedings. But here's the thing: writer-director V Vignarajan isn't after momentum. He is after mood. There's a scene where a cricket coach named Vinod (Arjun Das) - he's slowly losing his mind - pastes endless pieces of paper on his walls. I can't say for sure, but I think the gap between each piece of paper is the same. There's some OCD-level attention to detail in this film that gives us the quote: The devil is in the details. The devil is also in the narrative. Or at least, some sort of vengeful spirit.READ THE FULL ARTICLE ON FILM COMPANION"}, {"id": 79, "text": "The movie's subject is completely fantastic.arjun das is a masterpiece every character is beautifully potrayed .2 to 3 times watchable well i didn't realise how time went. go for it"}, {"id": 80, "text": "Good Movie. Everybody acted well in the movie. Songs were not needed in the movie. BGM was good in the movie. The movie was not so interesting or thrilling at 1st half. The movie was so interesting or thrilling at 2nd half. The movie was lengthy. The movie bored and lagged at many scenes. Good Movie."}, {"id": 81, "text": "Goosebumps with the acting of Arjun das and Vinoth Kishan they nailed off the movie the direction and cinematography was really awesome and many of them telling it's a big movie (as duration)but there is no unwanted scenes this movie will make you drive crazy must watch"}, {"id": 82, "text": "It is really appreciated that Andhaghaaram opts for psychological suspense, ignoring the special effects, jump scares that have become a fashion in recent times. A clever, riveting supernatural, part psychological drama that fits many genres into one film which pays off in the end. Disguised as a Supernatural film but this is actually a revenge driven drama towards the end with frequent character shifts that are fast. The film blurs the lines between reality &amp; fiction to deliver a psychological shock &amp; that will someday have the respect it truly deserves. It does not register or decipher what is happening but follows imaginary stimuli. In this way, reality, and fiction merge, they can no longer be differentiated. Darkness is a popular film element, and it comes across as striking.If one releases oneself from the expectation that there must be a 'thrill' behind the gripping opening where a patient pulls trigger on Dr Indran (Kumar Natarajan) and series of suicide follows. There are no questions left on closer observation when the final title begins. In addition to the quality of the content, there is a formal implementation that works on the story in the smallest detail right from the beginning till the credits roll. And then, we are introduced to Selvam (Vinoth Kishan), a blind librarian, a MEDIATOR helping people in the library whose roots hold a mysterious past. Then we meet Vinod (Arjun Das) a cricket coach who lives in a flat. Unfortunately, things are not going well in his life and there is a sense of guilt that prevails. It is difficult for him to cope with the death of his best friend. The room where he stays is a great setting and at the same time a reflection of his conflicts and unstable character. The environment creates eerie shadows from which indefinable noises emerge all the more clearly in later part of the film. He has a landline to communicate with the outer world and like a puzzle rummaging in the streets for smoke breaks that doesn't look like one at first. And then there is this stranger who keeps calling him to his landline number. Vinod goes crazy because he thinks he is tapped or blackmailed. From then on, Vinod hears strange noises, voices and rumbling in his house. It brings him to the brink of a nervous breakdown. The strange occurrences lead him to believe that there is a psychological problem, and he is advised to fix an appointment with a psychiatrist. Having someone unknown call you and never being able to find them with this as the backdrop the film introduces more threads in the screenplay.What follows is a great mystery and I asked myself whether this topic of Darkness vs Light could fill an entire film. After all, the tension had to be maintained for nearly 3 Hrs and I think the film does that quite cleverly, but it takes some time to get going.On the other hand, the film convinces with a dense atmosphere and good camera work that shuttles back and forth between flashbacks during the narrative. Still, Andhaghaaram  is a very interesting film, which is not entirely conclusive and leaves few questions. It almost looks like a cinematic experiment in genre crossover. If you like horror films to be clear and unambiguous, you won't have much fun here. Anyone who loves suspense and supernatural horror will be in good hands in this film. Kudos to the entire team of Andhaghaaram for this indie gem."}, {"id": 83, "text": "Pros: * gripping narration * Very good cinematography and editing * Extreme care in technical aspects * Strong script, interesting storyCons: ~ seems slow at times(but its worth the wait)This movie reminded me of classic highly reputed hollywood movie Memento for the narration style. To take a simple story like this, and elevate the aspects by changing the screenplay, editing is really risky and the director deserves standing ovation for this.Although the Movie seems stretched, at the end, i dont feel like there is any unnecessary scene. Every scene has some vital role in bringing it closer to the climax(and trying to make sense of the ending).I am fascinated with this movie as lately its been extremely rare to find a movie on streaming services that can impress as much like the big movies. Also it doesn't try to include too much sounds and thrills to make it sound like a horror movie. I really appreciate the way they handled it.Please do watch it and enjoy! I would say it's a must watch for thrill seekers. :)Thanks."}, {"id": 84, "text": "AndhaghaaramTamil Supernatural Thriller FilmI can't believe that this film is made by a debutant Director the Screenplay and Direction of the film is so precise that even after the length of the film is near to 3hours you will not take your eyes of the screen for a single mintute Coming to performance all the leads have done a commendable job but the actor who played selvam is extraordinary he is so natural that you will feel like he is really blind The background music and the colour of the film is dark and justify the name of the film The story is bit complex and the twists are good the climax could have been better still better than most of them out there I will not reveal anything about the story but I will definitely say Bade dino baad ek acha supernatural thriller dekha huIf you haven't watched it its highly recommendedIts not available in hindi You have to watch it with subtitlesBut trust me this one worth itThank You"}, {"id": 85, "text": "A must watch supernatural thriller. A very well written &amp; twisted screenplay.Andhaghaaram is a slow burn type movie that goes from the beginning to end in a slow paced manner but keeps you gripped till the end because of the tight and complex screenplay from V. Vignarajan.The story follows Vinod, a depressed cricketer; Selvam, a blind librarian and Dr. Indran, a former psychiatrist. As the story continues to unravel the mystery, we are drawn into the dark and supernatural world that director has created.The performances of each and every character is mind blowing. Technically this thriller is a treat, it is strikingly different from the usual thriller effects and yet is as intense as it can get.Finally Andhagaaram is a unique film in this genre which makes it a must watch."}, {"id": 86, "text": "Andhaghaaram is a new attempt in Tamil cinema that brings hope to the genre's scope in the industry after a series of awful films. It doesn't provide much jump-scare moments but sets up a scary mood. I am not revealing much about the plot since it might become a spoiler. To be honest it is difficult talking about the basic plot without giving out a bit spoiler. Vinoth Kishan has given a fantastic performance but Arjun Das just steals all our attention. Other actors have done the role given to them perfectly. Technically the film is just spectacular. Edwin's clean cinematography, Pradeep Kumar's terrific music, and Sathyaraj Natarajan's sharp editing take the mood to another level. Some ordinary scenes are given an epic treatment which gives us an edge of the seat viewing experience. The plot structure is interesting and the immense attention given to details deserves applause. I wished the film was a bit shorter or some portion could have been trimmed off since the film is about 3 hours long and at the end of it the payoff became so simple and predictable. The ambiguity which steered the film this long could be guessed in the climax. A shorter treatment would have helped. But that doesn't mean the film gets boring. If you are fine with lengthy films which engulf you into its world then the length will never be a problem. But I felt the climax was short of creativity. Overall I wouldn't say Andhaghaaram is a must-watch but you can give it a try if you fan of a supernatural mystery genre. Don't expect any jumpscares. If you like experimenting with new kinds of films I'm sure Andhaghaaram won't disappoint you."}, {"id": 87, "text": "The genres like horror, fantasy, and supernatural looks illogical in many aspects of its growth rather than any other genres were cinema took the content, I had also felt such kind of repulsion from those subjects. Here Andhaghaaram also connects with the above-pointed idea. But what admire about the movie rather than its subject is the well-locked and handled way of making and detailing. I prefer this film (for the film buffs and novices) as a study material associated with how can be detailing works in a film? For a thriller subject detailing is essential especially in the case of the art property, costume, and even in make-up but how it must be managed is the biggest question that stood in front of us. The detailing of numbers, the braille scribblings, and even everything surround the film feels fresh and transparent. I'm talking about the art detailing of the movie. The construction of (Vinod's) room, the properties assembles there even the end portion of cigarettes have something more to tell in the storyline. Apart from detailing I must say the brilliant cinematography work especially the lighting. The plot is good in the sense of a horror film lover or comparing with other horrors/supernatural products but for me, the technical section deserves big applause more than that."}], "reviews_amount": 88}