{"name": "The Boys in the Band", "titleId": "tt10199914", "reviews": [{"id": 0, "text": "Love how this was shot and it was extremely emotional. Beautifully acted and I loved some of the directing choices and music choices. Respect to all the 'boys' they were all fantastic."}, {"id": 1, "text": "I read the screenplay which was published in book form decades ago-maybe in the mid-seventies-and recall finding it depressing.Just finished watching this new Netflix film and must comment on the terrific casting and production-the clothing and set design were as spot on as possible, but more importantly the acting was superb. Each character was distinct and believable. The setting was close and intimate, but not claustrophobic. In revisiting this drama decades after first reading the screenplay, I would describe it as sad, rather than depressing.Fortunately the LGBT community finds much more visibility and acceptance today. This production clearly depicts self-loathing, repression and invisibility felt by some in the sixties. A good period piece with some light moments, but still very sad."}, {"id": 2, "text": "I had seen this play on Broadway with this cast and it was amazing, good acting and very memorable. Was excited to hear it was to be a movie so was happy when it was finally released Loved the movie version, too. Jim Parson's acting was incredible and loved all the casts' chemistry, especially Parsons and Bomer. Will be watching this again Is there a way there could be a sequel?"}, {"id": 3, "text": "A bunch of queens together in 1968 is still the same as a bunch of queens together in 2020. Full of gin and regret."}, {"id": 4, "text": "There's a nothing quite like feeling sorry for yourself.Even with the stellar setup, The Boys in the Band misses a mark. I expected something but got a different story instead. The movie has an all-star cast with great performances, with the exception of two a little too over-the-top actors, and a story that should be a good time. What comes is strange tonal shifts and not enough emotion to care as much as we should. The experience of watching is fine but what follows is a mainly forgettable movie."}, {"id": 5, "text": "I really enjoyed this film. If I'm honest it was my most anticipated film for September and let me tell you it was worth the wait. The film is split in 2 let's say with the first hour of build up and character inductions and right on the hour mark the real events finally begin and I laughed so hard, Emory is by far my favourite character and Hank came a close second. I love that the film tackled a number of things like depression, discrimination and the horrible truth of what it was like to be gay in the late 1960's. Jim parsons gives an outstanding performance as he always comes through but the acting that stood out for me was Zachery's, his presence filled each scene he was in and he really played this character so well from the body language, emotion and dialogue. The drama and comedy blend in so well together. I will absolutely return to this film over and over again."}, {"id": 6, "text": "While the actors were all very convincing in their roles, and the art direction was satisfying, I still don't think I got the point of this film. So, regrets and arguments abound amongst a group of gay friends, how is this the fodder of film? Maybe I just don't get slice of life scripts. It kind of left me feeling empty."}, {"id": 7, "text": "The Boys in the Band, 1970, directed by the great William Friedkin and with a matchless cast is one of the greatest films ever made about gays. This version is an exact shot-by-shot remake with a less-talented director and a cast which, while doing their utmost, cannot match up to the original cast. My question is, just as with Gus van Sant's remake of Psycho, who on earth would watch a reproduction when the real thing is readily available? Do yourself a favor, go see the classic original not the copy."}, {"id": 8, "text": "I really looked forward to watching this so-named remake. Kudos for the production team trying to re-capture the pre-Stonewall atmosphere of the play. Unfortunately, the actors - and ultimately the director - are all victims of the current age where we gay men feel comfortable in our homosexual skins. There was not tension, no notion that the party as well as Michael's apartment was a space where the boys/girls could let their hair down due to oppressive mainstream attitudes about being gay. Furthermore, what was also lacking was - and I say this as a gay man who was in his prime during the 80s before the current LGBTQ openness was in full-swing - a sense of competition, where gay men were always trying to out-clever one another with swipes at their identities. In this age of Everyone needs to feel safe, gay men have abandoned - for better or worse - that self-deprecating attitude that united us back then. Yes - it's good that we don't embrace that attitude anymore - but it's deadly when you're trying to revive a gay play - in fact THE gay play - from the past/pre-Stonewall era."}, {"id": 9, "text": "A pure piece of art. I laughed, I cried and cried and cried some more. Love it!"}, {"id": 10, "text": "Why a shot for shot of the original film. I was hoping they would have filmed the stage production instead. At least it would be a different version."}, {"id": 11, "text": "This was disappointingly done. They might as well have positioned the cameras around the stage of a Broadway theater since it's like a made video of a stage play. The overacting by Jim Parsons is excruciating to watch, almost like Sheldon in The Big Bang Theory. That characterization fits that series, but just doesn't work here! I guess the writers wanted this to be true to the play hence the length of the movie. This theme might have been relevant 50 years ago but somehow has lost much of its impact."}, {"id": 12, "text": "Think of every cliche and negative characteristic gay men have and you have the characters in the film. It did not keep me entertained. I spent the last hour wondering how long was left until it was over! It's no from me"}, {"id": 13, "text": "I don't know what I expected, but this wasn't it. I mentally checked out less than half way through.There was nothing to draw you in and connect you to the characters early on. Such a shame as there are some amazing actors in this."}, {"id": 14, "text": "Well played! Great performances by the actors. Luckily we've come far from 1968 when it comes to LGBT rights and how we see gay people and how they see themselves. Or have we? It's a funny movie, but first and foremost It's sad and it makes you think."}, {"id": 15, "text": "Shockingly bad. Like a first time table reading. Zero chemistry . Friedkin not at the helm directing , actors seem lost. Im still puzzled as to why it was even remade. I gave it 2 stars because they used Herb Alpert's this Guy's in Love With You. This remake just lays there , all dressed up and no place to go. Oh Mary.. dont ask.."}, {"id": 16, "text": "This was a brave play at the time it was written. It is very much a mark of its time but the raging anger of the play just doesn't hold up anymore.The casting and all the rest of it are wonderful but the tone is now perfectly tired. The psychological deconstruction, the confrontation, the subtext, innuendo and contrivance has been done a jillion times since then and it's no longer that interesting.I sat through it and enjoyed it for the acting and set design, directing, etc. but it's now just doesn't work nearly as well."}, {"id": 17, "text": "I remember watching the original 1970 version of this movie. During and afterward, all I could think was, Wow, what a bunch of bitter self-hating group of friends. The '60s were a horrible time to be gay. When I heard they were doing a 2020 remake, I was curious to see if there would be a creative reimagining of the story, perhaps setting it in current times. Nope. Same '60s setting. Same unlikable group of people. I get that this is an authentic look at life for closeted gay men in the '60s. Perhaps it's the wrong movie for these times, given the hate spreading across America. I'm sure some viewers will relate to these characters, having lived through that period of history. I struggled to find anyone to like or sympathize with, just as in the original version. I turned it off less than halfway through. Why? Because, all I could think was, Why did they bother? It's the same as the original."}, {"id": 18, "text": "Overall, I really enjoyed this movie. Jim Parsons was great, however I think he over-acted the part a little bit. I did not see the original play so that may be a good thing or that may be a bad thing. All of the actors were good and the music was great the subject was great I just felt like I was watching a play rather than a movie where everything is just a little bit over-acted."}, {"id": 19, "text": "Must admit I saw Zachary, Jim, and Matt and just clicked play. I thoroughly enjoyed this movie. I'll cast it as a work of art. A beautiful piece. Well, worth the whole 2 hours,from start to finish. Hats off to Jim's performance. Loved it."}, {"id": 20, "text": "Oh Dear. As if the original film version of Matt Crowley's play wasn't torturous enough, along comes this completely humourless, over-acted production. I never got how this crap play ever became such an 'acclaimed' work, let alone got filmed. If your idea of entertainment is watching a bunch of self-loathing Queens tear each other apart, you've reached nirvana. This is tortuous stuff. Transparently showing it's stage origins, featuring the revival Broadway cast, the best thing about it is, unlike the play, you can leave at any time without a fuss. This film is so god-awfully boring it's a struggle to stay awake through it. At just over two hours long, you'll have plenty of time to ponder how the rest of your week will pan out. As a movie lover I can simply say this is one of the worst I've ever seen. As an out Gay man it's enough to make me want to crawl right back into the closet. It's just awful, on almost every level. I only regretted the Reverend Jim Jones didn't arrive before it ended with a round of drinks for everyone. But that really would have been overkill. The cast had already murdered the tired script."}, {"id": 21, "text": "The right actors were hired But the Director &amp; Producer failed miserably! All the resources and they didn't come close. This only makes me want to watch the Original for the noteworthy acting and great cinematography to regain the 2 hours I Lost!"}, {"id": 22, "text": "A tough watch, but compelling. Jim Parsons and the rest of the cast are brilliant."}, {"id": 23, "text": "I appreciate this is a play and was written in the 70's. But that doesn't mean it is in any way authentic to true life. The acting in this was terrible as was the script. I can see that in the 70's this would've been a tabo play. This just fell completely flat, I couldn't wait for it to end and considered turning it off about 10 times. Being a gay man myself I just find this is a terrible portrayal of gay men and how people actual behave. The notion that ANYONE would partake in such a weird/sick game as calling ex's is just absurd and no one would partake in real life as there was zero gain only loss involved. Just a terrible film that takes a huge back step in the LGBTQ movement."}, {"id": 24, "text": "Such a great movie with great acting. Each moment you are stuck to the wonderfully written script. The guys anger is strong and abrasive to each other due to difficulties in growing up in a closet.Do not miss it."}, {"id": 25, "text": "I haven't seen the original, but if the remake already feels dated - was it really necessary? Talk, talk, talk, along with unnecessary drama and simple plot is not enough to keep you interested. The casting and acting is great, 60s vibe and cinematography too, there was some interesting dialogue and shows struggles of some characters, but filled with cliches and predictable moments. Good if you're into talky movies, I like some of them too, but this one was below my expectations."}, {"id": 26, "text": "It was a little boring tbh. Some of the acting was quite cringe. I could have gone without watching it."}, {"id": 27, "text": "Great actors, especially Jim Parsons. I wish though that it should have been in present time. I know the original play is from 1968, but it felt a bit old. They could have modernised it, the theme is timeless and could have been today."}, {"id": 28, "text": "This film start with a man Harold smoking, and listening to music scene! As turnout, this film is about seven gay friends playing a game(telling the person you love with I Love You in the phone), while celebrating Harold's birthday! Entire film full of boring conversation, and annoying overuse scene! Such as, overuse of the drinking scene, overuse of the smoking scene, overuse of the singing scene, overuse of the flashbacks scene, and overuse of the mocking scene! Make the film unwatchable! Barely intense scene is, Alan beat up Emory! At the end, Alan tie the point with Larry in the Truth game! That's it! Another disappointed film!"}, {"id": 29, "text": "The Boys in the Band (1 out of 5 stars).The Boys in the Band is a terrible film about a group of gay friends who are stuck in an apartment. Celebrating a birthday while spending the whole evening drinking away and chanting about there issues and problems.I never saw the drama play. But probably do not have the interest too if it is like the movie. The story was boring. Did not go anywhere. The characters are boring. Just spending two hours of the movie drinking and chatting away there issues. It's nauseating boring.It does have a great cast ensemble but they are wasted away with there talent. The direction and script is dull and long."}, {"id": 30, "text": "School play quality vanity piece woth nothing new to say after William Friedkin's intimate film triumph.Set as a period piece the actors pretend they are the actors from the original film.Nothing visually daring, tepid performances that read like a high school performance of Our Town.See the 1970 original."}, {"id": 31, "text": "This film is so incredibly boring and not believable at all. Don't understand the high ratings at all. It is torture to sit through."}, {"id": 32, "text": "Watching Jim Parson doing such strong emotional acts made me wander in a world where we suppress our realities, our truths hidden beneath us. It's an wonderful movie along with a very good casting."}, {"id": 33, "text": "The only fault I had with the movie is the ending as it didn't find out what happened to all the characters, but I am assuming that how the play ends and so I am left to wonder ....."}, {"id": 34, "text": "I saw the first film made based on the play, and was very impressed by both acting and script. I went into watching this version with the hope that it would hold up to the original, and it certainly did. The acting is superb, and the dialogue is once again deeply affecting and illuminating. By the end of the film you are saying, thank heavens things have improved for gay men, and yet there are still so many things that still affect many in the gay community the same way even today. All in all, I am extremely pleased with this version of the story too. Two thumbs up."}, {"id": 35, "text": "This film feels like a missed opportunity. There was an opportunity to take the play and update it for a modern audience but instead it is a direct remake. A strong cast is wasted on cliches that were outdated even when the original film was released fifty years ago. The film offers nothing new while retaining all the worst elements of the original. Keeping offensive racial slurs in the film seems particularly odious. Overall a waste of time."}, {"id": 36, "text": "Sorry, the cast was almost perfect, with one exception. I thought Jim Parsons' effort was too much of Sheldon Cooper from Big Bang. I loved his Sheldon, but there was simply too much of it in Michael. The rest of the cast was great, but I think Jim should stick to comedy."}, {"id": 37, "text": "It is a beautiful psychological film, which puts the love of self and the love of those around us under the magnifying glass. If you are not able to like yourself and admit yourself as you are, you will not be able to receive love or transmit love to those around you. Hence the traumas, hysteria, frustrations, neuroses, the feeling of personal failure. It is a film with gay characters, which are masterfully played by actors who are gay in everyday life, but the message of the film is also valid for straight people. A film of great days, in which it is impossible not to be conquered by the very well articulated dialogues, by the created atmosphere, by the intense feelings transmitted as well as by the interpretation of the actors. I gave a 10 plus !!!"}, {"id": 38, "text": "'The Boys in the Band' does not disguise the theatrical origin of its history, strictly following the same structure as the play, but giving small additional touches to give a more cinematic air to the production. With its good direction, the sharp script, and strong cast, 'The Boys in the Band' is brilliant, complex, touching and, let's not forget, current."}, {"id": 39, "text": "Didn't have any wild expectations but still I wasn't impressed. The quirky queer dialogues are fun at first but they become tiring after a while. There is a feeling of a theatrical play which is to be expected. Not all characters are developed and some appear too shallow and unnecessarily mean like Jim Parsons. The story is almost non existent too."}, {"id": 40, "text": "The 1970 movie is a landmark in queer culture, made at a time when the world was not used to admitting gays were people. I didn't connect with the original movie (but still thought it was incredible), but really connected with this revival. Powerful performances, really got me with a couple of scenes. Highly recommend watching BOTH versions. Don't know why there are negative reviews. I guess some people don't know how to appreciate both a classic and a well executed revival/remake without a sense of betrayal."}, {"id": 41, "text": "I didn´t like the first 1980 film and I don´t like the remake. 40 years later, the message is the same. Gay men are full of self-loathing and cynicism, no matter if the story takes place in the 60´s or not. There is absolutely no reason to redo this film and I don´t care if the actors are gay or not. There was a lot of overacting, especially by Jim Parsons whom I´ve always seen doing miserable and very unappealing characters, so he doesn´t add anything to his credentials and neither do the others. At least Matt Bomer gave us eye candy in his nude shower scene but the rest of this film is forgettable."}, {"id": 42, "text": "First I have to say that the performance of Jim Parsons as the central figure of the play, Michael, would have been ok if he had not just played it with the same tone of voice and same mannerisms as his character on the Big Bang Theory. I could never separate his TBBT character Sheldon, from the context of the movie. Also don't see the purpose of doing a scene-by-scene remake of the original film, other than to possibly bring the film to the attention of newer generations ... but they really won't understand the nature of the drama of the play, not having lived through the very closeted 60s and 70s. Therefore, it really just appears to me to be a star vehicle, cash grab that will only be confusing to younger generations, who didn't live through the times of when the original play/movie were created. Perhaps a sequel would have been a better way to go, especially with the original playwright still alive at the time of the play revival and this subsequent film."}, {"id": 43, "text": "This is a really amazing, feel good movie. Love the soundtrack, the perfect selection of cast, they're all my favorites!! There are so many funny comebacks that kept me laughing. The the movie scripts are so good , I just love Ryan Murphy's work; bring more please!!!"}, {"id": 44, "text": "I looked at the cast and couldn't wait to see it. A half hour into it, I couldn't wait for it to be over! Where is the storyline, the anticipation of what comes next? The script was full! I have seen all these actors in previous work and wondered what they all were doing here. I suggest to pass on this film."}, {"id": 45, "text": "An amazing film that captures the aesthetic of the stage play. A dialogue driven masterpiece that keeps one riveted from the first Scene. Beautifully acted, beautifully shot and a joy to watch."}, {"id": 46, "text": "I would have loved to see this on stage, it's a clever concept, but think it lost some of it's lustre when transferred to screen. Jim Parsons was great but after his amazing job at Sheldon Cooper any future role will only disapoint the audience. Sadly what happened here and unfortunately detracts from such a strong cast."}, {"id": 47, "text": "It's simply an imitation - and not a particularly good one - of the 1970 film. Watch that instead."}, {"id": 48, "text": "This is a great movie, but worked better when gays were taught to hide themselves and were full of self-loathing. This is an interesting artifact of a bygone era, and this would not have likely been green-lit today, and that's not necessarily a bad thing."}, {"id": 49, "text": "Snarky, sarcastic, out and proud character study was groundbreaking in 1970 when the original film came out even if it wasn't the greatest script. But there was no reason to do it all over again and it's dated in the wrong way. Perhaps casting someone else instead of Jim Parsons may have helped slightly, but ultimately this appeals to a very narrow audience and feels like a bad broadway play...oh wait..."}, {"id": 50, "text": "Just I was thinking that this was kind of over acted and over wrought Cowboy shows up and then Zachary Quinto shows up in the middle of all hell breaking loose and I started laughing. It was so funny that I started caring about the characters and I relaxed. Honestly, it may not be the best version of a great play - but any version of this great play is a remedy for what ails me. I'm not going to say any more about it. I always find that Zachary Quinto is a revelation in practically anything he does -NOS4A2 included."}, {"id": 51, "text": "This did not need to be made.It may be NYC in the 60s but no where else. It presents a very narrow portrayal of a very narrow population. I found it vile, stereotypical and exaggerated. I also thought only Tuc Watkins was believable. A play like this may have been ground breaking in 1968. We have moved on thankfully"}, {"id": 52, "text": "It just seemed overly long and that everyone was trying to outdo everyone else in the acting joyful (hey they probably are?) department. Just seemed like a caricature of every gay person there is, and that all the actors were trying just a bit too hard. Was an exhausting watch, couldn't finish it."}, {"id": 53, "text": "Uninteresting silly characters, no story line , it was like watching the grass growth ,, Pretty low budget movie"}, {"id": 54, "text": "The Boys in the Band was an important cultural milestone in the history of the theater and film. This remake stays loyal to the original period but the cast of all openly gay actors create an interesting intensity and edge that I feel adds a new dimension to the original work. Like many films taken from plays there is not a lot physical action but the actors handle the dialogue beautifully creating a great and compelling intensity."}, {"id": 55, "text": "I've seen the original, broadway, and this. It's perfect. Period. No argument. The acting is perfect. I went into it wanting to criticize. The ONLY thing I would say, is that it should have ended when the play ended, with the last line. Still. Perfection."}, {"id": 56, "text": "What a brilliant film, great cast and script. Recommend watching, its deep and insightful into the gay community in the 60's. All cast members were brilliant, excellent idea of having all gay cast, made it more realistic."}, {"id": 57, "text": "A dramatic movie. LGBTQ It is about a birthday party for several (gay) boys where the host receives a heterosexual visit, but when his friends cannot contain themselves in their way of being, conflicts between them are unleashed. Everything happens in one night. He has great soliloquies. The game they play inside the party is very particular. A likeness of perfect strangers the telephone is the means of unleashing chaos. Quality. The time spectacularly recreated. It's about prejudices, about being yourself always, about self-love, about secret love, about the moments of the past that mark us, about being loved as is, about appearances, about good and bad friendships. It is also about the tough process of coming out of the closet. The script is spectacular and at all times the characters are well delineated. The performances are at the level. Light jokes and sarcasms. If you had to talk to someone to tell them that you love them, who would you call them?"}, {"id": 58, "text": "The Birdcage meets The Producers (with Nathan Lane)."}, {"id": 59, "text": "It's rly boring i was excivted at first but with time it gets boring"}, {"id": 60, "text": "The Boys in the Band was a so-so film to me,it had a good cast and solid potential but for my taste it had a little to much talking,i usually dont have problem with a same films if they had interesting themes and topics but this one had that in a very little dose.Cast was solid and they did a good job,only Persons was the main issue with me,i just can take him seriously and even when he acted angry and smoke cigarette he looked laughable,rest of actors were good but their characters werent also so interesting,story was also in some acts rather boring and not investing,The Boys in the Band was unfortunetly disposable film to me"}, {"id": 61, "text": "What a waste of time movie. 2 hours and for what. Nothing. It goes nowhere and has no ending. Utterly pointless."}, {"id": 62, "text": "An amazing movie, well written and intense. The cast acting is outstanding, Quinto in particular is a real gem. Jim Parsons, on the other hand, is the weak link. I really appreciate the effort of mr Parsons for the LGBT+ community, and I hope he will continue on his path, we really need people like him to make the change. I think the only role for now that suit him well is Sheldon on The Big Bang Theory, in every other movie or tv show I saw him, I felt discomfort for him. I wish he can realize, at the end, that screaming, shaking and be a drama queen is not acting. I hope the next time I will see him (and I really want to) will be after he took same real lessons of acting, maybe mr Quinto will help him."}, {"id": 63, "text": "I never saw the 1970 version, or at least I don't remember it much. But as a 61 year old gay man, there was something powerful about watching this cast of successful openly gay actors play these roles:; something that would have been unheard of way back when.The play itself does seem pretty dated, but I still recognized characters that I felt I knew. Except for Zachary Quinto's character, which I just didn't get. But the acting was phenomenal all around.Yes, the are gay stereotypes, but they're all based in reality."}, {"id": 64, "text": "I don't get the film. The characters are not likable. They just argue or provoke each other constantly. I find it irritating and not entertaining."}, {"id": 65, "text": "Mart Crowley wrote, produced and acted in Boys in the Band when it originally an Off-Broadway show, opening in April 1968. Not all of the 9 actors in the play were gay, 3 actors were actually straight but had the courage to play gay men in a decade when being gay was illegal. Now Decades after his play first put gay life on centre stage. In 2018 Boys in the Band was shown on Broadway and the production was cast with all openly gay actors and the cast was repeated for this film version, so it is again true that the entire main cast is openly gay. Mart Crowley joins the cast (made 2019) film for a cameo performance as a background actor in the bar scene. Sadly Mart Crowley died in March 2020 this year."}, {"id": 66, "text": "Was excited to hear they wore remaking this with modern cast thats where it stops. like a word for word rip off of the original, not one thing original i know with remakes are hit and miss,this is def a miss stick with original film at least that at the time was original, not this word for word rip off"}, {"id": 67, "text": "I anticipated this production for a long time. The actors were capable of great performances. Unfortunately as I watched the movie, I could not help but mentally comparing it to the original. That is what happens with remakes. The dialog is essentially the same. I did miss the lack of Anything Goes in the opening of the original. I can't say that the performances were bad, but they just were not up the quality of the original. There is, however, one exception. Zachary Quinto absolutely nailed the performance as Harold. He exhibited the intensity of the original character. For those who loved this 2020 movie, I would recommend that they also see the original. The biggest flaw was Robin de Jesus's performance of Emory. Cliff Gorman, who played Emory in the original, gave a stunning performance. Robin's might have been good, but was not nearly as clever. Unfortunately Gorman essentially gave up his career as he was type cast as gay. He was straight. Most of the actors in the original died of AIDS, a tragic outcome of those times."}, {"id": 68, "text": "For a straight guy .. I have got to say this is outstanding.. great cast ... everything fits perfectly... Dialogues are clean and plain.. I must say I loved every bit.."}, {"id": 69, "text": "the boys in the band is a really entertaining movie, the 2 hour runtime flies away thanks to a good cast, a perfect soundtrack and a well managed rhythm. The problem, apart from the dialogs sometimes redundant and the acting sometimes excessively theatrical, is the fact that in the end it's hard to find some solid meaning behind the fancy chaos that the movie build scene after scene and the viewers remain watching the end credits with more questions then answers"}, {"id": 70, "text": "An outstanding cast!But all I kept thinking about was the Burton &amp; Taylor Who's Afraid of Virginia Wolf.The roof top apartment was really kewl!"}, {"id": 71, "text": "I LOVE this play. I love the original 1970 William Friedkin movie. Despite all its negativity and self-hating angst, it ends with a powerful message (If only we could stop hating ourselves so very much). So many of may favorite quotable lines come from this play.That being said, I was very much looking forward to this production. I tried to get tickets to the revival in New York, but it was sadly sold out. With the glowing reviews and the high-powered, all-gay cast, I had hoped that this would be a revelatory opening of the play that would make it more relevant to today. Sadly, it was not.Many of the scenes, particularly the opening, seemed to be exact reshoots of the original movie (remember the Psycho remake?), adding nothing new, except maybe some minor changes (e.g. - Bernard now works in a library rather than a bookstore) that don't contribute to the story.The performances were OK. I suppose that if I had not seen the original, I might be more impressed (although my husband, who had not see it, was decidedly not impressed). Perhaps Robin de Jesus was the standout for me, lending an extra air of strength and dignity to the role of Emory. But the rest of the cast just seemed to lack something. Mostly it all felt rehearsed and precise, rather than natural. I didn't feel the kind of close-knit comradery that the original movie exuded.The two biggest disappointments for me were Jim Parsons and Zachary Quinto. Parsons seemed to play Michael as a nelly version of Sheldon Cooper. Not bitter and cynical, just depressed and resentful. His screaming confrontation of Alan seemed more of a temper tantrum than the vicious animalistic attack that made the original (for me) so pearl clutching. And the denouement, when the effects of his behavior dawn on him, lacked the fear and desperation, and replaced it with resignation.Quinto's performance was fine, but flat. It lacked the bite of Leonard Frey's bravura take on the role. Where Frey would seem to be delighting in the show being performed, it seemed, just for him, Quinto seemed to be just another spectator. When Quinto refused the first turn at the telephone game, it is with an air of revulsion, compared to Frey's more effective disdain.The rest of the supporting cast were basic, adequate and forgettable.The memory scenes - Bernard with his employer's son, Emory at the Prom - were unnecessary. They simply illustrated what was being said, as if the director felt the audience didn't have the imagination to see within the mind's eye.I could see this production working quite well on stage. I just wish the film could have given us more."}, {"id": 72, "text": "This movie is so stunning, and brave!!!!! Real life gay guy's portraying gay guy's. What an awesome concept."}, {"id": 73, "text": "Just watch. Well acted, fun, funny, sad. Loved it."}, {"id": 74, "text": "This movie for me in the first half was so hard to engage with i thought to give up and switch it off. I thought it was going completely over my head. In second half it comes alive and at least becomes more watchable. Overall its for watching, when if there is nothing else on or a sunday afternoon."}, {"id": 75, "text": "Fantastic adaptation of the play. Expect to laugh and cry. I found parts to be slow, hence the lower score but all brilliant performances."}, {"id": 76, "text": "I think it is always a million-dollar question about how to make make a great movie based on a play. Theatre plays and movies are totally different. While plays are focusing on using the scripts and words for showing the emotions, movies are different. This movie is not as entertaining as the actual play, also it might be a better idea to make some changes of the play to make it more a movie."}, {"id": 77, "text": "Nice try but no. The representation of gay guys as flamboyant birds is kind of old and has been done better elsewhere. I like the 12 angry men kind of confined atmosphere, though..."}, {"id": 78, "text": "It doesn't pack as much of a punch as the 90 minute play, but neither does the original film."}, {"id": 79, "text": "I like the original. This updated version is very, very good."}, {"id": 80, "text": "Amazing cast and acting, amazing script all this movie needed to be a 9 or 10 was music! A whole lot more music. I get they were trying emphasize the situation but... without music, a ply doesn't convey as well on moving pictures. Still liked it, but didn't love it."}, {"id": 81, "text": "Shockingly bad. Zero chemistry . Directing none, actors seem lost. Writer untalented. I'm still puzzled as to why it was even remade. I gave it 1 stars because there is no zero option. This remake just lays there , all gay-ed up and no place to go. Satan is smiling up at all his disciples. This one is right out of the landfill."}, {"id": 82, "text": "Exitited out of the movie, too much talking... I love Jim Parsons, I watched the movie cause of him, but even him couldn't save this movie for me."}, {"id": 83, "text": "A movie contained of 9 gay men but only 2 sex scene for under 10 seconds ?? I have expect more than that, at least it should have the threesome or the group one."}, {"id": 84, "text": "If it wasn't for the extremely classy and physically beautiful male nudity, I would've given it a 3. I understand it's a movie version of a 52 year old play. This just wasn't great to me. The acting was fairly good, but the content was melancholy. The end result is that gay me are all broken, have no dignity or self worth, and treat each other horribly. That, to me, is so stereotypical and only makes it easier for people to hate homosexuals."}, {"id": 85, "text": "All the acting, of every single player, is exceptional. The story is like intentionally poking yourself in the eye with a sharp stick. Dysfunction, personal pain, and mutual abuse on parade, it is the train wreck from which you can not avert your eyes.It's a Maury show, set to exceptionally good acting."}, {"id": 86, "text": "The boys in the band don't need a remake version cause it perfect itself, and this version don't have any change but add some hot scenes, which seem so useless cause the characters have no chemistry."}, {"id": 87, "text": "As I said, it's disgusting 🤢 There is no excuse for this film."}, {"id": 88, "text": "Such great talent and such a boring movie. Just a bunch of guys throwing attitude at each other. You couldn't make a feel good movie with all these wonderful gay actors? Why not a positive movie where gay guys look good. In the real world I wouldn't be friends with these guys."}, {"id": 89, "text": "Fantastic film. The Broadway cast of this award winning show reprising their roles is an absolute revelation. I won't give spoilers but a quick summary:A group of friends is gathering for a birthday party when an unexpected guest arrives and acts sets off a firestorm of emotion."}, {"id": 90, "text": "Although it has a very long duration, the performances of the cast are excellent."}, {"id": 91, "text": "As a young gay man coming out before Stonewall, I saw the original movie and was blown away with the intensity and truth in this film. It was a pivotal movie that showed me the self hate that we all had during that time, and how that hate manifested in our relationships with self and others. This revision of that film with a 2020 cast was every bit as powerful and poignant, with an excellent direction by Joe Mantelo. Thank God they did not try to modernize the film and kept the original 1968 time. Jim Parsons is just an amazing actor as is Zachary Quinto who captured Michal and Harold with intensity and focus. The whole cast was amazing.In some ways the play has a certain dated feel but that does not distract it enhances. The Gay men's community has been a work in progress and Mark Crowley wrote this decades before liberation, AIDS, gay marriage, wrote this when being gay was a crime. Thank God we don't have to embrace the self loathing we did back then. This still is a difficult film for me to watch, very confronting, but definitely a gem of a production.Awards are waiting I am certain!"}, {"id": 92, "text": "I'm sure some might find this film outdated, too depressing and pessimistic. But it must be taken into consideration that it depicts gay life and identity in 60s. If it had depicted them from a very 21st-century point of view, it would probably have betrayed the authenticity of the period. Here, the characters are trying to come to terms with their identity, to find their place in a society that mostly rejects and bashes them, and remain a closed group of friends despite their personal differences. It touches upon issues like beauty, aging, depression, self-rejection, self-hatred,relationships (romantic and friendly), religion, race as they all relate to gay identity. Nine characters all representing different aspects of gay identity, when brought together, present a comprehensive and multi-faceted understanding of being a gay man in the 60s. The acting is good and the roles really fit the actors playing them. (Matt Bomer is such an eye candy, I wanna see him more in movies!!!) The dialogue of often witty and sassy. I must admit that while the overall sassiness was quite fun for the first half of the movie, in the second half, where things get pretty serious and dramatic, it felt a bit cruel. I have also seen the 1970 Friedkin version. What new elements does the 2020 one offer? It has scenes ourside Michael's house. The film opens with little scenes depicting each of the characters in their lives and contributing to character development from the start. During the phone call game, the film also has flashback scenes, which make the past memories somewhat more concrete. It also has a few sexually explicit scenes. Other than that, the story and dialogue are pretty much the same. Lastly, we must not expect all queer stories to tell empowering, optimistic stories. Yes, this film is very dark and depressing, but it is just another prespective on life and individual experience. No queer character represents or talks on behalf of the whole queer community, nor do the characters in this film. They mostly manage to feel real within themselves, which is more important."}, {"id": 93, "text": "Funny, compelling, and emotionally resonant; The Boys In The Band shines and continues to inspire tons of viewers fifty years later.In this drama based on the award-winning play, a birthday party takes place in 1968 New York, when a surprise guest and a drunken game leave several gay friends reckoning with unspoken feelings and unknown secrets.An A+ cast lead by an incredible performance from Jim Parsons really puts the icing on the cake. Mart Crowley's screenplay is sharp, evocative and draws you in from the start. I'm a huge fan of films that take place in one setting and feature a killer script. The Boys In The Band is that film. There's no chance you'll want to steer away because you'll want to know what happens next. Even though set in the 60s, everything is still relevant today. It's an excellent look at gay men and the struggles they face daily. I really loved this film.Follow @snobmedia for all reviews!"}, {"id": 94, "text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog :)So, first and foremost, I didn't know a single thing about this film nor the play it's adapted from. As usual, I also didn't watch the trailer or any clip. Based purely on the cast and the synopsis, I actually expected a fun, lighthearted movie, where an important story about sexual orientation and homosexuality would definitely be developed. While I'm not entirely wrong on the last part, The Boys in the Band is far from being one of those Sunday afternoon's flicks people occasionally put on their TVs to entertain guests for a couple of hours.It possesses two distinct halves. The first contains one of the most captivating introductions to the characters and the overall narrative I've seen this year so far. From the very start, Mart Crowley and Ned Martel's screenplay is packed with interesting conversations, and every actor is able to elevate their script by being incredibly realistic and spontaneous. Each character has a clear personality, and their relationships are cleverly established. It's definitely one of the best films of the year regarding character development since every single one is explored beyond just one or two lines of characterization. Technically, the one-location set always pleases me, and it works beautifully in the context of the movie since it never deviates the focus from the characters and their personal stories.However, the second half couldn't take a more shocking turn. The once lighthearted tone drastically changes after Alan (Brian Hutchison) enters the party. An uneasy, uncomfortable atmosphere fills up the apartment, and it never leaves, not even after everything's over. It's an emotionally heavy, even tiresome story that takes every single character to their absolute limit. Secrets are revealed, omitted truths (those that everyone saves deep inside not to hurt their friends) come out, and alcohol plays a good part in all of this. Nevertheless, it's not really one of the film's central themes, even though there's a clear message regarding that subject as well.Homosexuality (how it was and still is treated by society) is undoubtedly the narrative's primary topic, but I believe sexual orientation to be the ultimate theme in The Boys in the Band. In fact, an even more general analysis concludes that the main message follows the accept who you are and don't be afraid or ashamed of what you enjoy guidelines. Consequently, it becomes a more accessible movie since it never feels like it's closing itself, excluding people outside of the target audience. Everyone can (and should) enjoy the film's thematic component since the debates that characters have with each other are extremely meaningful for today's society.The chaos that dominates the apartment feels surprisingly genuine and natural, creating a comparison with what occurs daily, everywhere in the whole wide world. The writers' treatment of homosexuality and sexual orientation is profound and really well-developed, exploring those phases that thousands of people go through: confidence, shame, uncertainty, acceptance, and so much more. Honestly, if someone feels uncomfortable while watching this movie, then someone must be wrong with that person. Yes, it deals with preconceived notions, sexual discrimination, and many other aspects related to this subject. However, in the end, it's not a film exclusively about homosexuality but about people accepting themselves for who they are without fear or shame.The cast and the characters they portray are what make The Boys in the Band such a great movie. I can't go into details about everyone, otherwise, this review will never end, but I do have to mention a few. Zachary Quinto (Harold) portrays Jim Parsons' (Michael) frenemy and his weird, philosophical, enigmatic interpretation as the birthday boy steals the spotlight on several occasions. Brian Hutchison is incredible as Alan, the ugly duck of the whole situation, whose sexual orientation is questioned throughout the entire film. Hutchison does a great job of never leaving the viewer clearly see through him. Everyone else is terrific, but I offer a final shoutout to the hilarious Robin de Jesús (Emory) and the always fantastic Matt Bomer (Donald).Jim Parsons delivers a performance that's on a whole other level, though. If he doesn't get awards buzz, I genuinely don't know what else an actor needs to do to achieve that. Just like the narrative's structure, Michael also has two distinct personalities, depending on the level of alcohol in his blood. When he's sober, Parsons shows that quirky side of him with his funny facial expressions. When he's drunk, he becomes verbally violent, aggressive to his friends, and a terrible host. He's the catalyst of the story, the engine of the whole movie. Without him, nothing happens. Parsons takes that responsibility and delivers a memorable performance, one of the very best 2020 has to offer.As mentioned before, Crowley and Martel's screenplay is exceptionally well-written, possessing tremendously entertaining dialogues. I don't think I've ever watched an adaptation of a play that actually convinced me to want to watch the latter. However, it's precisely due to The Boys in the Band being a play-to-cinema adaptation that I have the following issue. The moments where a live audience is supposed to clap or repeat a catchphrase are way too obvious, taking me out of the film on those occasions because I feel like something's missing or a character is forced to replace the nonexistent public.My other issue is related to Michael's game in the second half of the film. It pretty much occupies the last hour, and while it starts in an interesting, emotionally compelling manner, it gradually becomes monotonous and way too predictable. It becomes a tiresome cycle where everything that's supposed to happen, occurs without major surprises. Some unnecessary flashbacks also stretch the runtime, besides being the only moments where the viewer leaves the suspenseful, tense apartment, which I didn't really appreciate. In the end, two storylines are left open to interpretation, and I couldn't love these narrative decisions more. There's no right answer, only our own interpretations.All in all, The Boys in the Band is one of the best play-to-film adaptations I've seen in quite some time. It actually convinced me to see the original version if I could, which is a statement to how much it impacted me. Yes, it's a movie that focuses on homosexuality and sexual orientation. However, it never feels exclusive to LGTBQ+ viewers, much on the contrary. It transmits a general message of acceptance and self-worth, something everyone can connect with. Mart Crowley and Ned Martel deliver a screenplay that treats its themes in an astonishingly genuine, meaningful, natural way, creating a clear analogy with not only the 60s but also today's society. Every conversation is fascinating and engaging. Characters debate essential subject matters that everyone should listen to and learn from. Regarding character development, Joe Mantello's film explores its characters more than any other 2020's flick so far. Every actor incorporates his role perfectly, but Jim Parsons deserves a few awards for his emotionally powerful display. Occasionally, the adjustment of moments where a live audience would interact doesn't quite work. The second half's game becomes repetitive and predictable, extending the runtime for a tad too long (also due to unnecessary flashbacks). The two ambiguous storylines that end the movie are the cherry on top of a really good cake, which I definitely recommend to everyone to take a bite. You'll undoubtedly get something out of it.Rating: B+"}, {"id": 95, "text": "How amazing it is that this story is basically about What was it to be a Gay Man back in the 1968's and it is still relavant to us in Year 2020. Coz, this talks about much more than that!!Thank you Ryan Murphy!Best Part: 1. The Ensamble cast: Jim Parsons, Zachary Quinto, Matt Bomer, Andrew Rannells, Charlie Carvaer, Robin De Jesus, Brian Hutchison, Micheal B Washington, Tuc Watkins. All of them were fantastic.Everyone one got their respective shining moment in the film.2. Dialogues: They were funny, mean, metaphorical, dramatic and what not! This is a dialogue driven film, and the dialogues keep you engaging.3.Script, Screenplay and Narrative: The way you can see, how one hell of a funny-happy-dancing Birthday party gets turned into a Dark-dramtic-realistic aka one of the worst party ever....!!! This transition is amazing!4. Authenticity: The overall look, costumes, art design, cinematography, everything was perfect.5. Songs/Sound Tracks The songs during the film were so beautifully and smartly chosen and they just adds up to the flavor of overall narrative.I wish the ending was more powerful.... but overall it was a great film. I could write a thesis on it lolMy Fav Scenes: 1. When Larry (Played by Andrew) pours his heart out during the calling game.2. When Micheal (Played by Jim) brakes down in the end. 3. When Emory (Played by Robin) teaches everyone dance in the partySummary: A journey of Happy-Fun-Comic to Dark-Sob-Drama Birthday Party Ever 9/10"}, {"id": 96, "text": "I wanted to like this film. No, I lie. I was dying to LOVE this film. After all, I was only 6 when the original came out and saw it for the first time at 22 on VHS. It was a revelation to me -and hilarious - and a Debbie Downer because it made me realize I was an outcast. I've watched the original film at least once a year. I've bought it on VHS and on DVD. Then I heard that a cast of well knowns from my era (even if a bit younger) were a huge hit on Broadway with it and it was being made into a movie. Well, sign me up!I watched it the night it premiered! After all, it was going to be the really great actors (both Broadway and TV and film) performing roles they knew inside and out. It was going to be better than I could imagine.Imagine my disappointment. I waited. I did. I waited. I waited and waited for it to get better. It didn't. It was as flat as the lasagna.There was no energy. Oh, Matt Bomer was more than fine - in fact, he was a bit to handsome for the part of Donald, but he delivered a good performance, if not one with enough energy.Jim Parsons was a somnambulist, sleep walking through the most intricate of the characters - Michael. No energy in the first half and zippo in the last half - he really was not much more than Sheldon Cooper outed. Shrill.And Charlie Carver as Cowboy, well, he was far too innocent and no at all streetwise. No comparison to Robert LaTourneaux.No. I think the problem with this movie was timing...Don't get me wrong all the actors in the 2020 version had impeccable timing. It's just that a lot has happened in the 52 years since the play premiered. Stonewall had just happened back then. Now, it is taken for granted by most. Being gay was dangerous and illegal in 1968. Now it's largely legal as is gay marriage and consorting with other homosexuals is not dangerous nor a cause to be arrested.Being gay is mundane today. There's no excitement (unless you enjoy having your blood pressure go up watching a Trump rally). Hell, gay is just one of the letters in the acronym that defines us. And no one is merely gay any more. They are bisexual, gender fluid, Asexual, Polyamorous, etc. It's all quite tedious to me.But I suppose equal rights means equal boredom. Because none of these actors ever lived in the era (as adults) where same sex love was not only a sin but a crime, they just can't channel the internal emotion necessary to pass along the energy that the original does. And to give Friedkin and the editor of the original their due - the original feels more like a film than a filmed play.Good job guys, but I'll stick with the original."}, {"id": 97, "text": "I had never seen the original 1970 version and decided to watch both in one afternoon. The original is a classic, much better then I ever thought it could be, with excellent performances. I thought this would be an updating , but like the original, the dialogue , place and time, plot, actions ( NYC late 1960s) are very much the same although this has been edited down. Unlike the original , which was engrossing , this contains none of the spark and fire of the original, performances that are for the most part, not as well done and cuts some dialogue to throw in some flashbacks, including nudity ,that add nothing. Did they feel they needed to add brief full frontal nudity to appeal to a 2020 audience ? Jim Parsons does not give the outstanding performance in the lead that Kenneth Nelson did in the original. Even worse, how did so many of these characters , that came across as real people in the 1970 version become more flamboyant stereotypes in this updated version ?? Is this some type of progress ? I found nothing offensive about the 1970 version having grown up in NY at that time. This film in no way captured the time and the actors just came across as actors acting. Only Tuc Watkins and Brian Hutchinson were as good or better then their 1970 counterparts. If you have to see only one version , see the 1970. Some movies do not need to be remade."}, {"id": 98, "text": "As mediocre as it gets. Wow, they should have left well enough alone. Those who think this is good acting need to understand the difference between acting and mimicry. Jim Parsons barely transcends the character he plays in The Big Bang, including his vocal intonations. It sounds like Sheldon - and that's no compliment. He barely has any change in intonation or volume in the entire play.Enjoy it, especially if you're under 35, but don't confuse this with great acting or the reality of the original film, which was explosive when it came out. It's not a failure, it's just a scene reading...read the lines. Don't BE them, which is the essence of acting. As for those who deem it depressive, it was an accurate representation of the psyche of many gay men of the time: self-loathing. And there's still plenty of that these days, sadly. I'm listening to it, as I type, and even without seeing the expressions of the actors, it sounds bloodless, as in devoid of LIFE. Everyone except Quinto is a caricature of a real actor. Or even more, a real PERSON. This is nothing more than a rehearsal reading. They should have left well enough alone..."}, {"id": 99, "text": "I'm not into lgbtq+ stuff, i'm straight as a castrated cat, but viewing these kinds of films does weird things to me and the big question in the end, in a world of genderistic liberalism and a quick shift from gay to bi wont cost you a penny, is... why am i not gay???well that was an existential sigh from a grumpy old man, but there are some very good gay feature movies that everyone either lgbtq+ or not should see in a life time, the most teardripping is'' torch song triology'' and , yes , the boys in the band is a good succesor. its clearly a theater stage play that has been adopted into a feature lenght movie, by netflix and others. its a good , allthough a bit slow on plotspeed, film that happens in 1960's new york, where gay and lesbians where treated as criminals, and the lock on the closet had not been oiled for years, so to many a life as gay was and still is a well hidden secret. this film shows you the archtypes of typical gays as people usually thinks they are.its almost like the 7 deadly sins, each and everyone has their own segments, but they are all sinners according to the laws and religion in this era of history.its a 99% one location movie, it cant have cost alot to make, and the production do not share great extravaganza . but the caracters goes deep and youre feeling extremely sorry for everyone either you will or not. it has its funny moments too, and the comments and dialouges are good. and its enhanced by a cast of rather good looking male actors, that knows their proffesion very well.the choice of score are smitten by dark bourgeoistic cloaked jazzclubs environment, and its music every aging citizen will recognizethere are a lot that i would like to analyze and enhance in this review, but my limitation of birthlanguage do stop me from doing that in english, but one thing the grumpy old man thinks, its a recommend for sure..."}, {"id": 100, "text": "Perfectly cast and well acted film of a stagey stage-play. It's been opened out a little here and there, but since its claustrophobia is part of its power, I don't know that letting us out of the New York apartment in which it takes place is particularly helpful.The play has historical significance, in that author Mart Crowley aimed at and succeeded in capturing the self-loathing of a then despised part of the American population. It was particularly galling that the gay community of New York City was treated with contempt at the time, given the central role it played in much for which the city was admired and famous for throughout the world. Within a year of the first production, the worm turned at the Stonewall Inn. The Boys in the Band is what life was like in New York before Out and Proud became an option. Twenty years later, the wider population, led by the American government, turned its collective back on gay people to devastating effect, casting the community adrift to face the AIDS crisis. That period's chronicler was Larry Kramer. who died just a couple of months after Mart Crowley in this year of pandemic, 2020.So much for the historical gap. That between Crowley and Kramer as writers is largely one of dramatic self-restraint. Kramer had no talent for it, whereas Crowley seems trapped by it. THE NORMAL HEART is a prolonged howl of pain and anger, while THE BOYS IN THE BAND, its one moment of violence aside, is dedicated to sharp stiletto stabs. So many, that the overall trauma endured by this group of birthday party guests is submerged by slow-death melodrama.The playscript, then, its truths notwithstanding, is creaky. That was just as true when the film with the original, off-Broadway cast was made in 1970 as it is here, with its 50th anniversary revival cast. What we do get, because all these actors know these roles inside out, is a detail and depth in performance that most Hollywood films never achieve, because film actors get so little chance to rehearse. But look here at Matt Bomer, in the under-written part of Donald, listening to everything being said with the attention of someone who is really in the room. Same with Michael Benjamin Washington, who is nuanced and truthful in another of the less flashy roles. Which is not to undersell those whose lines do flash: Jim Parsons, Robin de Jesús, and Zachary Quinto are all excellent, as are Andrew Rannells, Tuc Watkins, Brian Hutchison and Charlie Carver. Joe Mantello, no mean actor himself, directs what was undoubtedly a first-rate theatre production, but as a film it primarily has historical value, just as had producer Ryan Murphy's parallel project of THE NORMAL HEART. Historical, but not irrelevant.I write this when to be gay in certain countries in the world carries the risk of a death sentence. In Poland, the rights of gay people are increasingly curtailed as the government finds it useful to find scapegoats. As is the case in Russia, too. I write this before the Supreme Court in the USA is likely to face a new direction. The battles may well have to start anew, and yesterday's historical document may need to become tomorrow's manifesto."}, {"id": 101, "text": "Mart Crowley met Natalie Wood on the set of Splendor in the Grass and they became friends. During the years when they worked together, he used his free time to write a play about the homophobia that gays internalized in the years before the Stonewall Uprising. With funds provided by Wood (a friend of Hollywood's gay community), Crowley debuted The Boys in the Band in 1968, taking the title from a line in the 1954 version of A Star Is Born. (full disclosure: I've never seen the play)The play got revived in 2018 for the 50th anniversary, marking the first time that it had played on Broadway. The cast included Jim Parsons, Zachary Quinto and Matt Bomer, with direction from Joe Mantello and produced by Ryan Murphy. And so now, they've brought it to Netflix. What a show! Everything about this movie is perfect. Obviously a lot of things have changed for the gay community since 1968, but it remains as important as ever to understand the self-hate that they had back then. Definitely see it.Since Jim Parsons co-stars with Zachary Quinto, I like to think that means that Sheldon Cooper has gotten to meet Mr. Spock."}, {"id": 102, "text": "Notice in advance: I had no clue about the content, and in contrary to the most reviews here, I would like to recommend The Boys In The Band highly !As I mentioned, I wasn´t aware about the story. I was wondering about the overacting of Kim Parsons and many other participans, actually I started to reject them, and also the plot...although there was no plot at all....but I have to confess:I was very wrong;-How much does an infinite spiral of failure affects the personality of a person. I guess there are a variaty things to count ...like getting cynical, but mostly a deep lack of empathy...Therefor ... would the characters be likeable on that very present time and space...the topic would be missed. The Pointe is, that everyone of them who came together to celebrate a friends birthday, unexpectedly had to reveal their pains from which their personalitys were formed. Despair and humiliation lead mostly to emptyness.For them, selfprotection means to reject opportunities...over and over again so that pain became a longlife - companion and we as the audience, we became witness when a very special lifechanging opportunity got rejected, due to incapability of words and trust. This stroryline wich started in the very beginning of the movie and ended with the last shot.It was very touchy at the end.. I was so much hoping that this very two lovers, Michael and Alan would come together. But however, pain and mistrust became alreadyto much friend for each of them.I really really liked this movie and the whole cast !!"}, {"id": 103, "text": "The Boys in the Band is a near-masterpiece, and it's all down to the phenomenal acting and incredible screenplay. The film contains some of the best dialogue of the year, highlighting the insecurities and buried truths of these characters.On that level, it really is a character study. Nothing extraordinary happens in the film, but I loved exploring past events of these characters and how they are reflecting back on them later in life.The Boys in the Band speaks to the audience on an emotional level, and explores themes of moving on, getting over a loved one, and how changing times can affect you. It was directed beautifully by Joe Mantello, keeping me on the edge of my seat just with the crisp dialogue.There were a few twists which I didn't see coming, and, aside from a couple of minor narrative and character inconsistencies, seeing all of these actors play off each other was fantastic.It might not sound like a film for you but I would strongly recommend watching The Boys in the Band, especially for the performances and the incredible screenplay. It's one of 2020's best films for sure.SCORE: 94%"}, {"id": 104, "text": "When The Boys in the Band arrived in 1968 it was a landmark play, but as a gay man it upset me. The characters represented all that I disliked about gay culture, the bitchiness, the backstabbing, the self-hatred. This was not what I wanted the rest of the world to see as an example of who we are. But maybe this was the only sort of play about gay life that could have made it into the mainstream and had an impact back then. So it was with very mixed feelings that I made myself watch this 2020 movie version of the classic play.Now, as a remembrance of a different time, that many gay people never experienced, one of repression and hiding, it feels like a revelation. And I can understand that Mart Crowley deserves his place as a pioneering hero. The many now-classic lines are delivered as though they are brand new. The performances, which could so easily be over-the-top, are spot on, just getting to the edge, but not going over it. And there is a line, which I had somehow forgotten, and which is delivered by one of the lesser characters, the birthday-present hustler, that took my breath away. In a making-of extra (well worth watching) Mart Crowley admits that he stole the words from a real-life rent boy he once met on Fire Island. And watch carefully Crowley's reaction when he tells the story; it is exactly what I felt when I heard it in the film.This is a time capsule of one aspect of gay life before Stonewall, before the many tragedies and deaths that would soon follow. It is a movie everyone who was involved should be proud of. I take my hat off to them all. And I am so glad I made myself watch something I was expecting to despise. Maybe 8 stars are not enough."}, {"id": 105, "text": "Show me a happy homosexual and I'll show you a dead corpse. It's the line at the end of the play, that summarizes what the story is really about: if you're okay with being gay, and you don't care what others think, prepare to die (keep in mind, it's 1968).When I saw the film in the 1970s (with the great Laurence Lunkinbill) I was too close to the subject matter to get it. Now, with objective distance it was clear. A bunch of guys, with wildly different coping mechanisms for being queer-- get together for a birthday celebration. Their differences clash (more catch fire) as they take great pains to disapprove of each other.At one end of the spectrum, you have those which loudly and blatantly resent society's demands that they stay in the closet (e.g. Emory, masterfully played by Robin de Jesus). The other extreme are those that believe survival means acting and looking as straight as possible (e.g., Hank, wonderfully played by Tuc Watkins who delivers the most authentic performance in the film). Though these two camps are quite opposite in how they cope, they share one thing in common: they accept being homosexual. Ah, but then there are those in the middle, such as Larry (Andre Rannells) that find themselves rejected by both camps (much like bi-racial people used to be treated). The guys that fall in the middle often hate themselves (e.g., Michael, played by veteran actor Jim Parsons) but usually prefer to be quiet and as invisible as possible (Donald, played by Matt Bomer). Then you have the guy who sits at the top of the heap, who is above the struggle, who gets it, but isn't any happier, Harold (played by an incredible Zachery Quinto).There are no role models, there's no Harvey Milk, no leader in 1960s gay America and as a result we have a hot mess. It's not an era older gays want to be reminded of, but what the hell, Joe Mantello reminds us of where we've come from. I'm glad things of changed. That was a messed-up era.My only disappointment from a film that was wonderfully directed by Joe Mantello (and superbly acted): it didn't really address the big flaw, namely story integrity. One watches these guys and can't help but wonder why people that can't stand each other are friends, and why some of them even remain at this party (today, half of them would have left). The answer is that they are simply stuck with each other. This sad situation could have been played more subtly, but Mantello pretty much directed the film of 1970, just different actors, leaving me with the question: why remake a film if you're not going to try something new?"}, {"id": 106, "text": "I just watched and it and ehhhh. I mean I liked it at first, but after awhile I was growing tired. I get its based on a play and so its going to be talkie but I was really starting to feel the length. And I get its supposed to be this deep intimiate piece where each character reveal something about themselves, some dark truths but like the majority of the characters were just not very likable and they were all mean to one another. Like, why are these people's friends besides the fact that they're probably the only people they can be themselves with. But maybe that's the point.Acting wise it was good. Jim Parsons does feel very Sheldon Cooper-y for a good chunk of the film, but I think definitely pulls some acting chops out there during the last 15-20 min.I didnt hate it. I just felt that once Harold showed up, it started feeling less natural. And by that I mean that they felt like real people but then started feeling like characters in a movie. Their dialogue too snappy or too poetic etc. I dont know if Im really explaining myself well."}, {"id": 107, "text": "I personally enjoy those movies whose characters are trapped with one another in one room... very Jean Paul Satre, where hell is other people, but so is friendship. Odi et amo. Hate and love. When you can no longer run from the people you love, you start wondering where love ends to make way for hate.I was under the impression that gay characters have to be on their best behavior in Hollywood. The best friend with out-of-the-box yet sensitive words of advice, the extravagant temper, always full of life, or the protagonist of an impossible, tear-jerking love story.Yet Netflix proves once more that it is oblivious to the norm. The Boys in the Band reveals exactly what Hollywood has been keeping quiet about: LGBT with complex feelings.So instead of a two-dimensional caricature, viewers get behind the closed doors of the closet, in the 70', when the truth of the heart was taboo and the victims of the norm got the chance to simulate freedom only at low-key, private parties.This movie is not holding back on anything just for the sake of keeping the audience comfortable. This movie reveals the LGBT members as humans, with their dreams, flaws, wounds, aspirations, desires, fantasies, lofty gestures out in the open. It's raw and it's spectacular."}, {"id": 108, "text": "Saw this production on Broadway 2018, and felt like i was in the theatre again watching this filmization, down to the last delicious nuance. After keeping me caged up for 18 yrs my father threw me out in the street for being degenerate, w/o a sou or any life experience. As such i naturally gravitated toward other older degenerates for the love and support my father never gave me. These degenerates were the very same men who attended Michael's party in 1968, in spirit, at least, and Stonewall or no, old habits die hard, this was the way they grew up and the manner in which they continued to behave long after Gay Liberation so I'm very comfortable in the milieu depicted here. One of my older protectors, Jack Doroshow, Mistress Flawless Sabrina in The Queen (1968) just died a couple years ago, and shortly before his death he related to me how disappointed he was how little we've actually come in all these years, Gay ghettos are still full of self-castrating fluffs who may not precede everything they say with Oh Mary anymore. but only the lingo's changed in the jabs and zings they spew at each other, and in the hinterlands it's don't ask don't tell unless they catch you and crucify you on a rail fence. Even in the companion Netflix documentary to this all the current cast members refer to themselves using the feminine pronoun she like it was cute. during a fairly substantial segment of the film. Whenever i meet a would-be hip heterosexual, as soon as they find out I'm gay they say Oh great! Don't you just LUV Rupaul? since all gay people are supposed to be experts on drag, or Oh, I get along great with gay people, i just LUV my hairdresser! since they look forward to the one obvious gay person they know humoring them, listening to their girl-talk for hours everytime they go to the salon. Gay stereotypes, like Jack, or Will, for that matter, on Will &amp; Grace have become cool, and as long as you don't dissuade them from the widely held conviction that every gay guy can't wait till 5 o'clock to take off the suit and tie and really relax in women's lingerie, they're blissful in their ignorance. If they find out you're just an otherwise boring person who happens to be attracted to members of your own sex,. they're puzzled, disappointed and uncomfortable.they can't pigeon-hole you, I love the 1936 comedy classic The Women about a clatch of cat-clawing, back-stabbing dames, and from the first time i saw it I was intrigued with the idea of doing a counterpart The Men about guys' underhandedly double-dealing each other, but then I realized they'd already remade it--no, not that hopeless 2008 remake of the original, the one i mean is called The Boys in the Band Alan--was he or wasn't he? That nest of vipers at Michael's party certainly didn't create a very congenial atmosphere for ANYONE to come out in, 1968 or 2020"}, {"id": 109, "text": "This is a fabulous movie deserving a high rating,Usually, when reviewing films the set decoration does not get the plaudits; however in this case Gene Serdena and others ought to share the applause as the excellent display of a 1960s New York apartment is superb as are the costumes as well.And whilst this picture is set in a different era, the issues raised are just as relevant now as then.A group of Gay friends is giving a birthday party for one of their own. The problems of a straight friend impact the celebration causing all of them to examine their lives and lifestyles. Issues including sexuality, bisexuality, gender, loyalty, discrimination, etc are all entertainingly scrutinized in a virtually non-stop display of cattiness and bitchiness.Now whilst many of the portrayals may seem to be over the top it is understandable to keep the audience engaged and enchanted.The star of the show is most certainly Zachary Quinto, though seems to me that Jim Parsons in the part he plays steals the show as the most flawed individual of the lot!Of course, all the performers are outstanding and with a super script and great direction, how can his movie fail?!Proud to be Gay!8/10"}, {"id": 110, "text": "Disclaimer! I have not seen the original nor the broadway play, this is my first introduction to the franchise. This isn't really important to my review, but I thought I'd just let you knowI really enjoyed this movie, but I had some problems with it. I think that the acting was fantastic and the characters were great too. Most of them had a fleshed out storyline with a good backstory to it. I also think the intense scenes came off that way and the awkward scenes did too, which was the point.However, I felt that it was very long. I just feel like one hour was spent introducing the whole story and building up while the second hour was what we all came here for. That was my major problem with it but I also found a lot of the scenes (especially in the first half) really boring. I understand we need to understand the characters and the story but whats the point in adding a bunch of boring scenes that have no impact on the story?Again, I thought that it was a good movie, but it had some kinks to work out here and there. If you are bored then you should watch it, but just beware you might (just might depending on what kind of things you like) be bored."}, {"id": 111, "text": "Its scary that a story that takes place almost 50 years ago and a Broadway play from around the same time, is still so relevant this day. if the setting would have been 2020 the story wouldn't have been much different except their drinking games would have happened with mobile phones. Its scary that within 50 years just a few things changed but the intolerance still is int his world. A powerful film that spreads a powerful message. its a great ensemble piece with many fantastic performances involved. First of all you have Jim Parsons who is getting a lot of juicy roles lately and this is one of them. I hope he keeps up with them, also outside of Ryan Murphy productions. He really is wonderful and gives a great and honest performance. Zachary Quinto was also good in a character you never knew if you like him or hate him. Matt Bomer had his moments in a tender performance but was a bit in a shadow. The great standout was in my opinion Robin de Jesus. At first you thought you had the most annoying stereotype on hand, but the way his character developed and the way de Jesus actually portrayed this transformation is pure acting and absolutely fascinating to see. An award worthy performance for sure. But all of the actors are great. The film had a great atmosphere, a wisely chosen soundtrack and great dialogue work."}, {"id": 112, "text": "I can only assume.... anyone rating this movie over 5...has NEVER seen the originalor rating high on well known actorsor friends and family of cast...I've seen the original so many times over the years.. I know everyone's lines without even thinking..The delivery from these well known actors was just painful.... Extremely hard to take this seriously... These actors very given A+ performances in other things.... but in this movie.... (If you can call it that) They get.... grade....F I need to watch the original again to get this bad taste of a remake out my head."}, {"id": 113, "text": "Never saw the original nor the two stage versions, so I really can't compare this version with the earlier works.That said, I loved this film. As a man who came of age in NYC in the 1980s -- the age of AIDS -- I could relate. Fifteen years later, the birthday party of 1968 could have been the same. A mix of love, friendship, self-loathing, repression, loathing and hope, albeit in the 80s deeply tinged with the horror of HIV/AIDS.In fact, I wondered throughout the film what would the future wold hold for these men as they moved past Stonewall, into the wild 70s and the increasingly dangerous, fraught 1980s and 90s. I really cared about the characters, even the unlikable ones.We're much better off today -- I guess. We're all suburbanized and sanitized, for popular consumption. And certainly a lot more emotionally healthy. But in some ways I miss the days when gays were, well, more gay, more edgy."}, {"id": 114, "text": "This movie is a revival of the Broadway play of the same name written by Mart Crowley who was a gay himself and through this play he depicted the life of closeted gays. All the seven protagonists have different point of view and issues regarding homosexuality. So the birthday party of Harold who is a sarcastic quick witted fellow takes place in Donald's house who is Michael's (the main catalyst must I say) friend. The conversation between friends seem nicey nicey and funny until Alan (Michael's friend) shows up and is visibly uncomfortable with men dancing around; his discomfort is noticed especially with Emory (an effeminate gay). Its not quite clear if Alan is a heterosexual guy and that interpretation is left to the audience. But Michael and Alan serve as catalysts to what's about to come. The last hour of the movie opens up about all of them individually when they have to make a phone call to someone whom they loved all their life.This movie is quite an eye opener and I cant imagine how people had to live by denying what they felt and having a perception that is always 'a man and a woman' and why confused heterosexuals find solace in men. Life in those times was sure ain't easy. This also throws a light on the so called society system of seeing homosexuality as a stigma and all the characters in this movie give their own opinion on it. I highly recommend this movie for everyone. Its not just a gay movie but its a movie which gives one an insight into a life of a closeted individual and you cant help feeling a touch of sympathy when you actually imagine that this is what was the sick reality back then.!All the 7 actors have done a fantastic job; singling out anyone's performance would be a mortal crime."}, {"id": 115, "text": "GRADE: B+THIS FILM IS HIGHLY RECOMMENDED.IN BRIEF: An excellent retelling of a classic LGBTQ story with fine acting and strong direction.JIM'S REVIEW: Mart Crowley's iconic story, The Boys in the Band, is an excellent film once more, a period piece for another LGBTQ generation to experience.This latest film adaptation reprises all of the actors from the recent limited Broadway revival and opens up the play with cinematic flair. Directed with skill by Joe Mantello, who also directed that 2019 Tony-winning version, we are invited to a birthday party for Harold (Zachary Quinto) that is parts clever and bitchy and parts Who's Afraid of Virginia Woolf, gay-style.Welcome to the party! Michael (Jim Parsons) is hosting a surprise celebration in his upper East Side apartment in NYC and has invited Donald (Matt Bomer), Michael's current boyfriend, Bernard (Michael Benjamin Washington), a Black gay librarian, Hank (Tuc Watkins) and Larry (Andrew Rannells), a couple at war in an open relationship, and effeminate campy Emory (Robin de Jesús). Adding to the Maryment (pardon the pun) are two unexpected visitors: Cowboy (Charlie Carver) a dense hustler and one of Harold's present and Michael's straight college friend, Alan (Brian Hutchinson), Of course, events suddenly go off-kilter.Just as the stage version's and film's first act is riotously funny with the mix of odd coupling and sexual innuendoes being tossed about freely, the second act turns sour and becomes pure emotional drama as things turn nasty with sadistic party games being played and lives being destroyed. The film loses its resolve a bit and dissolves into melodramatic excesses that tend to slightly weaken the impact of the tale. But one can sympathize with these men and their tribulations.Most of Mr. Mantello's directorial touches in this updated version work most efficiently and Adiaan van Zyl's editing hones in on the subtle glances and interactions of the partygoers. The director opens up the play and often moves the characters out of the one room set and into the real world. This most powerful plot device is the film's new denouncement where he shows the aftermath of the party and the individual characters' movements and future. He and the screenwriting team of Mr. Crowley and Ned Martel are less effective in adding flashback sequences that somewhat undercut the accumulated tension at the party.The cast in the original 1970 film, directed by William Friedkin, brought a raw authenticity to the film due to their lack of name recognition. plus the film being a product of those homophobic times. Both ensembles are unilaterally superb (and if you can, watch the earlier film as well). But, in all fairness to the rest of the newer band members, Mr. Parsons, Mr. de Jesus and Mr. Quinto, simply have the best written roles in the whole show. The two former aforementioned actors are as strong as they were on stage. But it is Mr. Quinto who is a revelation. in this movie He has enhanced his part with his nuanced acting as Harold as he spews the character's venomous zingers with razor-sharp accuracy while bringing more depth to this hardened lost soul.The Boys in the Band has always been and will always be an historic gay Declaration of Independence for the LGBTQ community. This 2020 version reaffirms its value and sense of worth. One of the year's best."}, {"id": 116, "text": "Back in 1968, playwright Matt Crowley shocked the world by penning a stage production solely comprised of gay men and their repressed feelings. The spiteful language and harsh authentic look at gay life were too much for polite society at the time. The production played off-Broadway for a few years before closing in 1970. Right before he directed The French Connection and The Exorcist, William Friedkin gave the play new life by adapting it for the screen the same year it closed.Finally, in 2018, the play was given its proper due with a Broadway revival directed by Joe Mantello and starring an all out-gay cast, most notably Jim Parsons (Sheldon Cooper in The Big Bang Theory), Zachary Quinto (Spock from the modern Star Trek franchise), and Matt Bomer. Now in 2020, history has repeated itself as Mantello and co. have regrouped for another screen adaptation, this time for producer Ryan Murphy at Netflix.The Boys in the Band opens in 1968 New York. Seven gay friends are soon to be gathered for the birthday of one of their own. We get to know each of them over the first half-hour as they prepare for the party.The host, Michael, is a so-so writer with a drinking and money problem that he can't let go of. Michael's good friend (and old flame) Donald comes into town hot off a session with his analyst that made him confront the shame he feels as a gay man. Larry is the group flirt as he refuses to be wholly committed to one man, which often puts him at odds with his lover Hank, who recently left his wife for Larry. Then there's Emery, the comedic relief of the group who isn't afraid to show off who he is. There's also Bernard, the only black member of the group who's still wrestling with both his racial and sexual identity. Finally, the birthday boy himself is Harold, a Jew who always arrives late and knows exactly what to say to get under someone's skin.But wait, there's one more guest at this little shindig. Michael's old college roommate, Alan, is in town under mysterious circumstances and must see him right away. Michael isn't 100% out of the closet to Alan, mostly because Alan is as straight as an arrow and about as open-minded as the rest of 1960s America.The party kicks off great as the friends reminisce on old times. These are the moments when the acting troupe shines, especially Robin de Jesus as Emery and Parsons as Michael. Crowley's original dialogue is lifted right from the stage to the screen with pure elegance. The one-liners and zingers, which are often playfully vulgar, are still eye-opening fifty years later. It's both happy and sad to see this material continue to be relevant after so many decades.However, things get icy when Alan shows up. Harold hasn't arrived and everyone still has their social masks on. Alan doesn't fully comprehend what he has barged in on as Michael tries to quell the flamboyancy.Director Mantello grinds everything to a halt once Alan walks through the door. Almost as if this was a horror movie, a deep feeling of suspenseful dread fills the atmosphere. Like all good suspense, a needle eventually drops and things quickly get messy. The language turns from sarcastic to hateful as old secrets and dark truths bubble up to the surface after years of being buried.Parsons still takes the cake with his exceptional lead performance. Harold remarks that when Michael drinks he's lethal. Parsons is indeed lethal once things get serious as he ditches his sitcom roots and delivers a much more bullying persona.Quinto is also great as Harold. Usually sitting in the corner with his humongous tinted sunglasses, he delivers line after line with stinging fervor.The Boys in the Band can feel a bit too stagy at times, which is to be expected. Long speeches and heartfelt moments that work well on the stage sometimes come off as schmaltzy on the screen. But Mantello does incredible work despite only directing one other film in 1997. His excellent blocking of the apartment setting is second to none as it allows for swift camera movements that capture every moment.Cinematographer Bill Pope does well to preserve that same stage energy with numerous long takes and great lighting of the wonderful set by production designer Judy Becker.The Boys in the Band is an astounding stage to screen adaptation that remains relevant in its messaging and entertaining in its story. The cast is top-notch and Joe Mantello proves he still has the directing chops. Unfortunately, Matt Crowley died from a heart attack in March before the film was finished. Despite being gone from this physical world, he still lives on within this excellent production."}, {"id": 117, "text": "Much has been made of the fact that this one of the few times in American cinema that an ensemble gay cast has been the entire subject of a movie - and whist that is a good thing, the film isn't. Jim Parsons is birthday boy Michael, who invites a few of his friends to his apartment for a few drinks. What follows is your typical bitchy, angry, collection of queers with secrets whose characterisations reflect just about every stereotype imaginable from the gamut of camp, closet, alcoholic - you name it. Except, possibly, for Matt Bomer (Donald) they all come across as rather self-obsessed, odious individuals with little to redeem them - and when they alight on the party game from hell which involves ringing up men with whom they have had (or do have) a relationship to admit there love or to apologise for being a twat at some previous stage in their lives; the whole thing descends into a mire of booze-driven self pity and viciousness that appears entirely for effect and for little beneficial purpose. It has a very theatrical (largely single scene) production style to it, which certainly aids with the intensity and both Parsons and Andrew Rannells (Larry) play their roles well, but Zachary Quinto (Harold) just came across as a poor Elliott Gould and the others seemed there to make up the numbers. The 1970 version had much more to it - perhaps a less starry cast helped it cut through, but for a man exposed to the delights (and disasters) of European gay cinema for the last forty years, this is just a dull, dreary, effort trading on what it might/should have been, rather than what it is."}, {"id": 118, "text": "The Boys in the Band a current Netflix film based on a 1968 Broadway hit play which is adapted now by mega producer and director Ryan Murphy sheds light perfect on the times of the late 60's and how it was to cope with being in the closet. I say the movie is an emotional connection and some may find the film just a gathering and party of drinking, singing, and dancing of a group of gay guys. Yet while watching you discover more as it show emotions and connection proving it's okay to be honest come out and be truthful as feelings are abound and it really proves that's what friends are for! The story is pretty simple a group of gay guys gather at a duplex to celebrate the birthday of a pal, and along the way this safe space leads to coming out honestly about love while being who they are and the movie is a reflection of how they deal with society. The cast is all pro and all star as their chemistry works it was nice to see Jim Parsons, Matt Bomer, Zachary Quinto, and the others involved gave good supporting performances. This matter may not be everyone's cup of tea still viewers can relate to friendship and connection as the movie gives off plenty of it."}], "reviews_amount": 119}