{"name": "Rogue City", "titleId": "tt10127684", "reviews": [{"id": 0, "text": "A French police drama where all the cops seems to be corrupt, weaving a complicated web of double crosses, macho posturing and the odd action scene. The plot holds your interest, moving along at a good pace and although the ending's a bit odd, it fits in with the overall theme. Good acting and setting, but apart from the opening, is lacking in truly memorable characters or scenes."}, {"id": 1, "text": "The good: beautiful cinematography, dark, gritty atmosphere contrasted with the sunny seaside environment. Gory, hardcore action scenes.The bad: almost all characters are übermacho middle-aged men in dark clothing and no personality whatsoever. For me it made it impossible to follow the plot. At no point of the movie had I any idea who is who, who is shooting at whom and why, and generally what is happening. On the plus side at least I can't give you a spoiler.The balance: if you are exceptionally good at keeping 30 French men's names in mind and linking them to nearly identical characters then maybe you will have a better time than I did. Otherwise don't bother."}, {"id": 2, "text": "Ya see what I did there? 😜 The cinematography and special effects for the gore scenes were excellent. The directing was decent as was the cast performances, but I felt some actors were missing that oomf factor, and felt like they were there only for the paycheck. The action wasn't really anything to get excited about and felt bland. It certainly needed much more of it. The pacing was quite slow so the 116 min runtime felt like almost 3 hours. There were many plot and technical issues, and the story somewhat convoluted and seemed to be put together in a rush. Nevertheless, it was an entertaining film, but I feel it missed the mark to be a great one. So it's a 7 /10 from me"}, {"id": 3, "text": "A very French cops and gangsters film set in Marseille. Nearly everyone's having an affair, smokes, drinks too much, turns a blind eye, breaks the rules, is corrupt or a corruptor. Well framed with some excellent shoot outs, some clever twists to keep you guessing, and a finale that I certainly didn't see coming. I almost hit the stop button as a twee French acoustic love song came on, a que for the end credits. It wasn't, don't stop, keep watching. Recommended but not an award winner, a solid 7."}, {"id": 4, "text": "This would definitely be a decent movie if you are French. However, if you are English, there are far too many names to keep up with the aide of subtitles. Acting is bang average, characters are not connectable and how can every cop be bent?"}, {"id": 5, "text": "You watched the trailer and got hooked? Well it's disappointing and boring! The plot is just in chaos but it's good for a french movie."}, {"id": 6, "text": "A fun crazed French action cop gang movie where everyone is dirty and looks like they're in a really cool French sunglasses ad featuring tough cops and gangsters. The script and plot are about as to be expected from a sunglasses ad. 😅"}, {"id": 7, "text": "And you have to go to french cinema to find such caracteristiques from the grumpy old man.its a dead on target film about strains of south french mafia, very corrupt police at all levels, and a twist at the end that i didnt forsee to come. there are extreme shootouts, tons of blood in an extremely complicated plot that only socalled genials can commit and produce, and the action does never stop and you havent got a clue who to trust.its a harsh and extremely realisticly made film that wont fit everyone, and just say that if youre a corrupt civil servant or if suicide lingers in your depressed mind, then take a break and skip this.for the rest, eat this frog of supercriminal filmaction, its not a ten ,though a very strong 8"}, {"id": 8, "text": "Despite a mistake every 5 minutes in law enforcement procedures its an entertaining movie. Just don't expect it to be realistic, apart from the non existent communication between police departments. I agree the end is very unimaginative and not at all plausible. They missed an opportunity here and it's a common thing in European movies, they don't have advisors on law enforcement procedures. A simple police officer can give you mistakes in procedures after 5 minutes in the movie that would change the entire plot... examples: the weapons and bulletproof vest would definitely be found in the bar, when 9 people get shot they would investigate every little piece so impossible to not find those. The police officer shooting the arrested criminal is not tested on gun powder residue and he would definitely be arrested after ballistic testing and bullet direction impact... it shows the angle and distance so it would be clear the criminal was sitting down and not fighting. Watch it when you need a no brained movie to pass time."}, {"id": 9, "text": "Disappointing. Poor writing damages this film, story full of ridiculous, improbable or convenient situations. The nembers of the police unit are like walking cliches, dialogue is at the level of cheap police TV series."}, {"id": 10, "text": "The first hour is pretty decent. But after that it starts getting worse. Some ridiculous moments lead tot an impossible ending.I guess the judicial system is quiet in France. Cops handle everything themselves, doe better or worse."}, {"id": 11, "text": "This film is very good. The locations and cinematography are superb. The action scenes are QUALITY! It's a bloody brutal film, though. It is a top-notch, solid action movie that has had a very high production budget. Very stylish and entertaining. Kaaris looks awesome in this."}, {"id": 12, "text": "If you agree with the wildly violent and corrupt premise of the movie....you can enjoy it. Nevertheless, what a stupid, ilogical and nonsensical endinhng. What a waste of time. Don't watch it!"}, {"id": 13, "text": "It's just another exercise of a European film that each scenario and situation is not believable. For example: Taking a prisoner to his wife's hospital bed before transferring him to high security upon prisoner's request. Then the transport leader is seen with a long tear in his eye whwn he hears their shallow 2 sentence conversation. Weak....It's just an attempt at being a cool gangster and corrupt cops movie but with an underdeveloped plot. Situations that don't make sense. Etc etc. It's a waste of time."}, {"id": 14, "text": "Just dark movie. Everyone is crooked one way or another. A lot of random characters with no background, all just to make it more dark and artsy' I guess. And the ending is just plain stupid. A random dude that you only see in a few scenes is kinda important? I regret loosing time on this one."}, {"id": 15, "text": "Cops look like thugs-thugs look like cops- Everybody lives in huge, expansive villas-the cops have beautiful catamaran-boats. You don't really understand who is who-and everybody is corrupt, confesses or invents intrigues, steals money, shoots, kills or gets killed. You shouldn't make a movie about a wilde horde of cowboys playing cops in Marseilles."}, {"id": 16, "text": "Waste of time due to the worst ending ever.Just dont."}, {"id": 17, "text": "An elite police squad, try to play on both sides of the fence between law enforcement and corruption, then they make a mistake that causes a shake up on both worlds they navigate, the film focus on their leader of the squad, trying to make the situation go away the best he can, decent character development with the time frame of the movie , the action sequences were well put together , the tension build up was also well done, I enjoyed the film especially because of the Director, I've been a fan of his previous police thrillers and with his experience as being a former cop, he understands his material very well, overall good crime thriller, pay close attention to the conclusion, it was unexpected."}, {"id": 18, "text": "It will surprise you and entertain you. Unless of course, you are spending your time caught up with the gender identity debat, go watch Brokeback Mountain or something. This is a man's movie. Hell. Even my mom in law enjoys it, that's right, this movie is so good you can put it on when your wife's mom is visiting. Watch it."}, {"id": 19, "text": "A huge miss by Olivier Marchal So weak that it makes you laugh Clichés, clichés.... Poor script, poor acting, (very) poor dialogs. Directing not too bad thought... A lot to be learned from this movie Hope that Marchal will be back at his true par one day..."}, {"id": 20, "text": "Seems like a simple story to tell, just corrupt cops and criminals getting along in France. Not much else, just lots of over the top plot scenes to try and drive the story along which don't make a whole lot of sense. Action is ok, but not enough to recommend this movie."}, {"id": 21, "text": "Could have been good but the story isn't great with the worst ending ever"}, {"id": 22, "text": "What a mess, who's villain, who's good? Well, all are bad, no distinction between cops and baddies, all corrupt, at least morally, and in the end all die. It's not easy to follow the plot, is there actually one? The reason for this carnage is subdued in the sea of sex, drugs and murder."}, {"id": 23, "text": "I agree with another review that Jean Reno didn't really perform well in his role. He was the reason that I watched it but he was very shallow in this movie. Nonetheless, a solid crime thriller with a pretty complex plot for a typical gangsta cop shoot out. The ending was a bit predictable though everyone says they didn't see it coming... c'mon now, I was like happy ending? Really? There we go... that makes more sense."}, {"id": 24, "text": "A drama with hints of French action. It is about some policemen who are involved in a shooting of gangsters. Do you remember the game of the scrambled basket? Well, this movie is like this: gangsters against gangsters, gangsters against policemen, policemen against gangsters, again gangsters against gangsters, then policemen against policemen and gangsters with policemen against other gangsters and other policemen. A movie to see carefully detail by detail, so that you understand. Entertaining, although it takes a while to start, bear with it. Quality. Some unnecessary nudity and some cruel, as well as some murder. Good action scenes, and good effects although two or three moments are not completely achieved. The only problem is that it doesn't really develop the characters to a large extent, it goes more into situations and in some shootings the moment is ruined by putting a soundtrack on it. The ending is flawless and realistic. Talk about corruption and the power mafia. Nice Sunday."}, {"id": 25, "text": "The trailer got me hook, line and sinker. Sad thing: The short trailer was better than the entire film!"}, {"id": 26, "text": "This movie is an insult for every gangster, cop and the viewer's intelligence. It should be categorized as comedy science fiction."}, {"id": 27, "text": "I'm learning french and have been trying to watch as many French TV shows as I can. I don't necessarily need anything excellent or really good or even just plain ok but is there a single French TV series that is better than dire, such as this one is? What is it about the French that allows them to continue to produce such utter rubbish?"}, {"id": 28, "text": "Nihilistic, cliched drivel with spaghetti western dubbing. Storyline was thin and I expected at least one of the characters to beat his chest and shout 'ugg' at any time. The police chief's daughter had all the emotional output of a brick. One character - Will, was more guilty of dreadful / overacting than anything criminal and, as for the ending, which was entirely idiotic, it should've happened much earlier - like five minutes after the start. One of those 'we won't get that time back' movies."}, {"id": 29, "text": "I have not seen a wonderful and interesting movie like this for a long time. The film brings us back to the action that is real and realistic, the film is very good I recommend watching it,but for adults only, it contains very violent viewing"}, {"id": 30, "text": "Worst action movie i ever saw. Weak scenes, wrong dialogues.. How can u make a battle between police and gangs with lowest brightness? You expected to wear a night vision googgles? Just incredible.. 2020's things..."}, {"id": 31, "text": "Will Netflix please find someone else to do the English dubbing for its European productions? The voices are unbearable! Why would they knowingly ruin movies and series on something of relatively low cost. Please look for American or British actors who at least can come close to the way the language is spoken. And while they're at it, find a new company for the English sub titles."}, {"id": 32, "text": "Bad movie for sure. Editing is terrible. Some scenes you don't know who is who. You can't know anyone's name. So movie is not watchable as lots of reviewers said. And no normal cops Means no order. Everybody killing everybody and nothing happens to them. Not realistic at all.But action scenes are beyond awesome. I've never seen that good and realistic action scenes before. Very very well done."}, {"id": 33, "text": "Cinematography and special effects were excellent but acting was poor :-("}, {"id": 34, "text": "This complicated mess has no redeeming characters, villains or plot other than let's kill everybody! The voiceovers were good. And the only recognizable face from a stateside point of view was Jean Reno in a French film speaking French that had to be translated into English. This belongs exactly where it debuted: on Netflix."}, {"id": 35, "text": "Messed up story but active n real noir action.All bad people involving with messed up lies is going to death.not bad n not good enoughbut realism action is attractive."}, {"id": 36, "text": "Wow! An extremely violent movie, so get ready. It has so many twists and parallel storylines it may be a bit hard to add them together, but still possible if you recall on the names, many characters in the movie, very well made and the acting is amazing by all actors. This kind of movie can only be French, a gem imo."}, {"id": 37, "text": "IMHO the only really good gangster films are American. Occasionally the South Koreans put out a good film, ands the British are best at funny cop films, but usually can't b e taken seriously, with some exceptions. The French are really poor at this type of film, but given what they usually produce, this is a pretty good one. Don't be fooled by the fact that Jean Reno is in it. This is probably the worst acting job he's ever done."}, {"id": 38, "text": "Solid polar action movie made in France. A lot of french famous polar actors (Moussa Maaskri, Herard Lanvin and mister Jean Reno himself) and a great movie end"}, {"id": 39, "text": "The movie has action at the last 20 min! Before that nothing special! Not bad idea to watch it but dont expect much guys! See you :)"}, {"id": 40, "text": "This is a very harsh story, told brutally. The action is almsot relentless. The plot is complex but feels realistic. The acting is excellent except for Jean Reno who can't play anymore as it seems. A solid 9. Recommended."}, {"id": 41, "text": "The movie starts dramatically. The pace of the movie is good that it gives us the feeling of reality and not like the artificial action packed Hollywood movies.The movie shows the depth of corruption in the police force and that we are living in a hopeless world. Just before the end of the movie, the great guitar music and I though things ended up quite positively and everyone lived happily ever after and BANG! changes the plot and everyone is dead. That was unexpected. The movie is overall excellent."}, {"id": 42, "text": "Minus the last two minutes of this film which are plain stupid given they show FBI agents on a killing spree which is like impossible and motiveless, definitely worth a watch. They should've ended more meaningfully"}, {"id": 43, "text": "10/30/2020 With a cast of really great actors/actresses especially Jean Reno and Gérard Lanvin I would have thought that this movie would have been super. It wasn't. What it was, was a really hard to follow storyline filled with criminals and criminal cops all meshed together, only to see who would come out on top or still alive? For my part, it was less than exciting, filled with to much time filler unnecessary/side track dialog and sub stories. It could have been great but ended up being a mediocre movie. Again, hard to follow. Bon Appetit'"}, {"id": 44, "text": "First, if you like series like Suburra, Gomorrah or Zero, Zero, Zero, this one is for you. It's a great French movie. Pretty good acting, action and greedy story mixed with a good script and story-telling. Probably last ten minutes are the best I've watched in several months. Pretty Solid."}, {"id": 45, "text": "Great plot and story line that leaves you on the edge throughout and right up to its gritty ending !"}, {"id": 46, "text": "The ideal to watch this film is not to have any expectations. If you don't have it, you will be surprised and have a good time. The story is hard but it's pretty good and sometimes you don't know where it's going to go. The action scenes are shocking, they look pretty good and real (i mean, they don't look like Stormtroopers) and it has an ending that I saw it coming, but it looks very good. It's a good film but it's not a big deal."}, {"id": 47, "text": "Solid movie this, made with passion. One fails to empathize with the characters though as this area of the movie is somewhat under developed. With a little more finesse, this movie could have been another Pulp Fiction or Lock Stock and Two Smoking Barrels. Overall though, a great enjoyable movie in the French tradition."}, {"id": 48, "text": "I loved it great film put it this way if it were British or American made they would be calling it brilliant really enjoyed it"}, {"id": 49, "text": "This is an unusual style of film to find on Netflix - it's almost old fashioned. The dark, drab aptmosphere, and testosterone fuelled characters are mostly superficial to the actual story. It takes a fair bit of attention to see what's going on, so don't go into it half asleep already. It also doesn't shy away from violence."}, {"id": 50, "text": "Very good police action film where the Corsican mafia gangs reign supreme over the city of Marseille, between settling of accounts and corrupt High Authority police ... very good film and good scenario for a French film"}, {"id": 51, "text": "This French thriller has enough twists, betrayals and deaths for at least three good Hollywood movies. Using a very fast pace, a couple of well known actors in small roles (Reno, Lavin and a cameo from Claudia Cardinale), and others not so well know but effectives; BRONX becomes a violent thriller full of unexpected surprises and even an ending. Explain the story is not easy. There are a three gangs fighting for drug control. A lot cops; some very corrupted and others rebelling against the system and superiors. Everybody betrays somebody else and you must pay attention because things get very ugly for criminal, civilian and policemen. In brief; totally unexpected and very interesting."}, {"id": 52, "text": "Sometimes France gives us some jewels in form of movies, that are quite different from the american crime movies we are used to. This one has a good story, good action, an unrecognizable Claudia Cardinale and a susprising(different) ending. The bad thing was the death of an actor i learned to love - who is, by the way, little used here(does parkour ring any bells ?)"}, {"id": 53, "text": "Philosophy through eclecticism, protests through idiotic rules. Nice job. Elegance actors."}, {"id": 54, "text": "I think this is a cop/mafia movie as real as it gets. Its dark, gritty and palpable. The ending is what makes it all the more absolute. It's funny that crappy comic cop shows like Bad boys gets a better rating than a substantial one. Just goes to show what people want to see and what they want to believe. I think this movie is a solid seven."}, {"id": 55, "text": "The set pieces were extremely enjoyable and proved to be some of the greatest action scenes of the year"}, {"id": 56, "text": "Not an easy movie to do ... cops are supposed to be the good guys aren't they? But even the good ones are doing things - well not by the book. Maybe that is ok with you, but overall this may be something some may have issues with. And then there are the outright corrupt cops. Yes they have their reasons ... but are they good enough for what they do? Can you understand their thinking and forgive them? This will be up to the viewer.I was going to give this a 7 instead of an 8, but I have to admit that the ending really did the trick for me. I understand if some feel the opposite - but I do think it's the only way to solve this ... or absolve? Finding peace or whatever you want to call it - no pun intended. Really grim and down and dirty - not something that will appeal to a lot I reckon ... with quite a few flaws along the way"}, {"id": 57, "text": "... if so, you'll like this one too.Who are the 'bad' guys, cops, gangsters or both? Who are on the 'take', cops, gangsters or both? Who is double crossing/ratting out whomever ???Legendary French actor Jean Reno (The Professional/Godzilla/Wasabe) plays a bit/cameo part here; when I listened to the 'dubbed' English version, I nearly threw up, he sounded terrible, so I switched to the native French with English subs, IMO - far superior.Claudia Cardinale who is/was a 60's-80's French/Italian sex symbol (think Raquel Welch type) played a very minor part, and frankly you won't guess the ending - but it's quite severe. There is a tad sex/nudity and this may be a movie for guys only - but, it's a cut above most, so I gave it an 8/10 for being a gritty/cops/gangsters movie in Marseille."}, {"id": 58, "text": "For me it's the corruption. The sex scandals . The drama . The melancholy. If you're a lover of conspiracy, then you'll love this one ."}, {"id": 59, "text": "What I loved the most in this movie is the level of directing and special effects in the shooting scenes, from the club shooting, to the suicide scene and the headshot of the crazy girl. All of them were too real and absolute natural. P.s. I'm not psychopath serial killer."}, {"id": 60, "text": "Cops operating on the edge in Marseilles dealing with hardened criminals. Just how far can they go? Well, pretty far if this is to be believed. Really enjoyed it though and the presence of the gorgeous Mr. Gautry just gave it that extra attraction for me!"}, {"id": 61, "text": "Something lacks here if you consider that's an OM's feature, though you have here his trademark: a cop story, brutal, gritty, bleak and dark at the most. But he put too many elements, which brings much complexity to follow, and maybe not depth enough to the characters. That's not LES LYONNAIS, nor CARBONE or 36 either. But if you crave for rogue cops and violent action crime flicks, that's definitely for you. OM is the heir of Jean-Pierre Melville, not on the shape of course, but surely on the DNA. On the war of police topic, you also had COLT 45, made six years ago. Different story, but so dark and gloomy too. I repeat, I LOVE this film, but I would be fair enough to admit that OM lost much of his inspiring after LES LYONNAIS, in 2011. Look again BORDERLINE and CARBONE, nothing to do, with his second, third and fourth film ( 36, MR 73, and LES LYONNAIS.), the magic spirit, so powerful regarding of the deep characterization which was his trademark this magic, outstanding atmosphere has disappeared. This film is NOT a Netflix creation, no, no; no, it is a GAUMONT one. It was destined to the movie theaters, as the rest of his movies, except BORDERLINE, which was a TV movie. But I am sure Gaumont realized that a theatre release would be a disaster, so they preferred a Netflix distribution, they took this decision in July. They told it was because of the COVID, . Hmmmm...This way, Gaumont 1) Saves money from printing hundreds of copies destined to movie theaters for a film which would have been a gross failure and 2) gets a big check from Netflix for its release and 3) is distributed nearly all over the world. Actually, BRONX, which is a powerful crime movie though, really looks more like a Netflix production than a prestigious Gaumont feature. But the overall scheme would have perfectly fit for a mini series, in the line of BRAQUO."}, {"id": 62, "text": "Rogue City is much better than a typical crime thrillers movie,it,s more a character-driven movie there are a lot,s of great movie characters in this movie. Rogue City is a film so riveting and interstaining with so many plots involving all of the movie characters. Great characters development in this movie.Great work from the directors brilliant direction of all this great ensemble cast movie.Of course, the big selling point is the Legendary actor Jean Reno and the marseille setting although it,s only a small roles in the movie Jean Reno is great in this movie but don,t expect charlie mattei from 22 bullets.Rogue City has a excellent screenplay great plot and plenty subplots in the movie. Netflix is marketing this movie as a thrillers movie but it,s more a characters driven drama movie.It,s a much deeper thrillers movie then a simple action gimmick movie great use of David Belle from that excellent movie District B13 in a serious role. All the actors are great in this movie great raw and interesting acting many greats scenes in this movie where all the characters share and discover how similar to and yet different from each other they are all.There are lot,s of scenes with nice characters developmentsThe film is brilliantly directed building tension while developing characters with plenty subplots.Rogue City being driven by the characters rather than strictly by the plot which concentrates on many different characters and stories. The film builds up to a climax that is really great.The movie also has a great soundtrack and a great editing. Rogue city is a great Netflix movie Netflix should produced more european contents like this great movie"}, {"id": 63, "text": "The French tend to do crime drama a lot better than most. The approach is unpretentious and often uncompromisingly brutal.Rogue City is no exception. Its a hard nosed crime drama that shows there's a fine line that's often crossed, between the supposed good guys and the bad one's.In terms of story this is a complex film. A little too complex at times. Its also far fetched in certain respects but not too much so, when you see the levels of police corruption globally.Well acted, directed and paced, this is a riveting watch that's well worth your time if you like crime drama's with a sharp edge.8/10."}], "reviews_amount": 64}