{"name": "Khaali Peeli", "titleId": "tt10885444", "reviews": [{"id": 0, "text": "Bollywood is rich because we pay to watch the terrible things it throws at us. The world behind the big screen, your real lives are pathetic. New and deserving talent are not given chance expect sons and daughters of so-called stars. Its time Bollywood reaps what it deserves."}, {"id": 1, "text": "Today is 151th Birthday of our beloved national father but by far today is worst birthday of Gandhiji.Khaali peeli is really worst movie, Even I was against Nepotism but I thought to give a try but it turns out worst.Verdict - Please avoid"}, {"id": 2, "text": "I really fail to understand why studios are spending Millions and coming out with such outdated product. This movie should be avoided."}, {"id": 3, "text": "Utter nonsense Use your time and money wisely, go plant some trees, clean roads and drains, feed birds or watch KRK's deshdrohi or watch Loha twice, watch Mann ki baat, watch anything but not this utter non sense."}, {"id": 4, "text": "As Kareena kapoor Khan said well clear, that we the audience have made them stars by watching there films, 'MAT JAO NA MOVIE DEKHNE KOI FORCE TOH NAI KARRA HAI',so koi rok b nai sakta bekar review dene ko without even watching the flim.... So this my review for this film...Thanks KAREENA KAPOOR KHAN."}, {"id": 5, "text": "Routine story. Horrible acting by Ananya Panday. Please take retirement and consider some other job besides acting. Ananya Panday's acting is pure torture to one's soul and sanity"}, {"id": 6, "text": "Total waste. Don't waste your time.. There are many good contents in OTT platform to watch."}, {"id": 7, "text": "One of Worst thing of this year Very very bad my thought was they can't go below soty2 and dhadak but this is bad than that"}, {"id": 8, "text": "Worst movie worst songs and worst actress ever! After the struggle of the actress she still doesn't know acting. Don't waste your time on this!"}, {"id": 9, "text": "Really a suicidal movie, i start hating my choice. Want my money back"}, {"id": 10, "text": "This film belongs to Nepokid and we will not watch this bakwas Nepotistic film. Stop making films with Nepokids."}, {"id": 11, "text": "Worst movie ever. I just watched it thinking watching in piracy won't profit this movie but yucckkk! But I didn't realise my time was on stake here. Worst movie. I left it before credits could roll. Unbearable!"}, {"id": 12, "text": "This movie is not good at all.... bollywood badly needs to improve its story line and cast right now...it is high time bollywood :("}, {"id": 13, "text": "Third grade movie like sadak 2.. Its a c graded picture with 3rd grade actors. Not at all acceptable"}, {"id": 14, "text": "One of the worst movies in the history of Bollywood"}, {"id": 15, "text": "Simply waste of your time. No story no acting. This movie don't deserve to be released. Ananya Pandey is worst actor of nepotism lot."}, {"id": 16, "text": "Such a useless pathetic don't waste time to watch such a wrost movie."}, {"id": 17, "text": "You can only see khaali yellow susu actors. no acting capability horrible story, 3rd degree torture you will stop watching as soon as peeli susu actors come on screen. PLEASE AVOID AT ALL COST go to the toilet and take a dump instead will be more fun."}, {"id": 18, "text": "No acting senses. Fully boring movie, actors are very low quality"}, {"id": 19, "text": "Don't ever see all those nonsense.struggless movie.My late of Bollywood was dil bechara the end .boycott Bollywood.."}, {"id": 20, "text": "It's better you watch cartoons channels than watching this movie without any real acting. Cartoons characters have better expressions than these guys. Thank you"}, {"id": 21, "text": "Can't recommend this movie to anyone. Can't recommend this movie to anyone"}, {"id": 22, "text": "What a waste of time it's been. Worst lead performance followed by a poor script and editing. The director tried to ellobrate the emotions the lead is suffering resulting in a total failure. At one end the story seems divert from the original content making more spaces toeards the lead and trying to showcase the as something they aren't."}, {"id": 23, "text": "Story/script/screenplay gone bonkers for bollywood. Both lead actors still long way to go before to consider themselves as actors. Story as been said/presented umteen times... Nothing new to offer, any other BS movie"}, {"id": 24, "text": "Time waste 2 hrs ....Plz safe ...Now uh uh uh thu thu thuhak"}, {"id": 25, "text": "Even writing review in this movie seems like wasting timw"}, {"id": 26, "text": "Movie deserve only 0 round of claps. Doesn't have a story and not a single % of entertainment."}, {"id": 27, "text": "Full time pass movie Aabagsushsbbsbsbhsjzbzbzbjzjzjjzjsjsjsjsjsnsnnsndndndndndjhdjdjdjjdjdjdjdjdjdjjd"}, {"id": 28, "text": "Not interested in Bollywood anymore! Time to stop idiolising the anti nationalists, criminals, murderers, Druggies!"}, {"id": 29, "text": "Bekr movie.. dont waste time watching it. Instead watch narcos .. it is a grt show.. this is a dull movie"}, {"id": 30, "text": "Dont watch if u really want to save ur precious 2 hours minus acting skills there are some people who gave 10 stars bt all are fakes and also they did it twice so i request u all we can twice reviewed it nd pls give it 1 star 2 times. nd 1 star for just for ahlawat others are dumb z class acting"}, {"id": 31, "text": "Complete time waste! Bollywood has become a real gutter!"}, {"id": 32, "text": "This is one of the worst movie of 2020. No story, no chemistry between actor and actress."}, {"id": 33, "text": "Very bad and petty experience...dont go for it..throw it into thrash"}, {"id": 34, "text": "Bad story . Don't waste your time and money. I think , please entertain your time with good movie and show."}, {"id": 35, "text": "Total waste. I don't understand why AP is still getting movies."}, {"id": 36, "text": "This could have been a tolerable movie with a tight script, good actors and music. Nothing new here as the director/producer seems to be more interested in showcasing the non existent acting talent of the lead actors."}, {"id": 37, "text": "In india if you are children of actor, you can get movie. Who care about talent."}, {"id": 38, "text": "I haven't watched this movie trailer hi ita ghatiya h to movie kaun dekhega or waise v we boycott nepotism"}, {"id": 39, "text": "Zero ka option bhi hona chahiye. bakwaas hai ekdum. Koi mat dekho. Ghatiya script. Ghatiya cast. Waste of all resources."}, {"id": 40, "text": "Stop watching movies of these nepo kids otherwise we will keep losing more Sushant."}, {"id": 41, "text": "Avoid at all costs.. No entry.. Plese go back.. It's a waste.."}, {"id": 42, "text": "Very disappointed with the movie ,it sucks I'm giving -1000/10 Pls Bollywood give chance to newcomers Both of them sucks"}, {"id": 43, "text": "Over acting and drama n unskilled in acting of ananya.."}, {"id": 44, "text": "Total waste of time. The movie is very shallow. Ananya Pandey doesn't know acting. Can't watch the movie disgusting."}, {"id": 45, "text": "It's an ityer waste movie with no story line and acting is the worst. Ananaya pandey is so pathetic. Plz don't watch."}, {"id": 46, "text": "Product of Nepotism, I dont like the acting of both so called stars Bakwas acting, bakwas movie"}, {"id": 47, "text": "Even after all the controversy this movie has faced like the Beyonce songs, fake YouTube bots and the nepotism claims, I decided to watch this movie with a neutral mind. Oh boy, what a disaster this movie turned out to be. First of all the plot has nothing new to offer plus each and every minute of the scene is cliched. Yes a cliched movie is still enjoyable up to some extent but the quality of the movie is bought down by the two lead roles played by Ishaan and Ananya. Zero facial expressions, plain dialogue delivery; very amateurish acting. It was like they hadn't put much effort into their respective characters. And zero marks to the director of the movie who has done nothing creative in the project. The dialogues are forgettable and the screenplay is decent. Please save your money and time on this one. There are a lot better options available on the OTT platforms."}, {"id": 48, "text": "Worst than ever. Couldn't sit thru it for 15 min also... Still tried to see half of it. No trace of acting, actors r forcing themselves into a horrible accent... Yukk. Why did the makers waste their money??"}, {"id": 49, "text": "I fail to understand why they are still making films?"}, {"id": 50, "text": "Why they r even tring to make films.just get some job.titally waste.do not watch"}, {"id": 51, "text": "Ishan n Anaya ..below average acting .No story ...worse cinemetaography"}, {"id": 52, "text": "I am not talking about Ananya Pandey here. But Ishaan Khattar did a good job acting. The movie plot was average commercial movie whose delivery was below average. The plot wasn't gripping. If the movie makers were looking for a commercially acclaimed movie... they could have opted for a Tolly Remake. Ummm...something like Taxiwaala. Ishaan Khattar was effortless but did not suit well with the character."}, {"id": 53, "text": "I'm stilled puzzled on the storyline and acting.Completely bamboozled. In short: Worst than torture."}, {"id": 54, "text": "Cheapskate version of sadak. Do they watch their own movie before the release? Do they realise the disaster they have made?"}, {"id": 55, "text": "Can't believe that people are making this type of movie and want audience to watch this movie. This movie will surely make to list of the worst movies of the year 2020. Ananya Pandey should leave acting. This is not her cup of tea. She should try her luck in some other field. What to say about Ishaan... How people like him can think of acting, is beyond the imagination. Both actors have ruined the movie. Both are perfect example of nepotism and failing at the box office.Even if you want to waste your time, don't watch this movie."}, {"id": 56, "text": "Worst movie.No acting skill.No expression.Don't see this movie.It's a waste of time."}, {"id": 57, "text": "This was expected, when you promote useless ordinary looking guy and a daughter of a flop acor. Dont waste your time."}, {"id": 58, "text": "Plz give me my two hours back . Such a 3rd class movie with nothing new in it. No good movies are left in Bollywood. Either they make a remake of South or English movies or these brainless movies. I suggest plz don't spoil ur year 2020 more..."}, {"id": 59, "text": "Soooo bad this. Overacting and fake accents. Yuk. This is typical garbage u expect from Bollywood where first they have casting and then try to fit movie around it."}, {"id": 60, "text": "This is the worst film of the decade. Not worth watching. Bakwaaaaaasssssss"}, {"id": 61, "text": "Worst movie I've ever seen in my life... totally time waste...if you want you waste ur time...go and watch otherwise if there's a sense, no one could watch it...it's completely dumb and overacting... even 1star rating is waste for this movie"}, {"id": 62, "text": "I was feeling very low so thought of watching this movie, now I am depressed 😶 And why the hell this Struggle Girl doesn't give expression what's wrong with her? Saw this movie was Comedy genre but I was searching it throughout the film but was unable to find out. I would have done my Coding work instead of this Utter trash thank god I left the movie in between.Also One Thing I own Netflix but I watched this ofcourse through privacy because you don't pay for Actors who entered acting freely .Also when I mentioned actor I said about only That Guy Ishan okay . Struggle Pandey is not an okay . Note: Watch at your own risk ❌💯👍"}, {"id": 63, "text": "Sabse ghatiya... Waste of money, time. Bekaar.. Usase accha kahi good place khaana khao. Aisi wahiyaat movies pe time waste na karo"}, {"id": 64, "text": "Find real talents it's a pathetic movie with pathetic actors Come with a better content !!! Time to set new standards"}, {"id": 65, "text": "Outdated masala flick which fails to entertain &amp; enthrall the audience . Ishaan &amp; Ananya Panday acts are the Worst aspect of the film, none of them neither looks &amp; acts do justice..overally a waste of time"}, {"id": 66, "text": "The actor is worst. I must advice not to wate your time watching this movie. It is already a super flop movie bcoz of the hero."}, {"id": 67, "text": "Ananya pandey can be beautiful..can be Star kid..but Acting is not her cup of Tea..SHE IS NOT A ACTOR.. or I CAN SAY DUMB,EXPRESSION LESS ACTRESS..please don't torture people..already we are suffering od COVID TORTURE. .and Next 3-4 Years if you want your film to be HIT..then AVOID STARKID..free ka suggestion 🤣🤣"}, {"id": 68, "text": "****Caution****Do not watch the film its worst than worst. Yuck!Justice for SSR"}, {"id": 69, "text": "Bakwass moive Please 2 hours come me Flop moive of the year"}, {"id": 70, "text": "Worst movie till date. No acting. Shame we are forced to see such pathetic movie."}, {"id": 71, "text": "Don't waste time and money for these waste movies. Please do something better and more imp such as reading books or even just take a nap is worth. These nepo kids don't deserve public hard earned money.Also bollywood is all drugees and all our funding is going to mafia &amp; used against our nationNation comes firstBe a true nationalist for new Bharat"}, {"id": 72, "text": "Just waste of time .If you have time please contact me mera homework krdo faltu m iss movie m time na lgao ."}, {"id": 73, "text": "Why Bollywood is wasting money by making movies?We have Boycotted Bollywood .Rot Bollywood...You all killed Sushant"}, {"id": 74, "text": "Kharaab movie. Kh from the epiglotis. I feel bad for people paying money to watch this crap. Please bollywood grow up."}, {"id": 75, "text": "One of the worst movie I have watched till date . No direction , no acting skills , most importantly no logic"}, {"id": 76, "text": "Why waste time and money on not decent movies .. ........"}, {"id": 77, "text": "PATHETIC FILM PATHETIC CASTING PATHETIC ACTING NEVER GOING TO WASTE MY TIME ON SUCH ACTORS, DIRECTORS. YUCK!!!"}, {"id": 78, "text": "Just because of jaideep sir i am giving 1 star. Acting was sensless. Ananya pande struggle did not really work. she must have to do more struggle."}, {"id": 79, "text": "Khaali Peeli is a worst movie of 2020. Please don't waste your time and data if you are downloading from Telegram."}, {"id": 80, "text": "Overacting,illogical scenes,boring skill is out of zone.watching movie like waste my 2 hours"}, {"id": 81, "text": "Waste of time watching these untalented nepo products."}, {"id": 82, "text": "Don't know how this guy is getting movie...seems Bollywood has no talent left....and they think whatever they will present ,we as a audience will accept..gone are the days..."}, {"id": 83, "text": "The movie is apt for its title..Khaali Peeli..aka ..Timepass but still doesn't live upto its name.."}, {"id": 84, "text": "Don't even bother reading reviews! What a total garbage of a movie and Ananya Pandey should rather try something else, maybe a hand model!"}, {"id": 85, "text": "Not a good movie at all. No skills for acting.. as boring as Covid."}, {"id": 86, "text": "If you really dont have anything to do and feel lone you can start this on your TV and feel like somone is there neednt watch this."}, {"id": 87, "text": "Worst movie don't waste your time.Storyline is worst and also acting is also not much good."}, {"id": 88, "text": "They dint even know what they have made.. worst movie ever.."}, {"id": 89, "text": "It's a remake better to watch original movie.Give credit to someone who put some effort not the copy cat ones"}, {"id": 90, "text": "Ananya Pandey should be given an Oscar for her performance.She has acted so well that the director did not shoot her in too much close-up.She deserved applause for making such a jump at the end.Ishan is performing well now, Many have done well with good directors but Why are you going to say goodbye to your film career by acting in such a movie?"}, {"id": 91, "text": "I think both the actor's should select a differnt carrer now as we as a audience are not going to accept them Thank you"}, {"id": 92, "text": "Are you so free to watch Anything like anything then please go ahead. Don't waste your money. Do charity do something good u will really feel good."}, {"id": 93, "text": "Made no sense. These people neither know how to act, nor do the story writers know what sells! Bollywood is hitting rock bottom"}, {"id": 94, "text": "Waste of money. Bad movie and bad acting skills. Don't watch this movie."}, {"id": 95, "text": "Ishaan tried his best to save this movie with his acting but he failed terribly, everything about this movie is copied from other bollywood movies especially alot from Taxi No.9211. I wouldn't call it an absolute copy of Taxi No.9211 but it takes alot from it and other movies. Ananya ruined it completely, when i saw the trailer i had some hope her acting there was looking average but when i saw the movie i realized how misguided the trailer was. She really shouldn't act when she cannot and what i think is the best choice for her is to quit acting and pursue a career in something else. As per the story it is absolutely i won't give any spoilers here but the story is so bad that you would want to switch to watching Doraemon in just 20 mins in the movie."}, {"id": 96, "text": "Had a lot of expectations considering the trailer and media saying it will be a fast paced action comedy. it was the same disappointing story of 90s and they expect us to get thrills and laugh on the same scripts in 2020s."}, {"id": 97, "text": "Nothing worst than this movie in bollywood, this should be given zero star"}, {"id": 98, "text": "These nepokids are just useless. No need to waste your money and time."}, {"id": 99, "text": "Worst movie Time waste Bakwas Ananta Pandey is a bad actress ever"}, {"id": 100, "text": "#BoycottBollywoodBollywood is anti nationals... Anti hindu.. They murder Indian new comers and welcome Pakistani new comers.."}, {"id": 101, "text": "As the name suggests, khaali peeli movie.. Same old 70's movie storyline.. Nothing new.. Not worth it"}, {"id": 102, "text": "I seen this I saw its so worst acting like a maha fuddu but a worst movie I requested to everyone says don't watching this worst movie play lead roles so dumb has leading star villen has good job"}, {"id": 103, "text": "3rd class acting and poor storyline... Ananya pandey should retire from film industry.. No need of a 3rd class actress.. Plz Don't waste ur time.."}, {"id": 104, "text": "Ananya Pandey cannot act. Just cannot. She's disgusting."}, {"id": 105, "text": "Total Waste of time.... Predictable story ...cliche concept"}, {"id": 106, "text": "The way this movie is made, we can easily find a lot of resemlence with late 80s and early 90s style of bollywood masala film making, But there are several reasons for which this movie seems tasteless and bland. Firstly, writing isn't strong enough. They took the old school movie making style but couldn't develop any of the character like it used to be in 80s (Manmohan Desai's) movies. Secondly, It is a love story but there is hardly any chemistry between Ananya &amp; Ishaan. Thirdly, acting- Ishaan is a decent actor &amp; could have done a lot more better job, Ananya was obnoxious. I couldn't connect to her character even for 10 seconds. Jaydeep didn't had much to do, his character was also very underdeveloped but still managed to pull out something out of nothing. Comic sequences are forcefully inserted. Editing of the movie isn't either that great. The screenplay of the movie stands on half a dozen of flash backs. Only postive of this movie is Vedant Desai and Deshna Duggad...both of them did a splendid job and I loved the chemistry between them."}, {"id": 107, "text": "This movie is garbage ..just avoid watching this and yes boycott nepotism"}, {"id": 108, "text": "Ananya Panday is the trash we get due to nepotism. Please remove her from films and the films will be fine."}, {"id": 109, "text": "This day our gandhi ji died again after seeing this 👍🏻"}, {"id": 110, "text": "Rather wasting your time on these OVERACTING NOOBS invest it on something useful"}, {"id": 111, "text": "No storyline ... Better watch anything else and spend your time well ..."}, {"id": 112, "text": "Movie director should have adapted with a better content in the movie. Other than that it was ok."}, {"id": 113, "text": "Both these stars sucks!! Its better to watch Ram Gopal Verma ki Sholay!!"}, {"id": 114, "text": "Yaar it is really high time Bollywood should wake-up as well as audience to make some good films like tumbbad and some other few good films and we should receive it well too"}, {"id": 115, "text": "Worst movie of 2020. 🤢🤢🤢 I would highly recommend you people avoid this movie! Time 2 hours of my life I will not get back. The female heroine can't act to save her life 😑🤣🤣🤣"}, {"id": 116, "text": "Masterpiece!!! Finally a movie which matches the level of soty2 and sadak 2. Period"}, {"id": 117, "text": "I give rating Because personally i don't want to loss real talent like Jaideep Ahlawat"}, {"id": 118, "text": "The original one was little enjoyable. But this movie dailouges dont have nay head Or foot. What to talk about screenplay. Acting😱means you have casted such expression less actors the way of talking is just stupid. The only good thing is supporting cast like swannad and kaushal sir"}, {"id": 119, "text": "Better to Sleep to see this movie.Even1Rs is worthless for this Overrated and overacted movie."}, {"id": 120, "text": "I watched this movie i thought this long weekend lets try, but again senseless acting senseless cast. Worst movie. I left it before credits could roll. Unbearable!"}, {"id": 121, "text": "Dont want to give this movie even a single star..... But dnt hv any optn.... But from my side 0 stars......"}, {"id": 122, "text": "Khali Peli is a typical bollywood movie where a director had tried to put everything he have seen in a bollywood movie be it lovestory, robbery, car chase, creepy dialogues etc. I think Ishaan Khatter and Ananya Pandey got their inspiration from Salman Khan where hero &amp; heroine can perfrom complex super human task be it fighting with a gp of bad guys or a car chase, you name it they have done it but they can't act as they got their inspiration from Salman Khan. After watching this movie i think they were having their competition with sadak2, race3 type movies and they even failed in competing with this movies."}, {"id": 123, "text": "This movie sucks so hard this is the worst movie please don't waste your time on this movie Ananya's acting was so flat she was just a dead robot the whole movie no skills at all the story was bad direction was ok other than that everything was garbage"}, {"id": 124, "text": "Nice movie made after so long Best bollywood movie after many months It's gives a lil feel of 90's very nice Nice very nicely made and directed Bollywood ka es saal ka Sabse best movie hai Both have done a great job, nice This is mind-blowing m"}, {"id": 125, "text": "Boring story. Horrible acting by Ananya Panday. Please take retirement and consider some other job besides acting. Ananya Panday is the worst character in the movie... guys waste your 2hr watching this movie..."}, {"id": 126, "text": "Don't watch,waste of money and time I'll never watch movies like it again cuz it has wasted my time and money."}, {"id": 127, "text": "Jabarjast film hai Comedy jabarjast hai... Ananya cute.."}, {"id": 128, "text": "Hottttttt bhi and Hit bhi hai movie Ananya is love"}, {"id": 129, "text": "Casting and direction are selling points, watch Love the location"}, {"id": 130, "text": "I should've rather invested 2 hours watching any of the series on TVF which are way brilliant than this"}, {"id": 131, "text": "These Nepo kids dont know how to act and still they are getting movies...bravo..this industry really sucks"}, {"id": 132, "text": "It was a worst movie to watch total bakwaas the acting was very bad and the story of the movie does not mean anything."}, {"id": 133, "text": "BOLLYWOOD, OTHER NAME NEPOTISM . . .... .. . ...."}, {"id": 134, "text": "First reaction after watching this.🤕🤕😴😞😞Waste of moneyLight acting. by actorsDisaster movie"}, {"id": 135, "text": "Esshe accha to village ke mela hote h..jaha entertainment to hota h.....This movie is totally waste of money and time....."}, {"id": 136, "text": "Taapse did very bad acting in this... Worst film of his life.. She is also Anti SSR and Involve in anti national protest like anti CAA and many more.. She is from Anurag kashyap circle...and now..we all know the truth of bollywood(Drugwood)"}, {"id": 137, "text": "Ananya Pandey so looks constipated. I couldn't bear this nonsense film more than 2 minutes."}, {"id": 138, "text": "Hero look like a bhojpuri actor totlly waste of time"}, {"id": 139, "text": "They don't know how to act. I am feeling sorry for the director for choosing them as the leads."}, {"id": 140, "text": "Shame on you people to waste million to make such idiotic drama. What happened to your common sense."}, {"id": 141, "text": "The acting was soo bad. Story line wasn't that great as well."}, {"id": 142, "text": "No acting, No creativity, Baseless film. Boring act,movie"}, {"id": 143, "text": "Worst 28 mins of the month. I am in lockdown and still this is the worst time.. So unnatural acting, looks so fake."}, {"id": 144, "text": "Movie start with simple and interesting plot at night but its turns to borring, illogically plots were watching movie is just Time wasting think. Acting level is so poor and there nothing about story."}, {"id": 145, "text": "Don't waste your time, watched it today. Pathetic acting and pathetic strory line. 😐"}, {"id": 146, "text": "As Kareena kapoor Khan said well clear, that we the audience have made them stars by watching there films, 'MAT JAO NA MOVIE DEKHNE KOI FORCE TOH NAI KARRA HAI',so koi rok b nai sakta bekar review dene ko without even watching the flim.... So this my review for this film..."}, {"id": 147, "text": "Say No To Nepotism!! Let us unite to be the part of revolution to throw this Nepotism by products out of Bollywood.. Bollywood sirf inke baap ki nahi hai.. They have to rely on us &amp; Beg to us for their revenue.. &amp; Beggers &amp; are not choosers.."}, {"id": 148, "text": "Say No To Nepotism!!! Baycott All theses Nepotism &amp; by products.. We have enough greater content to watch on Netflix, Amazon, Hotstar &amp; best is YouTube..."}, {"id": 149, "text": "Say No To Nepotism &amp; All it's products &amp; By products.."}, {"id": 150, "text": "No story, useless acting. Regret wasting my 2hrs. In the era of amazing content on OTT. They came up with Khaali peeli"}, {"id": 151, "text": "Struggle queen can't make it even in next 100 years"}, {"id": 152, "text": "Pure garbage... I still can't figure out how they agreed to do a film with 0 story and plot... Pathetic!"}, {"id": 153, "text": "If you are watching this movie then sure you are wasting your money just I did"}, {"id": 154, "text": "Worst script , worst screenplay , worst dialogues , worst movie Conclusion - poke your eyes out but don't watch this movie!!!"}, {"id": 155, "text": "Useless and useless and useless.. Waste of time watching these kids of p I g.. Do play some game instead of watching such useless stuff.."}, {"id": 156, "text": "Nice movie!!! Time pass!!! Could been better but better then what I have been watching Lately.."}, {"id": 157, "text": "Such a pathetic movie and such horrible acting. The lead actors (sorry for calling them that), should seriously consider taking up some other occupation."}, {"id": 158, "text": "I wish INDIA had a Razzie equivalent cause this movie absolutely deserves it. What a complete waste of talent, money, time and effort. How the hell did Ishaan and Ananya even agree to do the movie. Like how high were they when they signed it? You can actually feel your brain cells dying while watching this garbage. Save yourself the agony and watch a 2 hour video of an empty paper bag floating in the air instead and that would still be a better use of your time."}, {"id": 159, "text": "We viewers have to stay together and avoid s**ty movie like this. That way we can save Bollywood from destruction."}, {"id": 160, "text": "If you haven't watch this movie yet then you must be a lucky person."}, {"id": 161, "text": "Nothing novel about this movie.This movie isn't interesting or something that you can enjoy watching"}, {"id": 162, "text": "In 2020 people are watching mind blowing content on OTT platform and here they have made outdated hero, heroine and villan formula movie which no excitement no suspense no comedy overall this movie is not made for today generation audience."}, {"id": 163, "text": "My personal suggestions don't waste money on these mafia , khan , nepo , johar , druggie gang . Use this money to help poor people . Movie is totally flop and water of time , money and every thing ."}, {"id": 164, "text": "This is the worst movie ever seen in my life. Ananya panday &amp; Ishaan Khattar both these npo kids have no talent at all. Plz leave acting &amp; try something else. Don't use ur family background to be in films. There are so many talanted persons left unrecognised because of these npo kids."}, {"id": 165, "text": "Don't watch - really time waste. Waste of energy 🤣 why would you spend time to make this movie?"}, {"id": 166, "text": "No words! Just aweful..Avoid it...Ananya pandey is ugliest heroine of bollywood..."}, {"id": 167, "text": "Bakwas bakwas bakwas bakwas,Bakwas bakwas bakwas bakwas"}, {"id": 168, "text": "Worst movie, no acting, no expressions, story line is weak. Screenplay does not exist."}, {"id": 169, "text": "This is weaste of time.that is not eligible for review."}, {"id": 170, "text": "Total waste. Don't waste your time.. There are many good contents in OTT platform to watch."}, {"id": 171, "text": "You can watch this movie if you really have nothing else to do. Unfortunately if people have work, then please don't waste your time on this. A very bad movie. And absolutely pathetic acting.And where's the story? Honestly, its time to come up with some good stories Bollywood. I am sure you are not up for it though."}, {"id": 172, "text": "Another disaster of Nepo kids. Why producers r spending huge amount on their stupid acting skills."}, {"id": 173, "text": "Overall good time pass movie.. i liked it.. when i watched.. when i listen about this film that its not good not worth to watch.. i personally not feel.like that.. you can watch it once. Haa but its not worth for 299 for zeeplex"}, {"id": 174, "text": "Even If We Leave Aside The Nepotism Debate The Movie Still Sucks. It Seems Like Its Just Been Made To Keep the Nepotism Products In The Race."}, {"id": 175, "text": "If you bring donkey from jungle.they should have acted better."}, {"id": 176, "text": "IT IS NOT BETTER THAN SADAK 2.....THAT IS WHY IT DESERVES 1 OUT OF 10...."}, {"id": 177, "text": "How can they still make any movie on such a cliche plot? Worst story and acting, please do not waste your time on this."}, {"id": 178, "text": "Don't waste your time, go and watch thousands of good webseries"}, {"id": 179, "text": "Movie could be better, but the faltu acting of Ananya Pandey gives it 1 star. Story is average not new but it's okay. Actings made the movie cheaper."}, {"id": 180, "text": "Worst Movie of all time... Unbelievably illogical movie that has caused a severe mental illness to my brains..How could anyone produce such a movie ever..Pathetic..Even Gutter seems better then this khatara movie.."}, {"id": 181, "text": "Poisonous acting by Super flop nepo actress Ananya who wastes 1 hour to bring one expression on her face like jigging dog's tail. I acquired severe headache. I will never forget and forgive. I completely boycott it. I boycott all nepotistic films. I boycott movie mafia and druggies films. Movie:Too boring Story headache"}, {"id": 182, "text": "Could not watch beyond 15 minutes. Ananya is horrible to watch. Plot is stupid. Don't waste even 15 minutes."}, {"id": 183, "text": "Even 1 star is toooo much for this movie one of the worst thing is ananya's acting now i m feeling like going into depression"}, {"id": 184, "text": "Bollwood is rich because we pay to watch the terrible things it throws at us. The world behind the big screen, your real lives are pathetic. New and deserving talent are not given chance expect sons and daughters of so-called stars. Its time Bollywood reaps what it deserves What a discusting story"}, {"id": 185, "text": "This movie is more terrible than the corona epidemic of 2020. 😠😠😠"}, {"id": 186, "text": "Don't waste your valuable time watching this cheap movie. Nepotism reflect in this movie without acting. Both of them just kick the acting. very pathetic cheap acting.2 rupees acting by these star kids."}, {"id": 187, "text": "It's better to watch the work of donkey than these Catterpillars' movies"}, {"id": 188, "text": "I don't know why these movies are made. There is no story, no acting and the movie is just a shoddy chain of events. Bollywood seriously needs to upgrate its creativity and give chance to good actors."}, {"id": 189, "text": "Ananya Panday is just unbearable to watch. Her acting is obnoxious. Please make her stop. She singlehandedly brought the film down."}, {"id": 190, "text": "This is really stupid movie and worst actress. I am also not sure why Ananya is even a actress. A student from normal drama school can do better acting. Gone are the days where you can make anything and people will like it. Even 1 star was more for this kind of flim. Waste of time and money. Thoooo"}, {"id": 191, "text": "Don't waste your time..Bakwas.. Bakwas.. No acting skills.."}, {"id": 192, "text": "No acting, script and bad editingNot sure what was the intention of making this uselsss movie ... Just some songs and cheap comedy"}, {"id": 193, "text": "Nai dekhna aisi faltu movie...I saw a pics where Sholay movie scene is recreated...copy paste.."}, {"id": 194, "text": "Terrible story line. The actors need special acting lessons. the direction was below mediocre. The Producers wasted their money"}, {"id": 195, "text": "Just can't bear it opening 15 min... condolences for the audience who watched it full"}, {"id": 196, "text": "I have watched this movie with lot of excitement but I disappointed. Third class acting by ananya panday. Guys don't waste your time."}, {"id": 197, "text": "Such a useless pathetic don't waste time to watch such a wrost movie."}, {"id": 198, "text": "If you are suffering from insomnia Then please do watch the movie It will make you sleep Within 10 mins"}, {"id": 199, "text": "Instead of watching this movie it would be better to die im chullu bhar paani..😂😂"}, {"id": 200, "text": "Immature acting, very bad music, Story is very bad."}, {"id": 201, "text": "I have wasted 2 hr and this movie is so pathetic. Over acting in every scene of Ananya Pandey is damn irritating. The way she speak is also very annoying. She need to learn how to speak before coming in bollywood. No doubt nepo kids still rule the bollywood. Ishan Khatter acting also shows lack of proper acting skill. There are many other young actor who should be given chances. Overall movie is not good. Poor script writing."}, {"id": 202, "text": "Ananya pandey is not a actor she dosent even know the a of acting all the struggle could be seen as she acts this movie really sucks"}, {"id": 203, "text": "The movie began well but ended pretty badly. More twists and entertainment could have been added."}, {"id": 204, "text": "Waste of money and time.Its time we all stand up and stop supporting criminals. #justice for sushant"}, {"id": 205, "text": "Horrible acting, storyline of nepotistic kids of bollywood"}, {"id": 206, "text": "No story,no acting ,waste of time, you can easily predict the story ..."}, {"id": 207, "text": "World's most bakwas and useless movie Very much boring"}, {"id": 208, "text": "No Story no acting , Watch it if u want to waste 2 hours of your life ."}, {"id": 209, "text": "If Bollywood believes that they can piggy back STAR KIDS like Isshan Khatter and Ananya Pandey who lack the iota of acting nuances on some method actoring legends like Jaideep Ahlawat, Zakir Hussain, Swanand Kirkire, Satish Kaushik to help to them become stars... Sorry but those days are over.Audience is smart enough to decipher the your intensions.Movie is BIG Let down... You better watch TAXI No. 9 2 11 again... Where nana Patekar NAILED the persona of a taxi driver."}, {"id": 210, "text": "No one is interested in nepo kids. Only few nepo kids have talents. But in these movie they are flop."}, {"id": 211, "text": "Get better actors please. No one stops from supporting nepotism but atleast teach these children of the elite to learn acting please."}, {"id": 212, "text": "Worst movie in terms of acting, acting and actingIf you love overacting then this is the movie for you ..."}, {"id": 213, "text": "Who made her actress? She don't know A of Acting. Waste of time and Internet."}, {"id": 214, "text": "Nothing New.. No natural Acting.. Same, old genre of boring bollywood masala"}, {"id": 215, "text": "A total waste of time movie, I spoiled my weekend watching this, Dont waste your time watching the movie.My rating: 1 or even worse"}, {"id": 216, "text": "Immature acting,boring storyline ,and so much struggle not upto the mark"}, {"id": 217, "text": "First of all these Actors must be sent to some basic Acting Schools for 5-10 Years so that they can learn some Acting."}, {"id": 218, "text": "This is another disaster of 2020, worst year, please don't make such movie anymore, no more interested"}, {"id": 219, "text": "TATTI . . . . . . .. .. ... ...... ....... ........ ......... STILL TATTI"}, {"id": 220, "text": "Don't waste your money &amp; time on this selfish &amp; druggie people."}, {"id": 221, "text": "Disgusting movie as expected though I didn't watched it."}, {"id": 222, "text": "Bothe the actors in movie doesn't have sense of acting. Also the whole game changer was the change in lyrics of the song Beyonce."}, {"id": 223, "text": "It is movie with no story and both the lead actors failed miserably in acting"}, {"id": 224, "text": "Ananya Panday ? You struggled for this? Worst movie. Can compete with Sadak 2."}, {"id": 225, "text": "Don't waste your time watching this, instead of this watch something else."}, {"id": 226, "text": "I advice you not to waste ypur time on this movie, its absolutely trash !"}, {"id": 227, "text": "Bollywood style drama, You cant relate to any of the characters,dont care when watching. Everything was just going and going and then the end."}, {"id": 228, "text": "Worst story and eorst acting. This movi sucks.. too boring"}, {"id": 229, "text": "It's waste of times and waste of money. Strictly one time barely watchable with poor music and acting of the lead cast."}, {"id": 230, "text": "Khaali peeli in Mumbai means unnecessary and I appreciate the movie makers that they been Honest about the titleDisastrous acting by miss pandeyIshaan why are you wasting your careerI don't have words to criticiseThe last scene I think is taken originally as people are running after this two stars to hammer themPeople I would recommend you to see THE SERIOUS MAN"}, {"id": 231, "text": "Full on time waste and bad movie. Not worth even for free and they are charging 299 for this. Must avoid guys."}, {"id": 232, "text": "The performance is ok but what else message this movie could give except bad comedy which calls out woman an 'item'?? Aren't we aware what happened in Hathras, Balrampur??pls maintain dignity in your films towards women."}, {"id": 233, "text": "What did I just watch? Total lead cast were waste of time and money.... Except for Jaideep Ahlawat what a performance."}, {"id": 234, "text": "There is nothing worse than watching Ananya Pandey on screen."}, {"id": 235, "text": "Horrible....Horrible......horrible....Horrible.....Horrible.....Horrible.....Horrible .Horrible.....Horrible......Horrible"}, {"id": 236, "text": "I take an oath, never to watch another movie that has Ananya Pandey or any other nepotism brats"}, {"id": 237, "text": "Typical illogical mindless stuff which Bollywood as usual tries to pass as a Bollywoodi masala movie.We are soooooo done with this unnecessarily excessive romance and dancing in Hindi films."}, {"id": 238, "text": "Illogical and completely boring. Very bad acting by Ishaan Khatter and Ananya Pandey, bad direction and sloppy screebplay"}, {"id": 239, "text": "Ishan was good.. pandey is bad n getting worse 🙏 with every possible movie"}, {"id": 240, "text": "Don't waste your time watching this movie. It's better to watch serious man"}, {"id": 241, "text": "I don't know why they come up with such films anymore. Flops actors and mediocre script. Didn't they understand that the audience is no more an easy push? Verdict - Please spend time and money elsewhere"}, {"id": 242, "text": "Why does Bollywood make such bad movie? Do not watch this movie or else you will regret wasting your time."}, {"id": 243, "text": "Full of overacting..Ananya's performance seems like hell..Ishaan is OK but overall not a good movie for me..Ananya needs to improve her acting and dance skills.."}, {"id": 244, "text": "Felt like watching early 2000 movie and acting is just irritating the only thing that I like is some of the shots"}, {"id": 245, "text": "The hero is very tall and super ugly, he and dhanush look like brothers, the actress is suffering from polio and lies she went to USC. Both these nepo-kids should work behind the scenes and stop stealing roles from qualified , talented, independent actors. Both actors acting is torture. Kamal Rashid Khans review of the trailer is a must watch. Every thing about these 2 actors sucks- acting, dancing, looks, height. My advice don't waste your time watching this nepotistic movie and watch other good movies."}, {"id": 246, "text": "1- One of the wrost movie ever, i have ever seen in my life.. they just copied the story from a movie named #TAXIWALA. 2- secondly the leading roles are doing overacting.. that to they knowing anything about acting..😂"}, {"id": 247, "text": "Jaideep Ahlawat was superb as usual but the story is weak. Cheap dialogues, sounded fake at times. Nothing new in the dance and music part."}, {"id": 248, "text": "This movie has struggling actor and actress no story and writter donot have enogh to write the bollywood movie become waste as days are progress"}, {"id": 249, "text": "Loved it!!! This movie is definitely rocking Really love the acting"}, {"id": 250, "text": "It's awesome combination Zeeplex and Khaali Peeli for the weekend"}, {"id": 251, "text": "Mast enjoy Kiya Khaali Peeli, watch on Zeeplex bhailog"}, {"id": 252, "text": "Must watch movie!! Killer And love the acting of Ishaan"}, {"id": 253, "text": "The best part of the Khaali Peeli is direction Love the dresses also"}, {"id": 254, "text": "One work for Khaali Peeli - Fantastic One word for Ananya- love"}, {"id": 255, "text": "Damn good guys, watch it You will enjoy the movie, full dhamaka"}, {"id": 256, "text": "Superb, It has everything you expect from a good movie"}, {"id": 257, "text": "You, paisa and time waste nai hoga Paisa and time dono wasool hai Trust me, this is a hot movie"}, {"id": 258, "text": "Good dialogues, ishaan is excellent, aananya quite good , cinematography is good ,music is low and sucks , action scene in climax is poor ."}, {"id": 259, "text": "The Director and Producer is not a Purush, they are Maha-Purush. Aur ye Chota Chatri and Chunky ki ladki, they are trying their level best to pull their parents reputation into a infinite negative value. After watching the movie for 15 minutes, I felt I would be lucky, if I would have killed by Sattu Bhaiya. So that I could make a fresh start. Phirse chai me dudh-biscuit duboke khata. KHAALI.. PEELI"}, {"id": 260, "text": "How a commercial action and family movie be like? Watch Khaali peeli! Its enjoyable!"}, {"id": 261, "text": "Say No To Nepotism!! Let us unite to be the part of revolution to throw this Nepotism by products out of Bollywood.. Bollywood sirf inke baap ki nahi hai.. They have to rely on us &amp; Beg to us for their revenue.. &amp; Beggers &amp; are not choosers.."}, {"id": 262, "text": "Watched the movie with expectation that Ishan khatter would deliver a good performance, however, it was tough to watch the movie at one go.First the good parts - supporting cast, especially the child actors and jaydeep ahlawat.The bad - Badly written script, shifting of timelines in movie, performance of lead actors especially the lead actress. Overall avoid."}, {"id": 263, "text": "Well, Khaali Peeli is not an outstanding sort of movie but an entertaining one. Liked the masala story and some scenes were really funny. To be specific Satish kaushik was really funny even in the short role. Ananya Panday and Ishaan Khatter were okay. Ishaan is a really good actor and he really does a good job here."}, {"id": 264, "text": "It's a time pass masalaa movie.. Performance wise Jaideep Ahlawat &amp; Satish Koushik steal the show..Ishant &amp; Ananya also gave decent performance..weak point is average music &amp; Story...acceptable one time watch..!!"}, {"id": 265, "text": "Over 90% of movies that come out of bollywood are like this movie..RUBBISH.RUBBISH ACTORS, RUBBISH SCRIPT, RUBBISH DIRECTION.I only watched 30 mins of this crap of a movie.My advice, don't be like me as spending even 2.mins of your time watching this movie gives it kudos which it doesn't deserve."}, {"id": 266, "text": "Everything was clear in the trailer itself. So dint take the risk of watching it...now after reading the review I saved my time..please support content based movies and we series..we can bring the change..bollywood should be forced to get good content or else just don't make it.."}, {"id": 267, "text": "Verdict -- &gt; Please AvoidOverhyped movie Overhyped actors ( the so called future stars of Bollywood)If you want to waste your time , then this movie is perfect"}, {"id": 268, "text": "Bad movie. Story is all over the place. Ananya can't act. I don't think it's her voice either. Imagine an actor in such a movie can't even use her own voice to act! Ishan is hamming and mediocre acting in this.Clownery all around. Avoid Yaar."}, {"id": 269, "text": "Hy guys Don't weast your money and your time its totally bakwash"}, {"id": 270, "text": "Don't watch this. These are the Nepo kids. They don't know how to do Acting. Enter in the bollywood with compromise with direcor and producer to take movies. These are druggies."}, {"id": 271, "text": "This movie is unwatchable you simply can't think of watching it on screen. It's too bad. Actors are worst. Acting is becoming a joke."}, {"id": 272, "text": "Worst movie, if you want to waste your time than you can watch this horrible movie."}, {"id": 273, "text": "Chunky Pandey ask your daughter to learn atleast A of acting!"}, {"id": 274, "text": "4 stars only because of Ishaan he acted really well he did full justice to his role, direction fuddu, ananya ki acting fuddu, story bakwaas, punch lines zero. Chhodo bhai mt dekho YouTube pr hi kuchh dekh kr time pass kr lo"}, {"id": 275, "text": "After watching such movies you can get WASTED !!!!!"}, {"id": 276, "text": "As the title goes , film is also Khali Peeli Nothing new the same."}, {"id": 277, "text": "Movie full of boring script,Worst cast, acting and story"}, {"id": 278, "text": "Everyone did good except the main characters of the film.Ishan is a good actor but he was not suitable for this role.Ananya Pandey knows nothing about acting.And The song 'Beyonce sharma jayegi' is a prime example of racism."}, {"id": 279, "text": "Gandya Pandey acting is very redeculas, don't watch this movie."}, {"id": 280, "text": "Rubbish acting plain diloguues no face expressions......"}, {"id": 281, "text": "#BoycottBollybood #Nepotism #Killer #moviesmafia #drugsInBollywood"}, {"id": 282, "text": "Please don't ever watch this movie because it is total waste of time! Ab toh sharmao toda movie banane waalo! Utter nonsense movie!"}, {"id": 283, "text": "Worst movie...actor and actress don't know acting..there are so many talented actors but they cast Star son or daughter ..."}, {"id": 284, "text": "No acting. No storyline. No entertainment. Why make movies like these? Just to promote nepo kids that can't act at all. Maybe spend money on their acting classes and hiring a good writer. I do not recommend this garbage to anyone. Save your brain cells"}, {"id": 285, "text": "Pl don't make such useless worthless waste movies. You all can contribute the money spent on the production on some charity, donation and generosity."}, {"id": 286, "text": "Nothing to watch. Don't waste you time. Name itself says no story. Movie lives up to its name."}, {"id": 287, "text": "Wastage of Money &amp; Precious Time, They r not even utter single word tht makes comedy...."}, {"id": 288, "text": "Movie is fully waste of time and money . don't watch this movie."}, {"id": 289, "text": "We need to give all actors and actresses a chance. Does not matter where they come from or whose kids they are. However, these two do not have any acting skills what-so-ever. Were there auditions held for this movie? If so, how in the world did these two make it through and get chosen? Like another reviewer said, I want my two hours back. Bollywood - you need to stop this nonsense. Put out something worthy. This is not entertainment."}, {"id": 290, "text": "Gobaar movie nothing else is appropriate for this one. Just a result of Nepotism we have struggler here who struggle a lot Anaya pandya what u can expect from her?"}, {"id": 291, "text": "Few things I liked in this movie, but I couldn't remember what was it, so it's an okeish movie 🎥"}, {"id": 292, "text": "Super boring movie flop actor Ananya Pandey first learn acting, she doesn't know acting just came as nepotism"}, {"id": 293, "text": "They don't know acting !! If you really can act then act in live play ( drama ) front of audiences then we will see how you guys speak Hindi and Hindi dialogues. Till then go ask mom dad for pocket money."}, {"id": 294, "text": "Waste of time and your attention. Totally BAKWAAS..."}, {"id": 295, "text": "Worst acting by Ananya Pandey and co-actor . No story no logic . I don't know why people make such movies and cast such rubbish actors . Please don't watch this movie this is a complete garbage 👎👎👎👎👎"}, {"id": 296, "text": "PURI TATTI , GIVING ONE EXTRA STAR JUST FOR JAIDEEP AHLAWAT"}, {"id": 297, "text": "Stop making movies that have start kids. They are not true to their characters the entire film. Send them to an acting school."}, {"id": 298, "text": "Worst acting, worst directing, worst production value worst lead pair worst writing worst lyric worst music and worst experience for watching this worst movie"}, {"id": 299, "text": "Over hyped bad acting plots predictable ruin u r mood"}, {"id": 300, "text": "Don't watch its nepo kid movie, it's bollywood movie who kill innocent people"}, {"id": 301, "text": "It is a toattlyy meaningless movie I have ever seen in my life .in my suggestion don't watch this movie if you watch then you lost 3 hours valuable time such a boring concept and direction .so you in my point of view you don't watch this movie ."}, {"id": 302, "text": "The 3 stars i have given is for that lovely fiat 1100d . Movie has no sense of humour and ananyas acting is hideous. The stunts in the movies are straight from a b class Telugu movie.matlab kuch bhi. Movie has lot of sequence where we feel to throw the phone . Jaideep as yousaf did a great job but got overshadowed by the rest of dumb factors."}, {"id": 303, "text": "Guys watch Friends on repeat instead watching this."}, {"id": 304, "text": "I tried to watch movie but not able to bear more than 5 mins."}, {"id": 305, "text": "Pathetic, worst, ananya is expression less, dont know why she is getting movies"}, {"id": 306, "text": "Worst movie I ever seen in my life just pathetichhfhy vgdhhffh bhgfhjvg bfdthbcfyhjj"}, {"id": 307, "text": "Worst movie ever. Horrible acting by ananya pandey .dont waste time watching it .bollywood please find the real talents."}, {"id": 308, "text": "This movie is a horrible horrible example of senseless drama this movie has nothing to offer it's total time of waste n ananya pandey really neads to find some other profession for her because she sucks in acting skills"}, {"id": 309, "text": "Very depressed with movie and not up-to the expectations the acting is very boring.. Story is not up to the mark."}, {"id": 310, "text": "I was expecting lot from this movie but this is not upto the expectations..the story is not good..bored..overall depressed."}, {"id": 311, "text": "Waste movie. Acting of Ananya Pandey sucks. No Story line."}, {"id": 312, "text": "Bollywood continuing its trend with producing worst movies."}, {"id": 313, "text": "Ananya pandey, goto NSD , spent 4 years learn and may be some actin afterwards"}, {"id": 314, "text": "Get some good deserving people to inact the movies."}, {"id": 315, "text": "Bland and stupid characters with no acting skills starring Actress who claims she has struggled alot. This movie is another disappointment from Bollywood. It's almost time up Bollywood mend your ways or you're doomed! Don't waste 2 hours of your life guys do not watch this horrible thing presented as a movie."}, {"id": 316, "text": "Ananya is too good in the movie. Acting of Ananya litt"}, {"id": 317, "text": "Very bad movie just waste of time not a good story"}, {"id": 318, "text": "Nothing to see anything new, very bad acting and story telling"}, {"id": 319, "text": "Loved the movie and it's so comfortable to watch on Zeeplex"}, {"id": 320, "text": "A terrible film with a trashy plot and inconsistent screenplay. The lead cast delivers a pathetic performance and the potential supporting casts are let down by the poor script.Direction 1.5/5 Acting 2/5 Dialogues 1.5/5 Story 1/5 Screenplay 1.5/5"}, {"id": 321, "text": "Keeping aside nepotism the film should not be rated as the rating has been given..totally a masala entertainer..ishaan and ananya to watch in tapori language was really good to watch..i know the story has some loopholes..but a good movie to watch..please dont say these 1 raters without seeing the movie..please give it a watch everyone.."}, {"id": 322, "text": "Superb experience tha Zeeplex and Khaali Peeli dono ka"}, {"id": 323, "text": "Stay safe at home and watch Khaali Peeli on Zeeplex, easy and comfortable This is fun guys, dual fun ride with Zeeplex and Khaali Peeli Loved the movie and it's so comfortable to watch on Zeeplex Family weekend with Khaali Peeli and Zeeplex, set life Zeeplex pe Khaali Peeli just dekh Rahi hu, start hi kafi achha hai Etna achha movie banaya and easily Zeeplex se dekh sakte Ghar bethe Zeeplex, movies and family"}, {"id": 324, "text": "Say No To Nepotism!! Let us unite to be the part of revolution to throw this Nepotism by products out of Bollywood.. Bollywood sirf inke baap ki nahi hai.. They have to rely on us &amp; Beg to us for their revenue.. &amp; Beggers &amp; are not choosers.."}, {"id": 325, "text": "It really a worthless and senseless movie. I don't know why bollywood created such a shot movies."}, {"id": 326, "text": "Can I give 0 rating plz ? These Nepokids are going to ruin bollywood"}, {"id": 327, "text": "Just like 90% of the movies this industry churns out with one is also utter garbage, but u can go watch it for the cringe factor.%$##%^^"}, {"id": 328, "text": "Such a shame, people of India already began with the title of Boycott bollywood. So called stars are inhuman, they dont have respect for a co star.We cannot put them in Bharthiya samskar. they are Evils."}, {"id": 329, "text": "Justice for SSR , Shame on you bollywood , we want justice for SSR"}, {"id": 330, "text": "Backwaas movie, where are internalizing black or dark skin tone is unpretty and does not fit to the society and the song is compared to Ananya with Beyoncé I mean are this filmmakers out of freaking mind. Where is Beyoncé and the struggle. Beyoncé doesn't even know Ananya."}, {"id": 331, "text": "Jabardast banai hai picture, kaamal Guys, I am telling you,"}, {"id": 332, "text": "This couple is 💥 khali peeli is one time movie Love you Ananya Nice songs"}, {"id": 333, "text": "Story- A little illogical Action- Very impressive Screenplay- Average Acting- Ishan Kattar=ok ok, Ananya pandey=worst"}, {"id": 334, "text": "Loved their chemistry in the movie And acting was real"}, {"id": 335, "text": "Don't watch... save your time and money. Both lead actors are need to go to acting school."}, {"id": 336, "text": "Worst movie ever after Sadak2... Avoid this crappy movie."}, {"id": 337, "text": "Very poor acting by both of them. This is what you get from Nepo kids"}, {"id": 338, "text": "This is not a movie, it's a disaster. Pathetic acting by both the leads, poor storyline and weak direction. Overall it's a mess. Please don't waste your time on this.Instead this watch serious men"}, {"id": 339, "text": "Actor and villian travelled mumbai to UP with in 5 hrs wow lol Story sucks"}, {"id": 340, "text": "Acting: over-acting, or to say lack of right acting, so had to give 1( that too a bonus point coz Jaideep Ahlwat is there) Story: Lame, so had to give 1 Direction: loose screenplay, lack of sense in conjoining scenes and most important it lacks EEE( Entertainment, Entertainment and Entertainment)Could have been in top 5 worst Bollywood movies of this year! Wondering which was worst Sadak or this Khali Peeli movie..."}, {"id": 341, "text": "It's awesome combination Zeeplex and Khaali Peeli for the weekend"}, {"id": 342, "text": "Ishaan Khatter is shining in Khaali Peeli. Sabkuch hath Mai mile toh kyu nai- enjoy this weekend with Khaali Peeli on Zeeplex👍👍"}, {"id": 343, "text": "Must watch with your family to release all the worries"}, {"id": 344, "text": "Superb experience tha Zeeplex and Khaali Peeli dono ka Kitna simple and safe gharpe movies with DTH Stay safe at home and watch Khaali Peeli on Zeeplex, easy and comfortable This is fun guys, dual fun ride with Zeeplex and Khaali Peeli Loved the movie and it's so comfortable to watch on Zeeplex Family weekend with Khaali Peeli and Zeeplex, set life"}, {"id": 345, "text": "Ghar bethe Zeeplex, movies and family Sabkuch hath Mai mile toh kyu nai- enjoy this weekend with Khaali Peeli on Zeeplex👍👍 DTH is so comfortable, m loving Khaali Peeli Enjoy new movies at home with DTH, watching Khaali Peeli, it's fun🔥 God this is what I wanted for the weekend, watch Khaali Peeli guys So much comedy, action, drama, music, watch Khaali Peeli on Zeeplex"}, {"id": 346, "text": "People are just rating it a 1 star just because it is a nepo kids movie ......I really think they should first go and watch the movie..... It's really worth it and a good Bollywood masala movie"}, {"id": 347, "text": "Zeeplex pe Khaali Peeli just dekh Rahi hu, start hi kafi achha hai... Ghar Bethe safety ke sath Khaali Peeli only on Zeeplex - Superb"}, {"id": 348, "text": "I watched After really long time some good masala movie full pesa wasool loved it"}, {"id": 349, "text": "This is fun guys, dual fun ride with Zeeplex and Khaali Peeli Loved the movie and it's so comfortable to watch on Zeeplex Family weekend with Khaali Peeli and Zeeplex, set life Zeeplex pe Khaali Peeli just dekh Rahi hu, start hi kafi achha hai Etna achha movie banaya and easily Zeeplex se dekh sakte Ghar bethe Zeeplex, movies and family"}, {"id": 350, "text": "Fantastic, fabulous ❤, nice work of both actors, love you ananya. Maja aa gya!"}, {"id": 351, "text": "Only thing good is jaydeep's role otherwise total tatti movie."}, {"id": 352, "text": "Nothing better than this in 2020... Actors are good"}, {"id": 353, "text": "Ppl who love Bollywood movies irrespective of if it's made by star kids/ nepotism products, will like the movie to some extent, it's not totally bad, as if ppl were expecting it to be very good. Just chill n stop the hatred, one time watch.... Or just don't watch."}, {"id": 354, "text": "DTH is so comfortable, m loving Khaali Peeli.bhta achi muvi"}, {"id": 355, "text": "Khaali Peeli is a family entertainer, watch And free from boring ness"}, {"id": 356, "text": "Khaali Peeli is a 2020 Indian Hindi-language masala film directed by Maqbool Khan and jointly produced by Ali Abbas Zafar, Zee Studios, Himanshu Kishan Mehra. The films stars Ishaan Khatter and Ananya Pandey with Jaideep Ahlawat"}, {"id": 357, "text": "A big like for direction I didn't expect, but honestly it's very good movie Must watch with your family Maza aajayega and tension Nikal jayega . Dekho and share bhi karna mast hai movie I am honestly telling, it's a nice movie Looks hatke, but overall I like Ishaan in the movie is a 🌟"}, {"id": 358, "text": "Honestly speaking, it's nicely made movie The amazing thing about the movie is leads No place for criticism. loved it Fantastic!!!! Just wow movie Watch and watch it's a worth watch I am telling you, paisa and time waste nai hoga"}, {"id": 359, "text": "Aur kya chhaiye life Mai DTH and this movie Khaali Peeli Apna home weekend set kariye aur DTH pe Khaali Peeli dekho dosto, mast hai 👍 Happy Home weekend - Zeeplex and Khaali Peeli Thank you Zeeplex, aapke wajah se first time gharpe achhese movie dekhne Mili Ghar Bethe safety ke sath Khaali Peeli only on Zeeplex Superb experience tha Zeeplex and Khaali Peeli dono ka"}, {"id": 360, "text": "Mast, simple and Sundar - Khaali Peeli and DTH Aur kya chhaiye life Mai DTH and this movie Khli pili Apna home weekend set kariye aur DTH pe Khaali Peeli dekho dosto, mast hai 👍 Happy Home weekend - Zeeplex and Khaali Peeli Thank you Zeeplex, aapke wajah se first time gharpe achhese movie dekhne Mili Ghar Bethe safety ke sath Khaali Peeli only on Zeeplex Superb experience tha Zeeplex and Khaali Peeli dono"}, {"id": 361, "text": "DTH is so comfortable, m loving Khaali Peeli Enjoy its it's fun🔥 movie God this is what I wanted for the weekend watch Khaali Peeli guys So much comedy, action, drama, music, watch Khaali Peeli on Zeeplex Zeeplex aapke liye nayi movies ke sath comfort bhi h Etna easy and comfortable hai Zeeplex, loved Khaali It's awesome combination Zeeplex and Khaali Peeli for the weekend Mast enjoy Kiya Khaali Peeli, watch on Zeeplex bhailog"}, {"id": 362, "text": "A family movie you can feel very happy after watching it so good to see it"}, {"id": 363, "text": "All stars do very well in this acting way must watch movie"}, {"id": 364, "text": "Its difficult to lose this movie, you will loved it guys watch it now"}, {"id": 365, "text": "What a entertainment in this movie i just foced in every time"}, {"id": 366, "text": "Must watch movie to watch in this pandemic. A real bollywood masala movie"}, {"id": 367, "text": "Highlight of the movie - Ishaan Khatter What else you need in a movie? Best hai Superb, It has everything you expect from a good movie Achhi banai hai movie, direction kaafi achha hai Full on paisa vasool, worth a watch Family entertainer hai ekdum Must watch with your family to release all the worries"}, {"id": 368, "text": "Superb experience tha Zeeplex and Khaali Peeli dono ka Kitna simple and safe gharpe movies with DTH Stay safe at home and watch Khaali Peeli on Zeeplex, easy and comfortable This is fun guys, dual fun ride with Zeeplex and Khaali Peeli"}, {"id": 369, "text": "Im gkag to see this movie i have nere ever seen like this movie"}, {"id": 370, "text": "Stay safe at home and watch Khaali Peeli on Zeeplex, easy and comfortable"}, {"id": 371, "text": "Guys, I am telling you, won't regret for a sec It's a package of masala, comedy and action"}, {"id": 372, "text": "This is fantastic Bollywood movie after many months All you need to entertain yours"}, {"id": 373, "text": "Watching Khaali Peeli on DTH, the movie is awesome. DTH pe movies dekhna easy hai kafi Simple steps and watch Khaali Peeli on DTH Gharme comfortable hoke DTH pe Khaali Peeli dekhiye aur Jeevan Ko jiye😍 Mast, simple and Sundar - Khaali Peeli and DTH Aur kya chhaiye life Mai DTH and this movie Khaali Peeli Apna home weekend set kariye aur DTH pe Khaali Peeli dekho dosto, mast hai 👍 Happy Home weekend - Zeeplex and Khaali Peeli"}, {"id": 374, "text": "Watching Khaali Peeli on DTH, the movie is awesome. DTH pe movies dekhna easy hai kafi Simple steps and watch Khaali Peeli on DTH Gharme comfortable hoke DTH Mast, simple and Sundar - Khaali Peeli and DTH Aur kya chhaiye life Mai DTH this movie Khaali peeli Apna home weekend set kariye aur DTH pe Khaali Peeli dekho dosto, mast hai 👍"}, {"id": 375, "text": "What else you need in a movie? Best hai Superb, It has everything you expect from a good Achhi banai hai movie, direction kaafi achha hai Full on paisa vasool, worth a watch Family entertainer hai ekdum Must watch with your family to release all the worries Jabardast banai hai picture, kaamal Guys, I am telling you, won't regret for a sec It's a package of masala, comedy and action"}, {"id": 376, "text": "Jabardast banai hai picture, kaamal Guys, I am telling you, won't regret for a sec It's a package of masala, comedy and action Loved their chemistry in the movie Just watchedguys, I like this movie I personally like the film a lot Dono ne achhi action ki hai film mai"}, {"id": 377, "text": "I never feel boring in this movie incridble effort to actors"}, {"id": 378, "text": "Thats a great playback and entertainment movie just caught it, must watch"}, {"id": 379, "text": "Or kya chahiye kisi movie se, both actor were nice"}, {"id": 380, "text": "I just!!!! Loved it must watch it guys,one work for khaali peeli-fantastic movie"}, {"id": 381, "text": "People nowadays give reviews by checking the background of actors, by not seeing their skills. Overall it's a good movie, both Ananya and Ishan justified their characters."}, {"id": 382, "text": "Zeeplex aapke liye nayi movies ke sath comfort bhi hai Etna easy and comfortable hai Zeeplex, loved Khaali Peeli It's awesome combination Zeeplex and Khaali Peeli for the weekend Mast enjoy Kiya Khaali Peeli, watch on Zeeplex bhailog"}, {"id": 383, "text": "It's awesome combination Zeeplex and Khaali Peeli for the weekend Mast enjoy Kiya Khaali Peeli, watch on Zeeplex bhailog Dhamal hai dono bhi actors, Zeeplex pe Khaali Peeli machareli hai Jab gharme cinema ka feel mile toh baat bann jaye, thank you Zeeplex for Khaali Peeli!!!👍🔥🔥"}, {"id": 384, "text": "Stay safe at home and watch Khaali Peeli on Zeeplex, easy and comfortable This is fun guys, dual fun ride with Zeeplex and Khaali Peeli Loved the movie and it's so comfortable to watch on Zeeplex Family weekend with Khaali Peeli and Zeeplex, set life Zeeplex pe Khaali Peeli just dekh Rahi hu, start hi kafi achha hai Etna achha movie banaya and easily Zeeplex se dekh sakte Ghar bethe Zeeplex, movies and family"}, {"id": 385, "text": "Lovely movie lovely performance everything perfect.🔥🔥🔥🔥🔥"}, {"id": 386, "text": "Wow great performance by both, Ishaan as well as ananya"}, {"id": 387, "text": "Ishaan Khatter is shining in Khaali Peeli Khaali Peeli is a family entertainer, watch A break from your boring life, must watch Leave everything aside and watch Khaali Peeli"}, {"id": 388, "text": "I personally like the film a lot Dono ne achhi action ki hai film mai Aur kya chhaiye movie Mai, sab mast Ishaan Khatter is shining in Khaali Peeli"}, {"id": 389, "text": "It's a package of masala, comedy and action Loved their chemistry in the movie Just watched guys, it's damn good I personally like the film a lot"}, {"id": 390, "text": "A must watch movie!! Killer Hottttttt bhi and Hit bhi hai movie Ananya is too good in the movie."}, {"id": 391, "text": "Ishaan's acting is stellar and the movie is very entertaining overall!"}, {"id": 392, "text": "I like this film. Full romance, entertaining film."}, {"id": 393, "text": "A typical masala. I don't understand film itni bhi biri nhi hai jitni log ise hate dikha ke 1 de rhe hai,thode bhut glich hai jaise poor songs, boring ending ,first half is very delightful to watch but second half bore krne lgta hai app jldi se ise bhgaa ke khtm krna chahoge .Overall it is a good timepass movie with some comedy and taxi adventure ,i am going with 6/10"}, {"id": 394, "text": "Loved their chemistry in the movie Just watched guys, it's damn good"}, {"id": 395, "text": "Sach me dekhne me full masala movie hai, really you loved it"}, {"id": 396, "text": "Khalli peeli is true blue masala movie!! I loved the movie soo much so andabhakts of ssr disliked the trailer but it doesn't deserve the dislikes! Both ananya and ishaan had done a great job in it The fach is ananya is a good actress but no one accepts it just because she was trolled once and she is a state kid!! But the fact is that she is a very good actor and a beautiful girl 💛"}, {"id": 397, "text": "Khaali Peeli (Black and Yellow Taxi; English: For No Reason) is a decent comic caper that works because of the fast-paced storyline, Ishaan Khatter's electric performance, Jaideep Ahlawat's presence, and the flipflop screenplay style that keeps you occupied. It has its fair share of ups and downs (mostly cringeworthy sequences involving Ananya Pandey's antiques) but it passes muster and I was able to satisfactorily finish it. The story is the usual, about runaways with money in the bag, but the Mumbaiya dialogues and the rusty settings makes it appealing and worthwhile. Give it a watch if you have a Zee5 subscription. Grade C."}, {"id": 398, "text": "The plot is very 1980ish with very bad performances and music."}, {"id": 399, "text": "Kareena Kapoor showed us the way by telling us that nobody is forcing us to watch their movies and we shouldn't go, if we don't like it.Yeah well Kareena, advice accha laga. Nahin dekha yeh 3rd class movie. Phir bhi review denge. Jo ukhaadna hai ukhaad lo.Bollywood ko public ne banaya. Ab dekho public kaise tum logon ko sadak pe laati hai."}, {"id": 400, "text": "Don't believe in the negative reviews. It's an awesome movie for Bollywood fans. Enjoyed it thoroughly. Just go for it."}, {"id": 401, "text": "This movie is about arun away taxi driver who picks up a girl who is also running away.The girl turns out to be his chldhood friend and they travel together. This movie is about how they tackle the problems they both have. It's a good movie for light hearted people to enjoy.I don't know why it's rating is so low."}, {"id": 402, "text": "This is no movie - Just nepotism and promotion of these useless and talentless Underserving actors like Ananya Pandey. Practically, this film feels like a khichdi made from 2-3 plots of old Indian films."}, {"id": 403, "text": "A must watch movie!! Killer Hottttttt bhi and Hit bhi hai movie Ananya is too good in the movie. Highlight of the movie - Ishaan Khatter What else you need in a movie? Best hai Superb, It has everything you expect from"}, {"id": 404, "text": "This is a full to Bollywood movie and Ananya looks stunning and has showed that she is the best in her generation and Ishaan has also given his best both of them rock together."}, {"id": 405, "text": "Regular hindi masala movie... one time watch!! Some good comedy sequences, decent dancing and action...Dont look for a meaningful story.... but if ure a masala movie fan then you definitely dont look for meaningful stories"}, {"id": 406, "text": "Must watch with your family to release all the worries Jabardast banai hai picture, kaamal Guys, I am telling you, won't regret for a sec"}, {"id": 407, "text": "Superb, It has everything you expect from a good movie Achhi banai hai movie, direction kaafi achha hai"}, {"id": 408, "text": "What else you need in a movie? Best hai Superb, It has everything you expect from a good movie"}, {"id": 409, "text": "Loved it!!! This movie is definitely rocking. Damn good guys, watch it One work for Khaali Peeli - Fantastic Awesome work by Ananya and Ishaan The best part of the Khaali Peeli is direction"}, {"id": 410, "text": "Casting and direction are selling points, watch A must watch movie!! Killer Hottttttt bhi and Hit bhi hai movie Ananya is too good in the movie. Highlight of the movie - Ishaan Khatter"}, {"id": 411, "text": "Interesting movie caught up in the nepotism storm. Hope people realize the effort taken in the making of a film by lot of people at all levels. But people seem to have judged the film unfairly because of the Bollywood debate.The film is fairly entertaining and engaging. So recommend that people watch it and then give review."}, {"id": 412, "text": "Wow I just loved this movie totally entertaining movie......"}, {"id": 413, "text": "I like this movie and Annanya is damn cute And also like the couple."}, {"id": 414, "text": "It's a fantastic movie.you can watch this fun movie and acting is superb."}, {"id": 415, "text": "I didnt actually watch the movie, just came here to see the reviews to decide whether or not to watch but saw alot of 10 star reviews with the same comment with paisa wasool he. How many people think that its the same person making multiple accounts to raise the rating. And my advise to that guy. Atleast thoda variety rakho yaar. Dont make it so obvious that u r the same person across multiple accounts."}, {"id": 416, "text": "Don't miss this film. Go and watch it. This is amazing film."}, {"id": 417, "text": "Full Paisa vasool movie h Entertaining, lovely movie I like it."}, {"id": 418, "text": "Lovely Awesome Just watch it because this is familiar film"}, {"id": 419, "text": "Don't waste your time, just go and watch. This is a amazing and entertaining film"}, {"id": 420, "text": "Full dhamal movie hai. I like it. I much say, just watch it."}, {"id": 421, "text": "It is a refreshing movies , after much time this kinda movie has came which has a good story, and Ishaan did very good acting and ananya of course, I will suggest to watch it once ."}, {"id": 422, "text": "Awesome Bollywood actress Asin hot photo gallery at instant messaging and"}, {"id": 423, "text": "Quality inn express hotel to jan khulega to jan khulega to be"}, {"id": 424, "text": "Very good product of all seens on the but submit your activity"}, {"id": 425, "text": "Very good nice sons are there and I loved the chasing scene..."}, {"id": 426, "text": "I personally liked the movie cause of ananya pandey"}, {"id": 427, "text": "A break from your boring life, must watch Leave everything aside and watch Khaali Peeli Vasool hai boss, mast action, comedy and fun"}, {"id": 428, "text": "Khaali peeli is getting unnecessary hatred all over. I know its not a perfect film, but it's very entertaining right from the beginning. The makers know what they are making. A throwback to 90s masala film. Ishaan khattar was energetic as blackie. Ananya pandey was not bad. The best performer was jaideep ahalawat and the child actors of ishaan and ananya. If you switch off your brains and hatred towards nepokids then you will enjoy khaali peeli."}, {"id": 429, "text": "Lovely couple Beautiful Ananya Can't wait for this movie....."}, {"id": 430, "text": "I have score this 4 only for efforts of Eshaan Khaatar as a dancer and performer. The only good thing about this movie is its title Khaali Peeli which justifies it making which is like a casual home video of a road trip. It looks more like a video make by a overenthusiastic vlogger and compiled in into a 2 hr movie."}, {"id": 431, "text": "A good bollywood mass audience move with real 90s touch"}, {"id": 432, "text": "KhaaliPeeli is just awesome, watch it 37. 2 hours of entertainment are worth watch"}, {"id": 433, "text": "Such surreal times! Won't be surprised if the mindless mob get to elect leaders on social media next. Feel like we are living in an episode of Black mirror.The film is a decent watch. It is what you see in the trailer. Maybe a little more. Ishaan is superb and the film holds in most parts. A time pass film is probably what we all need in a time when people are just spewing mindless hatred all around. I really hope this madness ends soon. And I hope less films suffer from this kind of stupidity in the future."}, {"id": 434, "text": "Very nice movie funny dialogues Mumbai language very nice songs all time fun romance , action and drama full Tu thamaka movei ananaya looking very cute and buetifull all time very nice acting of Ananya, Ishan Khattar and jaideepahlawat sir niec movei 😍😍😍😍💖😘😘😎👌"}, {"id": 435, "text": "Honestly speaking, it's nicely made movie The amazing thing about the movie is leads No place for criticism, loved it"}, {"id": 436, "text": "Awesome 👍.. Because ananya is startup the future it is good . Acting is best"}, {"id": 437, "text": "Movie was fun. It a light hearted action packed movie. It's not a bad movie.People are just salty .. #cancelcancelculter"}, {"id": 438, "text": "Khaali Peeli is an action drama wherein a taxi driver picks up a girl on the run and what follows isa crazy, roller-coaster of a ride. His past and present circumstances have made him"}, {"id": 439, "text": "Bahut hi mazedar movie hai maza aa gya yaar lajawab Awesome hai yaar lajawab Awesome Plus Background MuSic 🎶 to watch the event by visiting recording in surveillance station sincerely"}, {"id": 440, "text": "Sabkuch hath Mai mile toh kyu nai- enjoy this weekend with Khaali Peeli on Zeeplex👍👍 DTH is so comfortable, m loving Khaali Peeli Enjoy new movies at home with DTH, watching Khaali Peeli, it's fun🔥 God this is what I wanted for the weekend, watch Khaali Peeli guys"}, {"id": 441, "text": "God this is what I wanted for the weekend, watch Khaali Peeli guys So much comedy, action, drama, music, watch Khaali Peeli on Zeeplex Zeeplex aapke liye nayi movies ke sath comfort bhi hai Etna easy and comfortable hai Zeeplex, loved Khaali Peeli"}, {"id": 442, "text": "Ghar bethe Zeeplex, movies and family Sabkuch hath Mai mile toh kyu nai- enjoy this weekend with Khaali Peeli on Zeeplex👍👍... DTH is so comfortable, m loving Khaali Peeli"}, {"id": 443, "text": "Happy Home weekend - Zeeplex and Khaali Peeli... Thank you Zeeplex, aapke wajah se first time gharpe achhese movie dekhne Mili.. Ghar Bethe safety ke sath Khaali Peeli only on Zeeplex - Superb Superb experience tha Zeeplex and Khaali Peeli dono ka.. Kitna simple and safe gharpe movies with DTH"}, {"id": 444, "text": "Family weekend with Khaali Peeli and Zeeplex, set life..Zeeplex pe Khaali Peeli just dekh Rahi hu, start hi kafi achha hai...Etna achha movie banaya and easily Zeeplex se dekh sakte ..Ghar bethe Zeeplex, movies and family"}, {"id": 445, "text": "DTH is so comfortable, m loving Khaali Peeli... Enjoy new movies at home with DTH, watching Khaali Peeli, it's fun🔥 God this is what I wanted for the weekend, watch Khaali Peeli guys So much comedy, action, drama, music, watch Khaali Peeli on Zeeplex"}, {"id": 446, "text": "Sabkuch hath Mai mile toh kyu nai- enjoy this weekend with Khaali Peeli on Zeeplex👍👍 DTH is so comfortable, m loving Khaali PeeliEnjoy new movies at home with DTH, watching Khaali Peeli, it's fun🔥"}, {"id": 447, "text": "Must wast..Waw..nice actiing.. khattar nd AnanyaMust wast..Waw..nice actiing.. khattar nd Ananya"}, {"id": 448, "text": "Etna achha movie banaya and easily Zeeplex se dekh sakte Ghar bethe Zeeplex, movies and family Sabkuch hath Mai mile toh kyu nai- enjoy this weekend with Khaali Peeli on Zeeplex👍👍 DTH is so comfortable, m loving Khaali Peeli Enjoy new movies at home with DTH, watching Khaali Peeli, it's fun🔥"}, {"id": 449, "text": "Superb experience tha Zeeplex and Khaali Peeli dono ka Kitna simple and safe gharpe movies with DTH Stay safe at home and watch Khaali Peeli on Zeeplex, easy and comfortable This is fun guys, dual fun ride with Zeeplex and Khaali Peeli"}, {"id": 450, "text": "Hottttttt bhi and Hit bhi hai movie Ananya is too good in the movie. Highlight of the movie - Ishaan Khatter What else you need in a movie? Best hai"}, {"id": 451, "text": "Full and entertainment movie bahut mast hai movie Best my movie"}, {"id": 452, "text": "Hottttttt bhi and Hit bhi hai movie Ananya is too good in the movie. Highlight of the movie - Ishaan Khatter What else you need in a movie? Best hai"}, {"id": 453, "text": "Full on entertainment Gazab ka action h 🐶suberrrb"}, {"id": 454, "text": "I love this movie so much Love the actress and actor"}, {"id": 455, "text": "The best part of the Khaali Peeli is direction Casting and direction are selling points, watch A must watch movie!! Killer Hottttttt bhi and Hit bhi hai movie Ananya is too good in the movie. Highlight of the movie - Ishaan Khatter What else you need in a movie? Best hai Superb, It has everything you expect from a good movie Achhi banai hai movie, direction kaafi achha hai Full on paisa vasool, worth a"}, {"id": 456, "text": "Enjoy new movies at home with DTH, watching Khaali Peeli, it's fun🔥... God this is what I wanted for the weekend, watch Khaali Peeli guys.... So much comedy, action, drama, music, watch Khaali Peeli on Zeeplex... Zeeplex aapke liye nayi movies ke sath comfort bhi hai"}, {"id": 457, "text": "Aur kya chhaiye movie Mai, sab mast.... Ishaan Khatter is shining in Khaali Peeli... Khaali Peeli is a family entertainer, watch.... A break from your boring life, must watch"}, {"id": 458, "text": "Lov Ananya...Must watch with your family to release all the worries"}, {"id": 459, "text": "Free me to dekhna hai aur kya chahiye, jao dekh aao"}, {"id": 460, "text": "4Everything is so perfect, must watch A worth watch Ishaan has done a fab job, I watched for him I watched and loved it seriously This is fantastic Bollywood movie after many mont I must say, just watch it Kon kehta Bollywood Mai achhi pictures nai bante, too good Book your ticket and watch now, damn"}, {"id": 461, "text": "Damn good guys, watch it One work for Khaali Peeli - Fantastic Awesome work by Ananya and Ishaan The best part of the Khaali Peeli is direction Casting and direction are selling points, watch"}, {"id": 462, "text": "What else you need in a movie? Best hai Superhit movie lajawab"}, {"id": 463, "text": "KhaliPeeli movie such an excellent and funny movie. Good performance. By ananyapandayy Ishaan khatter ZeeStudios ZEE5India maqbool_khan ishankhatter"}, {"id": 464, "text": "After 6 months in lockdown if you want to watch some fun bollywood masala type movie you can watch it. It's a good/Average type movie"}, {"id": 465, "text": "I had liked the trailor...and honestly the movie is decent too ..I feel all the 1star here is a bit too harsh...the story is quite easy breezy, nicely told &amp; directed...Ishaan &amp; Jaideep are superb as always ..but the suprise package is Ananya( havnt been able to watch her for more than 10mins till I saw Khaali Peeli). She has improved a lot as an actor...d kids hv done a good job too.overall a nice one time watch -6.5/10"}, {"id": 466, "text": "AwesomeMovieVery nice songs in this movie Amazing movie"}, {"id": 467, "text": "Very nice movie Amazing movie Awesome movie AwesomeMovieVery nice songs in this movie Amazing movie"}, {"id": 468, "text": "Awesome movie Very nice songs in this movie Amazing movie"}, {"id": 469, "text": "Mass movie Entertaining.. Action Thrilling love story Best film ever seen.. jaideep alhawat ishaan khattar"}, {"id": 470, "text": "AwesomeMovieVery nice songs in this movie Amazing movie"}, {"id": 471, "text": "Very nice acting Ishan and Ananya Awesome movie Bahut mast"}, {"id": 472, "text": "Sabkuch hath Mai mile toh kyu nai- enjoy this weekend with Khaali Peeli on Zeeplex👍👍"}, {"id": 473, "text": "Casting and direction are selling points, watch Casting and direction are selling points, watch"}, {"id": 474, "text": "Tum log bhi video dekho Waise video mst hai Niceone video bro"}, {"id": 475, "text": "Very nice movie amazing movie very very very nice The amazing thing about the movie is lead. To good movie"}, {"id": 476, "text": "I luv this movie.... acting are too good on this movie... mind-blowing music... seriously guys this movie is very entertaining"}, {"id": 477, "text": "The amazing thing about the movie is leads No place for criticism, loved it Fantastic!!!! Just wow movie Watch and watch it's a worth watch I am telling you, paisa and time waste nai"}, {"id": 478, "text": "Loved it!!! This movie is definitely rocking. Damn good guys, watch it"}, {"id": 479, "text": "Must watch with your family to release all the worries Jabardast banai hai picture, kaamal"}, {"id": 480, "text": "From action to cast selection everything is best The best part direction, watch for that"}, {"id": 481, "text": "Bollywood masala is back A refreshing movie to change your mood Damn good movie hai Mind-blowing hai picture and Ananya mast acting ki hai"}, {"id": 482, "text": "Loved everything in the movie Watch it guys, it's paisa Vasool Yeh kaafi time bad aisi movie aayi hai Khaali Peeli is"}, {"id": 483, "text": "Paisa and time dono wasool hai Trust me, this is a hot movie Mirchi, Masala sab hai movie mai Sahi banai hai movie,songs are good Loved it for its direction"}, {"id": 484, "text": "Watch it now, you will love it Honestly speaking, it's nicely made movie The amazing thing about the movie is leads"}, {"id": 485, "text": "O loved it that waiting for part 2 I hope eska part 2 aaye, maza aaya"}, {"id": 486, "text": "O loved it that waiting for part 2 I hope eska part 2 aaye, maza aaya Very well made and dir"}, {"id": 487, "text": "O loved it that waiting for part 2 I hope eska part 2 aaye, maza aaya Very well made and directed bollywood film It's a change in the style of movies, like"}, {"id": 488, "text": "O loved it that waiting for part 2 I hope eska part 2 aaye, maza aaya Very well made and directed bollywood film It's a change in the style of movies, like This is just too interesting Bahot interesting hai movie, dekho Interesting!!!! Loved"}, {"id": 489, "text": "Personally like the film a lot Dono ne achhi action ki hai film mai Aur kya chhaiye movie Mai, sab mast"}, {"id": 490, "text": "Personally like the film a lot Dono ne achhi action ki hai film"}, {"id": 491, "text": "Personally like the film a lot Dono ne achhi action ki hai film mai Aur kya chhaiye movie Mai, sab mast"}, {"id": 492, "text": "Loved it!!! This movie is definitely rocking. Damm good guys, watch it"}, {"id": 493, "text": "Guys, I am telling you, won't regret for a sec It's a package of masala"}, {"id": 494, "text": "Guys, I am telling you, won't regret for a sec It's a package of masala, comedy action or love"}, {"id": 495, "text": "Full on dhamal movie h Everything is so perfect, must watch"}, {"id": 496, "text": "This Video Hai Been super and so byutiful and hote"}, {"id": 497, "text": "I love this movie ! It is cool! I love it! Ananya Panday is the best"}, {"id": 498, "text": "Vasool hai boss, mast action, comedy and fun Full to dhamal movie hai"}, {"id": 499, "text": "Superb, It has everything you expect from a good movie Achhi banai hai movie, direction kaafi achha hai Full on paisa vasool, worth a watch"}, {"id": 500, "text": "Full on paisa vasool, worth a watch Family entertainer hai ekdum Must watch with your family to release all the worries"}, {"id": 501, "text": "Superb, It has everything you expect from a good movie Achhi banai hai movie, direction kaafi achha hai"}, {"id": 502, "text": "Just watched guys, it's damn good I personally like the film a lot Dono ne achhi action ki hai film mai"}, {"id": 503, "text": "The best part of the Khaali Peeli is direction Casting and direction are selling points, watch"}, {"id": 504, "text": "Superb, It has everything you expect from a good movie Achhi banai hai movie, direction kaafi achha hai"}, {"id": 505, "text": "Must watch with your family to release all the worries Jabardast banai hai picture, kaamal"}, {"id": 506, "text": "Highlight of the movie - Ishaan Khatter What else you need in a movie? Best hai Superb, It has everything you expect from a g"}, {"id": 507, "text": "It's a package of masala, comedy and action Loved their chemistry in the movie Just watched guys, it's damn good"}, {"id": 508, "text": "The best part of the Khaali Peeli is direction Casting and direction are selling points, watch"}, {"id": 509, "text": "ADVENTURE, ROMANCE , COMEDY . BRILLIANT ACTING AND DANCING SKILLS BY ANANYA AND ISHAAN AND AMAZING STORYLINE . MUST WATCH ."}, {"id": 510, "text": "I watched it many times but I am not boared and enjoy it many times"}, {"id": 511, "text": "Guys, I am telling you, won't regret for a sec It's a package of masala, comedy"}, {"id": 512, "text": "Khaali Peeli is a family entertainer, watch A break from your boring life,"}, {"id": 513, "text": "Khaali Peeli is a family entertainer, watch A break from your boring life,"}, {"id": 514, "text": "Ishaan is doing just like his brother, i love them"}, {"id": 515, "text": "Khaali Peeli is a family entertainer, watch A break from your boring life, must watch"}, {"id": 516, "text": "Ishaan is doing just like his brother, i love them"}, {"id": 517, "text": "It's a package of masala, comedy and action Loved their chemistry in the movie"}, {"id": 518, "text": "Superb, It has everything you expect from a good movie Achhi banai hai movie, direction kaafi achha hai"}, {"id": 519, "text": "Ishaan is doing just like his brother, i love them"}, {"id": 520, "text": "Fabulous movie Amazing mst h movie Rocking role nice"}, {"id": 521, "text": "Ishaan Khatter is shining in Khaali Peeli Khaali Peeli is a family entertainer, watch"}, {"id": 522, "text": "Nice movie all performance is good Both are is looking gorgeous"}, {"id": 523, "text": "Kya dialogue h mst work kia h ishaan aur ananya ne Gajab kya dance maza aa gya movie full on entertainer"}, {"id": 524, "text": "Like to watch thi movie i really love this movie so so much"}, {"id": 525, "text": "One of the best performance by both actor, action hai comedy hai, romance hai aur kya chahiye"}, {"id": 526, "text": "Maine khud is movies pe 10 rating kiya hai kyu ye movie hme bahut hi achha lga maza aa gya yaar Awesome"}, {"id": 527, "text": "Loved their chemistry in the movie Just watched guys, it's damn good"}, {"id": 528, "text": "Damn good guys, watch it Aur kya chhaiye movie Mai, sab mast"}, {"id": 529, "text": "It's not a movie. It's a sucide bomb. Watch at your own risk."}, {"id": 530, "text": "Full on dhamal movie .....zbr10 movie h boss Paisa wasool movie"}, {"id": 531, "text": "No need of review... ppl will anyways give lowest rating for this movie."}, {"id": 532, "text": "Khaali Peeli is nothing but an extension of those already proven mass masala entertainers. Bollywood is obsessed with telugu - tamil movies that even their tv channels are ruled by dubbed south indian movies. Khaali Peeli follows the same template of those timepass flicks but to be honest it's not as bad as it looks.Khaali Peeli is the usual hero-heroine-villain chase with lots of guns,violence, and of course romance! If you're searching for something unique then this chase isn't for you.This bumpy ride moves at an uneven pace with a flat writing. Yash Kesarwani,Sima Agarwal duo's non-linear narrative confuses at most places but is unique especially the switching of timelines. The initial half of the film is a fun watch but sluggish presentation in the latter portion spoils the whole fun of this journey. Ishaan Khatter gets into the skin of the character smoothly and has given a noteworthy performance. He excels with his sizzling dance movies and is fierce in fight sequences. Ananya Pandey as the glam doll finds it hard to emote yet does a pretty decent job. Jaideep Ahlawat's baddie is nothing sort of different from those badly written commercial villains.Khaali Peeli offers some well choreographed action blocks which would have created more impact if explored well. Songs act as a speed breaker and are not worth remembering. You can expect all the cinematic clichés in this old school popcorn entertainer. If you're into watching mindless formulaic entertainers then this debut venture of Maqbool Khan may impress you."}, {"id": 533, "text": "KHAALI PEELI (2020) : MOVIE REVIEW -There is something called typical notion about Masala Films that makes it generally below par even if the potential or actual results are better than criticism but it all goes in bucket when we as an audience get to see a perfect Masala Entertainer in all manners. Khaali Peeli came with Average expectations already therefore there was no burden on it to carry still somehow it manages to hold for 2 hours. That's a big win sarcastically. It was almost certain to end as a decent film irrespective of what kind of masala if offered but like said above, that typical notion spoils it big way.Khali Peeli is story of 2 Taporis (best word to express the 2 main characters), who were once a childhood sweethearts, meets each other under disastrous circumstances. One's escape is a trap for the other and other's escape is all together a different mess correspondent to the main villain of the show. The ending seems bit stretched and dragged because all the city side localism suddenly goes into Village to recall some dark memories of past.Ishaan Khattar seems to have found something of his own in Khaali Peeli. He as Blackie gets free hands to try on and certainly looks impressive because of realistic looks and accent. Ananya Panday as Pooja was neither impressive nor disappointing. The best outcome from the cast members is Jaideep Ahalawat who plays the main villian and the supporting cast is okay-okay. The script allows too many past stories and all are predictable hence it all looks repetitive and irritating especially in the climax when all of sudden it all travels 10 years back for the sake of emotional drama. Dialogues are fine, cinematography is average, editing is decent and Music is dull.Director Maqbool Khan is a new name in the game and definitely needs to learn a lot while completing a Film. It is just not about starting the film well, or pacing it well but it is more important to end it well. Khaali Peeli begins nicely and unexpectedly goes on smoothly without any big issues but then it fumbles towards the end. At one moment it felt like a surprising decent film untill the last 20 minutes went for some extra curricular activities away from the basic grounds of the film. Overall, a below average and almost ignorable film which might hold you for 2 hours but mostly gonna waste your time for the sake of nothing.RATING - 4/10*"}, {"id": 534, "text": "It doesn't matter if Ananya and Ishaan are nepotistic actors or not, it is clear, this is a great masala film! One of the best films I've seen. The storyline, the songs, and the acting of the players are amazing! Congratulations to Maqbool Khan, Ishaan Khattar and Ananya Panday for doing their job well.Maybe, Ananya did not show an outstanding performance when appearing in the films Student of the Year 2 and Pati Patni Aur Woh. But this time the girl was completely different! Ananya has improved in her acting part, although Ananya's dance is still a bit stiff, it is worth appreciating because she put in the effort. For Ishaan, he did his job well. His acting is really amazing. His dance moves really wow me.As for the song, the two songs from this film are truly extraordinary. The music is fresh and makes me dance! Good job for Mr Vishal Shekhar who has composed the music in this film wonderfully. I love Duniya Sharma Jayegi's song (and it will be my favorite forever!) This is the best film of Ananya Panday and also Ishaan Khattar. I can't stop thinking, how there are stupid people who boycott this film just for reasons that are not proven true. To the people reading this, I hope you will understand what I am saying, that Sushant died not because of nepotism in Bollywood. It had absolutely nothing to do with Sushant's ill-fated death. Don't blame nepotism. Because you are the ones who make them successful, so that (maybe) hinder Sushant's career. You have brains, and please, make the best use of that gift from God.I guess this is all I can say. I don't know what else to say. And I hope Sushant's silly fans can understand what I'm saying."}], "reviews_amount": 535}