{"name": "Ma Rainey's Black Bottom", "titleId": "tt10514222", "reviews": [{"id": 0, "text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog :)Usually, at the end of each year, I prepare my watchlist for the next twelve months. Obviously, no matter how many movies I add to the list, I know dozens of more films will be announced and released throughout the year. Ma Rainey's Black Bottom is one of them. I didn't know a thing about this flick, but it received the always interesting awards buzz, which turned it into a mandatory viewing before Christmas comes around. I went in knowing only one thing: this is Chadwick Boseman's (Black Panther, Avengers: Infinity War) last appearance after he passed away a few months ago. I really didn't know what to expect from this Netflix's Oscar-bait, but I was afraid that Boseman's nomination chances were high only due to what happened in real-life instead of him truly deserving that recognition...Well, I can safely and confidently write that Boseman delivers his career-best interpretation, and it wouldn't be unfair for him to get tons of awards posthumously. From an impeccable accent to his mind-blowing emotional range, passing through long monologues and uncut takes effortlessly, Boseman is the strong glue that holds everything in place. What seems, at first, a hangout movie (narrative without a clear central plot) turns into a character-study. Levee wants to follow his dreams, do what he does best in his own conditions and with his personal interpretation of music and soul. Boseman incorporates this character seamlessly, delivering a memorable performance that I hope will be remembered as a worthy Oscar winner if this situation ends up becoming true.Even though Boseman is the actor that shines brighter, every single one is absolutely outstanding. Viola Davis shares the main spotlight with him by representing the (real-life) iconic blues singer, Ma Rainey. To be completely honest, I didn't know who this singer was nor how she impacted soul music. Ruben Santiago-Hudson first feature-film screenplay is packed with entertaining banter between the band members but also with heartfelt, gut-wrenching, shocking monologues that deeply explore a character's past and personality. Davis tackles every single line of hers with brutal intensity and extreme expressiveness, constantly offering 200% of her energy.George C. Wolfe (first movie I see of his) demonstrates exquisite control of every scene and elevates the dialogue-driven narrative with an exceptional balance of tone and pacing. Tobias A. Schliessler's camera lingers beautifully on the actors, allowing them to showcase their abilities but also helping the viewer feel enthralled with their words by not creating any unnecessary technical distractions. Andrew Mondshein's editing also contributes a lot to the smooth pace that the film warrants, but it's Branford Marsalis' inspiring, soulful score that will probably encourage most viewers to enjoy the overall movie. Technically, I can't point out a single issue. Huge praise for the appropriate costume design and overall production value.Honestly, I don't really have much to complain about. It might not have a conventional main plot, but it's also far from being a nothing film. As I mentioned above, the banter between Toledo (Glynn Turman), Cutler (Colman Domingo), Slow Drag (Michael Potts), and Levee is incredibly amusing and genuinely hilarious at times. However, it goes down through an unexpected dark path, ultimately culminating in a surprising finale. Every character has their own monologue containing details of their personal lives, which I regularly felt interested in, despite the repetitive structure. It works as a character-study, mainly about Levee and Ma Rainey, but also as a fun, good time that goes by quicker than I initially anticipated.In the end, Ma Rainey's Black Bottom is going to be forever remembered as Chadwick Boseman's last role. Call it destiny, but it's, undoubtedly, Boseman's career-best performance. Hopefully, if he ends up winning an Oscar posthumously, this won't be identified as a charity recognition but as a worthy, fair, triumphant celebration of his inspiring, impactful talent on-screen. Viola Davis also shines in this uncommon narrative, which focuses its spotlight on long, uncut, engaging monologues, captivating dialogues, and entertaining banter, all handled effortlessly by every actor involved. Despite the absence of a clear central plot, it's closer to a character-study than to a hangout flick. George C. Wolfe and Ruben Santiago-Hudson deliver a technically flawless movie with an excellent balance of its tone and pacing but also boasting impeccable cinematography, seamless editing, and a soulful score. It's definitely a serious contender for the awards season, so make sure to save ninety minutes of your Christmas season to enjoy this simple yet surprising story.Rating: A-"}, {"id": 1, "text": "One of the best movies of the year!! Chadwick deserves an Oscar for this performance! Viola Davis is amazing! An all around great cast."}, {"id": 2, "text": "I thought it was very similar to Fences (2016), another August Wilson adaptation and unfortunately in both I found the dialogue very tedious. The performances in both are good, in this particularly Chadwick Boseman - he has he most to work with. I didn't find any part of the narrative compelling. I enjoyed the music, but so little of the runtime is spent actually playing music. Instead there's an awful lot of wordy bickering. I feel like 50% of the lines could have been cut and you'd be left with the same film."}, {"id": 3, "text": "Immediately, as a viewer, I was transported to another time, another world of music and race and tension of which I am unfamiliar. But I know good performances. This cast was outstanding; and I am going to just brush over Viola Davis and Chadwick Bozeman because I know they will be celebrated for their work in this project. But Colman Domingo, Glynn Truman and Michael Potts all deserve equal attention for being the seams that keep this performance masterpiece together.Outstanding moment of history and music and class and culture very well recalled, presented and preserved. Besides the outstanding acting, there is an unsurpassed script; the dialogue is head-spinning! The cinematography and sets are superior by every measure. Can't wait to see it again after sampling some of Ma Rainey's music."}, {"id": 4, "text": "Great acting but no story; I was ready for the ending after thirty minutes-just a lot of mundane situations and conversations that are forgettable. I Will not repeat this movie."}, {"id": 5, "text": "I love Chadwick Boseman as an actor and got emotional seeing him in this. Especially with how skinny he was. Viola Davis did good job as well in her role. However the movie is incredibly draggy, the humor was dry, and nothing really happens at all. It just diddn't do it for me."}, {"id": 6, "text": "This August Wilson adaptation is set in Chicago in 1927, and follows a blues singer, Ma Rainey (Viola Davis) who is recording music in Chicago at the time. The film focuses on the dynamics between her, a white manager, and several people that work with her during the recording session, such as a horn player (Chadwick Boseman.) The film's performances are excellent. Viola Davis shows a strong range of emotion and wit, and Chadwick Boseman's charisma and command of his role are superb. It is an almost incomprehensible tragedy that Boseman passed away suddenly this year, and this is (sadly) his final performance. Wilson's dialogue is handled very well in the film; while the film generally feels like a play, it is fully engaging and properly paced. The dialogue is able to appropriately develop the characters, while also honestly coming to terms with the racial tensions and systemic discrimination that sadly plagued society during this period in time. The film also has terrific aesthetic values of the time period, from production design to costumes to cinematography. These aesthetics are not negatively impacted at all by the fact that the film largely takes place in a handful of mostly confined spaces.While a relatively brief film in duration (94 minutes,) the film never feels too brief or unsatisfying. The pacing is deft yet thorough, appropriately contextualizing its characters and the situations they find themselves in--all while tying in to the blues music and the impact it has on the characters. Its conclusion is powerful and stirring, and appropriately feels like a fitting end to the narrative. The only major criticism I have of the film is that much of the film is relatively light on substantive plot, which does not always make the story as impactful as it could be. Even though the dialogue between characters is outstanding, some of the narrative could have used more meat and potatoes plot points to further evolve the course of the story. Otherwise, this is a powerful film that is well worth seeing. 7.5/10"}, {"id": 7, "text": "The opening scene depicts five characters over-talking each other at the rate of knots and talking nonsense to boot. The film is based on a play and - sadly - has the feel of a play. The story is dull. Snoozefest."}, {"id": 8, "text": "This film is full of good performances. Chadwick Boseman and Viola Davis shine in this movie. Chadwick was incredible. I am very happy to see him one more time, and what a performance he gives. The story felt a bit short. The story is not that special but I'll say it again, the performances are so good. That's why I give this film a 7.Thank you Chadwick Boseman, R.I.P."}, {"id": 9, "text": "Netflix's Ma Rainey's Black Bottom is a show of music and performances, bringing Viola Davis into yet another great performance, even though spending most of her time in a room the film manages to get the most out of its actors, Chadwick Boseman who unfortunately left us, acts like never in his career and has chances to go to the Oscars. Ma Rainey's Black Bottom gets right to the point and brings a great narrative and is among the best of 2020."}, {"id": 10, "text": "I love Viola Davis. I was so disappointed. First, this play should not have been made into a movie. It doesn't work. Plays do not convert into movies easily and this one fails monumentally. Poor Viola. This was the worst thing I have ever seen her do. Perhaps I expected too much because of the title. It was not about her, but the trumpet player played by Chadwick Boseman. He was ok, but the script was bad. Again, the problem was trying to make a play into a movie."}, {"id": 11, "text": "I would have much rather seen a proper biopic of Ma Rainey than this movie version of a play where, with the exception of one chap banging on and on about his shoes, very little actually happens."}, {"id": 12, "text": "Where was the musical story of Ma Rainey? Don't look here. After a brief exciting open to this film you are ready to be taken on this journey to discover this legendary title woman and her music. Yet, the journey ends or really never begins.Talent can save this misleading title and trailer. It's a shame. It could have been an enlightening, entertaining joy ride!"}, {"id": 13, "text": "This did not even feel like a play that was adapted for film. It really was just a play that was filmed. The high accolades that most viewers give is due to their love for Viola and Chadwick (which I share), but even their performances could not save the movie. Endless dialogue to drive the story (no real story here) forward. I was really, really looking forward to this, but it was sadly extremely disappointing."}, {"id": 14, "text": "This movie was loaded with great acting for sure. But the messages throughout this movie from start to finish cannot be overlooked."}, {"id": 15, "text": "Some guys arguing in a basement. And it goes on and on and on till you hit the forward button. It is more like a really boring 'educational' theaterplay aimed at 'white people'. Why not just make a movie? The scenes wirh Ma Rainey are quite wonderful, filled with tension and power. But those scenes are also too occupied with being a lament of afroamerican experience in the past. Actually the first scene of the movie made me look forward to seeing it. Ma Rainey in a steaming hot rural party tent. People waiting in long lines in the dark southern night to get in. That is 'movie'! Not the forlorn and uninteresting bickering between the band members. Don't tell it. Show it!"}, {"id": 16, "text": "I had never heard of Ma Rainey until I watched this movie. After watching I read some articles about the movie and Ma. Though I still know little about her it is my opinion that this movie does a great disservice to her. Ma was known as the Mother of Blues. She was one of the first recorded blues singers and sang with the likes of Louis Armstrong. None of this is included in the movie. No mention what so ever. The movie in fact is based on a play and the movie is pure fiction based on a real woman. I would have much preferred seeing a movie based more on the facts concerning Ma Rainey."}, {"id": 17, "text": "It's a beautiful movie. The performances are amazing and mind blowing specially by Viola Davis, that gives the year's best female performance, and Chadwick Boseman. The character study is great as well. The screenplay is awesome with many interesting and powerful lines. Cinematography, music, costumes and locations are all nice too. Ma Rainey's Black Bottom is a very nice movie but still it feels like it's missing something."}, {"id": 18, "text": "Everything in the film is perfect except for its poor direction and lack of story. Chadwick Boseman and Viola Davis are spectacular, especially the former. He should get all awards for his final role which was nothing but a masterclass in acting."}, {"id": 19, "text": "It does not take a genius to figure out who I'm talking about."}, {"id": 20, "text": "A cinematic masterpiece deserves to be on big screen"}, {"id": 21, "text": "Going into this I was expecting a complete biopic, but it felt almost like a musical. I didn't realize initially that it is based on the play by August Wilson, which made complete sense as to why it was so limited in production scope; meaning the entire film was based on a single recording session from the artist's life.Overall, the acting was superb as one would expect from the cast lineup. Boseman, Davis, Turman and the rest brought their A games to the film and the monologues blew me away. Still, I think Mo'Nique's depiction of Ma Rainey in Bessie alongside Queen Latifah was just as good, if not a little bit better. Plus, Bessie gave a slightly broader look at Ma Rainey than this film adaptation provided. For that reason, I would have liked to see more of Ma's life story in the form of a complete biopic. Boseman gave an outstanding final performance!"}, {"id": 22, "text": "I give it 7 stars because I LOVED MA! The movie actually made me do my research because I was not familiar with her but she was a strong amazing black women. She did not take any b.s from ANYBODY! Watching the movie i was actually taken back by how she did not take any b.s from anybody including white people which this was back in the 1920's so i could not believe how she was acting/talking to ppl. I loved it!!!! I hate the way the movie ended i was like, wait that's it?! I feel like they could have ended it better. I just really wanted to see more of it! Viola always does her thing she did a great job! And of course Chadwick was amazing! It was so sad watching it for me because i know this was his last movie before he passed away... R.I.P Chadwick. All the cast did a great job! It did have some slow moments, some sad moments but it definitely kept me watching! Check it out for yourself"}, {"id": 23, "text": "Amazing!! Chadwick and viola were both incredible and deserve recognition for it."}, {"id": 24, "text": "I was impressed by the ability of the actors. It's a group of veteran actors providing us with their best work!"}, {"id": 25, "text": "Honestly a very sad way to end Chadwick Bosemans legacy, it hurts my soul to think that this may be the last role I might see him in, his acting is stellar as always but the movie had no direction, no topic, no purpose and no conclusion the story seemed to start well and then boom! Flat on its face it all falls down. What a waste"}, {"id": 26, "text": "For an hour and a half long movie the first half hour was just lame dialogs. First the 4 musicians talk about shoes, having fun etc. Any sane director would have cut that out but I guess if the rest of the material has no more substance there's not much the director can do. Then there's a minor fender bender before Ma finally shows up. You wonder why this is important in a biopic. There's more lame dialog than music in this. One must wonder what the point of the movie was. It tries to be funny but ends up being plain stupid. As a Ma Rainey fan I am outraged. I was excited to see Chad Boseman in his last role but his character is just annoying and has no depth through no fault of his own. I doubt Ma Rainey was that awful in person to everybody. She was not a superstar and could she really torture people like that in 1927 including a police officer? Her character seems way exaggerated. My verdict is this movie is annoying and boring. There's actually very little music in it. I couldn't even finish it. I could only take half of it. I think actors should stop trying to write screenplays."}, {"id": 27, "text": "I watched this and was captivated from start to end. This is all about the relationships between people. Baseman's performance was captivating and viola Davis excelled."}, {"id": 28, "text": "This movie stands out mostly due to the incredible acting by not just Viola and Chadwick but Glynn Turman, Colman Domingo, Michael Potts, Taylour, Dusan and Shamos as Irvin was really quite good too. The acting really blew me away. The dialogue was intense, fast paced and none of them missed a beat! Oscars please. The wonderful music, the glimpse into the Black struggle, the sad tale... I was moved, really quite moved. If they read these.. Thanks, that was awesome. Viola wow just wow. Turman incredible. Chadwick rest in peace"}, {"id": 29, "text": "The movie is a filmed adaptation of the stage play. It feels as though the performers were all on stage showing their best. The movie could have fleshed out some more of the other character,but it wasn't really necessary.Each performer had a monologue that felt raw and showed the various themes that were exploited in the movie."}, {"id": 30, "text": "Two things dominate this film. viola davis and chadwick Boseman"}, {"id": 31, "text": "This movie is all about the performances and Viola Davis and Chadwick Boseman absolutely delivered. While Viola Davis doesn''t have any huge and flashy scenes, she still manages to disappear into her character and deliver one of her best performances. Chadwick Boseman got a handful of powerful scenes to work with and he also performed them all brilliantly. You can tell he put his heart and soul into every word and I'm glad his performance is immortalized on screen so we can admire it forever.Yes, this film feels more like a play in the same way that Fences did in 2016, but I don't think that matters because the performances are so incredible. This is definitely one of the best films of the year."}, {"id": 32, "text": "Bravo Chadwick! Bravo Viola! You brought magic to August Wilson's play. Every scene was every THING."}, {"id": 33, "text": "The acting was great bothe performances but the movie itself was boring. The writing was all over the place and I'm not sure why they chose the plot to center around that part of the story. Chad and Viola deserve Oscar's for their performances"}, {"id": 34, "text": "The late August Wilson is celebrated for his 'Philadelphia' cycle of ten plays all but one of which are set in his home town, the city of brotherly love. The exception is this one, which was the first in the cycle and is set in Chicago where four black musicians are waiting for the legendary blues singer Ma Rainey who is late for her date to cut two sides - the time is 1927 when discs were made of shellac. All of Wilson's work explores the 'black' experience and this is no exception and trumpet player Chadwick Boseman (in what turned out to be his final film) loses no time needling the other three and the 'N' word is flung about liberally. Although Viola Davis has the eponymous role it is Boseman who has the lion's share of the dialogue yet at the end of the day it remains a powerful piece of ensemble acting."}, {"id": 35, "text": "Viola Davis gives a memorable performance as the uncontrollable mother of blues Ma Rainey. The late Chadwick Boseman's final film and gives an excellent performance as a musician who locks horns with Ma Rainey. You can clearly see Boseman was in poor health throughout the movie. Bit of a slow burner but still an intriguing film."}, {"id": 36, "text": "Excellent tribute to southern blues music done the southern way. Viola Davis transformed into a person completely different than any of the characters she's played before and all star performance. Chadwick Boseman gave such a memorable performance. It is the one you will never forget. When an actor develops into a role that is unforgivable and unforgettable. I was truly impressed by all the actors and actress in this performance. I wish it could have been a mini series and gave us deeper insights into the history of the blues. This movie is deep show the same injustices that were happening in the 1920s to 2020. It's worth watching 👍🏼👍🏼"}, {"id": 37, "text": "Ma Rainey's Black Bottom is a film that starts with a simple presentation and goes on keeping that vibe. The movie feels like it just starts and ends on a whim. Both Viola Davis and Chadwick Boseman delivered a performance as fine as wine. The acting will just make you connect to the movie before you can imagine. The screenplay could have been better. When it comes to the story this movie doesn't have anything special to offer. The whole arc is just circling one thing for one and a half hours straight. There are a few scenes that will make you feel bored and also make you wanna skip those scenes. Overall it's a film you can definitely enjoy on your weekend with no expectations on deck."}, {"id": 38, "text": "Based on a play set in 1927 jazz era of Chicago. The film surrounds a recording session of Ma Rainey played incredibly by the great Viola Davis. She comes to blows with the young trumpet played Levee played by the late great Chadwick Boseman. The film has some great set pieces and music. The film also has some great dialogue and some terrific scenes of characters going at each other. If you love films based on plays you will love this movie. Viola Davis is phenomenal as the lead singer she has such a presence on screen. Boseman in his last performance really gives it his all. He has some really funny and also really emotional scenes. The whole cast do a great supporting job as well. I really enjoyed this film. It is one of the best films of 2020."}, {"id": 39, "text": "That was one of the worst movies I've ever seen. Unspeakable boring, there's almost no music at all in whole movie, it's really a nightmare. A can't even talk about the acting, there's no context to value anything."}, {"id": 40, "text": "Not what i expected, so many scenes tested my patience.........too bad....... I was hoping to listen to that great music....... Anyway, Viola is the best !"}, {"id": 41, "text": "The movie in general was a disappointment to me . but Viola's acting was excellent"}, {"id": 42, "text": "Incredible cast but that's it. It was a play and this just seems like they didn't do much to change it. If you expecting the story of Ma Rainey you won't get it - more just a snap shot of one incident. The sound abs voice when viola lip synced was not great and just didn't match. Maybe I had too high expectations because of the cast abs director. There were so good moments and it's a snap shot of time and history that ultimately hasn't really moved on a lot. But this as a film - meh"}, {"id": 43, "text": "15minutrs in the dialogue makes zero sense idk where this is going at all. The entire first half an hour does not have the main character in it. We have side characters arguing but they have not established anything we have zero background. The high reviews make zero sense."}, {"id": 44, "text": "The soundtrack was abysmal. Fire the head of the music department and as for the story, well, lets just say it is timely how this was made and released now. In a word, lame. It's sickening to think there are actually opportunistic people in America who subscribe to this sorta anything for a buck propagating hate for personal profit (and I am not talking about white folks). Nobody owes you a damn thing. Get over yourselves already."}, {"id": 45, "text": "This movie is pretty good but not perfect, i think this movie is not giving a hype in some of a scene so it causing a boring, but all of the perfomance is amazing, Viola Davis is amazing, Chadwick Boseman is giving his final awesome acting to the world, and don't expect that this movie is gonna be a happy musical 1920s blues story because the fact is this movie is very deep, talking about a white man treating black people in that era, racist, and all that stuff, the ending is really really unexpected, overall i'm still enjoy this, watch it but don't expect too much, i recommended"}, {"id": 46, "text": "This is a brilliantly acted screen adaptation of the Broadway play. Viola Davis is brillent, believable and captivating as Ma Rainey. She is simply one of the world's greatest actresses. Chadwick Boseman's performance is astounding and brings magic to his complex and tragic character. He was a great artist and this performance will stand out as one of his finest."}, {"id": 47, "text": "Wow! is all I can say about this movie. As always Viola and the late Chadwick (Rest his sweet soul) gives an astonishing performance. It shows the strength and talent that black Americans have then and even now. Talent that took too long for real recognition. If you love culture and blues, then this is the movie for you. From start to finish this movie is worth a 10+.. I will say seeing Chadwick and knowing that he was sick battling cancer without every complaining and giving his best still makes this even more humbling and a A must watch movie. RIPChadwick"}, {"id": 48, "text": "The actors in this movie are great. Sad it was Chadwicks last movie. Love Viola Davis, but this was one of the most boring, and IRRITATING movies I have ever seen. I tried I had to finally turn it off I just couldn't take it anymore. Dang it got on my nerves. How so many good actors could do something so bad. Sorry it sucked."}, {"id": 49, "text": "Was expecting nice music ... and got two (good) songs during the whole film. Have to admit that after the first 15 minutes of Bla Bla I started to fast-forward. Truly disappointing!"}, {"id": 50, "text": "Great acting by viola Davies and Chadwick Bozeman But the movie is really so boring"}, {"id": 51, "text": "What an actors. The story is mainly there to let them shine, to reach to our hearts and to tell a story meant to be listened to."}, {"id": 52, "text": "The movie was great but the performance of Chadwick Boseman made it great, he deserves an Oscar for his role."}, {"id": 53, "text": "An Oscar worthy performance by Chadwick who did the best acting job in his entire carrer and Viola did good as well but Chadwick stole the limelight .One of the best movies of the year ."}, {"id": 54, "text": "With mind blowing performances from Viola Davis and Chadwick Boseman and unforgettable supporting characters Ma Rainey's Black Bottom is an immersive experience from beggining to finish. My only real complaint is that the editing at times didn't work and felt kind of fake. Still, this film is a must watch and really a phenomenal experience"}, {"id": 55, "text": "And yet still, what a sad life. I saw the original 1983 NY production of this from a good orchestra seat in one of the smaller Broadway theatres. But never did it achieve the sense of intimacy being there, in, person, that it did, from all the close-ups and circling camera cutting, here, viewed thru a smaller-than-life lap-top screen! That's an achievement! Stellar achievement by all involved. So great to see Viola Davis back in a role worthy of her talents, not just the sure-fire money-making trash that makes her one of the richest women in Hollywood, guaranteeing her availability for prestige projects like this. But an assembly of talent like this (August Wilson, Geo. C Wolfe, et al) is a sure hit that delivers all around. Ultimate showcase for the dynamic talent that was Chadwick Boseman. He certainly went out on top with this."}, {"id": 56, "text": "So Ma Rainy is my new favourite character. As a woman, I thought wow. I Wish I could stand up for myself like that. She's inspirational for me. Really enjoyed how committed Viola Davis was to the role. I usually like action or a lot going on which this film doesn't have but I stayed glued to this film from start to finish. Levee, Chadwick Boseman's character was captivating. So intense and I felt every word he said. Powerful film over all."}, {"id": 57, "text": "Had high hopes for the film assuming it was going to be a film about music. Instead that just turns out to be a lure to get you to watch a raunchy film played by good actors. Some scenes weren't necessary, some scenes go to far, and many scenes could have been left out. There's nothing redeeming about this movie save for the acting but as a movie itself it's a let down.I feel like hollywood will treat this like Training Day and give Chadwick accolades for playing some low down blasphemous character that is petty and filled with nothing good but ignore roles he should have won awards for like in Get on Up,Marshall, and 42. Hollywood loves negative black roles...this movie takes a negative black role to the next level so I'm sure they'll eat it up. This movie on the other hand was nothing short of an embarrassment to anyone that the culture in it reflects."}, {"id": 58, "text": "The film was kinda ok but the acting especially from chadwick was eminence some strong emotional scenes and the last one of chadwick's film your ever gonna see that's why I watched it if he wasn't in the film I probably would of gave it a pass because it's not my kinda film I just wanted to see him in action once again anyway r.i.p gonna miss you and your great acting and contributions you gave to the world."}, {"id": 59, "text": "This movie might be many things to many people but to me it wasnt entertaining. I had never heard of Ma Rainey and based on this movie im not surprised of why thats so. I will check out her music on Spotify out of curiosity but this movie is an indulgent borefest. I watched this movie for free and i still want my money back."}, {"id": 60, "text": "I felt every emotion us Black folks experienced then, and what we are feeling now in 2020"}, {"id": 61, "text": "Great acting incredible on camera chemistry.Worth watching"}, {"id": 62, "text": "Good music but most of the movie involves arguing."}, {"id": 63, "text": "Hopkins and Kirby will win this year that's for sure. i don't understand what's good inside a recording of a lot of black men talking about nonsense and god ???. And that's acting is over the top"}, {"id": 64, "text": "To me this film was upsetting, thought I loved the strength and confidence of Ma Rainey, and how she refused to let them non-Black individuals push her around. She set the pace and went according to her timeline!This film demonstrates how and why non-Black people are where they are in society, which has EVERYTHING to do with them being ruthlessness, liars, cunning thieves who appropriate other people's property, talent, and hard work.I hated how those shysters tried to take advantage of Ma Rainey, and how that shark record company producer stole the music from the Boseman's character to give to the untalented blue-eyed demons. They steal from the originators and creatives to give to their own, then take the credit! What was true yesterday is still true today.In frustration Boseman's character picks a fight with a bandmate that ends the bandmate's life. That scene is a perfect illustration so-called Black on Black crime. Rather, that it's all about proximity! In frustration, some Black people take out on one another what should really be taken out on the demons violating and stealing from them!!!!"}, {"id": 65, "text": "I think its great, that gay black men are celebrated on the big and small screen! viola davis was great considering what she had to work with, i think it was genuinely fantastic of an openly gay black mans portrayal of the early 20s. Chadwick Boseman....... so powerful of a movie, hje carried the whole movie and cast on his shoulders."}, {"id": 66, "text": "Exceptionally done and simply couldn't fault this."}, {"id": 67, "text": "The job that Chadwick Boseman does in this movie is enough to make those of us who know that he died after a long battle with colon cancer in August 2020 openly cry for the fact we will not get to see any more new work from him. Sure, Viola Davis is excellent as she always is, in the title role of the great blues singer. In makeup, costume, and fat suit, she is all but totally unrecognizable. And the supporting cast are all very fine, as well. But Boseman is the reason this should be seen as widely as possible. While most people will probably still know him for playing the title role in Black Panther (if not also the lead in 42), they should watch this to appreciate the sort of person and talent that has been lost. Highly recommended, 8/10"}, {"id": 68, "text": "Ma Rainey Black Bottom is a film that has two very strong performances in it and they may be one if not the best of the year and that are from Viola Davis as Ma Rainey and she completly stole every scene she was in either through her personality or through her singing ,Chadwick Boseman may he rest in peace was also brilliant here and he was basiacly soul of this film and person that had a hard life and that has to deal with his ambition and self carrere but also working in a band that is much older then him.This film was a good watch with two great performances"}, {"id": 69, "text": "Of course, Chadwick Bozeman is wonderful and heartbreaking in his last performance, terribly thin with his illness, but rocking Levee with sly, sassy, wide-eyed humor, and eventual outrage followed by terrible grief. He was so much fun and then so moving that he brought me to tears. Viola Davis is completely immersed in character physically and emotionally.....it is a stunning performance. The writing, directing, and supporting cast are also engaging with emotions twisting and turning across the room as the characters jockey for position and influence. The early period sets are dank and creaky; the air so hot and humid you can feel it and see it on Ma Rainey's face and breast. This August Wilson play transformed into a movie still feels like a play filmed on a stage. It works. Strongly recommended."}, {"id": 70, "text": "I was expecting so much... Disappointed as the excellent actors are driven into an endless banter with the late Mr. Boseman doing his best to steal the movie. Happily I had an excellent book on stand by. It went wrong and had everything to be great."}, {"id": 71, "text": "Disappointing. Another wasted opportunity and a sad waste of money. I was looking forward to this because of the caliber of acting talent involved and was seriously let down. This film was a classic case of making a mistake in not understanding the differences between mediums. This was a filmed play and it should not have been. The director completely failed to steer this ship in the right direction. It was full of long-winded, dialog-heavy scenes (as on stage in a theater) that may have been tolerable in a theater (because that's why you come to a theater, to watch a live performance) but was unbearably boring to watch in a movie. Sorry, Mr. Denzel Washington, I know you're a fan of August Wilson (the playwright), you made the wrong choice here with the director."}, {"id": 72, "text": "I enjoyed this movie but I would have preferred to see the stage play. Great performances from all involved, but like many many plays, it lacks the dynamism of a movie. Can't fault the cast, the direction, but be prepared for a play, not a movie."}, {"id": 73, "text": "Wow. I was so excited about this movie for such a long time. Because I feel like enough people don't know about this dynamite lady. But I don't know what the heck that was. SMHVery low budget. Literally 3 settings We didn't know ish about her life through this movie.It's the cross between a sermon and a postage stamp with her name on it.This angered me soooo much! And Chadwick got more camera time than her...Horrible movie."}, {"id": 74, "text": "He takes a moment in time and beats it to death with overwrought dialogue and a lack of narrative momentum. Having said that, the acting is steller!!!!!!!!"}, {"id": 75, "text": "Chadwick Boseman and Viola Davis both turned in Oscar worthy performances. But, I must say, the metaphors e.g. the locked door to no where, stepping on shoes, the misappropriation of black music; were not only relevant then, they are relevant today."}, {"id": 76, "text": "The concept is great, an original way to make a biopic, a genre that is been abused in the latest years, especially the musical ones. But apart from the concept, the astonishing performance form Viola Davis, that lives in a perfect armony into Ma Rainey's body, and from some interesting moments, Ma Rainey's Black Bottom is clearly born for the stage, is a play in every single aspect and the cinematic production didn't do much to make it different, to make it suitable for the screen, especially the streaming one. Everything is too theatrical: the screenplay full of dense dialogs that overlap, a static, claustrophobic direction and the exaggerated interpretations that most of the time are too dramatic or too elaborated to feel natural, real (expect Viola Davis' one). Chadwick Booseman was a great actor but even him seems to constantly search the applause or the looks of an audience that is not there, that can't be there."}, {"id": 77, "text": "It's Christmas Eve of 2020. And I'm calling the Oscar race for Best Supporting Actor right now. Chadwick Boseman wins it. Because his performance is that good. And because it will be the Academy's last chance to honor him. Viola Davis and the rest of the cast are excellent as well."}, {"id": 78, "text": "What a legacy? Chadwick Boseman and Viola Davis were riveting in his last onscreen performance. Leading, a small ensemble cast, the pair were electric together and separately and left this viewer wishing that there would be many more such performances in the future for Chadwick. Sadly, it is not meant to be. Boseman left a small but powerful body of work during his short lifetime and it will surely stand the test of time. I would also be remiss if I didn't note Glynn Turman's powerful performance. Coming on the heels of his recent role in Fargo, 2020 has been a good year for Turman."}, {"id": 79, "text": "The first half hour was hard work. Still I stuck with it as the backup band argued about nothing for the first third of the film. Have a strong coffee before watching this movie adaption of a play, and appreciate Viola Davis talent"}, {"id": 80, "text": "It is a play's adaptation and it feels like a play from start to finish. Actually I think I would love it on the stage but I didn't love it as a film. It is simply not cinematographic enough for me. Unfortunately it does feel like a filmed stage performance. There is not much music in it which was disappointing for me; there is instead a lot of words. Some scenes seem a bit detached, out of place. The acting is superb but... it is not enough to make a great movie. I'd say it is worth watching anyway but sadly it didn't get me."}, {"id": 81, "text": "This was such a great film. It was basically a play done as a film. Chadwick Boseman and Viola Davis were both incredible and so commanding on screen. Bittersweet that it was Chadwick's last film being one of his best."}, {"id": 82, "text": "I was really excited to see this and learn about one the best blues singers of all times but I was extremely disappointed. It was like watching a couple of days in her life with no background and hardly any music. The acting was good but to over the top with one melodrama after another. What really disappointed me was that all the characters besides Ma were fiction. So none of it really happened and Ma did have an exciting life that was real and one of her exotic stories could have been told."}, {"id": 83, "text": "Well done, with great characterizations. Nice to see Glynn Turman. A little disappointed - was expecting more of a biopic of Ma. Wanted to know more about her background. How did she develop the strong personality that let her stand up to the record producers? When/how did she get her big break? Did she have a strong mother as a role model? The band members told some heartbreaking stories, but I wanted to know more about what made Ma tick."}, {"id": 84, "text": "A play.cheap production.boring. Viola is fantastic.Chadwick was ok.The actors are good."}, {"id": 85, "text": "Great acting by the entire cast, especially Viola, but was left in the dark. No ending!!! What happened to the Levee character. Everything left up in the air. Also, too stagy even though it was a play. Could have been opened up a bit more. Was Ma a lesbian? What was to with that young girl? A lot of questions unanswered. Too bad as it takes the movie way down. Wish it were better!!"}, {"id": 86, "text": "I really wanted to like this film but all i heard everytime Ma Rainey talked was Denzel Wahington. Why did he use Viola Davis as his mouthpiece?? She is a fantastic actress in her own right but just mouthed his vitriol? As for the young trumpet actor - amazing - but why did he kill the old guy???? I know he was angry but he didnt need to kill the guy - he was so vocal he could have just expressed his anger without going down the black guy has to kill somebodyroute?? The whole film just comes across as Denzell Washingtons personal hate against white people!!!"}, {"id": 87, "text": "Another timely piece of for profit propagation of antiwhite racizt propaganda garbage. plus the acting, cinematography and music are horribly done. skip it, there are much better things to do with yer time"}, {"id": 88, "text": "I've read some of August Wilson's plays, not this one, but I know that it's hard to adapt one of his plays, or any play, to the screen. The thing is, most plays take place in one setting, which doesn't really create cinema. While this movie does a good job, and is mostly interesting, it still is a play. They try really hard to make it not just a play, like not having everything take place in one room. For example, they have this one scene where two black guys walk into a store to buy a Coke but see a bunch of white guys staring at them. Then the scene ends, like it's clear what's happening ,but then it literally never comes back, and they could have shown them being eyed or given trouble by the white guys instead of showing a 2 second clip. A lot of elements go nowhere, which is also a big problem.The best part is 100% the acting. Like the previous August Wilson adaptation, Fences (Directed by Denzel Washington) this movie is carried by incredible acting. Chadwick Boseman is amazing, he's pretty haunting. Viola Davis is also a great character.It's worth seeing, but honestly isn't that great. The ending is quite interesting, however."}, {"id": 89, "text": "Well, by watching this movie you'll never know. Although I gave it a seven, it's more about the performance of Chadwick Boseman. This movie would have been better suited as a limited series."}, {"id": 90, "text": "7/10 - standout performances abound in this good, not great adaptation of the August Wilson play"}, {"id": 91, "text": "Great actors and good source material in the play. Sadly, this film falls flat despite the really good performances. The problem is common to lots of films made from plays. In theatre everything is written to be contained to the stage and in the audience's imagination; in movies the more expansive the view the better so it feel cheap and affected when it's filmed like a 80s multi camera sitcom. I wish they had taken Ma Rainey's story and told it on a much larger scale, which the format would have allowed. This could have been done within the relationships of the same characters and taken inspiration from the play with great impact, but trying to transpose the action so literally is a fail for narrative."}, {"id": 92, "text": "What a disappointment. The movie is nothing more than a 1 and a half of it's actors arguing in conversation. It's messy and the plot goes nowhere. Sorry but Chadwick Boseman does nothing special and is merely a background player. All this Oscar talk is just crap since he died. Viola Davis does her best impression of Oprah in TCP. YAWN. I find it hilarious that people are praising this mess of a film, or is it a play? Either way, SKIP IT!"}, {"id": 93, "text": "I would have liked to watch a film about Ma Rainey. It was really about a trumpet player who didnt even exist in real life. I enjoyed watching but just wish it was a different story."}, {"id": 94, "text": "The best i love this movie is wonderful actors and ma raineys is very food Oscar oscar oscar"}, {"id": 95, "text": "Chadwick Bozeman and Viola Davis were understand in the movie and should receive an Emmy for their roles."}, {"id": 96, "text": "Not Chadwick leaving the world with one helluva performance. Viola Davis is a given-and I will always love her-but Chadwick was the show's second star to the right. See you in April, King."}, {"id": 97, "text": "I loved Viola Davis and I loved Chadwick Boseman. I hated Viola character and I loved Chadwick's character. To be honest, I only saw the movie because it was only 90 minutes but I didn't miss a thing (but I didn't earn much either). I loved the blasphemy scene and luckily the film was all set in the same space, because otherwise it would have been half the film for nothing. I don't like the filter that netflix puts on most of its films that all look the same. Ma was unbearable my god"}, {"id": 98, "text": "I learn much by huge people portrayed on screen and this one is very nicely done.Throwback to 1927 where toilets are separated for colored and white people, there live Ma Rainey, the Mother of Blues they call.The one deserves my highlight in this performance is the great Chadwick Boseman as supporting role. He shows how colored people suffer in the period and end up to a sad tragedy.The directing is well-packed and the dialogue is really insane, short duration makes it even better and also shot in only one single place, i love it."}, {"id": 99, "text": "While I appreciate learning about Ma Rainey and this made me look her up, I don't think it was good. It painted Ma Rainey in a negative light. She was strong and definitely a pioneer. Thought it could have been done differently. I'm not asking for sugarcoating. I know what the times were like during the Great Migration considering my idol, Bessie Coleman, went north for the promise of work during the Great Migration.And what happened to Levee was absolutely accurate. That was jacked up, but it has been recorded time and time again."}, {"id": 100, "text": "The people who say that nothing happens in this film have clearly never been to the theatre or watched anything that's not a Marvel movie. It is beautifully written about one day in these people's lives. The performances are incredible! And the language and the writing deserve the awards that they received. The beauty in this film is the characters, not the action. The tragedy of their characters and how they bring in their own consequences is stunning to watch."}, {"id": 101, "text": "Viola Davis as legendary blues singer Ma Rainey and the late Chadwick Boseman as a troubled musisican named Levee give performances in this film so incredibly searing, it's impossible to judge them sanely...they are aided and abetted by Glynn Thurman, Coleman Domingo and Michael Potts who are just brilliant as Ma's band members....Ruben-Santiago Hudson wrote the screenplay based on the stage play by August Wilson which echoes through present day...produced by Denzel WashingtonOscars will (and should) abound! (Netflix) Miss this...and you are missing an EXPERIENCE!"}, {"id": 102, "text": "I loved this, this performance is so sad as it's his last, And Viola Davis She Never disappoints, these 2 are perfection together. This movie is a must see! DENZEL RELEASED MAGIC WITH THIS ONE!"}, {"id": 103, "text": "Perfectly written everything, music, clothes, acting, 1920's, etc. As usual Boseman lights up the room when he steps into every scene. Oscar for Boseman R.I.P.... Movie of the year 2020. Not even Covid-19 could keep Boseman from getting this Oscar. I will miss him. Peace"}, {"id": 104, "text": "I gave it 10 because of the performances; Amazing performances!"}, {"id": 105, "text": "I am not going to lie. It started kind of silly and I wanted to turn it off. Glad I kept watching. This movie is a instant classic. I actually teared up on a couple of scenes. The characters make you hate them one minute and love them the next. I got too invested and forgot I was watching a movie. Chadwick Boseman deserves an Oscar! It has nothing to do with his untimely death. He acted his butt off. Everyone in this movie did!"}, {"id": 106, "text": "Absolutely loved this film! Great cast with even greater performances. Viola Davis embodies Ma Rainey in a believable way, even without my prior knowledge of this dynamic singer. Chadwick Boseman's performance was given as if he knew this was his last! Absolutely brilliant!2020/21 Oscar Noms &amp; Wins: Best Leading Actor- Viola Davis Best Actor In A Supporting Role- Chadwick Boseman Best Adapted Screenplay- Ruben Santiago-Hudson Best Picture- Ma Rainey's Black Bottom"}, {"id": 107, "text": "This adaptation of a classic August Wilson stage play is an actor's dream and screenwriters joy. The only thing left to say about the performances of Chadwick Boseman and Viola Davis is Bravo! Well staged, directed by George Wolfe with a script from actor/screenwriter Ruben Santiago-Hudson one is left with how tough she must have been in real life. And they didn't waste time with meaningless backstories. Instead we viewed a day in the life that would change things forever and a history lesson in music production, American culture. All with only two violent scenes."}, {"id": 108, "text": "I didn't really know much about this movie going in so i was surprised to find out that it was based on a play but after watching it you can see that fact from a mile off.The film is soaked in play-like monologues and limited sets and the framing. It works so well. It is such a dialogue heavy movie that it could run the risk of being a little bit slow but it is just that well acted and the dynamics and topics are so well thought out that you find time flying by while watching.The characters are really 3 dimensional and you understand who they are. This is all backed up by the acting. For the most part everyone in this movie hits it out of the park. i really love Colman Domingo and he really shines in this film. He just has a charm that draws you to any character that he plays. Chadwick was really great too. His emotional scenes really sweep the rug out from under your feet and i really wasn't expecting him to be able to do that he was really great. And Viola Davis is just fantastic. I love how she just dives head first into her characters and just lives in them. It reads so well on screen. She just embodies the role even down to the way she walks is just done to perfection.There isn't a whole lot of story because it is very character based but it does things to keep it fresh and i found it to be really shocking at times and took turns that you really wouldn't expect.The costumes are also really well done. I would guess that they would get an Oscar nod because they are fantastic.I would defiantly see this movie especially if you love character studies and want to feel like you looking though a window into a day in the life of these people."}, {"id": 109, "text": "Ma Rainey's Black Bottom is certainly of interest as biopic of the Mother of the Blues Ma Rainey (as played by Viola Davis) and for the last great screen performance from the late Chadwick Boseman as the fictional trumpeter Levee in Ma's band. Beyond this, it's partly hindered as an extension of the stage in the same way that Denzel Washington's adaptation of another of August Wilson's Pittsburg Cycle of plays, Fences (2016), was, but this adaptation by Ruben Santiago-Hudson and directed by Goerge C. Wolfe, although still including Washington as a producer, largely transcends its staginess by reflexively being about the process of adapting stage performance to recorded media, from musical concert to recording session--just as the movie is a recorded adaptation from live theatre. Unlike most filmed plays, its theatricality reflects its narrative.Moreover, it's set in 1927, which, whether or not the filmmakers intended the allusion, was also the year of the film The Jazz Singer, the heralded first feature-length synchronized sound film and film musical. Apt for a Netflix release about recording music, and, more than that, The Jazz Singer, among other things, is also about what today might be more-politely termed cultural appropriation, as evidenced most notoriously in the blackface sequence. That 1927 film is about the clashing and harmonizing of cultures in general, really: part silent and part talkie, Judaism and show business, the whiteness of the film's jazz singer and the origins of the music from black musicians as called attention to in the controversial blackface worn by Al Jolson. Point is, some of the same issues are brought up in Ma Rainey's Black Bottom.Boseman's Levee wants to play his own, jazzier, more-swinging music as opposed to performing in Ma Rainey's jug band, while at the same time there's no denying the influence of her blues on the history of popular music, including collaborating with the likes of Louis Armstrong and Bessie Smith. Ma also retains her own voice, whereas Baby, Let Me Have It All (which with its jelly rolls makes me think of Jelly Roll Morton, in addition to how raunchy these old tunes about rolls and the titular bottom are, but I digress) is coopted by a white band and studio owner. Besides this, the characters take part in a series of theatrical monologues and dialogues on racial issues, religion and other matters, and there's Ma's reported homosexual relationships, one of which was rumored to be with Smith. Again, such a connection may've not been intended--indeed, such an artifact of Jewish identity and white culture would be out of place here in a sense--but the parallels are manifold and felicitous in the sense of cinematic heritage.Although its reflexivity, including a particular focus on the technical aspects of recording, are what raises this title above a mere filmed play, the costumes and production design also help, and there are a few different locales beyond the record studio to open the play up. Even the cinematography of the sweat on the figures' faces throughout the exhausting performances and hot-summer recording session recommends itself. The opening concert scene is a standout, and it, reportedly, includes the one bit of Davis doing her own singing. The rest said to be performed for by soul singer Maxayn Lewis. The same sources say Boseman actually learned to play the trumpet, although I would be surprised if his playing weren't also aided by modern sound-recording tricks. Regardless, Davis and Boseman headline a superb overall cast. Davis is especially imposing in looking the part of a legendary historical figure. And Boseman is surely the sentimental favorite for a posthumous Oscar this year, and his performance might just very well deserve it. There are a couple moments that are overly stagy--the more sudden outbursts of speechifying in particular, but even that may be followed by a helluva powerful monologue such as of Levee's story of his childhood. Overall, his performance transcends any fun-loving jazzcat stereotype in a similar vein to the picture overcoming its being a filmed play. The business with Levee's obsession with that trap door is a neat metaphor in both respects. He and his character become artists. It's a moving conclusion to a career tragically cut far too short. Yet, just as records immortalized the blues singing of Ma Rainey, or these adaptations have done for August Wilson's plays, motion pictures have done likewise for the artistry of Chadwick Boseman."}, {"id": 110, "text": "First things first. Chadwick Boseman gives a performance like nothing you've ever seen. The rest of the cast, led by the legend that is Viola Davis, is, as might be expected, tip-top, but Mr Boseman flies ever higher in every scene.The film is based on a famous play by a great playwright who chose to write with a sense of melodrama that can still work in the theatre but somehow feels dated when transfered to the screen. The camera has to cope with the sheer size of performance necessary to capture set-piece speeches, which go against the grain of image-led cinema. Renowned Broadway director George C Wolfe gets the actors to the right temperature, but then has to find a way to make the project cinematic. The solutions here, apart from minimal opening out from the claustrophobia of the recording studio setting, are some mobile camera work and quite a bit of nimble editing. Curiously, though, these strategies simply emphasise the work's stage origins. What do work are the close-ups. They bring us closer to the characters than can ever happen on a stage. With an ensemble as fine as this one, the more close-ups the better.So, MA RAINEY'S BLACK BOTTOM, like the film of Wilson's play FENCES, is not satisfying as a movie, but as a record of a powerful play. Both well worth seeing. MA RAINEY is the greater, because of Chadwick Boseman. What an amazing actor. What a loss. What a legacy."}, {"id": 111, "text": "1927. It was the heart and soul of blues all around America and in the Africa American communities, there was the Mother of Blues, Ma Rainey. Ma Fainey's Black Bottom is the second film adaptation of the late playwright August Wilson after Fences, the first of which was a brilliant portrayal of an African American couple, played by Denzel Washington and Viola Davis who won an Oscar for that performance, it was good but often felt a little stagey, it was well acted but some of it was a bit overracted. The second, improves on that again starring a brilliant Viola Davis giving another powerful performance as the Mother of Blues. It's been said before and it will be said again, Netflix know what do when it comes to drama they definitely know how to set the dramatic tone, and when it comes to a period piece (there's been two this month alone) their resources are unmatched and again here it's almost as if they've put us in the late 20s in the heart of the blues generation. Granted the setting along isn't what makes Ma Rainey's Black Bottom special, nor is it the script, what is it then? It's the performances, like with Fences before it the performances make this film what it is, Davis gives yet another great performance, but it's the late Chadwick Boseman that totally pulls his heart out as Levee it may be his final film having passed away in September but it is his best performance yet and he's going to give The Academy one hell of a time with both this and Da 5 Bloods. But it'll be this that gives him the award. And as a film it's definitely a fulfilling goodbye to a great talent. 4/5. It's definitely a great one to see off 2020. A must see."}, {"id": 112, "text": "Ma Rainey's Black Bottom is a stunningly intense film. While it centres around the making of a record, it's not the music that makes it shine. It's the performances and dialogue that make it what it is.Based on the trailer on Netflix, which was the only thing I had seen or heard about this film before seeing it, led me to believe that Ma Rainey's Black Bottom would mostly be about music. However, as soon as the film began, I promptly realized that that would not be the case. And while I did find myself longing for more music, the product that I got instead, was quite good. And that product is one of intensity, tension, and emotion. This film takes place in two locations. One being the recording hall in a recording studio, and the other the practice room in its basement. These two places offer very little on their own and work merely as the place where the characters and their dialogue get to shine. The two main characters, portrayed by Chadwick Boseman and Viola Davis, shine the brightest, giving incredibly provoking and intense performances. And thanks to the limited and cramped locations, the intensity is amplified. The characters feel stuck with each other, even when they'd clearly want to be anywhere else but there.The story, while simple, lends itself to some brilliant moments. It follows Ma Rainey and the challenges she and her band face while trying to record her latest album. Levee, the trumpet player of the band, doesn't quite see eye to eye with the rest of the band or Ma herself. As personalities and ideologies clash, the conversations and atmosphere heat up. As is quite evident, Ma Rainey's Black Bottom has a fairly simple premise as seen by its story and use of locations. It relies on strong characters with strong personalities and an even stronger script. Luckily, it has them all. The dialogue is simply stunning, and the intensity it is delivered with blew me away. It's simply non-stop. There isn't a moment in this film where I found myself thinking about something else. It kept me engaged from the very start to the very end. And while the conversations between characters, as well as the few musical performances, were good, what really stood out to me, were the monologues delivered, especially, by Boseman. The emotion he conveyed through them, and the complexity of his character that he showed in those few moments of speech, were simply stunning.While this is a great film for the most part, and while it did keep me engaged, I sometimes struggled to connect with it. All the characters, but especially those of Boseman and Davis, really felt like characters. They didn't feel like real people and, as such, it was obviously clear that I was watching a movie. That isn't a bad thing in and of itself, but in the case of Ma Rainey's Black Bottom, it took me out of what was otherwise a very engaging experience. It is, of course, wholly possible that this is what these people were actually like, and in that case, it is a very personal problem. However, what they ended up feeling like, were over-the-top versions of themselves.Ma Rainey's Black Bottom ended up being a very refreshing film. It surprised me in almost every way, and for the most part, it did so positively. While I ended up hoping that there had been a bigger emphasis on the music, the intensity and fast-paced dialogue more than made up for it. Chadwick Boseman gives a stunningly powerful performance in what unfortunately ended up being his last film, and he, alongside Viola Davis, make this film as good, and enjoyable, as it is."}, {"id": 113, "text": "Like with every movie or show, you have to know what kind of expectations you should have for the content you're going to watch. This had a dramatic structure more leaning to a theater production rather than what a regular drama film usually has, kind of like Viola's other movie Fences (2016).I myself came here for the performances, and boy did they deliver! Every single one of these actors played an integral part. I was however a little bit underwhelmed by Taylour Paige's contribution but I guess it's hard to shine through when you're sharing a screen with Viola, Chadwick and let us not forget Glynn! Glynn Turman (who played 'Toledo') stole a lot of scenes for me. His eyes basically talk for him and makes it hard not to look away or feel something. What also made this all the better was the music and the little sequence of watching Ma's stuttering nephew try to sing.For me, this also managed to deliver the message that Green Book (2018) thought it delivered. The message of what it was like for accomplished Black musicians back in the day. All in all this was a pleasure to watch, I think more would have appreciated if it had a regular more elaborated storyline but I think this stylistic choice was more fitting for a portrayal of Ma Rainey."}, {"id": 114, "text": "Sadly sometimes it's not until an actor dies that they are truly appreciated for how good they were when they were alive and Chadwick Boseman is one such actorThis was his last ever performance and you can see how gaunt he is with cancer but that doesn't stop him giving everything and putting in a brilliant performance.Talking of brilliant performances , Viola Davis is amazing as Ma Rainey in what I believe , to be her best role to date . You can definitely tell that this was originally a play . It's dialogue heavy and nearly entirely set in a recording studio yet it transfers pretty well to the big screen . Viola Davis is just stunning as she lays everything on the table as Ma Rainey . From her overweight, sweaty demeanour to the way she gulps down bottles of coke , she is a magnificent . You can tell she is influenced by Denzel Washington, who is a producer on this film. Even her mannerism are Washington esq. I'ts without doubt , in my opinion, the best acting performance of 2020.If I had to criticise this film in any way it's just part where Levee does something to Toledo and it seems a little extreme and over the top for the character.This is one example where all the performances are better than the whole of film itself.Not that the film is in anyway bad . It's great ."}, {"id": 115, "text": "I was completely speechless when I found out about Chadwick Boseman's death. It was so unexpected and so I couldn't wait to see him one last time in Ma Rainey's Black Bottom. Having seen it now, I think this might be Boseman's finest performance.Based on August Wilson's play of the same name, Ma Rainey's Black Bottom takes place during one recording session where tension begins to mount between Ma Rainey and her band.I was very excited to this. Viola Davis and Chadwick Boseman are two very talented actors that have shown their capabilities time and time again. The acting in Ma Rainey's Black Bottom is definitely the highlight. Once again, Viola Davis proves herself as a brilliant actor. She isn't in the film as much as I thought she would be but I was totally captivated by her stellar performance as Ma Rainey. However, the star of the show is Chadwick Boseman who is absolutely extraordinary. With Ruben Santiago-Hudson's powerful dialogues, Boseman embodies the confidence, emotional range and elegance of Levee that truly elevates the film. These two actors have to get Oscar nominations for their work here. Alongside them are Colman Domingo, Glynn Turman and Michael Potts who are also extremely good here. If there is one reason to see Ma Rainey's Black Bottom, it's the performances.Despite being primarily set in two locations, the production design is very strong and the costumes to go with it make it feel like the 1920s. Ruben Santiago Hudson's screenplay is very dialogue heavy and reveals a lot about each character, especially Levee, as the film goes on. The main problem with the film is that it does feel more like a play than an actual movie. Some plays do not fully translate onto the big screen and this story feels like it belongs more towards the theatre than a cinema.Despite that issue, I really enjoyed watching Ma Rainey's Black Bottom. Viola Davis and especially Chadwick Boseman deserve awards for their electrifying performances. Sadly this is Boseman's final performance but it's also one of, if not, his greatest."}, {"id": 116, "text": "The plot behind this movie is great, though far more fitting for its original stage presence. I wouldn't say it translated to film well, because I think the story alone could have been more captivating, but what held this film up was its performances. Chadwick Boseman delivered a sensational, just fantastic performance. I've always known he was talented, but I was absolutely blown away and moved by his portray of Levee. Viola Davis was perfectly captivating as always! The entire band, Colman Domingo, Glynn Turman, and Michael Potts were also incredible and delivered wonderful supporting performances. I also commend Dusan Brown for a stellar and very believable performance as Ma's stuttering nephew. Where the cast faltered was with Taylour Paige/Dussie, whose acting I felt very unimpressed by as I was painfully aware she was acting and it felt inauthentic. Not entirely sure why she garnered so much attention for this role considering its small size and her underwhelming performance which made me question how she got the role, but I suppose that's entertainment politics. Nonethless, the movie was better than I had expected."}, {"id": 117, "text": "The kind of movie that shows no other rules apply other than good storytelling. I didn't know it was based on a play and I hadn't read the log line, so when I sat down to watch it, I figured it must be about a couple of folks hitting the road, singing, making records, dancing, etc. That's not what it's about...It's all about the band, the producer, the manager, and the whole situation. It's not a movie that will tell you you need to have a protagonist. Instead it focuses on people, some of them good, some of them bad, all of them with their own histories, their burdens, their joys, follies, and their pains.I can see how the play won a Pulitzer and it was wonderfully translated to the screen. The screenwriter craftily broke with expectations during the beginning of the story, but that doesn't mean it isn't a driving force as a theme. You just don't know when you're gonna get it and when it's going to drive home.If I knew any of 'm, the only thing I would be able to tell them is, Great job."}, {"id": 118, "text": "I didn't know what to expect except that I like Viola Davis and Chadwick Boseman.It was a bit slow to get started but when Boseman delivered his first monologue m you were just left humbled sat having witnessed the rawness and grieving knowing that he isn't here to continue his career.Viola Davis was amazing and truly impressive to see her work the power dynamic based on her characters fame.There were several points in the movie where I was truly cheering and later stunned.It is an amazing movie full of poignant and powerful reminders of the racial divide and it feels like we really haven't made much progress in the nearly 100 years since the story took place.There were a few weak spots where it seemed like they needed to fill time. However, it was definitely a great movie that leaves you mourning the passing of a great talent that was Boseman. At least we still have Viola."}, {"id": 119, "text": "August Wilson must be the greatest playwright in my lifetime. Kudos to screen playwright Ruben Santiago-Hudson and Director George C. Wolfe. Viola Davis and Chadwick Boseman deliver searing performances and all actors create 3 dimensional characters with breadth, depth and aplomb. The cinematography, editing, costumes, makeup, lighting, music and production design combine with the action to yield visual umami. I watched this film upon release December 18, 2020. Thanks to Netflix. It is the best movie I have seen this year and deserves your viewing. Viola Davis is believable as Ma Rainey and Bradford Marsalis's score serves the production very well. Davis and Boseman's performances are OFF THE CHARTS! Do not get on Ma Rainey's wrong side! In more than one scene Boseman's performance is over the top and his petition to God is the most incredible. In hindsight, one can understand his genuine impetus to fathom the depth and power of genuine and awful incredulity that was likely unbeknownst to his cast members and crew during prep and filming. I urge everyone to give this film a viewing or two. And to Netflix, more films based on the works of August Wilson and more productions by Denzel Washington such as this please."}, {"id": 120, "text": "Ma Rainey´s Black Bottom is a drama film released in 2020 and directed by George C. Wolf.The film surprised me a lot, I was expecting only a film with good performances, but I ended up finding a film with excellent art direction, good direction, and of course, exceptional performances. In the technical sense the feature is perfect, the costumes the setting, etc., you really feel like you are in the Chicago of the 1920s, which in a period film is always essential. The film offers great performances, without a doubt the performances of Viola Davis and Chadwick Boseman are one of the best of the season and one of my favorites at the Oscar 2021. It is also worth mentioning that the film has a great speech on racism, and addresses the theme of one of the best forms of Black Klansman.I confess that when I was watching the film I felt a little sad, as this will unfortunately be the last time we will see Chadwick Boseman on the screens, and this is the best role of his career, I really hope he has at least an Oscar nomination. Viola Davis even with little screen time has a great presence and is a very striking character, and her makeup is great and I believe she will be recognized in the category of best makeup and hairstyle. However, without a doubt this is a Boseman film, this is where the film focuses most of the time and has the best and most surprising monologues. I believe that this would be a perfect film, if it weren't for the fact that the director didn't know how to adapt the play on which the feature is based, so, in some moments he remembers a recorded piece too much, and for an adaptation this is never good.Ma Rainey´s Black Bottom is a great film, one of the best of the year with two of the best performances of 2020, but the adaptation of the original work is not very good, making the film resemble a recorded play."}, {"id": 121, "text": "Powerful acting is the engine to Ma Rainey's Black Bottom -- a film about the struggle to achieve control. With a soundtrack causing an immersive experience for the audience, dialogue seemingly fitting for the time-period and allowing the cast to maximize their talent, Ma Rainey's Black Bottom is a near perfect film.Through the years jazz has become a genre of music a very small amount listen to and a smaller amount that listen to it regularly -- including myself, however, that did not stop me from nodding my head to the beat of the music. It is beautiful to listen to and contributes greatly to solidifying the setting of 1927.Much like August Wilson's other (screen)play, Fences, Ma Rainey's Black Bottom takes place in a limited period of time and focuses on relationships, dialogue and theme.At the beginning of the film Levee (Chadwick Boseman) is up-beat, talented and excited for what the future will bring and that he'll have his own band one day. He has worked hard controlling the white folk his whole life and controlling his destiny of becoming a famous musician. As the film progresses, he loses control, acting irrationally after he has lost everything. He did not have control while the vile acts were being committed towards his mother from white men -- and after always ensuring he was in power even working for Ma Rainey -- he lost control once again, 32 years later, submitting to the power of a white man.Ma Rainey foils with Levee as she maintains a powerful presence, but with her large amount of power, weakness can be shown easier. Levee highlights her weakness as while as the producers not meeting her needs as instantaneously as they are met in her hometown.The theme of control/struggle to achieve control is shown from beginning, to the end with Levee's song meeting the same fate as his own -- submission to the white folk. Ma Rainey's Black Bottom stays on track and maintains interest the entire time and reaches its peak interest-wise with the peak story-telling-wise: the climax. Although the dialogue seems moderately unnatural and shaky at parts it is nonetheless a great watch. 8/10"}, {"id": 122, "text": "This film caught my eye for many reasons, the ensemble cast of well known actors... produced by Denzel Washington and it being on Barack Obama's list of favorite movies and TV shows of 2020. The unexpected death of Chadwick Boseman who plays Levee in this film is a strong reason as it's his last film, he's a great actor like everyone else in this fine motion picture but it's one of his best performances, the critics said that and I'll have to agree that it was extraordinary.Ma Rainey's Black Bottom is based on a play and it plays out similar to Denzel Washington's Fences, so a really good drama, this film is about music as much as it is about drama and tension. The legendary Mother of the Blues or Ma Rainey as her real name were, she's portrayed brilliantly by Viola Davis whilst Colman Domingo portrays a character called Cutler. Those two and of course Levee is the main characters, and all three gave amazing performances. Great cast.This film is similar to Fences as it's very dialogue driven, it has a faster pace than Denzel's film but it's similar in terms of production. The writing is perfect, the dialogue is superb and so the direction was also fantastic. Dialogue heavy movies isn't for everyone as they're often slow paced and character driven, the film is like theatre but up on the big screen. But movies like this often gives the actors extra chance to shine and that's what they do here, delivering lines beautifully and the monologues even better.Let's take a second to talk about the costume and hair department and all the talented people who worked on this film, everyone should be praised for their terrific work. It's a great film, one of the best I've seen this year of the movies that arrived in 2020. Barack Obama was right putting Ma Rainey's Black Bottom on his list, it's now on mine. Is it a movie I'll watch again? I don't know, possibly for the performances. Fantastic is a word I'll use to describe them."}, {"id": 123, "text": "Shoving aside the problems of adapting something written for the stage to the film--and it's a hefty shove--there are considerable treasures offered in Netflix' production of Ma Rainey's Black Bottom. We get long passages from August Wilson's play that stab the heart while revealing the African American experience of living in the segregated United States. There are few better examples that open the door that many wish to remain closed. And there are enough contemporary references (it takes place in a recording studio owned by White businessmen) to cross the bridge of time from 1927 to today.There are the performances that scorch the soul. Viola Davis (never a disappointment) gifts us with a portrait of a cunning artist whose crossed into White America with the full awareness she's being taken advantage of and is ready to extract every ounce of wicked pleasure for herself that she can. She's tardy, she's impossibly temperamental, she's at war with how quickly fads and novelty can abandon her. And no one survives who crosses her. Davis is electrifying in her fearsome portrayal.As her main opponent, Levvy, hungry and in a hurry to reap his advantages before his limited opportunity is lost. He wants to occupy the center Ma Raimey controls, including recording time, her girl, and opportunity to glean the oppressor before he either destroys himself or is destroyed by others. This complex, agitated, desperation is portrayed by Chadwick Boseman, who was undergoing treatment for cancer during the filming. That fact is notable because Levvy's desperation to hurry-up-and-get-it-while-you-can is a large part of Boseman's sensational performance. His grabbing for every opportunity he sees is haunted by Boseman's own fate.The rest of supporting cast--who consume considerable screen time without the principles present--are equally fine. The two Caucasian characters, however, come across as flattened and non-threatening which somewhat blunts the point. They appear more to desperately need this talent rather than being exploiters of it. And the final scene spells it out, the lack of sharper intent seems more inadvertent than deliberate.The entire production could have used a reimagining of the material from August Wilson's major work. Or better yet, filming an actual live production of the play with these actors would have freed it from being so stage bound. The attempts to open up the play just don't work: The opening number in a tent show, as good as it is, has nothing to do with Wilson's theme. A promenade by Ma Rainey through a hotel lobby doesn't illustrate Wilson's point, plus it's confusing until we understand more later. An incident with a car and a Chicago cop diffuses a powerful scene in the recording studio that precedes it. All this releases the tension that is built from the performers being in the pressure cooker of the recording studio, and Levvy's final self-destructive act seems forced rather than the culmination of what we've witnessed."}, {"id": 124, "text": "Ma Rainey certainly feels theatrical, with the actors and their dialogue driving everything in the movie. It ends up working well here, thanks to an excellent ensemble led by a dynamic performance from Boseman. It will take an exceptional turn from Hopkins to unseat Boseman for best actor, and I hope this year's race isn't looked back on as awarding Boseman because he died, for this is a fantastic and deserving performance. It's great to see Boseman go against his usual typecast of a golden boy fighting through adversity, and he shows remarkable range from the emotional turmoil of his past to the energy he brings to his music. Davis is definitely good, though I don't think she was nearly as enthralling or rangy as Boseman. The entire ensemble is very good, with the piano playing Turman as my favorite supporting performance. The script is fine, and it does set the atmosphere and rapport among the players well, but largely repeats the same series of interactions with only a couple unique scenes. The direction was my biggest problem with the film - not that it was incompetent, but that no depth was added to the film beyond what's present in the dialogue. Several of the music scenes cut around haphazardly, and the blocking was extremely uncreative, with wide shots that hone in on a character's face with no depth to the shots or visual meaning. The dialogue captures the struggles of black people fighting their way through a white person's world, but none of the editing or blocking during this dialogue added to it any more than reading the words on a page. I will give credit for one scene which was extremely thematically interesting: the door. Boseman is convinced that the door is new, and we see him playing with it and trying to open it throughout the film. As he is dejected late in the movie, he pushes on the door, it won't budge, and eventually it opens, only for him to find that it leads to an empty, walled in space. Just for this metaphor alone I almost gave the film an 8 - this perfectly symbolizes Boseman's struggle in feeling like he has no hope or door to success, seems like he finds one, only for it to be blocked off all along. The ending makes some sense on a character level but I disliked the execution - it felt so absurd and unaware as to be implausible coming from Levee. Ma Rainey is definitely a good movie and Boseman is the definitive reason, but more compelling direction could have elevated this into an excellent one."}, {"id": 125, "text": "Chadwick Boseman has some of the best scenes and monologues in the movie, and he performs it to T. However, Viola Davis is the soul of the film. She has few scenes, but her performance takes over everything. Her aura is eccentric. I wish there were a couple of more monologues for her like she had in 'The Help'. Those added scenes would have guaranteed Oscar for her. (She still deserve IMO).The film shines because of its performances. The supporting cast has done an incredible job too. They stand as supporting pillars to this narrative.The title, 'Ma Rainey's Black Bottom' is more than just her song. It's about Ma's journey. Journey of pain, suffering, passion and hunger for validation as a Black artist. It's about Levee's pain, dreams and aspirations as a black artist. It's about their constant struggle. The good thing is that the film is not preachy by any means. I liked how the focus of the film was just on one instance, but that one instance has so much to say about the characters. I highly recommend :)"}, {"id": 126, "text": "This month, I (along with another person) have been reviewing movies on the topic of black influence on popular white musicians and bands. This film beautifully captured this power structure and dynamic in the music world, and I highly recommend that you check it out! (no spoilers!)Ma Rainey, played as Viola Davis (?) and Levee, played by Chadwick Boseman (!!!) were both such STRONG and OVERWHELMING characters in this film. The dialogue and the delivery of it was great - I admit, some parts did move a little slow (particularly the beginning when Levee and the band are in the practice room), and I do think that that could have been condensed a little bit more.After researching a little bit post-movie, I discovered that Chadwick Boseman actually took the time to LEARN the TRUMPET just so he could play his role as Levee. Even though I have never played trumpet, I have played percussion and his performance in the movie really reflects the extra mile that he undertook to make Levee as authentic as he could be.Solid 8/10 for relevance and acting!"}, {"id": 127, "text": "I think Ma Rainey's Black Bottom does an excellent job of capturing a moment in time. At first I was not fond of the way it ended, but after we watched it, I discussed it with my mom and she gave me some pretty good insight on how time periods have their own logic associated with them. In a time full of uncensored prejudice, Ma Rainey's Black Bottom does a wonderful job painting how different sets of black people deal with pain, spite, values, and carving out respect for ourselves during that time. The elements of a play are heavily influential to the format of the film and was quite a nice change of pace. Simply because of I'm a fan of long scenes I was able to soak the themes up pretty effortlessly. Chadwick Boseman does a PHENOMENAL job in what was more than likely his last film. Viola Davis, VIOLA DAVIS, you do not mess with that woman! My goodness, not only did she go through a physical transformation, but my God if it didn't sound like I was listening to my great grandmother speak when she let those lines just roll off of her tongue. I wish more movies had longer scenes like this one but I guess that's hoping for too much. This is a movie that will stick with you after you watch it for a good while. I'd give this film a 7.5/10. My bias on the ending gives it that 7.5, but I'll give it an 8 since there's no halves. I will say, that your rating on this movie may or may not be influenced by your ability to identify with things being said within the film. I highly recommend any and everybody go see it.#RestInPowerChadwickBoseman #WonderfulJobViolaDavis"}, {"id": 128, "text": "Dialogue heavy, raw and powerful in every way; Ma Rainey's Black Bottom is everything you'd expect from an August Wilson adaption with scorching performances from Viola Davis and the late, great Chadwick Boseman.In this drama set in 1927 Chicago, tensions rise between Ma Rainey, her horn player and the white management determined to control the uncontrollable Mother of the Blues. Based on the play by August Wilson.The magic of Ma Rainey's Black Bottom is how everything comes together. The characters, the music, the relevancy and the beauty of it. In a little over 90-minutes, so much happens and so much is said, you may need to view it a second time. The dialogue is key here; every word uttered by the characters are educational and deep. The fact that Ma Rainey was crowned Mother of the Blues and was making the record label tons of money and they still had her and her band record in some dingy prison cell-like studio is appalling. This film is so important but also so sad. The performances are some of the best of the year; Viola Davis is magnificent and majestic. Glynn Turman and Colman Domingo are terrific and vibrant in their respective supporting roles. Of course without Chadwick Boseman this film wouldn't be the same. Boseman carries this drama with so much fire, so much talent it's hard to turn away from the screen. He was incredible force and it really shows here in his final screen role. Between Ma Rainey's Black Bottom and Da Five Bloods, Boseman is deserving of his Oscar praise and I think his family will take one home posthumously for one of those films. A brilliant and vibrant drama that is among the best films of 2020.Follow @snobmedia for all reviews!"}, {"id": 129, "text": "Greetings again from the darkness. As an Executive Producer, Denzel Washington has pledged to bring 10 August Wilson plays (collectively known as 'The Pittsburgh Cycle' or 'Century Cycle') to cinema. The first was the Oscar-nominated FENCES (2016), and George C Wolf directs this, the second. Ruben Santiago-Hudson has adapted Wilson's 1984 play into a feature film vehicle for some of the finest on screen acting we will see this year.Viola Davis (Oscar winner, FENCES) stars as Gertrude Ma Rainey, the Mother of Blues, and the recently deceased Chadwick Boseman co-stars as Levee, her ambitious trumpet player. Ms. Davis delivers a towering performance, and Mr. Boseman leaves us with his career best. The film opens in 1927 rural Georgia with two African-Americans running through the woods under the cover of darkness. If your mind goes where my mind did, we are both wrong. They are headed to a shack acting as a nightclub, and we get our first look and listen at Ma belting out a tune. It's a powerful image and one that expertly sets the tone.Soon we are in Chicago as Ma's band makes their way to a recording studio. Cutler (Colman Santiago, IF BEALE STREET COULD TALK, 2018) plays the trombone and is the de facto leader, Toledo (Glynn Turman, Fargo) is the piano player, and Slow Drag (Michael Potts) plays the bass. The three older men all arrive on time at the studio and are waiting on trumpet player Levee (Boseman) and Ma. When Levee does show up, he struts into the rehearsal room and flashes his new shoes. The generational difference is immediate evident, and the fiery banter is superb. Levee is charming and cocky, while the older men are wise from experience and have undoubtedly seen dozens of Levees throughout their years. Cutler's strong religious beliefs become known and Toledo's sage advice falls on deaf ears.Ma literally crashes into the scene, and we quickly understand that this woman will apologize for nothing, and has earned the right to call her own shots - even if that's only true in this one corner of the universe. She understand the power her record sales give her, and she seizes every possible upper hand - whether it's which arrangement to sing on a song, allowing her stuttering nephew to record, or even demanding a cold coca-cola before singing. Ma speaks in third person and her attitude is not that of a warm, grateful person, but rather of a woman who understands what she has earned. When she says, All they want is my voice, we know exactly what she means.More collisions occur, this time figuratively. There is a collision of swagger between Ma and Levee. The collision of generations with Levee and the band. Finally, there is the collision of Levee and the white man. Ma wants to sing her songs on the record the way she sings them for her fans, while Levee is pushing for the new up-tempo sound. Levee's ambition for songwriting and putting together his own band clashes with the older musicians who are satisfied to be working, and Levee tries to play the game by playing up to the white men in power, only to be taught the lesson that his bandmates tried to warn him of.Wilson is known for his speeches, and the key players get their moment. Toledo describes blacks as the leftovers, while Ma describes white people listening to the blues ... They hear it come out, but they don't know how it got there. These are powerful moments, yet standing above them are the two soliloquies we hear from Levee. The first is about his background of family and introduction to white men, while the second is truly an other-worldly cinematic moment - he contests the unwavering religious beliefs in what ultimately proves to be the most tragic way. It's a scene which will be Mr. Boseman's long-lasting acting legacy.Supporting work is provided by Jeremy Shamos as Ma's agent Irvin, Taylour Paige as another line in the sand between Ma and Levee, Dusan Brown as Ma's nephew, and Jonny Coyne as the studio owner/producer. This is not so much a story, but rather inspiration for us to assemble the various pieces into the backstories of these characters. It's a way for us to better understand what they did to get here, and how they are handling it now. Step on the shoes at your own peril. When someone overcomes so much in life, they aren't likely to back down gently. The music is terrific, the message is strong, and the performances are unforgettable. Now streaming on Netflix"}, {"id": 130, "text": "The first installment of August Wilson adaptations backed by Denzel Washington since 2016's very well received Fences, Ma Rainey's Black Bottom has taken on a whole new significance as a cinematic product due to the untimely and heartbreaking loss of its star Chadwick Boseman.This time only contributing to the film by a producing reign, with directional duties falling to George C. Wolfe, Washington's collection of films may never take on such an added significance as Black Bottom does to showcase the exceptional talents of a performer taken far too soon, in what is an awards caliber performance in a production that thrives with his presence but lacks in other areas, making Wolfe's stagey adaptation an intense watch but not one that is likely to linger.Sticking very much too Wilson's original text that features real life singer Ma Rainey (a showy and very sweaty Viola Davis) featuring in a fictional tale that takes place in a recording studio in Chicago on a hot Summer's day in 1927, Black Bottom at times enthralls as we watch Rainey's band bicker and banter around her tardy recording studio session, with Boseman's sassy and talented horn player Levee exploring his past and talking about his future in a landscape that wasn't one to provide a fair playing field.Founded on some incredible monologues about his parents and God's seeming abandonment in his life, Boseman may've well known this could be one of his last chances to showcase his skills in a film and he saves one of his best turns till last.Knowing what we know now, its clear to see Boseman's physical appearance and ever wide smile showing chinks and scars of a man battling an horrific disease but his charisma and energy is still there to see and its not going to be at all surprising to see the well-loved performer appear in many awards ceremonies in the coming months with this turn here far more memorable than his overrated work in the unduly praised Da 5 Bloods.The rest of Wolfe's film outside of Boseman's commanding turn doesn't leave much to write home about, Davis is her typically assured self even if her singing scenes don't come off as totally convincing and the films period costumes and production design is high class but there's not a lot within this product as a movie that does anything much a stage play couldn't of done with previous Wilson offering Fences managing to make itself feel bigger than its small confines through smartly designed direction and a more focused narrative.At days end Black Bottom tackles some always timely issues of race and is a fitting swansong to a great talent but its not a film that is deserving of any of the extra praise its poised to get due to the surrounding circumstances of its release.Final Say -This latest Netflix prestige drama is more proficient than we've come to expect from the streaming service but despite its fine central performances, Ma Rainey's Black Bottom is still lacking a certain magic and scope that would've made it a truly deserving awards contender.3 1/2 stuttering nephews out of 5"}, {"id": 131, "text": "Should be added to the film school repertoire of how to write an indie film. Sure, it feels like a play because it is based on a play, but the dialogue and overall writing is superb. Acting, great, the overall look of the film, great. This is what an independent film should aspire to be. It was kind of along the lines of Whiplash, but more contained. I see nominations (Oscar? Emmy? Not sure what this qualifies as), and possible awards for writing, acting, and maybe music or production.It had that thing I felt Selma was missing. Selma had powerful moments but then sort of flatlined for long chunks of the film of dialogue that wasn't particularly compelling or intriguing. The dialogue and scenes of the band members in the practice room were some of the best I've seen in a while. Levee and Toledo really stole the show from Viola Davis, with their dialogue back and forth and performance. Viola Davis was fantastic, but, we all knew she would be, but I was most sucked in by the dialogue in the band room, which I've not seen that kind of writing since Winnie Holzeman in the '90s. You have your failed attempts, like Little Woman, by Greta Gerwig, which is more like a Zack Snyder of, looks pretty but not much substance.You have to wonder if the writer teamed up with Jordan Peele what delicious and interesting things they could create. Sure, two very different types of writers but why not give a studio film an actual soul?It was also interesting from the perspective of how the entertainment industry has changed and progressed from where it was, and how it's also changed very little. You compare the old timers in the band as the ones who learned to play the game, and the young Levee who thinks he's going to be the game. That hasn't changed. Kind of, you learn to play the game or the game plays you, and rolls right over your corpse and continues on.Overall, great film"}, {"id": 132, "text": "Sporting Ma's oleaginous, smudgy war paint and flamboyant outfit, Davis goes for broke in the prima donna default (her singing is dubbed, right?), Ma can't suffer gladly anyone who doesn't bend to her biddings, neither the subservient manager Irvin (Shamos), the dour-looking producer Sturdyvant (Coyne), nor those who have the same pigmentation like hers. Being a colored woman who make good in the societal echelon, she has the clout to be nobody's doormat, her pride festering into conceit and her pertinacious insistence of equal respect making her egocentric (giving white lickspittles a taste of their own medicine, she can also stand pat with nepotism). It is interesting that there is no love lost between Ma and Levee, under any mitigated circumstances, the pair could have hit it off and put their talents together into greater use. Yet, can't we not relate to Ma? Anyone in her position will be none the wiser, her bluntness and high-handedness reflects how she manages to cope with a vastly unjust, racist world at large, Davis again, amps up the decibel and bulldozes any obstruction with her utterly transfixing verve and flexibility.reading my full review on my blog: cinema omnivore"}, {"id": 133, "text": "A very good film in the style of another famous August Wilson adaptation, Fences. A stage adaptation that serves for many aspects. An interesting artist biopic, a story about human rights and the dark sides of fame in a way. Its beautifully shot and excellently performed. Viola Davis is fantastic as Ma Rainey, a very self-confident singer who is a true Diva. The magic of Davis' performance is that she did not make her cartoonish, which could have easily happened, but behind that self confidence, she gave he role something vulnerable. Excellent and absolutely award worthy. Also Chadwick Boseman's sadly final performance is a real triumph. He gave everything with this performance. There are at least three scenes that went under my skin, and primarily because of how he played and portrayed this quite twisted character. Good supporting performances by Glyn Turman and Colman Domingo round up this exceptional ensemble. The direction was fine, the look was great and very authentic. Not the best ending for an otherwise great film, but absolutely worth to see and very memorable. Great follow up of Fences for sure."}, {"id": 134, "text": "This is one of those movies that has a great trailer but in my opinion apart from some wonderful performances by Viola Davis as Ma Rainey and The Late Chadwick Boseman as Levee a musician in her band the script based on a play by August Wilson disappointed me. I felt I'd seen this type of story before anc done much better in films like Lady Sings the Blues  1972 and Lady Day at Emerson's Bar and Grill or What's Love Got To Do With It? Perhaps because this film is just a tiny excerpt of Ma Rainey's life I would have liked to know more about the character as I'd never heard of her before? I read after the movie that Gertrude Ma Rainey (born Gertrude Pridgett, April 26, 1886 - December 22, 1939 was one of the earliest African-American professional blues singers and one of the first generation of blues singers to record. The Mother of the Blues, and that she bridged earlier vaudeville and the authentic expression of southern blues, influencing a generation of blues singers. When I first saw the trailer I thought it was based on the more famous Blues Singer Bessie Smith who sang and performed about the same time and had a very dramatic story and experienced terrible treatment and discrimination. It may be that Ma Rainey seems static because it feels like a film of a play and after reading that George C Wolfe is acknowledged as an acclaimed Broadway director producer so that could explain why it seemed like a play to me. I felt similar about the film version of August Wilson's Fences 2016 which I enjoyed more than Ma Rainey. Dubbed the Mother of the Blues, Ma Rainey is boldly unapologetic, which Viola Davis embraced when crafting her performance. ... Davis sings one song, Those Dogs Of Mine, herself (soul singer Maxayn Lewis isbehind the rest of the vocals). Set in Chicago, 1927 during a recording session. Tensions rise between Ma Rainey, her ambitious horn player and the white management determined to control the uncontrollable Mother of the Blues. Based on Pulitzer Prize winner August Wilson's play. There may be a few acting Academy Awards handed out for acting ,costumes or makeup but for me the film itself just didn't grab me as great . Viola Davis looks amazing padded up and made up to look much older and matronly thanks to a great make up artist and is a brilliant actress . The sets and costumes are impressive I wanted to like this film I love The Blues singers of that era but the script just didn't impress me . The movie is appropriately dedicated to Chadwick Boseman who tragically died at 43 years old about a year after filming completed."}, {"id": 135, "text": "A ballad for blue's A performance to last a lifetime.Ma Rainey's Black Bottom brought in fresh air for 2020, to sit back and be captured by great performances, great writing, and most of all, the blues.To start, the cast of Ma Rainey is a cast you could only dream of. Every performance is filled with so many layers, all complex and so intriguing. They all have a rhythm with each other, a vibe if you would. It's the type of vibe of co-workers that both like and dislike each other. But none of them could steal the show like the late Chadwick Boseman as Levee.Boseman gave his best performance of his career, at the end of his life. His portrayal of the rebellious trumpet player makes you laugh, cry, and downright afraid of him. I can't remember when an actor could make any of us feel like that. Boseman opens up and is transformed with energy, fire, and of course a trumpet.Viola Davis, who plays the titular Mother of the Blues, is unrecognizable in this role. Truly giving her all to portray the diva with love, truth, and power. Her singing is exceptionally smooth and takes you away for brief moments, moments for injustice, the emotional monologues, and allows you to enjoy the music.George C. Wolfe's smart direction lets the actors play the music of August Wilson's words while giving powerful symbols of racial injustice in America.This film may be about Ma Rainey herself, but it is ultametly about Boseman, a man whose performances changed the world. This may be his last performances, but this is a performance to last a lifetime.Thank you Chadwich Boseman, for everything."}, {"id": 136, "text": "IN BRIEF: Two powerful performances and the words of August Wilson make this film must-see viewing.JIM'S REVIEW: (HIGHLY RECOMMENDED) As motherhood goes, Ma Rainey is not the most nurturing kind. She wants what she wants and will use her clout to get it, sucking all the air in the room and suffocating those anywhere near her vicinity. And Ma Rainey's Black Bottom is an excellent film that puts its character center stage, making demands and expecting those around her to jump to it and listen.Shrewdly adapted by Ruben Santiago-Hudson from August Wilson's Tony-nominated play, we are transported to a recording studio in Chicago, 1927. It is there that Ma and her band meet to do a session together and, in the process, we glimpse the racial unrest. Tensions rises as a talented horn player named Levee (Chadwick Boseman) wants to re-orchestrate Ma's tunes to a younger crowd, but Ma won't have it, even as her white producers try to change her mind and control the Mother of the Blues.But there's no controlling her...or Viola Davis in a terrific performance as a talented Black woman who wants her dues (and a Coke). The caked-on eye make-up and over-the-top stance accentuates the years of anguish that this character endured and Ms. Davis takes control of this unlikable show biz diva. It is a bold and commanding performance that never wants your sympathies. Providing the needed conflict is the late Mr. Boseman in his final role.And what a way to be remembered! This is the role that delivers his personal best and cements his legendary career as an accomplished actor. His exhilarating performance is thrilling to behold. Up against Ms. Davis, he creates a bitter and complex character that is all charm and hidden rage. Mr. Boseman's masterful line delivery and anguished face in his many tirades tells it all. The actor crystalizes Levee's dangerous swagger to amazing effect. These are two of the best performances one will see this year.Giving ample support are Colman Domingo, Michael Potts, Jonny Coyne as his bandmates. But foremost is veteran actor Glynn Turman as Toledo. His primary speech is truly moving and a sadly accurate observation by the gifted playwright. The actor nails his shining moment and then some.In fact, there is much speechifying in this drama and the able cast is consistently strong. And that is a testament to Mr. Wilson's great prose. His numerous monologues are sheer poetry and their insights about racial oppression are memorable. Screenwriter Santiago-Hudson is wise to let Wilson's words be. He does respect his source and those glorious words do resonate and underscore years of unrest most eloquently.However, I do think that there are some minor flaws in this important film. George C. Wilson does a solid job directing this work of art. He crafts his film gloriously, with Ann Roth's period costumes and Bradford Marsalis' jazz-infused score. But try as he may to open up the play, it's still has a nagging staginess to it. Where Mr. Wolfe is most successful is his repeated use of close-ups which allows his ensemble to speak and be heard. The film is also a tad anti-climatic and could have had more impact in its final moments. More scenes outside the studio could have strengthened and lengthen this film, giving moviegoers more atmosphere and added details of the era. But these concerns are slight.In Ma Rainey's Black Bottom. all the hurt, pain, and torment is on full display. Thanks to a fine cast and Mr. Wilson's enthralling dialog, this film sings the blues most powerfully. One of the year's best. (GRADE: B+)"}, {"id": 137, "text": "Blues help you get out of bed in the morning. Ma Rainey (Viola Davis)Ma Rainey looks like she would get up on the wrong side of that bed, but she sure can sing the blues on either side. In Netflix's Ma Rainey's Black Bottom, Davis plays another survivor, this one the opposite of her submissive wife to Denzel's domineering husband in August Wilson's Fences (1985 play).Washington produces this 1982 Wilson play, and he casts another strong Black actor, Chadwick Bozeman, to play Ma's feisty young horn player. Because Levee wants arrangements of their blues to be fleet with the spirit and pace of jazz, he gets the white promoters to back him, to little avail because Ma wants it her old way. Negotiating with the charismatic Ma or even playing music doesn't happen until she gets her ice-old Coca Cola. Old school prevails even if Levee is right.The natural tension between stasis and progress allows Bozeman to act half-crazed and inspired, a tour de force performance fitting for his last one before his death. Amazing is his acting range from a cool leader in Black Panther to a hothead in this drama. He has a minimum of two extended speeches, one almost five minutes about a disturbing crime he witnessed and his father's revenge on the perpetrators. I challenge you to go to the fridge during these impassioned pleas for justice.It's not difficult to see Levee carrying on the angry legacy of his father in a world on the brink of massive racism as Blacks migrate to the North and its entrenched resistance. Ma's players are constantly negotiating for payment from the white business manager and recording studio owner, both of whom are capitalists, not humanists.As in Wilson's Fences, the action takes place in only two spaces, here in a recording studio and in a basement practice room for a 1927 Chicago recording session. A brief foray onto the street brings more conflict, as if there weren't enough inside.Ma Rainey's Black Bottom is made for stage or film because the dialogue is electric and human. Sometimes the vernacular and rapid pace are challenging to understand; well, then, just rewind or use closed caption: They hear it (blues) come out, but they don't know how it got there. They don't understand that that's life's way of talking. (Ma)Ma says it all about black/white conflict and the tensions of artistic creativity: They gonna treat me the way I want to be treated no matter how much it hurt 'em. It's tough out there, 1927 or 2020."}], "reviews_amount": 138}