{"name": "Suraj Pe Mangal Bhari", "titleId": "tt10731264", "reviews": [{"id": 0, "text": "I bet it will make you laugh even if you are so worried about Corona. Great movie after a long time. What a natural actor Diljit. Will watch again!!!"}, {"id": 1, "text": "Nice movie and manoj Bajpayee at his best nice entertaining filmDon't provide hate comments First watch the film and talk be realistic"}, {"id": 2, "text": "Suraj pe mangal bhari is amazing movie sana diljit manoj r superb perform in this movie and this movie song basanti is one of the best song ever"}, {"id": 3, "text": "You can watch with your friend and family All satrcast give best performance"}, {"id": 4, "text": "It's a Decent movie. Story of First half is very good but climax is simple or as usual. Some dialogues are also Good. Diljit Pajji's dialogue delivery have special mention in the movie. Performance of Manoj sir is Good not top notch. Fatima sana saikh is Average."}, {"id": 5, "text": "A good start but then whole movie was a waste trash, can't even imagine manoj sir could deliver this kind of trash"}, {"id": 6, "text": "So Nice Movie It's Family Movie Nt bad Diljeet Dosanjh &amp; Manoj Bajpeyi Perfect Combo Fr Comedy Movie.... Watch It Atleast One Time Guys !"}, {"id": 7, "text": "Don't know why so many negative reviews are there of this film. It's not at all a bad film. At least the movie succeeds to make you laugh and that's what we need. It's a good commercial comedy film.Because here the performances are good. Comic timing of Diljit Dosanjh is superb. Supporting cast are full of brilliant actors, so they are nice. Even the dance of Manoj will make you laugh. There's also a surprise cameo in the film and that steals the show."}, {"id": 8, "text": "It was good movie full Of laughter this movie r awsome Diljit &amp; manoj sir comedy timing best"}, {"id": 9, "text": "It was good movie and full of laughter 😊😊😊😊this movie r awsome all actor r good performance specialy Diljit &amp; manoj sir bounding r good comedy"}, {"id": 10, "text": "Full family Entertainer. A must watch. Don't listen to the ppl who r trying to get the rating down. Its a beautiful film. Definitely will keep a smile on your face. Thank you!"}, {"id": 11, "text": "Overall , seems like a half cooked dish. Manoj Bajpayee overacted Annu Kapoor had little to do , but he did his part of job Other performance were below average."}, {"id": 12, "text": "There is no logic in the story. Acting is poor quality and silly."}, {"id": 13, "text": "I personally loved it. The film is set in 90's era and the love story between Suraj and Tulsi is such a treat to watch. Mangal (Manoj Bajpai) has a fabulous job in the film. A must watch for their performances. So overall it's a complete family fun movie to watch this season."}, {"id": 14, "text": "Very Frustrated Indian Movies. Acting Of Individual Actor Like Daljit Very Bad Impression."}, {"id": 15, "text": "Total time waste . Pleas do not spoil your mood and money on this movie. Only actors worth mentioning is Manoj Bajpai and Vijay Raaj"}, {"id": 16, "text": "Don't waste Ur hard earned money on things like these"}, {"id": 17, "text": "Totally illogical movie . No base line story it's just roaming around here and there with unnecessary twists and turns . Hard to watch full movie.. actually I couldn't. I would say it's waste of time and money ."}, {"id": 18, "text": "Nice movie, story and theme but all characters face show so ugly"}, {"id": 19, "text": "It is okay for one time watch. You wont feel bored but its not that great either. I like Diljit but his hindi accent is horrible. I dont know whats wrong with the lipsticks used by Fatima.. its too gaudy. I tried to ignore but couldn't. :) :) Manoj Bajpayee is good as usual. Dont keep your expectations too high, just watch it and have fun."}, {"id": 20, "text": "Good movie of 2020 , best action, comedy and amazing acting. I recommend u to watch once ,it really gonna enjoy it I loved it......"}, {"id": 21, "text": "Went to see one of my favourite manoj bajpai sir and come out as a huge fan of Diljit paji. Manoj B and diljit's chemistry in the movie is amazing. Cherry on the top: Manoj &amp; Seema Supriya FatimaOther actors are fantastic too but their role was very small."}, {"id": 22, "text": "Movie is about a detective who investigates marriage cases. Its being fun watching. Both actors are awesome. Actress is preety. Story line revolves in and around. One time Watch movie. Okay movie."}, {"id": 23, "text": "What an outstanding performance by Manoj. I wanted to skip this movie because of the negative reviews but still took the risk and watched it with my family. It was such an entertainer. Everyone at home enjoyed it. Awesome one time watch movie.Though manojs acting can ve watched again and again. Specially that aunty part. Such magnigicient acting."}, {"id": 24, "text": "Nice comedy Diljit dialogues !! Very funny Manoj steal the show.."}, {"id": 25, "text": "Nice and unique story. Brilliant and outstanding actors are like cherry on top. Diljit, Manoj and Fatima are pillars. Good movie to watch along with family and friends. Do watch it."}, {"id": 26, "text": "Its a fun movie, better than I expected, ignore the bad reviews, good way to spend 2 hrs with your friends"}, {"id": 27, "text": "When you have Manoj Bajpayee in the movie...it is already a HIT. Diljit Dosanjh playing the character of 'Suraj Singh Dhillon' is exceptional. This is a very light-hearted comedy entertainment of the year. Very punchy dialogues, very good acting, very good sense of humor. Manoj Bajpayee is super outstanding in the character of 'Madhu Mangal Raane'. The movie goes on like rat &amp; mouse race between Manoj Bajpayee &amp; Diljit Dosanjh. It will definitely put smile on the face. Overall an excellent movie to watch with family."}, {"id": 28, "text": "A fun packed family movie and will refresh you for sure"}, {"id": 29, "text": "Never understood the motivations of the antagonist.Good acting saved this movie. Manoj, Comedy is not your forte. Dialogues seemed like they were strung together"}, {"id": 30, "text": "This is the future of cinema we want, and this is good family movie to watch on theatre, everyone is stuck around covid but actually nobody gives a damn about covid so if you love family movies then it's a perfect match to watch it with family in theatres so please don't let this type of movies to be flop because this may cause you to watch movies as baaghi and student of the year for whole life except from the Hollywood 😅"}, {"id": 31, "text": "Movie was good with bad bad acting of manoj vajpayee. If you're favorite actor manoj vajpayee then you can't enjoy this movie."}, {"id": 32, "text": "Kangana is tatti kanagana is it cell ki chamchiGive this movie 10stars everyone if u support diljeet paaji and farmers"}, {"id": 33, "text": "Have your family sit along with you and ready for a entertainment ride. Superb acting by Manoj Bajpayee and Diljit Dosanjh. If you have liked the Lootcase, you will definitely love this."}, {"id": 34, "text": "One of the best film which I have seen in covid situation.. Would like to thankful to each n every cast.. Well good"}, {"id": 35, "text": "Writing is spectacular and above all is the acting of Manoj Bajpai, Manuj Sharma and Diljit Dosanjh as usual.Cast is amazing and request you to make many movie with this cast. Dialogue Writer: I really appreciate your work.Thanks a million for making us laugh loudly."}, {"id": 36, "text": "By releasing today on ott platform it's a good move from the makersIt's a timepass chill out movie Don't expect anything great as it would be more hilariousManoj and Diljit played a normal roleFirst half was boring but the second half was watchableHave fun"}, {"id": 37, "text": "Dont go for fake ratings of khans, watch and you will understand the biased ratings!"}, {"id": 38, "text": "Its 1 of the best comedy movie. Its been a long since a watch a movie on theater and this is the 1st movie I watch full of full and entertainment 😍"}, {"id": 39, "text": "Awesome movie..Great performances by all artists.Diljit has done a great job and so has Manoj bajpyee who has played the role of a detective."}, {"id": 40, "text": "I went in with enthusiasm. I can get behind any film which begins with Diljit looking into the camera and saying, 'Hi Peoples.' He plays Suraj, a 28-year-old desperate to get married. The actor works like an energizing shot of goofy charm and adrenaline. You have no option but to smile. His signature Punjabi liveliness contrasts nicely with Manoj, who mines his tightly-wound intensity for laughs. Manoj plays Madhu Mangal Rane, a private detective who specializes in investigating prospective grooms. He is a master of disguise on a mission to ensure that no woman settles for a substandard spouse. Mangal wrecks one of Suraj's rishtas. So Suraj decides to take revenge by romancing Mangal's sister Tulsi, who has some secrets of her own. It's a set-up with potential but director Abhishek Sharma, who earlier made Tere Bin Laden: Dead or Alive and The Zoya Factor, botches it up. Suraj Pe Mangal Bhari saddles its solid cast with lame jokes, inane plot twists and dull storytelling.READ THE FULL ARTICLE ON FILM COMPANION"}, {"id": 41, "text": "After 8 months of all the tensions finally a relief, a film to make you smile and laugh. Had a lovely time watching it with fmaily. Full family Entertainer."}, {"id": 42, "text": "Watch it for Diljit.It's a joyable ride and u wont regret watching it."}, {"id": 43, "text": "Some gems of bollywood placed together but nothing to be mentioned as this movie is all about Suraj ( Diljit ) vs Mangal ( Manoj Bajpai ) and ofcourse suraj's friend sukhi rest of the chracters are great as support and Fatima sana sheikh is as talanted as beautiful . It is a simple pleasent fun movie. Comedy is nice story is simple and fine.. it was worth a watch"}, {"id": 44, "text": "Over hyped movie , 2/5 not worth the time, watch something else"}, {"id": 45, "text": "Don't watch this movie. Don't waste time on these bollywood movies."}, {"id": 46, "text": "It's not comedy . it's an insult. i dnt see comedy here.. it's big waste of time and money.. a movie with out sense or theme."}, {"id": 47, "text": "Instead of good actors like vijay raaz , manoj Bajpai and annu kapoor film is not worth watching ....the overacting of diljit dosanjh have ruined the all good work of other actors .... He may be a good singer but acting especially in bollywood is not his cup of tea ....this type of senseless acting is good for punjabi movies which noone watch ... Bollywood needs to understand one thing that their is so much competition in market due to OTT platform...They need to select good actors and good script to stay in market..."}, {"id": 48, "text": "Even with Good story with fantastic cast there are no jokes, some punches not any scene where you can laugh open your hands . I should say if they work bit more on writing and add some funny scenes it could be a great movie . Writer and director didn't used a plot to make people laugh. i did a mistake , Please don't REPEAT !!!!!!"}, {"id": 49, "text": "For time pass its okay if dont have anything else to do.. dont waste money.. just wait for someone to upload on YouTube..."}, {"id": 50, "text": "Torture Torture Torture!!! Do your self a favour guys please don't watch it."}, {"id": 51, "text": "With such good caste, the movie turned out to be so boring. Only 15mins of Vijay Raj were the saving grace. Screenplay and dialogues are too poor and outdated that you need to push too hard to laugh. Neither a good drama nor a comedy movie. Utterly disappointed."}, {"id": 52, "text": "They just wasted a very talented actor, story is so predictable, jokes sounds like written by 3 years old. Fatima sana looks nice, diljit should quit acting, &amp; i just to ask one question to Manoj Sir... WHY?????????"}, {"id": 53, "text": "This is for sure that that daljit can't act.bored a lot."}, {"id": 54, "text": "Real waste of time and Money Needs to work on better story as compared to other movies"}, {"id": 55, "text": "Worst movie of 2020.. Waste of time Worst actor diljit.."}, {"id": 56, "text": "Story was not good. Only thing I liked was Manoj Bajpai's acting."}, {"id": 57, "text": "SURAJ PE MANGAL BHARI is Directed by : Abhishek SharmaCast : Diljit Dosanjh Fatima Sana Sheikh Manoj BajpaiStory: In the 1990s, a wedding detective has to perform background checks on prospective grooms. In the time before social media and mobile phones, everything has to be done in person.Cast Performance Diljit is Best Actor and in this movie He Does Amazing Performance Manoj Does Amazing Job in this MovieI give 8.5/10 to this Movie"}, {"id": 58, "text": "I tried to laugh but could not.. timing and content both were bad."}, {"id": 59, "text": "You called a movie like this an entertainment... poor entertainment and plainly boring"}, {"id": 60, "text": "Not so good movie as expected the movie is not a good comedy movie but also manoj bajpayee is wasted the movie is hurting religious sentiments."}, {"id": 61, "text": "Story is so boring but acting of manoj sir is very excellent."}, {"id": 62, "text": "Waste of time and money. Diljet's acting is worst than the street play in big city."}, {"id": 63, "text": "Now it became pathetic to watch Daljit as an actor. Manoj Bajpai is an amazing actor and I think only because of him this movie got some rating or else it would have been 1."}, {"id": 64, "text": "Love diljit dosanjh and it's a very good movie by Zoe studios"}, {"id": 65, "text": "Best ever comedy movie.Acting of diljit is far better than all khans,and you never get bored in any part of movie.i dont know why people giving bad reviews"}, {"id": 66, "text": "Story is unique,diljeet and manoj Vajpayee made normal dialogues stylish. Worth watching."}, {"id": 67, "text": "Diljit dosanjh proved yet again that he is a natural actor... His acting is flawless and smooth.. Manoj bajpayee looks amazing in new comic avtaar, he is verstile actor and can do genre... Fatima is looking cute while speaking marathi .. This movie is full of selfmade , super talented actors who are not nepokids.. A light hearted comedy family film.."}, {"id": 68, "text": "Suraj Pe Mangal Bhari review :The first theatrical release post lockdown; Suraj Pe Mangal Bhari got simultaneously released yesterday on paid platform Zee Plex where I saw it in the comfort and safety of my drawing room.An okey dokey rom com directed by Abhishek Sharma who had made the horrendous Zoya Factor (2019) before this; Suraj (Diljit Dosanjh) and Mangal (Manoj Bajpayee) are two warring characters with Tulshi (Fatima Sana Shaikh) being their focal point. Marathi mulgaa Mangal is Tulshi's protective brother cum wedding detective who spies on prospective grooms and destroys their marriage. His latest victim is Punjabi munda Suraj whose beer guzzling photos land up at his hone wale in-laws place.Next, Suraj falls for Tulshi who reciprocates his advances and its only a few minutes of screen time until Detective Mangal gets to know..The screenplay is filled with illogical situations like a brother spoiling his sisters marriage just to get even with someone looks unconvincing, to say the least!! The humour element is intermittently spread across the narrative but dont expect too many lol moments here.Of the cast, Manoj Bajpayee struggles to get the Marathi accent right which mars his overall performance. The various get-ups he dons to investigate his cases havent been utilized optimally. Diljit Dosanjh fits in to the Sardarji character perfectly and is completely natural as Suraj. The pretty Fatima Sana Shaikh pitches in a decent act as the Marathi girl who aspires to be India's first DJ. Her performance is much better than Thugs of Hindostan (2018) where she was lost in the crowd but again, not as effective as her debut Dangal (2016).On the tech front, the production values are akin to a TV serial and the sets appear fake even for a 1995 era. There are two songs and both are enjoyable - I preferred the Karishma Tanna item number right at the beginning of the film.To sum up, Suraj Pe Mangal Bhari is an average fare better suited for an OTT viewing. Glad I didnt risk the theatres!!Regards, Sumeet Nadkarni."}, {"id": 69, "text": "This film is neither good nor bad, just in the middle. The + are: Good humour.Entertaining enough.Not the best film, but Will keep you satisfied and it's an original story, which is very rare in Bollywood as majority movies in Bollywood are South remakes nowadays.The drawbacks: Poor work by the Camera man. Many scenes look like some TV serial type of Vibes.Very dramatic towards the end and really feels like a pain the @$$ tv serial.Overall: 1 time watch."}, {"id": 70, "text": "'Suraj Pe Mangal Bhaari' may not belong to a great laugh riot movie club but it certainly one of the best comedy movies seen this year. This is a pure family movie with no nonsense scenes and foul languages.The story is very simple, and the treatment is good. The first half was bit slow and the movie seems dragged a bit here and there but overall it was a good time pass.I have always been a Manoj Bajpayee fan and he steals the show here. We are not used to seeing Manoj in these kind of roles but he aced it. Diljit is great and he seems comfortable playing these type of roles. Another good movie for him after Good News. Fatima looks stunningly beautiful throughout the film and did well.Anu kapoor deserve a special mention as he was simply great in a limited role. It is always pleasure to watch him.The music was a letdown even the title track was not good enough.All in all a good family entertainer."}, {"id": 71, "text": "Suraj Pe Mangal Bhari (2020) : Movie Review -Abhishak Sharma known for delivering the only great film in his career so far, Parmanu, has failed to give anything on that level. Parmanu was intelligently written and smartly presented film but the same smartness was never seen by Abhishek Sharma in any of his film. His new release Suraj Pe Mangal Bhari adds another unintelligent product in his filmography that people might even doubt about great film like Parmanu was directed by the same man. From the begining till the end Suraj Pe Mangal Bhari does not overweight in any aspects to justify the use of Bhari word in the title.Madhu Mangal Rane, a wedding detective spies and destroys the wedding of well mannered guy Suraj and when Suraj decides to take revenge he falls in love with Madhu's sister Tulsi. How Madhu and Suraj both try to defeat each other is all about rest of Suraj Pe Mangal Bhari. Basically, the script doesn't look like having something new except for the word like Wedding Detective. So, the obvious question is, will the comedy and actors be able to save this weak script? The answer is No. Manoj Bajpayee was never out of form like this. His expressions and characters doesn't make any sense anywhere. Why was he supposed to talk with an accent like a woman when he is a man? It looks nothing less than a Panzy character.Like mentioned above, almost all the characters in the film are written poorly. Maybe the 90s formation wasn't right and that's why all this fiasco happened. Diljit Dosanjh is somewhat funny but nowhere close to hysterical character he played in 'Good Newwz'. Fatima Sana Sheikh looks gorgeous as a Marathi girl but the accent and attitude are below par. Annu Kapoor has very little to do, Manoj Pahwa is decent and the rest of the cast is strictly watchable. When the basic writing fails nothing can save the film but this film somehow manages to float on surface for some time before sinking. Some comedy scenes are funny and also are the only enjoyable scenes in the film.Abhishek Sharma should have gathered all the scattered things in the screenplay before taking the project in hands. When your characters and storyline look unorganised and faltered then no matter how hard you try and how smartly you wanna make things up, the cumulative result was meant to be disastrous. There is hardly anything in the film to watch and in such time when there is nothing good coming from Bollywood it feels even worse to recommend something like this. Skippable!RATING - 4/10*"}], "reviews_amount": 72}