{"name": "Welcome to Sudden Death", "titleId": "tt10804786", "reviews": [{"id": 0, "text": "I like Michael Jai White and enjoy his movies. But his one is bad. I mean, damn. The fight choreography looks like it was done by the kids in this movie. I should've passed on this movie. You should too."}, {"id": 1, "text": "I knew this was going to be a low budget movie but this is just terrible! The acting is so bad and the story plot is even worst! I wish MJW would be in a good movie for once! Whoever directed this should never ever do another movie agian."}, {"id": 2, "text": "I expected Expected cheesy, but it was bad too. Watch at your own risk."}, {"id": 3, "text": "Bad. Very bad. I can't believe I sat through his corny low budget waste of time. Thanks Netflix."}, {"id": 4, "text": "This movie is just plain bad. Characters are stereotyped, the acting is bad and the fight sequences are horrible. The storyline is simple and the script poorly written. Other than Michael Jao White being in it, this movie has nothing to offer."}, {"id": 5, "text": "Go watch the 1995 Van Damme flick. This is a sorry remake of the earlier version"}, {"id": 6, "text": "There is no aspect of entertainment but a lot of flaws to watch for. There were scenes were Dallas Jackson was smiling despite the scene being a serious one. Many scenes seemed apparently erroneous. Wish the director and crew put some extra effort to make a better movie."}, {"id": 7, "text": "Talk about copy cat movie from the original Sudden Death movie! From Jean-Claude Van Damme. This movie was super cheesy super bad."}, {"id": 8, "text": "Some of the worst acting I've ever seen! Avoid this if you can, I wish I had. I had hoped some of the fight scenes might make up for the acting but......Nope😳"}, {"id": 9, "text": "White, come on. Is it your first movie?. On first scene , waking up showed how bad this acting gonna be. Junk movie, instead they should have spend money for homeless people."}, {"id": 10, "text": "I'm speechless! It's a joke! I can't believe Michael Jai White accepted this role! He's awesome, but he must have needed the $ bad."}, {"id": 11, "text": "The low reviews are spot on. If anyone rated this a 10 out of 10 they deserve to be committed to a mental facility. Some scenes are decent at best but overall it's just really awful acting from almost everyone involved. The lead is a good actor but he's the only one. The dialogue is atrocious and I would only watch this movie if that's your thing and you're into watching bad movies. Otherwise if you do waste your time, prepare to be extremely disappointed."}, {"id": 12, "text": "This movie is dead on arrival. A highschool drama club could provide better acting."}, {"id": 13, "text": "Thought it was a comedy movie then saw that it's just a cheap copy cast version of the original movie with JCVD which was way better. This movie totally sucked."}, {"id": 14, "text": "I didn't expect a whole lot, but somehow my expectations were still too high. The dialogue is atrocious and delivered poorly. Some of the characters quip like they know they're in a movie. What few fight sequences there are have been chopped to pieces. The motivations seemed like they existed just for the writer to attempt to make some statement about the military complex.Only gets two stars because Michael Jai White is awesome. Even though he was clearly phoning it in for this movie."}, {"id": 15, "text": "The only reason I gave this 3 stars us because some of the fight scenes were good. This movie is a BADDDD rip off of Jean Claude's movie about a security guard at a hockey game full of terrorists. The acting is bad. The script is bad. The extras are bad. This movie is just bad!"}, {"id": 16, "text": "I never did a review on a movie and as an aspiring actress,I caught second hand embarrassment of the awful acting . I'm glad they were able to be given a shot , but the training just wasn't there . Dialogue was like my kids wrote it. Michael was the best part of this movie. I can imagine how hard it was for him to excel in his craft in this project."}, {"id": 17, "text": "Everybody was kung-fu fightingThose kicks were fast as lightningIn fact it was a little bit frighteningBut they fought with expert timing"}, {"id": 18, "text": "I got 50 minutes into this movie and just could not continue. This movie had potential but if you want a prime example of actors Overacting their roles, watch this prime example."}, {"id": 19, "text": "Gary Owen at his lamest. The best thing about this movie."}, {"id": 20, "text": "There is nothing good in this movie and the actors look like they know that it is a movie"}, {"id": 21, "text": "Basically, it's just another Paul Blart movie. A little grittier, and of course the lead role, played by Kevin James has been recast with the action hero, Michael Jai White. But seriously, this should definitely be categorized as a comedy, not a good one, but definitely a comedy. If you're looking for a laugh, you should watch it tonight. 🤣"}, {"id": 22, "text": "If I could give this movie 0 stars I would. Maybe even a -1000."}, {"id": 23, "text": "This is a Michael Jai White film, do not expect and exceptional storyline or high quality....well anything. Watch this for its ridiculous nature, and Michael Jai White being over the top and some tongue in cheek action and dialogue that is laughably bad, to the point you can't tell if it's on purpose. Watching drunk is best."}, {"id": 24, "text": "Wow. I need clarification... as my bf and I were watching this I honestly thought that the director was intentionally trying to do an action movie (very horribly) my bf was hilariously laughing at the slapstick comedy - trying to convince me that this was a comedy and not an action movie. I'm still confused, and truly worried at the waste of money and time taken to make this academy award winning movie."}, {"id": 25, "text": "No story, terrible fights, really terrible. I give it a 3 because of the clever idea to bring the weapons in."}, {"id": 26, "text": "The acting is so horrible. You just can't get over it. This movie stinks, it's not even hilariously bad. Just bad and super corny."}, {"id": 27, "text": "If I could give it zero stars I would. The plot and the execution of the whole thing was just... bad. Some parts didn't even make sense; the only reason why I finished it is because I was in shock of how bad it was. I mean I usually love anything with Michael Jai White. This was just wow.. and not in a good way."}, {"id": 28, "text": "A really bad movie from the script to the acting one of the worst i have seen in a long time"}, {"id": 29, "text": "Sequel to the 1995 Jean Claude Van Damme film Sudden Death. They must mean remake as it's not a sequel in any capacity. Every part of this movie is awful, even the action. Did anyone tell them that basketball doesn't have sudden death?"}, {"id": 30, "text": "The nonsense starts right away with bad framing, shaky cam where it is not necessary, bad close ups and weird color temperature. Right I away, I knew what I was in for, incompetent camera man, with an incompetent director. That the story would suck, you'll notice 5 minutes in. The unbelievable content aside, the production/post production quality is beyond horrendous. Story - abominable. Acting - laughable. Concept - WHAT THE F....???"}, {"id": 31, "text": "I really do not understand the bad ratings This movie was pure fun. It was like a parody of sudden death. It is hilarious. Michael Jai White was great for the role. Even if it is an action film that looks like a parody of an action film it has nice fight scenes and it kept me alert. I did not get bored Why people are hard on this movie? What did they expect to see? Gone with the wind?"}, {"id": 32, "text": "But hey other than that! Who hires these writers and directors and actors? The movie can't get any worse. There's not a single good thing about this movie. It looks horrible. It has not a single scene that delivers at all. At the fighting should be good, but no it could not be worse and for a fight movie with a fight actor the fights should be watchable, but we even get jipped here too. Stay away from this movie. It's really that bad and probably worse!"}, {"id": 33, "text": "This movie was horrible. I wish I never started this movie."}, {"id": 34, "text": "Acting is terrible. Affects are terrible. Props are terrible. Story line is terrible. As soon as the antagonist didn't know who the governor was of the state he was in. Than proceeds to kill him. I shut my tv off. I mean how do you go about killing a governor who if anything is far more beneficial alive. 2nd the consequences of killing any governor for no reason. Movie literally owes me 20mins."}, {"id": 35, "text": "I have to agree with being buzzed to watch. I mean, I almost have to applaud the absurdity that led to many laughs and mutual scoffing at the unbelievable settings, scenery, and acting with cinematic icing of fight choreography, dialogue, and camera angles. Imagine yourself as royalty enjoying high Jester... at half jest. That being said, we enjoyed the best we made of it! HAHA"}, {"id": 36, "text": "Rakuten rates as a 6.7.... disgracefulPlot has so many holes it's simply dreadfulActing awful35 minutes too long.Could have been so much better"}, {"id": 37, "text": "Well those bills aren't gonna pay themselves. I guess a paycheck is a paycheck. other than michael Jai white there isn't really much there."}, {"id": 38, "text": "Coherent and satisfying low-key action flick about a highly skilled security guard who brings his two kids to work: an arena hosting a crowded Baseball game. A group of terrorists take the Mayor as hostage while they claim revenge on the system. The guard's daughter is mistakenly taken by one of the terrorists and the clock starts clicking as he runs through the place fighting them on search of his daughter. The film presents a few flaws but the actors are pretty good and keep it interesting. It's an atmospheric thriller as well as a fine fighting/shooting hunting story. It never levels the Van Damme original, but it entertains without any judgement."}, {"id": 39, "text": "I can not believe the horrible amount of acting, dialogue, fight choreography and money waisted to make this film. It is so undesirable to watch, I'm certain all the actors, executive producers and film staff felt the same way during its prescreening."}, {"id": 40, "text": "It was bad from the opening scene. The fights looked horribly choreographed, the story was old and stale, the acting was below b rated. Just hard to watch. It sucked."}, {"id": 41, "text": "But seriously, don't. This is the worst thing produced ever. Couldn't get through 20 minutes without needing to turn it off. Terrible acting, terrible production, pointless lines and language. Save yourself."}, {"id": 42, "text": "It kept me entertained,a action movie that never stopped,Gary Owen was awesome in this movie,Michael jai white was great also, I do not understand the low reviews,i was not expecting a blockbuster movie,it is on Netflix for christ sake so it was definitely a awesome netflix movie,keyword Netflix"}, {"id": 43, "text": "This movie is so bad it was good to me lmao the whole time I'm looking at it I'm laughing how bad it is from the acting to the fighting I was like wow this is a bad well put together movie just awful lol gary omg gary was the bright spot of the movie to me is acting was bad but I just enjoy his effort lmao"}, {"id": 44, "text": "I absolutely love Michael Jai White. Action from start to finish. The comedy from Gary Owens was a good casting job as well. Good job."}, {"id": 45, "text": "When it comes to Action, Welcome to sudden death is it. The storyline was good. Movie went straight to the point. Fight scenes I had to go get my popcorn and enjoy."}, {"id": 46, "text": "I'm able to enjoy masterpieces and movies like this. A lot of haters who are not able to enjoy their lives and try to ruin the other's lives... I'm sorry Guys, it doesn't work like that, you will only to make your lives worse. A decent movie, acting was honest, I like martial arts, so I really enjoyed the fighting, for me Michael J White is very good at, but as I'm not expert, I can't judge anything about. The pace was good, the actions much more than acceptable. Predictable, nothing new? So what? When I watch a movie I want to have some fun and about this movie I don't have anything to complain. If you are used to enjoy even the small things that the life offers you, then you will appreciate this movie as it is, otherwise..."}, {"id": 47, "text": "This movie is a pure joy. The good guy wins. He's invincible The bad guys lose. They deserve it. I cheered. I laughed. I enjoyed a happy ending. People who pan this movie just don't get it. You want Shakespeare? You're in the wrong place."}, {"id": 48, "text": "Grade school actors. Terrible, just terrible. Did get a good laugh out of them, though. I hope they didn't quit their day job."}, {"id": 49, "text": "Despite a majority of people giving this one a very low review, I really enjoyed this film. Look its B-movie and its clear the budget wasn't there. Also some of the acting was incredibly subpar. However it kind of gave me an early 2000's movie kind of vibe. With enough quirky humor and action to get you through the movie perfectly fine. Will it win any rewards? Absolutely not. But as quick saturday night watch it'll definitely do the job."}, {"id": 50, "text": "Everything is horrible about this movie, the actors, the acting, the dialogue, the storyline and the action. The worst action movie I have seen - even worse than the original Van Damme movie."}, {"id": 51, "text": "Very poor acting Sometimes looked like robots The first few minutes look OK but the rest is boring due to poor acting"}, {"id": 52, "text": "Some neat action scenes, but its a spoof of action films right? I can't believe how cliched the acting and plot is.Some good unintentional laughs that's for sure!"}, {"id": 53, "text": "I was SO excited to see another Michael Jai White movie out. He is one of the most under-rated actors of our time and his real world knowledge of martial arts usually translates very well on screen.However... Even he couldn't save this one. I made it 40 minutes before turning it off. The action/fighting sequences were terrible and the acting was worse. The characters were either dry and forgettable or over acted. If it were a comedy, I could forgive the over acting and stereo typed characters but not in an action movie.I don't know how this movie ends, nor do I care."}, {"id": 54, "text": "There are cute, smart-mouthed kids, a comic relief janitor, EXTREMELY generic bad guys, rich and powerful idiots making fools of themselves. This had to be written by a team who learned everything from the Disney Channel. Except for the violent killing, of course..."}, {"id": 55, "text": "How can the guy who was Black Dynamite continue to involve himself in junk like this? I'm not saying he should do Hamlet or a remake of Cries and Whispers. but jeez...c'mon guy, you can do so much better than this. He clearly has a lot of presence onscreen and doesn't seem to be a complete boob. What is his problem? Just awful, what a waste."}, {"id": 56, "text": "Ridiculous...acting, Ridiculous... story, ridiculous... effects... so bad that's is hurt"}, {"id": 57, "text": "I pretty sure the most of the basketball scenes were played on loop. Horrible acting. Very disappointed in White for taking this role. A lot of the story line even doesn't make sense. Like he could have changed his shirt and the bad guys wouldn't have known who he was!!"}, {"id": 58, "text": "It's not often I write a review, but I felt this time it was necessary to help prevent others making the same mistake. It's hard to describe how seriously terrible this film is, it's not even worthy of one star. Staggering how garbage like this makes it into production. Fight sequences are beyond dumb, slow and robotic. Monumental waste of time and money!"}, {"id": 59, "text": "My God, what a rarely bad movie people. It's so bad that its kind of funny. Dialogs are like,... i don't have a word, totally out of diction and out of sink. There is no story telling, only intro, the rest is non existable. Fighting scenes haha :D Few bunch of people gathered, ok lets spend some money make a movie in 10 days it seams to me. If it was parody yeah i could give it review mark 3 but here is the the proud one (1) * star, 'it' deserves it. What a charade hah :)"}, {"id": 60, "text": "Where do I start the acting/dialogue is poor, the fight scenes are really badly staged. You can see them getting into position to be hit. The whole film reminds me of jean claudes sudden death film. Only finished watching because I was bored."}, {"id": 61, "text": "That was some funny shiz!Action packed thriller!"}, {"id": 62, "text": "This movie is so bad that it physically hurts to watch... the acting is so unbelievably awful that they could have used a team of ventriloquists and puppets and it would have been better, it's hard to believe that they couldn't even a get a decent looking team, they looked like soccer players, I mean how hard is it to get a decent looking basketball team? (FYI, they looped they same play every time they showed the team playing), it was a horrifying experience, I'll need months of therapy and a strong drug regiment to overcome this trauma."}, {"id": 63, "text": "The story line is pretty much the same as before.So I went in hoping there would be some good fight scenes. It delivered in that sense. If you're like for something easy to follow, a little bit of comedy.You can go hit the kitchen and get some food and not have to worry about missing any serious plot points."}, {"id": 64, "text": "I just give it a five star rating because I felt sorry for the film. This was just terrible. Acting needs work and the fight choreography was too choreographed so it doesn't like a real fight. Definitely disappointed and I'm big Michael Jai White fan."}, {"id": 65, "text": "10/18/2020 I've always looked forward to watching anything with Michael Jai White in it, but this movie starts off as a potential big time stinker? The happy black , whiter -than-rice family comes across as fake, fake and extra fake! All of that has less to do with the actors/the outcome of the movie because the sole responsibility of their on screen acting abilities and dialog they're given falls directly on the writer and/or director, both of whom are Dallas Jackson. He and he alone controls the outcome of what we get to see on the screen but as this movie plays out we're being forced to watch this overload bunch of happy/sappy/toothy achy/breaky cracker and blacker actors do their best fake human being act. As a really old cracker I know FAKEY when I see it. Even the bad guys were all toothy and happy/smiling. Why? This movie did not improve as it played out so the IMDb low score reviews that I read beforehand were absolutely correct. It is a certified/bonified stinker! Watch if you dare? Bon Appetit'"}, {"id": 66, "text": "This movie should be used as a guide to how to not make an action movie! Seriously its bad, actually bad doesn't do this justice! It's terrible... poor acting, ridiculous plot, over the top fight scenes. *** SPOILERS*** (Not that you could spoil this predictable train wreck)The script would be fine in a video game, at one point Michelle Jai White meets his boss and discovers that he is in on the plot.. The dialogue could be taken from GTA.. The terrible acting continued throughout. In one scene, the bad guy walks over to the hostages and the stereotypical music guy slides over for him to sit down.. as if he had read the script, you need to see it to understand, its laughable!From the outset I wasn't expecting a blockbuster and this movie literally failed at everything.Avoid."}, {"id": 67, "text": "I should have listened to the reviews. I kept telling myself it couldn't be THAT bad....WRONG! It's terrible! Acting is awful; characters are annoying; just a mess."}, {"id": 68, "text": "This movie was low budget and, it showed. I'm sure the crew, actors, etc. did their best with what they had to work with. Unfortunately, their best couldn't save this movie. I'd give this movie 4.5 stars but, there are no half stars so, I'll give it 5 stars. The reason for the 5 stars is due to all the unintentional laughs this movie gave me. This movie ended up being more of a parody of the original movie than an actual sequel to it."}, {"id": 69, "text": "The movie has some minor flaws and isn't a high budget affair. Yet, it still is enjoyable and fun. And the fight/action scenes are enjoyable. Had some comic relief in places as well. If you have some enjoyable free time, not expecting a hollywood blockbuster, and need a wink and a smile, then this could be an enjoyable pastime."}, {"id": 70, "text": "I watched this because I love Michael J. White's martial art - his style and his physique. Remember the prison scene in Blood &amp; Bone? Well, this ain't got nothing of that style. It's choreographed by a monkey, The worst thing is the acting though. If you close your eyes, it's like a children's cartoon. There's a janitor that's supposedly a comic relief but it's just plain stupid. Everything in this movie is stupid."}, {"id": 71, "text": "I did not know a film could be this poorly written. The casting was horrific and the plot was even worse. I gave it a few stars for the fight scenes.It would have not taken much to make this movie better without breaking the low budget. Oh well. Don't waste your time unless you just want to fast forward to the fight scenes."}, {"id": 72, "text": "Michael Jai White should fire his agent!!! I have no clue why he would agree to this... what ever this is. I can't even call it anything it's this bad."}, {"id": 73, "text": "Let make things clear , this review is for the first 18 minutes only. I tried twice to watch it , but it is so full of cliches and bad acting that I just wasn't able to watch more. How can they waste money like this..."}, {"id": 74, "text": "A lot of this is unintentionally funny. My favorite part is when he, MJW, abandoned the jumpo-tron operator and left him to fend for himself once two armed intruders entered the room. He ran away and left this man to die. 😂😂😂😂 3 stars for the laughs. Gary Owen was pretty entertaining in his role.Side note: at some point during the movie, before the basketball game begins, an announcer states: we have a packed house.That statement is a lie."}, {"id": 75, "text": "The choreography is horrible and the acting is bad. There's no sudden death in basketball so the title doesn't make any sense.Spoiler alert: there's this one scene where Michael's character tosses a grown man over his head onto some lockers but at the end of the movie he struggles to lift his 60lb daughter who's hanging off the rafters."}, {"id": 76, "text": "I have to say the Action was Good but the Rap Music was Crap"}, {"id": 77, "text": "If you are reading this to determine if you should watch this trash, let me make it easy for you, DON'T!! Instead watch the 1995 Original version SUDDEN DEATH starring Van Damm, at least the fighting scenes are better. The only redeeming part of this movie besides the ending credits is the acting by the little girl Nakai Takawira as Mara, other than that I would have given this puppy a one star and a shovel so they can dig their own hole to crawl into. AVOID THIS CRAP!"}, {"id": 78, "text": "Iam a fan of some of J.White movies, but this one really proved to be an eye opener. After reading a lot of reviews mentioning the movie seems like a kids movie, i thought it was an exageration. But hell no, it was if only worse. Fell asleep watching half the way, and then i happened to use the rest of the movie as a sleeping pill, whenever i lost sleep. But beware the side effects might differ from one person to another. To conclude, the script was sloppy, the acting was achy and the fight scenes we all waited for, were below expectation."}, {"id": 79, "text": "Good fight scenes, pretty scripted though. Especially the locker room fight. Some corny comedy. Action very predictable. Acting looked like high school students. Would not watch again."}, {"id": 80, "text": "It was as if someone was telling them what to do! How do they get funding for a movie like this ? Terrible, just terrible..."}, {"id": 81, "text": "Saw jai white and I'm like.. yes! A good movie.. the whole movie felt like kids acting a drama.. terrible acting.. predictable script.. poor fighting.. it's just so terrible.."}, {"id": 82, "text": "The story was solid, just the acting and script let it down, the rap or hip hop music these movies always have is a big turn off, why is it they have to have that annoying stuff in every movie that is based around black actors, the 2 children were so annoying, i was hoping his son would get shot or something he was that annoying and his daughter a smart arse even when held hostage, yeah sure, all the time running around looking for bombs and not once did he call the police, and at the end after killing so many he walks out with his family with no police questioning him. pity it could have been much better"}, {"id": 83, "text": "Very poor , to his early movies which were great for a coloured martial artist, with world titles, his debut blood and bone set his career off this could kill it off"}, {"id": 84, "text": "I couldn't really enjoy this movie as a really serious action , thriller, it's more a comedy with martial arts moves, although some of the martial arts moves seemed awkwardly done!! , and some of the other scenes were just laughable, but I always enjoy watching Michael Jai White in most of the movies he's played in, he looks amazingly physically good. It's worth the watch anyway."}, {"id": 85, "text": "I personally like action movies. I am a U.S. MARINE CORPS VETERAN &amp; I think the hand to hand combat scenes were great. I think the peoples reviews who didn't like the fight scenes are probably hood rats or people who are use to nothing but bar/club fights or fighting in the streets like school boys. I've seen quite a few movies with Michael Jai White &amp; usually he is the bad guy or one of the bad guys but I really liked him in this role as the good guy. Great movie all around I think."}, {"id": 86, "text": "I liked it. It's no Die Hard buy it's good. Pacing is fast. Action is solid. Solid editing. I don't know why people are giving it a 1 or a 2. For the type of movie it is it deserves a five or a six. It was a suspenseful plot ... can our hero, while outnumbered, prevail??? I liked the fact he couldn't use any captured enemy firearms. But he defeats them one by one or one by three! Good stuff Never a dull moment. Good fight scenes in spite of some are saying. Black middle class family at the center...but portrayed realistically and sympathetically.I short, better than average action movie. Sentimental at times but well played sentiment always works. Lifetime (family centered) meets Die Hard....I loved it."}, {"id": 87, "text": "Not bad. Predictable of course, but not as bad. Dialogue was a bit corny. Kids were a bit annoying, fighting scenes were good but could've been better. Spoiler alert: theres a sequel coming"}, {"id": 88, "text": "I don't understand the hate and you shouldn't follow it either. What did people expect from a movie like this? The perfect script ? What you should expect is having fun with a short movie that doesn't tire you, with some classic Michael Jai White kicking moves and a decent plot. Not boring, not dull and not perfect or awesome. These so called '' movie critics '' think that they will always see ''Forrest Gump'' movies but that ain't life. Give this movie and opportunity. Watch it with your friends and some junkfood!"}, {"id": 89, "text": "The storyline isn't the greatest strength of this one. However, as usual, Eklund being the antagonist would make the whole deal easier to swallow. Give this man a cookie!"}, {"id": 90, "text": "Somehow the one and two star reviews seem artificially biased. My guess is because it's a black lead character.I hope to see Michael Jai White do more like this. The guy is in pretty darn good shape for being in his 50's!"}, {"id": 91, "text": "Movies are like people. They all have different goals. No it's not Taken or John Wick. It's a cheesy family movie you can watch with your kids and entertaining enough for them to stop texting their friends for an hour or 2. Let the kids stay up late get some popcorn and enjoy your family night with this movie."}, {"id": 92, "text": "Sometimes a soundtrack makes or breaks a movie. In this case, the soundtrack destroyed what was an otherwise halfway decent, low-budget, b-flick. It's pretty much JCVD's Sudden Death done on a quarter of the budget, but all-in-all, you could watch worse movies."}, {"id": 93, "text": "This film start with a man Jesse been torturing by the terrorist, and he blow up the place scene! As turnout, this film is about a security guard Jesse, need to save his daughter from a criminal Jobe, while Jobe retrieving the so call Digicoin! Entire film full of boring conversation, and annoying overuse scene! Such as, overuse of the song playing at the background scene, overuse of the playing dumb scene, overuse of the disarming bomb scene, and overuse of the gun jamming scene! Make the film unwatchable! Barely laughable scene is, daughter of Jesse kicking Jobe's private part at the end! All the martial art fighting scene quite slow, and no things broken! Make the film quite frustrated to watch! The shooting scene have blood at certain point, but overall portray by sideways! Not intense at all! At the end, Jesse stabbing Jobe several times and blow him up with a bomb! Still have a post credit scene, a policeman found out a missing dead body at the crime scene! That's it! Another disappointed film!"}, {"id": 94, "text": "10/10 for being bad.Maybe Michael is getting caught up in age because the fight choreography is BAD"}, {"id": 95, "text": "Jesse Freeman (Michael Jai White ) works security at the Odyssey Arena home of the Phoenix Falcons. He takes his two kids to go see the game while he is working security. During this time the bad guys take the owner hostage and place detonators at all the exits. Little did they know Jesse is a former special ops person and the janitor saw Die Hard.This is a hip-hop version of Die Hard. Fun action film. Extreme cliche writing. And what kind of bird is a Phoenix Falcon anyone? Filmed in Canada, not Phoenix.Guide: F-word. No sex or nudity."}, {"id": 96, "text": "I Understand the low ratings...Michael Jai white is really a good actor and marital artist and this movie was just for kids and it was a comedy to me. THE action sequences was OK but not hardcore...its an ok movie to watch with kids...Don't expect it to be a serious action movie and you will enjoy it."}, {"id": 97, "text": "True its not amazing, it's a low budget movie. but at the end of the day it's fun and kinda entertaining in a way, so if u just wanna chill over a few beers, then go ahead and enjoy ♥"}, {"id": 98, "text": "Omg! I was hoping for a well acted shoot 'em up movie.... but this one was not it. The premise was good, but the individual actors were awful. Each should think seriously about acting classes! Nothing about this movie made it worth watching."}, {"id": 99, "text": "OK just start, this isn't like the first movie with them down sudden death, it's much more low budget and not a lot of feeling to it. Michael Jai White is very skilled in martial arts so this movie is very action packed decent story but same kind of idea as the first movie and lots of CGI but it was a decent movie I really enjoyed it"}, {"id": 100, "text": "This movie premise is a familiar and predictable one, but that doesn't stop it from being fun and entertaining. Michael Jai White delivery as always. The comic relief sidekick/friend janitor is horrendous and the characters are annoying. Choreography could have been better, some of them are just waiting to be punched or shot at."}, {"id": 101, "text": "As the title states. I enjoyed the Original, this was an excellent sequel."}, {"id": 102, "text": "The label for this movie should be Comedy. It's like they spoofed all the 80's action movies I grew up on. It was great!"}, {"id": 103, "text": "It's a really good movie! Fight scenes were well choreographed, good lines, very fluid scene changes. Really good acting overall!"}, {"id": 104, "text": "I honestly cannot tell whether this movie is tongue-in-cheek (Police Academy style) or absolutely serious. It's hilariously awful. Bad writing, bad acting, bad fight scenes. Worst of all, the wife's wig budget was clearly $5; though, when the total budget is $200, I suppose you have to cut corners somewhere. I found this movie hilarious. I'm not sure I should have."}, {"id": 105, "text": "It contain no nudity small amount of profanity great family story line to watch with your family. funny and entertaining"}, {"id": 106, "text": "Loved it; full of action and humour. Special kudos to MJ White and hilarious Gary Owen"}, {"id": 107, "text": "They did not try to make serious movie and it works... its easygoing and has good action and fightscenes"}, {"id": 108, "text": "This is like a Disney Channel Original for the family to watch only with violence, blood and language. I would give this a 8 if this was exclusively on the Disney channel and my son loved it, but the fact this is on Netflix I am giving this a solid 4 because this is atrocious and not entertaining. Other than that, solid kids film with blood and language."}, {"id": 109, "text": "Where did it all go wrong for you? Yes I understand that it is very difficult for a cheap movie to get the backing from a major studio but oh boy why did any studio give this the green light? Also why did Michael Jai White sign to do this? sack your agent. Michael is a very talented martial artist and I own quite a few of his movies from the okay, universal soldier: the return to his great movie, blood and bone. This film is way, way down in my estimation, Michael what possesed you make this tripe? I will never know, is he that desperate for money? Another reviewer said that this film was a parody of the first sudden death, ah no it was not meant to be, in fact it was meant to be a serious sequel to it. In fact the van damme vehicle looked like a massive Hollywood blockbuster. Where did this go wrong? Well apart Rom the budget, which we all know about films finding it hard to get backup. Another thing viewers look for in films like this are the fight scenes and this was really bad at it as well. You will always find this in really badly done movies, the moves are done so slowly and loom very amateurish that anybody who has watched a few action movies can do better and just think people get paid for making these dreadful fight scenes. Do yourself a favour and don't watch this, the less people watch this may go and make Michael choose better vehicles to do. Go and watch Security and Acts Of Vengeance, which both made cheaply but are great actioners."}, {"id": 110, "text": "Imagine an action film from the 80s/90s: Bad guys take over a place and the protagonist has to fight through them to save the day. Now, imagine all of the cheap knock offs, parodies and satires of those classics. This one tried to be both and a good movie was not the result.The action was just stitched together fight scenes with every punch and kick requiring its own edit. The humor was bad, oh so bad, but if the writing and/or acting hadn't seemed like 95% of it was being phoned in it could have been so bad it was good instead of just bad. Nothing any of the characters said felt natural in any way.It almost seemed like this film started out as a kid friendly action film where the stakes were low and it was supposed to be more goofy than serious, but something happened along the way where that idea was scrapped but nothing was changed except gore being added to bump the rating up to an R. What's left is an awkwardly goofy movie that takes itself way too seriously. The two leads were the most okayish things in the movie even though they're just generic action hero and generic evil guy.Overall, it's a generic action flick that doesn't add anything new or do a whole lot well. If you've got the time to waste give it a watch, but avoid it if you value your time."}, {"id": 111, "text": "Jesse Freeman, a former soldier turned stadium security guard who's still readjusting to civilian life, takes his kids to see a basketball game where he works only for a well armed team of mercenaries to take over the arena and only Jesse can save the day.Welcome to Sudden Death is the latest in a long line of films produced by Universals Direct-to-video studio Universal 1440, a label that specializes in making sequels to moderately successful theatrical releases like Backdraft 2, Inside Man 2, and a glut of Dragonheart sequels just to name a few. In this case Welcome to Sudden Death is a remake of one of the better Jean Claude Van Damme vehicles Sudden Death from 1995 but the movie takes only the bare bones of its inspiration and slaps it on what feels like the tone and humor of Paul Blart.First the good, Michael Jai White is still charismatic and brings energy to the movie even if the material is beneath him. What fun there is to be had from this movie is because of the charm and physical prowess of white. The hand to hand combat scenes range from mediocre to okay(with the best one being a sequence in a locker room at the tail end of the movie) and despite not being as well staged as superior White vehicles like Blood and Bone or Falcon Rising they do convey some dynamic and forceful fights.The bad, the movie is obnoxiously silly. It is over stuffed with comic relief characters like Gus the janitor, Jesse's Kids, and a panicky rapper named Milli who all play their roles over the top with broad humor that does not land. Michael Eklund plays the villain code named Alpha and he is not a good villain. His performance feels more like a deranged hillbilly than a criminal mastermind and even taking into account the movie's goofy tone he still doesn't work.Welcome to Sudden Death is a pointless remake of an okay 90s action movie. While not completely without merit thanks to the usually reliable Michael Jai White your time would be better spent watching similar fare like Final Score or the original Sudden Death.Edit: for those of you who duck out before the end credits(or the end of the movie for that matter) the movie has the audacity to try to sequel bait with a post credits scene sting.......yeah, that's not happening."}, {"id": 112, "text": "That's what this action has going for it, it's in no way a great film, but it has fun with it's awfulness. You see it in Michael Jai White's performance, even he knows it's not a good movie, but he has fun with it anyway.This is a sequel to the Jean Claude Van Damme film from 90's, which I did not see. The stadium scenes are pretty good, the bad guys are cartoonishly over the type. Fight scenes are pretty fun also. Go into this movie not expecting a great film, but just an enjoyably bad action film, you'll just have fun watching."}, {"id": 113, "text": "I truly do love all movies, they all have something to offer and I've seen a huge amount. There are however three movies I've stopped watching after about 30mins, first was sliding doors with Gwyneth Paltrow, jungle 2 jungle with Tim Allen and now this piece of rehashed crap that was given a green light by the production company, why is anyone's complete guess. Don't get me wrong I do love Michael Jay White in anything because the guy can act and most importantly fight well but it has to one, have a story worth telling and two, be original. The description puts this as a sequel to the original with Jean Claude Van Damme but no, it's a complete rip off of the story, the scenes are nearly play by play and just adding African Americans to the story does not make it new. Hence, go woke, go broke. That and Michael Eckland (whoever the F he is) is by no means near the ruthless bad guy that the late Powers Boothe was able to bring to screen. To be honest, do yourself a favour. Do not spend money and more importantly time watching this. I watched Range 15 yesterday and would rather watch that on repeat for a week straight than sit through the rest of this crap and Range 15 was cheaper to rent."}], "reviews_amount": 114}