{"name": "The Dark and the Wicked", "titleId": "tt10229558", "reviews": [{"id": 0, "text": "This movie has all the elements for a great horror film, except for a plot with logical and consistent world building.So the devil is after the fathers soul, and slowly kills him after years of ailing from some degenerative condition. So far, so good. You have an evil entity that slowly drains the life from someone to get their soul. But here's the issue; this same entity kills everyone else with ease.The devil kills Louise, Micheal, the mother, the nurse, the priest, and rips apart dozens of sheep too. So this devil can kill, but it takes years to kill the father, ...for reasons. It also haunts the mother for years too, yet Louise and Micheal for only a week. Why? It's never explained or even hinted at.This is an issue with many horror movies, especially ones with a supernatural element. Why does the evil antagonist toy with the characters, when the desired goal is their death, and this can be accomplished with ease. Some movies explain why: like feeding on fear to gain power, or fear makes victims taste better when consumed, or needing time to manipulate characters to release or summon them, or one of dozens of other explanations within the genre. This movie does none of that.The audience needs to know the rules in a horror film, that's what creates the tension and anxiety. Rules let the audience know what's possible and what's at stake. If anything is seemingly possible, like an unstoppable devil that can kill anyone with impudence, then what are the stakes. It's an unfathomable force that kills half a dozen other characters at a whim, yet takes years to drain one man. There's no rules and no motivation given.If you edited this movie to just have the scary scenes left, nothing would be lost. Realistically, you wouldn't even miss out on any real plot or context either. No motivations, no stakes, no rules, no plot: just scary things happen for unexplained reasons, the end."}, {"id": 1, "text": "Acting: actually very, very good. Cinematography: again, A+. Special effects: that all depends on your taste of blood and gore. Personally, I thought it had some gruesome parts, but not over the top. Here's why I only rated it an 8 out of 10: scare factor. In the beginning of the movie, the mystery of the entity is definitely malevolent and seems to enjoy taking its time before a kill. Cool concept. But as the movie moves along, the scares become more predictable and the main characters, as seemingly level headed as they are, don't act rationally, in my opinion, and then the movie becomes a house of cards at the end and collapses without a proper ending. I'm trying not to give too much away because I don't want you to think it's a bad movie. Just could have been better, and that was disappointing. I would, however, recommend it as there are not many options for good movies period right now. Compared to some of the other junk I've had to endure lately, this is like the Hope Diamond."}, {"id": 2, "text": "I don't normally review many movies, but this one was worth it. Its a great movie if you need to stay up late, especially if you live alone in the country like me. Loved it."}, {"id": 3, "text": "The movie starts out okay and there admittedly is decently grim atmosphere present right from the get-go. The visuals are solid and the audio score works as well. Acting job also hits its mark. The horror in this movie is a mix of jump scares combined with more lingering imaginary of unexplained phenomenon. The problem however, is that it all gets a bit dull until the end, as all the horror elements pretty much stays the same throughout the runtime. Even though the film can be categorized as a slow-burner, it ain't exactly holding back with its delivery of spooks either. This means that all the scary stuff starts to feel a bit diluted. I kept on expecting some fresh elements and alterations of course, but sadly there wasn't any. There is one good The Mist-like scene near the end, but the actual ending is somewhat unsatisfactory."}, {"id": 4, "text": "This is a great indie Horror, and will be strongly appreciated by fans of the genre. It builds suspense superbly and is easily the scariest film I've seen all year."}, {"id": 5, "text": "The movie is scary as hell and terrifying but then to find out it was for nothing?!!!!!NO PLOT OR BACKSTORY. NO REASON FOR WHY THIS IS HAPPENING. Its like a movie that wants to scare you and it does but there is absolutely no reason or logic why things are happening the way it is.The two siblings start acting and doing stupid things and then the last 5 second was even as bizarre as it gets.At least throw in a history of the farm or the father's past to let us know why events unfolded as it did. Sorry but 1 star out of 10 for story. For scares it is a 8 out of 10. But I cannot for life of me know why director or writer did not add a solid backstory and explanation to movie or as to why it went down like this"}, {"id": 6, "text": "Dull scenes with darkness filters and desaturation, lots of auditory stuff working to accompany it.But ultimately the scenes play like this:Random scene in a house.Then in a barn.Then in a bedroom.Then in a barn.Then a scene with nondescript dialogue.Then something else.Then a scene where an old lady chops her fingers off, and they make you watch as she mushes them into a pulp but chopping over and over and over and over again.Then outside a barn.Goodluck trying to figure out any of the plot; there isn't any.Sound like a master piece like 'Shutter Island'? Or in the horror genre something like 'The Conjuring' or 'Heridatory'? No, it is not even close3/10 below average mess you will be lucky if you can actually see anything it is so dark."}, {"id": 7, "text": "Went in to this with low expectations and was blown away. Brutal and terrifying, great film with fantastic acting"}, {"id": 8, "text": "It starts out pretty creepy and there is one good scare effect. Overall the atmosphere was pretty dark so points for that. The problem was mostly the lack of a good immersive story to pull you in. Actors were not that great either but not that bad for a horror movie. Also the christian woman who pierced her eyes has her eyes still intact in the next scene (what a shame). all in all it's worth a watch but don't expect a great story."}, {"id": 9, "text": "Wasted potential, money and time. Don't waste your time."}, {"id": 10, "text": "Please don't waste your time on this... this movie is ridiculously boring. I bought this movie for 5$ because of all of the positive reviews that compared this film to Ari Aster's 'Hereditary.' This movie is nowhere nearly as creepy/unsettling and there's basically no storyline. It maybe could have saved itself by having a twisted ending but instead, the end scene sucked even more that I could have imagined. I enjoy GOOD slow burner horrors/thrillers, but this was just slow without any reward. Do not spend money on this."}, {"id": 11, "text": "There was a lot of good to this movie; dreadful, grim atmosphere combined with genuine scares. Not cheap jump scares. It really portrayed the psychological effects of supernatural oppression in a realistic way. Far away camera shots and excellent production quality. Actors were solid. A few scenes with implied horror, which was done very well.Unfortunately, all that does not make a great horror movie. The storyline still has to be coherent. Too much ambiguity and too many question marks with this one. I did not understand the ending. When there's too much ambiguity, a movie can come off as pretentious and trying too hard.A solid effort for sure but came apart at the seams."}, {"id": 12, "text": "A family of sheep farmers, deep america, slow everything is slow the film is slow, the father is sick the mother is losing her mind, the days go by slowly, strange things start to happen but slowly, you have to be patient to continue, if you do not lose yourself in the slowness, and the days go by, strange things increase, but everything is still slow, but you have to take care of the sick father and work slowly, Friday the phone rings without reason and slowly the daughter answers, strange things happen slowly, we are in the middle of the film, apparently the devil is around the farm, slowly we will know if yes or no. but few will have the patience to reach the end and know, I took the trouble to do it, a certainty has arrived 10 is not the good rating for this slow movie, few actors have a few frisson scenes, and a beautiful photograph, the plot is tiring, the horror is having to wait 1.30am for nothing, just a nut consumed by the devil. deserves some points for photography and the performance of the girl."}, {"id": 13, "text": "Well worth the watch, in the dark, with the sound cranked. Oscar nod for sound editing - my ****!!! Dont believe any hate...LONG time since a movie invoked unbridled, white knuckle terror.Solid 7.5/10 from this guy. Whew"}, {"id": 14, "text": "Most solid horror movie I've seen since Hereditary."}, {"id": 15, "text": "Something dark and wicked comes your way; albeit, something dramatic and with horror tropes.If you're like myself; the less I know about the plot of a movie, the better the movie experience.Yes, this movie contains many horror tropes we've seen before. However, it can't diminish the excellent performances, beautiful cinematography and complimentary score. All melded together, through an intimate and an eerily suffocating family dynamic. All of these elements envelope you, along with the characters own growing feelings of dread and isolation. The film masterfully balances the creepy slow burn, with the jolt scares.****Spoilers Below**** Ending explained:The entity's objective, was actually for Louise to be it's host, not her father. Now please go back, and rewatch before posting a review."}, {"id": 16, "text": "The film makers got so much right about what makes a good horror movie that it is a shame they forgot a coherent story. The acting is top notch, the atmosphere perfect, it's genuinely a spooky, creepy, could give you nightmares type film. On the other hand the movie is just too slow, and in a way, pointless. It's as if random scenes have been edited together, each may be suspenseful, or scary, or throw more questions into the mix, but in the end they don't add up to any real plot. Even worse this film suffers from the usual people acting stupid in a horror film, behaving the exact opposite way you would expect any sane human being to act in real life given the situations. I really wanted to like this, at times it was very good and then it all just falls apart. There are scenes and dialogue that are left totally unexplained and by the time it abruptly ends I just thought what was that all about ?. Great atmosphere, and a few chills do not add up to a complete movie."}, {"id": 17, "text": "I'm sorry but this movie was terrible. It was just nothing but these little shock moments followed by slow, boring storyline that didn't even really make sense or even really matter. It just kept dragging on and on and the same things kept happening over and over again. The ending was absolutely a slap in the face. I'm sick of these shock and gore movies with no story and poor character development. If you liked the Saw franchise, you'll probably find this to be a good watch."}, {"id": 18, "text": "To begin with, the visual style and background score are amazing. I love how it started; slow but slowly burning into your skins like Hereditary did. But once you reach somewhere at two-third of the movie, you realize you already know how it is going to end and you hate it. So I am, particularly, not a fan of how it ended, like on a cliffhanger and not explaining things."}, {"id": 19, "text": "Boring and boring,slow and not interesting. i couldnt watch it more then 50min pecouse nothing there to keep me watching"}, {"id": 20, "text": "The dark and the wicked grips you in the beginning, but as the film goes on the grip loosens more and more. It's missing a key ingredient, a compelling story. I'm all for slow burns, but give me solid characters, that way I feel more for them instead of just nodding my head as they die on screen. There was a few times where I thought gee someone else would've shot this scene a whole of a lot better. I just thought this film was a total bore, don't go in with high expectations. I saw that 90 on rotten tomatoes and thought I must've misread it as a 40."}, {"id": 21, "text": "This is anything but slow, the violence gets started soon enough. This one is creepy with a good storyline. With some brutal scenes and genuine scary moments, this is a sooos horror."}, {"id": 22, "text": "There is a pleasant feeling that the movie sets up its own rules in other to show what it wants without having to give any explanation about them thus reveling that is incapable of being much creative with its own free game."}, {"id": 23, "text": "Good grief. Been there, seen this, and done so much better. Waste of time and money"}, {"id": 24, "text": "So what? someone got the camera and started to make Halloween movie for kids! There was no any scenario, no any reason behind the events, no character relations, no start and no end!! I wonder what the writer though while decided to o something like this?! I recommend him to try his luck in another thing and leave the movie making for someone expert."}, {"id": 25, "text": "Started as a typical horror movie, and I had very close expectations, but end up very very disappointing... * there is no story, there is no purpose, there is no logic, and some how the main characters in the movie are believe in Devil but don't Believe in god **** that was the second worst thing in 2020 after the coronavirus ."}, {"id": 26, "text": "Slow and Boring movie. Don't see this Is a waste of time"}, {"id": 27, "text": "The first 2 minutes got me so excited with it's dark atmosphere, crisp cinematography and great sound. As I watched, I got intrigued about where will it all lead..... Unfortunately, by 1 hour mark it was still going nowhere.Yes the atmosphere is fantastic, the decorations are immersive but there is just no damn story which is such a shame. It could have been a gorgeous indie horror as it had decent creepiness that did get my heart beat up once or twice. Sadly, it felt like a cliche devil, priest blah blah blah...Wasted potential"}, {"id": 28, "text": "Very effective atmosphere, good cinematography, and solid acting aren't enough to make up for the movie falling short in the plot and characterization departments. In the end, you're left with a well-filmed, barebones, hollow haunted house film that doesn't bring much new to the table."}, {"id": 29, "text": "The movie itself is not bad, it doesn't have a bad plot (a little ordinary but it works if u do it correctly).There are a lot of things that simply don't connect. We need an explanation and they don't give you anything, not even a clue.Also, many people compare this movie as the best since hereditary and I think it is a shame for that movie being compare with this one. Hereditary is a masterpiece, everything explained with a lot of details, and things that still surprising you after seeing the movie 3 times. So, it is not even close.A good thing I have to say about it, is the brother death. It was a little unexpected, a lot of blood, good. But everything else just feels quite incomplete.The thing in the beginning don't have any protagonism in the movie and it is there like.. why?Had potential but it lost it."}, {"id": 30, "text": "I can't believe this movie has such high rate, it's awful. No plot, slow, boring, the dead scenes are ridiculous. Highly dissapointed."}, {"id": 31, "text": "Great acting, great atmosphere, but where the eff was the story????? So much potential, but absolute trash. What the f was this even about?"}, {"id": 32, "text": "It was very slow I was waiting for something scary to happen the whole movie, I would call this more messed up that horror I didn't get scared once, can there be. Good horror movie...come out soon please!!!"}, {"id": 33, "text": "I spent $6.99 VOD on this tonight-do not do it if you are thinking about it. This is not good on any level. The only part of this movie that evoked any favorable response from me was when I saw the goat with only three legs running around-I was thinking I bet the people who take care of him and made him run across that field probably gave him some good food/a reward for that. Skip this one"}, {"id": 34, "text": "This movie reminded me of the 'Hereditary'. Beautifully shot. Very atmospheric. Terrifying. It plays out well through symbolism, which is great, but it lacks story details, which to me turns out to be it's main drawback. It could've been much more mysterious and captivating, if more details would be details hidden here and there about the family and the Devil too. Yet and still it's not bad, it's rather good."}, {"id": 35, "text": "I think The Dark and the Wicked is an excellent horror movie in spite of the story of the movie isn't new to me as a viewer. I think the movie is not just an evil spirit in a haunted house that kills people, it is also a psychological movie and I disagree with the people who say the movie is meaningless, I think it is suitable for fans of psychological horror as well as fans of paranormal horror. There are some interesting points in the movie that make me see it as a psychological horror movie such as : All deaths that happen in the movie are suicides, the devil's origin is never mentioned, and a reason for its appearance is never given besides, that the movie focus on the relationship and emotions between parents and children, Louise and Michael feels guilty of leaving their mother to look after their father on her own. That leads me to ask are the visions real?points I liked in the movie : the atmosphere of the movie is creepy, cinematography and colors are excellent and very good acting."}, {"id": 36, "text": "Boring Dull Bad Story Bad Scares Bad Acting Bad Everything Worse Movie of Decade. All The high rated reviews and ratings are paid or simply Dumb."}, {"id": 37, "text": "Did the director of this film really need to live? Couldn't someone leave him in a car during summer and left him to rot? This is how I feel about this movie! Did it really need made?! I was happy watching a friends season... but it's my wife's birthday and she wanted to watch this piece of crap. Perfect. From the beginning, it was awful. The mother takes care of her dying husband...then kills herself...then her children begin to encounter strange things happening to their family home. It doesn't get any better. You find yourself looking at the clock wondering how much more depressing can this movie get? Strap yourself in! You'll find out if you actually finish the movie! I did! It was free, from one of my wife's illegal movie web sites...and I STILL want my money back! No jump scares...just boring, depressing scene after scene. SAVE your time and money! RUN from this film! It's TERRIBLE! Peace!"}, {"id": 38, "text": "This movie starts out a little slow....I almost stopped it but so glad I didn't....It builds slowly but the second half is the creepiest movie I have seen all year (and I watch a ton of horror movies)....GREAT acting and a GREAT creepy scary movie...Highly recommended!! 9 out of 10"}, {"id": 39, "text": "This one is not for those who don't like slow paced movies but this is truly a horrifying movie. I loved the slow pace and how it helps in building this fear in the viewers heart of the unknown evil lurking in the dark of ones mind. Truly a Classic American horror. Loved it."}, {"id": 40, "text": "Serious . .nothing happens . . .Compete nonsense. Borefest filled with predictable attempted scares.Dialogue flows like treacle up a wall. A very sloooookow and boring journey.Watch if you like comedy horror as that's about as much as this is . . . . ."}, {"id": 41, "text": "The only thing I could conclude here is that the ma and pa gave themselves or their souls to the devil for prosperity in return for their families' souls and it was pay up time."}, {"id": 42, "text": "This movie had its moments. A bit graphic in a few scenes, and there were certainly some freaky supernatural elements. However, like most reviewers here have already said, there's little to no story. I'm not someone who needs things explained or presented on a silver platter, but there's just nothing here other than some genuinely frightening moments and a very tense atmosphere. With a bit of fleshing out this could have been a really terrifying film, rather than falling down into the what did I just watch? category. Oh well, $5 down the hole."}, {"id": 43, "text": "I didn't like the film Hereditary, and I didn't like The Dark and the Wicked, either. The acting was good, the scares were okay, if predictable. I just don't care for horror movies that are unrelentingly, ploddingly bleak, without even the faintest glimmer of hope or redemption for any of the characters.If you're into brooding, depressing, bleak horror films, this one may suit you, but it ain't my kind of horror movie."}, {"id": 44, "text": "Was expecting something better. Low budget. Some redeeming moments but overall a fast forward job."}, {"id": 45, "text": "It was better than any horror film that has been released in the past few years, I'll give it that. But it dragged thru many parts, and then, other parts just didn't seem to connect to each other. Dark and dreary atmosphere (check) , evil demonic undertone (check), a few jump scares (check),-- but put it all together and it was just ok...... honestly by the end, you will say to yourself, wtf did I watch ?."}, {"id": 46, "text": "I am so thoroughly disappointed in how the movie ended. The atmosphere and the feeling was there, but the ending was just too unrewarding that I hate myself for spending my time watching this."}, {"id": 47, "text": "Dude. The audio in this film was awesome! Props to the sound guys!"}, {"id": 48, "text": "Just finished the film and i thought it was VERY good! the film has excellent dread/creepiness/atmosphere right from the very first frame right up to the last frame. the acting from all, especially Marin Ireland (as usual, she's PHENOMENAL!) is wonderful. the gory/bloody scenes are extremely well done and some scenes made me flinch (in a great way!). i loved pretty much everything about the film EXCEPT for the final 2 seconds in it. LOL. the final GOTCHA! jump scare/stinger was confusing and comes across like director Bertino &amp; Co. ran out of money and had no choice to just stop filming right then and there. the jarringly abrupt ending is pretty annoying but everything that comes before it was great!"}, {"id": 49, "text": "Waiting for something scary to happen?!? Then you have to wait for a very long time because this movie is slow and boring from start to end... I give it 2 stars for the actors who plays siblings."}, {"id": 50, "text": "This was without a doubt the worst movie I have ever seen in my life. The movie has no real plot leaving me feeling like someone stole my time for the time it took to watch this movie. You can make better use of your time watching water drip from a faucet."}, {"id": 51, "text": "A catalog of jump scares. Period.Because Bertino has no interest in storytelling (see The Monster), the mecanhnics of his film making take the foreground. Once decoded (about 15 minutes in), the film's visual geography and camera placement become rote. Rinse and repeat. In scene after scene, the viewer is multiple steps ahead of the characters, what accounts for a plot, and where the bogeyman is hiding. The fate of the film making is as deterministic as that of the characters.That said, there are good performances and some superb compositions, but ithey are ultimately in service to a lackluster script."}, {"id": 52, "text": "Told you all not to come. Uh-oh, I'll bite. Those words while derivative, are never reassuring.Anyhow, 2020's The Dark and the Wicked is my latest write-up. It is well-acted and well cast as it stars unknowns Marin Ireland and Michael Abbott Jr. Things don't bode well for their characters when you think they might. Alas, Wicked is a rinse, repeat of all things that go bump in the night. It concludes in a sort of confounding dead end.The Dark and the Wicked is a mixed bag for me because it chooses terror-filled ilk over mucho substance. Call it sticky wicked. Using weekday title cards a la The Shining, harboring low camera angles, and containing a look similar to 2018's Hereditary, Wicked creeps you out occasionally but you'll constantly wonder where it's all headed. Every jump scare, every ghastly image, every delusional grab, and every demonic coy sort of recycles itself into slugged continuum.Distributed by RLJE films, shot in one location via Granbury, Texas, and directed by a guy known for horror fare (Bryan Bertino), The Dark and the Wicked is about a brother and sister who try to fight off an evil entity that has inhabited their grubby farmhouse. They could get the heck out Amityville Horror-style but their father is dying and they can't move the comatose old-timer.Now does The Dark and the Wicked send you away with your knees knocking? At times yes. Does it run out of wiggle room with all of its fiddling and blood-curdling excess? Sadly it does. Wicked takes ninety trawling minutes to revel in the hallucinatory, the unsettling, and the stylistic. Rather than tell a cohesive story that seems to start in the middle, director Bertino opts to just tease the audience with the macabre. He doesn't know when to quit."}, {"id": 53, "text": "Enjoyable horror that sets the tension from the start and then slowly builds on it. Well shot and solid acting. Nice subtle scares carry you along till the end. I don't understand why so many bad reviews, as I've said it's an enjoyable indie-horror."}, {"id": 54, "text": "KKonas and smart horror are two things i never i thought i'd see in a movie that works. The scares were alright, some are cheap some are smart, story is pretty basic yet interesting with no convoluted twisty twist. A shame the cgi was just plain bad."}, {"id": 55, "text": "Oh man, I LOVED this! What a surprise, what a perfect movie. Creepy, atmospheric, tense, perfect using the silence, perfect using any kind of minimum sound, perfect on his wickedness and imagery, all that a slow burner should be, great acting, and even the jump scaries work here (oh, this didn't happen with me for a long time!).And yes, it has a message that a lot of people didn't get it. When we are alone, when we are abandoned by everybody, the demons, the devil find a space, a place to stay, and even those who abandone others are susceptible to this, as they also feel more alone in the process - if you take this as something objective or more subjective, it's up to you.Yeah, I don't give a lot of 5 stars (in the last 10 years, only gave to Get Out and Parasite - and besides Get Out, the only horror movies on that club are The Exorcist and Scream), but this will join that restricted club."}, {"id": 56, "text": "Beginning, middle, end. Can somebody just make a decent horror movie that makes sense?! What was this?!"}, {"id": 57, "text": "A horror gem! It has been a tough time to find good horror movies lately! Thank god a managed to find this one and on Friday 13th! Made my night!Terrifying and provocative! Scary as hell!"}, {"id": 58, "text": "And it is not that interesting of a movie to sit through again to try and figure out what is going on. Stuff happens. Then it unhappens. There's a force doing things. But why and why we should care is never known.There are animals and a very unnecessary scene with an old lady in a barn. That about sums up what's going on. Lots of unnecessary things."}, {"id": 59, "text": "Scary AF. All the bad reviews are from people that lack depth of knowledge in the subject matter and want the film to spell everything out for them. The scary part of this film is what you don't see and therein lies the story. Like an iceberg. Best horror I have seen in years, and I'be been watching horror films since I was 5 years old."}, {"id": 60, "text": "I am surprised this isnt rated higher but I suppose it is still new . For a modern horror it in my opinion does what it's supposed to. It's unsettling , it makes you uncomfortable, I felt tense and ultimately its got tlme scared, something few horrors have achieved in recent years. The lack of explanation and backstory, it doesn't bother me as much as it seems to do others. For me sometimes the unknown is what makes something all the more frightening."}, {"id": 61, "text": "Good acting, super atmosphere. Its scary of course. But why the devil attacking this family and home is not explained."}, {"id": 62, "text": "Really need to be into some dark things to really get a kick out of this film. There are creepy parts but mostly just unexpected deaths and killings that dont really seem to attract the average horror film fanatic. The approach was great but the ending just didn't feel satisfying. I'd recommend to all the dark and eerie movie fans overall."}, {"id": 63, "text": "I've been a horror movie buff for at least 30 years and it really takes a good movie to keep my interest. This is the best horror movie I've seen in quite sometime. It was truly dark and unsettling with some scenes that actually made me jump. I rarely write reviews but this one kept me on the edge of my seat for the entire movie. The fact that this only has a 6.2 rating just shows out of touch critics are with the horror genre."}, {"id": 64, "text": "But unphatomingly excrusiating slow horror movie, even though its well made and the creeps comes sneaking along your spine, its slow and unreachable at some levels. who is the real culprit in this case is difficult to tell while watching, and the aftermath tells you that this was everlasting and not temptativ to rewatch..so if you want to have a trip to the vast windblown and grey and shadowless plains of usa with a little bit of this and that horror at a clockworks playtime, then have a look. its tough meat for the depressive viewer, thats my only caution, so its a small recommend from the grumpy old man"}, {"id": 65, "text": "If you don't want your skin to crawl and you'd rather not be up all night watching for signs of demonic possession (one of my hobbies), this is not the movie for you. Go watch The Rental - also good but it won't give you night terrors. This movie...this movie will. I am also officially switching the side of the bed I sleep on - just as a precaution."}, {"id": 66, "text": "This is the opposite of a jump scare movie. Like Annabelle or paranormal activity. It's a slow burn tense, atmospheric horror like Heriditary and Relic (or even babadook). All movies I absolutely loved. Great acting too and just like in Heriditary the actress carries the film. Great super scary horror about the devil trying to steal souls by using sight and sound to tempt you to darkness.I am giving it a 9 instead of an 8 like I should be. However if I don't give it one higher than I want to rate it, it will likely place lower than it should do the extreme reviewers that give 1's if they don't like a movie. And this movie is that good of a horror that it deserves to be in the 7-10 range."}, {"id": 67, "text": "Well this was much creepier than I expected, not to mention highly unsettling and quite disturbing. The performances, the atmosphere, and the setting are all fantastic, and there are some serious Hereditary vibes, but instead of the unsettling, eerie feeling that just wouldn't go away, they included a couple of jump scenes. Overall, this is the best 2020 horror I've seen so far!"}, {"id": 68, "text": "I'm a real horror movie fan and I can apart this movie from it's similars. Because it has very good cinematography and acting is pretty good. I can see clearly the desperation in their faces. Nothing positive happened in this movie. I was excepting somehow happy ending like her father will wake up in the end. But I liked this one better. The environment looks like very dark and lonely. It's sound effects are okay. I hear the same violin effect in many horror movies recently. I think Hereditary was the first time I noticed it. But I like it. I still feel sad about their animals. Lol"}, {"id": 69, "text": "Pros: some really good scary moments, stuff that you will rememberacting is good, not really anyone i recognized but they did wellscenery was greatagain, i have to mention the scary parts one more time, some of them were REALLY good, for this reason alone its worth watchinggreat mind bending scenes that will mess with your headgood buildupCons: a few moments that were meant to be scary, were not scary at all (the beginning)felt like they were trying too hard at timesthe title of the movie, i don't get it, doesn't seem to correlate with the movie that wellmy biggest issue with the movie: there is no backstory as to why this farm/home is being haunted. there is a brief scene with a priest that talks to the kids and provides a little information but its very vague. what or who exactly is haunting them? when did it start? where did it come from? WHY is it haunting them? some of you may say the priest explains this but its just not fulfilling enough at all. how do we know that the family didn't deserve it? what if they were horrible people? why would some farm out in the middle of nowhere get haunted? if they took an extra 10-15 mins in the movie to talk about or show some of this, this movie would earn another 2 stars from me."}, {"id": 70, "text": "I saw The Dark and the Wicked, starring Marin Ireland-Sneaky Pete_tv, Hell or High Water; Michael Abbott Jr.-The Death of Dick Long, Mud; Julie Oliver_Touchstone-Preacher_tv, Blood Suckers From Outer Space and Xander Berkeley-The Walking Dead_tv, 24_tv. This is a horror movie written, directed &amp; produced by Bryan Bertino, who had a hand in The Strangers &amp; it's sequel, The Strangers:Prey at Night. Marin &amp; Michael are siblings that return to their parents' farm because their father is dying. Julie plays their mother who tells them that they shouldn't have come-it's too late is one of the reasons given but there are more. One of the first things noticed by Marin &amp; Michael is that their mother is acting strange. Julie cuts off her own fingers and is later found dead, hanging in the barn-pretty strange, right? No sooner are they mourning their mother when Marin &amp; Michael start having waking nightmares of seeing things that should not be seen. There is something evil on the property. It's not rated but it does contain violence, gore, partial nudity and language and has a running time of 1 hour &amp; 35 minutes. I don't think I would buy it on DVD-once was enough-but it would be alright, as a rental."}, {"id": 71, "text": "My headline says it all. You want to feel depressed then go read about the opioid crisis instead of whatever the heck this was."}, {"id": 72, "text": "I knew it wouldnt disappoint the moment i saw trailer. Absolutely a masterpiece! Bryan Bertino did a great job. I would highly recommend this movie."}, {"id": 73, "text": "This one was creepy. I have a high scare threshold, but this one got a few punches in. Great atmosphere, authentic actors, good story. It's slow-burn, which I love, so if you're a fast-paced slasher type, you probably won't like it. I'd call it a horror drama, heart-wrenching at times. But to me the scariest movies are the ones where I am invested in the characters. Excellent film, though maybe not for everyone."}, {"id": 74, "text": "I absolutely loved the intense moments and I'm a huge scary movie fan. Thank you leaving it with no happy ending I hate knowing some resolve ending is coming. I'd definitely watch again."}, {"id": 75, "text": "Nice movie for horror lovers! Kinda originally with the scary scenes. You wouldn't be disappointed!"}, {"id": 76, "text": "The film has an engaging story with top-class acting. It straightaway gets to the point and doesn't waste any time. We are introduced to the devil entity and the story around it in the first 10 minutes. Bryan Bertino certainly knows how to develop tension and fear among his viewers - something he did in The Strangers (2008). Marin Ireland and Michael Abbott Jr. are able to convince us about the fear lurking in the house. The music by Tom Schraeder instills chills along with Bertino's direction. Everything about the film just feels right. Pacing and run-time of the film are apt, given the story. If the pace had been any more slower or faster, it would defeat the purpose of the story. The scares work in favor of the film. Even the ringing telephone or knock on the door knows its purpose. The film has no hero or change-of-heart type character. This is a good cold-night-lights-off watch."}, {"id": 77, "text": "Solid acting, slow, but it is a scary movie. It crawls under your skin. One thing I kept on shouting for the last hour while watching the movie: Get The Hell Out Of There! Now!!!"}, {"id": 78, "text": "Don't often get scared with horror movies, but with this one... Had to watch it with the lights on... Solid horror, a bit slow burn at the beginning, after that... May God protects us from Evil. One of the best 2020 horror movies. Congrats to the team that made this great horror movie. Thank you"}, {"id": 79, "text": "If you think a good horror movie is gory effects this is not your movie. The Dark and the Wicked borrows the true horror from The Exorcist, Devil no needs to show himself to make you crazy and terrified isn't he? Only his presence around is enough. Here the visitors that appears pretending be real and the hallucinations are pretty chilling and creepy. Give it a chance and you understand how horror movies should be."}, {"id": 80, "text": "Another shudder original that really really amazed me this year. Slow paced, nerve breaking horror movie at its best! The acting is wonderful. If you are into slow paced movies, this is really worth your time. Other horror fans might think it's boring."}, {"id": 81, "text": "The complaints are true: Not much of a story, just kind of a series of waking nightmares and a family situation that crumbles more and more with each passing second. HOWEVER the actual scary pieces made it completely worthwhile for me. At points, the evilness really surprised me and resulted in some stellar horror imagery that I was not expecting. For those wondering, this is in fact a supernatural horror movie and not just a people vs people thing."}, {"id": 82, "text": "Louise (Marin Ireland ) and Michael (Michael Abbott Jr.) return to their sheep ranch in Thurber, Texas to see their dying father, David (Michael Zagst). He lays in bed with tubes in him and doesn't move. They are there against the wishes of their mother (Julie Oliver-Touchstone) who believes the devil is in the house wanting to take David's soul.The siblings who are not religious begin to see things that appear very real, but are not.The film atmosphere was a constant gray and brown. It was good, but the film left much to be desired. The porch scene of the siblings was boring when it should have created interesting characters. The creep factor was decent but it went nowhere.Guide: F-word. Nudity?"}, {"id": 83, "text": "This movie has a slow start but it increases in tempo the more you go on. A poor sheep herding family is attacked by... a dark evil. Settle in and watch. At first I thought this would be another cheap loser supernatural move but it definitely gets better as it goes. Dark, quiet and an eerie atmosphere - few big Gotcha moments with loud music. Very different from typical big budget horror movies but definitely worth the time! You may be disappointed at the end because it lacks the answers we all want but not because the movie didn't deliver!"}, {"id": 84, "text": "This is a creepy, late night gem. one of the most frightening movies i have ever seen and the suspense is the best part. I compared this one to Hereditary only because of the dreadful feeling it gives off. If you actually want to be scared and not jump scare scared.. genuinely frightened.. say no more and watch this movie."}, {"id": 85, "text": "Love my horror movies, and this was the best I've seen in a long time, genuinely scary , with out been silly, very dark, well acted, cinematography great and just a menacing good horror, very scary"}, {"id": 86, "text": "An endless amount of random events stacked on top of each other, all accompanied by over the top gore and creepy music. What an incoherent mess. Would love to read the script though. Must be 3 pages thick."}, {"id": 87, "text": "Emotional and creepy movie!10/10!! It was awesome. I've seen so many horror movies. Not many scare me...but this one definitely was creepy"}, {"id": 88, "text": "Where do I start!!! This film got me hooked and sucked in just like hereditary did. Infact in some parts it reminded me of hereditary in ways, it's a slow burner but you can't keep your eyes of the screen. The atmosphere of this movie is so depressing it sinks you into this dark world and my head was running in overdrive just wanting to know what's going to happen next. Theres some really creepy parts to this movie and the music keeps you on edge, the acting is brilliant and you really feel for the characters. One of the creepiest movies up to date and it takes alot to freak me out!! It's no hereditary tho as hereditary is the best horror of this generation in my opinion. The reason I gave this 6 stars is there is a few moments where I thought there could've been improvements and the ending could've been better. Abit of history into the characters maybe!!! If there had of been these adjustments it would've been a solid 10. Anyways well worth the watch, make sure you turn the lights off and turn the volume up and enjoy"}, {"id": 89, "text": "I crapped pants multiple times during the movie. Spooky and disturbing. Must watch for horror buffs. Could be better. Some plot points were confusing. Over all a great scare."}, {"id": 90, "text": "Top notch horror, jumped out of my skin more than once. Watch it you won't regret it"}, {"id": 91, "text": "Hmmmm... It is more violent than scary i would say. Some scenes make you jump but nothing more than that. Ending is disappointment and I couldn't really figure out the devil face or why it haunted that particular house! Story ain't that much."}, {"id": 92, "text": "After I've seen hundreds of non-scary horror movies ... I found a true gem. The Dark and the Wicked it's by far the darkest horror movie of the year so far. The plot is very simple but you don't need anything else because it has a very specific job to do and finally works. Probably A24 vibes... if you are a fan of the genre, this one is a must see."}, {"id": 93, "text": "Now this gets right into the nitty gritty, dying parent kids come home after what looks like years of not being there . Queue some what seemed like jacobs ladder visuals , original not reboot that stay in your head . Creepy priest is included . Tension is all in this movie what you see and don't see . Just sit down put the phone away and absorb this one . And all they had to do was do what momma said ."}, {"id": 94, "text": "This came soooo close to being my favourite horror in a good long while. Right up to literally the last 3 seconds. The build up was full tilt, the sound is amazing, almost disorienting and I couldn't wait for the crescendo, but like so many modern horror these days - cut to credits. I loved it, but at the same time I'm gutted. It nearly almost could have should have been right up there with the classics..."}, {"id": 95, "text": "Gave this one a go as the trailer looked decent for a friday night horror so i never go in expecting much from these shudder horrors as the trailers tend to be better than the movie itself. Starts off slow with minor character development over a long period with nice shots of the farm scenery that the story is based around. The family story and background wasnt very engaging and deep enough and i struggled to understand some of the muffled talking from the actors. When we finally get to some horror and jump scare parts its actually good and starts going somewhere so you strap yourself in for ride that never quite climaxes. This had a lot of potential as the location could have done a lot more for the product. A creepy farm with antlers everywhere and a haunting entity that is relentless could have been pushed a bit further. By the end i was left disappointed by the over the top predictability of the plot. The acting was ok at best and the highlights come from the priest and the mother. A missed opportunity for a devilish farm movie but still worth a one time watch if you like anything horror related."}, {"id": 96, "text": "Don't listen to those who want horror immediately. They don't understand how long it takes to understand how it permeates your life over time. One of the most beautifully filmed movies I have ever seen. Light and shadows are truly terrifying. Wonderfully photographed. I gave cinematography, film editor and director 10 stars. A beautifully spooky film!"}, {"id": 97, "text": "This movie is terrible, no story or even good characters, the best part was when I finish this movie, so boring and dull it makes me want to fall asleep as nothing happens. So many horror cliches it makes this movie seem like a cliche on its own, god this is worse then some of the worse horror films."}, {"id": 98, "text": "Very good movie, builds up from the start and keeps increasing the tension as it goes. Totally recommend it to horror lovers and added it to my top ten for this category!"}, {"id": 99, "text": "This was the best supernatural horror I have seen in some time. It is much better than Hereditary and it doesn't descend into a ludicrous ending like Hereditary did. It builds up a good sense of dread and that dread feeds the actual scary scenes. Just as the couple's tension toward each other did in the Strangers the despair and grief felt by the siblings in this one adds to the horror of what is happening around them. It is simply done and really effective. There isn't a lot in the way of over the top, big budget special effects, just a scary, isolated setting, an unsettling dreadful feeling of approaching horror and the grounded realization of two skeptics that something terrible has come for them with no reason or purpose other than because it can. This is one of the rare ones where after I watched late at night and had to take the dog out afterward I felt a sense of unease and of being watched when I was out in the dark night. I highly recommend it for fans of good, indie style horror."}, {"id": 100, "text": "Here is one horror movie that lives up to the hype. Good suspense extremely eerie scenes. The acting was very good for a horror flick. This movie hit the roots of true horror movie, that kept you on the edge of your seat. The only negative thing I can say, is when we saw the demon in the finale it was too quick but it made the heart move I just wish we saw more of the entity. Solid 9 gravestones out of 10. This is a Saturday night creature feature with a pizza"}, {"id": 101, "text": "I'm not typically drawn to devil tales, but this is subtle, well-written and acted, and contains a few scenes (not the gory ones) that will stay in my head forever, for better or for worse. Hopefully they won't reappear in my consciousness when I'm facing my own death..."}, {"id": 102, "text": "Considering,that I'm horror films crazy aficionado with more than 30 years experience))) and it is very rare that I can be affected by almost anything)))this film genuianly made me sweat!!!Deeply psychological,dramatic,disturbing and very creepy masterpiece!!!Don't pay attention to negative reviews ,written by people who appreciate only jump scares and nudity in regular everyday horrors))) Highly recommended!!!Very satisfied genre fan here!!!"}, {"id": 103, "text": "This film start an old woman sewing the clothes, and she hang herself scene! As turnout, this film is about a brother Michael and a sister Louise need to survive in the haunted house with their illness father, after the death of their mother! Entire film full of boring conversation, and super annoying overuse scene! Such as, overuse of the jump scare scene, overuse of the phone ringing scene, overuse of the searching things scene, overuse of the hallucinate scene, overuse of the dining scene, overuse of the calling names scene, overuse of the cutting vegetables scene, and overuse of the smoking scene! Make the film unwatchable! Barely intense scene is, Charlie kill himself by shot himself inside his mouth! At the end, Michael kill himself! Father of Louise die! It's look like the ghost in the house will kill Louise! The film just end like that! That's it! Wasting time to watch!"}, {"id": 104, "text": "I enjoy it. Was creepy as Hell. Theres a tension. The guilt. The loss. Sickness and madness."}, {"id": 105, "text": "I think we are just used to being fed with the same old thing and can't accept a dig at something new This is a solid scary movie , much better than the so called horror movies of recent times. Yes I understand peopels confusion on the lack of charecter build up or a back grourd story to why these occurrences. But one need to relish this movie in its own glory. It's shot beautifully, some great editing and of course amazing acting. Additionally its quite ruthless. So long story short, if you are an audience who watches a film on its own merit and then try to imagine the missing pieces then you will thoroughly enjoy. If you like spoon feeding , then you might pass."}, {"id": 106, "text": "I enjoyed the movie and even if you don't like it as a whole I think there are scenes that make it worth watching. Yes it's a bit slow but the pay off is good. If you enjoyed Hereditary and Midsommar give it a shot, if you didn't then don't bother."}, {"id": 107, "text": "One of the best horror movies I've seen in years that isn't a gore fest. The ending could've been better but overall the movie was great. Definitely worth a watch"}, {"id": 108, "text": "Outstanding - Very Well Done!I'm a big fan of Bertino. He directed the masterful THE STRANGERS original and the sequel as well as THE MONSTER. Dark and Wicked is OUTSTANDING on every level.Tristan Nyby's cinematography is brilliant, rich, ominous and powerful, as are the performances and a super tight script.Bertino knows how to milk every last ounce of tension and suspense from each scene and keeps it up till the end."}, {"id": 109, "text": "That's the god awful truth it's a 4 at best, had a couple of scary scenes but it's what they now call a boring movie....a slow burn!! And a crappy ending which is now the norm, because so many morons now say its ok to not have an ending that it's better for you to think of your own ending or be confused.... no it's not !!!! a great horror movie has a great ending especially 1 that sets it up for a sequel!!! This movie sucked end of subject but I gave it an 8 to help sell my bluray."}, {"id": 110, "text": "It's always refreshing to come upon a horror movie, which relies on it's atmosphere and building tension rather than cheap jump scares.The only thing I didn't like about it, is main characters being very stubborn and very helpless. I guess it fits the theme of prey being slaughtered by a wolf, but I think it would have been a bit more interesting if they at least had a fighting chance."}, {"id": 111, "text": "If life was that simplistic, maybe we could finally rid ourselves of that burning question why? Not everything are easily explained. Often times were left wondering, and forced to draw are own conclusions. Hunting phenomenons are emblematic of this conundrum and this movie encapsulates that fact and enhances the erieness, heightens the senses as we try desperately to make perfect sense of the senseless. Some of these reviews harp on the notion that every film is suppose to follow a nice and tidy storyline, something they can easily process, but this particular subject is full of shadows. This is why we watch these types of films, because buried in all of our primal brains , lives this nagging fear of the dark and the unexplained things lurking within the darkest corners of our minds. I encourage anyone reading this to watch this film and draw your own conclusions."}, {"id": 112, "text": "Why does this have a 90%? The entire film is so boring and slow. Nothing but occasional short cheap shock scenes."}, {"id": 113, "text": "This movie was so rad. It takes so much to scare me and I was genuinely afraid. Just because a movie doesn't lay out every little detail for you doesn't mean it has no story line. You can tell immediately that the film is about a wife taking care of her dying husband when their children come to visit as his end is obviously near. What happens after that is some of the best horror I've seen in a long time. Movies with this type of demonic horror have been kitchy and over done the last few years and this movie kept me guessing the whole time.As for the ending, if you can't come to your own conclusions then maybe you're not watching enough scary movies"}, {"id": 114, "text": "Short but sweet review. This is an amazing movie. And then the anticlimactic conclusion leaving me so bummed out. This could have been so so much more but the ending felt so so lazy."}, {"id": 115, "text": "Im shocked how strong and amazing movie is this, even is a Low-budget.Everything is realized prefect just how an horror movie would be, He has a strong psychological scariest story, with a lot of pharanormal activities, and a painful scenesThe Movie Symobilzes the Dark Side of Life, for every fan of Pharanormal Activities and horror genre dont miss this Masterpiece."}, {"id": 116, "text": "A man bound to bed with his wife in an old farmhouse riddled with animal skulls, -giant wind rose and howling wolves at night and a herd of sheep. Their daughter and son shows up for their father although their mom wants otherwise. She sees a demonic creature all around the house. I could never forget the scene where she chopped her fingers while chopping carrots. Then their children found him hanging from the ceiling of the stable. Then they found her diary and learnt that she was seeing things and the devil wants their fathers soul. The other creepy scene was when the lights turn on by themselves in the sons room and he sees his mom floating out in the air from the window. With time and such things they start to believe there's sth wrong in this farm. They go and see their moms body in the morgue and coroner gives them crosses from her pocket although she was not a believer. That day a priest shows up at their house and talks to them about the devil. Later Louise finds out that that priest doesn't even live in Texas. The dead visit them. Charlie their family's friend sees Louise cutting himself with a knife and that vision makes him kill herself. Then they find the herd butchered in the middle of the field and then they burned them in a huge fire in front of the which felt like a unholy ritual by throwing dead sheep and skeletons into the fire. The other scary scene was the caretaker ladys suicide by poking himself in her body, face and in the eyes. The son leaves house thinking he should be alive for his family and leaves his sister alone in the farm. He sees at his home his daughters and his wife slit their throat and dead. Then he also slits his throat noticing that he was seeing things but it was too late. Back in the farm the daughter is all alone with her dying dad. Dad gives her last breath and his mom starts to sing outside and her dad opens his eyes and attacks his daughter in the back. It was genuinely scary and it felt like hereditary, the witch and even somehow the skeleton key."}, {"id": 117, "text": "Director/production - 5; Story- 4; Cinematography - 7; Acting - 7; Makeup/FX - 8; Sound - 8; Music - 7; Personal motivation - 5; My average - 6,375It's a real creepy movie, that's haunting you if you watch it in the dark. Only for me the story was't compelling and it missed something. It keeps a lot of questions open."}, {"id": 118, "text": "Definitely not a masterpiece but still a good horror scary movie..i recommend it"}, {"id": 119, "text": "This movie does have a very creepy atmospheric vibe. The actors I thought did a great job. The thing that bothers me is why is this happening to these folks, what events brought it on, maybe that's for part 2. But besides that it's passable for a watch, it is a bit slow I would say, not a high energy movie."}, {"id": 120, "text": "Wonderful acting all around and genuinely atmospheric. Beautiful and haunting imagery. Jump scares and violence felt cliche and some repeated themselves even within this movie. That said, I had chills for much of the movie from the atmosphere and tension alone."}, {"id": 121, "text": "This movie was creepy and scary in a realistic kind of way. It was filmed in the Tolar and Granbury, Texas area and the landscape adds to the eerie feelig of the film. I was pleasantly surprised that this wasn't a bomb."}, {"id": 122, "text": "Had goose bumps the entire movie! The movie was very creepy and definitely drew me in! Reminded me a lot of Hereditary with how dark and uneasy it made me feel. If you are iffy on watching it I strongly suggest giving it a try!!"}, {"id": 123, "text": "Definitely worth seeing and I wished I had seen this in theaters but thankfully I have a decent home theater set up. The movie was incredibly bleak and if you're the kind of movie fan that needs all their questions answered you will be disappointed. The acting was great, score was fantastic, and the cinematography was beautiful. Bryan Bertino made a dread filled beautiful film."}, {"id": 124, "text": "Wow, this is a slow atmospheric film that keeps the viewer on the edge of their seats. I was pleasantly surprised at how well this was filmed.Two siblings are summoned to return to their childhood farm house to be with their dying father. This almost sounds like a family drama but this is when the things get interesting with strange happenings occur...It has that foreboding Heredity vibe going for it. The psychological trauma that plays out and the gore make this a compelling watch. The acting is so organic that it enhances the film.This is a good recommendation for anyone that likes a good psychological horror film."}, {"id": 125, "text": "The movie was very good, the atmosphere was chilling and reminded me of a movie vvitch and hereditary, it was intense and dark, very refreshing!"}, {"id": 126, "text": "'The Dark and the Wicked' is a solid horror that comes very close to becoming a classic. I am actually surprised by the relatively low rating.If only it had fewer jump scares and more interesting dialogue it would've been just perfect (maybe also a little less repeating scares).All the subtle creepy imagery was great, and I loved the ending. If they would show less of the Wicked and make it even more subtle...Anyway, it's a great horror film with amazing performances. It was nice to see Xander Berkeley and his performance was stellar.A strong recommendation for horror fans."}, {"id": 127, "text": "Metaphysical horror movie. A common idea of evil, demons, etc., in this case has targeted a family with their dying father. It combines terror with sorrow. It is interesting, dark, and with suspense from the beginning to the end, but the pace of the plot is very slow without particularly intense horror scenes. It also greatly confuses the viewer between the metaphysical and reality. It can be seen for once, but it does not have anything very strong or an epic end to raise the film enough.6/10 from me."}, {"id": 128, "text": "This movie sets an Eerie vibe that will leave you shaking. It's very creepy and sets a tone that will surprise you. It starts a little slow but it's still creepy farm vibes. If you want a new horror movie to watch and you just can not decide on what you want to watch; please do yourself the favor and watch. Best watched in the dark in bed, or living room."}, {"id": 129, "text": "This film was worth the time spent watching if you can sit through the first 20 minutes. The first 20 mins focused more on setting the story and building the suspense but once you get past that there are plenty of jump scares. I only gave 5/10 for that reason, and also because I thought the ending was a little disappointing."}, {"id": 130, "text": "In my opinion the movie is worth it I really liked it."}, {"id": 131, "text": "Don't read the negative reviews ! This was a good movie . Watch in the dark alone for sure !!! It will get you jumping off your seat !!!"}, {"id": 132, "text": "Really cool, it sets the standards really high.... Well I'll be dammed. Bryan Bertino finally made a horror flick I like. Didn't care for The Stranger of The Monster. Frankly found them weak, this one was actually genuinely creepy at times. Lot of horror films this year are playing on the theme of loss. I think this one has done it the best so far though. There's a heavy sense of dread and weight carried from the beginning to the end of this film, and it rarely lets up. On top of some gorgeous shots and memorable visual moments. Beyond some funny choice of almost cartoonish beast-like track samples for some of the sounds, this was damn great and I was engaged. Dig it Bertino. Looking forward to whats next."}, {"id": 133, "text": "If you like horror with limited CGI or not many at all. As well as dreadful horror like hereditary. Well then this is a movie perfect for you. It's sinister but it doesn't explain much of it by the end"}, {"id": 134, "text": "I just finished viewing this film as part of Fantasia Fest 2020. It's a very solid horror movie.The film tells the story of two siblings who return to their family farm to take care of their dying father and to help out around the farm. I won't spoil anything from there, but they soon start to realize that something isn't right with their farm.I enjoyed writer/director Bryan Bertino's previous film, The Strangers, and like that movie he uses the eeriness of the farm settling to build atmosphere and tension. And just like The Strangers, this film also features unwanted visitors, but just in a different way.It has a lot of quieter moments to build tension and it does payoff when some of the scares come into play. There were a few things that I wasn't expecting/didn't know which direction they were going to take.With good performance along with the atmosphere and cinematography, I really dug this film. Check it out when it becomes available."}, {"id": 135, "text": "I was excited to check out Bryan Bertino's latest offering, The Dark and the WIcked. His debut, The Strangers, was an instant classic introducing masked home invaders in the most unsettling of ways. His followup, The Monster, was well-crafted as an estranged mother and daughter get stranded in their car in the woods while being stalked by a monster.It was ultimately disappointing as there was nothing to connect the disparate creepy happenings to the story-line.Many movies try to tease the viewer with unreliable narrators, leaving them to ponder whether what is happening is supernatural or all in the characters head. The Babadook, Black Swan, and The Lighthouse are examples of movies that do this right. Unfortunately, this doesn't.It's clearly something supernatural haunting everybody, but beyond some disturbing and/or violent scenes (all of which are well done), the movie is just too ambiguous in a very frustrating way."}, {"id": 136, "text": "Roger Ebert once said, It's not what a film is about, but how it is about it. I had to take that into consideration when rating and reviewing 'The Dark and the Wicked'. This is admittedly not my type of horror movie. I struggle with supernatural horror, because I have zero belief in it and thus it does nothing to unsettle me. However, I have to admit that this film was done very well, and that if I were unsettled by those types of films then this one would have done the trick for me. This film is going up some people's alleys big time.This is such a beautifully shot film. Director Bryan Bertino is so good at framing what is on screen, he doesn't even need what's on screen to be all that impressive for it to look good. I also love the inventive camera angles he comes up with. They don't always work to heighten the scares or even the tension, but they add a touch of class to the mix which is so often missing in the horror genre.My biggest gripe with the film would be all the jump-scares and the scenes where the demon is basically just trying to scare the characters rather than harm them. I understand why they have to be there to pad the runtime to 90 minutes, but they are still very frustrating to watch. I also didn't really connect with either of the two lead characters. They were very flat (understandable in their situation to be fair) and that made it difficult for me to care all that much about their fate. The final 20-30 minutes of this film is an absolute blast though I'd have to say. The pacing rockets to life and there are some fun and pretty messed up scenes. 'The Dark and the Wicked' is worth a watch."}, {"id": 137, "text": "This will most likely go very under the radar even though it's more effective and well executed than any of the more recent critically acclaimed horror films of late. Its depraved visual style is in your face and really doesn't let up or let pretentious undertones drag it on. While it certainly has horror cliches, they're well presented and never seem cheap.The story is filled with tremendous grief and overbearing family stress and makes the blending of the paranormal horror aspects work that much better. Director Bryan Bertino has always had a keen eye for distinct details in his visual style, and isn't afraid to get vicious at times to compliment the outstanding tension build ups. It amazes me Bertino isn't more recognized because he's a great writer director that deftines you knows horror and atmosphere.Overall this film will be very hard for some to stomach, emotionally and visually, but it's one of the better horror films of the year and maybe last few. It's sheer depravity and how it's presented so effectively is hard to come by lately."}, {"id": 138, "text": "I was lured in to sitting down to watch the 2020 movie The Dark and the Wicked given the movie's poster/cover and the fact that it was a new horror movie that I hadn't seen already. And given my love and admiration for the horror genre, of course I needed no persuasion to sit down and watch this 2020 movie from writer and director Bryan Bertino.And while the movie is heavily atmospheric and brooding, then the movie's storyline was just so horribly bland and pointless actually. I sat through the entire movie feeling remotely entertained, and I was just hoping and waiting for the movie to pick up its pace and deliver something extraordinary. The movie is long finished now, and I am still waiting...The storyline was just uneventful and it made for a very prolonged movie experience. And since I sat there waiting for something grand or even remotely scary to happen, the time just felt like it was dragging on and on forever. Don't get your hopes up for this being a thrill-ride of a horror experience.It should be said, though, that the acting performances in the movie were good. I do enjoy watching a movie where I am not familiar with the actors and actresses, and that was the case in The Dark and the Wicked.Visually, as I mentioned earlier, the movie is very atmospheric. The movie is, however, not a movie that is heavily reliant on special effects, so you are not in a for a grand display of CGI or practical effects. There were some interesting enough bloody scenes in the movie though, they were few, but they were there at least.All in all, I found The Dark and the Wicked to be a swing and a miss from writer and director Bryan Bertino. And it wasn't an entertaining movie experience for me. As such, I am rating it a mere three out of ten stars, and that is on a generous notion even."}, {"id": 139, "text": "It's not often you get horror films that are genuinely disturbing, but this one certainly delivers that in spades. Don't expect a standard, linear plot with lots of dumbed down exposition - this film just 'is' brutal, unrelenting and really gets under your skin.The cinematography is beautiful and the actors all deliver above average performances but the real star of the show is the audio. The sound design elevates the film significantly, to the point where you probably won't get anything like the full effect if listening via TV speakers (or worse). There's a lot of very quiet detail going on in the sound mix that I fear some viewers will miss out on completely.Only minor fault I can think of is some less than realistic CGI in goats/field scene.Other than that, It sets you on edge from about five minutes in and doesn't really let up at all. One of the films of 2020 in my view."}, {"id": 140, "text": "What a great film! The story was interesting, the acting believable, the pace was right on, and the scares were well placed. While the plot was nothing original, it was definitely a well made story.The cinematography displayed some real creepy imagery that enriched the overall sense of dread and despair. Imagery that approaches the scare level of the film Hereditary. Truly disturbing stuff.The actors playing the brother and sister did a phenomenal job conveying their grief and fear while dealing with their less than ideal situation. They helped make the story believable and terrifying.This is definitely worth a watch! Don't miss out!Highly recommend [7/10]"}, {"id": 141, "text": "I'm a huge fan of horror movies and I've seen far more than my fair share but I especially love a horror like this. I also don't get creeped out too often but The Dark and the Wicked not only did a good job of keeping my attention, but I found myself drenched in goosebumps a couple of times and that says a lot for me. Yes, it's a slow burn so if you're one who needs a fast paced film full of the Hollywood hoopla, then this is not for you.The cinematography is suburb along with the score and the actors are believable to say the least. The atmospheric menacing evil is thick and rich throughout and the limited CGI is well done and not over the top. I only wish it had more of back story as to why this was all taking place but nonetheless I was able to let go, see it to the end, and I'm so glad I did.There's a few shots that are pretty disturbing and ominous and if you can get past the slow pace, and the thoughts of wondering why they don't get out.... you may find yourself enjoying a pretty well crafted film that could possibly, just creep you the hell out. Enjoy!"}, {"id": 142, "text": "The Conjuring era has given us countless possession, haunted house and thematically similar horror movies, and not all of them great, good or even decent. It's a genre I've been a little tired of, as it has, in my opinion, run somewhat dry, but a solid execution and smart shuffles can change everything. With Bertino's The Strangers being a notable and influential horror movie for me all those years ago when it came out, I have faithfully watched all his movie when they come out, and The Dark and the Wicked, I'm happy to say, is my second favorite of his.We are welcomed to stay in a secluded and creepy farmhouse, in the nowhere part of a rural region that's just as bleak. Sadness, sickness and unpleasant mystery inhabits this house, in which an old man is dying and his wife is losing her mind. Their children, Louise and Michael, arrive to take care of mom and mourn the father, but encounter also something sinister and increasingly malevolent roaming the farm.The Dark and the Wicked is, for the most part, an old story that ends exactly how I thought it'll end. But predictability factors don't often mean that much, when in comes atmosphere and particular psychological, serious and emotional themes. I'd speculate with some confidence that The Dark and the Wicked is inspired heavily by the (too slowly) growing surge of bleak psychological horror movies in the latter years, like Hereditary and The Witch. Bertino's fourth full feature has an atmosphere that tries to compete with that of the aforementioned and similar movies, the thickness of it is fed with themes of family dysfunction, mental illness, guilty conscience and the like. Having said that, The Dark and the Wicked doesn't plunge depths we've seen elsewhere. The two siblings, portrayed by Marin Ireland and Michael Abbott Jr., are the heart of the story, they are the ones with all the responsibility, tough choices and consequences in the messy and conflictive state of their life, helped made miserable by the evil force. The story ends in a way that's also not anything new, but it fits with film's overall nature. Above all, I believe that such leaning on the mood is intentional, because it's what makes this movie stand out it in its subgenre. I see how The Dark and the Wicked definitely could've been worse, but, honestly, I don't know how much better it could've been. The cinematography encompasses the bleakness of the story very successfully, and is colored in a way that could not carry a comedy. The relatively unknown cast delivered good performances - I got to thinking afterwards that the main characters, especially the two siblings, not looking famous and pretty might be a committing factor in a good way.If You enjoy religion/possession/demon/haunting/haunted house horror movies, definitely consider watching The Dark and the Wicked, a well above average example of the subgenre, it has the potential to creep one out. My rating: 7/10."}, {"id": 143, "text": "I'm not gonna lie, this horror movie was pretty awful. It is boringly slow and features a lot of snoozing silent scenes that are soon broken up by loud screams, to wake you up from snoozing, and even louder telephone with the most annoying ringing that no one ever answers. So typical from horror directors they literally enjoy torturing your ears, it's obvious at this point.But not only that, the story itself that is just ugly, and also kinda artsy-fartsy and cheap. Cheap, in the sense that there has just not been put much effort to make the movie somehow meaningful and, god forbid, entertaining. Everything is just so easily solved with some demonic hallucinations that come out of nowhere and this happens all the time. It's a movie that makes you feel bad, almost insulted, like the director is toying with your attention and perception all the time. It's not even entertaining, because inevitably you will start hating him.I don't know why anyone would enjoy watching such a movie. It's an ugly story with an ugly rural and dark setting full of depression and desperation. It also features that, now cliche, annoying ugly woman with her crying face on all the time, that makes it so much harder to watch. Kinda like The Babadook, but overall, also very strongly reminecent of movies like the VVitch and Hereditary.However the quality of the movie is good, the actors are decent, the camera work is interesting, and the movie is definitely trying hard to be serious, so props to that.But did I actually enjoy the movie? No, ...not at all."}, {"id": 144, "text": "Bryan Bertino's fourth film in 12 years materializes as a darkly ominous and moody horror offering. While there is plenty of atmospheric dread, the movie feels a bit more like a movie sub plot rather than a fleshed out story. It is not until the final 10 minutes that I sort of saw the story come full circle and began to put away my sub plot accusations. This movie is well done. There are no answers here, but it is still a somewhat scary movie. Its not necessarily the material that is scary but rather the atmosphere through out. The story isn't very good and it is very stretched out feeling. The movie is also a bit boring. There is nothing we haven't seen before here, but that's kind of okay with me because the film is more of an experimental piece than a major attempt to be something it isn't. I appreciate this movie and I like how Bertino added another horror sun genre to his portfolio. No two movies of his are remotely the same. His first was a home invasion film with threats rooted in reality, his second was his hand at the found footage sub genre which was bustling at the time, his third was a creature feature, and now his fourth is a haunted house movie at its core. Great diversity in horror subgenres. This isn't the best of his 4 movies. Its not even the second best in my opinion. Its his third, while Mockingbird is by far his worst film to date. You can always expect something dark and wicked from Bertino"}, {"id": 145, "text": "So good acting, some interesting scenes, some gore, and a general feeling of dread. As far as plot- two siblings ( maybe half? What was that phone call to the preacher in Chicago about?) come home to take care of their dying dad and sad mom and find their house is possessed by the devil. And that's it. There is no why, there is no how, there is no resolution. There is no battle of wits or morals or even good and evil. There isn't any reason, or background. You're just thrown into it, just as the characters are. But this is Hollywood after all. We don't want films that reflect life or reality ; esp when they're about paranormal events. This I suppose is a realistic take on a family being haunted by a dark and wicked thing. But as far as entertainment ? As far as a film goes? We want some of that Hollywood flair or else it just falls a bit short - because we have all been programmed to a certain degree to want resolution, to want the why and the mystery solved in a sense. So when a film gives us none of that ? It just feels shortchanged. Sure we can fill in the blanks. This could have been a great film. This had all the required ingredients. Of the Highest quality. It just needed a little more flair, a little more story after all- Sure there is art house film, that's like a painting on film. They don't usually have a whole lotta story. But beautiful images and messages in those images. This film isn't an art house film. Not by a long shot. There isn't any if at all messages in this film. It's pretty straight out. Nothing to tinker on. So if you're not an art house film, then you're a story above all else. And it almost makes me angry when the writers and directors forget that. Because to me, it kinda feels like a cop out. Like we are unwilling to risk failure so we chop the story- because the story after all, is the hardest part to create. Most films now are redone, or based on books- because real story's are so hard to tell. To create. To be original. Any college grad can tell you what a good story needs. And this story is missing some major parts. And in that way, it fell flat. I hated the strangers. I feel like I should probably say that. Because there was a whole lotta people who loved The Strangers and thought it was the greatest horror film. I was bored to death in the beginning of it and felt like I was drowning in useless back story, and then the end of the film just confirmed that for me. I'm just not impressed with violence ; any one can do violence. It's sort of like sex. Anyone can do sex. A film weighed down with too much of either isn't going to be good, because it's cheap and we all know it. Both The Strangers and this film are fundamentally, inherently vapid. I guess I saw what could have been here with just a little more effort, little more creativity, little more story. And over all? It was a let down."}, {"id": 146, "text": "'For a Wolf it does not matter whether you believe it is a Wolf'This one line encapsulates the basis of this movie. There are dark and wicked things in this world for whom death, suffering, manipulation and torture is pleasure. The director relies on this foundation to deliver an atmospheric and emotional horror movie. The jump scares are scarce yet there is all pervading menace and terror in every frame. Each movement of shadow is harbinger of fear. Never have the howls of wolves inspired such dread and anticipation.As far as story is concerned it moves within the narrow confines of its characters. The characters themselves are limited: basically on a need to know basis. Where the movie scores is the interplay between the characters. The vulnerabilities of characters are exploited and they are manipulated.The acting is very good by all. The cinematography and sound is exceptional. The direction is excellent. The director builds up an atmosphere that is claustrophobic and drips with helplessness. It is some achievement considering there are several wide frame shots of outdoors.The ending is inevitably controversial though in my opinion it does not take away anything from a very solid horror movie. I recommend it to all who appreciate quality horrorExcellent."}], "reviews_amount": 147}