{"name": "Another Round", "titleId": "tt10288566", "reviews": [{"id": 0, "text": "I went to watch this movie, hoping it wouldn't be either moralizing or celebrating of Danish drinking-culture - and fortunately it delivered! Well I don't believe it was fortune or luck, but rather a deeply thought through film from Vinterberg. Before I went to watch it I saw a couple of interviews with the director to get a grasp of his vision. He emphasized that the quote at the beginning was in many ways the key to understand the film itself. What is youth? A dream. What is love? The dream's content - Kierkegaard Thus it is not so much about drinking, but rather it tackles the reason for all the drinking. It is about the longing for youth - a state of hope, love and vitality. We long to live life to its fullest, but we seem unable to embody that in our own lives, so we succumb to cheap methods, such as drinking. Notice how throughout the movie there is an underlying sense of depression and misery, especially in the character Martin. He attempts to fix his whole life through drinking, and it initially works, but he is unable to control it. It is not untill the last moments, where his whole life is in ruins, and his alienated wife finally admits that she still misses him that hope shines on him. Only then can he dance! It shows us how hope, love and vitality isn't found at the bottom of a bottle, it is found in our most meaningful relationships and our endeavors to hold on to them! It isn't the beer that enables him in the end, it is that text from Anika. Thus we see that drinking can be a wonderful thing as well, as long as it isn't the very thing that keeps us going in itself (Tommy's demise!). It is love and courage and daring to fail and to fall that should be our driving force, and sometimes that one drink can be the little nudge we need to embody these ideals (the student at the exam - about Kierkegaard!!), but it shouldn't be at the center of our motivation in life."}, {"id": 1, "text": "I saw a few mediocre reviews, which describes the movie as celebrating alcohol culture, hence why giving a mediocre score. Which is absolutely not true, and a misunderstanding. Maybe these persons comes from a society with less alcohol consumption, and see this as an unrealistic way of inciting a society to drink more. The movie is in my opinion more likely criticizing the alcohol culture in Denmark, as it perfectly portrays the danish alcohol culture and how absurd it is, which makes what is actually a drama genre movie to become somewhat of a comedy, because it is so realistic, and the realism is just hilarious thought-provoking."}, {"id": 2, "text": "I went to the cinema today to watch my third movie from Thomas Vinterberg, after watching The Celebration(1998) and The Hunt(2012) i had huge expectations for this movie. And i have to say that i got surprised even more than i thought was possible.Another Round or the danish title and phrase Druk is just a cinematic experience on another level. I as a Dane can relate to this movie, as if it were written directly to the individual citizen. The way the story is bound together with great dialogue and humor is indeed phenomenal, the way the story criticize the danish alcohol-culture is even more breathtaking, and thought-provoking. With of course amazing performances from Lars Ranthe, Thomas Bo Larsen, Magnus Millang and Mads Mikkelsen. You can really feel that the actors and crew have been working hard on this task, and all turned out great. Once again Vinterberg have done it!"}, {"id": 3, "text": "Just watch it. The synergy amongst the actors and director is awesome. When watching it you realize how realistic it actually is. This could happen right now in any Danish highschool or office."}, {"id": 4, "text": "...but a fourth gets soaked then wrecked. The male mid-life crisis crutch proves once again to be nothing more than an empty vessel, albeit a more than capable form of transport as it masks the wailing sirens from four close friends and sails them perilously close to jagged and rocky coastlines. The easy way out but the hardest way back in, and all because being human, sharing emotions, making the wrong assumptions, breaking habits, opening up and being courageous is so much harder than unscrewing a bottle top or popping a cork. A brilliant piece of cinema with some exceptional performances and direction - Skål."}, {"id": 5, "text": "Thomas Vinterberg tells perfect stories of what alcohol can do. As a result of problems with teaching, private life, and general happiness - Four high school teachers agree to try an experiment exploring alcohol's influence. What happens when maintaining a constant promille of 0.5? Martin(Mads Mikkelsen) is the lead role, and the one we follow the most. He has an outstanding performance. The movie executes well to not have a biased opinion on drinking, but show the whole picture.In the western world, Denmark is one of the countries with the most relaxed relationship to alcohol. The legal buying age is 16 and by high school a lot of students drink 20-50 units of alcohol a week."}, {"id": 6, "text": "I know Thomas Vinterberg's cinema, from FESTEN on. I was a teenager when I saw it, and found it fresh and brave. Later on as a 30 something I watched THE HUNT, and was amazed by the good storytelling, the ability of Vinterberg of making you feel so outraged with the injustice Mads character suffers, and of course with Mads work. Then as a 40 year old I watched last night ANOTHER ROUND, and I found out that Vinterberg is a constant cinematographic genius, exploring smart theories. I really appreciate he doesn't try to school in a LEAVING LAS VEGAS style, of how bad alcohol is. It's a story about moderation, self government, and redemption. Vinterberg makes sure to approach alcohol with an analyst eye, and not of a moralist. After all, alcohol is not to blame when it is abused: it's still a human error to misuse it. I wonder if Vinterberg being the entrepeneur of DOGMA, made the experiment himself and encouraged his film crew to explore what the 4 main characters do. After all it is what we produce that matters, and not how we produced it."}, {"id": 7, "text": "Jeg så filmen her søndag, og det med det samme er blevet, det bedste der er sket i 2020. Super sjov med masser af god humor og drama."}, {"id": 8, "text": "Thomas Vinterberg manages without hesitating to interest with a singular story, with equally singular subjects and mindsets. Simple shots, complex in their intents, in their conception, but effective in rendering. Film that understands and explains how the concepts of resilience and party are allegorically hidden in many other facets of life, with much deeper meanings, where no one knows what lies behind a face; moreover there is always to be taken into account the inner beast that wants to escape from a monotonous world, on a metronome, too tight and when it comes out it seems that the world rejects the different, which is not different at all. Massive-caliber actors, imposing, poignant and funny at the same time, with a spectacular Mads Mikkelsen who reconfirms his statuesque actoriality."}, {"id": 9, "text": "At some point we all wonder what sort of impact our life is making. If we dare to dance, to fly,... we must first seek and find the ignition. How fast we push down on the pedal is where survival catapults to artful balance. This film is wholly accessible high art, swaying madly but ever so finely, between poignant and damn hilarious."}, {"id": 10, "text": "This is one of those gems you find very rearly. Mikkelsen in an Oscar performance as the rest of the cast. The script is simple but very entertaining and a clear example of how a good idea is more important than huge budgets."}, {"id": 11, "text": "The concept of the movie is funny. Four friends becomes inspired by a philosopher who proposes that the human condition is slightly too sober. To test this theory, they try to live a tipsy life .Apart from the funny concept, the movie is void of surprises. The men are depicted as ordinary with ordinary problems. They are in their forties, they are either missing the life before children or regretting never having them, they don't pay suffient attention to their romantic relationships, they are uinspiring teachers at a high school where all the kids would rather stare at their screens... And their resort to escape this reality is alcohol.Their situation surely might be relatable, but it's also incredibly cliche. The dramatic curve is also entirely predictable.They drink alcohol and suddenly turn into sublime teachers who are saluted by cheering teenagers. They pay attention to their partners. Everything is swell.The drink more alcohol, and things turn even better, but the movie hints that we might be approaching hybris.They drink even more alcohol and their situation turn misrable. Who would have been able to predict that?The movie suffers from this predictability throughout. To give another example: In a scene, one of the characters (I can't remember the name, apart from Mads Mikkelsens excellent performance, the characters are rather - yes - ordinary) exclaims: I wish I had children, no one will remember me as i grow old. In the very next scene, the character meets a distressed high school student and they develop a memorable relationship. What a ride!I could keep on listing several similiar examples, but that would spoil the movie.I guess the movie is daring in that it celebrates alcohol and alcohol culture in a Danish society that frown upon teenagers' (hefty) alcohol consumption. If you are one to get provoked by a celebration of drugs and the proposition that drugs (such as alcohol) might be a helpful aid in living a more inspired life, then this movie might shock you and/or give you a few new ideas.Since that thought does not provoke me in any particular way, I was left unfrazzled.It's a weird take on a feel good movie. There's alot of warmth but not a whole lot of depth.If you feel like watching a feel good comedy with a novel concept about a stereotypical group of male friends that realise that alcoholism in fact does not fix their existential problems, knock yourself out. If you want to be provoked, touched, surprised, inspired - then I don't think this is it."}, {"id": 12, "text": "Another Round (a.k.a. Druk) has a fascinating premise, but a messy, stumbling plot that never quite allows for a good film. Four teachers explore the idea that keeping their blood alcohol levels around 0.5 might make their banal lives and dull classrooms a little more exciting... not only for them, but the people around them. Perhaps director, Thomas Vinterberg, should have had a few more shots before filming.... or a few less."}, {"id": 13, "text": "Another Round - Druk is the latest film from Danish director and Dogme 95 movement co-founder, Thomas Vinterberg (The Hunt, Far From the Madding Crowd). Another Round is a dark comedy following the lives of four high school teachers in Denmark going through their own individual midlife anxieties. To loosen up, the four men decide to test a theory they found that states life can improve by spending the day slightly drunk, at a constant alcohol level of 0.05. The film features a strong, magnificent, emotionally wrenching lead performance from Mads Mikkelsen (Le Chiffre in 2006's, Casino Royale; Hannibal Lecter in NBC TV drama, Hannibal) as history teacher, Martin."}, {"id": 14, "text": "Great plot. Great acting. Makes you want to live like a dane!"}, {"id": 15, "text": "Today i went to the cinema with my mom and my sister. They wanted to see this movie and I didn't know too much about it.But jesus christ, this movie is a masterpiece. Thomas Vinterberg is the fantastic director of the movie and the casting is just perfect. Great performances from Lars Ranthe, Mads Mikkelsen, Magnus Millang and Thomas Bo Larsen.Amazing actors, amazing director and truly, TRULY amazing movie. I'm speechless. You should definetly go watch this movie. If i could decide... i would give this movie an Oscar..."}, {"id": 16, "text": "Easily and without question the best film of 2020. The cast are excellent. Mads Mikk just rocks. A poignant tale highlighting the troubles of Danish drinking culture. Humorous and heartbreaking but filled with so much love. Just watch it!"}, {"id": 17, "text": "Ignore ALL the high ratings and bogus reviews. This film is only at best a 6/10. Directing and performances were actually quite good, as was the humor.But the almost 2 hour runtime with very slow pacing made it feel like it was 3 plus hours long. It was very predictable and not much suspense in the story. It's a shame the filmmakers have to resort to bogus ratings and reviews, it only shows they too had no faith in their own film, so they feel the need to deceive their potential viewers. Shame on you. It's a generous and honest 5/10 from me"}, {"id": 18, "text": "It most certainly is a funny and emotional experience to watch this movie. The acting is phenomenal and the camera work make the scenarios feel very life-like and realistic. As always, Mads Mikkelsen performs at the highest level - as do the others. Also, the ending is great."}, {"id": 19, "text": "In a world of social distancing, this film reminds us that true happiness can only be found in meaningful human relationships."}, {"id": 20, "text": "Best line up you can find. After an exceptional performance together in Jagten, the cast does it even better in this life-affirming story. A simply idea turns out very differently for these characters, but fun and exciting to follow the roller coaster of life and death."}, {"id": 21, "text": "The beeeessssstttt mmmmooovvviiieee ever!!! Will watch it over and over!"}, {"id": 22, "text": "Real people with very real desires, hardships and challenges."}, {"id": 23, "text": "Forget the subject matter for an instant, this film tackles really hard subjects in arguably really bad situations. But we are witness to this divine exhibition of self. Us, not them. I would put tthis film up with, those late/mid mornings with 'friends' asking serious questions. PS I was done (tagged/arrested) racing my car in Torremolinos at 0.78. I drove better than Lewis."}, {"id": 24, "text": "Another Round (original title Druk) is one of the best movies I have seen this year.Four close middle aged friends decide to test the theory that the quality of life improves while maintaining a constant level of alcohol in your blood.Mikkelsen once again shows his talents and is supported by a great cast. The story is original and not too moralizing. On the contrary to be honest: I don't think the AA will be too positive about this film.The dance sequence plus the freeze-frame ending, also gave me the goosebumps, instant classic for me!"}, {"id": 25, "text": "The Danish movie Druk (2020) was shown in the U.S. with the title Another Round. It was co-written and directed by Thomas Vinterberg.Four high school teachers decide that they will perform better if they raise their blood alcohol level. They actually do perform better with a small amount of alcohol, so they decide to raise it, and then raise it some more.This leads to one teacher arriving at a faculty meeting who is so drunk he can barely walk. Another teacher dies. Marriages are ruined. The last straw for me was when one of the teachers helps one of his students get drunk before a final exam. The student performs really well. That's quite a message about dealing with anxiety--get drunk.We saw this movie as a virtual rental from Rochester's excellent Little Theatre. I don't know if The Little staff had seen the movie before they sent it out. Maybe they liked it. (Clearly, many people liked it.) I didn't like it, and rated it 4."}, {"id": 26, "text": "Perfect movie with Perfect writing and an absolutely amazing humor"}, {"id": 27, "text": "Thomas Vinterberg is insane, the hole story, there have some real story's in the movie, is so god. Brilliant actors ."}, {"id": 28, "text": "The overall theme is that many of us is living boring life's. Therefore the main characters tries to live out a theory that claims that people should have 0,5 per mille alcohol always. When they have that they dare to do what they really want.Of course they can't control the task and they go overboard. But during the experiment they all discovers that that by making an effort you can experience joy and happiness in your professional life and you social life you don't if you just do nothing."}, {"id": 29, "text": "Great acting , great writing , great directing . Love this film of loss, love , and alcohol . Funny , sad , tragic , but that's life .What a life"}, {"id": 30, "text": "Loved it, the story is interesting, the characters are cool and the ending isn't cliche."}, {"id": 31, "text": "Wow. This movie is just great. An all around well made movie. Mads, Thomas, Magnus and Lars are fantastic and you go out from the movie theather with a good feeling. My time was well spent."}, {"id": 32, "text": "It's awesome, realistic, funny and well made. The plot is great, very well written and flows smoothly. It tackles an interesting important topic in a nice smart realistic way. The performances are amazingly superb and real, and the harmony between the actors is so likable. Another Round is a beautiful artsy slice of life movie that has a beautiful story and is full of both funny and sad moments. Denmark chose it as its official candidate for the Oscars and it definitely deserves a nomination."}, {"id": 33, "text": "I thought the movie was funny and lighthearted but when it became obvious Tommy was going to kill himself, which he made very clear when the guy left his house, and they did nothing to make sure he would be OK because his job and those kids were his whole life was really upsetting. The one fat guy with the three kids was the reason Tommy became an alcoholic. It was the othe three friends that bailed on Tommy because he was fired due to their drinking that they were all engaged in at school. That job was his life and so were those kids, yet they didnt go to make sure he was doing OK. They just left him alone because he was no longer working at the school so he ended up drinking himself to death. What kind of friends are those? Especially when he made it clear he was going to kill himself when he was on the door step leaving. It was so obvious that it would take a low IQ dolt not to realize what he was really saying!!! They glorify drinking and ignoring your friends when they need you the most. I thought this movie was going to be funny, which it was, but then I saw how selfish these grown men are, and how they weren't there for a friend that they turned into an alcholic. Tommy was fine before they started this idiotic study of theirs. Tommy was helping these kids and was a great coach. They ruined that for him because they only cared about him when he was drinking with them and working at the school but once he was fired they stopped caring! I was very upset seeing how this movie played out at the end. These guys just kept drinking and acting like they are 18 year olds! These are grown men acting like complete losers and couldn't even be there for one of their friends who was obvioulsy distraught and in a lot of pain because he lost his job working with kids which is what gave his life meaning. His friends' essentially peer pressured him into destorying his life and then they stopped caring about him since he wasn't working at the school anymore! Horrible film with a horrible message! I thought the message would chance but it didn't. And all of a sudden the wife just suddenly changes her mind about their marriage? HAHA! That relationship is over! Done! He is going to need a lot more alcohol for whats to come and his children are going to need even more therapy because their parents are so cold and messed up!"}, {"id": 34, "text": "I was waiting for this movie to come out for so long. And finally I watched it today. I am obsessed with Scandinavian, Nordic cinematography, tv shows and films. But I notice that the Danes have a special magic and spice. And Another Round is no exception. This is my favorite movie from 2020. December is the month when I watch the most movies. We have ten more days till the end of month, but I think that not a single movie which will come out can't beat this one. This film has very original and realistic story, and mad group of actors. But number one is Mads Mikkelsen, oh my god, what a man, he is perfect in every role, the most charismatic actor from the last decade. He is the star of every movie he is in and stole every second. He takes everything to the next level. I would give him every award in the world, so I hope it goes well for him in the upcoming awards season. Also, the soundtrack is superb. Especially the main theme song What A Life which in combination with final scene makes a little perfection of the universe."}, {"id": 35, "text": "But for real, great movie. Its an interesting look at danish drinking culture and how the psychology behind it can effect everyone"}, {"id": 36, "text": "Another round 2020 the film was very good and very special we spoke about the boring life at the work and the house What must we do to make life more enthusiastic and lively? and what is the cost for this excellent work from the director and the cast specially mads who did a great performance in the film but sometimes I felt like the film has skipped some events with the characters and their problems overall the film is very good and I think it will be an Oscar winner"}, {"id": 37, "text": "Wow what a movie i never expected to be that good the writing was perferct the acting was great the cinematography was good and those beautiful music it was amazing and man mads mikkelsen i have never seen him act bad in a movie the man is a great actor and underrated the guy deserves so much more credit so this the best of 2020 so far just watch it it's worth it"}, {"id": 38, "text": "4 men. 4 friends looking for a second wind. Alcohol, a lot of alcohol and through the dark sides of the film escapes from the light, a joyful, saving life impulse. Madds Mikkelsen perhaps plays his greatest role here. A sublime ending that tilts the work into those cinematic moments that mark."}, {"id": 39, "text": "What a beautiful celebration of life this movie is."}, {"id": 40, "text": "This is the best Danish movie i ever seen!!!The performance is Excellent !"}, {"id": 41, "text": "This movie is what people used to see when they watched a movie. It's so refreshing to be entertained, a movie that isn't full of inter-sectional feminist ideology or leftist rhetoric.This movie can be watched with mates, a girlfriend/boyfriend or your wife/husband.If you're from a country that has a problem with alcohol, skip this one."}, {"id": 42, "text": "This must be the teraffic performance from Mads Mikkelsen after The hunt, for which he won cannes best actor award. The movie shows affects of alcohol in lives of 4 friends. This film might be the one with best ending in 2020. Its funny, dark, beautifully shot and brilliantly directed piece of art. One of the best danish movie i have ever seen. Special thanks to director for making Mads dance again......the ending was such a treat"}, {"id": 43, "text": "Last scene with Mads dancing deserves Oscar! Mads, please dance a lot through life!"}, {"id": 44, "text": "This is a drama digging deep into the mundane numbness of everyday life. It also digs into the human relationship with alcohol. Then, it digs into the intertwining of these. Do not expect a comedy. I made the mistake of believing that this would be a comedy, which it wasn't. I wouldn't even say that this is a light-hearted drama, either. Some scenes hit heavy and were just tragic to watch.I may have expected a comedy, but got a fantastic drama movie instead. I highly recommend this for anyone who wants to watch a good drama in an everyday environment.7/10"}, {"id": 45, "text": "It's great to see Mads Mikkelsen and Thomas Vinterberg together again. The movie is light in the dark due to the lack of good new movies. The film here doesn't encourage alcohol abuse and does not express that alcohol is a good and harmless thing, but the movie tells us that every person is innovative and has a passion for life, but he just needs motivation to believe in himself, but this does not mean that without it you will be nothing. Everyone reaches a time in their life where their passion stops and they think they are boring, but they need a small push to get their life back on the right track. (Martin) is a really good teacher. It was not alcohol that made him innovate his teaching method, but he did not seek to renew his teaching method until he drank alcohol. Martin did not need alcohol to spend a happy time with his family on the trip, or to return to his wife when he confessed to her that he still loved her. We must believe in ourselves. We already have a passion"}, {"id": 46, "text": "What a great story!! Entertaining, life changing and fresh."}, {"id": 47, "text": "Drôle mais noir tout de même, on retrouve bien l'esprit scandinave. On passe un moment agréable et l'acteur principal est génial."}, {"id": 48, "text": "Ret godt skrevet og 10/10 fra Mads mikkelsen. Historien vil jeg sige er god ikke for tyk og nem at forstå"}, {"id": 49, "text": "I have to say I expected a bit more. I think the idea is there but the story could use some more.. spice.."}, {"id": 50, "text": "The movie made me happy on a cloudy day. And little bit sad too. But I love it. Being passionate about your job is something beautiful And exhausting at the same time. We need to always remind ourselves of the good things we have inside of us or the things we feel toward others. And oh god, to be a Muslim girl with zero alcohol consumption and empty house of a single drop of alcohol (except for the surgical alcohol for disinfecting, Corona pandemic DUH), Made me crave a sip of Vodka so bad. I recommend it for a light hearted watch."}, {"id": 51, "text": "TIFF 2020 09Another RoundFour close friends who are all high school teachers decide to maintain a specific blood rate of alcohol in their bodies in order to become happier, function better at work and social life, and get along better with their lives. What happens in this process of controlled alcoholism testing and its results consist the main storyline of Another Round, a collaboration of Mads Mikkelsen and Thomas Vinterberg.Each one of these four are explored individually for us to become acquainted with them and get to know their lives, their responsibilities and their problem whether at work or at home. But the film really shines in the scenes that all four are together, drinking, talking about their drinking thesis, laughing and sometimes, crying. This film is about alcohol consumption as much as midlife crisis, isolation, everyday repetition, loneliness, hopelessness and anhedonia. It's a film that resonates with all of us, it's about everyone in this world who struggles with serious problems in one's life and sees the solution in drinking regularly."}, {"id": 52, "text": "Four friends, all high school teachers, test a theory that they will improve their lives by maintaining a constant level of alcohol in their blood. (Source: IMDb)I'm glad that I had the chance to enjoy watching Another Round at home and that's thanks to the Toronto International Film Festival.After his unforgettable performance in The Hunt, Mads Mikkelsen gives us another great performance as he plays Martin in Another Round, if I would choose which one is his best performance, I would choose The Hunt for sure and that's because of the emotional and deep feelings that character had and Mads Mikkelsen was able to express that perfectly, In Another Round his character is kind of similar to the one in The Hunt but the difference is that in The Hunt his character was battling a difficult time of his life as he gave up on it and doesn't have anything left to lose, he was desperate, but in Another Round it's kind of the opposite, he is trying to improve his life by maintaining a constant level of alcohol in his blood hoping it'll work, and Mads Mikkelsen was brilliant in that, sometimes by just looking into his eyes, you can feel what's inside of him, grief / happiness / loneliness / sadness and etc... The supporting cast was was brilliant, his other 3 friends were all great in their performances, when they wanted us to laugh we did laugh and when they wanted us to get emotional we did indeed get emotional, perfect casting.For those who don't know both The Hunt and Another Round are directed by Thomas Vinterberg and that's why you might notice that the movie is a bit smilier to Th Hunt with the set design, the characters, and the message of the film, for example, the scene where the 4 friends went to the supermarket when they were drunk kind of reminded me of the one in The Hunt when he went inside the supermarket and got kicked out, but in my opinion, I prefer Another Round than The Hunt, I gave The Hunt a 6.5/10 and I was disappointed by it especially that it has so many good reviews and that's why I was worried of watching Another Round because I felt like it would be the same but I was wrong. Another Round had so many conversations that were long but they were so fun not like The Hunt, all the conversations were boring and cold, for example in Another Round'' the scene that all of them were having dinner and that's when we started to know the story of the movie and where the movie is taking us, the movie started off with happiness and with so much energy but as we were going towards the movie it started to go down little by little and slowly and that's what I loved about it. The movie makes you wonder what will happen at the end and what their lives will be in the end and that's a thing that made me want to watch and enjoy the movie, the film made us happy and sad and happy and sad again all the time.The set design was beautiful, the camera angles were able to capture the beauty of the set design and that's not a new thing to a Thomas Vinterberg film and maybe that might be the main reason why this movie remained me of The Hunt. Martin's apartment, the school, and the dinner table with the amazing designs of the cups and glasses. The custom designs were pretty okay, they were matching the environment very well.Finally, the music was brilliant and a great choice, especially that song at the very end when Martin was dancing around, such a great scene and a nice ending to a nice movie.So glad that I was able to be one of the first people to watch &amp; review Another Round, great movie, and highly recommend it.My rating is: 8/10"}, {"id": 53, "text": "An intoxicating celebration of life and a sobering examination of midlife crisis that illuminates the inebriating delights &amp; euphoric pleasures of alcohol influence with heart &amp; humour without ever shying from the havoc it can cause when consumed in excess, Another Round (Druk) blends the elements of comedy, drama &amp; tragedy into a vibrant, effervescent &amp; invigorating mix, and is brilliantly spearheaded by a stellar showcase from the ever-reliable Mads Mikkelsen.Co-written &amp; directed by Thomas Vinterberg, the film reunites him with Mikkelsen after their memorable stint with The Hunt and the result is another instant classic. Vinterberg takes a naturalistic &amp; humanistic approach to bring his story to life and offers a fascinating take on the role of alcohol in Danish culture (or any culture for that matter). The plot concerns four friends who test out an alcohol experiment to enliven their banal professional &amp; personal lives, and it is compelling throughout.But none of it would be as gripping if the bonding between the characters wasn't convincing enough and their individual arcs weren't fleshed out. Everyone plays a valuable role in the story yet the one who makes the experience truly worthwhile &amp; rewarding is Mads Mikkelsen whose performance here ranks amongst his finest. We strongly relate to his character, are fully invested in his journey, and the magic he conjures in the last segment is destined to leave an indelible impression on the viewers, leaving them all high &amp; in a state of pure bliss.Overall, Another Round is beautifully anchored by Vinterberg's sensible direction &amp; Mikkelsen's masterful rendition, and is one of the most engrossing, arresting &amp; life-affirming films of the year. Equal parts funny, touching &amp; heartbreaking, this Danish dramedy has enough vigour &amp; potency to leave most viewers enraptured with its infectious spell &amp; fleeting vibe, and the dazzling quality of the last scene not only serves as a fitting end to a joyful ride but also affirms the film's position as one of the strongest entries of 2020. Truly worth your time &amp; money, Another Round comes highly recommended."}, {"id": 54, "text": "Another Round is a protest film. The film protests against prohibitionism. Denmark has a culture of drinking. Traditionally Danes drink when they are celebrating, and they drink to break the ice. Having a beer with a working lunch would not have raised an eyebrow as little a decade or two ago. It isn't uncommon for highschoolers to drink heavily on weekends. A Swedish character in the film says, 'everyone in this country drinks too much.'But Danish drinking is on the decline. Today Danes buy half as much alcohol per person as they did twenty years ago (based on my own calculations from Denmark Statistics). In the last six years I have been at Copenhagen Business School, the university has banned drinking on campus except with special permission, and more or less eliminated Intro Week, a heavy drinking series of ice breaking events which is tradition at Danish universities.The film is about four high school teachers who only go through the motions work, and are unsatisfied with their home lives. When the main character Martin (Mads Mikkelsen) asks his wife if he has become boring, her evasive answer tells him all he needs to know. Early in the film one of the teachers quotes Norwegian psychiatrist Finn Skaaderud, that people are born with a bit too little alcohol in their blood. Martin sneaks some vodka into the school the next day, and his teaching goes much better than usual. The friends meet again, and decide to use themselves as test subjects for Skaaderud's theory.It isn't only the characters who are intrigued with the hypothesis that alcohol can improve our lives. Thomas Vinterberg, the director and co-screen writer, is completely on board. The film is a paean to how drinking can make us more fun and more interesting. It makes the teachers more creative and braver. It reduces students' anxiety. It reignites the characters' dying romantic relationships, and strengthens their bonds with friends.There is, of course, another side of alcohol, as the characters find out when they up their doses. Alcohol is associated with crimes of many sorts, from petty crime like vandalism to violent crimes like assault. Drunk driving makes roads less safe. We all know people whose lives have been destroyed by too much drinking. The economist and cultural critic Tyler Cowen has written that it is appalling that we drink such a dangerous substance in front of our children.Another Round does not ignore the negative consequences of alcoholism. Later in the film, alcohol causes some serious consequences for one of the characters. But for the most part alcohol does not create problems for the characters as much as solve them. Heavy drinking is like a coming of age ceremony. Not everyone who goes through it comes out unharmed, but those that do are changed for the better. The thesis of the film, in a word, is that alcohol is good for people, most of the time.The film is worth a view, if for nothing other than the provocative point it makes. It does not hurt that Mads Mikkelsen's performance is spectacular, as we have come to expect. So, do as the rest of the audience in the Danish movie screening I saw did, and watch the film with a beer in hand. Will drinking benefit your experience? Probably."}, {"id": 55, "text": "An extraordinary depiction of what alchohol can and cannot do. How it can help you and how it can fail you. This movie is not a celebration of alcohol nor a Don't you are drink that-speach. It just pictures different aspects of alcohol with which the viewer can do as he/she wants.Outstanding performances by the actors, especially Mads Mikkelsen.The handheld camera, classic Thomas Vinterberg, gives a lot to the dynamic of this picture, great cinematography.The sound department also did a great job, especially in the final scene, amazing.Finally a big, fat thumbs up to the castingpeople and the costume designers who managed to picture Danish high school teachers and students as the actually look and behave in real life. Very realistic in that way."}, {"id": 56, "text": "The game of life is more art then science. Which is an idea the film links wonderfully to alcholism. One day you're on top of the world. Teaching better then ever and finally reconnecting with family. Then you wind up bloodied on your neighbors doorstep with little idea how you got there or why you're there. Much like Vinterbergs 2012 feature The Hunt, Another Round stars Mads Mikkelsen. Unlike that movie, he isn't at the heart of a town wide witch hunt for crimes he didn't commit. Instead, Mads is an average history teacher living an average life.That is, until his life turns on a dime. He is a depressed, vaccant shell of a man. Unable to connect with his family and even further distant from his students, Mads seems to be drifting lazily through life. After a short 10 minutes, he and his friends decide it's time to change their boring lives. They begin trying to maintain a consistent, albeit low, blood alcohol level in an attempt to spice things up. Suddenly life is better. Mads is outgoing, energetic, and has no trouble with people.You can probably imagine, this falls apart rather quickly. As is such with alcohol, the more you rely on it, the more you need it to function. A hobby turns to a habit, then a habit into an addiction which spirals out of control. Such is life. The moment you let your guard down it punches you in the gut just to see of you're paying attention. Another Round perfectly captures this idea.However, I'm not to high on this. I think it does a good job saying what it desires and is genuinely quite entertaining. It bounces off the walls with energy while oozing a carefree attitude that was infectious. The problem is, it's pretty on the nose. There's large exposition sections that relay information to the audience in less then subtle ways. These characters are monitoring themselves through an essay on the effects they feel over time. Which gives the film room to explain itself. The problem with this is that it goes nowhere. As do many little things here and there.It seems each character is given a distict role to play in the film and it rarely pivots from those ideas. Making this incredibly predictable from the ground up. If you have a thought of where this is going based on the premise, you're probably right. Which is unfortunate because the payoff of the film feels largely unrewarding. A stark difference between The Hunt's absolutely traumatizing 3rd act.I'd still say check this out though. If you have twelve bucks and two hours to sit down at home, pull the trigger on this. It's quite entertaining, delivers a solid message, and props up some pretty great performances. Unfortunately, If you're looking for something to knock you flat with a powerful message or a satisfactory conclusion this doesn't have it. It builds to the exact place you might think and hits the nail on the head even though the nail is already embedded into it's place."}, {"id": 57, "text": "Another Round is a film that's equal parts fizzy (pun intended), poignant, and hard-hitting. Mads Mikkelsen comes up with yet another tremendous performance, ably supported by Thomas Bo Larsen, Lars Ranthe, and Magnus Millang (who play high-school teachers and friends). Their teaching careers and personal lives are going through a lull and when one of them suggests that maintaining a certain % of alcohol in their systems could help revive both, the others quickly buy into the idea.That the story takes place in Denmark, a country with a unique drinking culture, only helps. Alluding to a wacky theory from Norwegian psychiatrist Finn Skarderud that the blood-alcohol content in humans is always too low, the quartet begins ingesting alcohol into their systems before their classes. This yields short-term positive changes in themselves and their students. However, the inevitable tragedies associated with drinking soon follow suit. Director Thomas Vinterburg (who co-writes with Tobias Lindholm), however, doesn't push viewers into total darkness. Another Round shows us how drinking could likely wreck lives, careers, and more but done in a controlled fashion, that mild high could do these folks some good.Yet, it isn't a film that goes all the way in what it tries to profess. When the drinking gets cathartic and it starts to affect each of the four guys differently, Thomas Vinterburg rushes to the 'safe storytelling' zone. Even if that's the case, Another Round has one of the most enjoyable climaxes in recent memory, with a drunk Mikkelsen pulling some crazy moves. Mikkelsen's performance is, in fact, what holds the film together especially during its drab middle portions. As a performer, he doesn't hit one false note, adding much-needed emotional heft to the plot. Also, I wouldn't see that scene, where Peter tells a nervous student to down a few shots before his viva voce, anywhere else. Cinematographer Sturla Brandth Grøvlen also adds some nice alcohol-induced touches."}, {"id": 58, "text": "As a tribute to the premise of this film. I am reviewing this movie drunk. I have drunk one cup of gin and 3 cups of whiskey, hopefully thats around the 0.5% blood alcohol level that's significant to the point of this film. This film, like many of other Vinterberg's films, is drenched with realism and emotions as he effectively presents a family drama with the comedic premise of a group of goons drinking to the point of 0.5% BAC (blood alcohol content) to see if it betters their social and professional performance. This film has the most visually appealing cinematography in Vinterberg's filmography (considering that I have only seen the Celebration and the Hunt HAHAHHAH). Everything you love about Vinterberg is present here, the realistic acting, the constant handheld yet effective shot composition present, the awkwardness and the unsettling mood that permeates the concepts that Vinterberg explores. In my interpretation, this film is exploring whether it is good/right to have a form of escapism for one's reality in order to improve one's life as a whole. The commentary on alcoholism is just superficial. This movie is examining inherently flawed characters that have made long-lived mistakes in their lives that have made them miserable, and they are striving for a solution to change it, and questionably rationalize it with the scientific foundation of Skaaderud's theory when it can be easily seen as an excuse to drink alcohol to evade life's challenges and relish an out-of-world sensation only possible with the elusive effects of booze.While at times the presentation of its message and thematic concern may seem obvious or pandering, it effectively showcases rich characterization from the likes of Mads Mikkelsen and others like Thomas Bo Larsen &amp; Magnus Milang. It also alludes to and showcases everyday conflicts that resonates with pretty much everyone: the sense of inadequateness and the loss of interaction in long term relationships. It may not be as subtle as his other masterpieces, but to me it is a delectable addition to his repertoire. I strongly recommend this to the fans of his work. And if you are not one, you should watch this and then watch the Hunt, so that you would realize what a BEAST this Danish filmmaker is in his own right.In my drunken stupor, I shall now end my review. Hopefully this review is enough to intrigue you. If not, I shall make another review while sober to attract more attention MUAHAHAHA."}, {"id": 59, "text": "Danes do have liberal alcoholic drinking norms, and as a norwegian counterpart we still have the devil hanging over us as the bible say, that alcohol is the work of the devil. its an interesting fact to see an idea issued by a norwegian psychologist is the basis of making this film, that humans were born with 0,5 PPM too little alcohol in the blood. 4 rather sober teachers that is fed up by their lives , call it a midlife crisis, do take the task to try to prove this thesis. how that goes i wont say, just that it is a very rekcognizable flick on social study and a prime example of the survival of the fittes.its a film that challenges every human emotions, and the funny parts is so hilarious i nearly lost my breath of lollin. mads mikkelsen is the crystal clear choice to act the role as a cool drunk due to his general appearance, but its a pure fact that the entire main cast delivers on top level.production could have been more sober on the fictional timeline, how long did this last, a year, 3 years, cause you do not become an alcoholic in a day, though genetics may have something to say. the rest though are simply excellent, good direction, editing,filmography and choice of music perfect.i am not capabel to elaborate more in english, just say its a cool and not so sober entertainment that shoots 9 stars from the grumpy old man. if you dont understand the language in the film dont worry,, me neither, because copenhagensk dialet is completetely kauderwelsh to anybody outside sealand, so read the cc's or just study the development of the film its universal and esperanto like made."}, {"id": 60, "text": "By binge drinking beers or whatever. This is a typical beer/liquor advertisement/propaganda, similar to other means or methods to escape the reality, the difficulties of life, the middle age crisis, the stress, the frustration, the helplessness of life, marriage, relationship, career, love, hate, morality, lust....whatever that not in your favor, you just find anything that could give you temporary liberation, relaxation or escape from it. This typical a coward choice, albeit selfish excuse.You'd see these teachers in the classrooms, the way they teach only shows they are not good teachers at all. They can't deliver what the students wish to get from them. The main history teacher character is especially pathetic. He looks like somebody just got a bad news from the hospital that he got terminal cancer, or somebody in his family just died. He can't control his own focus, no energy, obviously depressed, no energy all, like a day dreamer. His family life is no different from most other families in his country or in other countries.These teachers are like immature kids trying to get their youth back, to re-energized by alcohol. They find some hearsay that encourages them to drink alcohol to numb their nerves but they convince themselves that drinks give them new life, energize their whole beings. And this movie simply made binge drinking is the better way than taking drugs to achieve something they couldn't achieve or reach. Is it an proved method or just an escapist excuse. And,Why do I have to know or to see how these middle aged deadbeat teachers try to ruin their lives step by step, day in and day out? I am already so depressed, do I need more of this crap? No."}], "reviews_amount": 61}