{"name": "The Midnight Sky", "titleId": "tt10539608", "reviews": [{"id": 0, "text": "I mean, it looks great, filmed great, the actors are good but the story... dear god.. what was the point... it literally goes absolutely nowhere."}, {"id": 1, "text": "This definitely could've worked as a series. Netflix could've done their usual. Great/popular first season then cancel it immediately and create 10 low budget foreign movies and tv shows in its place.What the hell is happening in this movie? Basically the crew of an expedition to a fictional moon of Jupiter called K-23 is returning to earth and George Clooney, in the Arctic circle, is trying to warn them about the uninhabitable conditions on the surface due to some unknown apocalypse.Let me save you the immense frustration you'll inevitably feel after watching this...What happened to earth? Apocalypse...Never explained. What happened to the crew of the ship? Turned around and went back to k23...no other information. Are there survivors on earth underground? Never explained. Little girl? Doesn't exist..obvious in first 10 mins. What happened to the pilot who returned to earth to find his family? Never explained Does the crew have the resources to create a colony on k23? Never explained Why does the crew seem to have such a nonchalant attitude towards the destruction of their home and families? Never explained Why did I watch this movie? No sufficient explanation."}, {"id": 2, "text": "More focus on the arctic journey and Augustine's past &amp; relationship with Iris would have been been way more interesting than spending half the film (and I guess most of the budget) flying a spaceship through asteroid belts and hitting every possible scientific inaccuracy along the way."}, {"id": 3, "text": "It's hard to know what this movie is about or what it tried to accomplish. Most of the time you just don't have any idea of what is going on or where the story is going.After so many great movies like Interestellar, The Martian and others, it's incredible to understand why movie studios won't hire a physicist to advise them on the science portion of the movie. Very disappointing."}, {"id": 4, "text": "A struggle to sit through this tedious behemoth of a movie. Nothing really happens and you feel ripped off at the end. Visually engaging space shots. That's it."}, {"id": 5, "text": "OMG. That was so bad. Did Clooney vaguely recall stuff from Gravity and then hash it together to try make a new movie from it? The Fx were pretty good and I can see lots of money was spent but the result is unwatchable to anyone with more than primary school level of scientific knowledge (which I guess rules out the majority of the US and hence why the film make be palatable there). I mean things like a 'hidden' moon of Jupiter with a biosphere? Seriously? A radiation apocalypse that follows zero logic (even in full blown WW3 scenario radiation would not spread like shown here). Or how about smaller stuff like getting soaked in water then not freezing solid in a blizzard after. Who ever wrote this unscientific implausible sloppy lazy boring storyline should be ashamed of themselves."}, {"id": 6, "text": "So, this movie isn't perfect. Some things I liked and others bothered me. Like how the movie abruptly begins with absolutely no preamble. Normally I don't require hand-holding when movies start like this, but I seriously had to check 5 minutes in to make sure Netflix didn't start me halfway through the movie. Very annoying. Also, the fact that humans can detect planets in solar systems thousands of light years away, but we've never noticed a habitable moon around Jupiter?? Kinda dumb. I know, it's just a movie.. Also, why does the ship have rolling office chairs and IKEA shelving? Your hurtling through space a god knows how many kilometers a seconds and you can't secure things properly? The second the anti-gravity ring stops someone's getting that space helmet blown through the back of their head. And why TF did those dudes leave the ship? You family's gone, bud! By leaving your crew mates behind your decreasing their chances of survival. Just selfish. GC was good to watch, as always, and the cinematography was a treat for the eyes. This is a good movie for when your too tired to sleep and want something to enjoy a half-asleep half-awake state on the couch. Oh, and there's absolutely no rabid space monkeys in this movie, which is another good thing."}, {"id": 7, "text": "Those that say this movie didn't have a point, completely missed the point. Life, choices, relationships, and death are human experiences, and somewhere along the way we learn, know beauty, love, and catastrophe, make difficult choices, and question our purpose. Enjoy it for what it is."}, {"id": 8, "text": "The movie has nice shots, but its slow pacing, nothing really happens. If you are pregnant and have to throw up many times a day does it make sense to go out for a space walk ?Big let down, 5 stars for the effort and shots."}, {"id": 9, "text": "So if you're looking for sci-fi, it's not really a sci-fi. It's a drama. A good one. I see some comments saying 'what's the point' of this story. I assure you there is a point, if you just think about it for a bit. First of all, and obviously, it's about raising awareness about ecology and future of humanity. Secondly, it's about seizing the moment, some people are right now giving away their whole lives to fight for something that other people don't even value - physicists, biologists, ecologists, etc. - people who are gaining the knowledge on how we can survive and thrive not only as individuals, but as humanity as a whole. These people who do not devote their whole life for consumption, rather devote themselves to creating and making new things, discovering new things. These are the people we should listen to and follow. While most of people rather care about hatered, looking for someone to blame for some silly material stuff that doesn't really matter. I see this movie is not really a sci-fi I was hoping to see, still it was a good watch and it provokes thoughs people need to have the sooner the better."}, {"id": 10, "text": "Words are lost for me at the moment. Midway through the movie I learned that a very close friend lost his father. The sense of loss and what might or should have been rings in my head. George Clooney encapsulated that feeling so brilliantly in this movie. I highly recommend it, but prepare yourself for that feeling of loss. It takes a special person to express it with such emotion."}, {"id": 11, "text": "Personally i read the reviews by others AFTER watching the film, and it seems like all people wanted to do was compare it to X space movie or X catastrophe movie.Sadly those people, 98% of them apparently missed the pointIts seems strange to say this, given the small amount of dialogue by him (and its not a wordy film by any means), but i probably enjoyed Clooney in this more than most of his films. He perfectly inhabits the character and his characters situation, and his pared back performance (from what you expect from yuor preconceptions of M Clooney), really is at the core of what makes the films atmosphere pervade your own senses for the entire film.I really enjoyed it...just to go against the prevailing tide, who honestly probably would have picked at anything Mr Clooney didCould there have been improvements?,maybe... but well, it's easy for armchair warriors who didnt even get it as far as it got to be critics...."}, {"id": 12, "text": "Other people have mentioned it but all of these 1 star reviews are silly. There was definitely a point and it's certainly a thoughtful movie. For those who like films that you go back and watch to pick up on things you missed the first time, I would highly recommend."}, {"id": 13, "text": "It is a movie about life and relationships set in a post-apocalyptic sci-fi world. It talks about - don't waste your life; take care of the planet; love those who love you ; there's no place like home! The big question in the film is whether saving one life is worth sacrificing all. It's slow paced but it has to be to allow the viewer time to question their personal values"}, {"id": 14, "text": "First, let's start with the good things. I liked the cinematography. Some really pretty scenes. Good music, good acting, good job on the CGI.But the story?I haven't read the book, but I still found the plot way too predictable. When Augustine met Iris, I knew that she's not real. Augustine is all alone, and he needed company, in order not to lose his mind, people imagine things.The story progressed very slowly. I felt like most scenes were just fillers. 2 hours was way too long for one surprise at the end. Didn't help that Caoilinn Springall (Iris) looked so much like Felicity Jones (Sully), which already spoiled the ending for me.The usual Earth is dying plot, Maya (who never spacewalked) will die at her first walk obviously (although I expected her to fly off into the void, but a second wave of asteroids were also not too original...) Nothing really surprised me.The following movies shouldn't be compared to this one, but: 'The Martian' showed the struggle of a left alone man in a more enjoyable way, and 'Interstellar' had a much more interesting space-time story, which was not at all predictable.If you have time, watch it, but don't expect too much storywise."}, {"id": 15, "text": "Is this a slow movie? For a pop culture society immersed on watching frantic and vertiginous super hero movies, The Midnight Sky might seem slow. If you expect having fast food on a rollercoaster you will find a degustation table instead, with probably too many different flavors, most of them you will find familiar, nothing avant garde, that is true, but absolutely this is not a bad movie. Clooney is great, the spin of the story is great, special effects are great. The art and electronic devices could have had a more futuristic look, but who knows what the future will look like anyway. The only reason I'm not giving this movie a 10 is because it lacks a great soundtrack."}, {"id": 16, "text": "Has been ages since I watched a Clooney. Being a sci-fi fan, this movie ticked most my boxes. The plot, casting,everything was done right. Not as deep into the genre as I would have expected but still a wonderful film. As thought provoking as it is profound with its underlying environmental themes."}, {"id": 17, "text": "A bit slow but not that bad. Why does space exploration and apocalyptic movies have to be fast paced and action packed?Good movie."}, {"id": 18, "text": "I yearn for excellent sci-fi and am so often disappointed. Only the best creators realize the same filmmaking conventions apply with all great cinema. Here the music frequently slipped into schmaltz, as if they assumed everyone watching was on the spectrum and needed heavy emotional cues. Note to file: People on the spectrum experience intense emotions. It's expressing them that's difficult. Nice ending. Good visuals. So I guess we're repopulating the human race Kentucky style. Sorry, but I was distracted by Clooney's hair, imagining him using that Flowbee. He does play a cool old man well. But I digress. This film reminded me of Red Planet, a severe case of genre retrophase. Nice touch award: The command deck's plastic covered office chair. Clearly an homage to Destination Moon."}, {"id": 19, "text": "This is a film about humanity, hope, love and missed opportunities. Sorry no lightsabers or battles in space, no Mandalorians sorry. Good casting very good CGI and except for a few times it moves along. A film also about how we humans are destroying our planet with wars that make no sense except to fat cat politicians who make money with wars."}, {"id": 20, "text": "Just a mess of disparite scenes stitched together with little or no narrative. The movie doesn't know what it is trying to be and therefore ends up being nothing new or interesting.I saw this in a cinema as I was hoping it would be a more immersive experience than waiting for it on Netflix. I have fallen alseep three times in a cinema. This was one of those films.George Clooney is a good actor and director. Good Night, and Good Luck is one of my favourite films. This was just a disaster."}, {"id": 21, "text": "George Clooney's talent is just being George Clooney. He should continue making commercials and selling his name to hawk products to gullible consumers because his movies are sleep inducing and this one is no exception. Boring... snore..."}, {"id": 22, "text": "It is a science fiction movie, in which it is supposed to be the epitome of drama, but it falls short. That you are going to die is tragic, that your whole family is going to die is very tragic, but, that all life on the planet is also going to be extinguished? The characters do not demonstrate that magnitude of the drama, indeed, the characters of the spacecraft are the worst performers in this regard, too calm upon hearing the news of the extinction of life on earth, indeed, the two astronauts who returned to the planet to found a colony, without hope for the future, did not demonstrate in any moment they would leave a daughter or sons alone in a colony in space when they pass away."}, {"id": 23, "text": "As futile a tale as any you'll encounter, produced by those who clearly failed to consult Space Exploration for Dummies, sees an hallucinating arctic hobo communicating with a returning spacecraft juggernaut that can be piloted on a casual basis by whoever takes the fancy since it's composed of an impenetrable exterior surrounding zero gravitass - just like the plot of the film."}, {"id": 24, "text": "Goes on the same path as Ad Astra, Gravity : Main actor focus, bad story line. For me it was suffocating to watch. The story is just dumb.To put it in short, the whole movie can be summarised like this : One sick guy from North Pole, battling his demons, sends a message to the crew of a space ship not to come home, because the earth is dead (nuclear or some other reason).Plot holes: Why would someone want to contact a ship to tell them that the earth is destroyed...as they can clearly see this from a few million km? + no one is answering on Earth. Why would a professional astronaut (woman) get pregnant on a 2 year mission? It fails to transmit the importance of their mission.Clearly the movie gets bonus points for acting, effects, but if the story line is bad, is a no go for me...."}, {"id": 25, "text": "It's slow yes, but overall well acted and the last half is worth watching. They could create a great series about all the side stories. This almost feels like a pilot. I want more of the pre-story and the after-story! Overall enjoyable film for me. 6/10."}, {"id": 26, "text": "If this was short movie on some YouTube channel like DUST it would've been 10/10."}, {"id": 27, "text": "I've seen The Midnight Sky in pre release in Theater.The movie is a combination of Clooney's appearance in Gravity (2013), as is resembles the remote isolation in (any) space. And the movie has some similarities with Interstellar (2014), as it plays with moments in time of a sort of endangered world.However, in terms of quality The Midnight Sky is not even close to the movies mentioned above.Watch this movie on Netflix at 11pm or later if you dont have anything to do. Or go to the theater when you love watching movies alone on the big screen!"}, {"id": 28, "text": "It was good. Some flaws but if you want a syfy with a good mix of melodrama, space walking, and some action. This will do."}, {"id": 29, "text": "In terms of concept, Midnight Sky this is highly formulaic. But after all formulas exist for a reason, so that is not always terrible But there really is not moment of genuine suspense, pathos, originality or drama in this mediocre outing. It feels like someone shuffled the scripts of dozen space venture and low key apocalypse films like a pack of cards and filmed the result. Its covid environment, so almost no film can fail in getting home viewers -- even the most mediocre and frankly low brow films like this."}, {"id": 30, "text": "This is the cherry on the top of 2020. George Clooney wanted to do something big and achieved nothing. While you are watching this film you are constantly asking yourself: what is going on here? It is not a Sci-Fi, not a thriller, not a crime movie. Waste of time, and money."}, {"id": 31, "text": "Maybe not an outstanding movie, but definitely a good movie, every science fiction fan will be pleased"}, {"id": 32, "text": "Watching the majority rate the movie this low, made me want to create an IMDB account just to give it a little credit. I enjoyed it more than I would enjoy a movie below 6/10."}, {"id": 33, "text": "I thought the movie was gonna be real bad bc of the trailer, i just saw it to see it, and it really surprised ed me. Yes i must admit it has like no point? But its still really good, with an unexpected plot twist"}, {"id": 34, "text": "I really enjoyed this excellent film which is beautifully filmed, the acting is top class. This is not an action packed movie but it is a meaningful, relevant and emotional drama. It truly makes you think about the future of our beautiful planet, I hope that we are not too late to fix the damage that we have already done."}, {"id": 35, "text": "Seems this is missing it's audience. A perfectly good, heartfelt film, closer to Arrival (though not reaching those heights) than Star Wars or the Mandalorian. If you want shootouts, rapid edits or a Hans Zimmer score shouting at you go elsewhere. This is meditative, poignant and sad in tone. No one punches the air or receives grateful applause at any point. While we may want more escapism this year, we also know first hand that not everything works out and we need to do the best we can and be kind to each other, and I found that a meaningful message at the moment."}, {"id": 36, "text": "It's very clearly trying to copy Ad Astra, Gravity, Interstellar, and The Martian (among others), but it's one of Clooney's more touching films. It's messy and predictable, but worth the two-hour watch from your couch."}, {"id": 37, "text": "This is a wonderful, thoughtful film. People here saying they don't know what it was about?? Geez, there's a few dots to connect but it hardly requires Einstein territory. Terrific cast and acting, and clearly no one minced with Clooney on the budget as it looks beautiful. Desplat does his, as usual, marvelous score. If you're looking for a 'bang 'em up' action flick this probably won't do. But if you don't mind sitting back for 2 hours of a mindful little netflix gem, this is terrific. And bravo Clooney, one of America's brightest talents."}, {"id": 38, "text": "Great cinematography, good acting by a great cast. It's a slow movie and I didn't quite get it but I stuck through it and it all came together at the end all he wanted to do was stay back and save his daughter from earth by telling her to turn back and live on the other planet that he spent all his life trying to find she never knew that he was her father and the little girl through the film was his imagination of his daughter when she was younger it was a great twist that made it all worth watching it was very emotional. I really loved this movie and great acting by Clooney once again."}, {"id": 39, "text": "What a woke piece of garbage. It is like they are trying to make a Hallmark Emo Movie with a Sci-Fi backdrop. So, the new Adam and Eve are going to be an inter-racial couple? Hokie-Dokie!"}, {"id": 40, "text": "Unbelievably boring, had to stop after 20 min and I am a George Clooney fan as director and actor."}, {"id": 41, "text": "I thought I was watching a great movie in The Midnight Sky until the mid-to-final act kicked in. Then it started to fall apart story-wise. To be clear, Clooney's performance was superb. The cinematography and editing were top notch too.But then about half-way through the story suddenly departs from Clooney's situation and moves out into space aboard the returning spaceship and doesn't even look back at Clooney for a very very long time. Was a bit jarring, almost as if a different movie had started up while you sneezed.But here's where it went especially haywire for me. Spoiler ahead.First, this movie knows *nothing* about basic science. The best sci-fi has actual sci in it. But not here. It opens with the year 2049 title card -- not only part of the name of another movie (Blade Runner), but ridiculous given it's only a little more than 25 years from now and lo-and-behold we've got space ships with people and colonies ready to settle a newly discovered moon of Jupiter that happens to be Earth-like. And mind blowing spaceships that any advanced civilization would crave. In 2049. Yeah right. Why do filmmakers do that? Treat 20 yrs into the future like we're all going to be in flying cars and on distant planets? Clearly they skipped science class in high school. And why doesn't *somebody* from the gaffer up to the numerous Executive Producers say something about that? Make them all look like fools.But then in the end, after we've seen poignantly how every crew member on the spaceship is essential to maintaining it, two of them announce they're going to get off during the slingshot around the destroyed Earth to find their dead families. Yeah, really? And take one of two space shuttles for the purpose? And leave the remaining two crew members (a third had already died) to run the ship and settle the Jupiter moon by themselves after a long return trip back? Right. And the two that stayed on the ship never once tried to argue for all to stay onboard because basically everyone's going to die if any of them leave the ship. Right. Pure nonsense. Why didn't *somebody* from the gaffer to one of the Executive Producers raise the red flag on such foolish writing?And then, stunningly, you're thrown back into flashbacks of a younger Clooney that you don't (at least I didn't) realize was a younger Clooney because they used a different actor (Spock!) that doesn't look anything like Clooney... oh my gawd, so poorly handled and only revealed in the closing credits that Spock (Ethan Peck) was playing a young Clooney character... until then I didn't even know it.And, really sadly, in the final scenes when it's obtusely and oddly revealed that the little girl Clooney's been with is really the lady on the spaceship, it's so poorly set up and explained that it becomes, in my opinion, a wasted effort altogether. What is that you say, again?! She's WHO? Uhhh... does not compute. Even if you were imagining her, it has no useful logic or ah hah moment or epiphany to it. They really blew it.So, my take is that there are two, maybe three actual movies here, rolled into one that starts well and ends in a mess. Bummer. Because I really liked where it was heading initially. And I truly enjoyed Clooney's performance despite the absurdity during the last half."}, {"id": 42, "text": "There's nothing wrong with the movie, it's pretty good. It is a confirmation for what I've suspected for a while - young millennials with the attention span of a fly are skewing the ratings of quality content."}, {"id": 43, "text": "Overall, a good story line with a few tiny surprises along the way. Personally, I thought the execution of the story was nearly flawless."}, {"id": 44, "text": "Got To See It Early In Theaters Director George Clooney Has Made A Very Detailed Sci-fi Film The Visual Effects Are Just Marvelous But It Does Lack In Some Story So I Can't Complain It Wasn't As Bad As I Thought"}, {"id": 45, "text": "Not really understanding the negative reviews. Seems people see sci-fi and want wall to wall action. This is a slow burn drama in the sci-fi genre, I guess you could say? For me, it's a lot better than Ad Astra and Gravity, both of which I didn't enjoy one bit. George Clooney was wonderful and carried the movie for me. Definitely has a poignant message for people about looking for the future and missing the importance of today. Definitely worth the watch. Really enjoyed it. Thanks George, great job!"}, {"id": 46, "text": "I guess Clooney needed the money because everything about this movie is terrible"}, {"id": 47, "text": "I always check IMBD for ratings prior to watching a movie or TV series, and don't watch anything under a rating of 6. Sure glad I disregarded that tradition with this excellent movie. It's cerebral, realistic sci fi, something very difficult, but very precious to find. Some of my favorite sci fi flicks: Gravity; The Martian; 2001; Contact; Silent Running; War of the Worlds; The Day the Earth Stood Still; Forbidden Planet; The Abyss; etc. If you liked those, you'll like The Midnight Sky."}, {"id": 48, "text": "If you are looking for an action packed Sci -Fi thriller you'll be disappointed. If you want to enjoy a good drama about a man's life and his regrets, you may find this compelling. I had to watch it twice to pick up on some of the finer details and wasn't disappointed having to do so as there's quite a bit of stuff tucked away in this movie that was subtle the first viewing. Overall, I really enjoyed it."}, {"id": 49, "text": "12/24/2020 It's watchable but don't expect any excitement or suspense, it's not there. The dialog is limited to non existent however sad-sack George with a retired David Letterman beard perfects his on screen coughing routine (hack hack). The uneventful storyline comes together in the last few minutes of the film so we get a sort-of Happy Hollywood Ending thanks to George Clooney. - THE END - Bon Appetit'"}, {"id": 50, "text": "Flawed for sure but I suggest trying to take this movie at face value and forgetting the other movies that have come before."}, {"id": 51, "text": "Clooney the director seems to almost be fighting back against potential viewer investment, which makes the final act's melodrama and twists feel all the more manipulative. The scenes set in space are expertly designed, and shot well by Martin Ruhe, but they feel entirely devoid of human emotion (until the final act manipulatively calls for it). There's something so sterile and antiseptic about the space half of this film that it can't maintain viewer interest or sympathy beyond a filmmaking exercise. It has no oxygen and no heartbeat. Most of the time, The Midnight Sky drifts like space debris between its three settings-shuttle, Arctic, flashbacks-instead of feeling like it's building momentum. It's like Clooney the director was so concerned about adequately conveying the details of each part of his story that he never broke down the meaning of them or the characters involved. The heart of this movie just isn't there. It's as weightless as space."}, {"id": 52, "text": "What's waste of time. This visually stunning film tries to lead the viewer to a reward that just never happens. The story is typical Hollywierd preachy about a mystery disaster that befalls Earth due to not taking care of it. A Lost in Space crew that impregnates one of the highly skilled and professional astronauts zooms back to a destroyed Earth. Terrible cut jumps in story line, Clooney mopes through the movie, and it's just 2 loooong hours you won't ever get back. Skip this pile of sparkly junk!"}, {"id": 53, "text": "Boring. Nothing happens. No connection to any of the cast. Spoiler - member of crew dies - why would we care? Who is she? What was she? Never given chance to even know her name. This is the worst film I think I've ever seen"}, {"id": 54, "text": "Another film with no point to it, Why was the Earth dying? we never know, how did Clooney at his age in the Film and in terrible health survive a soaking in freezing water in a howling gale with a wind chill factor of -20% or more that would have killed a fit 20 year old in minutes, he communicated instantly with the Space ship when it was a vast distance away when there would have been a time lag, the birds were dying but there were wolves, who was the man in the plane? and what was the point of that bit? the girl was a ghost, why? a rather silly film."}, {"id": 55, "text": "Loved it. Great acting, beautiful visually. Not boring at all. Most of these reviews are far too critical and must have no patience or attention span. Please watch."}, {"id": 56, "text": "Can't sleep? Put this movie on. It will knock you right out. What a let down. I was really looking forward to watching this movie. The trailer looked great. Too bad it turned out to be flat out boring. I kept waiting for something to happen. It never did. And what was up with that ending? The two lone astronauts pushing buttons as the credits roll.. strange.. I was also confused on why the two older male astronauts headed back to earth. Everyone was dead and the planet was unliveable. Call me crazy but maybe going with the other astronauts to restart the human race was a little more important. When it was all said and done I was pretty disappointed. Definitely not what I expected from a film directed by George Clooney. 5 stars C- grade."}, {"id": 57, "text": "I stuck it out, thought it might improve as to what kind of movie it was. As in some kind of plot, purpose and maybe intelligent dialogue. It seemed like a mishmash of so many far, far better ones with a soap opera feel to it all.The little girl in the 1950s dress in the antarctic was a foreboding.of worse things to come. A bunch of total incompetents on a mission, fixing their radar floating about singing Sweet Caroline, at that point (2048?) a song 80 years old.A guy dying of cancer swimming heartily through icy waters like a spry 16 year old.I lost track of my eyerolls, it was like watching a trainwreck. What a waste of a good cast. Nothing happens. Because nothing does. No explanation for the radioactivity on earth. And birds dying everywhere but the healthy wolves keep looking for prey?Bilge.0/10"}, {"id": 58, "text": "The movie is marketed as Sci-Fi but is featuring uncoutable scientific inconsistencies. If you want some nice shot, it might be watchable. If you expect a plot which makes sense, avoid at all costs. Heavy (!) spoilers ahead.Just a list of inconsistencies: * Sometime around 2030(?) humans discovers an previously undiscovered (!) moon of Jupiter of a size able to hold its own atmosphere. Apparently no astronomer was involved in writing the plot. * There is an (completely unexplained) apocalypse going on on earth, which must kill people off so unexpected, that noone was able to set up a messsge to transmit until acknowledged via the Deep Space Network. This leads to the next point * Communication with space craft in 2049 is apparently via analog radio (one can hear interferences). Digital, especially text communication, which can be automated, must have been lost till then. * The space craft has extremely spacious interiors, even more than Startrek. Apparently in 2049 all problems with accelerating unecessary mass from Earth to Jupiter and back have been solved. * When about 10 days away from earth and supposedly on a trajectory to end up in an earth orbit, the space craft is still oriented with nose towards earth, engine away from earth. It appears to stay like that (as all meteors (see below) come from the front. Apparently in 2049 one no longer needs the main engine for braking. * Due to some (again unexplained) accident the space craft has to leave its current course and go into unmapped territory. Note that that is about 5 days before they reach earth. There is nothing unmapped such near to earth. * In this unmapped area there is not only one but two space opera quality meteor fields hanging around. The first one of it hits the space craft with complete surprise despite the craft featuring a radar (which the crew then sets out to repair). * Despite the crew being on a two year mission to and back from Jupiter one crew member has never trained space walking in all that time. Due they no longer do training exercises on missions? * This crew member vomits when in zero gravity while putting on the space suit. This is despite the fact that every crew member has to cross the zero gravity section of their rotating star craft (BTW missing Coriolis forces) several times a day. * Despite the vomitting, which would be highly dangerous if happening with closed helmet, the crew member goes on the space walk.Those are the ones I remember. So this is basically a fantasy movie with a plot fitting for the age of sails someone transplanted into 2049 without any science advisor."}, {"id": 59, "text": "Clooney needs to stick with acting. This was a long, drawn out mixture of other movies. Interstellar, Gravity and The Sixth Sense. Plus I hate movies which don't explain the cause of the apocalypse."}, {"id": 60, "text": "Bringing this out on Christmas Eve was mean, I was looking forward to this film, but boy was I wrong. So slow and pointless.Great space cinematography, but one of the most useless sci-fi films ever.Ho ho ho"}, {"id": 61, "text": "The cinematography was great, acting of course also. I didn't like a different actor playing Clooney 30 years earlier. We all know he looked exactly the same, so very unreal. With CGI he could have pulled it off like many other movies. Maybe even without CGI. Story was a bit draggy, but pretty good compared to the rest of the big movies this year."}, {"id": 62, "text": "The movie was really really slow. Throughout the movie, I kept on waiting for something exciting to happen, but nothing exciting came out..!! The plot seemed predictable after some time..!! The movie could have been interesting if the story line actually involved why were they doing, what they were doing..!!"}, {"id": 63, "text": "Awful. Excruciating to watch. Gut wrenching and immediately forgettable. George Clooney directed with no direction. One of those films you hope to get better but it never does."}, {"id": 64, "text": "The Midnight Sky is a new film directed and acted by Clooney and i will say that he did a better acting job here then a directing one,mostly because this film has a feeling of mixing Gravity and some other films of same type and because of that it didnt felt like nothing new or original at all.In acting he was good and better then his previous roles in history,i still think that his best role was in Gravity and here he showed some signs of that performance.Rest of cast was good but their characters were unexplored and without personality .Midnight Sky is a fine film but it doesnt distant itself from other films similiar to this one"}, {"id": 65, "text": "Although extra 30 minutes could've helped to get rid of all coincidences and add more texture to drama."}, {"id": 66, "text": "George Clooney is in his element as Dr Augustine Lofthouse. This movie is very well written, well acted and the cinematography is magnificent. The movie gives a generous amount of time for character development. This world may not end in a bang but in a whimper. Let's hope the human spirit endures."}, {"id": 67, "text": "What feelings would you have at the end of the world? This movie goes to explore the futility, the self sacrifice and hope of the last humans alive. It depicts with great detail each struggle, making it have a very slow cadence that gives weight to what the moment asks from them. Make sure you go with the right mood for this one. It is not an action movie, and there is not much of plot or character development. But there is a lot of very well portrayed emotion that builds and which hit me like a truck in the last act of the film. The word Brooding comes to mind, because it really captured for me the feeling of being able to contemplate the last moments of the human species. Or maybe the firsts."}, {"id": 68, "text": "This is a beautiful film about unconditional love and unfathomable loss. The people who dislike it, I suspect, know nothing about the former and cannot comprehend the latter. Watch it."}, {"id": 69, "text": "This was seriously an amazing movie, I believe even people that don't like science fiction will love this movie. Best movie I have seen in a number of years. Very well acted especially George Clooney's character. Very strong supporting cast. This movie had me on the edge of my seat, laughing and crying. Was a very heart felt well written movie. I hope Netflix makes move movies from this author. In a nutshell I expect a standard end of the world rump and got much much more. The little girl that played Iris was excellent much of been hard to play so long without speaking a word."}, {"id": 70, "text": "This movie kept me 100% engaged the entire time and there were solid performances from everyone involved. It was beautifully filmed and looked fantastic. Life is sometimes brutal and unforgiving and this was a great examination of how we deal with it."}, {"id": 71, "text": "I saw the twist from the start - like most people. What could have been a unique 'end of the world' film was jus another rehash of the same old stuff.Disappointing."}, {"id": 72, "text": "It's a beautiful, boring and meanungless movie. Slept in the first15 minutes."}, {"id": 73, "text": "This is the FIRST review I'm ever writing. This film is beautiful. There's no other word to describe it. It's heart-warming, it's the type of film where I'm going to watch countless times till the very day I die. I would recommend this film to anyone."}, {"id": 74, "text": "Clooney and Iris crush it. Pull at your heartstrings. However the plot made no sense. The world is ending and they have time to evacuate people including the space station. However they don't seem to try and connect with or rendezvous with the one ship that has been to a possible habitable planet. Set that aside, the crew of Aether find out they are likely humanities last hope. They are only 4 of them so genetically it will be tough but possible. Until two of them decide to effectively commit suicide dooming humanity. Unless somehow one guy and a girl can restart humanity by themselves. Like who is their daughter going to have kids with?"}, {"id": 75, "text": "Old man regrets making work his first priority. Ultimately it saves his bloodline. Touching had me in tears."}, {"id": 76, "text": "Nice looking, good acting and a great ending. Pretty slow in-between"}, {"id": 77, "text": "A bit pointless and slow but watchable movie. I liked the graphics in space and space walks - it's incredibly good. The characters are a bit shallow and the plot is somewhat simplistic. There is a small twist in the end when you realise who that little girl actually is."}, {"id": 78, "text": "The acting is fine but the story is poor. There are gaps between the past and the present. Special effects are also not very successful."}, {"id": 79, "text": "I am a big George Clooney fan, I started this movie with so much of hopes, but after certain time, I just didn't wanted to dwell in it. Can't say it was beautifully done. Can't say it was horrible. It just passed by and somehow missed the whole point. It was like something very raw. The only scene I loved in the entire movie was when Augustine responds to a space program member saying I know. Felt sad for the part that he was so alone the entire time but it just got over. Didn't enjoy the movie. Bit disappointed."}, {"id": 80, "text": "Was this the best movie I ever saw? No. Was this is in the same league as similar themed movies, i.e Interstellar and the rest? No.But it wasn't bad. It's dystopic, rather depressing at times. Without spoiling anything, I liked the ending, was uplifting from all the depressing feels I got here and there throughout its entirety.Acting, actors and plot, nothing bad there. Nothing new plotwise, really. But yet pretty decent. If you got two hours to kill, I'd recommend watching it."}, {"id": 81, "text": "A sci-fi drama with touches of adventure. It is about a doctor who after the end of life on earth stays on a base to help astronauts, while fragments of his life are joined. Quality. Intense With a flashback that tells us the whole story. The interesting thing about the film is that it does not leave a single loose end, in terms of the development of the characters. At no point does it really show you the reason for the end of the earth or the reasons. Few moments of adventure and action. The space well recreated and the effects are good. George Clooney wonderful as always and makes a good address. Although the truth takes time to take off at the beginning, it is worth reaching the end. This movie would be ideal for the big screen. The end, although you already predict it, is consistent."}, {"id": 82, "text": "I found I experienced a full range of emotions through this film. From excitement to disbelief to annoyance to frustration to sadness. Good tension. You might find you'll watch it again to look for the hints and clues. Great job George in acting and directing - very engaging. Caoilinn turns in a top performance - those eyes cut right through you."}, {"id": 83, "text": "This movie is strangely 2020. It has all the realities of an imploding planet while managing to be banal.George Clooney's performance is strong but ultimately not enough. His sidekick is an interesting ode to silent film as she does not communicate through the entire movie.The team in space has a lot of interesting dynamic potential but the plot resorts to cliche. The visual effects are top notch. I wanted to see more of the planets and the stars.If you enjoy conversational dialogue and character development you may enjoy this, but there is better sci-fi to be had."}, {"id": 84, "text": "Shallow characters, poor scientific accuracy. Been there, done that kind of movie. Predictable."}, {"id": 85, "text": "Story driven film, not an action flick. Not for the average person. Then end is pretty unexpected."}, {"id": 86, "text": "The action is solid. The pictures are too. But the story is very weak. There are many similar movies. Most of them way better. It brings nothing new. Since this seems some kind of 'safe the world' movie it would have been better that this movie was not made since it would have saved a lot of earths resources."}, {"id": 87, "text": "This should have been a tv series to do it justice, it felt rushed and a lot of things I would have liked answers too, I hope one day this will be made into a series and done right"}, {"id": 88, "text": "Just like any movie some will like this some won't, I for one loved it, fantastic story, sad, exciting, dramatic, Clooneys performance is amazing. Fantastic cinematography, breathtaking CGI. Finally a decent movie with a sci-fi theme without stupid OTT action sequences &amp; stereotypical unbelievable characters. Hands down light years better than the borefest Interstellar &amp; Brad Pitts atrocious snorefest Ad Astra. Clooney may not do much in the way of movie work but what he does is always watchable &amp; enjoyable. Morons that favour the Michael Bay pap stear clear, NO jail bait in skimpy outfits to ogle over, you won't enjoy this &amp; you probably won't understand it either."}, {"id": 89, "text": "Visually masterpiece But weak story. Still I could watch it since I was bored."}, {"id": 90, "text": "Veeeery slow story, boring plot.. dialogue uninteresting ... the flashbacks are poorly made and performed when you think about whar you can do with cgi today, mr. clooney fiddleing around on a planet in bad weather sends me somehow back to King Kong (1936) and the primitive tools the had then,, even then they made a better movie .. but then again maybe the intention was to go B-movie and get kitsch :)for a sci-fi movie this one has waaay to little sci-fi"}, {"id": 91, "text": "Like watching paint dry! Apparently there are no good writers left in Hollywood nor good actors. Understandable why they are out of work."}, {"id": 92, "text": "Anyone who gives this film less than a 6 is just expecting too much from from storytelling let alone a film.It's well acted, well shot, well directed and has a nice storyline. It's subtle, simple, emotive and all round an enjoyable watch.It's not high in action but it doesn't claim to be or need to be. Just enjoy it for what it is."}, {"id": 93, "text": "Started watching without any expectations but curiosity why Clooney has made... Did not read the book...but I believe making this movie making sense must have been a huge task since 90% of the reviews I read are really pathetic but what do you expect...the result will show in the movie of that pathetic ness... Enjoy the movie...the story...the people in it and their sacrifices...and finally enjoy your time FULLY..."}, {"id": 94, "text": "Have you ever farted and it just felt so relieving? Well, I believe in this movie it made me feel great after awards!"}, {"id": 95, "text": "Even though ecology and safe of the earth is important topic. This movie doesn't show it. Nothing, really nothing happens in this movie. It is boring, and no message, no narrative. Acting is terrible. Effects were alright. But that's it."}, {"id": 96, "text": "If your story relies on insulting the intelligence of your audience, maybe that should be taken as a sign that your story is best left untoldIf they had taken away the idiotic previously undiscovered moon of Jupiter idiocy and came up with an actual plausible explanation of the supposed climate catastrophe that left the entire planet uninhabitable in a period of just two short years, they might have had a story.But instead of telling the drama of a man who put work before family and the pain, regret and possible redemption that comes after that, they instead made a pointless and boring movie about... well nothing in particular at allAnd what's worse is, you spend the entire movie waiting for answer, but none are given and the entire family drama takes up no more than 10 minutes of screen time, the rest is pure BS that has no substance"}, {"id": 97, "text": "I watched the whole movie, even though I considered walking out after 30 minutes.Basically, I spent the whole movie, trying to figure out the plot... Or figure out what the point of the movie was. After completing it, I'm still trying to figure that out I'm still trying to figure that out"}, {"id": 98, "text": "Perhaps it was meant for the book to be read instead."}, {"id": 99, "text": "I've missed new good movies in theaters and this was very exciting and really enjoyed it. Love Clooney."}, {"id": 100, "text": "Like most reviews say here, the movie is visually appealing, music and acting are good. While there is a message to this story, nothing really happens in the movie. It takes about 1hr, 10 minutes for things to materialize and tie together. But otherwise the movie sort of starts in the middle and ends in the middle.There are a few major flaws: Never mind that Clooney's character would have been unconscious and dead, after a few minutes in the frigid water. Never mind he happened to have a spare coat, when all other supplies sank in the water. Never mind he would have died walking thru the subzero blizzard, without anything covering his face (and wet). Never mind he had no frostbite on his face after that journey. Never mind that the space ship will be magically piloted by just 2 people, after three other specialists are gone. Guess they can do it all.But they, who cares about details ..."}, {"id": 101, "text": "Just good. Don't ask for aliens or battle star ships. This is a story about someone who was alone, or left alone somewhere. Think of you day after day, weeks, months, alone with no one to talk to and if there is a cat you would probably begin to talk to it.He's just remembering his past and trying to save someone's future. And he did it well. Do not be fooled by the appearing of the little girl. See the movie till the end."}, {"id": 102, "text": "Like many others I assumed it would be another acopolyctic sci-fi thriller, however it turned out to be a very human story, a pleasant change i must say. George Clooney plays the main character, a scientist who has devoted his life in pursuit and beleive in finding another habitable planet for human race's future survival. And along the way chose his work over his family. The story captures the character's devotion towards his field and his longing for his family, till the very end where he is terminally ill and life on earth has no hope. In an interesting and touching twist of fate, the end gives meaning to all that he has sacrificed and worked for, with his daughter taking the humanity's last hope forward. The story moves in a subtle way not being overly dramatic, however still blending amazing visuals, intensity and strong performances, specially by Clooney himself. For me somehow the subplots in space like loosing the young astronaut, space debris etc were unwanted diversions and usual tropes, which held me from getting immersed into the main characters journey, it wasn't needed. The story is about human endeavour, love, longing and meaning. For that its worth watching. Just wish it had created more room for emotional engagement."}, {"id": 103, "text": "A beautiful movie that poignantly captures longing for love and human connection, and missed opportunities for such bonds in pursuit of knowledge and ambitions. Behind the veil of this beautiful story telling is revelation of damage we inflict upon the planet and it's ramifications."}, {"id": 104, "text": "With the limited choices of decent things to watch I found it unexpectedly enjoyable."}, {"id": 105, "text": "As always keeping it to the point, it's a great movie as a sci-fi drama rather than action, yet there are some thrilling scenes too. It keeps you going on to see what is happening and what will happen at the end. There is a love bond / connection which surely creates emotional set of feelings with some characters. One thing negative is some of the unnecessarily long scenes which get a bit boring. Not the kind of movie I will be watching again any sooner. Overall it's a beautiful story of love and sacrifice."}, {"id": 106, "text": "Don't understand any of the positive reviews.How does he survive plunging into arctic water? Hypothermia would have killed him. How are birds dying and wolves aren't? What was the point of the airplane scene? So many points/laws of science and physics ignored. If a spaceship is that advanced 30 years from now, how is communication that prehistoric? How did they get no recorded message from earth saying not to come back/that there was a catastrophe.And the part that bothers me the most, that I haven't seen anyone else point out and the reason I'm bothering to leave a review on this mess, how does humanity live on? We never find out what happened to the colony ship that was supposed to take off. We never find out if there are other people on k-23. So humanity ends with the astronauts' baby? How the hell is she supposed to continue the human race? With her father?? And then what???Absolute waste of time."}, {"id": 107, "text": "It reminds me a lot of Ad Astra. While it lacks action and intensity and moves at a snail's pace, the second half of the film is quite emotional and poignant."}, {"id": 108, "text": "OK. What happened. This movie's first half is really engaging. As Augustine and the little girl make their way to transmitting station, it works very well. The bond that develops is sweet and yet terrifying. What happens next plays fast and loose with the first part. I wish we had some idea what happened to the earth. Then there's that space ship heading home and lots of superfluous stuff. Very slow but not really introspective. I'm disappointed in this."}, {"id": 109, "text": "I'm an absolute buff for a good sci-fi movie and this movie though is slow at times is quite poignant and thought provoking, running multiple stories only to have them connect in the end with a simple yet important explanation is not an easy task! the idea that we are slowly killing our planet is vey real and something we should be very concerned about. Thank you Sir Clooney for an excellent movie. Loved it!"}, {"id": 110, "text": "Seriously a movie with no plot, no story, not a single character to empathise with. Clooney stick to acting."}, {"id": 111, "text": "We have been quarantined for months and had a opportunity to go on a date at the theater. Despite this coming out on Netflix we decided to go see it in theater. Great popcorn, great soda, horrible movie! The trailer made it look exciting, but it is extremely boring. And I am a sci-fi addict!? The movie doesn't describe what the event was, probably global warming who the hell knows, it doesn't share where people were going. Like we assume we all know. Dumb. The trailer literally had all of the interesting parts. We left the theater after 45 minutes in. I don't even care what happens at the end."}, {"id": 112, "text": "I went in with low expectations and yet high hopes, because comments online here suggested it was poorly directed, but I'd never been disappointed with Clooney's work. This one transcends everything ordinary, a real gift to us from everyone involved, and a bit of a revelation about Clooney as a brilliant director, even to the point that he does perhaps his best work as an actor under his only direction, which is never expected. Maybe a best director nomination deserved here too. I'll need to see it again next year in able to know whether it's a great film, which will be revealed as always, by whether the second viewing is even better. It feels like it might make the grade because it's tough for me not to start really raving about some unique and beautiful moments. Enjoy!"}, {"id": 113, "text": "George Clooney plays a geezer in a beard and he's dying at a polar outpost. The world has a war or something and everyone dies but him and a kid. A spaceship returning from one of Jupiter's moons is racing to Earth with the news the moon is habitable. But there's no Earth; it's a cinder. Clooney crawls across to a radio shack on the ice like Lillian Gish on a hunk of ice in WAY DOWN EAST to warn them not to land. The identity of the kid is a big surprise but I was yawning nonstop by then.2 wasted hours."}, {"id": 114, "text": "The movie works as a movie, it's entertaining and well-acted."}, {"id": 115, "text": "After seeing George Clooney headlining commercials for a coffee company, I became worried. But my worries were set to the side after I watched this movie. The plot is very unique. The acting is some of the best I've seen this year. If you're a sci-fi fan then this is your film. I'll be honest, the film has a little something for everyone. I got choked up a few times. This is one of George Clooneys finest directions as a filmmaker. I was lucky enough to get early access to watch the film and I don't regret it one bit. One last thing, I had doubts about Kyle Chandler acting ability but that was laid to rest in this film. If he doesn't receive any type of praise for his role, I'd be shocked."}, {"id": 116, "text": "I spend my 2 hours just to watch a b******t movie. The in entire movie where is the story?? What was the purpose of this movie??"}, {"id": 117, "text": "It's not an action film. It's a drama. And it surely delivers from start to finish -doesn't over-complex the plot. Just shows the story and let's you do the thinking. No sad endings. Not overall happy endings (honestly I hate those)!"}, {"id": 118, "text": "So boring and too long. Nothing special or new. Just finished it anyway huh."}, {"id": 119, "text": "Yes, this is a slow-paced movie. It doesn't give a lot of info which is something I like in a movie. It lets you come to conclusions and doesn't just unnaturally push it in your face.Sure there are some things that are predictable, but then again most movies are very predictable if you know what to look for.The acting in this was great and I appreciate how it gives me time to actually read the characters expressions and understand what they are thinking, without needing them to blurt it out.Overall, great movie if you are in the mood for something slow and meaningful."}, {"id": 120, "text": "An intense, thought-provoking,well-directed film. Really liked the story-line."}, {"id": 121, "text": "No scenario - pointless transition between random events Worst performance by Clooney as actor and director in history Low budget"}, {"id": 122, "text": "This is worst space film I have seen and poor casting with bad dialogue, the worst scene was when the astronaut looses more blood that physically possible. The whole story is really poor and you're probably need to research the plot before watching as not helpful at filling in story at the start. why does the cooker have German setting if he speaks English, I think the little girl must have pushed the buttons as she is seen pushing all button on the equipment in the lab later."}, {"id": 123, "text": "A great film! It gives you a nice and sweet energy like the one you get when you finish a good book. The plot is simple but unique and meaningful, as it is life. After the film ends I stayed still, staring the screen and smiling... And for me that is the purpose of a film."}, {"id": 124, "text": "I don't understand why this movie has so many poor reviews. I thought it had the best of both worlds - apocalypse down on Earth &amp; mission up in space. The acting was excellent, the story suspenseful, and the cinematography was beautiful. I've seen the other science fiction movies to which it's being compared, and strongly disagree that The Midnight Sky took elements from those stories. It's ultimately a story of survival, and that's what most science fiction movies are about. If you like your science fiction with a lot of guns, you're not going to like this movie. But if you liked the Martian and Interstellar, then you should like this movie as well. I saw one person compare it to Ad Astra which, in my opinion, was a drama about a guy with daddy issues which just happened to take place in space. I literally dozed off in the movie theater during Ad Astra. On the other hand The Midnight Sky at times literally had me sitting on the edge of my seat from the suspense. This movie definitely goes on the list of movies I'll watch again."}, {"id": 125, "text": "Unbearably boring, slow, nonsense drama, not a sci fi movie, not much about anything! Fast forwarded it to see the ending which was expectedly boring and nonsense. Do not waste your time but if you insist of watching it fast forward so you can save 1.5 hours"}, {"id": 126, "text": "I realy dont underestan what some reviewers were expecting from that film.Its a nice solid film that deserves a 7/10 ( i put a 9 because i hate bad reviewers ;) )"}, {"id": 127, "text": "An amazing film. You're all wrong.Good effort George lad."}, {"id": 128, "text": "So, if you don't think, are unimaginative or expect a movie or Director to feed the audience every little nuance, PLEASE, do not waste your time watching this movie. This movie is very well done. Clooney got it right. Actors and storyline delivered a message. Hit home to me. If you didn't understand the movie you did not watch the dialogue or interactions by the actors. This is a very thought provoking movie on many levels. Thank you to the author of the book. I understood everything without having to read the book. But then, I am a thinker. I am independent and love movies to entertain me and make me use my brain. Stop criticizing something you cannot comprehend."}, {"id": 129, "text": "I don't know what people expected from this cautionary tale, but both the acting and the cinematography were great. No, this is not a sci-fi movie unless you consider humans devastating the planet as a science fiction. This movie gives us room for pause and a chance to reconsider the harm being done to our planet before it's too late. Bravo, George Clooney, for an amazing movie."}, {"id": 130, "text": "As an artist and human being George is 100 years ahead of many . And that shows in his latest production . Petty those giving low credits even now , in these times do not get it . They want entertainment , they want fun ! Screw the planet , screw the others , as long as they're getting the five minutes of pleasure. The message here is clear , and has been done with magistral acting and directing, and special kudos for production , who again in these times employed a lot of folk in need for work. A sincere bravo. Et encore !"}, {"id": 131, "text": "People who complain about what's the point were probably expecting a feel good action movie in space, the kind where they describe everything that's happening. You know, like it's a meteorite shower! If they hit us, we'll lose communication! That means we won't be able to communicate! That means we won't know what to do! That means it's dangerous! Danger is not good! In this movie, they show you and let you think. Is it a complex story? Not at all... I don't understand how you could miss the point... It's about the end of the world caused by human stupidity while a few smart people were trying to save us. It's also about how being those smart people, you also missed on things in life because you decided to help instead of being selfish."}, {"id": 132, "text": "I dont know why people are low rating this, must be some combination of jealousy and wannabe critics. Or maybe they have no idea of what a good story is without explosions murders and monsters. This film was an amazingly good story of the fall of humanity, and the fate of two people bonded by blood but never knowing each other. There are no fancy car chases, no action explosions, or aliens attacking. Its a sorrowful tale, human drama that makes you think about it all. And i didnt see the end coming threw me for a loop. If you like a good story , a human story then watch this film. It was like the film ,Vast of Night to me. Kept me watching because this is a story like the way an old time storyteller would beguile you with. I didnt need action and car chases or monsters and aliens, because the story was good on its own."}, {"id": 133, "text": "Anyone who likes scifi and space and the future also likes science. Was this written by a flat-earther who is this for. I checked the review right after they said there was a hidden M*** so thanks guys made the movie easier to go with. Watch that show on hulu called devs or anything from that guy after he learned his lesson from doing that terrible movie the core hope this guy learns it too. Love the AI designs of 3d printed organic shapes for the bracing of the space craft who ever designs the sets should have been lead science advisor I am positive they would know more."}, {"id": 134, "text": "An intelligent and compelling scifi film that proves you don't have to manufacture conflict between characters to raise the stakes. It also proves you can take a tragic theme and still tell a story of hope and salvation. Characters that aren't pigeonholed by stortellers into acts of hostility, foolishness, or irrationality, who instead exemplify the highest standards of human behavior, will do that, no matter how sad or depressing the subject matter.If you're looking for an action film, look elsewhere. If you're tired of scifi films devoid of authenticity and common sense, check out The Midnight Sky."}, {"id": 135, "text": "I liked it, but there were definitely some logial issues.1. Why evacuate FROM the relative safety of the Observatory, when they knew Augustine would survive everyone else by staying there? 2. Why did the computer say the ship was in range, when the observatory antenna wasn't strong enough? That would mean the ship was NOT in range of the equipment conncted to that conputer. 3. Why would a weather station have a stronger antenna than an observatory?The movie's plot hinges on those three things, which don't make sense, plus the massive coincidence of the ship comms going out just when they make contact with Augustine."}, {"id": 136, "text": "Good cast. Good story. But very slow and not much space or technology as I was expecting."}, {"id": 137, "text": "Nothing blowd up real good and I had to use my brain. No superheroes, no cartoons, no alien monsters. No Rap music, no Hiphop. Evokes an emotional response if you watch and THINK about the movie. If you only look up from your Cellphone when big explosions and gunfire happen in movies, forget about it. Note to self. OK Boomer. Ha Ha, beat you brainless dweebs to it.0"}, {"id": 138, "text": "Slow, slower, slowest. On top of that, the story is build quite in a strange way so that you wonder why you're watching some characters you couldn't care less for. Some of it is revealed at the end, but it doesn't make for a good screenplay at all. Overall I'd say this is material for a short rather than a movie: just three or four things happen, and there's not much character depth. The rest is filler."}, {"id": 139, "text": "So slow, soo boring and so mock of nothing happening. What's with these awful films?. Seriously, with this budget, these actors please at least get a decent script and a decent production team !Total fail"}, {"id": 140, "text": "Honestly, it is a film that starts well and ends wonderfully, it seems that the criticisms of copying other films from space are satirical, it is a wonderful film, and in the last half hour it becomes giant and beautiful, very well directed"}, {"id": 141, "text": "No clue what all the negative reviews are about - a brilliant film."}, {"id": 142, "text": "Way way too much time traveling without a hint of whether the current scene is past, present or future. Way way too much non-nonsensical stuff. E.g. Did the writers never hear of hypothermia? Or, is dialysis an optional treatment? This movie MIGHT make sense for those who are really really stoned, drunk, or maybe just hopeless nerds who enjoy anything sci-fi. Makes me wonder how Clooney lost all his money. What a waste of 2 hrs."}, {"id": 143, "text": "I can't help thinking that a plot would have improved this film. If this is too much to request, perhaps some excitement or romance or intellectual stimulation would have been worth considering.I would suggest sacking the writer. But it is pretty clear that they forget to employ one."}, {"id": 144, "text": "People really do need to learn how to use a rating scale. This is neither one of the best SciFi films (all the 10 and 9s are over the top), nor is it one of the worst scifi films (all th 1, 2, and 3s are also over the top). This film falls somewhere towards the middle, top end of the middle, of all the scifi films I have seen. Apparently, there are a lot of trolls and fan trolls on here. The acting was brilliant, especially Clooney. The story was slow, but so what. I thought it was entertaining nonetheless. I agree with another reviewer here; the Netflix generation can't handle slow burns (especially in this genre of film), it seems. If you enjoy scfi and some good acting, then this one might be worth watching."}, {"id": 145, "text": "Space exploration doesn't have to be jam packed with action. This is a slow burn which demands your patience. At around 2 hours long, it is a bit lengthy but I thoroughly enjoyed the ride. The cinematography and score are particularly noteworthy. Give this film a chance."}, {"id": 146, "text": "I don't agree with the low rating this movie gets here on IMDb, but I agree with the comments that it's difficult to get the point this movie wants to make. While Clooney is excellent as an old, ill man and his interaction with the little girl is touching (also due to the acting performance of the girl), this part of the movie is, just like the part where we follow the astronauts, just not compelling enough. The movie leans too much on camerashots and atmosphere, instead of a compelling story and a good script. But on the other hand, it does manage to portray a glimpse into a not too distant future, where humanity is facing a possible extinction, due to its own faults. So... I still rate this movie a 7, because I watched it with interest and it kept me entertained throughout. And Clooney playing an old man with a beard is a pleasure to watch. He's a fantastic actor. And so is Jones and the rest of the cast. A well put together team."}, {"id": 147, "text": "+Very intelligent, visual, sharp made movie with great acting-fail to understand the whole story, a bit jumpy,"}, {"id": 148, "text": "So the only question I have about this film. What happens to the little girl at the end?"}, {"id": 149, "text": "If you've ever read the excellent dystopian novel, On the Beach, you'd see the subtle parallels with The Midnight Sky, particularly the radiation enveloping Earth. In that novel/movie the last area impacted was Australia instead of the Arctic.I even believe a brief snippet from the 1959 film version of On the Beach is included in this film. Enjoyed The Midnight Sky very much. Not every movie has to be an action-packed thriller. A good story, a poignant tale, great special effects, and excellent acting bring this film to life."}, {"id": 150, "text": "The only Clooney with any talent was Rosemary.This movie is awful..... As are most projects George has been involved in. He's the most overrated actor/director in the history of cinema."}, {"id": 151, "text": "The film's ambition fails to deliver. I found myself caring less about the characters than I did about understanding the catastrophe. Uninteresting, unengaging, self-indulgent tosh. Turn it off &amp; go and look at the sky on a clear night...much more rewarding."}, {"id": 152, "text": "Talk about a great stupendous movie, THIS IS IT! George Cooney could not be better as an actor in this space and earth movie. He does some wild, and I mean wild stuff in this movie. The snow looked real because they filmed this movie where they had snow when they were making the movie. The actress is hot even if she is pregnant and I normally don't like looking for pregnant women for sex. The space scenes seem very real but I do not think that they were filmed in space. The hot astronaut girl is not the best actress but she does look good. I watched this with some of my male friends and they think that she was hot. The story is great because you believe that this could really happen to planet earth. I know that people think that the earth is ending without people being more recycling. They was some dead places in the movie that could use some full frontal and full back nudity to make it better. The space battle was one of the best in any movie ever! If I were you, or anybody, I would see this movie ten times."}, {"id": 153, "text": "Even the photography, which some appear to find noteworthy, seems to me generic and bland .The story, screenplay, acting, it's insufferable . Even the action scenes are boring and , well, generic . The atmosphere - generic .There are movies that managed to turn nothingness into substance - Moon comes to mind - this film however is just an intentional creation of nothingness that amounts to nothing .I can't find any reason to add even a single star to the 1 rating . There's just nothing there but a giant waste of budget and of whatever time it takes to sit through this movie industry power broker bubble created drivel ."}, {"id": 154, "text": "This film has been done numerous times infinitely better. Notably, films , which star its director, suffer from the conflict of interest which invariably arises - and it's very much the case here: clooney needs to make up his mind whether he wishes to be a star or director - it's clear he can't do both!"}, {"id": 155, "text": "Fascinating! I feel sorry for those who found this movie slow or didn't get the point. What's happened to our appreciation of good old storytelling? Does it have to be a special effects blockbuster to hold our attention? Kinda makes me wonder if there might be another planet to escape to. 😁"}, {"id": 156, "text": "The average joe will knock this film, but it's a small glimpse at what could happen to our beautiful planet Earth. Wake up people !!!"}, {"id": 157, "text": "The Midnight Sky is a film to watch, it's not Star wars or other action sci-fi but I believe it's a well written and acted film that has to be watched to be appreciated. It has moments of sadness that show how well it has been directed and the actors play their roles perfectly. There are weaving plots but they are necessary to link the characters together.Give it a whirl and you'll not be disappointed, it's definitely 2 hours you'll not need to replace. Well done Mr Clooney."}, {"id": 158, "text": "Just when I thought 2020 couldn't get any worse, then I watched this movie..."}, {"id": 159, "text": "This might be the worst movie I've ever seen. It's just a big nothing and a total waste of time."}, {"id": 160, "text": "Such a slow movie, so excruciatingly boring. Had an ok ending. Not worth 2 hours of anyone's time."}, {"id": 161, "text": "Awful boring movie. All fake. You couldn't survive in cold. Very confusing."}, {"id": 162, "text": "This movie was idiotic, unbelievable, and I totally wasted 2 hours of my life."}, {"id": 163, "text": "They explain nothing, the plot is confusing at best and it abruptly ends giving closure to no characters. Visually it's very well done but its overshadowed by the pointless story. Save yourself 2 hours and watch a rerun of your favorite sci-fi movie."}, {"id": 164, "text": "For real who wrote this movie....The whole plot was bad, the space ship and the crew was bad.But what drives me nuts is the scene where the trailer sinks and he jumps in ice freezing water.There 0% that anyone stranded, jumps in freezing water, acts normal in the water and would come out not dying from hypothermia.The acting normal when jumping into the water is what gets me too, he would have an uncontrollable spasms at least 1-2min even making you breath while under water and taking in freezing water would kill you."}, {"id": 165, "text": "The points of implausibility are FAR too many to even name And George you are far too talented to let a bunch of YES peeps around you tell you that you made an amaaaazing film Darlin ya didn't - You've come a long way since your humble and charming beginnings on Roseanne - but this film was just majorly embarrassing- and I refuse to believe that you had that many executives or cronies around that told you ANY of these points of storyline were anything resembling believability. Stick with acting on Nespresso and stop listening to the cronies and the executives - Maybe you couldn't hear that story you wanted to direct through the atta-boy chorus. Merry Christmas to all and to all a good night Now ... on to Patty and Wonder Woman😍"}, {"id": 166, "text": "All these reviews that say nothing happens are completely wrong.It seems everyone is looking for Star Trek or a Marvel movie.This movie is simple and heart warming. Very well done.Give it a chance. It's is all revealed in the last few minutes."}, {"id": 167, "text": "Could've been a watchable 5/10 if the writing was a little less lazy and playtime was 80min instead of 120. Too many scientific inaccuracies to even count but to name a few: those asteroid fields are simply not a thing, there are way too many too close together; it's laughable that an asteroid of at least 10 meters across traveling at 50000km/h only puts a dent in their space station when in reality it should've obliterated everything and blown up due to explosive decompression; apocalypse was never explained because that would've required an original idea; crew gets knocked up during important space ship; goes on space walk while vomiting just minutes earlier; old terminally ill men falls into freezing water then climbs out and somehow doesn't freeze solid in minus 50 temperatures; his entire journey is useless since the crew can just look at the earth and deduce it's gone from lack of comms. There are many,many more but I'll end it here because I just want to forget having watched this"}, {"id": 168, "text": "Hoping it would get better but it didn't. Boring with a story line that literally goes nowhere."}, {"id": 169, "text": "Hard to understand how Hollywood puts out trash like this. With a $100 million budget you would think someone would read the script. Netflix really needs to make better decisions.The plot is insane, to put it mildly. This makes all the drama that takes place laughable. While the CGI in space is watchable, it's been done.Save yourself the aggravation of sitting through this trash for two hours."}, {"id": 170, "text": "Not your typical Hollywood BS ie meaningless action in space. It's sci-fi and clearly many viewers do not know what is sci-fi. Those who have not read Lem, Clarke, Asimov etc definitely should skip this type of movie. Yes, it could be better. But it is pretty good!"}, {"id": 171, "text": "I had no expectations of this movie, but I thoroughly enjoyed it. It's thought provoking, what would happen we faced a post apocalyptic world seen from a number of perspectives.......I enjoyed it as did my Mother."}, {"id": 172, "text": "Netflix comes with a lot of low budget movies that drag on forever and the only way to watch them is to increase the speed. Otherwise, you will get bored to death with an anticipated story."}, {"id": 173, "text": "Drawn to this because it's stars George. Always good to see Kyle Chandler star. I like Clooneys look. Tennessee whisky is a great song in the soundtrack. Slow paced film (tiny bit too slow in parts) however the twist at the end is great were we find out sully is iris (&amp; his daughter) and iris was never really there. A good watch."}, {"id": 174, "text": "Nearly two hours of watching a movie which is explained in the 25 word bio on Netflix. Unbelievable scenes regarding the trek to the weather station made it even more annoying. There was in reality no beginning and no end, and the middle was a waste of the short time you have on earth."}, {"id": 175, "text": "Interesting, smart movie, left me me with a lot off questions in a good way"}, {"id": 176, "text": "Apparently this wasn't obvious enough for some viewers based on the other user reviews. i thought it was wonderful, sad, scary and very well-done. no alien monsters, no zombies, no bloody battles. but one of augustine's (clooney) last lines really said it all. people complain that the science was off, blah blah blah. it's a MOVIE. a fictional movie. why can't you just appreciate the story?"}, {"id": 177, "text": "I read most of the comments and I don't see why this film was disappointing. I liked the pace and the cross-edit, which increases in a more dramatical way. Well produced, well acted, with decent space equipment and machinery that will adorn the environment of a semi-sci-fi movie. In addition, I think the film escalates pretty normally in terms of keeping the hook and the plot is all about the human struggle; who cares what really happened down there? Who knows what's happening every single day of our lives down here? There's something going wrong, that's it. So let them try to figure out how to stay alive. I don't really know about all the scientific elements gone bananas here - as a matter of fact, I haven't noticed any, but then again I am not working at a space lab, or NASA for that matter. To me, it was fine. I only felt a little bit disappointed on an editing glitch: one line was literally spoken off-sound during an A-to-B view, and it was such an obvious mistake, I wonder who approved it for the audience. Other than that, I enjoyed the film, and Clooney had done a good directing. If you like a space/sci-fi drama, well, this is a pretty good movie to relax and enjoy the ride."}, {"id": 178, "text": "1 hour 59 to be more precise, A nice drama that can sometimes be also a bit boring with a strong emotional end, I liked even if I do think could be better is good but no master piece and a drama only with some sci fi but you can go for it."}, {"id": 179, "text": "A silly melodrama with a silly plot and some jarring set flops. Rickety shelving with loose assorted bottles and bits on a space ship, a wood and leather sofa in a remote polar location, etc.Silly plot and silly script. Dangerous repair work on scientific equipment in order space but playing Sweet Caroline full blast and everyone singing along while trying to save their spaceship and lives.Anyhoo, yet another silly space Echo-crisis disaster movie. 🙄"}, {"id": 180, "text": "A strong mirror of life ... flowing and surprising ... could be you in fact."}, {"id": 181, "text": "I love slow-burn psychological dramas. So when I say the pacing on this was too slow, you know that they had this thing powered by a snail. The story is fine, but I think they could have compressed it by 25% and it would have been much more enjoyable. Additionally, I would have included a little background on the nuclear apocalypse and whatever it was the mission left on K23, the only remaining future of the human race."}, {"id": 182, "text": "A story told fluently, without boring pauses, although with a linear argument and abusing sentimentality that do not cause anything more than detachment from the viewer."}, {"id": 183, "text": "Very enjoyable movie! Tense in places, touching and Clooney is excellent acting and directing. Helps if you like sci-fi but not essential as there is a lot of relationship plot.Great movie and I will watch again."}, {"id": 184, "text": "Seriously I am surprised Netflix would produce something so terrible. So many holes in the plot and nothing is explained properly. What a waste of 2.5 hours of my time!"}, {"id": 185, "text": "This just stole over two hours of my life, acting good, scenery good, space scenes looked good, but where ,what ,why ?"}, {"id": 186, "text": "To have your book made into a movie must be a dream come true but the lack of thought is there for the audience to see. What was the point of this movie? To start a new world with a white girl and black guy? Trite. To show people destroyed Earth? Eye roll. To characterize an ambitious father with regrets in old age? Passé. Entertainment? Yawn.And the science, what science?Clooney coughing all over, and puking in the toilet, just does not hold the movie together. The musical score tried but did not hold it together, either.A shout out to the weightless blood droplets but they came from the Astronaut's helmet when she suffered a back puncture wound."}, {"id": 187, "text": "I just finished it and found myself skipping through half of it. It was painfully slow, with an intention of delivering a melodramatic feel I suppose. The acting was fine, but there was no message or moral lesson whatsoever, besides save Earth before it's too late.I also don't know much about science or how space works but the way they do it, feels a bit amateur. From the fake planet to the spaceship malfunctions, it was off. Wouldn't recommend."}, {"id": 188, "text": "I feel bad for people that question, What was the point? You couldn't identify with looking back at a regretable past? You can't see how devastating the end of Earth would be? This never made you think what it would be like for you and your family from ANY of these characters point of view? The acting was subtle and good. The CGI is very good cause it's hard to compare reality. I'm SMFH over the poor ratings and reviews."}, {"id": 189, "text": "Clooney as usual, gives an excellent understated performance which is his trademark. Well donebut paced as a drama not Star Wars. Well worth kicking back on the sofa and enjoying. Oh to all those saying it's slow moving and made no sense? I saw all those reviews when 2001 came out."}, {"id": 190, "text": "George Clooney is a better actor than he is Director - I gave this show a 7 because I like science fiction and the special effects were spectacular and would make George Lucas and Steven Speilberg proud. The problem with this rather slow moving story ( almost 2hr's long ) were the distracting side episodes that took away from the story line - it was like watching a race where the runners kept stopping for coffee. I am trying to be careful not to include any spoilers so I won't be specific but the one side distraction involving the space craft problems was well worth watching and gripping. The ending was a surprise that made me thankful I stuck with the movie - my wife didn't make it but I told her the ending but it wasn't the same - if you can stay with the movie - the ending will be a shocker ."}, {"id": 191, "text": "Was lil Iris the grown up Sully? No finale on the 2 astronauts who returned home?"}, {"id": 192, "text": "This a disaster movie without the disaster in full view. It requires imagination &amp; thought (which clearly most of you writing reviews here lack) to grasp it. To those whining here about it being boring what do you think it life would be like alone or with only a silent child with you? Life would be slow &amp; tedious. Get over yourselves. Enjoy this for what it is. Drama. SciFi. End-of-the-world. The acting is good. The suspense is there. Fx is excellent."}, {"id": 193, "text": "Just needed some closure on both storylines imo. The two remaining crew getting to K23 and the others on earth."}, {"id": 194, "text": "I mean, what is it lately with space movies that drives them to focus on the main character's inner battles."}, {"id": 195, "text": "What really they want to show?.... awkward emotions, bad story..wtf"}, {"id": 196, "text": "My only problem with this film was the schmaltzy soundtrack. The flute should definitely be left back in the 1970's where it belongs. Everything else was fine. A dying man's decent into madness surrounded by a dying planet with one goal keeping him alive, save the last few humans from certain death. The acting is good, the cinematography excellent, the design is very intelligent. Unfortunately a lot of reviewers found it too slow, but not me, the porridge was just right. The cherry on top was the ending, I certainly didn't see it coming, and I bet the baby gets called Miya."}, {"id": 197, "text": "This was a very enjoyable experience! There were moments of suspense, tenderness, sadness and very often it was thought-provoking. I understand the comments that describe it as being slightly disjointed at times and not necessarily knowing exactly what is trying to be. George Clooney gives a reliably good performance. Granted, this film probably doesn't deserve to take a seat in the top tier of Sci-fi movies. But this is a good all-round entertaining movie. In my opinion! DON'T Be deterred by the negative reviews."}, {"id": 198, "text": "An adaptation of one of those novels that was most likely marketed as absolutely not science fiction oh dear me no, this sees George Clooney as an astronomer who stays behind at a remote research station when the end of the world comes along. Because he doesn't have long left. He's devoted all his life to work, at the expense of personal things. As we find out in flashbacks.Meantime a spaceship is returning from a new moon of Jupiter that can support human life thus it must be new, unaware they have no home to come back to.Then the astronomer finds he has a lost child to take care of.Initially sedate rather than slow, the early scenes at the base are quite affecting, as he has to look after the child. You don't get too much of the spaceship till the final third.All characters have journeys. Some difficulties await on the way. There is a decent feeling of jeopardy as you can't be sure who will make it to the end.An eventual communication between all does all for the point of this to come through. It's all about considering your life choices and finding value, and what you could have found, when you're at the end.It does use music very well indeed to show emotion. As it should do.I did find this quite involving and affecting, and it was interesting to have a story about human drama rather than trying to stop the end of the world, which can't be changed in here.But it doesn't really end so much as stop. It did leave me wondering what happened to one character and what they would do next.So it's one of those films that has you under it's spell while it's on, but it doesn't stick for long after.Not a bad watch though. Although it does continue the action into the end credits there's nothing at the end of them."}, {"id": 199, "text": "Starts slowly but it's actually a really good film.. visually stunning and great acting. My main concern was the kid getting left behind but that problem sorta itself out!! Entertaining!"}, {"id": 200, "text": "Nice movie and great acting from George. Breathtaking filming of space and other locations. This movie tells us what will happen if we dont care about our planet. Story is very believable and gives a clear picture off it."}, {"id": 201, "text": "I think a lot of viewers missed the biggest plot point. S P I I L E R A L E E R T Sully was Clooney's daughter that he basically abandoned as a child so he was determined to save her so she could at least live out her life. Well done and worth the watch."}, {"id": 202, "text": "I don't know why the low rating The midnight sky isn't interstellar or the martian but still a good movie The visual effects was great and good acting from George Clooney and nice plot at the end"}, {"id": 203, "text": "It's really good, kinda made me rolleyes when they needed to cram action elements (especially in space) in it. To those complaining its too slow and too artsy: You have probably never seen a real art film (montenegro post war drama anyone?). This is just cookie cutter 'murica hollywood with decent acting and just a little more depth than your last avengers movie ..."}, {"id": 204, "text": "Supported by a stellar musical score, the film slowly and calmly juxtaposes the weight and horror of human folly against the casual wonder of its achievement (3d printers fixing a spaceship, so cool!). Objectively speaking the story stands as a notable reflection of a troublingly prevalent fatalistic outlook on the future of our species. Subjectively though the sheer hopelessness is palpable from start to finish. Which incidentally should be the tagline for the year 2020, hence why I regret watching the movie two days before Christmas! There are barely any laughs to be had here, and those rare moments of levity are weak and don't endure long. And while the exciting scenes of snow and space action/crises are legitimately toe curling and well-shot, the stakes never seem to matter given the inevitability of the outcome. 6/10 Stars. Writing was good, and the cast all delivered great performances, but the timing is just miserable in the year of Covid."}, {"id": 205, "text": "Not sure where to start but very poorly directed, bad acting and really too many open questions. Its ok to leave something to the viewer imagination, but here its practically the entire movie. The movie and story are way too simple. Are people nowadays becoming so stupid that this kind of simplicity is entertainment? Where are the movies that are intellectually challenging like Interstellar, Inception..."}, {"id": 206, "text": "Long pause and frames without nothing to add makes this movie EXTREMELY boring. Many characters but they are constructed in such way that you don't get attached of interested in any of them. PS. I'm not hard to please and I even if enjoy the art films about nothing but this movie was really something else."}, {"id": 207, "text": "Actually this is not an action film. it is a drama sci-fi film with some small portions of action...Great direction and cast by George Clooney great casting by everyone... great sceneries....In my opinion it deserves a highest rate"}, {"id": 208, "text": "...yet I don't hear too many original views. I'm not one for reviewing, more of an observer but I came here to say a few things because the overwhelming bogged down negative mindset that plagues this site has struck again. Don't believe everything you read. It was a stimulating movie, with emotions running from loneliness to awe and wonder. The pace isn't something to ever consider, it plays more on minor interactions, the quiet place in the moments of thought and beautiful visuals. It isn't Gravity nor is it Interstellar. They just have scenes that relate to the same concepts. But those are exact possibilities of what might happen in a scenario of off world travel...so linking the 2 is short sighted on the part of any complaint there. It's worth a watch, even if I'd have written a little more on the earths demise concept, the time spent in space and their new home. 7/10"}, {"id": 209, "text": "Honestly, just rubbish. Felt like a series of disconnected scenes, interspersed with overly emotive flashbacks that try to make you somehow care about the characters in the film. I cared nothing, not one bit. And like a chump I sat there and watched this drivel."}, {"id": 210, "text": "Can't understand the bad reviews. People are so dumb 😂😂😂"}, {"id": 211, "text": "I went into this film with high hopes.Oh how wrong I was.Slow, dull no real storyline.2020 has been bad enough, don't end it on even more of a sour note by watching this tripe."}, {"id": 212, "text": "With the amount of new material out there to watch at the moment ( which is limited for obvious reasons) this film is, slow from the off, gets a little better for a small period and then I couldn't really care what happened as it went on. In a nut shell, slow with a poor story"}, {"id": 213, "text": "I watched and still have no clue what message the movie was sending. It was almost like two movies in one that never met up in the middle."}, {"id": 214, "text": "Although this movie has excellent space scenes and concepts for the moon planet being inhabitable, the story line was blah. Clooney is a must see actor but this movie was not. It reminded me of the The American  that he was in. Nothing big happens and useless storyline. You aren't even told what actually happens to earth to make It uninhabitable. They just call it the event. They mention sickness and you see some animals flopping around and a plane crash victim who is in the process of dying, but then the spaceship that is returning to Earth, when gets near enough, the pictures look like dust storms raging everywhere. Not to mention, the plane crash victim crashes somewhere in the Arctic or Antarctica, but is still in the plane's fuselage. HOW? It's frigid there!"}, {"id": 215, "text": "There was potential but...... I think I may spend the rest of my life working on a time machine just so I can recover the 2 hours of my life lost watching that garbage."}, {"id": 216, "text": "This movie is like a total waste of time. To watch these clip like scenes with a pretty good music score, that just didn't work at all with this film. From the beginning you already seem to know this girl Iris is not real. So, you wait to see how things move on and theres a little hope, something interesting might happen (finally) and then BAM, nothing... like you see a wolf of some sort, then some sinking container and some scenes in space and all of it you've seen already somewhere before. Not even to mention a terrible acting, if there was acting at all. The only nice part of this movie are some animations of another world somewhere... i could'nt wait for it to end to turn if of finally after all hopes were lost with this flick and watch something that had some kind story, sense and flow. The score by Desplat might be pretty nice, but it also destroys any moment and makes this film truly ridiculous. Well, here would have been less definitely more."}, {"id": 217, "text": "The kind of movie that it's ok to miss most of it just watch the first 5 minutes and the last 5 minutes."}, {"id": 218, "text": "With such a cast, I'm confused as to how the acting and dialogue were so lame. The most interesting character in the film was the hallucination, as speechless as that was. I kept skipping most of the silent pointless parts and gave up on the film when 50% of the crew decided to go on the suicide mission."}, {"id": 219, "text": "It's a film about family, love and hope. How he pushed his family away and how he abandoned his daughter to concentrate on his work to ironically have that haunt him through the movie. Great twist ending. I for one loved it 👍"}, {"id": 220, "text": "I can't give zero, so, one star. Don't waste your time here, another pointless, Boredom Netflix mess."}, {"id": 221, "text": "Beside the visual scenes, there is no life in this movie, build a rocket and run away from it."}, {"id": 222, "text": "...but if it is, in fact, a character study how come there was no character building at all? That is my chief peeve, because this movie appears to portray some kind of worldwide apocalypse that is never explained...it starts off well enough with George electing to stay at this mysterious arctic observatory that is being evactuated, but doesn't explain where all those people are evacuating too...then he finds a young girl who was inadvertently left behind, but we don't quite know how that happened either...then then the story devolves into individual scenes that do nothing to boost the story let alone give you a hint to what is going on...Oh, we have an exotic space ship with a number of astronauts on it, coming back from a mysterious moon around Jupiter that we never discovered before, that sorta gives you a feeling of a detour in the story and you hope the pace will pick up some...but it don't...am I confusing you yet; it isn't my fault. The movie is what's doing that, I'm just recounting what I saw, ok?In one word, this movie is 'disjointed', and that is the closest I can come to a glowing review...sorry!"}, {"id": 223, "text": "The film had some very predictable and pointless heart racing moments but that's all, so if you like a bit of anxiety for the sake of it this film is for you. The rest of it is filled full of pointless dialogue . No story no plot development no explanations. Another Netflix film with a non ending, nothing explained. Waste of time.Only positive is Clooney didn't push (too hard anyway) any hardcore environmental/left ideology on the film, there is a slight hint of the humans ruined the world but they don't even bother to explain how. Lazy."}, {"id": 224, "text": "Except for GRAVITY, I've never seen him in a good film. I've always been confused by the appeal. Direct he most certainly cannot. This film made me fall asleep. So boring."}, {"id": 225, "text": "Not bad, but what was that!?? Boring dram trying to be action? Hero?! Bad book! But could be more research or doing beset! I'm surprised they didn't use horses or cowboys stof hahahah. it could be 30-45 min.to much time to showing unnecessary thing's on time was enough, we are not dumb! If there was not colony name no one , want to se this film, Café Nestlé ... if you Want to se you ser a great instructor don't use your real name and don't play in your films, use the same resources as a new instructor dos not know any one and any one do any favores and then we se what you are Mr colony or other celebrities know makings suddenly movies. Adam and Eve going's start family? what was that? What happened suddenly to erth? Where came from those ships in 20 years? And the comeback now and? To many questions which out logic answers, good One! Logic, is something most of movies lost! Pleas Simone find for them! We don't like to finde for you! That is why Gon with the wind still win people's hearts. Dos have logic. Thank you."}, {"id": 226, "text": "Let's be honest, if you have an IQ lower than 90 you're not going to like this film. If you have no imagination and have to have everything explained to you through dialogue on screen then this film isn't for you.This film is beautifully directed by Clooney, acted well by all involved and a wonderful music score to boot. Sure, it's slow paced to begin with and admittedly I did struggle with the first 20 minutes, but once the story and intrigue get going, well, like I said, if you need an explanation of everything, you're not going to enjoy it."}, {"id": 227, "text": "Like many other people wrote, this movie is more of a drama than SciFi. Was it a bad movie, IMHO not. But it was not a great movie to me either. However, good vs bad is just a mather of opinion. If you have seen a lot of movies, I do understand, this movie looks more of the same. Maybe because this movie is more a kind of limping on two legs, due to the fact that it is a drama (the realtion between a father and his daughter) and added some almost unnecessary predictable (SciFi) action (where everything that could go wrong, goes wrong). That's for me do decide not to call it a great movie. But hey, I am an old dog, who has seen tons of movies. I'll guess that lack of reference, would made this movie more enjoyable! Bottom line, still enjoyed quality acting and FX, and would definitly not call it waste of time!"}, {"id": 228, "text": "If this movie would've been entirely of George Clooney pushing through his terminal illness to save the little girl this would've been a 7-8 star movie. However it is not and they are trying to do too much. Past, present, visions of a fake daughter. Not great direction. You start the movie following solely Clooney and if you watched The American, this guy can be in a movie literally doing nothing and it hooks you. So the first half of this movie is great, you're rooting for him to save the girl and get her to the base and get her picked up. But then the story shifts towards the people in space and from there frankly the movie just sucks. I'm sure the book it's based on did a much better job of intertwining the stories and whatnot but the second half of this movie was a mess and then it ends and you feel cheated."}, {"id": 229, "text": "Stopped watching after they discovered new Jupiter's moon."}, {"id": 230, "text": "This movie deserves no comments....just ignore it."}, {"id": 231, "text": "It's good but I expected something better. George Clooney's performance is great. The visuals and original score are awesome. But the story is average and unoriginal. And the movie somehow is long which makes it boring."}, {"id": 232, "text": "3 stars for playing Sweet Caroline around 80 minutes in. At least that broke up the monotony of the time I wasted pointlessly waiting for something interesting to happen. Do not recommend."}, {"id": 233, "text": "Felt as though I had slept through the whole movie and missed all the best bits, which I later discovered were not in this movie anyway.It was a really painful watch and one I would not attempt to watch again"}, {"id": 234, "text": "A bit slow but every actor killed it. Well made, well written and great camera work."}, {"id": 235, "text": "I am speechless. How does a movie about a man that never cared the slightest about his daughter is turned around as a end of life cosmic redemption? Please give us a break."}, {"id": 236, "text": "It was never revealed what happened on Earth, but the end result was a crew was left in orbit, communicating with two surviving people isolated in the Arctic.I thought the acting was very well done, and the science was believable. I would put this movie on the same scale as Contact in terms of exposing how us humans react to the unexpected.I was not a rock-and-roll thriller, but the story and the good CGI kept me interested for this somewhat long sci-fi movie, that might have drawn some story ideas from the pandemic we are now experiencing.I enjoyed the movie."}, {"id": 237, "text": "But no cigar. When the credit started to roll I said goddamnit, wishing they had explained something to get some satisfaction. Edit it again!"}, {"id": 238, "text": "All the people who gave this film a low rating, I think, missed the point. This is an adventure film, disguised as a thoughtful affirmation that even in the face of disaster, it is the people we love who sustain us, and for whom we would make the ultimate sacrifice. Every single character in this film had family ties. Sully and Adewole who never let being in the family way prevent them from living their dream of exploring the stars (in contrast to Augustine who did not even meet or make himself known to his daughter so focused was he in his scientific work). Maya who, even in her quiet time of reading, surrounds herself with the images and sounds of her family (by blood and by heart). Contrast Augustine who seems to have cut himself off from all human relationships. Sanchez who lost a daughter and who imagined Maya and his deceased daughter growing up together as friends. He could have stayed in the ship. Yet, even he returned to earth to bring Maya home. Mitchell who seems to eat breakfast with his family during the entire two years of the mission, and for whom he willingly risked his life in the small chance they could be reunited. Contrast Augustine who was initially unwilling to take responsibility for a child and whose first action was to attempt to pass off the child to whoever is out there. When he said I'm not the right person, it's not just because he is ill and dying. He's not the right person because he has never been responsible for anybody.Looking back, we now realize that Augustine's change of heart appears to have happened after he saw the ship's manifest and recognized Sully as the daughter he never knew, and one he could potentially save. The child Iris is the image in his mind of the child as he last saw her and what kept him going to reach the weather station despite the hardship. Knowing what we know of Augustine, he probably would not have given a damn about this lone spaceship who will be returning to earth to certain death. It's not in his character to care or be heroic. He could have stayed at Barbeau and been content to wait out his final days there. But he didn't. In the end, it's his one last link to humanity, his daughter, that prompted him to act selflessly, probably for once in his life.I loved the film and its message. All the actors gave terrific performances. The visual effects are stunning. But one has to see this film as more than just a simple adventure film, of one man's race against time. It is so much more than that."}, {"id": 239, "text": "In every aspect this is a very high standard movie. First of all, the film teaches a great lesson to humanity. Earth's catastrophic future is a joke to many people! However, in the near future, the situation will be Maybe worse than the movie. In this fascist world now, respect and love have been completely abandoned. People only care about money. There is no trust in science. As such, nobody started to care about the facts. Everyone should watch this movie and think about it."}, {"id": 240, "text": "Do not waste your time. Although appreciate to all the actor and crew on a make job done, especially in this difficult time but movie is acliché, empty, and no point."}, {"id": 241, "text": "I'm not really much on reviewing But I know what I like and dislike. I Enjoyed this movie. Good acting, I thought a good storyline and very good visual effects. I wasn't disappointed."}, {"id": 242, "text": "George Clooney plays Augustine, an explorer who is in the Antarctic and trying to get a message to a group on a space station not to return home. This is because there are been a catastrophic event back on earth. This film is beautifully shot, the cinematography is gorgeous to look at. Clooney does a great job of directing and he does a great acting job as well. A guy who is desperate for human contact again after being stuck alone for so long. Felicity Jones does a great job as one of the people in the space station she shows so really emotion and de-mentions to her character. You really feel for her and the rest of the crew. I really enjoyed the immersive nature of this film. I think it is one of the best films you can watch right now on Netflix"}, {"id": 243, "text": "Sorry folks, but what a waste of money in making the movie, bad acting and 2 hours of my life I can't take back..."}, {"id": 244, "text": "Clooney  there will be  No Donald Trump is one of the biggest career mistakes ever .Regardless of Clooney's opinions , this movie is entertaining and visually appealing . The story is fantasy , sci-fi , drama . Directing and visuals top notch acting is good. The story of death and escape pain and suffering . It deals with loneliness isolation and self sacrifice. Clooney's every mans performance is memorable for me because it ( well chosen role ) is a reset from his 2016 largess. It's redeemable in a sense and I am sure he knows it . Anyhow it's definitely worth the watch for the entertaining value at the Christmas season when everyone is hunkered down ."}, {"id": 245, "text": "I don't even know what to rate this. I thought it was great until the very end when the entire movie was ruined. I had to look it up ending explained. And was thoroughly disappointed."}, {"id": 246, "text": "Reminds me of a badly acted episode of Dr Who!George Clooney is miscast"}, {"id": 247, "text": "Like the movie itself, the title of this review is not what you might expect. I refer not to the supposed apocalypse that makes earth uninhabitable but how life may imitate art. If this film is indicative of what is on offer, then like the astronauts depicted, some theatre-goers will prefer to swing by and give the industry a miss altogether.This is Clooney's Greenland."}, {"id": 248, "text": "Do you learn that at film school or why does it always have to be that way?"}, {"id": 249, "text": "A sad example of good filming and some nice futuristic styling going to waste in the absence of a half decent story to tell"}, {"id": 250, "text": "Giving this 3 stars instead of 1 because production is spot on and it's visually quite beautiful. They turned George Clooney into David Letterman though. Terrible. The book that this is based on is beautifully written; Hollywood then comes and turns it into mush."}, {"id": 251, "text": "I usually love slow paced character sci-fi, but this was truly disappointing. Although the shots were great, the cast is capable of so much more. I have no idea what they were trying to accomplish or go with this story. And it could have really gone without the typical twist at the end that is totally over done by now. Not even worth the viewing."}, {"id": 252, "text": "What a waste of however long it took to play.Annoying, stupid, pedantic, excellent effects, wasted actors.Unsure of what happened to Earth in satellite relay view. And what was that anyway?Only good actor the little girl and she said nothing. Nothing pretty much describes this movie."}, {"id": 253, "text": "So there. It is difficult as it is about the end. No last minute, one million to one chance to save the planet, no escape pod, or we need to take this as a final warning. Just the end of life on earth. The little girl is brilliant, as his George. There are lessons to learn and acting of the highest calibre. With its downer ending most will shout I don't like it ignore that and embrace the end of the world. Well done"}, {"id": 254, "text": "Clooney is a scumbag leftist anyway. Boring movie. Very very boring."}, {"id": 255, "text": "Not bad at all. I don't understand the bad reviews. Nice scenery and meaningful movie. Worth watching."}, {"id": 256, "text": "With this one, forget about any reviews, just enjoy it. You won't regret. Ps: don't if you are expecting alien encounter, laser swords and spaceship battles."}, {"id": 257, "text": "The most boring movie I've ever watched. Literally nothing happens. A man in a Arctic station tries to contact a spaceship to tell them to not come back. Because the earth is no longer what it used to be. And of course, feminism being what it has become, they needed to have female cosmonauts..... just lol Everything in this movie is so boring, the characters have the charisma of a pea. The highlight of the movie was when they played sweet Caroline in space."}, {"id": 258, "text": "George Clooney is a really good actor. I cannot remember a dull movie he made - until now. The dull one is this one. And boy, is it dull.... It is long and slow and irritating. You can drive a SUV to and fro through the holes in the plot. The set sucks obviously - for example: space ships are designed to maximize use of space in the ship. For obvious reasons. Here the dudes sit at a desk with huge empty spaces behind them which sports garish was it an attempt to decoration? And so on. The story has a number of element also that are not integrated. Then the plot rests on a very fundamental element which is not cleared up. And this does not enhance mystery of any sort. It merely underlines the sloppiness with which the movie was made."}, {"id": 259, "text": "Mr. Clooney should stay with acting and forgot about directing movies. I felt that he's not entirely there. The idea is good, filming is kind of OK, but the directing is terrible. I couldn't decide what's going on. What is important. What is not. The whole movies is a beautiful mess."}, {"id": 260, "text": "On paper it may look great, but the story and the plot was absolutely dead.Nothing could hold the viewers attention for more than 5 minutes.Clooney didn't need to do this."}, {"id": 261, "text": "Extremely boring, slow-paced. I really wanted to give it a try. It was impossible though."}, {"id": 262, "text": "The story is about as plausible as Shamu sprouting wings and turning into a parrot. Don't get me wrong, it is a beautiful film. But the physics of things like blood, injury, the way things move and strike the ship! What is the point of this? Is it a cautionary tale? No, I don't think so. I think it is a tale of a man who makes himself the victim, even after the world has died (or is dying), by (of all things) falling through the ice into a lake in Antarctica in the winter. He swims under the ice and does not die of hypothermia? No fire? Just a little girl to zip his jacket. With lines like, Wish us luck, Good luck. I expected Leslie Nielsen to pop out and say, Don't call me Shirley. Well, George Clooney should have asked for a rewrite. He's a good actor, but this made him look like he didn't read the script Before he agreed to direct."}, {"id": 263, "text": "I like Sci Fi, I was looking for Sci Fi. This is a drama, and a pretty good one. A little too long for its own good, but nevertheless a couple of hours well spent, some nice humour in there as well. Give it a go."}, {"id": 264, "text": "The Midnight Sky is a pretty average film. The plot is fairly simple; it does get slow sometimes, but I don't think it's slow enough to the point where you have to turn it off. The acting is okay, I wasn't really that impressed by any of the performances; every actor played a pretty laxed role, so I wasn't expecting any Oscar-worthy performances. What was impressive was the CGI. The Midnight Sky has some great visuals, and the cinematography was absolutely beautiful to watch at times.Overall, The Midnight Sky is a decent film. With an average plot, fair acting, and impressive visuals. The Midnight Sky is good enough for a viewing, but don't expect something mind-blowing, because The Midnight Sky is far from it."}, {"id": 265, "text": "Had so much expectations seeing Clooney again. Sad. Midnight Sky is a 2-hour venture into absolute boredom. You'd think in 2049, a spacecraft that travelled to Jupiter and back would have intelligent astronauts. Nope. These are more of the mopey dramatic ones who could not find their way back to Earth. You'd think Clooney had more intelligence on how to traverse from one Arctic satellite station to another, but no, he fell into every predictable catastrophic possibility there was. The movie droned on and on with a musical score that would have made you sleep, dragging your feet forever on ice til you get numb and not care anymore. It came to a point where i loudly asked, hey guys! Why aren't you arranging Iris to go to Aether??! You forgot the kid! Then, the punchline, the twist, brewing for so long, and then, the dust settles, and you ask yourself, how could I possibly care for these characters when they stole 2 hours of my life???If you still wanna watch it, keywords to the movie: Iris, Hyacinth, Aether looks like a flower, even the inside of the spacecraft looks more organic, fragility of life, losing loved ones, the Arctic desolate, no life forms, a baby on the way. Wrap your head around that, because Clooney wanted to convey that in this movie, but failed miserably, whatever it was he really wanted to say.And oh. Absolute cornball astronauts singing Sweet Caroline in the middle of the movie? I rest my case."}, {"id": 266, "text": "That's my first time to watch a new movie in Netflix, and give a review on here. First, I didn't know who the casts and director are, I just though it maybe an exciting sci-fi movie. It was hard to describe, but i love it. And, it was really warm and touching. By the way, JUST WATCH IT SERIOUSLY AND CAREFULLY. Then, you will find the point of that. Hope you guys can enjoy it."}, {"id": 267, "text": "How is it possible to make a scifi movie this boring. Nothing happens."}, {"id": 268, "text": "And that includes Plan 9 From Outer Space and Manos, the Hands of Fate. Whoever wrote the book who is credited here as Consulting Producer has not even a second grader's understanding of physics in outer space, space vehicles, how radio works, how you die from hypothermia in about 5 minutes after being dunked in freezing water for a minute and then come out on the ice with no way to get warm, that spacecrafts don't burn their engines all the time, how ridiculous it is that the commander would let two of the maybe last 4 living humans to abandon the spacecraft for certain death. That's just for starters. It was horrible, laughable and insulting to a child's intelligence. I'm going to have to watch Plan 9 now just to get this disaster out of my head. Why don't they have negative stars?"}, {"id": 269, "text": "The continuity between earth and space scenes is terrible. Plot is terrible. Lastly the crew members decide is more important to die on Earth than save human civilization. That was the most ludicrous decision of the whole movie.Acting, and visuals were OK but didn't make up for the terrible writing."}, {"id": 270, "text": "An unmitigated disaster of a film. Perhaps many people can float through the endless brutal flood of implausibilities given science ignorance in 2020 but then the story... is dreadful, laughably predictable, poorly depicted, one dimensional, strewn with unoriginal bits and pieces of sci-fi scenes that only poorly mimic their progenitors. The acting is soooo bad. Who'd fund this garbage? Oh, straight to Netflix is it? Say no more."}, {"id": 271, "text": "Whew...this is one slow, aimless movie. I had two other options to spend my time today. I could have pulled weeds in the yard, or I could have removed rocks lodged in the treads of my car tires. Either would have been or exciting. Even for a family friendly movie this is a dog."}, {"id": 272, "text": "If you like gloomy Clooney - think The American - this is for you. I know every movie can't be Oceans 11 but... Honestly this is two movies only tangentially related. The space part is alright. The earth part...meh."}, {"id": 273, "text": "I can't believe George Clooney, who I love, was part of this disaster. It couldn't be less interesting. There is no story what do ever. I was looking forward to this movie, a huge disappointment."}, {"id": 274, "text": "Was looking forward to this movie, seemed promising with a good line up.But then ... well, yet an other apocalyptic humanity ends story that drags on for ever without ever getting anywhere not explaining or really setting up the story or what's going on. Because of this lack of a backstory it is hard to evaluate how serious the situation actually is and get more emotionally involved rather than just be confused."}, {"id": 275, "text": "George Clooney is an amazing actor, and almost all of his films are outstanding. This unfortunately is not one of them. The media reviews are glowing thanks to Clooney, but the film itself is tedious at best. The plot is obvious, the narrative is disjointed and the acting forgettable. The special effects are good but we've seen them all before. The actual science is just nonsense (we need a more powerful antenna!). There is really no reason to waste your time on this."}, {"id": 276, "text": "If you are expecting a sci-fi movie then this is not for you. Yes, the pace might be a little bit slow but this is drama, it delivers is a strong message and it is very clear."}, {"id": 277, "text": "I've been waiting for this movie for 1 month and when I watched it, it disappointed me.The movie goes very slowly and bores people. There are too many logic mistakes. I had a hard time understanding what was happening when the movie ended."}, {"id": 278, "text": "The cinematography is beautiful, the CG is fantastic. The acting is good. And even though it's derivative and predictable, the story is enjoyable enough. (It helps that it stars George Clooney.) It's easy watching because we've all seen it before. None of the surprises are surprising.If you're looking for a film about space, or with any of the science explained (from space travel to the environment), this is definitely not it. A comfy sofa and a hefty suspension of disbelief is needed to enjoy this one."}, {"id": 279, "text": "An average movie, with a couple of good moments but overall meh. I was left surprised and disappointed by the ending. What's the point of saving 2 people when in the end, there's no hope for them to repopulate the new planet."}, {"id": 280, "text": "This movie takes forever to go literally nowhere. I guess it's trying to seem deep, but it's just so incredibly dull."}, {"id": 281, "text": "And a beautiful soundtrack to go along. I'm surprised to see the negative reviews here. I thought the story was compelling. The visual effects are frame-on-the-wall gorgeous. Yes, there are flaws in some science aspects. Just roll with it and enjoy the story."}, {"id": 282, "text": "While some suspending of reality is required to watch almost any movie, there is only so much you can put up. Only way to make this movie watchable would be while dropping acid as only then would anything make sense."}, {"id": 283, "text": "I like this movie. But...if you're looking for action this is not it. This movie is for realists. The story is not the happy ending you think you need. But it gives a look to the future humans must consider. Like the very early explorers that dared to leave dry land and colonize a different island. Eventually, we need to use science and leave Earth if our species will make the next step in our evolution. The movie follow general science. But embellished the exoplanet, supposedly able to orbit Jupiter. If I recall, Jupiter has lots of radiation around it, so some sort of magnetic field would have to exixt on the moon they've supposedly discovered there around 2050. Another clarification is that exo planets basically means outside our solar system. If you can set these things aside, you can dream a bit about being an astronaut. A field that would have to grapple with loneliness and the ways to overcome it, which this movie points to..."}, {"id": 284, "text": "I so wish that they could get some original stories made into movies. This film was very well executed, BUT, the story was tired, the effects were nothing to get excited about, the ending was yawn/senseless, the premise was left completely unexplained. I do not want to give any spoilers, so I will leave it at that. It was an enjoyable watch but afterwards we were left with not much of an impression."}, {"id": 285, "text": "Ok, first off, this movie was way way way too long... you get the point it is all about oh poor us we are killing the planet in the first five minutes... much less bore you with it for two plus hours. People, they been saying we going to die from climate change since the 60's, oh, then we had a mini ice age lol... we did not die then and we are not now lol. The planet changes naturally from the magnetic poles shifting and our shield that shifts with it, not a darn thing we as man could do about it if we wanted to.Interesting fact for ya, one volcano spews more into the atmosphere in one explosion than all the car's on the planet in a year, get it... not to mention the natural methane and natural gas leaching from the earth lol. yes we should make plastic that degrades in five years and yes we can do it lol. yes there are things we should do, but not eating meat and stop flying and driving cars etc it just moron's trying to scare you lol.Clooney did good job, probably his best in while but even he looked bored as chit half the time lol... I mean mind numbing boring for two hours lol.Do yourself a favor, save your money and wait for video release. Nothing new here at all...."}, {"id": 286, "text": "What little dialogue existed was dull, boring, slow and didn't do anything to explain what was going on. Visually it was appealing. Don't waste your time on this movie."}, {"id": 287, "text": "We wanted to like it but what a disappointment! It felt self-indulgent, pointless, boring and generally made no sense. Why Clooney didn't immediately freeze solid after being dunked in water during a blizzard was incredulous. The long pauses during sparse dialog were insufferable. The meandering pace of the film was tortuous. Such a waste."}, {"id": 288, "text": "An absolutely beautiful and emotional movie that gives a picture of destruction and rebirth. This is not Star Wars all Space Troopers, it is an intelligent and spiritual film about humanity, space, and mistakes that we all do with the little time we have while present on this plant. Well done ... watch it with an open mind and heart."}, {"id": 289, "text": "How did he survive swimming icy waters. Good Fx tho. I could say more not worth anymore of my time. Waste of premise."}, {"id": 290, "text": "The Midnight Sky is a thrilling adventure with some drama added here, all of the cast give an amazing perfomance, the action is amazing, just one problem in here is the CGI, there are two scene who have a very bad CGI, especially the K-23 planet who have been model like a candy planet, the ending CGI scene is little bit messed up too, but i really like how George Clooney make the camera shot so simple but good, overall The Midnight Sky still have a lot of great moments, still have an intention, still have a great twist and i really like how they introduce that, i highly recommended"}, {"id": 291, "text": "It was beautifully photographed and framed. And points to George Clooney for willing to be a grumpy, old, not very handsome guy. That being said it was confusing because, among other things, the guy playing young Augustine was not very convincing as young George Clooney. Took me a while to figure out what was going on there. The inside of the Aether looked, in places, like the inside of the TARDIS a couple of iterations ago. All that kind of lacy structural work. They started out with a crew of five, and two of them are going to fly it back to Jupiter? This is an *everybody dies* movie for sure. I really wanted to like the film, but other than killing a couple of hours, it was really not worth the hype. I'm *very* happy I saw it on Netflix and didn't pop for a movie theater."}, {"id": 292, "text": "I do not understand the negative reviews. This was a very good movie. It touched on real issues of love, loss, regret, but more so environmental destruction and human space exploration as a possible savior for mankind. The story was told through the prism of the main characters being sisters, fathers, husbands, expectant mothers; all charged with the task of saving the future of humanity. For me It was suspenseful, edge of your seat suspenseful and not boring at all. I enjoyed every minute of it."}, {"id": 293, "text": "This is not about action or the events on earth, it' about a man. 80% of the critics/comments miss the point.This is not a classic disaster movie, no one will save us. This is the journey of a visionary man. And we will watch his last moments on earth.If you are seeking an action movie, this is not for you. There is some events during the movie, but this is not the point.Acting, script, pictures, ost, dialogues are really good.i am more an action movie watcher, but not this time. This movie is moving and the end is very hard on is own way.George Clooney done an amazing job."}, {"id": 294, "text": "Kind of reminds me of Solaris, and not in a good way. The video, tone and actors are all very watchable. The story - not so much. Too many issues remain obscure or just off. Near the end when the ship heads back to the new planet, two people are not enough to survive and they would know that. Also, a brief mention of an earth exodus? Did they go underground? A colony ship to the new planet? What happened to them where did they go? WTF? It seems the writers just did not have a story."}, {"id": 295, "text": "Plodding, boring, pointless. Only reason it got green lighted was for COVID boredom, and this was no better."}, {"id": 296, "text": "Slow and boring! What was the point? Could not stay awake. Sorry your review is too short."}, {"id": 297, "text": "The CGI is great, but aside from that, there is very little substance. Seems like there was even a pretty good story line, but they didn't take advantage of it. Frustrating to watch"}, {"id": 298, "text": "WAY TOO MUCH drama, WAY TOO LITTLE plausibility. Best hope for a spaceship is to hang in orbit for a few years. I would shoot anybody abandoning ship and taking 1/2 of my shuttles. What if remaining shuttle was damaged? A woman would need to make 10 babies to restart civilization. Any place you go that cannot have you easily planting plants and herding animals and breathing free oxygen, you are fracked."}, {"id": 299, "text": "Not really a story line going on. Had potential to be good. I'm giving this a 3 star purely because it's Christmas. The movie is currently still on as write this but I'm confident it's going to be terrible until the end."}, {"id": 300, "text": "This movie is well filmed, good SFX, actings good. But the story makes no sense at all. Why did everybody on earth know what was going to happen but didn't they warn the space station (they had time to evacuate north-pole) A habitable, yet undiscovered, moon of Jupiter? Come on! Why was the entire earth destroyed? And then all the fysical impossibilities."}, {"id": 301, "text": "Dont watch, 2 hours of my life i wont get back. There is no redeeming aspect to this movie, the worst thing is that it could have been good. Plenty of budget, great cast. But no story at all. Well a touch of one.. But not worth it."}, {"id": 302, "text": "The plot has holes that are so amateurlly covered, some things dont make any sense at all and it is generally a poor effort by Clooney"}, {"id": 303, "text": "Despite its excellent scenic views of space, the ship, that moon of Jupiter, the Arctic, this, for me, was not enough. I tried to stop watching this movie twice. I kept thinking maybe if I stick it out, it'll get better. I'll find out why this and why that. I'd try to cope with the snail-like pace, because how could a George Clooney movie ever be a dud? Well, they threw in a few predictable tragedies on top of the main tragedy, to retain viewer interest. There could have been even more of these, but that might have sped things up too much..... Anyway, I got to the end and finally was able to put two and two together. I still feel, though, that I must have missed a lot along the way. Maybe I should try and sit through the whole thing again to better understand the first part of the movie, utilizing what I've learned from the ending. Now that I think of it, I don't remember being this confused after seeing a film since I first saw 2001 a Space Odyssey. With that movie, though, I really wanted to investigate its secrets. I really don't with this one."}, {"id": 304, "text": "So mind numbingly pointless. It could have been something but alas, it was not."}, {"id": 305, "text": "As much as I tried to get interested in this movie it simply wasn't possible. There wasn't enough background on any of the characters that made them worth caring about and as good as the visual effects were they couldn't make up for the draggy storyline."}, {"id": 306, "text": "There is no real connection with the crew. Half way through I was wanting the movie to end. It's not exciting and the usual stuff to go wrong and cause issues goes wrong and causes issues."}, {"id": 307, "text": "Acting was great, special effects were great but no idea what was going on until the end of the movie, story line was awful."}, {"id": 308, "text": "The Midnight Sky is a perfectly fine film to put on in front of the family and watch. It's a run of the mill science fiction film with a human story at the centre, with a few twists and turns.........although it does have a strange ending.Acting or story are not the main positives of this film, I would say that the directing by George Clooney is the standout part of the film. That with the great cinematography and CGI the film does look very very good. It does have a more realistic/grounded feel to it, like this could happen someday. It helps you, as an audience member, buy into the films story more and what is going on. Sometimes science fiction films like this can just now and then feel a little too far fetched, this one keeps a good balance between realism and over dramatic scenes. Thankfully the film does also have great pace to it and to be honest the 2 hours flew by for me, which was a relief due to a few reasons. So for me its more the technical side of things that are the standout in this film.Negatives. There is a weak attempt on back story for Clooney's character however none whatsoever for the space crew. I think a bit of backstory on them would have helped to gravitate towards their characters more and actually care about them. For example when one of the crew dies, I didn't care at all because I had no emotional connection to the character. Also I still don't know why the Earth was in such bad shape, I'm assuming something nuclear linked as there was a lot of radiation around. Lastly and probably the worst is The Twist which I thought was so over done and just plainly boring!!! It wasn't anything I haven't seen before and was quite obvious as the film went on. Coupled that together with the jarring ending, its as if the film just ran out of ideas and ended...........is it me or was that a really unsatisfying ending ???Overall this film is a meat and potatoes kind of science fiction film, there is nothing terrible about it but there isn't anything that good about it either. I'm being generous here I thought it was ok/average 65% out of 100. The cast is absolutely fine and does its job well, they are all good actors so I didn't expect anything else. The biggest problem for this film is there are just so many better films like this already......Interstellar, The Martian, Ad Astra etc...... I just don't see myself ever watching this again. Saying that it could have been worse, however it should have been a lot lot better."}, {"id": 309, "text": "Intimate movie full of emotion, great actors excellent direction and perfect screenplay"}, {"id": 310, "text": "Way to drawn out movie that never solves anything in the end. We never know what happened to earth, never know what happened to the two who came back, and bleakly watch two people with a baby on the way about the head back to a moon where they're apparently start to recreate a society of inbreds??!!So many pointless scenes just pasted together. I hit the forward button during several scenes five or six times to still see people doing absolutely nothing.And the doc just abandoned his daughter without a care, to focus on work, but then didn't have the stones to apologize to her when he finally got the chance?The journey across the Arctic was frought with disaster and they (he) never would've stood a chance to survive.Just too many holes to make it enjoyable over such a laughably long amount of time with nothing really happening."}, {"id": 311, "text": "It started with promise. However, after the movie had ended. I felt more like I've watched a YouTube channel of one moaving his lawn."}, {"id": 312, "text": "I wanted to like this movie. I'm not a Clooney fan but I am a fan of these types of movies. But this disappoints on several levels. It is very slow. That doesn't always bother me IF in the end it actually goes somewhere. This movie never really does. And there were many unanswered questions in this movie. First, what happened to destroy the earth? Why were the people leaving the Antarctic if the earth had become uninhabitable and the people elsewhere were dead and/or dying? Later in the move, more plot holes... Why did two of the crew choose to go back to an earth where virtually everyone was dead or dying and had become uninhabitable? And how on earth were the the two remaining crew members suppose to populate that new planet they were going back to? She is pregnant, yes. But even if they had more kids there would be no one for them to repopulate with outside of incest and that is, well, gross. So one day the parents will die, the kids will grow old and die and that will be that. And how are two crew members supposed to handle navigating that space ship where previously it took a crew of five? And the final straw? That weird ending where the last two crew members robotically push buttons as the credits roll. Ugh! All in all, a waste of a movie with no real point and a waste of time for the viewer."}, {"id": 313, "text": "Nice texture. I made it through 15-minutes. See if you can do 30. Good luck. Come back."}, {"id": 314, "text": "Like Gravity, the science here is so ludicrous that the entire story is absurd. At least Gravity was entertaining. This was not. Don't waste your time."}, {"id": 315, "text": "In space no one can hear you yawn. If you saw the trailer you got more excitement. George Clooney is such a great guy, can't believe he directed this. Blame the writers and everyone else I guess. If you MUST see the movie you can literally skip to 1:30 and not miss anything. Have fun."}, {"id": 316, "text": "This is a horribly punishing movie. You really just start to hope they die so it will just end. Insipid is too generous. It's like they had a bunch of stuff cut out of other scripts and tried to hobble it together."}, {"id": 317, "text": "Four years off has obviously been way too long. The hopeless, patent nihilism of this film leaves the audience with a terrible sinking feeling. The reference to On the Beach in the beginning of the film is no accident. Yikes."}, {"id": 318, "text": "If you buy the rights of a $2.99 novel in a garage sale, hire a $10 million actor and produce the movie, you will get a ...$2.99 movie. Load of cliches and a lame ending. This movie is a sleeping pill, if you can't sleep, just press PLAY and there you go."}, {"id": 319, "text": "Whomever the writer is of this film, should never be used again. Honestly shows absolutely no idea about even the most basic concepts of science, common sense or how to capture an audience.There are so many plot holes I have no idea how it got to be made. The actors did well given the script, and a lot of the scenery was brilliant. But the story let this down so badly, I really would not recommend it to anybody to watch."}, {"id": 320, "text": "There's no plot, nothing interesting. Just play it and go to sleep."}, {"id": 321, "text": "Don't waste your time. This wouldn't even pass for a B rated scifi."}, {"id": 322, "text": "Greetings, I would like to begin by saying that I am by no means a huge fan of G. Clooney, however in this movie he made a good performance, playing a lone survivor in a remote Observatory, tasked with a mission of saving more than one life.The interesting thing about this film, is that it is not really a Sci Fi, however it is a drama wrapped into it. A story of a man, who chose passion and career over family life, offers a road of redemption.It is a mashup of different unrelated movies - The Road, Flipped, Solaris. I get vibes from all three movies. I think the director might have been inspired by them partially.It's a good movie to watch. It should be rated above 7."}, {"id": 323, "text": "I would really advise: don't bother. Script boring, acting boring, all is boring, very little happens, and I only got through the film with fast-forward button times three!The producers wasted a lot of money for something very uninteresting. Pity."}, {"id": 324, "text": "Actually very disappointed... all scenes with Clooney was ok I thought it will happen something. All those people in orbit they were just nothing."}, {"id": 325, "text": "Another slow apocalyptic movie with people making dumb decisions and plot holes piling up. Ok to watch once and never again."}, {"id": 326, "text": "Be an ok film if 30 mins shorter! Ideal to put on when you can't sleep, you'll be in the land of dreams in quarter of an hour"}, {"id": 327, "text": "Intelligent movies don't appeal to the shallow. If your a thinker you will like this movie."}, {"id": 328, "text": "If the oligarchs want to keep us in our homes when we are not working, they better come up with better movies then this....TERRIBLE!"}, {"id": 329, "text": "I waited for this. It had George Clooney, who I think is a marvellous actor, and I had high hopes. I was wrong. It's a long time since I was quite so bored by a movie as I was by this one. There was a good deal of pointlessness, irrelevant side issues, old stuff redone less well (Gravity), and character stupidity/selfishness. All in all it was a depressing and pointless addition to the genre. Two hours of my life wasted. Sometimes I resent the movie industry for the life it stole from me. This made me promise myself to be more discerning."}, {"id": 330, "text": "Well acted but desperately boring. I reached the point of not caring what happens to the characters."}, {"id": 331, "text": "It was really boring. The first hour is slow, then a little action, then another hour nothing. I was thinking about the meaning of this movie, and I realized that there is no meaning. If you can't sleep, this is your cure. You're welcome"}, {"id": 332, "text": "Was excited to see this, but there was zero storyline. Good thing it was free on Netflix Terrible."}, {"id": 333, "text": "Dystopian atmosphere is of course a cliché but the plot twist is awesome, i didn't see that coming."}, {"id": 334, "text": "This is possibly the WORST movie I have ever tried to watch. Even worse than Sausage Party - need I say more? George Clooney is a sad excuse for an actor thinkin' he was hot spit when he left ER for bigger and better things. This clown hasn't done anything for his acting career and this movie doesn't change that. Avoid at all costs."}, {"id": 335, "text": "A thoroughly depressing story, which leaves much to the interpretation of the audience. Some good technical work, with space walk scenes produced effectively. Not one to watch to escape pandemic gloom..."}, {"id": 336, "text": "You're a lousy actor too, you shouldn't have tried it as a director."}, {"id": 337, "text": "This movie was dragged out and boring I mean I still don't know what the hell was going on except George Clooney was hallucinating and some people were in space ship heading on a round trip from one of Jupiter's moons this movie made me want beat my head against the wall"}, {"id": 338, "text": "This movie is a prime example that having a good cast and a good director does not guarantee a good result. The movie is boring without essence and a poor story line."}, {"id": 339, "text": "This movie was dreadfully slow and boring. Fell asleep twice. Nothing to really draw you in and keep you there. George Clooney, please blow the dust off your career and try again."}, {"id": 340, "text": "Boring, boring, boring, boring. Reading this review 100 times over would be much more entertaining than watching this movie. Don't!"}, {"id": 341, "text": "This movie doesn't go anywhere, doesn't answers questions that they raise and ends up with no particular sense. I'm rating it as low as possible to balance the idiotic 10 stars votes that other people leave for no intelligent reason. This is a waste of money.. feed the poor and stop wasting money!"}, {"id": 342, "text": "This film is wayyyyyy too long. I just spent two hours watching and can't really tell what is this film telling. I don't understand the whole plot at all.George Clooney and the little girl part is not bad but the spaceship part of the story is just so boring.The film has like a total of 5 minutes of intense moment despite being a thriller film??? The intense scene is just like The Revenant and Gravity. Really. It just looks exactly like these two films. Other parts? Boring.TL;DR : Don't spend two hours on this boring sci-fi thing. Don't get tricked by it's trailer and poster."}, {"id": 343, "text": "But as science fiction it sucks. Lake Hazen can't talk back and forth to Jupiter without the 49 minute light delay. The drama is pointless. Its a hard slog like Solaris. Way to wring all the fun out of everything, George. Great science fiction is about mind expanding ideas, like the Twilight Zone. Planet of the Apes, 2001, even Transcendence, and Contact. If you want to make Dr. Zhivago, then let sci-fi alone, at least while Ridley Scott and Spielberg are around. And if you want to know how to spot a Philistine, look for the reviews that say, Ignore the bad reviews. People are so dumb."}, {"id": 344, "text": "Overall I love the idea, and I mostly enjoyed the movie, however I would have enjoyed it more had they cut out two pointlessly dramatic scenes. It was dramatic filler that added nothing to the plot, but rather distracted from the point of the movie.One of those scenes was so bad I almost turned off the movie. If they had consulted even one amateur survivalist they could have explained to the writers why that scene was so terrible.I liked the ending. Not as predictable as I thought it would be."}, {"id": 345, "text": "The acting felt forced. It had potential, but instead they focused in presenting a massive story in such a short time. It felt too rushed and scenes felt as if they were cut short; they produced a movie just for the sake of producing one, without giving it any love and attention. It would have been better off as a one season exclusive TV show."}, {"id": 346, "text": "Alot of drama without reason, predictable events and so on. Unrealistic in so many ways, we were hoping for a good sci-fi story but got something else, something less interesting. Like someone else said, a missed opportunity."}, {"id": 347, "text": "It was my desire, but my failure to certify a link between map is plot: the uniformity, and Batman &amp; Robin's The uniformity-plat mustn't be replicated.Plat and plot go together. Uniformity has its chronology, but, seeding a growth with map was the difficulty. In the overall, B &amp; R didn't get the right red head, but it did get the read one; I did a triangle, in the duration of watching The Midnight Sky, and the result was to get B &amp; R"}, {"id": 348, "text": "Its not as the bad as the reviews says.Its a good watch and at times it keeps you biting your nailes.For me its a 10/10."}, {"id": 349, "text": "It was so anemic that you wonder what happened to extraterrestrial living forms, planet invasions, life discoveries, space and time travel... Good old sci-fi! When did we all become so boring? Mix of 3 narratives, intercecating at end (not impressed), no explanation whatsoever for the earth disaster (c'mon feed me some fantasy here), only 4-5 crew members at large on a mega-huge spaceship that barely seem to work but only pass time in their souvenir capsules with they're loved ones, constantly making a point for their time away from home. A grunting beardy remorseful George C. constantly dreaming of his ex, going on a small adventure with this kid in the snowing antartica wearing very fashionable parkas (you'll get a price tag if you Google them) to find a working antenna to establish contact... God I'm bored. Also the kid doesn't talk. Obviously. Anyway, the kid is his daughter, whom is at the same time on the spaceship (yes that's the intercecating plot twist at the end). Did I mention one member of the crew dies because of a meteor shower while on a spacewalk? I mean did anyone even try? It's about 2 hours and I counted about 6-7 sentences in total... Typical new age 'no explanation needed it's all in the message' sci-fi movie. I just opened an account to write this review. I could go on forever underlining every mistake in this film. Also they use some modern terminology 'hey we could print this spaceship piece' OK we get it you acknowledged 3D printing is a thing. Alright that's it :) Joe"}, {"id": 350, "text": "I am able to suspend my disbelief about the space travel and the technology of the vessel. (You would have thought a little warning system for space debris would have been a good idea.) That is fun, but the Arctic scenes are ridiculous.I was confused half the time. Then just for good measure, we get scenes from multiple other movies, from Jack London to Ron Howard.Finally, Sweet Caroline makes me think of the Red Sox, and I hate the Red Sox."}, {"id": 351, "text": "Poor poor. Can't look at these, why is this done? I expect better."}, {"id": 352, "text": "Give this one a miss. Man alone in Article station. Finds a little girl. Too bad the little girl could not speak, I was hoping she would say REDRUM and this film would morph into a Stephen King movie."}, {"id": 353, "text": "So the high ratings, or many of them seem to be from people praising the film for its inspirational lessons on how we should not be materialistic, the environment is vitally important etc etcMAYBE its a good reminder of such thingsas entertainment though it sucked I found the whole film quite drawn out and boring even with a very good performance from Cloony at its core! It wasn't even a good drama with the characters seemingly just accepting the (unexplained) death of the earth with really very little emotion at all !!As a sci fi it was riddled with inaccuracies, not the least of which was the whole central theme of the astronauts turning around and going back to colonise the imaginary moon ..... with a genetic seed stock of one woman, her unborn child, and her boyfriend !!! ... Vert Adam and Eve but scientifically un viable!"}, {"id": 354, "text": "Despite a decent premise, good cast and some truly excellent visuals this is a real snoozefest. It's so tedious in places and so painfully predictable, with the genuine tension at the start dissipating after about half an hour as the film slides into oblivion alongside Earth itself."}, {"id": 355, "text": "First and foremost, the movie almost lost me early due to the absolutely awful science it features: we discovered a new moon of Jupiter large enough to sustain life. Not possible. Apparently asteroids are stationary as well. AND they never explained the cataclysm which created the entire plot device. Doing some scientific research was clearly too much work for the writers. Speaking of the writing: the dialog was epically lazy. They clearly stole the score from interstellar and even the plot twist was super predictable. This is a bad movie."}, {"id": 356, "text": "Boring and pointless, could have added a lot more to this movie to make a little more exciting waste of time!"}, {"id": 357, "text": "My introduction to Neil Diamond's Sweet Caroline came the hard way. I used to work at Godfather's Pizza as a teenager (I worked there a lot, close to 40 hours a week because I didn't go to school anyways and a job was relative freedom for me ). On the weekends, two pleasantly plump females used to come in to eat from the salad bar during the daytime, and they played Sweet Caroline over and over on the jukebox. I prefer to remember it that way.I thought the movie sucked pretty badly, and I am not sure why George Clooney made it, except to acknowledge the end of the world because it was just a bunch of lazy predictable cliches mashed together until it finally delivered on it's end of the world promise, which I suppose is something. It didn't try to squirm out of the end of the world. My favorite scene was the end credits. The little girl was cute."}, {"id": 358, "text": "So the Earth is largely uninhabitable, ecologically unviable for sustaining human life,a team of scouts looking for a new Earth are returning to Earth, little do they know, returning to Earth will kill them. Someone wants to tell them to go back their 'new' Earth before its too late. Throw in a space storm which nearly kills them all , great special effects. That some one who wants to warn the scouts not to return to is nearly dead due to failing kidneys, he's trapped in the arctic, survival chances minimal, he's doomed, he has to transmit a signal to the new earth scouts not to come back, he kinda does, he has the company of a child during his last ditch arctic adventure to find a way of communicating with the new earth scouts, she's doomed too - Nearly everyone dies, we're left with a new Adam and Eve, diversity rules, ok? On a perilous space mission to turn their ship around and begin populating a new Earth. Depressing, boring and irrelevant, why was this movie made? God knows!"}, {"id": 359, "text": "What a missed opportunity. Dear George, when you make such a film, think of your viewers. Ask real scientists if it is possible. I understand that you can do a lot in a film, but in these genres a little more effort is in order. And seriously? The Noob must die and not the pregnant woman? Of course. And what I think is the worst; Every inhabitant of the earth is dead. Crew: oh okay. How does the film making process actually work? Surely more people see this when the film is made? Raise the bar a little higher. This is real; That will do"}, {"id": 360, "text": "I don't write reviews. Ever. But I've been attempting to like George Clooney for 20 years...this movie is my last attempt at watching him. This sucks. Period."}, {"id": 361, "text": "I'm an hour and a 1/2 into this movie, and it's really really slow. I thought with George Clooney and my favorite Actor Kyle Chandler it would definitely be worth watching, but I was sadly mistaken. Skip it. Boring as heck and the story lines a little hard to follow.. its disconnected..."}, {"id": 362, "text": "So many unanswered questions - 1. What was the global event causing everyone leaving in helicopters? Where were they going? 2. How can one survive in the arctic after plunging into the ice cold waters and we here did he get another jacket? 3. How did he ever find the weather station after being turned around so much in white out conditionsThere is just too many questions that don't make sense in this movie.I do have to give credit for acting it was a 10 in my book as well as visual effects. The movie is a sci-fi drama and in some parts it does drag a bit."}, {"id": 363, "text": "Very disappointing dialogue and an even worse story line. The tone is cold, and we're not made to really care about the characters. But at the same time the film is overly sentimental. I hope when the world does end it won't be a sappy as this."}, {"id": 364, "text": "It's hard to believe people thought that this would be an entertaining movie. 2/3 of the movie is just dead time. It's boring, predictable, unoriginal, and did I say boring? Also suffers from the typical Netflix tropes; ex; must have mixed race couples, captain must be minority character, blablablaBarely watchable at 4x speed. Not recommended, maybe good for falling asleep."}, {"id": 365, "text": "I have waited, waited and waited but no... I dont know the book but the movie is sooo bad there is no runming story, whole story is torn, they tried to get the interstellar effect but end up with a cheap movie."}, {"id": 366, "text": "I added this move to my watch list on Netflix before its premiere because I was very interested in watching it after reading the description but...The film lasts 2 hours which is a big amount of time. It wouldn't be a problem if the movie wasn't so boring and dragged out. Some of the scenes forced me to use the 10 second skip button just so I know how it all ends.Although the movie starts really interesting and has this feel that it is something else, the more u watch it you start to get bored and it simply becomes harder to stay focused. Even scenes with some action didn't help to save it.I feel like the idea was very eye catching and really incredible but for me it was wasted. I really regret that this project ended poorly and I think that this story didn't need 2 hours."}, {"id": 367, "text": "Expected a bit more, but it was dissapointing. i have seen Clooney´s movies and now was far from better"}, {"id": 368, "text": "Watching this so-called film in broad daylight and perfectly fit condition maybe prevent you to fall asleep. Nothing, literally nothing happening. I saw an old man with frozen moustache, but I can't find Clooney...Good CGI for a video game."}, {"id": 369, "text": "I just watched about an hour of the film without knowing what it was about, I just thought well George Clooney is the main actor, so it must be good... No way! I couldn't finish it, it just goes nowhere and it's veeeeery slow."}, {"id": 370, "text": "Clooney is becoming so sentimental in his old age which isn't great for the rest of who have enjoyed his performances directed by others than himself. Firstly, the music is so intrusive ,flagging the viewer to feel a particular emotion at this or that point. He should have died within seconds of falling into the Arctic sea . The Sweet Caroline moment,.....No! Might have been a passable film with 20 minutes shaved off, mostly from the space walk."}, {"id": 371, "text": "So slooooooow it makes interstellar look like a race. Vague 'world ending' event that they can't even be bothered explaining. #lazy. Twist at the end was meh. 2 people going back to the planet to start a life? Why? It's 2 people - how can they repopulate? Lame."}, {"id": 372, "text": "Clooney is only good as a co star for any movie and for that movie not to suck there has to be at least 4 bigger stars in it like Pitt, Damon, etc. heck the little girl in this flick was a better actor than him. Stop directing and find those other great actors that made you watchable. 3 stars for the little girl who never spoke."}, {"id": 373, "text": "Prepare for a snooze fest. This was excruciatingly slow and a lot of nothing. Mainly, it needs some serious editing. Like the random Sweet Caroline musical interlude? Please. Not necessary. And I hate how it's basically two simultaneous stories in one. It would've been much better if it just focused on Clooney's angle... it would've shaved off about 30-45 minutes of nothing and been a much better film."}, {"id": 374, "text": "I waited long time until Netflix premiered today just to find this farce. NOTHING HAPPENS IN THIS MOVIE. George Clooney flooped big time with this. No characters development not even screenplay."}, {"id": 375, "text": "The Midnight Sky on Netflix is a beautifully shot, plotless, predictable, meandering two hour bore fest. I guessed the story 20 minutes in, confirmed with the plot summary on Wikipedia, and bailed after about an hour. It was supposed to be post apocalyptic sci fi but it's another movie pretending to be science fiction when it's just bad drama. A guy's perseverance against a difficult situation while reconciling with his past via flashback. It's cheap and gutless. Paint by numbers."}, {"id": 376, "text": "I woke up and the earth had gone ? Is there anybody out there ?"}, {"id": 377, "text": "Snorsville. The final frontier. These are the voyages of no plot line or actual story. It's mission: who knows? This movie is a real dumpster fire. How'd this get greenlit in the first place?"}, {"id": 378, "text": "Super slow, very slow, no vision to tie movie together. Lots of random scenes that didn't really seem to fit. Seem to start ok in first few minutes and went nowhere after. Like many of the actors in the movies but the adaptation was just bland."}, {"id": 379, "text": "Why does Hollywood think cancer is a great theme. I lasted 11 minutes. All he does is boring movies. Stick to tequila."}, {"id": 380, "text": "The acting is good, as a character study it's fine, the science is abysmal and ridiculous. Jupiter has a previously undiscovered habital earth size moon? All radio eminations on earth end in three weeks? Our dying hero needs to contact the returning space mission and warn them off, sure just stomp on the brakes and throw the ship in reverse? With idiotic contrivances like this it's no surprise it has many 1 star ratings."}, {"id": 381, "text": "This movie is the perfect choice, if you want to fall asleep during watching something."}, {"id": 382, "text": "This film links a number of dramatic scènes with no story or coördination. You have no Idea what is going on OR how it fits in the film. In the end nothing happens. Long periods with no dialogue just facial expressions and music."}, {"id": 383, "text": "With about 15 minutes left I just couldn't finish watching this aimless, slow boring mess of a movie. Movies are supposed to hold your attention...this didn't not at all. I found myself reaching for my iPad to check Twitter or other websites through out the whole movie. It's seemed like it had no overall direction and by the time I got close to the end I really didn't care about the outcome of any of the characters"}, {"id": 384, "text": "The CGI looks great in Dolby Atmos but that's about it. A stretched-out tale that doesn't really go anywhere and is quite slow paced. Not terrible by any means, but not much to recommend it, either."}, {"id": 385, "text": "Heartfelt performances, great cinematography and lighting, but let down by a story that just doesn't gel."}, {"id": 386, "text": "I'm starting to think Netflix is investing in 5-10 person casts for a whole movie to keep costs low and keep cranking out the same, dull, storylines with decent visual effects. I can't say the acting in this movie was bad because there was hardly any legitimate dialog. Don't waste your time."}, {"id": 387, "text": "You know those kind of shows where the story is about the mafia or bank robbers or in this case apocalypse but then the pretentious dull and too-smart writer says how this story is REALLY about relationships and love and growing up or whatever. And it makes you throw up just a little tiny bit from all the pretentious BS. Perhaps 1% of films or shows can actually claim that they succeeded at that, a captivating and good insight into human psyche. Sopranos for example. Excellent show all around, the mob part and the human part. But the problem is that everyone thinks they can do that. This is prime example of that. Its simply kinda bland and predictable but at least if nothing else, it manages to look good. But that cannot be enough. All in all too long, too boringly predictable, too empty shell of a movie from yet another overzealous director who thinks hes so smart when in truth he made just a long boring a5s movie."}, {"id": 388, "text": "I could not engage at all with this one. Slow, makes snails look like greyhounds. Could not see a plot emerging. Gave up about 25 mins in."}, {"id": 389, "text": "Its seems space movies, or sagas if you wish have taken on this very artfull approach to story telling. Its good acting, averag edirecting but a story with no real meanining drawn out to almost 2 hours of waiting for the pounch line.. but then ... nothing. Reminded me a boit of Solaris. Go and make an exciting movie about an adventure, with a good meaning full story, that actually makes sence to someone other than just the director...."}, {"id": 390, "text": "SOOOO slow. The acting was good, the CGI was great but unfortunately the plot and script didn't do the actors any favors. Trailer made it seem like it was an action movie but it's really not."}, {"id": 391, "text": "Not much of a story. Too much vagueness. Poor script. Terrible direction. A waste of time. Clooney painfully drags out every scene."}, {"id": 392, "text": "I watched it because of George. The movie drags on forever with pointless dialogue and meaningless filler scenes.. You pretty much know the whole movie after watching the first 15 minutes then you just sit through the rest hoping that somehow it's going to get better, it never does. If you have 2 hours to completely waste or need a sleep aid - go for it."}, {"id": 393, "text": "What diabolical trash. Hubris in the extreme. If you want to understand dementia watch this film as it plays every cheap trick in the book: the enigmatic girl; the inexplicable event; the vacuous crew who we see straight through and are left gawking at the bad acting. Even the sets are cheap and based on cellular. It's horrifying that millions might watch this."}, {"id": 394, "text": "That movie didnt make any sence, the worst movie ever!"}, {"id": 395, "text": "One hellva boring film. Sorry Mr Clooney you were very self indulgent. I was bored and kept waiting for something exciting to happen. Alas nothing happened. Just a series of bland and uneventful scenes with some really dull characters. This film is like a number so called 'sci-fi' movies that just lack any real drama or meaning and just end up navel gazing. It reminded me of another time wasting one called Ad Astra starring Brad Pit. What has happened to sci-fi these days. The 70s 80s and even 90s were so good :-("}, {"id": 396, "text": "Slower than maple syrup. This is one of the worst movies I have ever seen.. I'm 72 and this is worst than, The Thin Red Line. Don't even bother!"}, {"id": 397, "text": "George and the little girl should have died of hypothermia or at least drowned, but didn't. The space walk by the ship crew was a filler, added nothing to the story and the two dudes who took the pod turned their back on mankind when they decided not to propagate the human race. There were so many holes in the plot that a Mack truck could have driven through. I guess Netflix paid you a lot of money but it was a total waste. It really helps to be an icon doesn't it."}, {"id": 398, "text": "Slow and boring and you can't follow what's going on half the time. I never thought George was much of an actor and this movie hasn't changed my mind."}, {"id": 399, "text": "-out of 22!Here's the thing: this is good but, yeah, not great.However! It IS an End of the World movie with GEORGE CLOONEY and FELICITY JONES! -Sure, the same thing is going on right outside your window, but at least these people are attractive, right?!All I'm saying is: there are worse ways to ride out how little time we all have left.Merry Christmas"}, {"id": 400, "text": "The movie invests significant time developing characters you just don't care about. I skipped scene after scene trying to get to the point of the story (which I rarely do). But I did enjoy the visual effects and the costumes."}, {"id": 401, "text": "Another awful movie about the end of the world that gets almost every premise wrong and it's scientifically illiterate, I don't understand why they bother in making things like these, they're predictable, boring and nothing new to offer.Some people say here that it's a drama, if it is, it's a terrible one because it's predictable and boring, it's not a sci-fi because it gets everything wrong, there's the sense that these type of movies are made to meet a quota, nobody cares for quality or originality."}, {"id": 402, "text": "I won't pick it apart. It's not worth it. Derivative. Souless. Uninteresting. DEPRESSING!It's not as if our collective year was brimming with such joy that we needed a downer of a movie to bring us back to reality. The timing alone of this film makes it trash-worthy.George has lost his muse, I fear."}, {"id": 403, "text": "I loved all the actors in this movie which was my primary motivation but 20mins in its evident that the movie is not going to follow a plot or story line that is going to make 99.9% of us happy. It is filmed beautifully and acted very well. The movie has a rhythm which is even all the way through and no real highs and lows. There are only 2 really important factors in this movie that need real focus. The little girl and George Clooney's current location. I did have to think about for a bit after the movie ended but I think I got the message from the movie. One mans hope for the future will end up being one girls salvation though he will never be able to truly let her know the importance they have both had in each others life."}, {"id": 404, "text": "I can't express any more than what I wrote in the subject. The visuals .... were nice."}, {"id": 405, "text": "Just people mumbling about... nothing... no message delivered what so ever.. trying to be Gravity, Martian, Interstellar, but in my language it is called trying to catch smokes. Avoid this film, you've been warned"}, {"id": 406, "text": "Theme of the movie has promise but it never goes anywhere. Has good set of actors but their talent is wasted. Technically it is a very good movie...Cinematography / Special effects etc are very good. The movie leaves too many questions unanswered....makes you wonder if this is intentional or just bad narration?"}, {"id": 407, "text": "Long, and unnecessary. The science is way off. So, sciency fiction more like a fantasy. Nice visuals and decent acting. A crap gift for Xmas!"}, {"id": 408, "text": "Cloony is a tree hugger. A save the planet guy. Which is fine. The planet needs some fixing. But I don't like it when a filmmaker sneaks his issues in on me in the guise of a sci-fi film. You sly old devil Cloony... There's a lot of things wrong with this film and that is just the start. Haven't read the book so don't know if Cloony's vision of a movie about the effects of environment on earth mirror the author's but Cloony's name is on the film. The beginning is messy. Unclear. When a viewer spends the first half of the movie trying to figure out who's who or connected in real time vs flashback, it's a major distraction and the viewer (me at least) feels like I'm running alongside a train on the move and trying to hop on it. Well-done segues between present/past should have me on the train already. Then there's the fact that all the characters have more information than the viewer and they are being very stingy with it. In order for the viewer to become immersed in the emotional sequences we have to UNDERSTAND what's happening at least on the same level as the characters! Cloony doesn't give us enough to work with. Got to drag the info out to the very end and by then it's too late. All I see are flaws and am NOT invested in the characters. It's a very dark movie with no real hope for the people of earth. But then, that's Cloony's not so subtle message isn't it? Change our ways to protect our environment or THIS is where we're gonna end up? Got it. And did he intend for two of the important pieces of the future--two of the space crew--their return to earth knowing there is no hope to be read as a sign of our human connection to the people we love (go home and die with them) or the act of selfishness it ultimately is? Two go back to earth, one dies in space whittling a skimpy crew to start with down to 2 persons to what--start a new population on the new pseudo earth they found and return to? Two people? It would have served their ultimate sense of duty best and said more about self-sacrifice if those two who returned to earth had stayed on board and been a part of the solution and future of humanity. Are we supposed to feel sorry for Cloony's character for having misspent his life? And when he could have told his adult child he was her father, he denied her that. Oh, sure, HE got something out of knowing he was in radio communication with his daughter, but honestly he didn't deserve to have that knowledge but she did. I don't sympathize with Cloony's character. Didn't like him. The ONLY thing he apparently did right in his lifetime was find the new home for humanity but he gets no pats on the back from me. And, the baddest cliche of numerous ones (like the feel good minutes with everyone singing sweet caroline seconds before disaster and death) is Cloony's character introduced as a dying man so of course in the first minutes of the film we know he's not gonna survive. Boo hoo. There seems to be the agonizing cliche where in a book or film when a man has lost is his wife or family you can bet the bank that he's gonna give plumb his resources and find the impossible solutions then just ... die. So aside from that, the visuals were nice. Rest of the characters were nice. I'm not a techie person but that seemed like a humongous space ship for just 5 people to support. And honestly, I would have liked more information about what happened on earth to put the characters where they were in the beginning. I'm sure glad I didn't pay to rent this movie. I sure won't buy it."}, {"id": 409, "text": "The entire movie, the point of this entire depressing production, is made clear when Clooney's character speaks one line about taking care of our planet. Yeah, thanks George. Science Fiction books and movies used to get use excited about the future. Excited to innovate, build, explore, take risks, be adventurous and explore the wonders of the universe. So tired of all these depressing dystopian movies / warnings / whatever. All this movie talent, all that money, and when Midnight Sky is not boring, it is unrealistic and cliché."}, {"id": 410, "text": "Predictable, boring, good music and that's all.This review needs to be at least 30 characters long."}, {"id": 411, "text": "Apocalyptic climate disaster film without blaming anyone for a change, but full of hollywood 'social agenda' rubbish, and a lot of utterly inaccurate science. The Intersteller makers hired Nobel winning Physicist Kip Thorne, and he made the film realistic to the average viewer, and reasonable to viewers who know some Physics. I guess Hollywood people like Clooney still think most people are as dumb as they are about the real world and about physics in general. So many times in the movie any reasonably knowlegeable person would be saying 'what?' The characters did many seriously dumb things done, but many things they did are just not scientifically possible, and it was hard to ignore that - way too much."}, {"id": 412, "text": "When GC says to Brad Pitt  I have seen Ad Astra and I raise you This as the worst science fiction movie. The only up-side,, no space monkeys and space pirates."}, {"id": 413, "text": "This is a below average film definitely not a 10+ as someone has put. It is a sci fi drama,but very slow and no build up of characters. I gave it a 4,which was probably because I've seen a lot worse. I'm a sci fan and was a big George Clooney fan until I saw The American. Since then hes been a bit hit and miss,this was a miss. Story was thin like the Ice in one part of the film. Like someone else said why was the earth uninhabitable? I presume it was nuclear war,as I'm guessing George Clooney had radiation sickness. Where had the ship come from and where was it going. A bit silly in places, like where he swims in icey water and survives. I didn't really care after an hour, It's one of them films you wait for something to happen and it all comes together. Call it that eureka moment, it never happens and your left with that void like in space. I would avoid if I'm being honest no suspense,predictable and boring. I'm not a film writer producer,director but I could have done better for the budget.You've been WARNED AVOID!"}, {"id": 414, "text": "I was hoping for a good movie seeing george clooney. But I guess Hollywood has lost it's charm. It's all about computer graphics and hell with the story. Why do you need story when you have producers pouring money for visual effects."}, {"id": 415, "text": "The Midnight Sky sounds like it has an interesting storyline when you read the movies synopsis on Netflix. In the aftermath of a global catastrophe, a lone scientist in the Arctic races to contact a crew of astronauts with a warning not to return to earth.. This brief synopsis makes the movie sound like it's going to be story about a man who travels across the Arctic at the end of the world in order to warn a crew of astronauts who are returning home from a mission not to come back to earth but to instead turn back around and return to a newly discovered habitable planet in the hopes that the human race will survive through them.The movie doesn't know what it's trying to be it's basically a mash up of different genres. The first quarter of the movie is quiet and focuses on one character at the end of the world who ends up meeting a little girl who doesn't talk. Then by the half way point the movie turns into a survival thriller about a man and a little girl travelling across the Arctic fighting off wolves and surviving the cold. His trip across the Arctic takes only about twenty-five minutes making what was meant to be the whole point of the movie rushed and hardly touched upon. The third quarter of the movie takes place in space and suddenly the movie turns into Gravity by focusing on characters space walking trying to fix the spacecrafts communication array. Then in the final part of the movie it's just the characters deciding should we land on earth or go home they decide and after a very weak and pointless twist in the story the movie ends.This is meant to be a post apocalyptic movie where George Clooneys character is one of the last humans left alive on earth. The movie takes place in the Arctic and in space so we never see anywhere else on earth just snow and empty space that's it. So what ended the world you might be wondering well your guess is as good as mine because it's never explained or even touched upon once in the entire movie it's infuriating.There is very little character development throughout the entire movie by the time the credits role you know just as much about the movies characters as you did when the movie started. George Clooney is pretty much the only interesting thing about this movie he does give a great performance as a dying man at the end of the world but sadly that doesn't make the movie any better it just makes it tolerable to watch.There are some very nice looking shots of space which are again very similar to the movie Gravity but that's only for about twenty minutes of the movie the rest is just snow and cheap generic looking sets that make up the rooms in the spacecraft.I don't recommend watching this movie it's boring and uninteresting which is a shame because if it had a bigger budget and bit of script rewrite it could of been better but as is it's just enough cheap Netflix movie by a once good actor who lost his charm after Batman and Robin failed."}, {"id": 416, "text": "Omg Kill Me Already This Movie is A Complete Bore."}, {"id": 417, "text": "This movie just has too much grief; it feels like there is nothing but sadness and tragedy and for what purpose. Futuristic space exploration movies are often based on some kind of calamity on Earth, but this just keeps presenting doom. I watched it because I like Mr. Clooney and his work; this is not his best."}, {"id": 418, "text": "I like hard science fiction, so I wanted to like this. However, the implausibility of the events was so distracting that I couldn't get past it. Visually, it was well done. I figured out the family drama in the first 10 min, so that whole story line was utterly pointless."}, {"id": 419, "text": "I have seen this movie before - several times, however with more passion and far better storytelling and acting, including Clooney himself. I felt depressed after watching this movie, so at least it made some impression. The CGI doesn't help. Beauty is nothing without content. That said, some parts are pretty good - but the movie ends up in a meaningless void. The message is clear (e.g take care of our planet, meaning of life and so on) but not very convincing."}, {"id": 420, "text": "Just couldn't hold my attention, and the story was super obvious with thevlittle girl...even in the trailer. Clooney isn't hungry anymore either as an actor NOR a director. I never thought I'd ever say this but Brad Pitt skills as an actor have aged better than Clooney's"}, {"id": 421, "text": "I mean, why Clooney accepted this role? Tediously slow and pointless, and for my poor understanding of space, if you get hit by an asteroid and your suit is obviously in contact with the space vacuum, shouldn't you implode right away? Spend this almost 2 hours marathon in a better way!"}, {"id": 422, "text": "It was SO boring and directionless. No cohesion to the story, I didn't really care about anyone. It was just incredibly dull. I love Clooney, I am a huge fan of Demián Bichir - he was total quality in The Bridge, check it out if you haven't seen that, but this was awful. I would imagine it may pay to read the book to get the most out of the story. I was really looking forward to this but I was so disappointed. Maybe a rule of thumb is if Netflix feel they have to avertise it all over the place, then greatly lower your expectations."}, {"id": 423, "text": "A Gravity rehash. That was a mindless movie. So is this. Clooney should stick to earth based movies. Flying is fine (Up in the Air) don't leave earth please"}, {"id": 424, "text": "The whole movie, except for some visuals, is a waste of time. There is no beginning, no development, no result in the film. Even the subject is enigma. Using the name Cloney wanted to make money, but it doesn't work !! it was well below my expectation."}, {"id": 425, "text": "Thought I would keep my review complementary to the storyline is this film. That's it"}, {"id": 426, "text": "No point no aim and total waste of time. As said you cannot sleep then this is the movie for you."}, {"id": 427, "text": "Great movie if I wanted to hybernate the rest of winter..my gawd. I've decided that I need to write a movie script. Great quote in the movie that is so apropos: I didn't see this coming. Finally, why is George carrying a Winchester? Dumb."}, {"id": 428, "text": "I thought this looked good. Good actors, good story. The special effects and acting etc were all great and then it dawned on me why I wasn't enjoying it. I didn't know anyone in the film. Sure we got some snippets but certainly when it came to the the astronauts they were all strangers so I didn't really care. It was a missed opportunity."}, {"id": 429, "text": "The beginning of the film left me confused as there were too many scenes and I couldnt work out who anyone was. I though it might be one of those that all came together soon(ish), but I was still baffled when I got to the end. I'm surprised I stayed awake, needless to say my hubby fell asleep within 20 mins. Some scenes were better than others, but the film left a lot to the imagination, as it didn't tie up any loose ends (and there were quite a few). George Clooney acting is good, he portrays a different character to his 'norm'. If he hadn't been in it, I would have skipped past this film. Shame, I was looking forward to a riveting film on Xmas eve."}, {"id": 430, "text": "You are left waiting for a great moment in this movie, the actors and special effects are second to none but what is the point when the writing and storyline is just so poor that it leaves the actors even looking bored themselves and also waiting for something to happen, such a shame and uninspiring. Netflix get some decent writers!"}, {"id": 431, "text": "Unfortunately, I found myself bored quite often. Somehow the dramaturgical flow and its pacing is the problem in this otherwise beautiful and convincingly made film. A much more thrilling and involving drama could have been made out of this constellation."}, {"id": 432, "text": "Like a fantastically expensive restaurant meal made with the finest fresh ingredients and totally messed up because the chef was off sick so the bar tender had to cook it."}, {"id": 433, "text": "Painful to watch, I ended up fast forwarding it to the end.. I like George Clooney, And I love good sci-fi- also caught my interest that it was filmed in Iceland, but this was a mess.."}, {"id": 434, "text": "The trailer was the best part... even that was mediocre."}, {"id": 435, "text": "Great cast, nice acting, nicely shot, fine music. But the story is incredibly weak. A lot of scenes are supposed to touch you emotionally, but there is hardly any background story. Without the necessary foundation it simply does not hit. Curious to the reason why. Is the book just not that good? Or did they fail to properly translate it to a movie?"}, {"id": 436, "text": "Hi, Visually the film is stunning, but there is a complete lack of coherent plot, character development and direction. The novel is well worth a read, but the film missed all the main points of social isolation with the artic background and the crew's stresses and breakdown the longer they are isolated from earth. Definately a missed opportunity for a great movie"}, {"id": 437, "text": "They find a new moon of Jupiter which has an atmosphere and life???"}, {"id": 438, "text": "I had high hopes for this film, after seeing a mention in the Washington Post. Alas, it ended up being 2+ hours of wasted time. The acting was mediocre, the plot line non-existent, and any attempts at science were definitely fictional.And OMGosh -- that has to be THE flimsiest space ship ever constructed.Giving it two stars, rather than one, only because there's some beautiful CGI."}, {"id": 439, "text": "I thought there was some good acting, SFX were good mostly. I left me bewildered as to what I had just watched though. And I don't have the energy to try and figure out all the symbolism."}, {"id": 440, "text": "Great cast of actors and the film had some beautiful cinematography. I was literally expecting an epic film with George Clooney and the little girl,Caoilinn Springall. Heck, it even had two other favorites like Felicity Jones and David Oyelowo. I was really into the story with Clooney and the little girl. I thought to myself, something amazing is going to happened. Then we get sidetrack with the space drama. But still, Jones, Oyelowo and Kyle Chandler is in the spacecraft. Its gotta be damn good.Wuah Wah (shake head like a wet dog)WTH Happened? Why am I seeing closing credits?? Were is the awesome all revealing moment thesis of the film that supposed to hit the viewer? Where Clooney? I love yah man, but seriously bruh, stay in front of the camera."}, {"id": 441, "text": "It looks great, has a great leading actor....so what the hell happened? Blah. George you are better than this!"}, {"id": 442, "text": "The little girl who pointlessly touched everything. All she did was stare into space. That's not acting. * The undiscovered moon of Jupiter. Seriously? * The huge spaces and interior decoration of the space ship. What was the point of the so-futuristic budget-busting lattice work on the walls? * George Clooney surviving the swim. What was the air temperature in Antarctica that day? * The two astronauts who deserted the space ship at the end. Why were they doing this? * The pregnant astronaut. Didn't she read chapter one of the manual that says not to fool around with the other astronauts? They had every kind of protection astronauts could possibly need, except one very important one: condoms."}, {"id": 443, "text": "Everything is predictable..i mean everything.. and the name of their daughter is maya too. but they kept.. oh what did i just watch.. whyy did u make a movie like that.. i hate it sorry.. there is interstaller in this world.. so what is point"}, {"id": 444, "text": "In six months I will not remember this movie. During the whole movie thought that I was missing something. Nope just missing a good movie."}, {"id": 445, "text": "I tried to like this movie. Cinematography and acting was fine. CGI was good. The story was just simply flat and the music was atrocious."}, {"id": 446, "text": "A researcher, possibly the last human survivor of an worldwide apocalypse that seems to involve some kind of deadly airborne contaminant, tries to warn a space crew returning from a recently found inhabitable planet. Plenty of potential in all these interesting story lines but none are explored or explained. There's hardly any dialogue involved and you really never get to know and relate to any of the characters. I'm rather puzzled with regard to what this movie is trying to accomplish and to be honest it is a rather depressing to watch."}, {"id": 447, "text": "Tiny story about a dying man with a lost girl some stranded spacemen with a script taken directly from a cheap soap opera !This could have been something special with the amazing locations on earth plus the technology of the spaceship but was completely wasted with this tiny silly story !"}, {"id": 448, "text": "1 star for the CGI. The rest is a terrible waste of time!!! Hollow characters, no one you can sympathize with. Boring story. No explanation what had happened to the earth planet. Give me back my time, please!"}, {"id": 449, "text": "Boring, woke, slow, what else Clooney? Need a lot of Nespresso's to stay awake with this one. This is the sci-fi to avoid."}, {"id": 450, "text": "For a generation that has a attention span of a gnat, you are missing the point of this beautiful film. When the penny dropped, I cried. It's a story of love, regret, missed opportunities and life. Fantastic cast, great acting and a wonderfully shot. Soak it in."}, {"id": 451, "text": "This movie was the one of the christmas present. But, it was a bitter-sweet gift. The locations, the futuristic spacecraft was awesome, thanks for CG, but the point of the movie??? I missed it, i mean the movie missed id, so Mr. Clooney missed it. If it was a TV Show with 10 episodes, maybe there were enough time to explained everything. This has a big potential, but it was a misscatch. I'm very sad. :( Horses for courses. Mr. Clooney needs to pay more attention to his movie work (acting, directin) than to his political carrier. Get your attention off Hungary!"}, {"id": 452, "text": "This movie was a snooze. It dragged on and on the plot was amateurish and mocked at the speed of a snail. The special effects were the only good thing about the movie."}, {"id": 453, "text": "As I do like george Clooney in many movies like tomorrow land this was not one of his beat roles as it made no sense why he was hollsenating and then why at the end he then stood outside in the artic with no jacket in the cold the plot was twisted and weird in my opnion I didn't not care for this movie"}, {"id": 454, "text": "This movie looked beautiful. It sounded beautiful. The actors were great. The story, how ever, was NOT beautiful. The story is non-existent, and at the end of the film, you start to question why this story had to be told."}, {"id": 455, "text": "You know the film is a dud when a dying scientist is trying to save his child from re-entry back to a post apocalyptic earth. No one knows why! Melancholic!"}, {"id": 456, "text": "Movie was longer then the pandemic. So boring and nothing interesting. Don't waste your time"}, {"id": 457, "text": "Shut it off after 20 minutes. Slow and lacks continuity."}, {"id": 458, "text": "Suffice it to say that there are so many flaws with this 15 min short film stretched to 2 hours that I can't begin to list the problems."}, {"id": 459, "text": "I watched this movie, it has some really fantastic music, calming and inspirational backing track.G.C as Augistine was interesting to watch, If you are happy watching a movie that when it ends you are confused about what the point of the movie is, and with a bunch of unanswered questions you will love it.Other than that its just a slow paced apocalypse/austraunaught movie that offends no one."}, {"id": 460, "text": "Go Woke GO Broke...same old story. Boring does nothing to Drag you in really. Lets get back to real story telling please and leave the Woke and Nonsense out..2021 lets start over!"}, {"id": 461, "text": "The most slow and boring movie i have ever seen. netflix please take a break and make some good content. dont waste your time. instead watch scoob. believe me you will enjoy it more"}, {"id": 462, "text": "First off the visuals in this film is amazing and it's a beautiful film to watch sadly that's about all that's good with this clunker. The plot had a good idea but nothing really materialized there the movie. Don't waste your time."}, {"id": 463, "text": "I never write reviews but this movie is so bad and horribly boring I just wanted to get it out of my system. I fell asleep and thought I missed something that would clear up this disjointed plot. I rewound and decided I should have just kept on sleeping."}, {"id": 464, "text": "The Midnight Sky is dull, empty and unevoking.If the highs are having songs play, then make a film about music, my god. The 1959 film On the Beach, isn't good either, but at least that has a decent cast. Put some likable characters in it, for Pete's sake. Poor dialogue and casting."}, {"id": 465, "text": "Starting a movie out with the ending is the worst. Second worst is jumping back and forth and sideways so much that it has no point ."}, {"id": 466, "text": "This film is empty, drifting, no meaning, no message... just aggravating. Been the same same lately with Clooney movies. Disappointed. Didn't even finish, wathed like 2/3's and quit. Barely happens to us..."}, {"id": 467, "text": "This is not an uplifting movie. The scenery is bleak, cold artic and a spaceship traveling in space. The lead actor is a dying scientist. Only a few scenes in the movie were enjoyable - all involving a young girl and a pregnant woman. The music throughout the movie was not good - they should have hired a better music director. For a space movie, Netflix's Away is much better. Too bad this movie was not better."}, {"id": 468, "text": "As a fan of sci-fi and space related films, it should have been a good watch but turned into a major disappointment! Good cast and potentially good plot, but poorly executed! It's not so much the slow pace of the film but the use of standard cliches, a terrible script, poor score and average acting. Two hours that I'll never get back!"}, {"id": 469, "text": "I love SYFI sci-fi films but the is abysmal I mean what is the point it's just plain crap and boring watching Clooney you can tell he directed it as it's all about him I would have rather watched the other actors on the spaceship or planet and Clooney if your reading this review YOUR NOT TOM HANKS you can't carry a film on your own just about you you are BORING it's other actors that make you look good. And I'm wandering if Netflix actually watched this rubbish before buying it we're is the quality control save your self 2 hours of pure boredom and watch pepper pig it's more fun"}, {"id": 470, "text": "I was anxious to see this but when I finally did, I struggled trying to continue watching after about 30 mins in. And I struggled for another 30 mins until I shut it off. I had high hopes for this because it looked like it was going to be a good and interesting sci-fi, along with a strong cast, but this show with its concept was not that."}, {"id": 471, "text": "Well acted - decent visuals. Everything else was slow, cliche, hackneyed. There is nothing in this movie that you haven't already seen. You'd think they could have included at least one unique idea or sub-plot - but no. Do I regret watching it? No. Would I ever watch it again? No way. Would I recommend it to anyone else? Not if I liked them."}, {"id": 472, "text": "Futuristic designs are cool. I liked it. Story is interesting(didn't read the book). I can't say it is boring, though some scenes made me angry. Lots of glitches and loose ends. What was the reason they were all singing when spacewalking in a potentially dangerous zone and fixing a major part of the ship? Blowing off the steam? Don't think so..it could be a conversation from sully/iris about her mysterious father, so that ot wouldn't be big(!) surprise at the end. About Iris, imaginary characters don't show up in the scene when main character is asleep. It is cheating! About NASA, pilot's wife is smart enough to think of leaving a message for her husband where NASA is not with all the tech in 2049. Btw, please somebody ask scifi directors to put an extra antenna/comms to the spaceships. Fixing antenna scenes are really boring. There is a lot to say about storyline too. Presenting young Augustine, his relationship and his discovery of a new planet to the viewers wasn't properly plotted. Anyways, I appreciate the effort but scifi movies have certain dos and don'ts. Some directors like nolan, scott, cameron do rewrite them and they do it good. Some should stick to the dos and don'ts."}, {"id": 473, "text": "The movie is disjointed and skips huge plot lines. It leaves way too much unknown. If you read the book it's an ok adaptation but way off from the source. It is visually appealing. That's about it.The pregnancy subplot was so ridiculously dumb.And there is no way anyone survives the snow like that nor the meteor shower."}, {"id": 474, "text": "Wish I could get my time back to watch something else. I gave a 4 out of ten as I at least watched it all the way through. Utterly pointless and the only guess I got is that it was maybe another environmental save the planet message."}, {"id": 475, "text": "George Clooney has starred in a number of good movies... but his directorial efforts have always been left wanting. In The Midnight Sky, he directs himself in a derivative story that never gains much momentum and is filled with scenes lifted directly from other, better films (The Martian, Gravity, The Grey, Interstellar, Contact etc.)."}, {"id": 476, "text": "I get the Adam and Eve reference, but this a depressing jaunt down the road less traveled. Everyone else dies. You are, in one scene, thrown a curveball, but it isn't. I called, She's dead a full minute before the event. This movie telegraphs every event. Every single monumental moment ... even the small things."}, {"id": 477, "text": "Going by the Netflix trailer I was afraid this movie was going to be slow, but I thought Hey, it's George Clooney, so it's probably fine. Then I started it and all of a sudden I was in terror! Oh god, it's a Cormac McCarthy film! IT'S A CORMAC MCCARTH-- whew, no, it's just someone named Lily Brooks-Dalton, I guess it's probably fine.No it isn't. I couldn't go past the first hour. It's as Artsy-Fartsy melodramatic and boring as a Cormac McCarthy film, maybe a little more woke."}, {"id": 478, "text": "Fragments fragments fragments. Movie like this make me appreciate the good thing about Netflix. If I paid to watch this in a theatre I will definitely regret it."}, {"id": 479, "text": "Add this to the list of 'catastrophe' films that have come out this year,.. Yeah, some nice special effects, and some drama, but seemed very boring overall."}, {"id": 480, "text": "This is a gorgeous film. Simply gorgeous. But at the end of it you'll end up realizing you wasted two hours in a story that will ultimately disappoint you in just about every way."}, {"id": 481, "text": "Good actors, great visual effects, but terrible plot. If you know anything about cold weather you will be annoyed. If you know anything about space you will be angry. If you don't enjoy movies made of cliches you will be bored. I'm not even saying that's simply much too slow."}, {"id": 482, "text": "A slow, slow movie. I think it was trying to be deep, but it missed the mark, the target, and even the wall. It is just really boring. I kept hoping it was going somewhere, but it didn't. I won't talk about all the things that did not make sense, because the biggest hurdle is the movie is just plain dull."}, {"id": 483, "text": "Slow. Pretentious. Aiieeee George, why? Why? This is NO Gravity. This is paying the mortgage on Como. A singular miss for George Clooney."}, {"id": 484, "text": "Two hours that could have been condensed into much less. Overlong takes. A plot twist that is revealed early on, but isn't very interesting anyway. Much borrowed from more entertaining productions like Gravity and The Martian. Some elements are downright silty and irrelevant.I found myself distracted regularly and yet missed nothing since we've been shown where things are going from almost the beginning."}, {"id": 485, "text": "This is a complete waste of time. The character arcs are flat. Dialog is like it was written by a community college student taking a script writting class.Like Solaris, Clooney seems to be moving through some sort of woke atmosphere that slows everything down.Like Tomorrowland the movie's technology is out of whack and flat. Spaceships have gravity and a great deal of interior space, ruining the tension by not having the small spaces of a real ship, think ISS. Genetics seem to be ignored at the end for emotional sake. As usual Hollywood does not understand how a flight team has to focus when performing a space walk and has the crew singing Neil Diamond when they should be focused on a spacewalk, ruining a whole scene.Really, this is a seriously boring video and Clooney has ruined yet another several million dollars. Attempt to make woke films are a failure, and fortunately Quebec paid for this piece of junk.Seriously, keep Clooney away from being the main character for science fiction, he is ok as a side kick in sci fi, but he sucks wind otherwise."}, {"id": 486, "text": "It is supposed to be refreshing. It'll keep you alive, but only just. It is supposed to live up to expectations of the talent involved. Marathon to nowhere. Just enough to keep hope alive but then ultimately that glass of water just doesn't satisfy. Disappointed."}, {"id": 487, "text": "Earth had a climate disaster of unknown description that ruined the atmosphere. Space station returned from exploring an inhabitable moon of Jupiter, had no place to land on earth, returned to the moon. Bloody scene was five seconds of blood spilling out of space suit. The Secret Life of Pets was more exciting."}, {"id": 488, "text": "I really like George clooney but this movie was a disaster. Nothing interesting, no character development, and poor dialogue."}, {"id": 489, "text": "I am a sci fi fan. Have been my whole life. I don't like battles and action in particular. I like the moral quandaries, and the aspects of a character being put in a completely bizarre situation and figuring a way out. So, as per an earlier reviewer, not an action fan. In my opinion battles/chases, etc are plotless so less interesting to me. That being said, this thing is dull and completely baffling. It's like literally watching your grandmother knit for 2 hours. Wow. I, like others, do not get why this film even got made."}, {"id": 490, "text": "No matter how much you like George Clooney or sci-fi, pass on this one. Boring, slow, fabricated conflicts and danger to try and prop up the glacial pace , characters doing dumb things, etc. Its nearly two hours long and could easily have been a 75 minute movie. Another annoying thing is the soundtrack. It's the worst I've heard for major production"}, {"id": 491, "text": "The story is really boring. There is a lot of wasted time for minutes on end of space scenes or people walking around alone like 2001 A Space Odyssey. It's also really predictable"}, {"id": 492, "text": "Slow, heartbreaking, and a Debbie Downer from a Libitard that wants us living in Mars... or??? .... because we ALL KNOW mankind can't be trusted.... Take a pass &amp; use your time to watch Craig Ferguson reruns instead, and laugh!"}, {"id": 493, "text": "Such beautiful filming wasted on a tedious pointless plot. Skip it!"}, {"id": 494, "text": "Too many drawn out scenes. Glad I watched on Netflix so I could fast forward the several overly extended parts. Also the ending did not seem fully formed. Basically, everyone dies but it's written as if there's still a story to be told. Very unfulfilling and could at least have been written from the point of view of despair.Ultimately, I wasn't sure what the story was about. It's not about a brave man who saves humanity, because the two that make it to K23 will just die. It's not about a man reuniting with his daughter because he never tells her. It's not about the mismanagement of the planet because we never find out really what's wrong.After it was over, I just felt like it was a vanity piece by an actor trying to become a director."}, {"id": 495, "text": "I expected more. The actors were good but the story lacked substance."}, {"id": 496, "text": "Visually a lovely movie. Acting outstanding. However I wish they would go back and re-edit it to contain an explanation of what's happened on earth and that a crew was left behind on the moon to get things started so humanity would have a chance. Because one little family? Thats sad."}, {"id": 497, "text": "1) So at the end, the 1 couple in the spaceship is supposed to rebuild civilization on another planet? How does that work? Incest?2) In the beginning, they say that K-23 planet has everything but life. Why put this little twist in the story if you're not going to explore it later. Also, wouldn't it mean that the survivors are doomed anyways?3) With an event capable of ending all life on planet earth, and it not being an asteroid strike - I believe it deserved atleast some explanation - but no.4) During the spacewalk, she gets hit with micro-meteorites that punchture her spacesuit and cause her to start bleed. First, she doesn't realize that she's been hit - but that's not even the worst part. Her magical spacesuit is somehow still able to hold the pressure. What?"}, {"id": 498, "text": "George Clooney's The Midnight Sky begins when everything seems to have ended- in the era of the post-apocalypse. It isn't interested in how we got here (geomagnetic storms), but in what to do now that we are here. Augustine (Clooney) finds himself alone in a base, somewhere in the Arctic Circle. The Earth has been wiped, and so has his will to live out a happy end to a fruitful life spent trying to find the possibility for human habitation in outer space. Soon, he finds out that he's not alone, accompanied by a blue-eyed girl, Iris, who refuses to speak to him, but follows him like a shadow. She props him up, giving his survival in that isolating ice-washed base an additional function- of caregiving.READ THE FULL ARTICLE ON FILM COMPANION"}, {"id": 499, "text": "Confusing and strange. Way to long with 2 Hours. A Puzzle which is more boring then exiting. Another missed Opertunity by Netflix."}, {"id": 500, "text": "The movie is ok, at least it's better than Ad Astra with Brad Pitt{ who must be so embarrassed by it}, watch it if there's nothing else on"}, {"id": 501, "text": "When writing a script, a book or creating any sort of story-telling medium, every scene MUST have a purpose to further develop the plot, characters, or atmosphere.The beginning of the movie starts well-enough. The pacing of the movie, atmosphere and the beginning of the plot is set. You fully understand what is happening and have a general idea of what challenges the protagonist might face. However, after about 30 minutes, the movie slows down. A lot.Each and every scene thereafter is meaningless to the viewer and useless to the film director. Every challenge the characters face is short-term and has nothing to do with the overall story (oh no, I lost my luggage!) It is only until the last 12 MINUTES of the movie, does the story advance albeit very little.After sitting through the movie for an hour and a half, I was debating on looking for another movie, but I stuck with it. If not for me, then for my readers.Pass on this movie. It's not science fiction, but more of a B grade movie with great sci-fi visuals. I enjoy slow-paced science fiction (Interstellar, Gravity), but this is not slow-paced. It's no-paced."}, {"id": 502, "text": "This is a drama first, set in a sci-fi scene. Not an action sci-fi!! That's what a lot of people screaming BAD MOVIE or BORING fail to keep in mind. So keeping that in mind. This was a good movie. So if you're looking for something different this is definitely worth a watch.The Midnight Sky keeps you hooked by raising a lot of questions. It reveals little of what is actually happening and let's you wonder. The cast's performance therefore feels more natural and doesn't force any unnecessary gibberish. I have absolutely nothing negative to say about the actors. All of them sold it very well. Sometimes managing to create a distinctive personage in just a few scenes.The only downside is the action. Mostly the one that happens on the ground. The one that happens in space is actually pretty ok.And it's a winner for the vfx department! To recap. A well made drama. An intriguing scenario. Good actors. Sometimes lacking in the action scenes. And some tasty eye candy for a sci-fi passionate.Definitely a good movie night."}, {"id": 503, "text": "The Midnight Sky, a catastrophic science-fiction tale directed by George Clooney and based on Lily Brooks-Dalton's novel Good morning, Midnight, is about an emotional and physical journey. After a mysterious cataclysm has wiped out most of life on Earth, Augustine (George Clooney), a seriously ill astronomer who has spent his life looking for a hospitable exoplanet, refuses to escape with a group of survivors and is left alone in an Arctic scientific-research station. He knows a group of astronauts is traveling back to Earth and since he needs a powerful antenna to communicate with them, he sets off on a perilous journey to reach a far-off base.George Clooney's performance is brilliant, and some scenes are extremely engaging and nerve-wracking. Unfortunately the movie focuses mostly on Augustine's emotional awakening and neglects important aspects of the story. Too many scenes are devoted to his journey and inner struggle and this choice affects the narrative economy of the film. Its pace is slow and its development dispiriting.I would recommend The Midnight Sky to viewers fond of sentimental stories and not to those eager for action, adventure and the excitement of scientific exploration."}, {"id": 504, "text": "This is a work of art.Cinematography is extraordinary, acting equally stunning - above all the script &amp; story sublime.It doesn't remind me of any other movie where some crackpot reviews suggested script attempts to mash together multiple other movies. IT DOES NOT!!I really love how this movie exquisitely portrayed that regardless of where man exists, past - present or future, our humanity always prevails.This movie takes you by the hand and gorgeously takes you on a human journey.Ignore the cretins who gave this bad reviews, take a deep breath and enjoy,"}, {"id": 505, "text": "I was quite skeptical in my approach to this movie by looking at low ratings, however i am glad i watched it. I asked to myself, with Clooney, how bad it could be and as a person who is easily distracted or bored, it totally got my attention. I enjoy apocalypse movies in which the world is almost dead and only few people try to survive fighting against loneliness. That's maybe because I want to give up everything and escape from responsibilities , so the setting in the middle of nowhere was perfect for me. Moreover, space exploration ,discovering the unknown and travelling across the universe while doing so is something I want to be doing since I started watching Star Trek for the first time. Therefore, this movie almost had everything I wanted in a plot. On top of that the little girl that came out of nowhere and how things escalated with that in addition to an unexpected twist at the end caused me to shed some tears as a father of a 7 year old girl... Long story short, it is not a movie full of action so it may be dull for some who enjoy fast paced movies. However, if you want to be immersed in a thought provoking story, you will love it as much as i do....One more thing, the coming home theme is quite different than what we are used to and that reverse psychology and changing of the roles were a fresh take on the genre..."}, {"id": 506, "text": "...that in the end we wish all humanity vanishes, disappears without a trace. We really hope for another meteorite bigger than the one that made dinosaurs go extinct.This thing is a disjointed mess, a woke pseudo sci-fi film. In the end it is another of countless heavy-handed artsy-fartsy films that have been mass produced by Hollywood and its minions. The whole thing is so bad to the point of being painful as I got a headache while watching this abomination.Up until some time ago, I could watch bad sci fi films, because, well, there were sci-fi ideas in them. But those day are long gone. Now, all we have are some scifi imagery impregnated with a script exuding a certain way of thinking and behaving.And it is slow, boring, tedious to the point of making Stalker look like an action film.TMS think it is deep, but it is as deep as the puddle we see in a sidewalk after a light drizzle."}, {"id": 507, "text": "REVIEW - THE MIDNIGHT SKYThe eagerly awaited latest George Clooney film is finally out and.......The film is 2 stories both running at the same time and which both intersection, a scientist is left alone in an Artic observarory when everyone returns home because (no spoilers) but he soon realises he actually isn't alone.In space a spaceship is returning to Earth after investing if a moon around Jupiter could sustain life where humans could move to because earth will no longer sustain life.So far sounds awesome right.In parts yes indeed this is a very original concept linking both stories together and you don't finally get it until the end but honestly there are other parts which are just too slow and even boring, 2 hours was way too long for this film, it could have easily been told in less time without having stuff thrown in just to extend it, which is a shame.One to watch if you have a spare 2 hours and see it on a streaming service but save your money going to the theatre.Rating 5 out of 10"}, {"id": 508, "text": "IN BRIEF: Despite all the lavish showmanship, two stories seem to be caught in a parallel universe in this doomsday drama.JIM'S REVIEW: (RECOMMENDED): In George Clooney's well-crafted sci-fi drama, Augustine Lofthouse is a scientist and loner, a man consumed with space travel and the cosmos. Stationed in the Arctic and dying of cancer, he chooses to stay behind for his last days while all others evacuate for safety during a global disaster. He is alone, except for a mute stowaway girl named Iris who becomes his charge. Meanwhile, a space mission is returning from Jupiter and all transmissions from NASA have mysteriously ceased. Augustine decides to risk his own safety and warn the astronauts not to return to Earth due to apocalyptic circumstances that have doomed their home planet. What we have here is a failure to communicate...not in the film's epic grandeur or in its ambitious vision, but in its fragmented storytelling. The two frontiers never merge seamlessly in this mediative look at life and death in our possible future, but there is still much to admire.Mr. Clooney stars and directs this saga and he does impressive work in both creative areas. Sporting a massive grey beard that David Letterman would envy, the actor gives a poignant performance as this solitary man. His story-line is by far the most compelling, but the film cross-cuts to the space mission which is rather predictable and listless in its pacing. As a director, Mr. Clooney knows how to create action and tension most effectively, and he counteracts those moments some strong poetic symbolism, aided by Alexandre Desplat's lovely melancholy score. He wisely plays down the heroics and hones in on the human drama, although his flashbacks of a younger Augustine lack credibility due to casting issues and further undercut the flow of the narrative. This is no criticism to the acting talents of Ethan Peck (grandson of Gregory)...the actor just has no physical resemblance to the easily recognizable screen persona of a younger Mr. Clooney.Mark L. Smith's screenplay tries to supply his space traveling characters with some depth, but their backstories is conventionally told and lack any element of, dare I say, gravitis. We've seen these action figures in umpteenth space odysseys battling obstacles on perilous missions. Nevertheless, the cast (Felicity Jones, David Oyelowo, Demián Bichir, Tiffany Boone, and Kyle Chandler) do fine work in their sketchy parts. While the outer space CGI and the absolutely stunning camerawork by Martin Ruhe, plus Jim Bissell's superb production design provide the wow factor, it's those blizzard white-outs and tundras scenes that have the emotional impact. Moviegoers get the treat of visiting these two polar opposite worlds. But though we can reach for the stars, it is the snow and ice that we prefer to endure.The Midnight Sky is an adventurous and thoughtful undertaking by Mr. Clooney and his artisans. This is a stunningly good-looking movie that would have benefited in a wide screen moviegoing experience than the smaller (and more common) streaming capabilities in this year of COVID."}, {"id": 509, "text": "It never ceases to amaze me what people will give one-star and ten-star reviews to. The Midnight Sky deserves neither.Outstanding production values boost adequate performances and a fair script featuring two distinct storylines that slowly converge, and they do so in a way that makes enough sense to be watchable. That said, odd subplots and the occasional flight of fancy lend an absurdist air to an already disturbing story.Complaints in IMDb reviews primarily target pacing and bad science. Yes, this film has a slower pace, but it's entertaining enough if your attention span can withstand more than a music video. My scientific education is in health sciences/surgery, so I'm no expert on space or the environment; however, nothing in this movie stretched me beyond my willingness to suspend disbelief.Thematically, The Midnight Sky is reflective of the dismal year that is 2020. As we suffer through quarantines, lockdowns, and legitimate worries about the viability of our immediate future, we can see ourselves easily in the characters, all of whom, at some level, experience alienation, pervasive regret, and a sense of creeping dread.As movies go, this one isn't particularly uplifting, so if a happy ending is a must for you, think about looking elsewhere. The filmmakers do offer a scintilla of hope for those who really need it to get through the night. But not really. The extinction event that determinists believe is humanity's inevitable destiny is the real ending. As the credits roll over a mundane vignette, we know our species is dead, and we're simply waiting for a few stragglers to catch up.Current events have led even the best of us to nurse the occasional defeatist sentiment, so The Midnight Sky could be a tough watch for some. Otherwise, it's a decent, if imperfect, effort."}, {"id": 510, "text": "Cinemas are closing here tomorrow for more than a month, due to the pandemic, and I wanted to go one last time. This was showing in my favourite cinema. Last but not least, what healthy female of the species wouldn't want to see anything with George Clooney, if only to find out whether he can match Sean Connery in aging well? The post-apocalyptic angle interested me; there are books that have done that stupendously (e.g. A Children's Bible) but it wasn't the reason I went.Turns out the movie is about something else entirely. The post-apocalypse part is a dead loss - we have no fertile Planet B to escape to. Still, the end had me howling, for all the predictable and sometimes heavy-handed drama. At the heart of it, this story asks the question: can an absent parent be a good parent? Or even just a good-enough one? While I'm skeptical about the technological lengths Midnight Sky goes to to give its reply, I tend to agree with its conclusion. Then again, wouldn't this be exactly the type of script an absentee parent would write afterwards in self-justification, true or not? Or, for that matter, a neglected child?Our parents are who they are. We cannot change them. We can, however, try to see the good in them. It's not always as easy as when George Clooney plays the parent, but if you feel like mulling over that kind of thing and don't mind a few wrecks, deaths and spaceships along the way, by all means go for it."}, {"id": 511, "text": "First of all, if your interest is all non-stop action and explosions, this film may not be for you--The Midnight Sky is designed to be a slower, thought-provoking, emotional drama within a sci-fi structure.The basic plot idea can be grasped from the previews. It's the near future (2049). The earth is dying, due to an 'event' mostly left to the viewer's imagination, other than that Director Clooney's character, an aging astrophysicist slowly dying of cancer, hints that the 'event' is due to human fault. Maybe a nuclear war? (There is a sly reference to 1959's On the Beach in the film.) Or a global environmental catastrophe caused by societal error? While survivors are leaving Earth, Clooney stays behind to try to contact a spaceflight returning from a moon of Jupiter where astronauts have verified that life can exist, based on initial calculations made by Clooney's younger self in flashbacks from decades before (the 'young Clooney' is played by Ethan Peck, nephew of Gregory Peck--again, see On the Beach noted above.) Drama ensues as the space voyagers incur crisis on their return toward earth while 'old' Clooney (and another mysterious person) endure arctic dangers while trying to reach a transmitter powerful enough to contact the astronauts. There's a plot twist I won't reveal that adds to the mystery.If you like human drama mixed in with BOTH post-apocalyptic crisis intercut with simultaneous outer space dangers, this film is for YOU."}, {"id": 512, "text": "This movie is two hours long. The first hour moves annoyingly slow. It picks up in the second.The production values (cinematography, acting, sets, and dialogue) are good.But this movie is depressing, fatalistic and hopeless for two hours straight. Consistent with liberal Hollywood's political and environmental views, Man destroys Earth and virtually mankind.Other reviews ask what was the point? I guess it is, We better wake up before we destroy the planet.I gave it a 10 for production value. And a 1 for lack of positivity and inspiration (unless you are inspired by depression, fatalism, and hopelessness). I think a 5 is a good rating."}, {"id": 513, "text": "Slow-paced, cerebral, and quietly heartfelt. Rather than a spectacle, it's an internal and introspective clutching of lost time and opportunities. Closer to real life than Star Wars, it won't appeal to the light saber crowd and it's not supposed to.To the criticism that it lacks scientific basis, you're right. But scientific facts in this case aren't what's important. It's a story, not documentary.I liked it. Knowing nothing about it beforehand except it was a George Clooney movie, I was afraid it might be another We destroyed the world ecological trope. I'm please to say it wasn't, though the first 15 minutes I was half expecting Greta Thunberg to come out behind a snowdrift all grimacing and preachy. Thankfully, she didn't.Watch it, not when you're in a celebratory mood, but when you tire of football, political wokeness, and Trumpism. You may learn something about yourself."}, {"id": 514, "text": "While set in the future of 2049, The Midnight Sky seems a depressingly timely release for this pandemic year of 2020. The world is ending... in the movie, for reasons unexplained except that they were caused by man--global warming, nuclear holocaust, or any number of cataclysms of humanity's hubris. It doesn't really matter the exact event for the purposes of the picture, with the result regardless being one of character isolation and regret. George Clooney's scientist is confined to traveling between arctic radio bases, to stay in front of the poisonous air circling the world and to communicate with astronauts secluded in outer space. A lot of quarantining inside and otherwise wearing protective equipment to avoid breathing in the dangerous outside, in other words--sounds familiar, right.Apart from that, this is another Clooney space movie, with him directing as well as starring this time, and which is unfortunately closer to the Solaris (2002) remake than it is to Gravity (2013) (I haven't seen Tomorrowland (2015) yet). It's derivatively competent, but hardly of the import that its big-budget apocalyptic and planet-hopping scenario demands. Playing with memory is promising material, and this is reflected in space by the virtual-reality programs that remind the astronauts of home and on Earth by the scientist's flashbacks. It's readily cinematic: the film-within-the-film virtual reality and the flashbacks necessitating montage. The space mission and the one on Earth further reflect each other even in the space walk and the earthbound journey through snow-swept landscapes. Remembrance and regret is also intertwined with the dying planet and, perhaps, that of the human species (at least, one presumes, without biblical levels of inbreeding). But, it's been done better before in other space-related pictures, such as, say, Arrival (2016), or the original Solaris (1972). Moreover, it's disappointing that these recollections don't amount to much more than forgiving a man for abandoning his daughter."}, {"id": 515, "text": "An awfully dark depressing film. Like a modern take off of Neville Shute's On the Beach (this film has a scene in which one astronaut is watching that movie) with a bit of Bruce Dern's Silent Running from 1972 thrown in.In a nutshell: Without giving away the plot and several surprises, this is set in 2049, the earth is dying (no reason given). Our blue planet is just a brown, sulfury, smoky mess, the air is unbreathable and the cities are dead. Picture Detroit. The people are evacuating to underground shelters where they will only survive for a while. The Clooney is a enigmatic and sickly loner scientist who stays alone at an evacuated astronomical research station located somewhere (no location given) in the Arctic, Antarctica or someplace else really cold and barren. He abandoned his wife and daughter years ago to do his research. He manages to make contact with a massive space station staffed by a multicultural team of five astronauts that traveled to and found a habitable planet and is now returning to earth with no knowledge of what happened here. The new planet, named K43 or 49K or Special K or something like that, is described as just like Colorado (minus the pot shops, Mercedes G Wagons and ski resorts of course) and perfect for human life. When the astros find out about the state of earth, they have to decide on whether to keep going or book back the New Colorado. Big bearded George really says very little in this film. Most of the dialog is with the astronauts. It is a depressing film, though not quite as grim as On the Beach. There is only one really positive scene that has to do with a Neil Diamond song. I gave it a ten due to its uniqueness and that I like George's films. You gotta' shave George. That beard is not you."}, {"id": 516, "text": "Love is something that connects us beyond space &amp; time. Another exceptional masterpiece by George Clooney, stretching across time and space whilst coming to terms with demons of chances lost in another life.Absolutely wonderful direction and interpretation on screen. Great visuals and mesmerizing music that follows the story line, building drama and hope to save a soul from its sins, by saving a soul.Accolades for performances in acting that are of highest calibre by George, Felicity, David, Kyle, Demian; but most note worthy is the young bright star Caoilinn Springall, who is remarkable in her poise and serenity as an actor.I would highly recommend this brilliantly crafted film that deserves highest praise for delivering such a touching story in so little words. Be sure to ignore all the other negative reviews, as in this day &amp; age most viewers are hopped up comic superhero action movies expecting constant fervour in every moment of the movies.This is a slow burner, requiring patience and diligence to sense &amp; taste the flavours of its fruits of love. In same heights as 'Contact', 'The Martian' or 'Interstellar', as it requires depth and foresight to appreciate such an artwork by gifted actors, producers, writers, musicians and direction to create something worthy.Certainly one of the best space, science-fiction, dramas requiring a repeat viewing to admire the subtlety of saying so much with so little. Bravo, and Thank you!"}, {"id": 517, "text": "There are shades of John Barry in Alexandre Desplat's suitably galactic score here, but that is, sadly, about all I can say that is good about this derivative sci-fi yarn. I think George Clooney did just about everything but make the coffee as his terminally ill character traverses the arctic wastes to reach a weather station. It might have a transmitter powerful enough to contact an approaching space craft returning from a distant planet that may offer hope for the survival of mankind from some sort of ghastly existential event threatening the world. The ship is manned by a crew including David Oyelowo and a pregnant Felicity Jones but their journey home is made even more perilous by being knocked off course and having to travel through uncharted space - full of dangerous meteor showers. Money has been spent; and it certainly looks good but the two stories don't really gel/relate very well; the characters are very under-developed and the plot is reminiscent of half a dozen other films of this genre where money was no object but poor writing, directing, and to be honest - acting too, wasn't part of the priority either. It's got way too many long beauty shots, spaceship shots, arctic shots - even gun shots - anything, really, to distract us from the lack of a new story. The imagery certainly benefits from a big screen, the rest - from being on the radio!"}, {"id": 518, "text": "George Clooney is a renowned scientist who has somehow survived a global disaster and lives in isolation in the Arctic. What follows is his repeated efforts to prevent a space mission from returning home to the devastation. His protagonist's backstory is gradually unpacked through flashbacks and his psyche becomes apparent through occasional dream sequences. Part science-fiction, part fever dream, this at times reminded me of Solaris, a film that told its story in much the same way.Clooney who has had an extended absence from the screen brings his trademark charisma as an aging survivor looking to desperately salvage a dire situation. Felicity Jones, Michael Oyelowo and Kyle Chandler are astronauts on the space mission that does not know what they are returning back to. Although it took a while to get invested in this storyline and its conclusion is somewhat tentative, it's still a measured, skillfully made science fiction film that tackles familiar ground in a satisfying way. The pacing is a bit uneven, but there are some shockingly gripping scenes here and the storyline, while it takes a while to be fleshed out, truly clicks in the end. Gladly recommended"}, {"id": 519, "text": "Makes Zero Sense!Premise is that manned rocket returning to earth from within the solar system (moon of Saturn) must be warned of earth disaster and sent elsewhere. A) Reality: Basic radio contact would exist in setting where rocket, crew made such trip. B) Rockets on such missions don't have a lot of extra fuel, ability to go elsewhere.George Clooney in his old age must be losing his marbles - both film plot and being involved with this disaster. He sets off across arctic wilderness on souped up snow mobile with kid and no protection against weather. At one point ice gives way, he goes for a swim, has no source of heat but continues trip w/o perishing. (!!!) Actually, should win Darwin award for thinning out dumber parts of species.In a CV age where Follow the Science is a slogan . . . Clooney's (&amp; film's) is 'Ignore ALL Science!This Film = Sheer Stupidity. ."}, {"id": 520, "text": "The year is 2049 and the Earth is dying after a global catastrophic event that has lead to great evacuations and mass extinction of not just the human race but of animal life too. With just that plot alone, it's oddly similar to Sunshine or other films that destroy Earth after some sort of disease. Though that doesn't make George Clooney's third film as a director any less watchable instead the only thing that's missing to make the same as Sunshine, is one; director Danny Boyle and two; well, the drama. Not that The Midnight Sky is a bad film, far from it, though it won't be to everyone's taste, it's just the film's narrative gives us quite a well structured wall, but the wall is constantly bombarded by drama that should punch you in the chops but with particularly non-descript characters, the drama fails to hit. Granted director-star Clooney does grace the film with a rather poignant performance as a terminally ill lone doctor as he advises scientists not to return to Earth in risk of death. At its best, the film is stunning to look at with its fantastic sci-fi visuals, that at a glance would be the same as Gravity (but then that film was mostly used as a stunning Earth show). But the rest of it is just slog even through the more dramatic moments which at times will have you nonchalantly shrugging off. Clooney though is definitely taking his directing skills to a new level after that awful mess, Suburbicon, but we remain optimistic that his next film as a director will be a bit better. 3/5."}, {"id": 521, "text": "This film belongs to the very restricted group of 3 or 4 films in which I fell asleep. My wife woke me up with no delay, but I only wish I had woken up in the very end.The plot was incredibly slow and predictable from the very beginning. The things that were not predictable (and that kept us awake) were left unresolved. The visual effects lack accuracy and realism (a modern-day 3D game beats this film easily in many, many scenes). The physics lack accuracy (I felt the zero-gravity motion particularly sloppy). The medical issues/problems/challenges that arise throughout the film are outrageously unrealistic. Scientific accuracy is poor (i.e. Immediate no-lag calls to a spaceship that should be at least a few light-seconds away).Did I mention that the plot is slow? This film aims to be a kind of interstellar (familiar drama + Sci fi) but doesn't get even close.I want my two hours back!Oh, and I've created an account just to rate this piece of... film."}, {"id": 522, "text": "There's a lot to like about this movie - but there are also a few disconnect/gotcha moments.Firstly, the technical delivery of the story is superb - faultless even. Similarly, the actors do a great job with their material. The environments of the spaceship and the Arctic are really well done and convincing. The spaceship is easily one of the best to ever make the screen.Is this sci-fi? Yes and no. It's really a human drama that uses elements of sci-fi rather than being a true sci-fi movie - although no doubt some people will find that comment unkind or inaccurate.The unfortunate aspect of the movie is the sense in which it buries the lead - this is a shame, as some real interest could have been generated (Solaris like, as someone mentioned in another review), but this tantalising aspect is under-developed and only really clarifies when it's too late to save the story. So for my money, this movie has missed out on some vital script and story development and internal critique.Maybe some key elements got left on the editing room floor, as there also appears to be a major logic flaw towards the end. Not wanting to create a spoiler, so suffice it to say that, I was baffled by decisions made on the spaceship towards the end - to the extent that I found what transpired there unrealistic, and from a 'crew' perspective, completely unprofessional and compromising of their supposed professionalism."}, {"id": 523, "text": "It's no stretch to think that in 2049 an apocalypse has devastated earth. In an enjoyable The Midnight Sky, alone in the Arctic, astronomer Augustine (George Clooney) tries to contact a returning expedition to a habitable exoplanet to warn it not to return. In addition, he has to find someone to care for little stowaway Iris (Caolinn Springall) because he is about ready to die from a disease and there is no place like home anymore.Director George Clooney knows his way around a camera now with impressive set pieces like a blizzard and space ship repair, his way around the story not so much. The sentimental motifs are there including loves left behind, orphaned children, and flashbacks to simpler times.Clooney as actor is commendable: he underplays a scientist who sees the end coming near and accepts his terminal fate. He quietly warms to his little ward enough to try to save her, although, because she has maybe 2 lines, it's tough for the audience to identify with her.Clooney takes another minimalist approach about our destruction of the planet with a few damning lines about what a poor job we've done taking care of it. Hysterics about the lost world are few if any-the population readily abandons Earth for a newer world.The film fumbles a plot point or two when we become slightly confused about the lineage of two players. Having little Iris absent for the last part in order to emphasize other relationships is a loss, albeit this reviewer is an admirer of the minimalist approach to storytelling.Clooney and company channel the spirit of recent Sci-Fi's like Ad Astra, Gravity, The Martian, and Interstellar. Like them, most super hero films, and old E.T., going home is paramount. In the case of The Midnight Sky, it's a tough haul given our penchant for destroying that home.Let's just call it, like It's a Wonderful Life, a cautionary tale at holiday time."}, {"id": 524, "text": "I am not the biggest fan of Clooney, and read the source material (the book) a year ago and it was not the best post-apocalyptic tale that I have read either - though really it is not about an apocalypse and is at heart a story of humanity. That book, Good Morning, Midnight by Lily Brooks-Dalton shares its title with a 1939 novel by Jean Rhys and their similarities of take on the human condition should not be discounted. I strongly recommend reading the Brooks-Dalton story first because without that background much of the movie seems disjointed. In the end though, expecting little but needing some entertainment early in the morning of Dec 23rd, I attended my own private premiere of the movie on Netflix. I was pleasantly surprised, and have awarded the movie a 9 out of 10 here despite its flaws, notably in pacing and, again, that much of what is happening seems like incomprehensible vignettes unless you have more information to work with. But it is a beautiful movie with great production values, and Clooney should ultimately be commended, and recognized not only for his direction but some decent acting here too. We are in a new era of film viewership with streaming instead of sitting with a couple of hundred other people in a theatre. Movies like this one with a decent budget but more drawn out, as art house films of the 1960's and 70's were, will likely become the top tier of releases rather than the giant superhero movies we have been used to the past decade. In that way, the rise of a digital society, perhaps sequestered for periods of time during a health crisis, and often solitarily, will usher in more of these types of movies. That is not such a bad thing, and compared to the plethora of very low budget, including foreign dubbed movies to meet the demand of the burgeoning viewing platforms, an imperfect film such as Midnight Sky may even be looked back upon as this era's Citizen Kane."}, {"id": 525, "text": "Movies shouldn't leave you wondering what you watched it. The moral of the story is that humans mostly suck and are doomed.Pointless awkward moments. At times people on the ship forget that they're humans. Normal emotions conveniently disappear. Long term space travel requires compatible personalities.Clooners is a terminally ill old guy. During a blizzard he breaks through ice and is in the water for a minute. Completely soaked. Somehow pulls himself out, and through the magic of stealing a 50lb girl's body heat, makes a full recovery....while completely exposed in the blizzard. Humans don't survive that.The ship at one point flies through a large asteroid field that is apparently flying through space at 50mpg. Or this ship is flying 50mph and the chunks are stationary. Chunk of ice impact the hull and mostly bounce off harmlessly. Nevermind that the ship and ice chunks would both be traveling at 1000s of miles per hours. Crew would be dead in a flash.And a habitable undiscovered moon around Jupiter that we somehow missed this entire time?Should have spent some extra money on people that know how the universe works. And also on people that can write a compelling story.An algorithm must have produced this movie. Definitely uncanny valley type stuff."}, {"id": 526, "text": "This movie was well acted, the effects were a 9 out of 10 for me personally and whilst the story didn't seem to progress particularly quickly that was fine because there really wasn't much of one there anyway.There are certainly questions to be asked about the plot such as... What happened? How did it happen? what was the progression of the disaster that must have ended 10 minutes before the movie started?We know there was a man made disaster and a global one at that, but we never find out what it was, how it happened or anything like that. It simply was...Midnight Sky starts at the end and then the story kind of fizzles out at that point I would like to review the story in depth but aside from the missing elements there really isn't anything left. I must say that I thought what it did have was good and it is just a great shame a story was one of the things it didn't have."}, {"id": 527, "text": "( It's a beautiful space epic. It's has beautiful visuals, a terrific cast and a gorgeous score.)That's Aether. It's a spaceship. Coming back from a planet that we hoped would be our future. I have to warn them about the conditions on Earth.Visually stunning and hauntingly contemplative, The Midnight Sky is a meditation on mortality and humanity that's strikingly shot, and beautifully assembled but lacks full depth in its themes and characters, still ultimately delivering a wonderfully fascinating sci-fi film that's engaging and provocative. Score: 83Discussion Points: Far out this film looks and sounds gorgeous. The cinematography, sound, score, visual effects and production design are all off the charts! Clooney as a director is pretty solid here. Nothing too incompetent nor revolutionary, just solid filmmaking. His performance is gruff and rough and something I've not necessarily seen from him before. The rest of the cast does well with what their given, but that's the films biggest weakness. It's got some great themes and it really angles itself to try and ruminate on humanity, mortality and loss but it just never quite gets there. It's sadly disjointed in its narratives jumping from Clooney's bleak survival crusade to the mysterious spaceship ensembles quest through the unknown. The strongest narrative threads are the quieter moments with Clooney that are bleak and resonate but he's seemingly determined to spend more time not on himself and rather on his actors whom he elicits strong performances from. Regardless of its narrative flaws, this is still a very accessible and engaging sci-go endeavour and I frothed on it."}, {"id": 528, "text": "Production and acting are solid, that's on the plus side, on the con side: a very slow and boring story told. This of course makes the movie almost unwatchable - but if you want to dip fast into the arms of Morpheus (ancient god of sleep) The Midnight Sky might do, but in the case that you want entertainment and/or something to feed your mind, it won't work. Also the twist with the girl is obvious within a couple of minutes, you just have to use your brains. And, of course, the last survivors are a black man and a white woman (mankind will distinct anyway, how a couple should restart mankind is a mystery only the writers can answer) - in this sense I would even dare to call the movie very racist: Asian or South American people for example (like in many movies) do not play any role in this movie: a white woman and a man of African origin man must survive (like in other movies too) - why not an Asian woman and a South-American man for a change? Anyway, The Midnight Sky is a Netflix production like many: hire some known actors, put some money into the production and technical staff and voila you got a new movie. The script!? Not important at all. My rating is 4, but only because of the decent production value I added one point, the movie I would rate a 3 and no more."}, {"id": 529, "text": "The Midnight Sky is probably one of the best movies I've seen this year. It's not as action packed as most blockbuster sci-fi movies of late, although it has some rather nice action sequences in it. It is actually rather slow-paced - which I like very much!The story centers around an old dying man (Clooney) and a little girl he finds at the abandoned research station where he's living. The earth is devastated by an extinction level event and he is one of the last remaining people on earth. His mission? To establish contact and possibly save an exploration vessel coming back to our beloved planet from a 2 year exploration trip to one of Jupiters moons.First the bad: the story isn't very spectacular. There are similar movies (like Interstellar and IO) which have the same kind of backstory cq. setting as The Midnight Sky. The end of the movie is interesting, but also not very original - it's all done before (although not in a sci-fi movie, as far as I can remember). And some of the action sequences are just nuts in terms of science.But why then, do I think it's a piece of art? Probably because it sooooo well filmed and edited! Together with the superb music and acting, the movie engulfs you in a type of tension I've not experienced in a long time. I think that is one of the main reasons why you should watch this movie. Not because of the action, not because of the great story, but because of the atmosphere it sets and the way it's filmed, edited and acted. For me, it is a piece of art."}, {"id": 530, "text": "I am a huge fan of Sci-Fi I always have been so when I heard teasers of this film over the radio I thought this sounded intriguing.I deliberately kept away from watching trailers and reading description's because I wanted to just watch it and learn its secrets as they unfolded.2 Hours of slow misery with some nice CGI and absolutely no explanation for what went wrong with the Earth.My guess is Clooney has been visited by Greta Thunberg and she told him its all going to hell in a hand cart if someone doesn't do something by 2049.In 1968 in 2001 A Space Odyssey Stanley Kubrick and Arthur C Clark had worked out that if you were willing to wait a while you could communicate from Jupiter with Earth using radio signals. Why didn't somebody from NASA tell the 5 people on board the ship stolen from Passengers that Earth was done for, before they started to head home?3 stars for the effects. Paint drying has more excitement about it."}, {"id": 531, "text": "Do you know how many people have died during a spacewalk? Zero. Do you know how many people die during a spacewalk in any movie with a spacewalk scene? At least one.I'll start with the positives. It looks great and the acting is great.Okay now with the negatives. There are two stories occurring at the same time. George Clooney and some little stowaway girl try to reach out to a space ship and warn them about Earth's mysterious apocalypse to tell them to turn around and go back to the moon of Jupiter they visited. There is also the story of that crew. Without getting into spoilers, Clooney's story line ends up being entirely pointless. Legitimately his actions cause no actual significant change in the actions of the space crew. That's cool.It's also incredibly predictable. Like I mentioned earlier, there's a spacewalk scene. You can predict how it goes just by knowing that one fact if you've ever seen any movie with a spacewalk, down to the timing of the ominous music.It also has some of the most funny cliches I've seen in some time. Two of the characters previously thought to be unrelated are actually... related??? No way. One of the characters was actually... in the imagination of another character??? Shocking.With the interesting concept, quality acting, and great effects, it could have made for a relatively compelling drama even with the predictable and cliche plot you've seen a thousand times before. My biggest issue is that certain choices made by the writers of this movie just make you go, what? why? As an example, some other reviewers mentioned that the actual cause of the apocalypse is not mentioned in the movie. Normally that would be fine, often things are scarier when left to the imagination. But it is obvious there is something released into the atmosphere that is making people sick, hell there are even shots of the Earth showing it covered in some weird yellow clouds. The issue with the exact cause not being mentioned is that you as the audience have no clue how severe it is. I thought it was literally world ending but some characters make decisions that lead me to believe it may be more of a screw with society issue than a kill everyone on earth issue. And it is so obvious the effort they put in to AVOID saying what caused it. It's not like they don't happen to mention it, it's that the screenplay does everything in its power to skirt around mentioning it.It's just things like that which make it harder for me at least to get invested in what the characters are doing and saying. Some people seemed to have really enjoyed this movie, good for them. It was entertaining, a perfectly average movie if you're just looking for something relatively inoffensive to watch with family or friends. 5/10 stars, meh."}, {"id": 532, "text": "Ok so its a drama, not really scifi as such but oh dear its soooooo boring and there is so much unexplained in the beginning - where did all the people go? At first we thought they were all evacuated to another planet and why was this planet found and why did humanity die out? If you are going to write a script then try and tie things together and give us some continuity at least.Then we stir in the woke element, once again a white woman and a black man, the new Adam &amp; Eve - give us a break its getting really tedious and add to that the terrible acting from some of the cast and it just sucked big time; so much so that i was clock watching - Always a bad sign!The ever so clever crew are bigging this up as some sort of masterpiece - wow just wow how some people can be so deluded and up their own hosepipe and actually enjoy 2 hours of nonsensical mental mastvrbatory deluson and ohhhhhhh those whining violas in the background.In short everything that could go wrong with a movie does in this arto-farto taken from the usual prize winning boredom on paper written by a woke liberal feminist no doubt - Give me a break this is the end of cinema as we know it!"}, {"id": 533, "text": "Another nail in the coffin of 2020: Gorgeous George lost his charm, and nearly took Kyle Chandler with him.The Midnight Sky is a joyless morose thing with no redeeming features. If you want to spend two hours with a dour dying Santa Clooney trying to save the last remnants of humanity (a few people hurtling home from a moon orbiting Jupiter) from a radioactive earth then you might be hoping for some thrills and spills along the way. Unfortunately, what you get here is plodding pacing, insipid dialogue, wooden acting, a musical score that kills everything faster than whatever is killing George, and daytime soap opera lighting from the 80s.There are a few scenes that look well, but where they should be thrilling there's just no sense of threat. At all. Mostly this is the soundtrack's fault, it's that kind of overly loud nothing score that hints at everything but tells you nothing which spoils any atmosphere. If you can get past that, then there is so much coverage in places where the action needs to be fast and snap you to the edge of your seat that you find yourself counting each blink of your eyes just to feel a sense of time passing."}, {"id": 534, "text": "Initial Thoughts: Whether or not this film stays true to the book. I do not know. At two hours in length this film feels like it's story is both too slow (following a group of astronauts floating through space) and too fast (random scientist that's able to cross a frozen tundra in what feels like a day). We're randomly brought to this lone scientist on top of the world waiting to make radio communications with the last group of astronauts in space. No backstory is indicated right off the bat about what's happening, one would expect to get more info as the film trucks along. However, that is not the case as we still don't by the end what state the world is truly in. Alas, this could've been a mini TV series as opposed to a film to draw out more info and hopefully more excitement.Overall: While not a complete bore fest. I definitely won't be calling this a must see. I did enjoy George Clooney's role in this film although his scenes were more exciting. If you decide you want to watch this film. Watch it midday so you don't feel like you've wasted all your time and you can still be productive before bed.Enjoy the show!"}, {"id": 535, "text": "Greetings again from the darkness. Screenwriter Mark L Smith has described his adaptation of Lily Brooks-Dalton's book, Good Morning, Midnight, as a cross between the Oscar-winning GRAVITY (2013) his own THE REVENANT (2015, nominated for 12 Oscars). It's a lofty comparison, and unfortunately, one that doesn't prove out. Two-time Oscar winner George Clooney takes on the dual role of director and lead actor, and it's his first movie role since 2016's MONEY MONSTER.Clooney plays Dr Augustine Lofthouse, a renowned scientist, and the only one staying behind as everyone else evacuates the Arctic Observatory after some unspecified event as left the earth uninhabitable. Augustine has a terminal disease (also unspecified) and evidently decides to stay behind because he likes drinking alone and self-administering blood transfusions. The drinking alone fun ends when he finds a stowaway young girl named Iris (Caiolinn Springall in her first film) and must assume the role of father-figure. To complicate matters, Iris doesn't speak.It's 2049, and the film cuts between 3 storylines. While Augustine and Iris and working on a survival plan, we get flashbacks to a time when he was a younger scientist (played by Gregory Peck grandson Ethan Peck) and sacrificing a relationship with Jean (Sophie Rundle, Peaky Blinders) to focus on his career. The third story occurs simultaneously with Augustine and Iris, and involves Aether, a manned spacecraft on a years long mission to determine if Planet K23 can be inhabited by humans. The crew is commanded by Adewole (David Oyelowo, SELMA), and includes his partner, a pregnant Sully (Felicity Jones, THE THEORY OF EVERYTHING), pilot Mitchell (Kyle Chandler, Bloodline), navigator Sanchez (Demian Bichir, THE HATEFUL EIGHT), and rookie astronaut Maya (Tiffany Boone, Hunters).When Augustine learns of Aether and its route back to Earth, he takes it as his responsibility to inform them that they need a new plan. In order to do this, he and Iris must trek across the frozen Arctic tundra through a blinding snowstorm to reach the satellite equipment that will allow communication with Aether. This road trip through a whiteout allows for the best effects during the Augustine/Iris section. Aboard Aether, the crew is relatively non-descript, but there is a spacewalk segment that is quite something to watch thanks to the cinematography of Martin Ruhe. There is also a visually interesting segment featuring blood in zero gravity.So what we have is a three-piece post-apocalyptic science-fiction space survival tale with a surprise twist that won't surprise anyone. It's likely meant as a warning about how we are destroying our planet, and global catastrophe may not easily be solved through space exploration. The film presents an interesting symmetry between the vast wasteland of Arctic winter vs the vastness of space ... neither seem to have borders or boundaries, yet are fraught with dangers. If you pay much attention to the story, you'll likely be disappointed; however, if you watch for the visuals, you should be fine. Premieres on Netflix December 23, 2020"}, {"id": 536, "text": "Listen up all you politically correct climate change protagonists, This film is a disaster in so many ways. As many have already said what is the point and as many others have said that there is a point. Well there is not! This is a film made for morons by morons to propagate a sham about climate change and to enhance the ever deepening stupidity of the population. Make no mistake this is also a political hit film. The first thing you have to understand is the depth of depravity that Hollywood sinks to to make money. Every time a film comes out there seems to be a news headline coming from one of the lead actors that has some sensationalism attached to it to draw attention to the film in a round about way. This time we have this total idiot Clooney making statements about our elected president that he can see Trump in prison and in an orange suit. Yah right. Thanx George for your so enlightened and informed point of view. If it was not for the obvious dis-ingenuity I would say that you are showing signs of early dementure but this is untrue. You do this totally calculated and for profit. Shame shame shame. The good news is that you have successfully totally undermined your credibility. Do not watch this idiotic film please."}, {"id": 537, "text": "IN A NUTSHELL: This dramatic sci-fi takes us on a journey through time and space in a post-apocalyptic world. George Clooney acts and directs the movie, describing it as a mixture between The Revenant and Gravity, explaining, They're not natural fits, so it was a constant balancing act. It's based on the book Good Morning, Midnight: A Novel by Lily Brooks Dalton. The movie has nothing to do with Miley Cyrus' new song Midnight Sky.TIPS FOR PARENTS: Some profanity and an F-bomb. People in perilous situations. Kids are going to be bored. There's a scene with a lot of blood. DeathTHEMES: Terminal illness Life and death Absentee parenting Hope Family Parenting SacrificeTHINGS I LIKED: As mentioned, George Clooney directed and starred in the movie. He actually lost 30 pounds and was hospitalized for pancreatitis for this melancholy role after only filming 4 days. The talented cast also includes Felicity Jones and David Oyelowo. It's a shame that Felicity Jones and David Oyelowo didn't have that much to do considering what great actors they are. The CGI is really stunning. The cinematography is awe-inspiring and elegant. Because of the vastness of space and the scenes in the snowy landscapes, try to see it on the biggest screen you can. I thought the video game that Kyle Chandler was playing looked really fun. I've never thought he was a very compelling actor, but he actually did a great job in this film. Caoilinn Springall is adorable as Iris. The song Sweet Caroline will always add energy to a room or film. (This movie needed a dose.) The musical score created a nice background and was never overbearing, like some movies about space can be. The trailer doesn't give away any spoilers. The locations feel real and lived in. There is an interesting twist. It brings the feels in compelling ways. I read that they filmed the snowy scenes in Iceland and had to go inside every few minutes to warm up because it was soooo cold.THINGS I DIDN'T LIKE: The film's ideas, story, and even visuals are often borrowed from other movies and it feels like it. Because of that, the movie is a bit messy and predictable. A lot of time is spent in the beginning watching George Clooney get sick to establish his character's situation. Kids will tune out immediately. There is some jumping back and forth in time, which might confuse some viewers. As a result, the narrative feels a bit choppy. Because of the length of this movie, you feel exhausted, waiting for something to happen. If you're waiting for more information about what kick-started the apocalypse in this movie, you'll be disappointed. It's not really the point of the movie. The dialogue feels more like exposition than genuine communication. There is no bridge that transitions some scenes with other ones. They don't make any sense until you get the twist at the very, very end of the movie.You can see the rest of my review at my Movie Review Mom YouTube channel and website."}, {"id": 538, "text": "You'd have to go back to 2011 for the last time I saw a film directed by George Clooney. It was The Ides of March and I remember being pretty impressed with what he brought to the table. That being said, I've naturally associated him more with acting and he's given some really good performances over the years. Clooney returns to directing himself in a film, after taking a break in Suburbicon, with The Midnight Sky, a new science-fiction film from Netflix.Following a mysterious global catastrophe, Augustine Lofthouse (George Clooney), a lonely scientist in the Arctic, races across treacherous terrain to warn a crew of astronauts from returning home to a uninhabitable planet Earth.If you're looking to settle down and watch an uplifting film over Christmas then The Midnight Sky is most definitely not the film for you. It's a slow-burner and, while that doesn't necessarily make it a bad film, it doesn't really feel like it goes anywhere, particularly ending with quite a whimper after quite a promsing set-up. For a year where a lot of us have spent it not seeing many people outisde our own home, The Midnight Sky probably comes at the worst time for Netflix as it does really meander along in a depressive state.That being said, while I found the narrative a little too inaccessible, The Midnight Sky is a film that does feature some fine aspects in other areas. The score from Alexandre Desplat is a delight, quiet and dreamlike in the background, while Martin Ruhe's cinematography does a great job in emphasisng the isolation of Augustine in the Arctic.Coming to the performances, Clooney and his supporting cast deliver a decent standard but are let down by not much of a script to work with. It's an ambitious sci-fi film for sure but I felt it didn't quite know what it wanted to be, and it comes across that way with the performances. For a film that boasts such an impressive cast, you can't help but expect more.All in all, The Midnight Sky is a bit of a mess from George Clooney, starting quite promisingly before falling apart as a result of tonal confusion and a final act that might reach for the stars but ends up failing to launch."}, {"id": 539, "text": "Here's another space flick that George Clooney is involved with that gets all the significant technical stuff wrong. What _is_ is with actor/writer/directors that they Dunning-Kreuger their way into making crappy flicks? I don't care how much eye candy you throw at a bad script, if it's bad it's still bad.How many times must we watch flicks that have a reveal which is telegraphed from nearly the beginning of the movie? Why do we have to be dealt surprises that come out of a well-worn bag of tricks that all moviegoers have memorized? How come all flicks with paper-thin characters have the same identical feel-good sequences to fill in where real character development should be?There is a lot of good medium-specific storytelling going on in this film. I can see cinema students studying this turkey for a lot of good art and filmmaking technique. Sadly, stories are not composed of art and filmmaking.I won't bother to go into technical details nor unwrap the colossal holes in the plot. Just let's say that this attempt at setting a mood makes a futile gesture at poignancy while succeeding only in being depressing and ultimately pointless. Give it a pass."}, {"id": 540, "text": "This film has lots of potential but unfortunately the great actors and visual effects fall flat due to a terrible script/editing that feels like 2 diff stories that unfortunately do not really come together. The pseudo Revenant-like Clooney character story is all over the place and is way too long with flashback story that is full of holes and is instead of being inspiring it is rather dull and bleak. And the pseudo Gravity/ Interstellar rip off story is compelling and a vfx feast for the eyes but it feels like it's also missing lots of back story with huge holes like either the writer lost the ability to pull both stories together or it's lost in the editing room so instead it ends up feeling like small parts of 2 stories without any real appeal or cohesiveness. It should have been either one story about a mission to K23 or the other dull Clooney story which is all over the place but instead is just trite and meaningless and you truly wonder what was the real message. Clooney does a good job directing but this must have been a nightmare to edit yet kudos to his accomplishment but it's sad to see the terrible script ruin the entire experience. Spoiler - just one of many holes in the story - the mission flew all the way to K23 and back but somehow never was informed by NASA or anyone that earth is self destructing/polluted and yet the entire planet has time to prepare and go into hiding. Huh?? A 4 stars only for acting and vfx effects"}, {"id": 541, "text": "Decent story, very good acting, fantastic visuals honestly, but a number of scenes really didn't need to be so slow. We could've gotten the mood the film was going for with just 1/3 of the slow stuff, seriously.But going beyond all that, the real, deep tragedy of this film is that it highlights once again what a dead-end the American culture and imagination is at this point. All that these depressive U.S. doomers writing scripts nowadays are capable of coming up with are post-apocalyptic stories where the world keeps trying to do business (and war/politics) as usual despite all the evidence of the irreversible destruction it's causing, everything we cared about on this planet nearly or actually goes to hell, and meanwhile we're supposed to believe either in some magical technological solution popping up out of nowhere (Interstellar) or some impossible move off-planet to somehow still save our species (meaning just a few individuals with no hope of actually rebuilding the species). The only glimmer of hope in this climate comes from China - even their sci-fi is about global cooperation, not competition; collectivist thinking and efforts, not rabid capitalist individualism (see The Wandering Earth). If we're going to survive this century it will be through massively ambitious Chinese style constructive solutions. All the U.S. has for us now are visions of doom and destruction."}, {"id": 542, "text": "Most of what I will discuss here can be glanced in the trailer. The story of 'The Midnight Sky' revolves around a space exploration vessel returning to earth in the year 2049 after visiting a newly discovered 'habitable' and earth like moon of Jupiter. Scientifically speaking that is a major stretch on a number of levels, but that is only the start of the credulity stretching. But as it is a central plank of this drama, and 'The Midnight Sky' is more a space opera/ drama than a solid addition to the science fiction genre.The back drop of this mission is that the ship is returning to an Earth ravaged and doomed by an unspecified plague of some sort. Given what is happening currently in 2020 the plague is at least interesting. But that in itself is not near enough to rescue this film.For some reason the ship's crew did not expect to be able to contact earth when there were at Jupiter, which is odd as Jupiter is not that far away. So this device is used to establish the fact they are returning, rather unconcerned, blind, to a planet that is doomed. Contrivances like this in the film make it hard to watch, and statistically most of the audience are smarter than this film is.The acting is passable, but only because the script itself was fairly wooden. George Clooney is watchable as ever, I liked his performance and his dedication to sci-fi. But his talent is wasted in a project he had a large hand in brining to the screen.'The Midnight Sky' delivers a predictable ending though there is a slight twist. But this delivers a moment of 'oh' rather an a satisfying 'ah'.The sets and visual effects are excellent, which is the only reason I give it any stars at all. But I wondered why the movie surrounded its fairly accurate space physics with action the events that would look more at home in Star Wars. In this films' version of the future astronomers are obviously blind by profession, as aside from an undiscovered utopian moon around Jupiter they also missed flocks of icy asteroids in 'unexplored regions' of near Earth space. 'The Midnight Sky' may as well have went the whole hog and had sounds effects in the vacuum too.All of this might be excusable if the film delivered engaging drama, but as it does not one has to wonder why it was made at all. Science fiction requires some suspension of disbelief to work. But it cannot work as either science fiction of drama if the abandonment of common sense is also a requirement; which it is. I wanted this film to succeed, I really did, but I am sad that it failed on so many levels. With a currently captive audience, starved of new releases, 'The Midnight Sky' is a major missed opportunity."}, {"id": 543, "text": "With some movies you regret watching them. Some movies you can imagine or even you know you will watch them again some day.This is in the middle. The visuals are great, especially the space ship. Looks probably a bit to much designed then realistic but it is ok. It is not nuts.At all looks great. No fast moving cuts, nearly no confusing time jumps. It is lineair.But with that I have used all the positive things I can say about it.The story is more a concept then a story. A big reveal at then end about one of the characters is not original and I suspected it and I was correct.It just does not make a lot of sense. You are left with a lot of questions and not in a good way."}, {"id": 544, "text": "* There is no end credit scene *The director George Clooney and crew brought a bland emotionless adaptation. The story sets when a scientist races to contact a crew of astronauts to stop them from returning due to a global catastrophe on Earth. I didn't have any expectations, I really wanted to enjoy this film as it is but it lacked feeling. The main theme was to never let your goal or ambition get in the way of having a life but it was projected very weakly. The storyline was vaguely similar to Interstellar (2014) but it can never be compared to or even be on the same level, far from it because the film Interstellar is a masterpiece and The Midnight Sky was the complete opposite. I like dramas, I also like any kind of structured pace and there are a lot of great films with a slow pace but this storyline was flat. There was no suspense and I blame the music for not properly establishing it. The ending was expected due to the foreshadow which can be caught so early in the movie. The only thing I liked was the beautiful visuals so mesmerizing I was in awe but it doesn't save the film.The composer Alexandre Desplat was all over the place, the music didn't fit with this kind of movie and it was making the scenes so annoying. I think if the music was different it could have changed the perspective of the film because the music is the most important part of a movie without it there is no emotion. This composer has many great scores but sadly he failed in this one.The cast was solid every single one of them the problem was not their performance it was the direction, the script, and the music. George Clooney was not only the director he was also the main actor and he was in great space films like Solaris (2002) and Gravity (2013). Both of those movies are magnificent but The Midnight Sky was not a good film."}, {"id": 545, "text": "The movie begins well, then after, the typical scenario of cruel unpredictable events prevails, probably, in order to make the movie enjoyable to that bunch of trivial audience. In my opinion, the mistake has been to adapt the movie in survival purpose for entertaining, so the viewer is forced to assist to a sequence of unpredictable negative events programmed by the storytelling. Is it possible that from the first contact to the last one there are just oppositive facts forcing to survive? It's unreal when the ratio between cause and aftermath lacks. As example, Aliens is an action movie where every negaive event has a precise cause. This happen why. The unpredictable event has no precise cause, so when many of them happen, a story risks to be trivial. The excellent choice to make the dialogues among the characters more mature above all in scientific terms, so to give more realism to the narration, inevitably contrasts with the randomness of adverse events which happen continuously both in space and in earth scenario. The message of the movie is the value of family affections so to try to make better the world in which to live."}, {"id": 546, "text": "Once you attain a pinacle with a handful of Sci-Fi movies, like Interstellar and few others it is a serious task to match, but even more difficult to surpass. No smart dialogues No smart acting, when you think of it. Clooney is Clooney but in the end, keeping quiet (it is a lot of quietness) doesn't add up too much. No smart ideas. We're in the age of quantum computing, and I expect some basic knowledge in science should be known.... An undiscovered planet around Jupiter... really? It sounds like hey, I just noticed a second car in our garage. How come we didn't see it yet?... Heated from inside?... I can't even be sarcastic on this.... All planets over a certain mass are hot inside due to gravitational pressure and in some case due to gravitation interference, but... that seems to be a quite tiny since it was not yet discovered. I can imagine from Galileo's time till now, every time we, the earthlings, pointed a telescope in that direction, the phone rang and we always missed it... So, the final score: 1. Originality - 2 2. Acting -3 (having a beard looking at the sky is not exactly acting) 3. Effects - 7 4. Informative - 0 And finally: 5. Diversity - 10 (no comment on this)Definitely, not a movie for collection. More like, we have some time, let's kill two hours somehow."}, {"id": 547, "text": "The Midnight Sky is George Clooney's first film since Money Monster which I haven't seen yet. Clooney isn't just the star, he's also the director. The Midnight Sky was okay, I won't see it again.The film has two storylines: Clooney's character travelling through the Artic and the astronauts flying back to Earth. I can safely say everyone prefers the Artic storyline and the film should of focused more on that. The astronauts are likeable but bland, nobody is annoying.Midnight Sky is slow which is fine but the pacing is uneven. The astronaut storyline is stretched out, I can safely say everyone prefers the Artic storyline. Yes, the acting is good. The visuals are good mainly the space stuff.Overall, Midnight Sky was okay. I didn't mind seeing it but I won't see it again. If you have Netflix, you could give it a shot."}, {"id": 548, "text": "Director George Clooney mixes a lot of concepts of other movies into his film and combines them to The Midnight Sky. Well, some of that is almost insulting because the references are so obvious and even come from some of Clooney's previous films. I am not sure if that was lack fo creativity or laziness. There are at least the stories and concepts of 5 famous films involved in this one. That fact makes it really hard for me to give Clooney's newest feature a positive score even if you can see how ambitious he was with this project and you got to respect that too of course. The film ended up a bit messy and went kind of nowhere. That is sad because its own concept is actually very good and the first third of it was also very promising and had a lot of potential. Also the actors are good. George Clooney plays the lead, not being afraid to show his age, and he does it very well. Good performance for sure. I also liked Felicity Jones who yet gives another strong performance. David Oyelowo was a bit wasted but Damiea Bichir and Kyle Chandler gave good supporting performances. There is a wonderful score by Alexandre Desplat and some incredible visuals. So yes, all what is needed to have a big winner picture at hand. But Clooney lost it a bit with his direction and the screenplay also needed much more work. Too bad, wasted potential. Not a strong film at all but at least with some strong elements."}], "reviews_amount": 549}