{"name": "Guest House", "titleId": "tt10054316", "reviews": [{"id": 0, "text": "As one of the worst movies of our time. Not since Pauly played Peewee has he been worse. Trashy nonsense and horrible punchlines literally jambed down your throat in lew of humor. Unsettling"}, {"id": 1, "text": "I was excited to see Pauly Shore and don't regret paying to rent this because at least the money will go to the film crew who worked hard. That being said, this movie has nothing to offer and is empty and the lead actors playing the young couple are so utterly dull and unlikeable. But the worst offense of this film is that: IT IS NOT FUNNY. Not one second. Really bummed me out because I needed some funny."}, {"id": 2, "text": "When the creators are clueless of what comedy is.Rated R for strong crude sexual content, drug use, graphic nudity and language throughout - Apparently this is what comedy is these days..."}, {"id": 3, "text": "I am very forgiving when it comes to comedies but there is nothing to recommend here. worst comedic actiing ever"}, {"id": 4, "text": "This film start with a footage of a bunch of people partying, and three years later a couple(Blake and Sarah) visiting a house to move in scene! As turnout, this film is about Blake and Sarah need to dealing with a man Randy, who disturbing their life by occupying their guest house, and refuse to leave! Entire film full of boring conversation, and super annoying overuse scene! Such as, overuse of the copulate scene, overuse of the partying scene, overuse of the song playing at the background scene, overuse of the taking drug scene, overuse of the arguing scene, overuse of the slow motion causing havoc scene, and overuse of the blackout scene! Make the film unwatchable! Barely intense scene is, Randy disturbing Blake's friends with a possum! At the end, after leaving Blake and Sarah house, Randy still want to visit them! That's it! Wasting time to watch!"}, {"id": 5, "text": "Bad acting, bad scene transfers, missing back stories."}, {"id": 6, "text": "Probably the worst movie that I've ever seen. I don't understand how people are rating this movie so high."}, {"id": 7, "text": "When you're looking for an easy to watch, stupid comedy; skip this one. It's very stupid, just not easy to watch."}, {"id": 8, "text": "Effing awful. Nothing funny about it. At all. And I love dumb funny movies. It wants to be an Adam Sandler movie but couldn't, no matter how hard it tried. It's terrible. The characters don't have any chemistry, pauley shore is still pulling the same bs he did 30 years ago, and it rips off every funny movie it can in an unsuccessful way. Do not recommend. Watch Joe dirt. Watch grandmas boy. Watch anchorman. Leave this one in the garbage where it belongs."}, {"id": 9, "text": "This film was garbage and not funny, they used dumb stunts , explosion, and drunk parties to hype the film but it did nothing. The plot line is so dumb and unrealistic, this dude would have been evicted immediately. What annoys me the most is this women placating this loser while never doing anything herself, waiting for her crap boyfriend to do nothing and staying with him. She has crap taste in men, then marries him after this? What? This offends me as a women watching this, it's a terrible depiction. F%$#king unfunny trash film.Also, even high I found this unfunny, maybe a few chuckles."}, {"id": 10, "text": "Yes what can I say..... I don't recommend this movie unless you have watched all the classic movies again and don't have anything else to watch."}, {"id": 11, "text": "Quirky and at times hilarious.A fun ride back to the 80's in feel of this movie. Pauly was great in this and I wish and hope to see him in many more movies!"}, {"id": 12, "text": "I guess if you can't find anything to watch, give it a shot. I didn't find the movie very funny, but it wasn't bad. Solid 5 star film."}, {"id": 13, "text": "Zero redeeming elements. Zero laughs, even at absurd premise, situations, and general ridiculousness. Like the audience at Billy Madison's debate, I am dumber for having watched it. If I could figure out how to give negative stars, I would."}, {"id": 14, "text": "It's time to stop trying to be what u were in the 90s. The weasel is dead"}, {"id": 15, "text": "What do expect watching a Pauly Shore film in 2020? It has some laughs but that couldn't help this one. If you were a fan in the early '90s this does bring back a little nostalgia. Just remember I said a little bit."}, {"id": 16, "text": "Not a 10 but gave it a 10 to help balance out these low reviews. It's a decent movie."}, {"id": 17, "text": "Crap rehash of better movies WTF call the cops already 😒"}, {"id": 18, "text": "Bad acting and crap story line but it's alright. Amazing how they got good comedians for this film. Bobby Lee should be in it more"}, {"id": 19, "text": "I mean here's the thing. What do you expect with this movie going in? An award winning Oscar comedy? If so- you're an idiot. If you go in expecting a 90s style Pauly Shore movie in 2020? If that- this movie is an all time classic."}, {"id": 20, "text": "Usually when a movie is this terrible, you can still watch it and laugh at it instead of with it. Guest House is so badly written with such unbelievable plot lines that it's actually painful to watch. It's just one stereotypical situation and cringe after another."}, {"id": 21, "text": "Not as bad as other reviews are saying. Its an ok movie"}, {"id": 22, "text": "To paraphrase the famous writer who put it more eloquently than me, this is one of those movies where you hate the good guys, are indifferent to the bad guys, and wish they'd all drown together.In fairness, the fact that it stars Pauly Shore and some guy from Jackass was warning enough."}, {"id": 23, "text": "This movie is bad, really bad, really really bad. Stupid, really stupid, really really stupid. Don't waste your time. This movie should never have been made. It is so bad I am pissed that Netflix put it out."}, {"id": 24, "text": "Its not going to win awards but if you want something light and funny in a crazy 2020 this is good to let loose and smoke one too imo I am a Pauly fan though and bio dome was jokes"}, {"id": 25, "text": "Pshhhhhhh. I wouldn't watch this again if my life depended on it pal. 9/10. Needs more ditties and definitely more Coogi."}, {"id": 26, "text": "This film is fun and at times, very raunchy and uncomfortable, but in a long run, it is fun, and surprisingly, has a lot of heart. There are graphic scenes with explicit content, but they only last a few seconds. The swearing is also a turn off, but aside from that content, the film is rather fun and entertaining. It is definiently one of the more original comedies that have come out recently- especially without political ideas pushing the plot and the jokes. While the film starts out slow and raunchy, it gets cleaner and funnier towards the end."}, {"id": 27, "text": "As a Pauly Shore fan I really wanted to like this movie. However, the whole film was like the movie Neighbors with Seth Rogan &amp; Zac Efron. The only difference here is the over the top nudity and drugs. They could have made this film much more original and funny, instead it left me unimpressed and disappointed ."}, {"id": 28, "text": "What a piece of garbage. Couldn't get past 10 minutes. Netflix should be ashamed to produce such garbage."}, {"id": 29, "text": "This flick was very surprising. Pauly Shore is back y'all! As well as many cameos from other comedians which takes this film to a new level. Very shocked by how graphic the nudity was, which is usually lacking in comedies today."}, {"id": 30, "text": "One star for the nudity. This movie blows. It is amateurish, ridiculous, unfunny, poorly executed in all aspects. Anyone who gave this anything more than two stars is a moron."}, {"id": 31, "text": "Wow, this was bad. I put it on for background noise while I was doing something else and it didn't even work for that. It's kind of like a bad version of Home Alone for adults, where the squatter in the guest house and the homeowner plot to take each other down. Add drug use, sheer stupidity, and a horrid soundtrack and you get this. I especially feel bad for all the opossums of the world. Had the writers done any research, they would have known that opossums can't even get rabies. If I were an opossum I would sue Pauly for slander. Ugh."}, {"id": 32, "text": "Really bad acting, not worth it. Tried way too hard to be funny. Only finished watching it because I'm in quarantine"}, {"id": 33, "text": "I usually only give number ratings, but this was so bad I had to write a review. Trash."}, {"id": 34, "text": "Your assumptions are correct in thinking this is going to be bad simply because it has Pauly Shore in it, but its far worse then you could imagine. The story line is so stupid and unbelievable I couldn't imagine anyone on set thinking this was worth making for anything other then a check."}, {"id": 35, "text": "Try and recall the worst movie that you have ever watched. Go watch that movie. It's probably better than this thing."}, {"id": 36, "text": "If pauly shore and Steve o weren't in it I would give it a 1 because I'm biased. The hallmark score in the background and transitions from scene to scene and script and acting just everything about makes this film is so poor and I'm upset pauly shore did this I'd like to see him make a comeback."}, {"id": 37, "text": "I cant believe someone read this script and decided to green light this less than sophomoric attempt of a comedy movie."}, {"id": 38, "text": "It's not bad and it's not really good. It's entertaining the acting isn't too good at times, but for the type of movie it is it isn't bad either."}, {"id": 39, "text": "Well you should not expect a serious movie, but its seriously fun. Its an easy story and does not have any great surprises, but its still quite entertaining and the women are great... comedys with half naked women is rare these days"}, {"id": 40, "text": "Legit comedy for comedy fans! Bobby Lee is great too even with his little buttcrack!!! Erik Griffin of course is Funny as funk, go Pauly great to see your movie!!!! Spoiler Bobby Lee shows his buttcrack"}, {"id": 41, "text": "This movie is great comedy not a family comedy it had some great scenes glade I bought it to watch over and over and over again. Do you wanna see Bobby Lee start a generator naked this is the movie for you. Great movie."}, {"id": 42, "text": "Totally is back and better than he's ever been. Long live Da Weeze!"}, {"id": 43, "text": "It's worth watching if you have nothing else to watch, I guess. I have missed seeing poly shore in movies, the other cameos were great, and I had a couple good laughs...That's really all that saved it.. It was just weirdly directed and written. It felt all over the place, had not-so-great acting(though I don't totally blame them, they didn't have much to work with) and little character development. It was kind of a terrible movie, haha."}, {"id": 44, "text": "It's Pauly Shore. That's all you need to know if you've seen his movies, some cringe spots but definitely some funny as hell moments. It did its job which was to entertain me. If you need a good laugh and the kids are in bed, give it a chance"}, {"id": 45, "text": "What you expect from a Pauly Shore movie in 2020! Honestly if you thought this was going to be top notch comedy, you need your head checked. I went in expecting exactly what it was, and I had a great laugh watching this. It's a fun movie that shouldn't be taken seriously. Pauly Shore stays true to his character, their's some fun cameos, and wackiness ensues!"}, {"id": 46, "text": "I was and still am a Pauly Shore fan.. And I have to say I laughed and enjoyed this film very much... Don't listen to the haters they obviously don't know Pauly and his type of humor or like it... I missed seeing Pauly in films..and loved this so much I bought this as soon as it came out... I hope more people see this.. It is a fun refreshing film we can enjoy during these stressful times.."}, {"id": 47, "text": "I really enjoyed the laughs. Funny movie!! I would definitely watch it again! I don't know why someone would go through all the trouble just to say you didn't like the movie. I actually found House Guest really funny!!!"}, {"id": 48, "text": "If it rating 0 out of 10 that's what that movie deserves. I could not finish this movie such a waist of time even in Covid times. Do yourself a favor and save your time for something better."}, {"id": 49, "text": "Bad storyline. Not funny. Disappointed with this film."}, {"id": 50, "text": "What a delicious little comedy with the ever incredible Pauly Shore! Thank you for this silly, stupid comedy at a time in the US that needs mindless entertainment to get relief from greedy self indulgent politicians and threatening viruses.This litte gem has a host of well known comedians from SNL, MadTV, Totally Busted, etc Each actor brings their character to life without trying which is the charm of this movie. Eveyone is having fun to entertain the viewer!This movie is a war of wits and will. U gotta see it!"}, {"id": 51, "text": "Really enjoyed this film I can't understand why it has so much hate. Very funny and good acting by the main characters with a reasonable storyline. If you're anti drugs you probably wouldn't like it but I'm a realist and appreciate peoples hard work."}, {"id": 52, "text": "Pretty sure you gotta be baked, but I liked it ahhahahahaha Weeeez the juice baby"}, {"id": 53, "text": "Awful movie. Fireworks. Wished. Riebe fbowbr. Ridge. Fig t. Eioofodiqjr t didiebwbsofb. Thrown r"}, {"id": 54, "text": "I like this movie, i am a big fan of Shore his movies. This one was a fun movie to watch. Don't take it tot serious, just sit back and enjoy."}, {"id": 55, "text": "So it was a fun movie, nudity was fun, etc etc.. the character that Paula shore play was a complete a**hole. He was basically a squatter and in the real world would have been kicked out and arrested immediately. The other issue I had was the opossum scene. The whole rabies shot thing was stupid they don't carry rabies. Any sr would know this they obviously didn't even bother looking this up. Just kinda lazy"}, {"id": 56, "text": "This movie is the worst 'comedy' I've ever seen. Horrible acting, the characters aren't like able or believable, any characters in this situation would've made sure the guy was moved out way before the even bought the place, why is he even allowed in the guest house if the property has been bought to resale by an estate seller? Why are these so called 'goody-goodys' so easily swayed by temptation if they're so established as so called busy bodies? Why all the lame bottom of the barrel jokes? You know your movie is in trouble when Steve-O is the best and most believable actor of the group. If you want a better way to spend your time, try staring at a wall and watch paint dry instead."}, {"id": 57, "text": "I got what I wanted, silly pauly shore movie with over the top nudity, And general depravity. These sorts of movies died out unfortunately, good to see them make a come back, would suit date night movie, doing drugs movie, watch it high etc. not that I was high, but that's would would get the most out of it. Lots of nudity, lots of drug use, a few jokes. Something light hearted to waste a couple hours,"}, {"id": 58, "text": "Blake (Mike Castle ) and Sarah (Aimee Teegarden ) buy a house, one where an aging hippy Pauly Shore lives in the guest house. They can't get rid of him and he disrupts his life. Billy Zane is Sarah's dad and does not like Blake.The comedy is forced and not really funny. Pauly could use a little Botox.Guide: F-word. sex, FF nudity."}, {"id": 59, "text": "Copycat is fine but if something so similar and expected, why need to film again? Also, the characters in there is dull. The couple are so stupid didn't fit the wealthy background. The guesthouse dude not funny at all. Not add up."}, {"id": 60, "text": "This looks like a bunch of Hollywood buddies got super stoned, wrote a movie and somehow managed to get it made. It has a few chuckles and some unexpected twists, plus a surprising amount of slow motion action shots, but I would not want to see it twice. There are some funny actors in it at least, and Billy Zane of all people. I really believe this is a circle of friends who slapped this together and acted in it themselves."}, {"id": 61, "text": "This is obviously a make for the younger part of the audience out there, where playing with drugs, liquers, partying and the sexual karma plays a big role. its like porky's movies of the 80's, and a bit hanky panky bachelorparty stylish, where there arent any seriousness neither here or there, and the fire and police squads are just a freakin joke. it has material of high laughing factor and with all the nudity involved im surprised it has only the r-rating. the acting are what you may expect of a cheech without chong comedy, not outstanding, but blend in quite well with the choice of musical score, and the filming are pretty genial at small spots.the story is about a couple that buys a property with a catch, a tenant that still lives in the guest house, left there by previous owners, and this fella is a highflying weed huffing puffing speedster doing flikk-flakka and lsd yoga by the pool in the garden. unique it isnt but its a feverish and powerfull ballad of wrecking a solid relationship that happens here.the grumpy old man would have trickeled saliva and laughed out loud if i was a teen today, its a funny film though so a small recommend."}, {"id": 62, "text": "First, if you don't like Pauly Shore, you may not like this movie. I do like Pauly Shore (or at least I liked all of his movies, and still do), so maybe my review is a little biased, but I've also seen like 15,000 movies (literally) in my life, so I think it evens out.When you've seen a lot of bad content, you realize this isn't it. It is however a little* on the cheap side, and isn't that funny at some points. That being said, it's actually fairly entertaining to watch, especially if you've ran out of good content like me (HBO and all the premium channels literally won't have even one OK movie I haven't seen, unless I missed something years ago before content was so readily available, which does happen from time to time).This movie isn't anything new, but does meet my criteria for a not-bad-pothead-film (it teaches something, has a few funny jokes, the acting is actually believable, has hot girls, etc.). The director did a good job on this film, actually, in my opinion -- it doesn't seem overly cheap and actually has a couple good special effects.The best part about this movie is actually the ending, but I won't spoil it. Anyone saying this movie is really incredibly bad has been REALLY spoiled by hollywood, though.Also, there should be a rule, established by this movie -- if you're gonna let Steve-O on screen, at least also let the legend that came before him on MTV come along too (and who is arguably funnier and more talented, at least in his time, if not still).Just don't expect too much, no offense to the movie. It's pretty good, but just don't want to get anyone's hopes up. If you don't expect too much, I think you'll be surprised and find it a good movie."}], "reviews_amount": 63}