{"name": "#Alive", "titleId": "tt10620868", "reviews": [{"id": 0, "text": "Typical zombie story. Obviously the budget is limited so the whole movies was filmed in one city block to cut down on expenses. Decent acting but some details were missed. The boy stayed in that building for so long. And even though he had tainted short hair. And presumably ni beard hair. His look didn't change one bit. Kind of an obvious point... Other things like the the fact that zombies hear noise in an apartment several levels up from down in the street. And somehow manage to identify exactly where the noise is coming from. Even for a normal human being. That's extremely difficult. I could go on for a long time with these remarks but it's ok for a Netflix movie. Worth watching if you're a zombie film enthusiast"}, {"id": 1, "text": "Yes, it was almost like a remake of a French zombie film, The Night Eats the World, about a male survivor communicating with a female one, down to the zip-lining to the other building. But the Korean one tried to hard to be cute and romantic for its own good. Yes maybe it will be more marketable in Asia and the ending is more uplifting, however it's not better than the French one."}, {"id": 2, "text": "I enjoyed the film. The effects were hood with the infected and well acted by all......including the Zombies. Nothing too gory and the bloody letting is quite restrained really but still nasty enough to give a sense of tension etc. It's a lot more teenaged and romantically themed that the superior French original The Night Ate the World which I really enjoyed much more. But, this is still watchable. Some big plot holes aside its enjoyable and the sense of being trapped is well conveyed. More upbeat than expected. Zombies seems a little easily repelled for my liking....but I guess you can't just have the two cast members killed or film over.The fireman scene and use of a drone was interesting.Not as good as the incredible Train to Busan but worth a watch."}, {"id": 3, "text": "I rather enjoyed #Alive, it didn't feel like the average zombie movie. There seemed to be some parallels between the imagined threat here, and the very real threat, Coronavirus. There's a great scene where our man looks outside fearfully, and then looks at his food rations, something many people have done in 2020.It's very nicely acted, nicely shot, it feels very fresh and current. The moments of horror were very nicely done, and never became too silly. Some nice twists, it's never predictable.It has a real sense of doom, and terror about it, the way things gradually collapse, that said the action begins quickly, they don't hang around.It's good, 7/10."}, {"id": 4, "text": "The first act was interesting but as the story progresses the main character seems to Be dumber and dumber. The ending literally annoyed the hell out of me. Sacrificing common sense for cinematic shots omg. 6/10"}, {"id": 5, "text": "#Alive is a South Korean film by first time director Il Cho. Going into this film I expected an absolute mess, all I had seen was the horrible title. But I was pleasantly surprised with a pretty interesting take on zombie movies. For the most part.Technically I didn't think this film was anything special. No element of filmmaking was exceptional, and no element was awful. Granted there were some awful moments, like the editing when people are turning into zombies is laughable. And the cinematography during action scenes was also just dreadful. For the most part though the technical aspects were consistently, fine.The zombies were very inconsistent. If they are so sensitive to noise why are characters able to talk at all, sometimes when they speak it cuts to hordes of zombies charging in the direction of the sound and this is just forgotten half of the time. Sometimes the zombies are so strong they are able to climb buildings and other times they can't open a door because a step ladder is in the way. I believe this is because of my next point.Bad screenplay. All but two points of tension in this film are down to coincidence. The same scare is used many times, Oh will be doing something like, for example, flying his drone then there is a bang at the door, it's a zombie, at the same moment his drone runs out of battery. The chances of this happening are so slim. The fact screenwriters Il Cho and Matt Naylor use this stupid scare so many times makes me think they just didn't care when writing this film. The dialogue is bad and everything feels lazy.The constant references to pop culture to try and relate to a younger audience really began to annoy me after a while. From the title to the main character Of being a gaming streamer. But the filmmakers don't really know how technology works, holding your phone in the air does not give you more reception. I hate when films waste so much time trying to be hip and down with the kids. By doing this it sacrifices so much time the film could be using to develop characters or create a more compelling narrative.Overall, #alive is a pretty stupid movie that is just ok the whole way through. Check it out if you like zombie movies."}, {"id": 6, "text": "I'll admit that the posters for #Alive had gotten the zombie-movie fanatic within me pretty excited. The urban setting, the spectacular make-up effects, the 'few survivors vs. a massive zombie horde' storyline, and the use of modern-day gadgets - I was quite enticed by these factors. #Alive has a fantastic first act - it's all Yoo Ah-in until then, and of course, the gratifying zombie chaos taking place around his apartment complex. Add some food-related FOMO to that and we have an interesting bunch of scenes stitched together.As expected, not much is detailed about the outbreak except for the basics - these zombies are fast, cannibalistic, and attack in hordes. Things change around the 40-minute mark with the entry of a female survivor (played by Park Shin-hye) who lives across the complex in another building. Hereafter, the cliches start to pile up. They develop a vibe, a couple of walkie-talkies are conveniently found, and they even end up saving each other at different instances. Yet, it's the predictably bland final act that makes #Alive a middle-of-the-road effort.The set-pieces are all racy, hair-raising, and effective, even if one feels tempted to revisit and question how certain scenes play out. With a highly animated zombie mob hot on the trail of the protagonists from start to finish, the action has a well-choreographed feel to it. #Alive, when viewed as a quarantine film in the year 2020, can also send a message across to people that all hope is never lost and personal battles can eventually be won."}, {"id": 7, "text": "I am generous with an 8 cos i enjoyed the film, simple. Aint no wannabe critic. Its ur typical zombie/survival film but with less guns n weapons n less fellas. The film also doesn't pay more attention towards the gore but tension is maintained. Some say that it is similar to The Night eats the World which i havent seen yet. But this shud not deter genre fans from watching this."}, {"id": 8, "text": "I couldn't even finish the movie. So many plot holes, the guy doesn't even look skinny after 25 days without food. Main character is the biggest moron on the planet."}, {"id": 9, "text": "WHY EVERY CHARACTER IN ZOMBIE MOVIE ARE DUMB AF AS THEY NEVER SAW A ZOMBIE MOVIE IN THEIR ENTIRE LIFE???Let name some facts here.-How dumb are you to climb out your balcony fence to try to catch a phone signal and fall? -How dumb are you to send a drone out without first checking the battery? -How dumb are you to open you apartment door after hearing people getting eaten in the street and in your hallway? -How dumb are you for not saving tap water in your bath tub? -How dumb are you for screaming at the police officer being eaten to catch attention of the zombie? -How dumb are you to go looting without checking the rooms are clear? -How dumb is this character without knowing how to use a walki-talki? -LAST HOW DUMB are you for shooting with the gun to bring the horde to your attention and suddenly don't want to survive anymore?? Could not you kill the man and his wife with a knife or maybe something else? You had all the time to go grab a tool?? -As a bonus dumb... no tap water in your apartment but you try to use the firefighter hose?? -How dumb is the movie at the scene they bombed the city but bridges and city they bombed still have heavy traffic on the street like it's rush hour? Is not the nearby city are all ghosted? -How dumb is the movie to provide power to keep his cellphone full charged even after 20+ days of apocalypse? -How dumb is this movie with 2 whole apartment, but only 3 of all them have survival and the rest of are all zombie? Does that mean when the zombie are all around, everybody open their apartment door and invited the zombie in?? -How dumb is this movie with the rope that you can send stuff back and forward?? Ever gravity? -So when you are chased by zombie but when you lock yourself in a room, zombie will stop chasing you and won't try to get in, but when you are already lock in a room and make some little noise, they will try to force the door and come in?? -So zombies know how to open door out of sudden when both the characters are escaping to the roof at the stair??"}, {"id": 10, "text": "Nothing new or aspiring, plot was just average. Just a one time watch movie out of curiosity. Zombies were kinda cool."}, {"id": 11, "text": "I could not measure who are the dumbest beings in this movie. Our protagonist continually at a loss, or the zombies who have inconsistent parameters when to attack? After half an hour of cliché after cliché and continuously dumb choices (opening the apartment door to check on a zombie scuffle, shouting from a balcony to avert a zombie scuffle, setting a drone on a low battery etc ) made by the main film protagonist I could not stomach this any longer and could not care less what was going to happen to anyoneI am Legend is a much superior zombie movie on a man fighting it alone in a zombie world. Similarly for 28 days Later."}, {"id": 12, "text": "The truth if you think it is like Train to Busan, it is not of this type. It is a lighter film, but also very innovative since its plots are very different. He has a very good actor, since he is the one who deals the most with the film. As always, Park Shin Hye's vibe adds a great contribution, I love this actress. And regarding zombies, the truth is that they are disturbing in a way and if I can consider this movie a little more morbid, you can even see how zombies take their bodies to eat them with others! The only downside is that sometimes you think, How come zombies don't attack them right away? Well, it is a movie and the protagonists must fight to survive. Just think of it this way and enjoy, because it's a great movie. From beginning to end."}, {"id": 13, "text": "Absolutely decent movie but felt like it's getting overlooked because of the fact that it's only releasing on Korean cinemas &amp; also the fact that Peninsula, a disappointing sequel covering up this hidden gem.The movie is really intense &amp; hold u back against your seat for sure. Absolutely smart with the technology gimmick but could have use more of that. Character-wise, also great."}, {"id": 14, "text": "So much inconsistencies throughout the whole film that you can't take the show seriously and it's full of clichés too that it's so easy to predict what's going to happen. It's still enjoyable to an extent and the production definitely carried the show to still be a good zombie movie."}, {"id": 15, "text": "Good actionDecent actingWell worth a watchHumorous at times"}, {"id": 16, "text": "My issue with this film is that the main character acts so strangely and childishly to the point that half of the time, the film was extremely difficult to watch. It didn't help that he looks rather odd as well, and his garish blonde hair doesn't help. This is especially a big issue because, at least for me, the film just drags so much. He acts like a teenage shut-in. It was just unbearable. I literally paused the movie several times before the introduction of the main female character.It's not until about 40 minutes into the movie that we finally are introduced to another character that survives for a long period of time (Kim Yoo-bin). I loved her character. She was smart, mature, kind, and caring. Had it not been for her, the main character literally wouldn't have survived.I do wish it was established why exactly she chose to save his life and why she didn't choose to step in earlier. I also don't understand how both she and the main character could survive for such a long period. The film really suffers from an insufferable and bumbling lead. You'd think the film's writers would make Yoo-bin the lead, since she was much more capable and charming, but for whatever reason we're stuck with an annoying lead and a great secondary lead. Last, but not least, the film really suffers because it takes place really just in that one location with the same repetitive things happening over and over. This definitely isn't at all on the same level as movies like Train to Busan and 28 Days Later; both those films outclass this film by miles. But this film, #Alive, is fun if you enjoy mindless zombie movies. Don't go in with many expectations and you shouldn't be disappointed."}, {"id": 17, "text": "The laser pointer part was weird. Also the part when the city was being bomb and there's alot of car like nothing happened for the past 20 days. This is like a low quality train to busan wanna be movie"}, {"id": 18, "text": "The only reason why i rated 1 is cos i can't rate 0"}, {"id": 19, "text": "First of all, the trailer is very appealing, especially to a avid fan of zombie genre film. it was shown in the trailer the use of drone which the viewer would think that it would be a significant tool for them to survived, but it is not useful as you would expect in the trailer. there are thing that i've noticed in the film that made me rate it lower than 6:1. Continuation there is a part in the film where the protagonist was shocked when the door was shaking. the refrigerator was stumble and the zombie was able to enter the room. the protagonist have to fight back in order for him to survive, however in some parts of the film the door was actually pulled from the outside in order for it to be open. in contrary there's one zombie that was using his hand on the lever of the door to open, hence, there's a possibility that the zombie that the protagonist have fight with maybe used is hand to open it, HOWEVER...2. the way zombies act is inconsistent i mention that there's one zombie shown in the film that used his hand to open the door, however in some parts of the film, the zombies are not mentally capable of opening the doors, they are just pushing themselves and slamming the door with their hand. it was also mention in the television that the zombies act aggressively but when both protagonist was running upon the 8th floor, it seems like some of the zombies are not that aggressive3. cuts the film is drama and adventure genre. there was a part where the main protagonist was outrageous for the lost of his family that he decided to go outside and try to let it out by fighting the zombies. he realized that he couldn't fight all of them because there are a lot of them. while he was running the camera turn in the zombies without knowing whether there's a zombie in front of the protagonist or not. the next scene was already him hinding in the corner. for some reasons they decided to cut the part where he run to hide in the corner which is very important since this is an adventure film. that little detail would help the audience feel as if they were there.4. stupid character. i don't want to explain it anymore, i don't know how they survived, they are just stupid5 cliche villain the guy was so obvious. i don't know but i already know that he is the villain, even when he made them eat the food.anyway, i was expecting it to be one of the best film about zombie apocalypse not worst"}, {"id": 20, "text": "The whole movie is how stupid and boring people are... Hate every minute of this movie what the hell was that? I thought maybe it could be good and funny to watch but actually was just boring"}, {"id": 21, "text": "Middle school level acting. Incompetent, unintelligent, and pathetic main character. Zero story development. Overall, a garbage B film that should have never been a suggestion on my Netflix account."}, {"id": 22, "text": "The acting for this movie is okay, the zombies are great and the camerawork is also great. The movie does not feel cheap at all that is why I'm giving it 3 stars. The biggest problem this movie has is the stupidity of the characters from start to finish. Every decision they make is awful and just when you think they're going to do something smart they ruin it. A gamer who doesn't know what to do in a zombie apocalypse and both have never seen a zombie movie? There are so many plot holes throughout. Just terrible writing for this movie. Worth a watch if you want to know how a zombie movie shouldn't be made."}, {"id": 23, "text": "If the sequel to Train to Busan (Train to Busan 2 - Peninsula) disappointed you as it has me, this second Korean Zombie flick will make up for it. It's very entertaining and funny too. The characters are likable and the boy/girl chemistry between the two lead actors was good. It will probably make my favorite zombie flick for 2020. I'll add this one to my Plex collection of zombie films."}, {"id": 24, "text": "Decent horror movie, Its not Train to Busan but it's good enough."}, {"id": 25, "text": "I feel like i'm watching a CCTV video and observing every moves of the zombies quietly. In this movie,Zombies just spent roaming around in one location/apartment- thats it! My hand usually gets clammy when watching horror movies but not this time.. Those who rate this high, probably theyre fan of the actress but theres nothing really special about it."}, {"id": 26, "text": "Seriously what the hell people? You spend all the money for this kind of poor, abomination? I watched the movie just for the girl. She was the only good thing in the movie (only when she was trying to reach him, that fight scene.) This was a kid movie that shouldn't be allowed for the kids. Terrible scenario, terrible acting, zero quality. I want to sue everybody who involved with this film."}, {"id": 27, "text": "Really bad writing / Really dumb characters who do dumb things and a really stupid ending."}, {"id": 28, "text": "I'm appalled that people decided to give this film a 6 star rating. There are films with 6 stars that are 10 times better than this crap"}, {"id": 29, "text": "Dull, boring, bad acting, bad storyline, bad everything"}, {"id": 30, "text": "I wasted my precious time by watching this. I love these two lead actors that's the reason I watched, but a complete disappointment. Hope they choose right scripts for their next movies."}, {"id": 31, "text": "It was a complete disaster, characters do random mistakes just to push the plot like: THROWING ALL HIS WATER not because of a zombie just because he was angry.Breaking his TV also by anger WHY? he didn't have internet or signal so his only method to get information is by the TV.Also the main character it's just dumb when things calmed down he still had internet, and instead of searching for any survival tips or what was going on. no, guess what? he starts to play PUBG then the internet goes off and who could have thought that was going to happen? not him, when I saw this I just stopped the movie and laughed for half a minute who starts playing PUBG in the middle of a zombie apocalypse?.When the table hits the girl she becomes unconscious even though she didn't hit her head she landed on her shoulder later she looks for bruises in a mirror and doesn't even check her head also you can actually see how she dodges the table without pausing it doesn't even look real.Btw the number of adds on this movie like I get one or two logos but 5+ is this an ad or a movie?"}, {"id": 32, "text": "Stupid acting and stupid decisions made by the characters."}, {"id": 33, "text": "The entire film I was expecting a twist. It couldn't be just about what I was seeing. I mean, South Korean, right? They are expert zombie film makers. And yet at the very end nothing happened other than the expected. The only thing that raised an eyebrow is how deadly were the zombies in the very beginning and how poorly they were doing their chomping job at the end. The least they could do is make the difference between a contagion (which is what they were selling it at) and a zombie (which was what the infected actually were). They didn't even do that.Bottom line: boring and uninspiring."}, {"id": 34, "text": "It's the perfect proof that korean movies are not being rated properly by those who just hate Asian countries making awesome movies. I am Spanish and I have watched quite a lot of zombie movies but I never watched one with a very real perspective of what it could really happen and this was it. It was very intense cause it felt real. Due to the low rating I took time to decide whether to watch it or not, I guess next time I will have to add two stars to anything foreign above 6."}, {"id": 35, "text": "This movie simply told the virus which spread suddenly without explanation, just like recent zombie-related movies. But ALIVE stood out because the pace was fast, a tense atmosphere had raised within 15 minutes.There were many scenes of flesh-eating zombies in the movie, and it was surprising those zombies had different characteristics. They kept own and while living behaviours e.g. a dead fireman climbed building with a string or a dead security guard patrolled in the corridor.Though the movie used a single appointment building as the main filming site, it wasn't boring and its topic was down to earth. Quite interesting that if imagine one day you were trapped in an apartment without WIFI, food or electricity, but had to face blood-covered zombies, how you figured your own system of survival."}, {"id": 36, "text": "I have to admit I am not the biggest fan of zombie movies but there is something with these South-Korean movies that makes them always good to watch. A gamer vs zombies. You know as a gamer you have to reach the top floor to see Game Out. And I mean this in a positive way. Good plot, good acting, hungry zombies, a gamer, helicopter and the army. All these ingredients will ensure a nice viewing. No really, I am really wondering why the better movies lately are coming from South-Korea. But for now, enjoy this one!"}, {"id": 37, "text": "I love this genre and that one is very watchable and nice. It was clean, easy to watch, no need to do stupid things like other zombie movies.. In my opinion, it deserves 2nd part. Ps :Social media is important for survive :)) especially instagram :)"}, {"id": 38, "text": "This movie is not your typical zombie movie. It addresses our advantages and problems we might face in a 2020 zombie apocalypse. I like the story which was rewarding and entertaining to watch till the end. I don't Know....but this movie felt like what I would face in a zombie apocalypse, like holding up inside our houses/apartments and trying our best to wait it out while hearing the wailings of the infected outside. Recommended for any zombie movie fans."}, {"id": 39, "text": "Pretty enjoyable. The story is very simple, and the tension is there throughout the entire film. The main character is dumb at times, but also a bit funny. I only wish there was more to see after they get rescued. I was like is that it? Overall nice zombie flick.I feel like this one could be set in the same world as Train to Busan or Peninsula."}, {"id": 40, "text": "Watched less than 10 minutes of the movie. Inhumanly stupid behavior led me to stop. Allow me to explain:1. Guy 1 sees weird things outside his window; some people are running and others are attacking them. 2. Still opens the door when there is a knock on the door and lets guy 2 in. 3. Won't let the guy 2 stay even though he looks normal and scared 4. Guy 2 turns into a zombie right in front of guy 1's eyes 5. Guy 1 chooses to wrap his arms around the zombie (like a hug) and pushes him out the door while the zombie's teeth are 1 inch away from his shoulder and all that the zombie does is 'growl' and 'snarl'.Enough Tom and Jerry for me. I'm sure preteens would enjoy it."}, {"id": 41, "text": "... S Korea can make the mess out of a zombie flick. Makin it scary, a little gross, and exploring some of the human foibles, darkness, and goodness without it having to be Days of our Zombie Lives like TWD. Keep em coming!"}, {"id": 42, "text": "Everything is so bad. Literally waste of time. So but so so bad. I hope nobody who involved with this film will ever be able to make another movie. Actually I don't even want them to take a selfie. The movie was that bad."}, {"id": 43, "text": "The male lead begins to annoy you after 15 minuts, and he is the main reason why this movie fails. Later in the movie a beatiful girl joins, and she helps to watch the rest of it. I wish it was the other way round :-) Other than that..... Well, korean actors are just not good! Yes I said it. Get over it! Its watchable but you will forget all about it before you go to bed."}, {"id": 44, "text": "Why can't they come up with better stories and scripts?!"}, {"id": 45, "text": "It's all good old survival mode story of two people in a post zombie world. But there was never a part in the movie where I gt bored. A good watch if you r a zombie movie fan.."}, {"id": 46, "text": "Well, the story is a bit poor, and it's almost the same story as EXIT movie. But the acting was very good Shin hye was supper Ah in acting also perfect. I will give it 7/10 Worth watching, licking forward for Shin hye and Ah in works 👏🏼"}, {"id": 47, "text": "Zombies were decent, action scenes were alright. Technology and isolation is the main focus for the first half, but there's nothing really that hasn't been done before. Main character was bland, not unlikable just a normal guy who spends all his time online. Female character was more complex but in a meaningless way, like how she watered her plant with her limited water and was scared of heights but used to be a mountain climber or something. The rope was straight, nothings going to slide along it. That lady has unbelievable aim with the laser pointer and why did he leave his window open so that she could see in? The guy is just lying there, pinned down do you really have to shoot him and the zombie wife, alerting everything in the building? Why would she then try and get him to shoot her, she's not bit, there's plenty of food? Sneaky, stealth helicopter!!!I don't like zombie films where the characters are trapped inside an apartment the whole time, I want them to go out and confront this dark reality not sit inside and mope but they're cheap to make compared to something like 28 Days Later."}, {"id": 48, "text": "I love zombie movies but not this one! Count me in if there's a zombie or any distorted creature/ horror movies.. but im telling u this is the most boring ever. Anyone hu rate this high its bcoz they are a fan of this popular Korean actress. But story wise---- nah!!!"}, {"id": 49, "text": "I love this movie it has personality. A lot of zombie movies are just a bunch of zombies eating people and everybody is depressed and it doesn't do anything. You don't care about the characters. In this movie you care about the characters. It's a great flick to watch during this time of pandemic. Give it a chance. Subtitles or dubbed either way is good."}, {"id": 50, "text": "Honestly I've enjoyed the movie, teaching us to survive no matter what, having a hope in this life is a MUST! teaching us that even the human being can betrayed us, such as that man did to save his wife! I was expecting a happy ending ,they would hug or kiss each other at the end to make it the perfect ending!"}, {"id": 51, "text": "In a time when it may or may not happen #alive gives us an already drawn out genre with a new aspect to zombies not much talking just stay alive"}, {"id": 52, "text": "The idea of this movie is fresh. Even though it's mostly only located on apartment, it's still good and awesome. I really like the cinematography and I felt anxious for the kost part when he get out from his room.First time I heard this movie I was not intrested to watch it, but after I watched it, I like it."}, {"id": 53, "text": "Well, if you want to craft a decent zombie flick in modern times, there is propably no way to define the genre new. There were some really good movies and many bad ones that mostly tried to copy the already existing decent ones, but failed doing so and never tried adding anything new to refresh these types of films. Well I would go this far and say that this movie tried. It created an atmosphere, that held it somewhat authentic at first. In times where isolation and deseases are a very relevant topic, maybe more than ever, there is a chance you could hit the spot and keep your audience on the edge, because everyone is thinking about what they would do in a situation like this. And this is where the problems start with this movie. The protagonist struggles with keeping himself safe, while making dumb decisions. That's not new to the genre. Everyone who watched some zombie flicks knows that feeling What the hell is he doing? Why isn't he behaving like I would in this situation?. So you obviously can't expect a zombie expert here. That's not the problem. The decisions made his character inconsistent. He went from suicidal, to a fighter, which is ok, but when he was sure of his will to live, he still let things happen, that brought him and his newly won friend in great danger. Like letting her shoot a gun in the apartment, when they clearly didn't need to. So inconsistency is what drags the movie down. The zombies were portrayed merciless through fast and violent behavior, but had an inconsistent present. One time the protagonist was trapped in an apartment with nowhere to go and they didn't even show his way back into his own apartment.. Sometimes the floors where flooded with zombies, sometimes they were not, clearly depending on the next step, the film let the protagonist take. The composition of scenes often felt too forced triggering a chain of events trying to make the movie exciting again. But the action fell flat, especially when noticed that zombies where just growling instead of running, like when the girl came down the building, landing right in front of some of them or two ran after the police woman but only one got to her and the other one disappeared. So depending on what the writers wanted the characters to do, zombies were adjusted. The cinematography in these scenes was good and so was the acting overall. Especially in the quiet scenes, when the characters had to face themselves. But all in all there was an attempt creating a somewhat loveable dork main character and let him face the dead while connecting modern techniques and pointing out how much of a topic social media could be in a situation like this, but failing in consistent execution and lacking authentic characters."}, {"id": 54, "text": "It was well balance between a human emotions and zombies. We didn't get to see enough zombies. And it's not on the level of train to Busan. Still very entertaining but I didn't like the main lead actor being a crybaby throughout the movie."}, {"id": 55, "text": "The acting was great, but we didn't know much about the woman Yu-bin. So, it was kinda hard to decipher what her character really is. There were a lot of consistencies throughout the movie. The zombies here are laughable, it's the most inconsistent zombies I've ever seen. They focused more on the chemistry of the main characters that they deliberately left out much of the zombies' characteristics.The theme of the movie was good though. Showing the characters' will to live is something very well performed by the actors. I find it a little better than Peninsula, but this movie is something you won't watch again after viewing it once."}, {"id": 56, "text": "I can not understandhow it can be 6.2 imbd Maybe be vouters is til 12 years age, because in my oppinion this is not a movie, this is total s h i t"}, {"id": 57, "text": "Movies where the main character is a moron should be illegal and against the law."}, {"id": 58, "text": "Only topic is good. But actors, effects, locations are all amateur. All happening in small area, with only soldiers at the end and that neighbor who let them in looking a bit real. Two main actors look like they are acting for first time, or like they are not even actors. Zombies do not behave serious enough and do not look real enough. Instead like bunch of guys with makeup running around playing hide and seek game. Bit good presence of technology and emotional a bit. Feelings of desperation dominate. Reminds me of hunger, psychological, financial, social problems, and this movie just increases our desperation. Too negative. Tons of stuff missing like presence of doctors, other areas, family of this guy... Not good to watch. Better Korean pandemic movie is Gamgi (2013)."}, {"id": 59, "text": "OK if you like apocalypse movies, skip otherwise. Main character is a man-child and annoying to watch for the entire first half of the movie, he offers little in terms of interest or story, seriously summarise what this character offered once you seen the movie? Could have been replaced with an 11 year old boy and got the same storyline. The girl is a little better but no explanation or backstory to her abilities. Invisible helicopter, most of where my brains cells were lost in order to accept it. The man on the 8th floor story line made no sense, no matter how much you want to push his (poor) reasoning, I really thought that story was going somewhere else..."}, {"id": 60, "text": "An extremely vapid and thoughtless zombie movie for the millennial generation.Weak production values which is nothing to do with budget. There is zero attention to detail or cinematography, weak plot and script and terrible main protagonist.Nothing about this film keeps you watching other than a vain hope of an upshift in storyline or interst but rest assured that it will be in vain.Made to sell to the couch audience with no interest in real horror, a money grab if there ever was one"}, {"id": 61, "text": "It's a really trashy movie, acting is quite ridiculous, my 5y cousin pretends better when he wants to manipulate parents into getting some sweets. I cringed multiple times simply for how stupid the writing and acting was. I certainly do not recommend this crap. Plenty of much better, more realistic zombie movies out there with even lower budgets."}, {"id": 62, "text": "It ok, quite perdictable and slow. Its definitely no Train to Busan. However if you are a zombie movie fan, then still worth watch but dont expect too much. Good for when you run out of movies to watch"}, {"id": 63, "text": "This is one of the best zombie movies in years and definitely the best zombie movie in 2020. I enjoyed this movie a lot more than the American version which was called alone. I think that this movie was really great considering I love zombies who move fast. This movie takes you on a journey and which you actually feel for the main cast members and it definitely makes your heart speed up during the more horrific scary moments. I would recommend this movie to all of my friends and to anyone who love zombie movies."}, {"id": 64, "text": "I loved Train to Busan, but the difference between the two is the acting performance. In this case, it's terrible at making zombies a more pitiful concept than it naturally is. Despite that, the narrative line is fluid and interesting."}, {"id": 65, "text": "Started a bit corny, but tension elevated with twists here and there, leaving you to think of various scenarios unfolding. Main characters did well in their roles. Watch till the end..."}, {"id": 66, "text": "It's a representation of what the first month would be like in a zombie apocalypse (trying to find some one else who is alive, saving enough food for each day, counting the days, trying to find a way to communicate to others etc via cell phone with no bars). Its basically that, barely any talking. I could literally give you the whole movie synopsis in less than a paragraph: boy in apartment: apocalypse breaks out, he doesn't have much food, finds girl across the street and communicates and sends food to her via rope: both decide to go and find more food together: finds another survivor to only use the girl as food for his zombiefied wife~ foe gets killed, both kids hear helicopter and go to the roof fighting off zombies~ barely makes it on the helicopter alive but does! It was good enough to maybe watch again if I was with a friend"}, {"id": 67, "text": "Went in with no expectations and i must say i had fun . It was very enjoyable ! Great acting , great make up effects but it lacks on almost everything else . The plot is bad and simple . The ending was really bad and cliché . But the thing that makes this movie watchable is that it is a modern day zombie movie and it makes you care about the characters . Overall just a fun and enjoyable movie"}, {"id": 68, "text": "Includes minor spoiler...The basic scenario has been done before, and this added nothing new or particularly original to it. If you're a fan of zombie films it might be worth your time, although I can't be the only one at this point getting slightly frustrated at the characters frequent lack of logic/common sense in these type of films. Example, the two characters leave their respective apartments, which are seemingly safe, risk fighting the zombies down on the street, all so they can go back inside one of the apartment buildings they had just come from. What did this accomplish, other than bringing the two characters together for plot purposes? There are plenty of other examples of this sort of thing, too many to go into detail here.Add to this a few goofs and continuity errors and it makes for a slightly frustrating watch. Acting and cinematography can't be faulted, and I thought the makeup and the design of the zombies was ok. So overall, an average score, wouldn't watch again though."}, {"id": 69, "text": "A zombie flick that's a little short and sometimes a little dumb but an all round fun movie."}, {"id": 70, "text": "One of the best zombie horror movies I watched in years! I definitely recommend this movie to everyone who's into zombies, a bit of action, interesting plot and a bit of goosebumps as well 8/10"}, {"id": 71, "text": "Prosthetic makeup is outstanding! how did the third survivor be there? shin-hye still pretty &lt;3"}, {"id": 72, "text": "Decent film, funny at times and the main character was great and easy to watch.Good storyline and simple but good execution over all."}, {"id": 73, "text": "A simple zombie film. From the beginning the zombie had appeared in front of the house without no reason. A zombie film that is simple, realistic, and the main charac goal just to stay alive without being a hero. The main character in this film really depicts a person who want to survives. The film Alive is not a zombie film for those who love fighting and action. However, for me this film is still worth watching."}, {"id": 74, "text": "This is one more Korean zombie movie, but this is mainly focus on horror, fear, scariness of zomibies rather than their ugliness and man eating sequences like most of zombie movies in Hollywood. A man is trapped in his own apartment by suddenly a attack of zombies. He could not escape to anywhere."}, {"id": 75, "text": "This genre has been done to death and while this film is pretty standard as far as zombie genre goes its done well. The lead actor is very good, it's shot well where you can see the action with no shaky cam nonsense, and the makeup design on the zombies is very well done. I'd recommend it as it's one of the rare better films of this saturated genre. 6.8/10"}, {"id": 76, "text": "I watched an English dubbed version on Netflix . Pretty good visual effects , but either the story didn't translate well to English or it suffers with weak writing. Tries to be cute , sitcom style Quick Quips , and predictable. Now all that said , it's still worth a watch . Especially if you have partaken in some edibles ."}, {"id": 77, "text": "I'm into zombie genre and liked this movie alot. At the end it got a bit out of place but still good enough. It was funny too, in parts"}, {"id": 78, "text": "Don't let the negative reviews talk you out of a good movie. It was a very exciting survival zombie thriller. Theirs something special about Korean zombie movies that feel so authentic to me."}, {"id": 79, "text": "Have you all critics gone dumb or have you lost all sense of enjoyment in your quest for the eldorado of cinemas?This is a decent movie with really good acting, thriller and captures your attention till the end. Get a life you all idiots who are rating such good acting and direction so badly. You are a disgrace to everyone.Must watch for any apocalypse movie lovers."}, {"id": 80, "text": "I don't know i don't like the story Its very boring and i am not recommended because every scene just boring"}, {"id": 81, "text": "In short: 28 days later within an apartment complex.In longer: The director/editor makes this movie, the thrill momentum is built well and explanations are left on the roadside - which is refreshing. What is not refreshing is bad character rationale which borderline spoils the movie a few times over. As do the a chase scene that isn't realistic and the cracking of some glass with crappy cgi (just using the sound of it would have given ALOT more effect - sound is used at one point to similar effect). The action is somewhat good, the emotions come through even though it do suffer as previously mentioned lacking character rationale/actions, there are also some clichés unneccesary stuck into it (sneaking around collecting food would have given more bang for the time).Pro's Makeup &amp; costume Editing Thrill momentumCon's Character rationale Some clichés Chase scene (less is more) and same with not needed cgiEnd notes (spoilers ahead): As when you've viewed it you can clearly see the resemblance to 28 days later (or parts of it), there are other borrowed things there aswell (as from many previous zombie movies where next of kin has become mad and feeding a zombie family member with living people), that makes it fall a bit. If this had been more about ingenuity of staying alive it would have been a bit better. Upkeeping the thrill momentum through directing/editing and acting is what still manages to keep it avbove average."}, {"id": 82, "text": "It's not like Train to Busan. But the movie was fun. No complaints here."}, {"id": 83, "text": "This movie was mostly based off of a webtoon written in 2014 called Dead Days by DEY. So far I have seen no mention or credit given to the original author."}, {"id": 84, "text": "#Alive is a film that has everything that Peninsula tried to have and because of that i recommend to people that they rather watch this film cause it has a very likeable lead and girl character and it has also some good and fun action scenes and some good make up for zombies.This film even if it is better then Peninsula,it still isnt on level of Train to Busan,it lacks a bigger emotional impact and weight that would made ma to care for this characters even more,story was survacible but nothing brilliant,#Alive was a fun Korean zombie film to see and like i said watch this film instead of Peninsula and you will see that you didnt made a mistake"}, {"id": 85, "text": "Intense and entertaining, some relevance to the current lockdown situation! Must watch!"}, {"id": 86, "text": "It is so frustrating that the main character always takes illogic decisions. Why so stupid? The rythm of the movie is nice, the make up is good job and also the actors are."}, {"id": 87, "text": "Please my one hour back! Too many drama that's not crucial and not relate with the main story.."}, {"id": 88, "text": "First time seeing the trailer for this film i was excited cause of what Train to Busan was able to do with the zombie genre in films, this film is not an amazing film but it is one of the better zombie films I've seen in a while, I been thinking lately the American films can't make a good zombie film anymore, the characters are not fleshed out more here but they do a great job at keeping this film as short as 98 minutes, the actor who plays the main guy is likable and the actress who plays the main girl is the same, really love this new take on it, seeing the guy just trying to survive without any outside contact"}, {"id": 89, "text": "This is a zoomer edition of a zombie movie. The main protagonist is a weak zoomer who only survives with plot armor.Also the zombies aren't consistent. They are very strong and fast but when our zoomer boy comes in they act like imbecile children."}, {"id": 90, "text": "#Alive was better than average but no Train To Busan. The movie looks good and the acting is solid but the script in the latter part had me rolling my eyes at the stupidity and melodrama. The zombies were a little inconsistent too eg. they could turn door handles in some scenes and not in others. The zombies dragging the policewoman scene was cool, the zombie climber scene? Not so much. I actually initially thought it was going to play out differently and that he was a gamer and was going to use his gamer skills in real life on zombies. I wanna see THAT film. 6/10."}, {"id": 91, "text": "Not every zombie film from Korea needs to be compared to Last Train to Busan! This film stands alone in it's own right. The acting is extremely good from the main characters &amp; the story is pretty solid. Definitely worth a watch"}, {"id": 92, "text": "This film exceeded my expectations tbh. It was suspenseful, thrilling amd never really ends up boring because of the fast pace. Absolutely smart with the technology-style but could've use more of that."}, {"id": 93, "text": "Doesn't desirve even one min from your time. Worest story, worest acting"}, {"id": 94, "text": "For a viewer that looks for relatable and realistic patterns in movies, most of the good stuff is in the beginning. Even though I had to accept that only three people out of hundreds if not thousands decided to stay safely indoors for a zombie apocalypse, the rest of human interactions either mean Koreans behave very anti-socially on bad days or all the drama was forced. Make of it what you will, but I really don't know which is worse.How does the fat guy open a door that only opens outward? His bones, joints and muscles would've been broken before such a door would've let loose even a bit.How does a zombie fireman pull a table via a rope so hard it knocks a girl out by hitting her hip? How does he climb up a wall using the said skinny rope? Thin ropes have very little surface area to grab onto and gravity actually does pull a man, especially a toned firefighter, pretty hard.How does the helicopter appear in the final scene? The heroes didn't hear it coming before it was 20-30 meters away behind them. Helicopters can be heard from much, much further away. Also it was flying upwards from a yard below surrounded by buildings. It would've had to have landed there or hovered for quite a while.Like that, you'll find little cause and effect from #Alive. The rest is just forced drama. It's built from events with no prior preparation, no reason for something to happen. No cause. Thus this isn't a clever movie by any stretch of the imagination. Which it could've been if it just tried.Worth watching? No. Worth wasting your time on? Yes."}, {"id": 95, "text": "Mediocre. Not as good as Train to Busan.The beginning part of the movie was too drawn out. It became slow and boring.I wish they would have more scenes where they are scavenging for food from different apartments, on different days.Maybe a total of 3 different apartments, and have different obstacles that they must overcome."}, {"id": 96, "text": "I watched this movie with my dad not expecting much but I was really surprised at how good this movie is. This movie really did a good job about the characterization and the development. It really made me care for the main lead. The main leads performance was really good. He was also really good in Burning. The performances are great so we're the actors who were portraying the zombies. I was so glad that they didn't force a romantic relationship between the 2 main leads. Although this is not a perfect movie, there were some really dumb choices in this movie. But other than that I had a blast watching this movie. Check this one out if you are a huge zombie movie fan"}, {"id": 97, "text": "It is a lighter zombie apocalypse movie, it was good. I give it a 10 because, its unique and the actors are good as well."}, {"id": 98, "text": "It was good at the start but later on some scenes didn't make sense and it felt like it's just being added to make the movie longer that's it."}, {"id": 99, "text": "Complete idiot protagonist but its good worth a watch. Edit: nevermind. The character just gets teleported out of any situation. They dont explain anything. He never gets thinner or dirty"}, {"id": 100, "text": "What got me interested in seeing the film is the trailer. In the trailer, the protagonist is barely in any a lot of locations, which is something I haven't seen in most zombie films. As a fan of a zombie outbreak film, there's often a lot of location hopping. For #Alive it wasn't the case.The film was overall enjoying until near the ending, which I thought was a bit cliche. I would've liked to see more of an original conclusion. The acting is amusing and reminds me a bit of Shaun of the dead. I give the film its due in bringing a lot of creative approaches in a small apartment. Examples being (Fridge as the barricade, The breakdown, bathroom, the windows, etc.)But despite missing several instances of details, weird moments, and strange story plots, I enjoyed it."}, {"id": 101, "text": "It was made very well and it had no shortcomings.I hope there is a part 2 so we can see what would happen next. 🔥👌"}, {"id": 102, "text": "Really enjoyed this take on a Zombie flick. Few good jump scares. Would recommend"}, {"id": 103, "text": "Very similar to many korean movie such as Exit train to busan peninsula and so on If you love horror or Zombies movies then definitely you can't miss this one"}, {"id": 104, "text": "I would love to say it's a 3rd class movie. Both main actor and actress are horrible in acting. Park shin hye was only successful in pinocchio korean drama. Except that none of her drama or movie ever got light. And as she is 32 years old there is no attractive performace we can expect from her, to be honest her golden age has gone. This movie is boring have no plot and just waste of time. I don't get it why they are still making korean movies in quarentine time period. In the end just don't waste your time by watching this movie."}, {"id": 105, "text": "I know Zombie concept is not new and I don't know how more and more new and exciting features can be added to this concept but this movie is the worst zombie film ever.I have seen a lot of Zombie films and I love Korean cinema. I have seen movies of the both the lead actors and they are good but not in this film. Movie looked promising in the beginning but descended pretty quickly in to the 'yeah right' territory.It was a painful watch. I suggest you stay away from this movie."}, {"id": 106, "text": "Good, suspensful movie for it's genre, definitely not boring. I first intended to rate it a 7, but I ended up giving it an 8. I got cought up in the story from minute 1 and by the end of the movie I was really hoping they won't get killed after surviving all by themselves for almost a month. I am aware of some inconsistencies/omissions, but I still feel the screenply was nicely written and the actors delivered a good performance ( in my unprofessional opinion). A lot of users said the characters are weak and/or stupid (especially the boy) not to know how to behave in a zombie appocalypse; movie is full of cliches...blah blah. Ah-in yoo's character is a teenage boy, so it seems, who actually doesn't do much except for playing online video games with his friends and it's kind of lazy, but doesn't look tough and you can see him scared once he realises the situation he's in. The writer did a good job making this character relatable to a lot of teenagers nowadays. I also enjoyed that they focused on his relationship with his family...he appears to be worried about their fate and he suffers once he realises they are dead. All in all, it is a story about survival, without knowing what's going to happen next.I would say give it a try if you like zombie movies. Cliches you will find in probably every movie of it's genre."}, {"id": 107, "text": "I thought #Alive was great! It's 100% worth a watch!"}, {"id": 108, "text": "This is the worse film I have EVER watched its not even worth a 1 star, the dubbed into English was terrible, the Asian Eminem couldn't act and that female was just as bad, after they made this movie did anyone watch it and think hmm maybe we should just bin it, id be so embarrassed if I had anything to do with this film. #alive more like #DEADMOVIE"}, {"id": 109, "text": "Moves along at a steady pace. Keeps you interested too. This is better than its Canadian remake (Alone 2020) version.Its flawed in parts, but the acting and suspense makes up for it. A zombie apocalypse in a flat"}, {"id": 110, "text": "This was the worst movie I have ever seen! The most cliche and not exciting script. Overall in one word : TERRIBLE. Don't waste your time watching it."}, {"id": 111, "text": "I love this movie. its one of the best korean zombie movies ever. almost even better then another great z-flick train to busan. alive (Along with other korean movies ive seen so far) is original, memorable, unpredictable, its outside of the box. and took risks. i love it!!!. i love korea, they know how to make original movies!. i give this movie 8/10"}, {"id": 112, "text": "#Alive offers nothing particularly new or outdated in 'zombie' apocalypse tropes. It is a film that has a great first act, but goes downhill the deeper into its runtime. At this point, it's rare for any production to really provide a unique twist to the genre. Actually, it's more a film about finding friendship in the face of adversity and how humans need each other, but shot in 'zombie' world. Not to mention, the vast majority of this film has extraordinarily little dialogue. Forgettable.Rating: 5+"}, {"id": 113, "text": "Please judge the film not with whether the character is dumb or clever. What if this film is about a dumb character ? you should accept that. And not judge the movie with the character intellegency, like you're the smartes people on earth"}, {"id": 114, "text": "Based on the script for Alone by Matt Naylor, who co-adapted his script with Cho and will see his version of the film release later this month, this movie finds a live streamer named Oh Joon-woo facing the kind of battles that he'd only had online as zombies take over most of South Korea.After learning that his family has been killed, the loneliness and pointlessness of life alone gets to him and he attempts to kill himself. He's once stayed inside, away from the rest of humanity and now, he may very well be the last person left alive.That's when a laser pointer flashes and he realizes that there's somebody else left. Kim Yoo-bin has used traps and an axe to stay alive, using her wits when all Oh Joon-woo has done is hide.If you've read Max Brooks' World War Z, the story Kondo Tatsumi, about a Japanese gamer in a similar situation, may strike you as being very much like this story.The end of the film really recalled Shaun of the Dead, which is not a bad thing. In a world where every zombie story has seemingly been told, this tale of a young man staying locked within his apartment - afraid to come outside as a plague ravages everyone else - is alarmingly all too real."}, {"id": 115, "text": "Listen I'm not a critic but I do wanna say something. It deserves a 7 because it's fun but not original. You shouldn't expect the same level of quality of Train to Busan, but the acting was good, the practical effects were nice to look at and the tension of some moments were pretty good. Although the ending is a bit cliche we did get a fun zombie movie out of it."}, {"id": 116, "text": "After watching Alive probably most the viewers are disappointed because they find nothing new in here. They have watched The Walking Dead, Resident Evil, Train to Busan. And all of them seem to have so many elements in common. In this Covid-19 period, we're becoming like the non-infected ones in these types of movie. We're (except doctors) just avoiding the infected ones just the zombies."}, {"id": 117, "text": "When it comes down to it, in the end we are alone, even while Alive (which is the actual english title of the movie). Even if there are others around you (zombies or otherwise), you can only count on yourself. Well unless ... although can you even trust yourself? And maybe you can trust others? Maybe not though ... this movie is more on the tension side than on the action side of it.You will still see blood and violence, just don't expect this to be something it isn't. Having said that, this may very well be an accurate version of what would happen in a very densely populated area ... and how some people would react to it. Not just our main character. If that sounds good to you, give it a shot (no pun intended, especially because there aren't that many weapons to begin with) ..."}, {"id": 118, "text": "If you like zombies, this movie is for you, but nothing new here. Only a lonely dumb teenager living in a biulding, a lot of crazy infected.As always at this kind, an easy happy end."}, {"id": 119, "text": "An excellent surprise.To be honest, I saw only the movie picture in Netflix, where the hero stand in a balcony, with a selfie stick. I expected a movie about survivor posting on social media. Wrong ... Not at all. It's a rather pretty good zombie movie, with a different perspective, and decent plot and story.My main deception is about the US blockbuster ending, but I really enjoy this movie, mostly because I didn't expected anything special, and it was the opposite."}, {"id": 120, "text": "Dont expect this like a Train to Busan movie. This showed another different angle of a zombie film and it is a decent one. Just watch and enjoy but dont expect too much."}, {"id": 121, "text": "This film, dubbed in English, is an easy to watch virus-epidemic/zombie-style flick. Even with the masaive amounts of this sub-genre, I rather wnjoyed watching this.... even though the characters' sudden rescue is rather unforeseen and fortuitous. I mean I enjoyed it until the last 60 seconds.In that 60 seconds, the film informs us that the reason why the characters got saved is 100% due to their activities on Social Media and.... SEE HOW IMPORTANT SOCIAL MEDIA IS?? IT CAN SAVE YOUR LIFE!!"}, {"id": 122, "text": "This movie was fine, I guess, and the longer it sits with me the worse my perception of it. Typical zombie movie except with social media weirdly praised throughout (although the hashtag in the title should have deterred me from the start if we're being fair) and nauseating tropes followed unimaginatively. Maybe I am too old to feel a connection to this film (28 at the time of writing which is odd to utter the phrase too old before I'm even in my 30s but that's besides the point) but I expect more out of Korean films. Usually they have incredible character development and depth and tell stories that are rich and engaging on multiple levels. This was shallow and superficial and ultimately very lonely in the praised narcissism of it all. In short, you may want to consider the next streaming movie on your list instead of this one."}, {"id": 123, "text": "#Alive offers nothing new..just for the sake of last twist. A zombie Survival. We have seen this type concept in many movies.. u know them. But considering pandemic situation #I_Must_Suvive campaign scores. Living alone ,a sudden change in behaviour , Suicidal thoughts, then the writer brings up another survivor for the sake of extending the film into some more mintues. Partially good but not that bad."}, {"id": 124, "text": "An impressive film, had a good pace and a lot of tension but was never going to hit the heights of certain films because the concept of the film isn't groundbreaking, but is a very fun and tense film. Doesn't scratch the surface of Train to busan which is a fantastic movie and has a great storyline and unique and terrifying storyline, go watch it if you haven't. Also, if you haven't go and watch nights eat the world, very enjoyable movie."}, {"id": 125, "text": "Overall I thought it was a pretty solid zombie flick. The two lead actors had great chemistry together and both gave decent performances.I say check it out! 7 out of 10 severed thumbs!"}, {"id": 126, "text": "Ugh. I love Yoo Ah In... He is such a cutie and after seeing him in Chocago Typewriter awhile back Inwas excited to watch him in this but to me it was a bit anticlimatic. I feel it could have been a little better. It wasn't horrible but it wasn't great."}, {"id": 127, "text": "Was hoping that this movie would be good due to the high rotten tomato review... So cringe and so many inconsistencies. If I didn't know the actors from other movies I'd think they were B grade actors. Everything after the first few minutes of opening was boring, predictable and cringe with bad editing and screenwriting. Sad that I could tell how much money went into the special effects but the overall plot seemed like a fanfic. Do not recommend"}, {"id": 128, "text": "They didn't show why/where did this virus thing come from. Acting was pretty bad. If you have watched lots of zombie movies, you will find this boring and think that it has lots of missing parts. You can't win zombie apocalypse with just a golf stick and a small axe.."}, {"id": 129, "text": "To me #Alive is one of the better zombie apocalypse movies out there. What I like about this movie was that it felt really humane and realistic, nothing felt over the top or really unrealistic (even the fighting skills of the characters live up to how it would go down in reality). The movie takes the time to really zoom in onto the main character(s), and therefore gives us a clear image of his motivations and emotions. Because of this reason #Alive feels different than other Zombie Apocalypse movies. #Alive is basically able to pause the apocalypse when it pleases and it didn't even bother me.Just check it out! Any horror/zombie lover will really enjoy this one :)"}, {"id": 130, "text": "Haven't watched a zombie thriller in years, so I've nothing to compare it to especially the movies the other viewers are saying. (gonna check out later)Movies like this the first half is always interesting to watch, not that we don't know what's happening, but getting to know the style of the apocalypse is exciting, and see some genuine reaction of the main guy who literally just became aware of the situation.Second half is still exciting but doesn't have that raw feeling to it, some super human strengths starts to show, and luck played a main role in helping one to survive."}, {"id": 131, "text": "Terrible zombie movie. REALLY BAD ACTING. they are over acting. Too much drama. Not enough zombie action. Even the zombies look fake. They just look fake. With their arms stivking straight out. I actually laughed"}, {"id": 132, "text": "I'll give 'em credit for using some really good zombies. Fast zombies like in those other one's you are familiar with. The story was simple. But the actors were good. Subtitles to read, but if I was to learn Korean, then there would be no subtitles to read, so maybe I should learn Korean. Hey! Maybe that's how he got the name Korean Zombie! How's the broken orbital dude?"}, {"id": 133, "text": "Enjoyed this more than Peninsula. Has a bit of a Walking Dead vibe about it"}, {"id": 134, "text": "Park Shin Hye and Yoo Ah In Look alike so there's chemistry. The story is entertaining. Liked the survival elements. The way they communicated and got food is quite fun. The zombie chase up the apartment buildings is exciting. The length is relatively shorter than some other action movies so it doesn't drag.Worth a watch."}, {"id": 135, "text": "A short but compact zombie apocalypse film but is able to achieve a lot more than many larger budget Western movies. As zombie movies are becoming increasingly popular, it is refreshing to see a film that goes small instead of big, and one that truly goes for character relations and bonding and not the plot twists and morality questioning. So much goes on in the 1.5 hours that you forget and forgive about the mountainous plot holes, but instead you become intrigued and fall for the two very likable leads. Overall just a very smart Korean zombie film."}, {"id": 136, "text": "I hate that! Turned it off. I don't like it when the mouth doesn't match the dialogue."}, {"id": 137, "text": "Right away the acting is sub par, but if the story was halfway decent I'd be okay with that. The problem is that the main character who looks like a Korean version of Eminem, seems to be incredibly dumb. Some have noted that it's as though no one has seen a zombie movie in this movie, but even if they haven't, the main character is a gamer, so he should at least know some survival skills. He makes dim-witted decisions and survives off of plot alone. The zombies are also very inconsistent in their attacks and methods of entry into apartments. Overall it's not the worst movie out there, definitely not a 1, but it sucks. Do yourself a favor and skip it."}, {"id": 138, "text": "Can anyone explain the scene where the main character makes a landline phone call to the apartment next door to save the female character by distracting the zombies but then keeps on using walkie talkie to communicate with her instead of just making the phone call? and how many households have walkie talkie in their homes in the first place? so many holes in the plot like these."}, {"id": 139, "text": "Joon-woo wakes up one morning, apparently calm as usual, but as soon as he looks out the window he realizes that something is not right in the city. I expected to see something different in the zombie genre, but it turns out to be yet another failed attempt to please two different audiences. It tries to be a young and cool film, with references to current pop culture (like gaming and designer clothes) and also to copy some things to the classics (dawn of the dead or 28 days later), to please the old school fans, but without logic and with a terrible execution. It's full of clichés and scandalous plot holes at times, which could be forgotten if at least the writing was good, which is not, since the lack of empathy with any of the characters, due to their (non) development and the dialogues, that are empty and shallow. The photography is acceptable, with the bare minimum, taking into account the budget of the film. The final scene is so bad that I cringed and feel sorry for the actors on the screen."}, {"id": 140, "text": "I don't usually cringe watching movies but this movie did make me feel that way during a lot of scenes, maybe because it was just everything too plain and predictable? Its quite an easy movie to watch enough to entertain you but far away from being something of cult in the future, easy to forget about it. The cast was pretty decent so I'm surprised they pulled out such a boring movie, they are talented enough to make a zombie movie like Train to Busan or something like that. Disappointed but not surprised after the trailers."}, {"id": 141, "text": "Don't bother.. low budget film. You'll get disappointed."}, {"id": 142, "text": "Really just a big joke in the zombie franchise Script was so bad and the characters were to stale. I can really say no good, except some zombie scenes in this movie.The time were the zombie started climbing just made me laugh, so stupid haha."}, {"id": 143, "text": "The movie is run of the mill in every way aside from the fact that our protagonist makes pretty smart decisions throughout the first two acts. Zombie films typically have their plots driven forward by the stupidity of their characters, whereas our protagonist here makes logical choices. The plot is eventually driven forward by external factors. As another negative, #Alive uses more dues ex machina than I have seen in any media for quite some time."}, {"id": 144, "text": "This movie is worth watching if you are new to the horror genre or used to seeing popular tropes all over. It feels like a ripoff of many popular, previously successful titles. Most of, it felt like it stole a lot of its ideas from this very good webtoon called Dead days."}, {"id": 145, "text": "Interesting Korean production released in June but launched yesterday internationally via Netflix. With a zombie theme, you could easily coexist in the same universe as Train to Busan, a zombie infection that develops at high speed, inexplicable and terribly deadly. A young man is isolated in his apartment, without his family and without a digital connection that isolates him even more and on the verge of committing suicide, he will be able to establish friendship with a neighbor and together try to stay #alive. With exactly the perfect time of almost 1.40hs and very well filmed, the doses of tension in isolation and action with bloody and extremely violent zombies are impeccably balanced. You really end up feeling trapped in a catastrophic and very real situation, similar to 28 Days Later and something that you don't quite feel on The Walking Dead."}, {"id": 146, "text": "This is movie is very good. Realistic .....I like this movie.. the boy and girl were very good The story is short...they should show the condition of the boy's and girl's family...."}, {"id": 147, "text": "My man didn't lose any weight! 5 days of food and four weeks later and still a little chubster. Other than that movie was pretty decent."}, {"id": 148, "text": "A generic Korean Zombies movie, it's more of a thriller with touches of suspense, not horror. It is about a boy who wakes up and realizes that something is happening and looks at everything through the window, a zombie invasion that is spread by a virus, forcing him to stay locked up at home and find a way to survive. Quality. Unnecessary. It uses the same formula as all of its genre, generating suspense to hook the audience, the problem that unlike others is not constant. With good effects, two or three moments are not completely achieved, they are even caricatured at times. Predictable like all of its kind. The problem is that at times it lightens up and then increases in intensity again. Talk about the importance of staying home during pandemics. The downside is that they never reveal how the virus arises or how it originates."}, {"id": 149, "text": "The movie is excellentI! I enjoyed it until the end"}, {"id": 150, "text": "Easily one of the worst movies I've ever seen in my life. Terrible acting and absolutely no context on the plot whatsoever. The ending when they were getting rescued was the best part when the helicopter appeared out of nowhere without making any noise until the last minute. To top it all off, the soliders were wearind identical US Army uniforms! 1/10 would not recommend. Waste of an hour."}, {"id": 151, "text": "MIDDLE SCHOOL KIDS CAN WRITE BETTER SCENARIO THAN THIS.THERE'S ABSOLUTELY NO PROBABILITY IN THIS FILM."}, {"id": 152, "text": "THE WHOLE MOVIE ARE VERY BORING WASTE TIME TO WATCHED IT!!!"}, {"id": 153, "text": "This movie was pretty good. Although I wish the beginning was a bit more informative but overall it was good. It had some interesting scenes and gets you hooked. I only give it a 9 and not a 10 because of the beginning not really informing us why theres an outbreak, also it had a voice over because the movie is in Korean but overall it was a good movie. If you like gory dystopian apocalyptic zombie movies then you will enjoy this one!"}, {"id": 154, "text": "Really enjoyed this Korean zombie movie and the journey of its central characters, who I found quite likeable. This is a much smaller movie than something like Train to Busan, which I think served the movie well. Had me constantly wondering what I would do in these circumstances. I thought the central characters were charismatic and likeable."}, {"id": 155, "text": "The film is an entertainer with good story and good acting. I enjoyed it. It is also well thought out and addictive as all Korean films."}, {"id": 156, "text": "It wasn't too bad but man. Someone said it earlier, the characters act like they've never seen a zombie movie before. A lot of plot holes in it, I hated that the power went out but he had a fully charged phone the whole time? The acting was good, scenes well shot. Just the characters decisions were very off, after being so quiet the entire time, it's a good idea to shot twice and draw the attention of all the zombies???. Scenes like that ruined it for me. But wasn't a total waste of time to watch."}, {"id": 157, "text": "Don't expect much. Like action Gunshots etc It's nothing here. Different concept movie I liked it"}, {"id": 158, "text": "Some things just don't convince... Dumb actions, sequence holes, nonsense situations.Could be great, but its not. There's a notable effort but playing computer games while the world is coming to an end out of the window? Childish behavior for a grown up character? Don't know... expected a serious zombie movie maybe."}, {"id": 159, "text": "I watched this movie with subtitles because I am an English speaking person. But trust me you don't need to know any language to understand and enjoy this awesome movie. One of the best Zombie movies you'll come across in a long time, the last good one was Yummy. Well done to the team and cast to bring out such a superb movie. Please don't go by the low ratings. Just watch it and enjoy it , it has thrills ,gore ,blood humor too"}, {"id": 160, "text": "This was boring, I had to skip through him just sitting at home, whining, and saying that he'll stay at home. He was pretty much a coward, except towards the end when he met the girl. I knew it was gonna have a happy ending anyways since it wasn't that grisly. They survived but there are so many plot holes and we will never get to know if they come up with a solution, or where they're going."}, {"id": 161, "text": "All city had lights out and batteries off. But the Elevator and the Super Mobiles...wtf. Deus ex machina included.Movie with no feelings. Apathic."}, {"id": 162, "text": "Not a bad one in terms of movie structure, visual or editing. But the main character is so stupid (probably so is the screenwriter), and seemingly doing every decision wrong.... Just awkward to watch."}, {"id": 163, "text": "It's weak in some areas but it entertained me. The main actor was very expressive and did a good job"}, {"id": 164, "text": "Gotta give it to them, the extras fully performed their best. So much better than the French original in my opinion. I highly recommend this little Jem."}, {"id": 165, "text": "Kept me on my toes during the action scene. I'm happy to see Park Shin Hye and a new, unique concept!"}, {"id": 166, "text": "I dont understand the low ratings. This is better than most american made zombie movies with the exception of dawn of the dead and 28 days/weeks later movies. It's definitely better than most horror movies in general that we get here that usually has to do with a ghost and the target audience is 12 year olds."}, {"id": 167, "text": "The trailer have made me watch it and because of Park Shin hye as well but it wasn't really thrilling to watch unlike the kingdom and train to busan."}, {"id": 168, "text": "Only thing to say is wow brilliant a great film easy to watch good story great actors and actresses make up is brill and can actually relate to the frustration of the charactors one part made me jump which is good for a movie nowadays. Only thing i marked down this film for was fact that not enough guts being ripped out of people like classic zombie films. Love the different zombie movements each one moves v differently like normal people do and think the whole film needs more recognition as it gets a massive thumbs up from me"}, {"id": 169, "text": "Why the main character has to do the opposite thing to common sense every single time? The film has a good rithm, and the zombies make up is nice."}, {"id": 170, "text": "He should know better how to survive and be smart in mastering the situation, all players know how to master the game, he is not a true gamer. he is like a street boy who knows only socializing teenagers. I am very ashamed to see this movie. in addition, it puts my favorite brand ROG. And he plays PUBG right? survival game? ok fk that movie wasted my time! THE TITLE SHOULD BE NAME JOON-WOO because this story only focuses on the playful character."}, {"id": 171, "text": "Stupid script its like the low bgdet movies in us ........"}, {"id": 172, "text": "Is there a version in Korean with subtitles because I found it really off putting listening to the horrible American accents coming out of the actors mouths it was so wrong I had to stop watching people who watch a lot of Korean dramas want to watch in the original language to catch all of the Subtle nuances and emotions which you don't get with dubbing I hope this is not the way Netflix is going because I will stop watching and go elsewhere"}, {"id": 173, "text": "I need more movies like this.. Very impressed me.."}, {"id": 174, "text": "I'll tell you the truth, I'm in the middle of this movie and I'm going to end it just to see how it ends. The thing is that even if the premise is kind of good, the main character is TOO GOD DAMN STUPID for me to enjoy it. So far almost everything he did is plain stupid. It doesn't help either that after 20 days of not eating he looks good and even have his good share of energy. It has little cool details, the WIFI headphones, the drone, etc..but I'll repeat it, just even if he was the stupidiest streamer on earth, just for playing survival games he would have at least a game related idea that things can get worse and try to apply some survival strategy regarding food, water and energy. Would have been MORE REAL, and COOLER to alt least try those ideas copy from games or series or movies and fail, than acting like a complete IDIOT...and BTW so far, the zombies are far from homogenic in their behaviour and abilities."}, {"id": 175, "text": "This film was amazing. After just watching Train to Busan 2 which was very disappointing considering how great Train to Busan 1 was. I basically lost hope for Korean Zombie Films. However, #Alive redeemed my feeling towards Korean Zombie Films.It's started off as normal in normal everyday life, which I this is the best way to start a zombie film. Adds more suspense and story line. Bearing this in mind it jumped quickly into the film with complete catastrophe occurring outside Oh Joon -woo's (the main guy) apartment complex. Followed by news broadcasts speaking out on the complete mayhem in the world.This film was super funny, scary and made you sit on the edge of your seat. (Well, at least I did) A girl (Kim Yoo-bin) saved him while he is trying to end his life. They make a connection and communicate from to each other from there buildings they live in.Later on in the film they both get together and while running from zombies end up both getting saved by this nice ( or is he) man.After feeding them and giving them water, his role runs sinister when you find out he just wants to feed them to his zombified wife!If you have read all this and haven't seen it then I'm sorry because you have just ruined it, or did you? Go find out for yourself and WATCH it"}, {"id": 176, "text": "I see alot of people comparing this to the night that eats the world. But don't let that put you off. Whereas that movie was boring. This is what you want from a zombie movie.Pretty much everything that could happen while trapped in your apartment surrounded by zombies happens here. Of course its Still a bit restricted sticking to just a few characters. But you will care about what happens to them. There is lots of zombie action and the zombies are terrifying.There's no prizes for guessing where its all going but its a fun ride none the less. I'd compare this more to Train to Busan. If you liked that. You'll like this."}, {"id": 177, "text": "So many plotholes, like people would seriously drive to the TV studio and give emergency conferences and air ramen ads. Squeezing in product placement shot like that, not quite subtle.The characters need to look untouched during a zombie apocalypse with their perfect skin and their spotless outfit.Of course the helicopter suddenly appears out of nowhere, from the bottom to the top.It was so bad I laughed."}, {"id": 178, "text": "09/12/2020 Alot of movie but not much ZOMBIE Do yourself an hour and a half favor and skip it, because it SUKS. It's no Korean Train To Busan movie. Bon Appetit'"}, {"id": 179, "text": "The best part of the movie, some guy falling to his death while doing a live stream hanging out his window."}, {"id": 180, "text": "Well, the movie is not unwatchable, but zombies are overdone at this point. Too much product placement to the point where it gets distracting. According to this movie an iPhone can hold charge for 20 days, because it's a very well known fact that that's exactly the best feature on an iPhone: battery life. Main character is an idiot. Nice zombie makeup, if this was 2006. The original french movie The Night Eats The World from which this one stole its ideas is much better, though for a different audience."}, {"id": 181, "text": "This 2020 Korean horror film tells about a teen who becomes trapped in his flat during an epidemic of people turning into ravenous zombies. He soon discovers he's not the only non-infected survivor. This isn't bad, the cast is decent and there's good, gory make-up effects. If you enjoy zombie/horror flicks like Train to Busan, you could check this out, especially on a rainy day."}, {"id": 182, "text": "Fan of K cinema and zombie genre. Read the Korean reviews that #Alive was an offspring of Train to Busan and Exit. IT WAS NEITHER NOR. Not even Yoo Ah-in &amp; Park Shin-hye (my favorite K- drama actress) could save this film..."}, {"id": 183, "text": "#ALIVE is a South Korean film with a very simplistic and familiar presence - a young man hides out in his apartment during a zombie apocalypse - that some have linked to the French indie THE NIGHT EATS THE WORLD. But then it is a very generic kind of premise that I had the idea of writing myself a decade or so ago. In any case, films like this live or die depending on the execution, and the good news is that #ALIVE is a winner thanks to plenty of hard work on the part of the director, who wrings maximum suspense, humour and action from that premise. It's fast-paced and engaging, saddled with an annoying but realistic lead who grows on you as the story progresses, and a great female supporting character. The zombies are the scary ones you'll remember from TRAIN TO BUSAN and KINGDOM, making this all the more gripping."}, {"id": 184, "text": "I don't know why Netflix produces on that garbage thing. No film making knowledge, no scripting, no, nothing at all. They just want to make something related to Zombie, that's it. Totally time waste."}, {"id": 185, "text": "Why is people in zombie movies act like they have never seen a zombie movie?Plot hole after plot hole, and the lead guy is so stupid it makes the movie almost unwatchable.I think it would have been better for everyone involved if when he tried to kill himself half way through he actually achieved it."}, {"id": 186, "text": "Although inspired by the book, I can't remember another movie that was so bad. Totally cliché. Undead expert zombie killers, zombies that instantly understand the noises made by non-zombies, unnecessary and continuous action. Everything is bad! I just liked the lead actors' performances."}, {"id": 187, "text": "Really bad acting. Seriously and the character is also annoying as hell."}, {"id": 188, "text": "So many plot holes, unclear actions and weird acting."}, {"id": 189, "text": "I'm sorry but I really had to stop watching after ten minutes. The acting was horrible, the cinematography was horrible, and the editing was sub-par. I literally cringed for the entirety of ten minutes. I got second-hand embarrassment from watching it."}, {"id": 190, "text": "Yes complet complete completed by shdmwbziwnjzkz skznqkzjs. zmzja"}, {"id": 191, "text": "Why do the people who give poor reviews insist on looking too deeply into the movies they watch. 'Zombies hear a noise in a high rise block, and know which exact room and level it comes from'. 'The actors make dumb decisions'. 'The zombies are inconsistent, because some run upright, whilst others scurry about on all fours'. PLEASE! It's a slice of fantasy. It's not real and is not meant to taken as such. There are no such thing as zombies, so to be critical of their behavioural attributes is just ludicrous. Of course the actors do dumb things! It's part of the whole genre. Just sit back and enjoy it for what it is and stop trying to be smart-arses."}, {"id": 192, "text": "Amazing movie I love the way it went straight into action I caught my attention straight from the beginning the plot was so so good and the main characters are just great at acting I really enjoyed this movie and really recommended it Loveeeeee ittt ^-^"}, {"id": 193, "text": "I love zombie genre but most films until this one have been quite similar. This is a different movie set amongst high stories in Korea. Great acting. Watch it, you won't be disappointed."}, {"id": 194, "text": "It is okay to watch to release your stress. I am grateful that there are not too many bloody scenes. Also, I think that the actors perform really well and I can fully feel the desperation. However, several plots are not logical if you think it over. Spooky atmosphere with not well-organised details."}, {"id": 195, "text": "Great zombie movie of 2020.. Loving it. Park shin hye and yoo ah in aee Superb!! 😍"}, {"id": 196, "text": "After the success of Train To Busan Koreans have definitely jumped on the Zombie train.(pardon the pun), and this is an enjoyable smaller scale Korean Zombie film. It follows a lazy son who prefers to spend his time at home online gaming but is now force to fend for himself when he is separated from his family due to the fast spreading zombie epidemic. Like a most modern zombie films it seems to follow the viral contagion format and the zombies can be quick and retain some of their abilities from their past lives. The character is relatable and we tend to relate to him and celebrate his triumphs and groan at his mistakes. The focus of one character in one location makes this a lot less epic than the hit train to Busan, but not less interesting and tension is built well. Definitely worth a watch for Zombie fans, enjoy!"}, {"id": 197, "text": "Despite being dubbed in English, the main actor shows strength in leading a a very small character based film. He simple acts with emotion and a youth view on what to do!"}, {"id": 198, "text": "That's really a good film... I like it... It's a low budget film, I like the story &amp; direction."}, {"id": 199, "text": "I really like this movie but the reason I give 7 star is you can't watch again and again and at some point you lost your interest. Leaving all that the movie was great and you must watch it once even if you don't like South Korean movie or dramas."}, {"id": 200, "text": "Watchable, time pass , heroin is cute Watchable, time pass , heroin is Watchable, time pass , heroin is cute"}, {"id": 201, "text": "I am partial to Korean movies but this horror flick was just so messy and cliche. The effects are pretty standard and the story is rather foreseeable, but it is made clear from the beginning the film is made mostly for pure short-lived entertainment. #Alive attempts to keep the audience engaged with tense moments and life-changing decisions from the protagonist but falls short when it comes to delivering a great story bolstered with even greater dialogue. The ending is the most disappointing part of the film imo but there were some interesting moments and nice angle shots scattered here and there. If you're bored I recommend watching #Alive to pass time at night or with friends which could be fun, but if you're a film buff (in the genre of horror especially) I'd say you'd be wasting your time."}, {"id": 202, "text": "I was going to give this an 8 most of the way thru then upped to a 9. However, after that ending, it's a 10! We needed this!"}, {"id": 203, "text": "It's an okay film. Basic dystopia horror scenes. I give the cinematographer props for the hard work filming this.Movie seems like it had a very constricted budget."}, {"id": 204, "text": "Just watched this movie on Netflix. This movie is one of the most stupid Z movies of all time. The main character is soooooo dumb af, that I don't have nerves to describe some of his actions. The plot is another disaster with tremendously big black holes. I'm just curious, how, just HOW #Alive has 6.2 rating. I can only give it 1. I see this movie tried to copy the French film The Night Eats the World which I recommend to watch instead of this one, and for some reason it only has 6.0 rating. The Night Eats the World is not a masterpiece BUT there are no such terrible problems with everything like in this one, I can believe in the character and to the story.I liked the Train to Busan and thought that this movie is also going to be interesting, but unfortunately, it is just stupid, I don't have any more words."}, {"id": 205, "text": "A Millennial's struggle to survive during a zombie outbreak which should have done more with its isolation theme and setting. Although he has access to lots of modern technology, he has no survival skills or willpower and is easily bored without digital entertainment. The film is slow and with no real surprises, but the zombies are entertaining and look good and there are some humorous moments. The lead doesn't really have any character growth, his relationship with the other survivor never develops and the ending sequences are very anticlimactic."}, {"id": 206, "text": "Really original concept, likeable characters and decent script. Really enjoyable zombie movie"}, {"id": 207, "text": "Wow! Why are the Korean film makers so good at this genre? I'm a big fan of George A Romero and his zombie films but recently the Koreans have taken the genre to a new level. Train to Busan is gobsmackingly brilliant and the sequel, Peninsula is also a worthy contender. Alive is on a par with them. The humour is good, the characters are very believable and likeable. I was glued to my seat watching this.. hoping that they survive to see another day. Excellent acting.. I can't think of anything else to say except ABSOLUTELY BRILLIANT!"}, {"id": 208, "text": "Good visiol ... brilliant acting.... nice and lovely and supresing ending"}, {"id": 209, "text": "A nice movie which is easy to watch, especially due to the fact that it's not made in Hollywoood and lacks most of its clichees and stereotypes: a movie without sex, politics, evil corporations/army, quota diversity and pseudophilosophy, just people trying to survive."}, {"id": 210, "text": "'#Alive' finds drama and tension within one man's apocalyptic imprisonment while zombies are largely kept locked outside, only posing a threat while society crumbles and we become our worst enemies."}, {"id": 211, "text": "Il Cho, the director and co-writer is one of those movies makers who doesn't have the talent needed to make a good horror movie. Most of them, lacking imagination, find it easier to create lead characters that are extremely stupid. On top of that certain situations in the movie are totally implausible. Avoid this one...really."}, {"id": 212, "text": "It was the most pointless movie, i have ever seen. Don't believe rating , probably just nationalism rating"}, {"id": 213, "text": "Worst zombie film ever i have watched in my life. Thanks."}, {"id": 214, "text": "#alive was amazing. I loved the reality of the situation. Being locked in your own home while the world is falling apart around you, having to utilize your resources carefully and seeing just how long you can survive. There were a few elements that i didn't quite understand how they happened but I'm not giving anything away. If you enjoy zombies and survival, then this is your flick. Oh yeah, my only criticism is the fact that its dubbed over in English, but i just prefer movies to be shot in the fashion it was meant to be in."}, {"id": 215, "text": "It was a good movie to watch. As most of the zombie movies this movie also contains blood and gore. The acting of the cast members kinda made me cringe a bit. I never watched a Korean movie. I guess that's how they act. But the ending made me really happy. You feel like you and your emotions are on a roller coaster. I hope this pandemic doesn't end like a zombie apocalypse &gt;_&lt;.."}, {"id": 216, "text": "I enjoy a good zombie/survival film, and you know i enjoyed this, it's 100% worth a watch.Thought the ending was a bit rubbish, but a decent film with a couple of twists and turns.I enjoyed the fact, there were less guns, made it more Realistic Survival, if you know what i mean, the average person sort of thing."}, {"id": 217, "text": "As zombie flicks go this is slow to get going but actually turns into a pretty decent film if you give it time. The zombies are well done with loads of jerky body motion and pretty athletic and relatively intelligent retaining bits of their human behaviour almost at a reflexively. Very watchable."}, {"id": 218, "text": "I mean, you will have thrill, bit of scare and most of all, curiosity to find out how / if they got out alive. That alone would get a 5 from me. A plus point is for plot. The story has sections, so at least you won't feel like the director is trying to stretch a detail due to lack of idea. However, plot holes are quite abundant. Wrecking TV, no storing water and saving food, stupidly trying to get signal, ... are a few noticeable ones."}, {"id": 219, "text": "For the speed of the zombies while chasing random people and slowed down while chasing the main character. The rest of it is great. Great character building &amp; chemistry for Yoon Ah In &amp; Park Shin Hye, korean has way to create an iconic and unique character like its straight out a comic book (fashion wise). Smooth product placement from samsung, rog, ottogi, nutella, (mineral water brand), (drone brand) and much more.."}, {"id": 220, "text": "OK movie, but that's about it. Maybe the lack of likeable characters and the overall scenery are what make this movie just more of the same. With so many zombie movies out there, this is not a surprise.Oh Joon-woo is definitely the crude stereotype of today's nerdy youth; Kim Yoo-bin is just there to add a little romance to the story. Plot twists are minimum and, above all, expected. The ending is at least fine."}, {"id": 221, "text": "D-zel disliked the movie and said about it that it is Kharyan ma Daryan"}, {"id": 222, "text": "I get what this movie was try to be but it falls flat in all aspects I mean there are some moments that had me ob the edge of my seat but then there are some moment that made me go what were they think the zombie are inconsistent some can climb buildings and some just get blocked by a simple object in front of the door and it The zombies can attack when people make noise but sometimes people make noise and the zombies don't do anything and the pacing was inconsistent all and all if you like zombie movie give this one a chance"}, {"id": 223, "text": "Love the idea of the movie. Can relate with nowadays situation. But too light for zombie apocalypse movie and the ending was..... (you'll see it)"}, {"id": 224, "text": "This is better than good. Strange stale translations for dialogue but an epic movie nonetheless. I have to state it too: don't knock it, it has its own key. The roving herds attracted to sound is great. The building as a backdrop and almost a secondary character is great, too."}, {"id": 225, "text": "The movie is more or less a realistic approach on what a zombie apocalypse would look like."}, {"id": 226, "text": "After the 'Peninsula' I thought that was it for Zombie films out of Korea but this has saved the day! Good scares, good zombie actors and simple yet effective plot. An Oscar isn't going to be won through this film but do we really watch a zombie film to see an Oscar winning performance?"}, {"id": 227, "text": "Nothing is interesting here. Poor acting. Lame story. It's just 90min of waste of time. Is there any more creativity in zombie movies? With Alive, I doubt it"}, {"id": 228, "text": "I really enjoyed #Alive, it can be hard to find good zombie films that aren't cliche or poorly done. But this film did almost everything right! It has a good story with only one predictable part but I will get into that later. The acting was great with likeable characters and the camera/editing/sound was great too nothing that takes you away from the film. The pace of the movie can be slow at times but then suddenly switch into action packed scenes that keep you on edge. Definitely worth a watch if you like zombie films and don't mind subtitles.Now for the spoilers so don't read any further if you don't want to see spoilers.The predictable part seems to happen in every zombie movie, they meet someone else and that person tries to kill them for one reason or another such as feeding his zombie wife. Even though it was predictable it didn't take away from the film."}, {"id": 229, "text": "The movie is quite enjoyable. I am a big zombie films fan, and this is one of the better, more realistic takes on the subject. But, as good and enjoyable it may be, its premise that becomes the message of the film in the end spoiled it for me a bit. Without spoilers, in the movie social media is quite a hero. #Alive gives quite an awful message away that you must post on social media, otherwise you are toast."}, {"id": 230, "text": "Fresh take on the genre, liked the characters and the way they reacted to the situation."}, {"id": 231, "text": "Actually the first part of the movie was surprisingly good. It had a different aspect on this zombie movies. We always see a bigger part of the influence of zombies in movies. Therefore showing only one person trapped in an apartment was interesting. But the second half especially after they meet with each other and this creepy dude trap them, movie want downhill. The ending was rushed."}, {"id": 232, "text": "This is not the sort if film that I like at all, but I liked it ...a lot! The two leads are what drew me to watching it. The intensity was evident. The acting was out of this world to feel their terror, their fleeting memories, and their depression. Yoo Ah Ihn never fails no matter what he tries; Park Shin Hae played something completely different and it did her good to be able to get such recognition."}, {"id": 233, "text": "Every single cliché has been used to produce the most generic zombie film of the decade. A trite and extremely badly edited end sequence compounds the failure. Terrible acting, extremely poor CGI and continuously breaking their own ground rules, #Alive is a complete flop."}, {"id": 234, "text": "Not worth watching. It's really dull and stupid. Acting is terrible. Plot is boring."}, {"id": 235, "text": "#Alive: Another South-Korean Zombie flick. Teen Joon-woo is alone in the apartment, his family are away, leaving him a note to get groceries. Gaming on line other gamers say watch the tv. The Zombie Apocalypse is here! Announcements on the TV warn of cannibalistic behaviour by crazed people and suggests that everyone settle down with enough food for 60 days. Woon-yoo is short of food and water. But things really get bad when his game goes offline! Some great scenes especially when Joon-woo watches from his balcony, vehicles crash, people flee as others start to bite, a schoolgirl shouts for her mom, they meet and embrace, then the schoolgirl starts to eat her mother! Zombies storm buildings and charge along balconies, braking into rooms seeking the living. These Zombies seem to be still alive and can be killed. A tale of isolation, despair, hope raised and dashed again but a perseverance to survive and stay #Alive! A great Zombie thriller directed by Il Cho, co-written by Il Cho and Matt Naylor. On Netflix. 8/10."}, {"id": 236, "text": "Night of the Living Dead, Dawn of the Dead, The Evil Dead, Juan of the Dead, Alive. That's my top 5. The Resident Evil series is pretty good. What makes this movie very well-made is that there is a lead character who is the hero in the movie and he meets a woman. They're both in the same boat; trying to survive the zombie apocalypse. The only questions are, how do they combine forces and how will they make it through and to the end."}, {"id": 237, "text": "This was a great movie from the very start- it had me cheering for the human team and I was so happy how the movie ended. I would recommend this movie for a date night if you both are into movies like this."}, {"id": 238, "text": "I simply gave it a 9 for the original take on what has become a boring braindead genre to watch, basically after the remake of Dawn of the Dead (Snyder), 28 Days later and World war Z pretty much nothing good has come out until this! First I thought oh no another zombie film but since I kinda am addicted to the genre and since this a Korean film just like the awesome Train to Busan was I gave it a go. The story is super original, comedic at times, bleak as any post apocalyptic story would be but not to depressing, creepy and claustrophobic with a few proper scare jumps and a good balance between horror action and drama! I think #Alive just gave a breath of fresh air to the genre! Writers and directors take note! I only feel that the story should have a bit more pace since it started very fast and I feel the picture quality could have been a bit more saturated."}, {"id": 239, "text": "I'm a big fan of foreign films as well as zombie movies and alive is not only one of the best zombie movies I've seen but it's also one of the best movies I've seen in 2020 the acting is great and the special effects are great too I love the two main characters especially the main female character The action starts off right away and doesn't stop and the ending is great too Overall I love Alive and I like it better than train to Busan although both are great Korean cinema is destroying Hollywood these daysHighly recommended"}, {"id": 240, "text": "It was truly disappointing to see the South Korean writers putting out such a idiotic horror film. They seem to have watched every brainless American slasher flick to get their horribly stupid plot. The protagonist seems to have absolutely no survival skills of any sort and survives on sheer dumb luck. Also the utilities (water, gas, electric, phone, etc.) stay on far longer than they should. I had considered the Koreans to be one of the last bastions of good horror films, I guess I have to rethink that. Truly sad to see."}, {"id": 241, "text": "Different enough to stand out from the rest of the zombie fodder, this South-Korean zombie film is a mixed bag of interesting ideas and jarring tone shifts. It wastes no time jumping into the action and the film builds its pace from there. There's more than a few conveniences to the plot and some scenes just didn't make much sense - like them not hearing the helicopter right behind them and resorting to suicide right after securing a bunch of supplies. Nevertheless, it's still worth the watch if you're a fan of the genre.The film can feel repetitive at times and there's a few cheap fake-outs. It's not hard to see the flaws in the film, but if you're just looking for a background watch or something relatively easy to get through then it is worth it. The acting's fine, though Yoo-Bin's character could've been developed a little more. I'm not a huge fan of the film's zombies, they're those sort of new zombies that's movement and noise is edited in post, making them unrealistically twitch and screech. There's better zombie films out there, but this switches things upa little bit and puts a modern, if a bit forced, spin on things."}, {"id": 242, "text": "I love zombie films but this is..eh at best. Usually you get tension from people actively trying to not get eaten but the premise here or well from most of the scenes they show is more passively surviving like for a longer run thing they even show the main supposedly surviving for X days alone and going crazy for it. But it fails in that aspect. We see him have only a small portion of food left. We see him get his water cut off. Then boom we see him X days later. There was no build up of desperation for the audience to feel how grave the situation is. I mean there was even a scene where one of the main waters a plant...You're supposedly trying to survive but you decide to use your precious water for a plant???Another thing. The first part is weird. They live in apartment complexes so it's weird that all those rooms have infected people all of a sudden. And all of the residents were running outside when there's supposedly some aggressive people roaming outside?? And are you telling me that from all those room only the mains decided to stay indoors?It just hit me wrong. I feel like the leads are just idiots. And a lot of the scenes doesn't make sense. Like when the zombie horde suddenly run up the buildings for no apparent reason. They established that some of the zombies kept human actions like opening doors and such but I feel like the rare use of it just make it like a plot convenience instead of good writing."}, {"id": 243, "text": "Lost interest at 03:59 when a Zombie opened the car door, The movie is thriller for sure but don't expect too much zombiefication."}, {"id": 244, "text": "I just finished watching this and I'd give it a 5/10. I think the storyline is good itself, but written very badly, it doesn't really make you sit off the edge of your seat, and some scenes were slow or irrelevant to the plot."}, {"id": 245, "text": "Bad movie.. Just wanna see park shin hye only.But the story line was awfull"}, {"id": 246, "text": "While most of the acting is adequate, none of the characters are memorable. And without compelling characters to get invested in, '#Alive' needs some killer sequences, unique zombie attributes or stylish directorial choices. Alas, none of these are present - everything occurs exactly as you expect. Still has its moments but '#Alive' is pretty much a predictable and generic zombie flick."}, {"id": 247, "text": "If you watched train to Bushan, you probably will feel very depressed on this title. It's just full of nonsense, illogics and stupidity.If every movie has a point to make, a story to say, a viewpoint to persuade, this movie has none.The story is simply too horrible that acting is not part of discussion."}, {"id": 248, "text": "Obligatory female super hero thrown in by Netflix, with a basic storyline ready for quick commercial release.The English voiceover is atrocious and implausible, I turned it off after 5 minutes.The movie is average, and plays on the current situation in 2020."}, {"id": 249, "text": "Bland movie which lack character development. The hero is just stupid, the girl is more interesting but we barely know anything about her. The scenes with the zombies are the only good thing. A basic survival story. Train to Busan and world war z might have put the expectations too high."}, {"id": 250, "text": "This movie was fast. Most movies I see now are too slow. That's why I liked this one. It doesn't have a lot of unnecessary characters and is very simple and enjoyable.The ending was perfect. Instead of focusing how to eliminate the disease from the world, it focussed more in survival of two ordinary people. They are not trained or anything. It kinda shows how ordinary people will face the zombie situation.Park shin Hye did a good job as always. I didn't like the male lead very much."}, {"id": 251, "text": "The movie overall was good but lacked believability. A movie character that is deeply involved in gaming with knowledge of farming and violent shooter games should have useful skills that would make a zombie filled world survivable. Yet his only weapon of choice is a golf club with little dexterity and loss of years of gaming knowledge. takes the kid weeks before he decides to venture next door to scavenge for supplies. When he stumbles upon a climbers supply next door he lets his guard down and runs from one zombie. this is moments after facing multiple zombies. All I ask is that the characters live in the world they live in and use the skills that is innate in them. I dislike the need for drama and how characters are placed in vulnerable situations when in reality any common person would step up and survive. Make the situations believable!!! could have shot the man feeding his wife and kicked the door down but instead decide throw the gun aside and appear weak. Situation not believable. Real life situations will make a viewer vicariously feel what the characters feel."}, {"id": 252, "text": "Not a huge zombie fan, so 6 is quite a lot. Yes there is still a lot of running and screaming, but this had a refreshing new approach. Up to date and some nice twists. Good acting even from the dead extras"}, {"id": 253, "text": "A little bit different from all the other zombie films out there, but very enjoyable.It is a fun watch for sure.When you are into zombie/virus movies try and see it."}, {"id": 254, "text": "Sick of seeing those advertisements of Ramen and other stuffs. Director should be serious of making a movie not trying to make money by supporting the commercial products."}, {"id": 255, "text": "I'll be the first to admit that the movie felt a bit,... short. Or at the very least lacking that SOMETHING that we want in most zombie flicks.The build up of the characters were fine, and the acting was decent for what they were trying to portray, but there were a few,.... issues with how they handled situations in one scene, then complete 180 in another.The woman is afraid of heights, but there was zero hesitation to jump out of a seven story building using a rolled magazine as an anchor point, and landed perfectly fine in the middle of zombies within seconds. There is zero fear there, no tension at all. It felt like it was purely put there to make the character seem experienced in survival.Then there's a camera change to the Male lead,... who was watching the entire time and has ZERO experience suddenly being on the ground assisting her out of a tight spot. There was so little time between the frames that he would damn near have done the same thing as her!Then there's the issues with the cell phones that was thrown in your face often. Service issues, but for the longest time in the beginning he was playing games no issues. So he never once attempted to communicate using the internet? He focused on video games?I don't know. It was a good watch, and a good attempt at something that was more than just gore and blood. But it just falls short of being a must see like Train to Busan.Also,... doesn't he know that alcohol will dehydrate the body quicker? Wasn't a smart move at all when you have no access to water. The male lead was REALLY stupid,...."}, {"id": 256, "text": "Oddly enough I hadn't even heard about #Alive before getting the opportunity to sit down and watch it. And even more surprising is that I am a huge fan of zombie movies, so the fact that Alive had eluded me was odd.Nevertheless, this being the year that the highly anticipated Peninsula - the sequel to Train to Busan - also coming out, it was a little bit strange to find another zombie movie from the South Korean cinema. Not that I mind that, no, no, no. Not at all. In fact #Alive (aka #Saraitda) actually turned out to be more enjoyable and entertaining than Peninsula was. Yeah, I know, right...Anyway, I will say that #Alive is not your average run-of-the-mill zombie movie. And I love the way that the movie starts out and just throws the audience right into the action. That was just glorious. I liked that so much, because the zombie action is what is enjoyable, not the things leading up to it.The acting in #Alive was good, and the lead actor and actress managed to carry the movie quite well, especially since there were hardly any other performers in the movie with dialogue.The zombie make-up and effects were good, and taking into consideration that this was in the beginning of an outbreak, you shouldn't expect to see fully decomposed shambling corpses. Normally I am not overly keen on running and agile zombies, but I will say that it actually worked out well enough in #Alive, for some reason.If you enjoy zombie movies, then you definitely should take the time to sit down and watch the 2020 movie #Alive from writer and director Il Cho, because it does bring new contents to the zombie genre.I am rating #Alive a six out of ten star. Quite worth the time, money and effort, and a well-worthy addition to the zombie genre. So it seems that 2020 did end up with a proper zombie movie after all."}, {"id": 257, "text": "In a world where everyone wants to do the next big thing with zombies, it's actually refreshing to come across a film that sticks to the basics and does them very well.The are some #hashtags here and a smattering of $CURRENT_YEAR, but the fundamentals are rock solid. A small cast, a single location, and a taut story arc are really all you need for a decent zombie survival, and that's exactly what you get here.Everything is at least competent, and the pacing in particular is spot on. There are no flat spots, nothing lags, and it's not rushed: it carries the development of the characters and the situation at just the right pace, drawing you in to their story without forcing it along or ever quite becoming overblown.The two leads are very personable, their actions and reactions are credible and well presented, and their relationship is nicely judged, helped along by a score that complements but doesn't oversell what's on screen.It's not groundbreaking or brilliant, it clearly cribs from other sources, but it's a thoroughly decent straight presentation of the genre that doesn't overstay its welcome."}, {"id": 258, "text": "First of all I must say: I LOVE zombie moves, even the very cliche ones I just love, I guess I was so afraid of them in my childhood that turns out to be a passion nowadays.But let's talk abou the movie: The direction is great, Is really well made, exiciting when it has to be, calm when it has to be, really great, but the photography is phenomenal! It's just beautiful, the colors and the scenary was very beautiful.But the acting... man the acting was amazing, I'm really surprised, in the beginning I thought Ah-In Yoo was just going to be ok, just ok, but no, he deliver an acting with intense emotions and action, same goes to Shin-Hye Park, both great actors that I hope to see more in the future. The most negative for me about the movie was the script, It was not bad, It was just cliche, doesn't have anything new in it, but the movie is so well produced and perfomed that turns out it became a unique movie.Overall It's a great movie, if you like zombie movies you'll be very surprised by this movie, I would give a 8,5 if IMDB allows me to do. :)"}, {"id": 259, "text": "Not quite at the level of Train to Busan, this is a more small time movie, with more of that lone survivor feel. But overall a great movie. Definitely worth a watch.Good elements of the zombie movie genre, with the isolation, hopelessness, dread and brief moments of hope. The characters were quite believable. The story was simple but effective.It's another infected rather than typical zombie type of movie, but didn't get carried away with things like many do (no super infected outrunning cars and having super senses for example). While I do prefer the more traditional slow shambler, these infected were decent. The special effects were pretty good too.Korea's really outdoing Hollywood when it comes to these types of movies. Can't wait to see what else they have to offer."}, {"id": 260, "text": "I just don't know why exactly but blockbuster disaster movies are what I'm craving at this moment. Maybe the ongoing pandemic has a lot to do with it, but anyways, I found #Alive a highly entertaining zombie action thriller. It is the perfect movie you need to see if a real-life pandemic alone is not enough to convince you to quarantine yourself.The film wastes not a second in jumping to the conflict and the result is non-stop action. One of the best things about the film is its action sequences: all choreographed well with a lingering sense of vulnerability that makes them more enjoyable. Yoo Ah-in and Park Shin-hye are the only leading actors, and both of them deliver fabulous performances. While there's not enough detailing of the zombie disaster going on, it's just plausible because then it puts you in the protagonist's shoes: you too know nothing, except there's lots and lots of zombies out there and the only way to survive is by killing.Further, the limited setting is another cherry on the top. #Alive just never runs out of entertainment and goes on to deliver endless fun, replete with action, drama, horror and suspense. It might not be the greatest zombie film ever made, but pretty sure joins my list of some of the best ones to date. I'll recommend you not to expect a complex plot: just expect some nice performances, character moments and lots of breathtaking zombie action."}, {"id": 261, "text": "Alive, or #Alive, seems an apt zombie flick to view during the widespread quarantine of a real-world pandemic, as the survivors of the movie's outbreak of the undead lock themselves in their apartments. It's about time in another way, too, as I've never understood why in most such movies the living try to run away from fast zombies and hide from slow ones--seems backwards to me. So, kudos to Alive merely for the hiding, for the most part, from the speedy ghouls. It also allows for an unusual examination of survivalist tactics: more watching TV for news and rationing food than aiming for the head. The application of gamer skills is more iffy. Moreover, the reports on TV largely treat the outbreak as a viral epidemic. Other zombie flicks have done this, as well, though. What really stands out in this one begins in the title with the hashtag; this is a picture thoroughly wired to the age of social media, mobile phones and the internet.Ostensibly, the tacky message at the end glorifies this media, but I'd argue the scenario overall rests on an unsettling depiction of technology--to the point that the zombies are a metaphor for lives lived online. The moral depicts the military, as an extension of government, saving people by tracking them through social media. It's eerily similar to what the zombies do throughout the picture in stealing people's identities. In fact, they don't see or smell you; it's only when you make a sound that they come after you. Largely, this is through technology. Note that although the water supply is cut off, electricity somehow remains, and TV is only lost when the hero finds an unusual way to cut the cord, so to speak. In the plot, the outbreak begins when our gamer protagonist is online with his friends. Later, he sends messages to his online followers. The attention of the undead is also gained by his attempts to connect with others--whether by drones, leaning over edges with his phone attached to a selfie stick, or, by more old-fashioned methods, radio, non-electrical wire and simply yelling out to the world.The narrative goes out of its way, too, in pointing out that the characters are separated within apartments despite their urban proximity. Cannibalism, like social media and the government tracking you through it, brings these people together. I'm not going to bother wondering whether any of that is a good message, but the dichotomies are interesting: close together yet separated, hiding but calling for help, attention feared and desired, connected and disconnected. Oh, the zombie action is OK, too, if nothing especially innovative and even if the puppy-love subplot is cloying."}, {"id": 262, "text": "I've heard there was an other movie that had almost exactly the same premiss as this one, but I will not take that movie in to consideration while I review this movie.So I will start with the positives of the movie: It brought alot of new stuff to the zombie genre, like bringing in the modern area into the flick and how it could have been used in a scenario like this. So I really appreciate that part of the movie. The characters of the movie act kinda smart aswell for example drinking the spilled water from the bottle, blocking the main door and windows. (but not the hallway windows) Some stuff could have been executed better.But I would say about there the movie just did not care to give a proper solution to the problem that was at hand, it was full with cliques all around that was really predictable. The ending was really terrible and you could see it from a mile away.But all and all It was an okay watch. I give this one slightly above average score just because of the new things it brought to the genre. 6/10"}, {"id": 263, "text": "NETFLIX'S #ALIVE is a joy-ride for all the Zombie lovers and the main reason is not Zombies but the lead actor Yoo Ah-in. He is pure gold playing the role of a helpless soul trying best to survive the Zombie scare. Yoo has no idea and now, he is stuck with limited resources to live in isolation (I guess, we can relate to that feeling).A well-paced action where nothing feels like a drag and that my friend, is a great achievement. The action starts immediately where we don't know why this Zombie-ness is all over in this Korean saga. But we don't care coz the flow is really smooth and there are no dull moments. Though there is nothing new to offer that can redefine the genre, Alive is a really good watch.Thanks to the sharp narration by the Director- Cho Il-hyung, there are genuine moments to make it an engaging affair for the audience. Nothing creepy or a bloody mess. Just pure play fun ride to enjoy."}, {"id": 264, "text": "It appears decent for about 3 minutes, but it's just forgettable in every way.The main character is just painful to follow, the movie gets everything wrong that would happen in any real scenario, and the story is just horrendously bad, especially the ending.The movie uses every cliché in the book and then some.Zombies react and the plot adapt according to the characters situation, not on their own agendaIt's not scary enough for horror It's too boring for action It has too little character or plot development for drama It's not funny enough for comedyIt's just messy, annoying to watch and boring from start to finish."}, {"id": 265, "text": "The parallels between this movie and real life quarentine cannot be ignored, and I think it does a pretty good job at capturing that sense of desperation and impatience that come with being alone for long periods of time.Like Train to Busan (a film that this will inevitably be compared to), this movie is surprisingly touching. The relationship between the two main survivors gives a lot of humanity to what could've been otherwise an overly lonely and depressing film.While it relies a bit too heavily on probably the most overused tropes of the zombie genre during the third act, it still succeeds at being unique enough to stand out amongs the rest, even Train to Busan.It gets minus points for having a hashtag in the title. Sorry, I don't make the rules."}, {"id": 266, "text": "There are zombies running amok in the streets. Meanwhile the central character sits in his parents apartment watching in horror as the world ends.This is a film with a small scope with just a splattering of action.I saw a rather dull, depressing, French film (The Night Eats the World) that had the same premise. This is much better. Although this has moments of high tension and stress it balances it out with scenes full of hope and joy.The main character's here are also very likeable, which is important as you are stuck in a flat with them for the whole movie.Although not particularly original there are some new elements here: like does our technology aid us or drag us down when society collapses. The zombies are great, they have that Eastern, broken marionette vibe and are terrifying (most of the time)At the end of the day this is mostly a guy bouncing around his flat with the odd bit of zombie action and romance thrown in -but for Netflix fodder it is very well done and I enjoyed it."}, {"id": 267, "text": "#ALIVE is a decent stab at how the zombie apocalypse may look from a gamer's perspective. That perspective is not very interesting.Waking up to play games, Oh gets notified of some weird stuff happening. Not five minutes later and it appears all of South Korea has descended into madness and only those who weren't on the streets are safe. Locked in his house with no way to communicate with the outside world, Oh has to get creative with notifying people he's still #alive and keeping himself that way. Unlike the standard zombie, or even in Korean sister flick Train to Busan, these zombies are smart - some maintain habits from life, they can perform simple actions, and they're fast.As Oh's resources dwindle, and hallucinations of his missing family set in, the movie gets interesting in showing the horror of having to choose one of two terrible actions - risk being eaten to make it to safety (where???) or just end it with his senses intact. Happily, the movie takes a turn to the light and offers an energy boost. Sadly, it doesn't escalate to anywhere satisfying and the ending is cute, not exhilarating. Also, the gimmick of the gamer stuck indoors isn't explored enough, leading to standard trapped in one room fare.Overall, not great but has some fun moments, especially in the second act as things turn dark."}, {"id": 268, "text": "I mean it's better than Train to Busan 2(Peninsula), which that movie disappointed most likely everyone.Alive is a pretty straightforward zombie film that has a nice structured setting to it, it doesn't involve too much action, but it always reinforces a dark and thrilling atmosphere for the audience. The suspense of it in every frame keeps you on your toes, and what I like about the film is that it concentrates on the use of modern civilian technology for a survivor which makes it one of creative aspects of the show, because you don't really see that concept in a zombie film.Most zombie films, be it Korean or Western, it always most likely ends up in a full-blown action sequence of events, it doesn't really portray the accurate behavioral details of a survivor in a realistic sense that which can be a most likely chosen case for anyone in that situation. Unlike the cliche zombie theme of getting straight to the action with a loaded carbine rifle, #Alive instead portrays a survivor trying to pull through an event that is hard to comprehend with the little resources he has in his apartment.Although just like any other Korean Zombie Film I've seen, details of the apocalypse ends up being non-existent, and not described well in the show. If you're that viewer that wants to know more about the background setting, then you won't really get a lot of helpful information around that.But overall, I enjoyed watching this show, it was suspenseful, thrilling and never really ends up boring, and I do recommend the film to whoever seeks a new Zombie movie to watch."}, {"id": 269, "text": "#SARAITDA AKA #ALIVE (2020) REVIEW . . 📜 Plot: The rapid spread of an unknown infection has left an entire city in ungovernable chaos, but one survivor remains alive in isolation and how he survives . . 👨‍⚖️ Review : #Alive pictures the familiar fast-moving undead masses and zombie-creating virus infections portrayed in famous Korean zombie thriller like Train to Busan (2016) in past. Korean movies have a distinctive touch when it comes to zombie flicks. Here zombies are more fast and agressive compaired to the stereotypes of slow zombies of America. #Alive is a survival horror flick where a Gamer Oh Joon-Woo (Ah-In Yoo) wakes ups late in the morning and the city is chaos.Ah-In Yoo's anxiousness of missing his family, the fear of the unusual environment , The way he tries to save food while he still wants to eat it, the frustration of him being alone in the apartment portrayed brilliantly. Director II Cho has added an engaging screenplay which gives you a rivetting watching experience similar to the levels of Train to Busan.Won't talk much about the second Half to avoid spoilers, but overall #Alive may not be the best zombie flick but it surely has a unique premise and a fresh take on the zombie survival genre. Kudos to the editing team to keep it short and tight with 98 minutes. . . 👍Goods : 1. Ah-In Yoo is brilliant. 2. The Fresh and Unique Premise of a survivor stuck in Apartment. . . 👎 Bads : 1. But its story lacks plausibility as it does not give details on the zombie outbreak and lead characters daring escapism skills seems unrealistic at times. . . 🔥 Final Rating : 7.5/10 . . ✅ Verdict : #Alive is intriguing and unusual and is worth your time. Commercially it was a success with limited screens in June when it released in South Korea. Give it a watch. . . Follow in Instagram for More : @RiteshReviews"}, {"id": 270, "text": "Alive takes a simple premise and cleverly crafts a very effective story around it.I did have reservations going into this one that it was going to be one of those tedious claustrophobic, psychological horrors and indeed, it could have been.Thankfully the writers accelerate the pace of this film by introducing more characters as a catalyst to motivate the main character and mould his actions.The use of technology, such as drones and social media is also used to good effect to craft and shape the story.The results a decent mix of what starts out feeling mostly like a psychological thriller, with horror elements and builds upon it, adding in layers of exposition driven, zombie action.The result is very watchable film that's increasingly tense and thrilling, as the main characters face growing threats from the undead and living alike, as they try to stay alive.8/10."}, {"id": 271, "text": "There are many fans of the Korean zombie film Train To Busan &amp; I'm certainly one of them. Apart from a heap of gut-churning excitement, it offered a surprisingly powerful emotional angle &amp; has rightly become a gold-standard for the genre. This new movie has been released ahead of Peninsula ( the sequel to TTB ) &amp; the primary hook seems to be the presence of romantic K-drama favourite Park Shin Hye as one of the leads. She's one of two normal people trapped in an apartment block during a zombie rampage, the other being a young man ( Yoo Ah In ). Will they be able to survive ? Will they fall in love ? Or eat each other ? Unfortunately, I barely cared. With the action confined to such a small area, there needed to be a lot of creativity happening &amp; there isn't. Despite a couple of good ideas &amp; a few doses of tension, there isn't a lot going on in general &amp; while YAI is suitably stressed most of the time, PSH behaves more like she scraped some paint off her BMW on a shopping trip than being zombie-fodder. And her face is absurdly flawless considering the messy/violent things she has to do. Matters pertaining to shortages of food/drink are also handled confusingly. Actually, the thought of seeing PSH getting down/dirty as a zombie is very appealing but that's a different movie. Is there any scope for genre innovation ? How about child-zombies ? Or zombies on water, building bridges to their prey with other zombies ? Come on you writers ! I hope Peninsula isn't awful, though reviews suggest it skimps on emotion."}, {"id": 272, "text": "Perhaps this movie should get more than its due? It is a nice story about a guy who finds himself isolated in his apartment during a zombie epidemic. Of course he will connect with a girl his age. She is, after all, the only other living being in the high rise. So he has to go and safe her. You know how those movies go.So why is this movie? This question ought to haunt you when you write this script. What makes your movie stand out? How about contrasting the real world with its real zombies with the fake game world with its fake zombies? Easy to kill something in a game but how about a real person? So how about having him save that cute girl, but the they have to divide those meager resources over two persons? How about making her pregnant, deaf, a lesbian, give her aids, make her a sociopath, make her or him fear heights or open spaces. And why zombies? What happens if you swap them out with something else? Would the story fall apart or does it not matter at all? Then why zombies? Herein lies the issue with this competently made movie. It is totally forgettable. Feel like throwing your stone in the endless sea of zombie flics? Well, this one doesn't even leave a ripple. Ramp up the stakes, throw in something unusual. Anything!Boy meets girl during the zombie outbreak?That is about it.Is that really worth your time?"}, {"id": 273, "text": "I am a huge zombie movie/zombie game etc etc fan. And this movie was so damn bad I wish I could take the time back I spent watching it.The main character is arguably the most useless human being on the planet. How he even remembers to breathe is nothing short of miraculous. When he's not being an absolute buffoon, he's busy running around like he's filled his pants. Which, maybe he has! At this point it wouldn't surprise me if he was meant to be wearing an adult nappy but unfortunately his parents aren't around to put it on him every day.It's just an incredibly underwhelming movie. You don't feel attached to the main characters, although the female lead does a better job than the male. But by the end of it, you end up despising the male lead so much you can't help but want him to get bitten because he's so damn useless!My recommendation is save your time for something else. It's just not an interesting watch at all."}, {"id": 274, "text": "I must survive.I had nothing but words of praise for the movie The night eats the World or La Nuit a dévoré le monde. A quirky film about a Parisian who suddenly wakes up in a Paris occupied by zombies. #Alive (original title #Saraitda) is the South Korean version. The only difference is that the zombies are portrayed more explicitly here. About the French version, I said that non-zombie movie aficionados could watch it without worrying about leaving skid marks in their underwear every time such a hollow-eyed creature appears around the corner. This rule does not apply to #Alive.When Oh Joon-woo (Ah-In Yoo) wakes up early in the morning and crawls behind his PC to continue gaming, he doesn't realize that the day will turn out very differently than usual. Soon, alarming news reports are broadcasted about a strange disease that is spreading rapidly, causing people to become enraged and attacking fellow citizens with bloodshot eyes. When Joon-woo looks out the window of the apartment, he witnesses this bizarre phenomenon. The young gamer is smart enough not to rush out of the apartment in a panic. Instead, he barricades the front door, makes an inventory of what's left to eat, and tries to make contact with the outside world. It's not really a surprise that this isn't so easy to do.The largest part of the film takes place in the apartment, just like in La Nuit a dévoré le monde. You witness how someone has to deal with a life-threatening situation and how they desperately look for a way to escape this situation. Of course, he's faced with the inevitable. After a while, he is confronted with a lack of food and liquor. The fact that there's a fully loaded drinks cabinet with liters of spirits can provide short entertainment. But really quenching thirst with it isn't really recommended. Missing his family and the corresponding loneliness are also starting to weigh heavily. Contact with the outside world is not possible. And keeping a video diary only helps partially.Time to introduce the next protagonist. Namely the young girl Kim Yoo-bin (Shin-Hye Park) who lives in an apartment right across that from Oh Joon-woo. What follows is a primitive interaction between the two individuals using technical aids such as tablets and a drone. Both have the same goal in mind and that's surviving. Not that people who have a similar situation in other zombie films don't have this goal. But instead of going out and trying to find their way through a zombie-plagued society, the two sit quietly in their hideaway and wait for the right time.#Alive is not very original and basically shows nothing new. The zombies themselves do look extremely creepy. There are times when things are getting tense. There are also some funny situations to be seen. Towards the end, they added a separate storyline. Some will find this disruptive. On the other hand, I thought it was a successful addition. It brought a bit of variation to the overall story. Maybe the denouement was a bit over-the-top. But overall I could agree with the general tone of this movie. Ultimately, we are now in a similar situation with the COVID pandemic. Of course, there aren't any zombies. But many people haven't left their homes for quite some time in the last six months to prevent worse. So, #Alive is more than a regular zombie movie if you look at it that way. Are you a fan of zombie flicks such as La Nuit a dévoré le Monde? Or to a greater extent also Zoo? Well, you should give this South Korean variant a try on Netflix. It's well worth it.More reviews here: movie-freak.be"}, {"id": 275, "text": "Director: Il Cho Writers: Il Cho (screenplay), Matt Naylor Stars: Ah-In Yoo ( Oh Joon-woo), Shin-Hye Park (Kim Yoo-bin) Oh Joon-woo wakes up one morning when his parents and sister already have left the house and have left nothing for him to eat. Outside something strange is going on, people are shouting, running, screaming and attacking each other. A viral outbreak has taken place, turning the people into violent cannibals, aka zombies, who spread the virus at a rapid speed. Now Joon-woo is all by himself and has to survive a zombie apocalypse. But across the street in an other apartment building he gets noticed by Kim Yoo-bin. Together they try to reach each other and hope for the best.When Yoo-bin came to the scene, the film got a new pulse. She's a great brave character, that overcomes her fears and is smart and more up to survival than Joon-woo. She gives him a reason to live, but it must have been the same for her. It maybe doesn't bring anything new to the genre, or gives the zombies a center stage, this film is certainly up to date and shows that survival is better when you do it together.#Alive brings thrills, drama, zombies and two people together in a tale of loneliness and hope."}, {"id": 276, "text": "After the disappointing Peninsula, I stumbled upon another Korean Zombie movie. #Alive has a simple premise in that Oh Joon-woo (Yoo Ah-in) a gamer is left isolated in his families apartment when an infection leaves an entire city filled with zombies. The zombie genre is very over saturated so does this movie stand out or is just part of the horde of mediocre zombie movies.I got to praise the pacing of this movie because it gets straight into the action within the first 3 minutes. It doesn't delay with an exposition or massive setup. It knows what you're watching it for and by doing this it successfully keeps the audience engaged the moment the movie begins. For the most part, the movie maintains this pacing but it does slow at a couple of points. However, it never slows down for too long and manages to always add some new element of danger to keep the characters on their toes. The zombie action, on the whole, is generally fun to watch. They are not groundbreaking or visually insane like Train to Busan but they are generally fun looking scenes.I also like some of the ideas director Cho Il-hyung implements in this movie to make it stand out a bit. Firstly, the movie focuses primarily on one person Oh Joon-woo (Yoo Ah-in). Most zombie movies usually focus on a group of survivors with some dying but by focusing on one person it makes it easy for the audience to relate more with him and understand his loneliness. Eventually, the movie does introduce a second survivor Kim Yoo-bin (Park Shin-hye) but this adds to the theme of loneliness in this movie. Furthermore, I also enjoy that the director considered the modern setting by having wifi, social media and even modern technology like drones in the movie. It makes it feel more believable and adds some new elements into the zombie genre. The actors Yoo Ah-in and Park Shin-hye do a phenomenal job in giving emotive and convincing performances. They really sell on the desperation these characters go through.However, I do have some gripes with this movie and the first being the lack of characterisation. We the audience get some suggestions at who Oh Joon-woo is such as being a gamer but apart from that he isn't very interesting. The movie does a fairly good job at making us care for him because of his situation but it doesn't do a good job at making us really like him that much. He is very bland and generic which is probably intented to make the audience easily put themselves into his position. However, he makes a lot of really dumb decisions at time which I definitely wouldn't have done. On the other hand, Kim Yoo-bin has no characterisation whatsoever. I know almost nothing about her and they never really go into depth about who she was before the apocalypse. It baffles me why the main character never asks her about this but whatever.The third act of this movie also embodies all the cliches from a lot of zombie movies and is extremely generic which is a bit disappointing compared to the first two acts. To their credit the ending is still satisfying despite being cliche. The story is also incredibly predictable and there also very predictable jump scares as well (although the jump scares are very few).Overall, it's an all right zombie movie. It isn't groundbreaking but what it does, it does very well. It tackles the zombie genre with a clear theme of loneliness and it explores this theme well. Additionally, I also appreciate that the zombie apocalypse isn't on a country scale as a lot of zombie movies do this and seeing a more competent government is quite refreshing. This also plays a part into the theme as well. I came into this movie to have an enjoyable time and this movie most definitely succeed in that."}, {"id": 277, "text": "#Alive or #Saraitda is a thrilling and engaging zombie movie that manages to stand out from the crowded field thanks to its creative use of a largely singular location and some effective commentary on our incrasingly technology reliant world. The movie follows Jun-u a gaming livestreamer who finds himself trapped in his apartment after a zombie outbreak leaves him isolated with little supplies and even less hope of rescue, the stress of isolation, hunger, and despair becomes too much to bear but once neighbor Yoo-bin makes contact after her own ordeal Jun-u he becomes determined to survive.The movie charges right out of the gate and doesn't let up until the very end. For the first half-hour or so this is very much a one man show as we see Jun-u trying his best to keep his spirits up even as he's under constant assault from rampaging hordes snarling in streets and running rampant through the apartment complex. The movie does a great job at building upon its elements in a way that keeps the story feeling like its moving forward and also keeping the audience engaged. Once Jun-u meets Yoo-Bin we have some very clever usage of the added location her apartment with Jun-u's including a humorous scene of them eating dinner together via walkie-talkie that provides some welcome levity that doesn't completely destroy the tone. Technology and its presence in our lives is a recurring theme throughout the film from Jun-u's status as a live streamer to his usage of drones, smart phones, selfie sticks, laptops, and TVs to try to keep informed and sane throughout the chaotic proceedings, but it never feels overly ham-handed like various other movies that try to tackle the subject. In a way #Alive's approach is not too dissimilar from George Romero's take on consumer culture he satirized in the 1970s Dawn of the Dead that while funny managed to integrate well with the horror never feeling too jarring.#Alive is a welcome addition to the zombie sub-genre of horror and a must see for any zombie fan. It's an intense ride from start to finish and thanks to a brisk runtime that makes efficient use of itself there's never a point where the audience becomes antsy or checks the remaining time. Highly recommended"}, {"id": 278, "text": "This movie must be a comedy right? I'm so tired of watching these zombie movies of late where the characters are complete idiots. That's all they seem to be now. I miss the days in Romero films where the male leads were actually men, resourceful and smart. The protagonist in this film is a complete idiot and gives into his emotions CONSTANTLY! Why would you even think of getting drunk during a zombie apocalypse? The stupid actions of the guy made this very hard to finish because I kept complaining to myself about how stupid his actions are. I don't want to watch a zombie movie to complain about the actions of the characters.Many of these stupid actions just feel forced to make something happen or to try and give an emotion response. But it feels SO forced it didn't make me feel anything.This is the third Korean film I've watched on Netflix. I haven't liked any of them. I'm lead to believe Korea doesn't make good films. Least that's what Netflix has shown me."}, {"id": 279, "text": "First of all, this movie isn't doing anything that hasn't been seen and done better in other movies of the genre.I think the main character is a moron because he constantly makes terrible decisions. In addition in all aspects he's presented as less competent than the girl right up to the point when the plot decides she needs help.Also the MC is presented as a gamer while being completely oblivious to what happens and what this kind of scenario entails. Please don't try to present gamers in current year as ignorant when it comes down to zombie apocalypse or survival scenarios. I'm absolutely sure that any decent gamer (especially those that are somewhat doing this professionally as streamers) can easily come up with various ideas on how to survive in this kind of situation.Also the spreading was way to fast here. Apparently 99% of the local population in this town don't know how to use doors or their cars properly.Oh and I had to laugh pretty hard in one scene where explosions are shown in the city while apparently over a week into the outbreak there is heavy car traffic still going on in the city. Can't be that bad then...especially when the movie claims that it's just 50.000 infected in a from what I could see major urban area.Also for the movie makers, please learn how smartphones and networks work."}, {"id": 280, "text": "Zombies are supposed to be the living dead, but zombies have been so abused and misused that the fad is gone. Zombies are dead so stop beating them.This Korean zombie movie is no different than any other movie ever produced. It is a guy locked up in his apartment playing online games to find out through the news that a dust cloud has come in to the city and is causing people to turn in to zombies.So if it is a dust cloud, why are so few people getting infected when they are running through the streets? you would expect 99% of the population to become infected instantly. And why do people think that humans are some sort of awesome predator with out weapons? We don't have claws, we don't have sharp teeth. Have you ever tried to eat a raw steak? It's nearly impossible unless you cut it up in to very tiny pieces to make it easier to chew.Zombies are worthless and these movies are boring. Please stop making them."}, {"id": 281, "text": "#Alive takes an atypical approach on a post apocalyptic world. Fixated entirely on the survival aspect of few rather than going full on mayhem with swarm of undead! Albeit lacking in several segments, on the whole it more or less pulled off an appeasing outcome.Without going into much details about how and why, it zeroed in on the aspect of deep-rooted human instinct as survivalists. It deals with lonesomeness, desolation. Tests our moral compass in dire consequences through inconspicuous ways. It also sheds some light on the positive impacts of technological advancements and its useful application for the people in need. The interpretation here goes much deeper if you can perceive its pertinence.Technically it was a powerhouse. The Cinematography endowed by atmospheric awareness, fastidious Sound work and apparent attention to details; collectively manage to create an unnerving ambience. Performances too helping them in that regard. Ah-In Yoo &amp; Park Shin-Hye; both of them being credible in their respective acts.Storywise, as I stated earlier; they had taken quite an aberrant route. The plot heavily invests in adrenaline pumping moments &amp; genuinely scary situations. With a modest presence of emotions and humour underneath which worked fractionally to be brutally honest. It loses a chunk of momentum in the second act due to a rather unsuccessful attempt at getting too dramatic. However, in the third act; it regains its predominant pace and concludes itself in triumphant fashion. A sigh of relief at last."}, {"id": 282, "text": "It's difficult to watch this film as anything other than an observation on social isolation in a technology dependent world during Korea's response to the coronavirus.What I likes about this film was how well it used a limited visual pallet. I get the feeling it was made quickly and shot mostly in a small studio. With the window blocked out day, night and time becomes irrelevant.There's virtually no dialogue for the first 50 minutes and the characters become increasingly isolated physically, socially and also electronically. Technologically dependent, the main characters are forced to improvise as society collapses around them.It's a clever bit of film making until the very end which is beyond cheesy and really lets this film down.Well worth a watch apart from the ending."}, {"id": 283, "text": "The plotline revolves around a video game live streamer's struggle for survival as he is forced to stay alone at his apartment during a zombie apocalypse. I thoroughly enjoyed this film, it's very entertaining, it's like Train to Busan but in a room. I think we can all relate to the idea that the main character was stucked in his apartment, in his case it was zombie apocalypse but in ours was Covid-19. Due to that reason, I feel some kinda connectivity to the characters' struggle through out the film. Someone mentioned that it was dumb that the character broke his TV and all but it actually make sense, it's called cabin fever, when you're confined in a place for an extended amount of time, you start to feel restless and annoying at almost everything, you'll want to break anything. The characters, nevertheless, made some awful choices throughout the film, but without those mistakes how else is the plot going to move forward? I think it's pretty common in most zombie movies or survival movies in whole for characters to make dumb choices in favor of the plot. The film became more engaging when a girl living in the opposite apartment saved our protagonist from commiting suicide, they developed a tender relationship and together, they continue to make awful decisions until they were saved at the end in some kinda Deus ex machina style. They were saved at the end but who's gonna save us.......from Covid? All in all, the acting was good, the cinematography was beautiful, the splashy colors were a lot of fun, and the score was very fitting. Definitely worth a watch."}, {"id": 284, "text": "In this genre, the zombie genre that is, Alive (or Saraitda) deserves a good score on here. I wouldn't pay too much attention to the negative reviews if you like well made zombie flicks. Neither would I pay too much attention to the reviews stating it's a remake of a French movie as it doesn't matter. What matters is that it is entertaining and that you enjoy it. I thought the make-up artists did a very good job with their scary looking zombies. Other reviewers state that Train To Busan (or Busanhaeng from 2016) was better but here again it doesn't matter to compare it. It's a different story, even though it's also a zombie movie. To be honest I liked both of them equally. In Alive you basically only have two characters to follow but both did a great job playing their character. Ah-In Yoo and Shin-Hye Park were very convincing in their roles and that's a bonus as with Asian movies it's not always the case. Korean movies are by far the best from what comes from that part of the world. Koreans know how to make quality movies, rarely the typical overacting like in other Asian countries. So in short, if you're a fan of Korean movies and have a weak spot for the zombie genre then I would give Alive a shot, you won't be disappointed."}, {"id": 285, "text": "It starts off very quickly introducing our character and getting straight into news of a zombie outbreak. From then on our character is in lockdown in his house basically trying to stay alive and doing video diaries he posts online about his journey to persevere. Along the way as you'd expect he comes across issues with his mental health living in fear of zombie attacks, having to worry about food and water, and also as an important part of the film with his loneliness (although probably unintentional, it has pretty interesting parallels with Covid). The way it oscillates from hope to despair and back is also very effective in propelling the story and creating a pacing that doesn't bore you. All of this sounds sort of heavy handed but the film manages to address all this without being brooding. What helps is the acting of the main character who is very dynamic and lively. He has the archetype of the lovable bonehead and he portrays it really well. The other main character also has very good chemistry with the main character and acts sort of as a foil to him.The music and visuals are also absolutely excellent. Everything is really crisp, the colors pop, and the retro synth music does really well in making everything stylish while simultaneously being tense.Really an awesome movie that flies by pretty fast. Highly recommend."}, {"id": 286, "text": "#Alive starts out like a combination of 28 Days Later and The Martian, as we follow a young gamer who tries to survive a modern zombie apocalypse in his apartment.In less than a month he's already on the brink of suicide, until he realizes there is another survivor living in the apartment across from his.The work out a way to trade food and water, and communicate, back and forth...and eventually plan to make a break for the 8th floor of his apartment building which seems to be clear.This is when the real action kicks in.Against all odds, they manage to make it...only to discover a whole other kind of monster is lurking in the shadows.Despite this, they learn that a rescue operation is in effect...so if they can just manage to survive as a team...there's a good chance they will be rescued.It will only take risking everything.I didn't manage to get super into this. It takes a little bit of patience to get into things.But the most action packed parts are pretty entertaining.The zombies are quite able in this film, so that leads to some unexpected circumstances.But in the end, it's really just about finding love in the apocalypse.5 out of 10."}, {"id": 287, "text": "For the most part, '#Alive (2020)' is a fairly standard zombie movie. One of its more unique aspects is the fact that it mostly takes place inside a single apartment, seeing our protagonist struggle with low-supplies whilst in terrified isolation. In some ways, the picture is almost an allegory for the 'worst case scenario' that many envision when they think of COVID-19, an anxiety that was especially prevalent prior to any proper governmental guidelines (which is around the time the film must've gone into production). This subtext isn't exactly overt, though; the affair can be enjoyed as a straight genre piece. The experience feels more 'street level' than a lot of similar fare and, aside from one or two strained plot-points, it plays out in a relatively 'realistic' sort of way. It has a handful of exciting and suspenseful sequences, but it isn't exactly scary (to the point that scares don't even seem to have been all that important to the filmmakers) and it has a couple of problems with tone. It's also somewhat dull at times. However, most sagging sections are rather quickly interrupted with something more interesting. Ultimately, it's diverting enough to be worth a watch if you're a fan of its genre. 6/10"}, {"id": 288, "text": "460. # Alive. Is this the first covid-19 inspired horror movie? Felt like it... So Joon-woo wakes up to find his apartment empty and a note from mom saying they'd be out for awhile and he should go food shopping, he goes and plays video games instead. Should have listened to mommy. A neighbor starts pounding on his door begging for help, Joon-woo lets him in, and this dude fills him in on what's happening outside: a virus outbreak that is making the infected act like, hmmm, what's the word? Zombies, that's it! And then this neighbor starts to exhibit signs of infection so he gets booted out and eaten by the hordes of walking dead outside his door, no one apparently got the memo to stay at home and lock your doors...which was actually on the TV news...but everyone just ignored it. With the little food he's got left he has to survive who knows how long. And long it is days pass with no help, and just about when he's about to hang it up, he's contacted by another survivor in the next apartment building over, which brings hope to our guy, and luckily for him she's a cutie, Yoo-bin. The two get a plan together to well get together, and when I say the two, I mean Yoo-bin, concocts a plan and executes it, she's kind of a Kevin McCallister over there. And now that they are together, they're plan to get to the roof to signal they're alive in there to the passing military helicopters. All that's standing in the way: a few hundred neighbors that are slightly infected and cannibalistic... It's a fun zombie flick, doesn't really bring anything new to the genre, but it's still fun, especially if you like zombie movies. Filmbufftim on FB."}, {"id": 289, "text": "In the middle of the city, a man witnesses a zombie pandemic carrying on in the streets around him and barricades himself in his apartment to get away from the ravenous beings, but the more he stays isolated by himself the more he feels the need to survive the zombie pandemic.For the most part, this was a rather enjoyable and entertaining effort. Among the more enjoyable aspects of this one is the immediacy of the film to drop us into the zombie apocalypse. The pre-credits sequence showing how he gets isolated with the TV news reports and live-action scenes showing the creatures overrunning the area grabbing and biting everyone they come across gets us into the film exceptionally quickly. That the ferocity and intensity of their actions are given rather early on makes for a much more thrilling and intimidating threat through these impressive sequences is fun with the way it sets the film going. Moreover, this early build-up causes the film plenty to like when it comes to the attempts at out-maneuvering the creatures later on. With either the shots of survivors getting overwhelmed as he can't help them in time or the various encounters that emerge later on when both he and the neighbor across the street are forced to deal with the creatures trying to get into their apartments, the second half here picks up on the action nicely which sets up the fantastic finale. Featuring their escape into the complex and dash to get away before the final series of battles to get out of the apartment. Combined with the stellar zombie make-up and effects, these are the film's positives. This one does have some flaws with it. One of the biggest issues is the fact that so much of the film seems to consist of useless padding to beef up a running time that still goes on way too long. The idea of what he does by himself while he's alone isn't that interesting, from struggling to get a signal for his devices, record videos for an internet channel that doesn't exist anymore or acting as an excitable idiot around the girl which don't bring anything new or interesting to these type of scenes. These are commonly utilized in these kinds of films, building up plenty of cliches and suspected moments that highlight how utterly stupid the character is. The other flaw to be had here is the film's highly problematic final half which is quite chaotic and meandering. There's little need to introduce yet a third survivor into the mix simply to pull out a series of random twists with the character to then to just dismiss it all with a resolution that alerts the creatures to them and making their escape all the more difficult because it has to keep up the inclusion of this completely doesn't need to be there and could've been taken out completely to shave off time and the typically overdone and useless Korean melodrama. These are what hold this one back somewhat.Rated Unrated/R: Graphic Language and Violence."}, {"id": 290, "text": "This was quite the pleasant surprise.I started this on Netflix expecting just another crappy horror flick that Netflix is littered with. What I got was a genuinely scary, unique, tense, suspenseful and well acted zombie chiller that, yes, reminded me a lot of the amazing 'Train to Busan'.One morning a young gamer wakes up alone in his high rise apartment to find that the city has descended into chaos as a zombie outbreak has overrun his neighborhood and apartment building.As he slowly learns what's happening, all he can do is barricade himself inside and try to survive anyway that he can. But he's not as alone as he thinks, across the way in another building a young girl is also trapped in her apartment and the two form a long distance friendship amid the screaming hoardes of the undead who roam the streets and hallways of their buildings.I'm quite taken aback by the negative reviews here! This was a solid film, the young leads are extremely likable and endearing, you find yourself rooting for them and waiting with baited breath as they fight to survive numerous close calls with the undead.If you're a fan of zombie films you owe it to yourself to check this out."}, {"id": 291, "text": "#MovieReview #Alive #SouthKorean #Netflix #Horror #SpoilerFreeAlthough it doesn't live up to the 92% fresh rating it has on Rotten Tomatoes, #Alive is an adequately engaging watch with enough ingenuity in storytelling to keep you guessing.Yoo Ah-in's portrayal of the male lead, trapped inside his apartment during a Zombie takeover is sufficiently nuanced in parts but goes overboard on a few occasions. Park Shin-hye who plays the female lead steals the show within her limited screen time, offering a more controlled performance.It is the zombies however that are the saving grace. Director Il Cho has used sound design and a ingenious camera angles to infused terror with even mundane things like a knock on the door.A one-time watch that will give you some brainless (pun-intended) thrills. Recommended."}, {"id": 292, "text": "I was really looking forward to seeing this movie especially after watching the awesome Korean Zombie movie (Train to Busan) which is arguably one of the best zombie movies to be released in the past few years.#Alive is very similar to another Netflix Zombie movie. The French made Zombie movie (The Night Eats The World) in which both movies follow the same storyline. A man wakes up in an apartment complex which is overrun by Zombies. He looks over his balcony and finds the streets overflowing with Zombies so he does the only thing he can do get comfy in his apartment and try to survive on what limited resources he can find as he slowly goes crazy thinking he's now alone in the world.I personally enjoyed (The Night Eats The World) it's a very unique and interesting Zombie movie that had a lot of new ideas. #Alive while still a decent and entertaining movie just isn't as good as the trailer suggests and after having seen (The Night Eats The World) just a few months before watching this movie it just ruined it's surprise a little.I enjoyed #Alive makeup effects and overall visual style which make it a beautiful movie to watch especially if you enjoy zombie movies with high levels of blood, gore and injury detail.#Alive is definitely worth watching and since it's already on Netflix it's easy to find and watch just don't expect it to be as good as (Train to Busan) because you might feel let down by it."}, {"id": 293, "text": "I really loved the zombie genre when it came to movies. Night of the Living Dead and Return of the Living Dead are classics that get better with time. There were many movies made during that era that used practical effects that added to the cheese factor that made the movies fun to watch. The era of CGI turned the zombie genre into ultra violent and bloody shows with the gross out factor increased 10 fold. The Walking Dead was a great show....for the first season and a half. I never would have thought dismemberment and cannibalism would become cliche and boring to watch, but it did! There has been so many zombie shows and movies that have been released that all have the same stories and effects, nothing is clever or shocking anymore. I was browsing Netflix and came across #Alive. I decided to watch it out because it was released in 2020 and I was curious to see if anything at all was going to be different. Quick answer: Not a single thing was fresh. CGI zombies abound, no explanation of why zombies were everywhere, the fight for survival in a apocalyptic setting, and the ending were just like all the other zombie crap being put out for the past 10 years or so. If you skip this movie, you will not miss a thing. Do yourself a favor and watch the following: Night of the Living Dead Return of the Living Dead Dead Alive ReanimatorThese are the only movies you need to watch for your zombie fix."}], "reviews_amount": 294}