{"name": "Freaky", "titleId": "tt10919380", "reviews": [{"id": 0, "text": "This movie surprised me. I watched this at the Sitges Film Festival, expecting to see just another slasher, but this is something else. The comedy is just right, the violence is too good, and Vince Vaughn just kills it, quite literally. Overall, a great flick to have some laughs and to watch some great gore scenes."}, {"id": 1, "text": "Vince Vaughn's acting is top notch. His pancy way of running around n his girly act is what made this film entertaining. The film starts off with a bang, lots of brutal killings n then maintains the entertaining value cos of Vaughn's top notch acting. The film has good humor n moves at a decent pace. The professor with the handle bar moustache looks like Edward Norton."}, {"id": 2, "text": "This movie was a blast. It's not an academy award winning film lol. It's exactly what I was looking for, a fun Friday night. It made me laugh, had some gory kills, and the acting was good. I never understand the whole it's not original argument. Give me a break. It's a good movie."}, {"id": 3, "text": "I loved it. Vince knocks it out of the park as a teenage girl and all the characters really pulled off their scripts. The point of movies is to entertain and I was so entertained during this film. The issue is you can't take this movie seriously. It is not meant to be a realistic slasher. It's just an entertaining fun teenage horror comedy and a damn good one! Not to forget, the very talented, very beautiful and very great Kathryn Newton who made a great serial killer Barbie. Top work from her and her co stars!"}, {"id": 4, "text": "Was I the only one that found this stupid and unoriginal. I went in hyped about this movie but sadly is disappointed. That's all I gotta say."}, {"id": 5, "text": "Vince is brilliant, and so are the majority of the cast, but the script/story is pretty poorly done."}, {"id": 6, "text": "I didn't pay to watch this movie....and i still want my money back. Vince Vaughn is going to get made fun off by his peers for years for doing this film. I understand that it's 2020 and he may need the work....but come on ! Just take a year off and enjoy yer money man. Don't ruin your career by taking gigs like this. Absolutely cheesy and stupid movie. (IMO)"}, {"id": 7, "text": "I was hyped for this movie but to be honest it's pretty bad. The acting is terrible. None of the main characters have any charisma to carry the film."}, {"id": 8, "text": "Another movie where the trailer is better than the movie. It's predictable and disappointingly so. Incredibly there are reviews here giving a 9. Don't waste 1 hour and 42 minutes. Watch TV instead."}, {"id": 9, "text": "Just another boring movie. The actors tried, but it's the writing (and showrunning to a lesser extent) that really makes or breaks a show."}, {"id": 10, "text": "Not even going crazy from stay at home orders during the pandemic can justify watching this crap. It was so bad I'm going to lie to my provider and tell them the rental didn't work so I can have my money back."}, {"id": 11, "text": "I was looking forward to this movie and am so disappointed that Blumhouse lets me down again. Do they even read the scripts anymore before agreeing to turn them into movies?It's all so very clichéd and not even in a fun or ironic way. Everyone is cruel to her for no apparent reason, there's the typical gay friend, etc. The actors aren't believable in their roles, it's a such a cringefest. And worst of all, it's not even funny when it's supposed to be. Nor does it feel like a horror movie. And there is so much dumb stuff going on it's also annoying.At least the effects aren't too shabby which is why I haven't rated it any lower."}, {"id": 12, "text": "I thought Vince Vaughn's perfromance was incredible! Another BlumHouse movie that turned out to be creepy and funny. Its like Jason Voorhees meets Rob's Schneiders Hot Chick. It makes fun of Friday the 13th alot and other films because of it's wierd, corny killings."}, {"id": 13, "text": "I expected more comedy from this movie Was a very boring movie"}, {"id": 14, "text": "A teenage girl is stabbed by a serial killer with a magical knife he stole from one of his previous victims and their souls switch bodies and they have only 24 hours to get back into their original bodies before they're stuck that way forever.Freaky takes a little while to warm up, but once it does, it's off to the races. Vince Vaughn has never been funnier and Kathryn Newton makes for a very likable heroine and also manages to pull off the sociopathic serial killer stuff once she's switched bodies. It's well paced with just enough laughs, gore, and even heartfelt moments to make for a memorable ride."}, {"id": 15, "text": "Believe it or not, i sense that plot is what i think it was and it did like i expected. some laughs here and there. typical slasher , a popcorn generic."}, {"id": 16, "text": "A good watch with the right company. The movie though had no story. Same suspense throughout the runtime, predictable. Has so much potential to be a cult classic, unfortunately they failed to identify that. A great date night!"}, {"id": 17, "text": "This movie is exactly what you expect it is going to be and it was fun from the start to the end. Actors are quite good, it is funny and gory with some emotional scenes thrown every now and then. Gotta give it to the lead actors, they did a great job. Storyline is straightforward, but the cinematography, acting and script keeps you hooked to the screen. I would add that this movie is quite bold in a good way, and challenges some norms but I loved it. I wouldn't be surprised if it was trashed by conservatives.In summary it is a must watch."}, {"id": 18, "text": "I wasn't expecting much, but surprisingly enough, we all laughed and enjoyed this. Vince Vaughn was his usual amazing self, and Kathryn Newton was excellent in her 180-turn characters. The writing was awesome with some great LOL moments. The directing, sound and score were also on point. The 102 runtime felt a little long for the story, even though the pacing was decent. Nevertheless, entertaining and fun."}, {"id": 19, "text": "Borrowing generously from several genres and altogether wholly unoriginal as a result, this teen slasheresque horror gore body swap flick delivers and entertains due to two excellent performances provided by Vince Vaughn and Kathryn Newton. If you need an easy going blood splattered, daft, silly and demented pantomime to while away the time - this might just fit the bill."}, {"id": 20, "text": "Sure it might be cheesy and a little cliche, but there's a good mix of gore, laughter and jump scares.The movie is well paced, well acted and has interesting characters.If you enjoyed Happy Death Day, you'll likely enjoy this one too"}, {"id": 21, "text": "First, Freaky is not the most original slasher film. It's not risky and it does not add anything you have watched before. The storyline is OK, acting is Ok and deaths are Ok. Probably the most original here is watching Vince Vaughn as a serial killer/girl. But, overall some of the sceneces/CGI are embarrassing. So, be ready. Could have been far better with a risky script instead a cheesy one."}, {"id": 22, "text": "Freaky is one film that you might call a horror comedy parody like film still even for all of it's fun and joy it's pretty good entertainment. The story is simple as a local serial killer is on the loose known as the Butcher(in a role that Vince Vaughn hams up) killing young girls. Only something strange and different happens when he tries young and popular high school student Millie(Kathryn Newton). A change happens it's like a body switch a transformation happens between the two. The film is filled with plenty of slapstick it's like horror comedy at it's best still the blood and gore is present making a viewer feel like they are watching a classic teen slasher flick. Overall not the best type of film to be made still it's fun and tasty entertainment to dine on with the horror and comedy mix making it the ideal party feast!"}, {"id": 23, "text": "The movie was bad and a waste of time. It didnot add anything new. Its wasnot funny at all. Kathrine newton's acting was so bad that I couldnot complete the movie till the end. I have no idea what happens in the last 20 mins and I dont need to cuz it's probably predictable and boring. I watched the trailer and I honestly was looking forward to watching the movie but how the trailer described kathrine's character wasnot at all what we saw in the movie. Maybe giving the movie a rating of 1 is exaggerating but I really hated he movie. It has a very bad writing. I mean by now u think characters will at least be a little smart to know what to do and what not to do in a freaky friday situation. Ohhh my GOD kathrine's acting was soooooo bad. It was literally the worst acting I have ever seen in my whole life. Maybe not the worst but it was so bad."}, {"id": 24, "text": "I wasn't expecting much &amp; usually avoid these types of comedic horror movies. But, it surprised me &amp; I liked it. Vince Vaughn did a great job acting like a teenage girl. It was a good mix of humor &amp; slasher movie. The cheese factor was a lot less than I thought it would be.....and for me, that was great. I'm glad I took a chance on this movie, it was worth it."}, {"id": 25, "text": "This movie is not good at all. It's basically a horror version of Freaky Friday the movie where daughter Lindsay Lohan switches places with the mother Jamie Lee Curtis. It's about as lame also."}, {"id": 26, "text": "I feel the movie was a big let down. There was so much potential as the premise was interesting (though not original). While the performances of the actors were good (Vince Vaughan, in particular), the story seemed rushed as more time was dedicated towards mindless action (last scene was unnecessary) rather than developing the characters by showcasing their struggles to adjust to their new bodies."}, {"id": 27, "text": "A serial killer steals an ancient magical dagger during one of his murder sprees and plunges it into the wrong teenage girl, causing them to switch bodies and it's up to her to convince her friends that she's now in the body of a man and that they have 24 hours to switch them back before they're trapped in each other's bodies forever.Freaky might go more for the goofy than the truly funny at times, but there's an infectious sense of fun throughout and the performances are excellent across the board with Vine Vaughn and Kathryn Newton being given the most to work with and making the most of it. It's similar in tone to Christopher Landon's other horror comedies, so if you enjoy those, you're probably going to enjoy this one as well. If you didn't like this then this might not be for you, but there's an added bonus of this one being rated R which means it comes with a lot more gore than the Happy Death Day movies."}, {"id": 28, "text": "I stopped watching when I saw how badly acted it was 10 min. That cliché scene at breakfast with the bacon eating, who eats their mouth like that? Even the eating is badly acted. Not a good movie."}, {"id": 29, "text": "This movie made the greatest decision in being rated R. Lots of gory kills that just make it better, the acting is great from the two leads, and the supporting cast does a great job as well."}, {"id": 30, "text": "Great teen comedy horror. Vince Vaughn is hilarious. If you like Dale and Tucker you'll like this."}, {"id": 31, "text": "This was a fun watch. Vince Vaughn nailed the teen girl behavior and was hilarious....conversely, he also nailed the crazy killer vibe. Kathryn Newton was great as a serial killer trying to be a teen girl. This was well casted, and like I said....just a fun watch. Thumbs up!"}, {"id": 32, "text": "This is no Happy Death Day but the usual characters with millennials crap added to it. Only good thing its Very Violent and Vince Vaughn would make a perfect Jason Voorhees. Made for kids today. Should have been like the movie IT and kill everybody 😂."}, {"id": 33, "text": "Never a dull moment in this! A great mix of comedy and horror! To boot, the acting is spectacular. Vince Vaughn and Kathryn Newton are excellent in their reverse roles! The laughs are almost unending, and there is plenty of gore and tension as well! Definitely a fun watch that I would certainly watch again!"}, {"id": 34, "text": "Pretty great body swap movie- and a great combination of horror and typical high school/raunchy teen comedy. Vince Vaughn is hilarious and at times scary, depending on who he is at the time. The director, Christopher Landon has a real knack for this usually very difficult genre of horror comedy- he really is able to check all the important boxes for each genre without losing tempo. Highly recommended for those who enjoy the genre. One note- the death scenes are not for the squeamish. They are, at times absurd, but grounded, making them feel realistic. They are also very creative, graphic and at times, elaborate. So, you know, 'viewer discretion advise'..."}, {"id": 35, "text": "After a long hiatus from seeing new movies in theaters due to Covid, this wasn't a bad movie to see. I thought it was fun to see a horror movie that was also fun and pretty clever. I also like body switching movies so that was cool as well. I would recommend."}, {"id": 36, "text": "Freaky (Friday), horror for teens with woke undertones. The best the movie has to offer: 1) gay dude coming out to his mom as straight. 2) mother unknowingly hitting on her daughter.yous are welcome. A grown man acting girly isnt exactly the apex of comedy"}, {"id": 37, "text": "A comedy horror, ha? Neither comedy nor horror and definitely a horrible movie! Such a waste of time. Very poor redundant plot, dull performances and a cliché."}, {"id": 38, "text": "Freaky is by far, one of the most entertaining slasher films of the 21st century. The plot is very simple, and has been done in many films, but to have the body swap premise in a horror film keeps things very interesting. Unlike most body swap films, the acting is very consistent between the two actors. Vince Vaughn is hysterical as a shy teen girl, and Katherine Newton was very convincing as a crazed killer, she definitely had the more impressive performance out of the two. The movie delivers a pretty good amount of humor and the kills are nice and gory. For fans of the genre, Freaky is definitely a refreshing and enjoyable film."}, {"id": 39, "text": "The guy who directed Happy Death Day directed this pile of cringe? Wow. Guess it was just a fluke."}, {"id": 40, "text": "I really enjoyed this film, it was a fun watch and much better than I expected. Kathryn &amp; especially Vince did amazing jobs!"}, {"id": 41, "text": "There's alot to say about this film. I just want to start by saying Vince Vaughn was great cannot fault him he can go from acting like a teenage girl to a psychopathic killer in seconds and that was great. What wasn't great was the rest of this film.The dialogue was probably the biggest issue, they crammed the script with so much un-needed swearing ( don't get me wrong i don't mind a film with swear words but that's only when it fits) in this film the swearing does NOT fit AT ALL. There were multiple scenes that gave off lots of unnecessary rape energy and by teenage characters too nonetheless.My other biggest issue is the forced character development. There are parts of the film where it's high tension then it's all of a sudden slowed down to fit in a stupid scene where Millie talks to her mum about her father's death in the killers body so the mum doesn't know it's Millie. Or the scene where Vince Vaughn literally kisses a teenage boy.The other problem is the obvious Cliches in this movie too, the main character has a dead parent, she can't move on, her other parent is just as absent, there's a teenage Boy crush and he's a jock but she's a dork and you wouldn't guess he likes her too.This is only a little of what is on offer in this bad bad film and I don't even mention how unlikeable all the characters are and their forced actions to move the story along.The one good things about this film is the kills and Vince Vaughn that's pretty much it.I would not suggest this film."}, {"id": 42, "text": "Best horror comedy I've seen in a long time. Vince Vaughn playing a teenage girl in this Freaky Friday scenario was the best part of the movie. The kills are and inventive and full of gore. The beginning plays tribute to Friday the 13th as well as Halloween in the way Vince Vaughn kills and chases his prey. There seemed to be two endings to this movie and I thought the second was unnecessary. But over all it's a great mix of funny and scary which most movies like this seem to miss."}, {"id": 43, "text": "There was a bathroom scene that no girl needs to live through rated R or not. Was not a class act. Production value was good but a message short lived of reality. Vv is better than than this movie, basically sucks. So does covid."}, {"id": 44, "text": "I saw this movie in cinemas with my friends, and we all loved it. it has an interesting plot, interesting characters, great comedy, amazing gore, and a good ending. if i were to complain, i would have to complain a bit about the ending. the ending is good, but it feels like a last minute add-on. the ending makes me think that there was another ending for this movie, but they scrapped it last minute. Other then that, it's a great movie. perfect if you want somthing scare to watch."}, {"id": 45, "text": "The acting is strong and great. It's scary and funny. Definitely a award winning movie. You will enjoy it."}, {"id": 46, "text": "This is a really fun horror slasher! college grads hit by a michael myers wannabe , then body swaps with a girl! funny, brutal, little love twists, just an out and out fun movie! cheesy? yeah, but one to watch again , 10/10"}, {"id": 47, "text": "Such a funny concept, It's cheesy at times but has a true 1980 slasher feel to it, the music, all the call backs to; Friday the 13th, Sleepwalking Camp, Chucky, Scream. The movie is filled with great jokes and awesome Easter eggs. Even to his past film Happy Death Day where the character dons a blonde pony tail and red jacket. ABSOLUTELY will be buying this"}, {"id": 48, "text": "The movie brings fresh story with good entertainment and Halloween treat. It starts on tense note like any butcher movie and keeps you entertain with it's comic timings and storyline. A nice one to watch.A family movie in all."}, {"id": 49, "text": "Wow the big screen movies are back with Freaky a brilliant movie to see in cinemas. blumhouse did well with this, it nails the slasher genre and the comedy so well. horror comedy is hard genre to do but Freaky nails it! go watch this in theaters!"}, {"id": 50, "text": "This movie is everything a horror fan could also for. It has its meta moments, it's scary and Friday the 13th-esque, but also funny. And it's with the times but pays homage to classic horror movie antics. It's so fun. So well written and exudes many powerful moments. If you love Happy Death Day, you'll love this!"}, {"id": 51, "text": "It's nothing spectacular but it's definitely a ton of fun. Vince Vaughn is the star of the show, playing a teenage girl and hamming it up. He's great in this and a scene stealer.It's surface level with every character stereotype cranked up to 11, to the point of being caricatures; it's at times distracting but works in the context of this cheesy movie that doesn't take itself too seriously.Was hoping for a little more horror/murders but it keeps the movie light and comical instead of threatening and tense.This is a fun one to see with some friends and a bucket of popcorn."}, {"id": 52, "text": "I watched it a couple of days ago at the film festival and it was pretty good what the movie is about is a serial killer and a 17 year old girl switch bodies."}, {"id": 53, "text": "One word: cliche. Just like any other blumhouse films this days."}, {"id": 54, "text": "This movie was amazing holiday horror fun. Vince Vaughn doing a cheer dance? Check. Reciting a poem he left in a cute guy's locker? Check. Confessing his feelings for the cute guy on the football team? Check. What more could you want or expect? Also this is high budget special effects and all around production. 10/10"}, {"id": 55, "text": "Does crossing Friday the 13th with Freaky Friday work ? Yes, because the acting is so good by all involved, especially Vince Vaughn, who is a hoot here, and Kathryn Newton, who is very engaging. It's silly and there are just a few belly laughs, but it's fun to watch and Christopher Landon's direction is quite tight and fast paced. It's worth it but you probably won't be talking about it next week."}, {"id": 56, "text": "I wasn't expecting a whole lot but it really surprised me and was super fun. Vince is hilarious when he's playing Millie and the actress who plays the actual Millie is great when she's slicing and dicing students."}, {"id": 57, "text": "It was a nice movie with funny jokes. the movie has a few scary and bloody moments. it is a movie that gave you a good vibe after the end."}, {"id": 58, "text": "If Mean Girls and Scream had a baby, this movie would be it. It is the perfect blend of horror and comedy, just funny enough and not too serious. I mean it does have some very cliched predictable moments but dialogue is amusing enough. This would be a perfect movie for a Halloween sleepover party."}, {"id": 59, "text": "Just forget the nonsense, if a film promises and delivers - it is a good film. This film promises a good fun and a twist, you get them both, nothing else is important - you get what was promised. Vince Vaughn is hillarious, all the actors are good meaning that the director did his job the way he should, We were a group of friends, in our fourties, and we ALL enjoyed it. Very nice work."}, {"id": 60, "text": "This movie isn't winning any awards but it will entertain you the whole way. It's funny, well written and fun to watch. I really enjoyed it like Sean of the Dead or Zombieland"}, {"id": 61, "text": "Christopher Landon of Happy Death Day gives us the horror version of Freaky Friday in this clever genre mashup. Vince Vaughn in his best comedic role since Wedding Crashers plays a campy serial killer with a wooden mask and a bunch of weapons that likes to murder teens in increasingly goretastic ways. The movie is fun but and I mean this in the best way it feels like a Disney horror flick. It has a big heart and a bunch of comedy that mostly hits. Katherine Newton is okay in the lead. She's engaging when she's Millie but as the killer she's just not believable. That being said the film is filled with colorful characters, stylish cinematography and a sense of fun. It never quite reaches the potential it promises but it's a bloody good time nonetheless.****/5 Eric: 4.5/5"}, {"id": 62, "text": "Refreshing, smart, and entertaining. There are many smart lines and situations (Booker kissing Millie!!) in this movie, and it's cool to pass time. (but what an ugly killer mask tough..)"}, {"id": 63, "text": "Directing and acting is good, script and story not so much.."}, {"id": 64, "text": "The latest horror movie from Blumhouse is better than a lot of their previous movies, primarily due to Vince Vaughn who is better playing a teenage girl than most half his age. Some of the murders were fairly original and there was plenty of humour. A fun watch."}, {"id": 65, "text": "Hilarious and Gory! Saw it with friends and had a great time! We laughed a lot. It's got some iconic characters in it too."}, {"id": 66, "text": "The butcher (Vince Vaughn) swaps places with the final girl (Kathryn Newton). Milly is the mascot of the pun filled Blissful Beavers. In the killers body she must convince her friends of the swap, get the murder weapon out of the evidence locker, and stab her body (now that of the killer) in the shoulder, all within 24 hours or the change is permanent. The title is clearly homage to Freaky Friday.I liked the plot and the acting and it appears the actors had fun with the role reversals. I didn't like the ending of the home invasion. I though maybe Milly returning to school with some swagger and handling a knife like a killer leaving doubt would have been more fun.Guide: F-word. Brief sex. No nudity."}, {"id": 67, "text": "Aside from horror and gore spots, this movie was hilarious! Vince Vaughan did an excellent job portraying a girl, his actions and movements were spot on!"}, {"id": 68, "text": "10/10 - a worthy successor to Christopher Landon's Happy Death Day films, this new high concept horror is far gorier and more violent, but with the fun charm we have come to expect from Landon"}, {"id": 69, "text": "This movie doesn't take itself seriously, and that's what is so great about it. You shouldn't either. And still, Vince Vaughn never disappoints!"}, {"id": 70, "text": "This movie has some big plot holes and some super bizarre and absurd scenes as a result of the whole body switching gimmick. In my opinion, it would have been better without that aspect, as its a rather competent modern slasher flick on its own.Still, it's something different and the final girl is pretty likeable, along with the rest of its decent cast providing some comic relief. It's somewhat satirical of the genre, yet you never feel as though it doesn't take itself seriously, which I think it does. 6/10."}, {"id": 71, "text": "Freaky tells the story of a teenage girl who wakes up one morning to find her consciousness stuck inside the body of the man who tried to murder her the night before. She quickly realizes that this must mean that the killer's consciousness is in her body, and she spends the rest of the film trying to mitigate consequences and get her body back.On paper, this is a firecracker of an idea. It's simple, straightforward, but also creative and promising. It is Freaky Friday meets Friday the 13th, a fun but spooky body-swapping teen slasher film. And surely, when the credits roll, Freaky's finest accomplishment is that it does good service to this idea. Writers Christopher Landon and Michael Kennedy spend their 101 minutes with the concept leaving hardly any conceptual stone unturned, managing to wring humour, tension and heart from the story in all of the right ways, while always keeping good pace and never forgetting what kind of movie it is: a fun one.The trouble with Freaky, however, is that it's greatest strength is also it's weakness. In servicing it's central idea, this Freaky Friday the 13th, the film does manage to hit the right notes. But what notes are those? Well, they are the notes, the themes, the plot devices, the characters and the twists laid out by the film's inspirations. That is to say, in trying to be Freaky Friday and in trying to be Friday the 13th, Freaky more or less is those movies. It does an admirable job at mashing the two, but at the end of the day, it is never more than the sum of its parts. And so, as a viewer, you spend only so much of Freaky enjoying the idea before you realize that you have seen this movie before. You know where it goes. You know how it ends. The movie shies away from subverting expectations in any way, obviously frightened that it will veer to far from it's predecessors, but then it becomes it's predecessors.This quality becomes even more egregious as the film the progresses. Near the end of the film, when the clock is ticking and the stakes are high, the viewer never feels any real sense of threat because they have seen a slasher before. The killer always escapes their confines. The killer always appears to have the upper hand. The final girl always comes out on top. And then there are body-swapping movies. The protagonist always gets her body back. The protagonist always learns a heartfelt lesson. Things always workout. And Freaky never grows self-aware here, as it attempts to throw twists and turns into the final few minutes that cause the audience's eyes to glaze over. By this point, they has seen the film spend over an hour setting itself into a specific mold. They know that it's not going to veer from that, and it doesn't.And so, while I would recommend seeing Freaky with some friends, popping some popcorn, and enjoying the hijinks, never expect to be on the edge of your seat with Freaky. Enjoy it for what it is, and try to forget what it isn't."}, {"id": 72, "text": "Was entertaining enough, but not enough to keep a viewers feel attention, didn't know what sort of film it was ment to be, bit of a Heinz varieties.Watchable but nothing memorable.Now, if it was a full horror movie with no comedy, I think it would have worked, especially seeing more of Vince Vaughn as the evil guy.. didn't show enough of that, to me that would have been the highlight, Vince in his own body as the killer etc."}, {"id": 73, "text": "2020 was worst for horror genre , that's why I loved this movie , I loved the atmosphere of slasher classic , I loved the Easter Eggs and homages for classic horror like Halloween ( hadonfield = blissfield / Carrie white I /Michael myers kills/ Jason voorhees ) if u didn't see any homages how u call urself horror fan? Why u even writing negative reviews? Chris Landon his a creative guy I love his project and how he turn comedy films classic into horror comedy (happy death day /groundhog day + freaky Friday / freaky ) Can't wait for any projects comes from hand this guy ."}, {"id": 74, "text": "This movie had great humour all the way through. Well done with the casting and script!"}, {"id": 75, "text": "Freaky is a horror take on the body-swap subgenre of film that was everywhere in the late '80s and is now pretty much forgotten. It was much better than what I expected. I knew Vince Vaughn acting like a teenage girl would be worth the price of admission, but I didn't expect that Kathryn Newton as the girl - inhabited by Vaughn's serial killer - would also be brilliant.The movie is also consistently entertaining, with some decent kills, including somebody being cut down the middle, head first, by a bandsaw.I say check it out."}, {"id": 76, "text": "Really high expectations, cos it's the same production team as happy death day. The concept was fun, all actors were doing good but the plot was a bit lousy all the way, after switching bodies was supposed to be tense with limited time to crack the spell but instead nothing really happened, just chasing around with some random cops, even Vince Vaughn cant saved it, cant compare with the full of twists and humorous happy death day. It was not bad, easy 2 hours, it could have got one more star if they skipped the ending scene."}, {"id": 77, "text": "Vince Vaughn was hilarious playing a teen girl. It would be a horror to be a teen girl and be trapped in an old dudes body! Ha hahaha Overall, fun pop-corn movie with some blood and gore, but not overkill (no pun intended). More of a teen movie similar to The Babysitter (decent little flick). But much better than The Babysitter 2, which was horrible."}, {"id": 78, "text": "Freaky is the new slasher comedy starring Vince Vaughn who plays The Blissfield Butcher, the brutal killer terrorizing a town and who ends up swapping bodies with 17 year old high school student Millie, played by Kathryn Newton. It's sort of a slasher 'Cinderella' where the protagonist Millie has 24 hours to stab the butcher back with his own dagger, or else she stays The Blissfield Butcher forever!The story begins with Millie, the unpopular girl at her school organizing a boring evening with her mom instead of getting ready for the prom. That's what her sister thinks anyway, who plays the local deputy with her own struggles; such as distancing herself from the family since their father is no longer in the picture and their mother is an alcoholic.Millie's mother works at the local discount outlet in her town; and this is pretty much the fodder for the torment she receives from Ryler, the mean girl at school. Millie does however have a few friends at school, Nyla and Josh, who seem to be cooler than Millie and come to her defense against her tormenter.However, her friends can't save her all the time; especially from her mean shop teacher and being constantly humiliated on the football field while posing as the team's mascot. One night when Millie's mom has one too many drinks and forgets to pick up her daughter, Millie is stalked by the Blissfield Butcher, and ends up being stabbed with his dagger. Millie's sister comes and saves the day, but it's too late, as Millie transitions from geeky nerdy unpopular girl, to brutal and sexy serial killer seductress!Truthfully, I wasn't sure about seeing Freaky so quickly as I have a disdain for horror comedy. I find that sub genre to be almost a parody of itself; overly meta and self aware. I will give Freaky credit for knowing what it is from the beginning; with the advertising of the film gearing towards a female and gay male audience.As a slasher film, Freaky may even get some horror fans excited, with its somewhat shocking opening and the many references to the classic films that inspired it: such as Friday the 13th, Halloween and Candyman. But just like any horror slasher comedy, Freaky comes with its inherit flaws.Although individually, Millie and The Blissfield Butcher have their own personalities and qualities, this seems to be lost during the transition. Instead of acting shy and awkward, The Blissfield Butcher (as Millie) comes out swinging with a new wardrobe and hairstyle; as she slow-mo walks into school in a wonderful nod to the 80s film Heathers.This definitely treads into the geek to chic sub-genre; as now the football players want to date her, and even Ryler tries to befriend her, which... let's just say Millie gives her the cold shoulder. Besides some of the kills which are already given away in the trailers such as Ryler freezing to death and the shop teacher's run in with a buzzsaw, Millie does not get all Blissfield Butcher on our ass.The Blissfield Butcher, when portrayed by Vince Vaughn, seemed like an interesting, brutal, demented serial killer. Unfortunately, Millie is never really given a chance to become him in that way. The same goes for Vince Vaughn as Millie. When he becomes her, he is no longer awkward but conventional and ready to kiss boys.Freaky is not perfect, but at least somewhat takes itself seriously. The concept could be interesting if really approached with darker material. Sort of like if Chucky really did possess Andy, and then Andy started killing. Still, it says a lot when one of the more interesting moments of the film is a clip from The Real Housewives of New York City."}, {"id": 79, "text": "This would be a great replacemant for Netflix's The Babysitter, since the camerawork and the overall theme of this movie just suits their agenda for horror comedy more than their own inferior counterpart.What could one really expect from a horror comedy such as this one other than the fact to just have fun, and fun did it deliver. Acting is awesome, especially Vince, he mastered his roll, and props to Kathryn for playing two completely different roles. Good story, albeit its a combination of two other movies but fair enough. Great action and random jokes though."}, {"id": 80, "text": "As soon as Vince Vaughn becomes a teenage girl everything becomes better"}, {"id": 81, "text": "This movie has so many plot holes it's scary... in-fact it's the most scary thing about the whole film. I counted at least 12 plot holes in the entire film, and for most of the film I was rolling my eyes so I'm pretty damn certain that I missed at least a couple of plot holes. It's not a drama, it's not a thriller, it's not a horror and there isn't much action OR comedy at all... so I've got no idea what this movie is supposed to be, except 1hr30mins of mindless teenage pandering. The acting is OK for the most part, but that's the only redeeming factor in the entire film. It's a seriously mediocre film, and I can't bring myself to rate this any higher than 5.5/10. It doesn't deserve even a single viewing, unless you have literally nothing else to watch."}, {"id": 82, "text": "Let's be honest, Vince makes this movie worth watching. It's basically Freaky Friday and Friday the 13th had a kid, and called it, 'freaky'. It has its moments, is all I can say."}, {"id": 83, "text": "Coming off the equally fun Happy Death Day movies, Christopher Landon has begun to carve out an entertaining niche for himself in the horror/comedy genre. He's able to combine slasher thrills, gore, wacky comedy, and heartfelt moments better than anyone else can and he continues that tradition with Freaky. The script is funny, the pacing is quick, the gore effects are memorable, and the performances by Kathryn Newton and Vince Vaughn are some of the finest I've seen in either a horror or comedy film in a long time."}, {"id": 84, "text": "It's a surprisingly good new kind of comedy/horror film for everyone. Vince Vaughn and Kathryn Newton acting is on point, the story is very well developed despite having some flaws on it, that is what makes it perfect as any horror flick, it is as scary as halloween and as funny as happy death day. gave an extra star for the screenwriters who came up with this. i really hope for a sequel"}, {"id": 85, "text": "1) Absolutely brilliant acting by both the lead characters+ editing+directory 2) Very Different kind of horror + comedy 3) We can compare the main horror/thriller scenes with saw ( all parts) 4) One of the best movie in 2020( horror thriller comedy) 5) This movie also shows how stand on your own legs, without any support 6) Good story + moral 7) One of best combination of horror and comedy.. #freaky #mustwatch"}, {"id": 86, "text": "Don't be fooled by the IMDb rating, this movie is AMAZING !!, a good acting, maybe it could be better in some scenes, but still the movie is very good ... When I realized that the movie was Directed by Christopher Landon, the same person who directed the 2 Happy Death Day movies, I thought the movie would be very similar to Happy Death Day BUT NO !!, the director confirmed that These films take place in the same universe, but that does not mean that they are the same ... I recommend that you watch the movie, very interesting, entertaining and maybe some of you will find funny scenes, whatever ... you should see it !!BTW, I dont think is a 10, but I put 10, I like The movie, anyways"}, {"id": 87, "text": "This movie isn't perfect but damn sure is a fun watch. Went with a group of friends we all enjoyed it. The kills were intense, the script was clever and funny even if at times simple. I loved the little homages to other horror films. Definitely nice film especially for this Friday the 13th!"}, {"id": 88, "text": "This is mindless slasher fun. Was funny, some good deaths &amp; an awesome red jacket. Don't take this serious, its a bit ridiculous but a fun way to escape for an hour &amp; a half."}, {"id": 89, "text": "There doesn't seem to be all that many movies around these days, and anyway, this one sort of looked interesting, if the blurb was anything to go by (though I didn't bother watching the trailer). It seemed different, but a part of me was a little worried at the beginning when it seemed to basically be another slasher flick. Well, it is sort of, but after the intro, I realised that this may not be the case. I guess it has something to do with the way the film is set up.It opens with four friends having a get together and all of the sudden they are killed one by one. This is why I was a little worried, though when I think about it, slasher flicks don't tend to open this way (though since I haven't watched many of them, namely because I don't like them, I can't say that I'm an expert). Anyway, it then cuts to this high-school girl who happens to be quite daggy, and hangs around with a couple of friends who are also quite daggy. We then follow her through a typical day and learn of the people that she has problems with.This sort of gave me the idea of who was actually going to die in the film, because yeah, it happens to be one of those films. Slasher flicks tend to have them killed one by one, however in this one we have three friends who are sort of outcasts, and when we are introduced to the bullies, we suddenly get an idea of where it is going. Oh, and they also have the bodyswap scene, which is the main motivator for the film - the serial killer becomes the girl, and the girl lands up in the body of the serial killer, and of course they only have a limited amount of time to switch back.Yeah, it's sort of different, though I'd have to say that it probably isn't the only bodyswap film out there. In fact I believe I have seen similar films previously, especially where we have a body swap (and I believe it is Hot Chick that I'm thinking of here). I do have to admit that swapping with a serial killer is sort of something different.Mind you, the thing that sort of got me was how this serial killer, once he landed up in the woman's body, somehow realised how to dress cool. Sure, it is a major factor in the film that overnight she goes from being a dag to being, well, this pretty awesome chick, however when you discover how the serial killer actually lives, it is sort of puzzling how he somehow knew how to make the woman look pretty awesome. In a way it sort of doesn't make sense, but then again this is a black comedy, and it sort of needed it to be like that for it to work.Yeah, it's actually pretty funny in parts, and I guess that I why I liked it. It is certainly a different take on your typical slasher film, and it certainly kept me entertained. Yeah, the scene in the car was pretty awesome, and the few people that were in the cinema found it pretty entertaining as well. Yeah, I liked it."}, {"id": 90, "text": "Heartfelt and funny horror comedy in the tradition of Landon's previous two films. It's either a style you'll love or one that'll annoy you. The odds are it's probably too slashery and gory for the comedy fans and too funny for those wanting a straightforward slasher. For those of us who enjoy a little mashup every now and then, I can't imagine anything more fun in this day and age. The story isn't the most original, but some of the death scenes are fun and Newton and Vaughn appear to be having the time of their lives."}, {"id": 91, "text": "I watched it at the film festival and it was all about a body swap"}, {"id": 92, "text": "This film start with a bunch of people talking about a serial killer, a man with mask killing a bunch a people in the house, and the mask man stole a dagger scene! As turnout, this film is about a young girl Millie need to switch back her body with a serial killer The Butcher, by obtain the dagger, and stab back at the body of herself! Entire film full of boring conversation, and annoying overuse scene! Such as, overuse of the freaking out scene, overuse of the calling names scene, overuse of the playing dumb scene, overuse of the staring scene, overuse of the slow motion walking scene, overuse of the searching things scene, and overuse the annoying song playing at the background scene! Make the film unwatchable! The killing scene in the film quite bloody gore at some point, but overall not intense, low satisfaction, occur in short period of time, and depict by sideways! Barely laughable scene is, Nyla, and Josh keep hitting The Butcher, even he already prove he is Millie! At the end, after switch back the body with The Butcher, Millie eventually killing The Butcher by stabbing him! That's it! Another disappointed film!"}, {"id": 93, "text": "Please dont waste your time, why blumhouse so bad like this"}, {"id": 94, "text": "Vince Vaughn is excellent in this. He does a better job at being a teenage girl than Robin Williams did in Mrs Doubtfire! This is a nice horror twist on the classic Freaky Friday.I thoroughly enjoyed this. It was a much needed film in 2020! Kathryn Newton (Millie) gives a convincing performance as the nice school girl turned into the body swap killer. Her role was more reserved to Vince Vaughan's ott teenage girl persona."}, {"id": 95, "text": "A bit too far fetched where it's annoying and feels like dumb writing more so than ironic comedy.While it was a good plot idea, the execution of it all was questionable and quite sloppy which is a shame as the trailer was very promising as well as Happy Death Day being a great watch when it was released. Shame the expectations didn't follow through. 3/10"}, {"id": 96, "text": "Definitely my favorite watch of the year... this felt like Scream meets Freaky Friday while messing around with the gore from Friday the 13th! I think the most surprising thing about this movie was that it was produced by Blumhouse, once again, as they did with Get Out, Upgrade, Halloween, BlacKkKansman, and the Invisible Man, they triumphed with a film that provided great writing, fleshed out interesting and funny characters with range in their acting.It made me so happy to see that Kathryn Newton gets to flex her acting skills in this movie, she does such a great job as the leading lady next to Vince Vaughn. Vince Vaughn actually really excels in this role where he switches bodies with a teenage girl, it was too funny. I absolutely enjoyed the crap out of this movie so much I've seen it 5 times already, and I honestly wish that more movies would balance their horror with their comedy as well as this movie managed to do, which I have not seen since Scream, but that is my opinion. That is not to say I think this movie is perfect, in no way am I saying that at all. What I am saying is that the factors that make this movie so enjoyable outweigh whatever little scene I didn't like so much so that I don't even want to bother complaining about that. This is just as enjoyable as Tucker &amp; Dale vs. Evil. I highly recommend this movie!"}, {"id": 97, "text": "Vincent Vaughn, extraordinarily, excellent cast if you are thinking about the sequel, you need yes or yes to resurrect Vincent, this is the key"}, {"id": 98, "text": "Plot: is very easy and taken light. This movie is splatter, not horror.Actors &amp; Acting: wow, even if the plot is... strange, Vince Vaughn, Kathryn Newton, Celeste O'Connor, Misha Osherovich, Kelly Lamor Wilson did a very great job. Really! Also Melissa Collazo was perfect on her snob character. I was interested in this movie to see Kathryn Newton otside Big Little Lies. And I'm starting to like her ability to acting. Well, she's not perfect but keeping practicing I think she will be a great actress. We'll see.Soundtrack: nothing special.Conclusion: do you want to spend an evening with your friends laughing on a splatter movie? Well, this is. At least the actors are great."}, {"id": 99, "text": "All the remakes of the franchise have been bad or okay this one is actually good the comedy is outstanding they do a very good job at swapping with each other it is an interesting take the plot line is fun it is well paced it does feel predictable at some moments but not too much"}, {"id": 100, "text": "I saw a trailer for this last week &amp; thought it looked like good fun for a Sunday &amp; it delivered + more! Both Vince &amp; Kathryn play both sides of their roles incredibly well. Vince when he's Millie delivers some of the best laughs of this film, just through movements &amp; facial expressions more than words. Misha who plays Josh &amp; Celeste who plays Nyla were perfectly cast for this film, adding so many well timed laughs into this. The horror side of it, like a lot of horrors, is pretty predictable but the visual side of it is really good, there's one at the start that's brilliant to watch if you're not squeamish &amp; another later in the film that are top notch! The Kessler family aren't pushed completely to the side, there's a nice scene in the change rooms with the mother &amp; you can tell the sister is protective. The love interest with Booker (Uriah) is a nice add to the story &amp; delivered some great scenes, especially one in the car with Vince when he's Millie! If you want something to watch, that's not overly serious &amp; a bit of horror fun, I think you'll really like this!"}, {"id": 101, "text": "I absolutely love this movie! It is hilarious but with a side of blood and gore to it! This movie is a great horror comedy and has a great twist to it! The movie is a bit violent when it comes to the kills for example the first kill of the movie is when one teenager has a glass bottle shoved down his throat or when The Butcher saws Millie's teacher in half. Great movie! I give it a 10/10!"}, {"id": 102, "text": "I saw Freaky, starring Vince Vaughn-Hacksaw Ridge, The Lost World:Jurassic Park; Kathryn Newton-Big Little Lies_tv, Blockers; Uriah Shelton-Girl Meets World_tv, The Glades_tv and Alan Ruck-Speed, Ferris Bueller's Day Off. This is a horror/comedy based on the 1972 Freaky Friday book written by Mary Rodgers-and also the Disney movies-and the movie is written &amp; directed by Christopher Landon, who also did the Happy Death Day movies, Paranormal Activity:The Marked Ones and The Scouts Guide to the Zombie Apocalypse. Vince plays a serial killer in the vein of Jason-he has a similar hockey style mask-that is terrorizing a town. Kathryn is a shy high school girl-no boyfriend, she dresses drably, doesn't comb her hair, but you can tell that she could be a popular girl if she worked at it-that is the latest target for Vince. In his latest kill_a_thon, Vince finds a knife that just happens to be cursed and he uses it on Kathryn. But, instead of killing her, it swaps their bodies, with him in her body and vice versa-that's where most of the comedy comes from. Through diligent research-and the help of a couple of her friends-Kathryn discovers that there is a time limit on when they can switch back or it becomes permanent. Uriah plays the boy that Kathryn likes-but she doesn't think he knows she exists-and Alan plays one of her teachers. It's not all fun and games though, the violence is pretty graphic-there is one scene in particular that shows her cutting a person in half with a table saw. It's rated R for strong bloody violence, sexual content-no nudity-and language and has a running time of 1 hour &amp; 41 minutes. If you like these types of movies-horror/comedy-you should enjoy it. I did and I would buy it on Blu_Ray."}, {"id": 103, "text": "Kathryn &amp; Vince hardly share any screen time together, and manage to pull off some incredible performances. I honestly forgot at some points that they were switched (actually believed Kathryn was a homicidal maniac &amp; Vince was a very confused girl in a man's body).The pacing was good, lots of good jokes, hard kills and bloody fun. What more can you ask of a movie?"}, {"id": 104, "text": "Vince Vaughn is not only a great serial killer but an even better teenage girl. The move was surprising with twists and turns. All of the characters did a great job acting. This was a great movie"}, {"id": 105, "text": "Freaky is an amazing dark comedy horror flick with a lot of references of classic horror movies of the slasher subgenre. This film is as Freaky Friday and The Hot Chick in a horror story. The script is a satire of the slasher subgenre, a lot of funny clichés, cool performances, a colorful cinematography, great direction and good gory scenes. A modern classic."}, {"id": 106, "text": "Amazing movie. Touched all the feels. I laughed , I cried, the kills were great! So so funny. Vince Vaughn does another amazing job in another great film. Blumhouse with another hit. This movie was actually scary, unlike some others. Great story. Great acting. Worth the money for the video on demand. I watched it on Amazon. Definitely watch it!!"}, {"id": 107, "text": "Grazy,Funny,&amp; some great kills in this !! Vince Vaugh nails this Role reversal teen slasher. The One liner's in this are awesome ! Go on...you know you wanna."}, {"id": 108, "text": "Christopher Landon once again delivers a entertaining horror comedy. Vince Vaughn and Kathryn Newton were a great casting choice. Though the comedy was on the low side compared to Landon's other horror comedies like Happy Death Day, the movie was still enjoyable. Freaky grabs your attention with the first kill. As a Scream fan, I would definitely recommend adding this to your watch list"}, {"id": 109, "text": "I went in with no expectations other than it was from the creators of Happy Death Day, which I didn't like, but they embraced the ridiculous plot fully and I was surprised at how often I found myself laughing. The jokes landed surprisingly well and Vince Vaughn was hilarious. He was so likable as the teenage girl I almost didn't want them to switch back bodies."}, {"id": 110, "text": "I don't like to give away stories. Vaughn was great. Fun story with laughs. I enjoyed it. If you liked Scream you should as well."}, {"id": 111, "text": "Thought it would be better, eh. I like the 2 leads, but the movie is just not very good. The Faculty or Disturbing Behavior would be better time spent viewing than this."}, {"id": 112, "text": "If you really start to believe the 2 souls swapped, Vince is playing a pretty good role. Funny movie and most of all a good story and unique in this way."}, {"id": 113, "text": "This film is great. If you're a horror fan you won't miss the homage to Halloween, Friday the 13th &amp; Scream. The comedy is perfect mixed well with the horror and gore. Vince Vaughn is hilarious and the film is just fun from beginning to end. A total must watch movie."}, {"id": 114, "text": "What kind of this body is not mine but without Rob Schneider and version of evil is this? A film that masterfully combines comedy and suspense, it is not horror. It is about a murderer called the butcher who in an attack takes an ancient knife and when attacking a girl unleashes a curse by changing bodies with him. Quality. Entertaining Performances at the level. Vince Vaughn acts spectacular as a teenage girl. The characters of the girl's friends and boyfriend steal the screen. Has all the essence of this body is not mine. The comedy is organic. The deaths are fine, even some dismemberments look great on screen, excess blood. Predictable ending but it entertains you. If you like the films of the BH production company, you will like this film."}, {"id": 115, "text": "So creepy and funny at the same time! Loved this movie the cast did a great job!"}, {"id": 116, "text": "From start to end, comedy!! Once the mystery starts it's all up hill from there! Very good laughs and some very gory scenes, but perfectly done lol"}, {"id": 117, "text": "This film was so much fun, the choice of adding Disney's classic freaky Friday plot with classic slasher elements to it blended great. Both Kathryn Newton and Vince Vaughn delivered great performances in each other's bodies. The comedy and horror was done right and would please any fan of slasher films"}, {"id": 118, "text": "I'm really tired of the latest trend to turn every movie and subject into a woman power thing. I don't believe it's absolutely wrong, but I do believe that they don't know how to make it right. All those new movies are just the same thing. A woman protagonist or a group of women just kick mens's asses. Yeap it's fun and all that staff, but there is nothing fresh or new on 'em. But in this case, i think they NAILED it. The story is gory and absolutely savage. Tons of laughs, even the jump scares are on point. Although, the most important thing is, that this film does not take itself too seriously. I mean it slides like it should be. No pressure and hidden messages. It builts its characters nicely and the climax is everything. Woman power of course, but in an smooth and glorious way. Now we can all say it.. YOU GO GURL!"}, {"id": 119, "text": "Well done!a mixture of comedy,gore and parody on famous slashers of the past,with a great acting made this film one of the better ones !Just don't take it too seriously and you'll have a blast!"}, {"id": 120, "text": "The opening scene was awesome. The boy killed by a bottle in the mouth reminded me of sorority row remake and the final girl of the opening scene gets out of the secret closet and runs for her parents coming home and got killed the last minute. That was very similar to the opening scene of scream. Then the butcher steals a mystical dagger from the house. Millie the timid girl waits for her mom in front of the school but she fell asleep drunk. The butcher shows up and stabs her and the bodies swap. Both woke up startled. After a long fight at the school Millie's best friends josh and Nyla convinced of him being Mille when he danced the way mascot of the football team dances. They ran away the police after them with the tiny car and found refuge in a discount clothing shop where Millie's mom works.It was really funny when Millie in the body of the butcher was asked out by his mom for a coffee when he was hiding in the Changing cabin while running away from his police officer older sister. Millie killed the bully teacher by a electric saw and froze to death the gossip girl. She was somehow taking revenge on the bullies. Then they captured her and tied up in a chair in the house of josh. And goes out to steal the dagger from the station. Josh's mom comes back home earlier and the scene was really fun when he said he was straight and the mom was doubting that more than anything. And the butcher untied herself and came after them. They then escaped home and met at the police station. Millie takes the police car and heads for the old mill where the party's taking place. He kills 3 bullies there and again with a chainsaw one of them. And a boy hitting on josh and bullying him. They somehow capture Millie before it's too late and stab him to get her body back. The police shot the killer after that but he wasn't dead and at this point I was hopeful about a sequel. But at the last scene the butcher came after Millie to her house and fought three of them until Millie gets to stab him with a log right in the chest like he were a vampire. Vince Vaughn was the best thing about this movie. He acted flawless as a teenage girl when he read the poem to her crush to convince him and when they flirted at the back seat while waiting for the others at the police station. I'd like to see him more in slashers like this."}, {"id": 121, "text": "This movie is hilarious. Vince Vaughn and the rest of the cast are badass. It's definitely scary at some parts and has some gore, but mostly it's a riot. Loved it."}, {"id": 122, "text": "Body switch comedies are hit and miss and this is not that great.I don't know if the acting is that way on purpose but if not like what the hell. I was always super aware this was all acting i could just not get into the movie.After seeing Jack Black nail a teenager impression in Jumanji i was curious to see Vaughn take on it and to me it sucked he barely acted like the real actress. She was def better than him.It was overhyped online cause the final product is just ok."}, {"id": 123, "text": "A nice and entertaining movie, join and enjoy it. Vince Vaughn was wonderful."}, {"id": 124, "text": "This movie is a great time and the opening scene was such a good hook. Go see this!"}, {"id": 125, "text": "This film was jammed packed with unique kills and gore (not too gory). There were quite a number of kills in the opening scene as I was afraid this was going to be one of those films where people get killed after another, thankfully it wasn't.The comedy tied in pretty well and didn't seem forced. There were times in the film where I ended up rooting for the killer. I also liked how when you think the film is about to end, you are left in suspense as the movie still continues just a bit longer with that ending scene in Millie's house.I'd give this film a 9/10, pretty enjoyable and easy to follow along. The plot isn't anything special but sometimes having a simple movie to watch is just what you need."}, {"id": 126, "text": "Freaky was a fun body swap horror comedy that knowed what it is and accept it in a very good and fun way.Usually im not fan of this kind of films cause they feel all the same and there are plenty of this kind of films in 2000 either in horrors or through romantic comedies but this one was very fun to watch mostly because Vaughn great performances as both characters ,he was funny when he was needed and he was scary when that was needed.Katharine Newton and rest of cast also did a good job and they sold their characters very well.Freaky was a fun film to see."}, {"id": 127, "text": "By all rights, I should hate this movie, a semi-remake of Freaky Friday that instead subverts the source material by turning it into a slasher. But you know, it ended up hitting me the right way and I was behind it pretty much all the way.Directed by Christopher Beau Landon - yes, the son of Michael - who wrote Disturbia - that's not even a word - and several of the Paranormal Activity movies before directing the Happy Death Day films. If you liked those, well, this will definitely give you more of what those movies offered, this is set in the same universe - Landon said that, They definitely share the same DNA and there's a good chance Millie and Tree will bump into each other someday - and was originally titled Freaky Friday the 13th.Millie Kessler (Kathryn Newton, Big Little Lies) is a teenager who has been tormented by bullies, both of the teenager and teacher* varieties. Meanwhile, the urban legend of the Blissfield Butcher continues, as he keeps killing her classmates. Now that he possesses a McGuffin called La Dola - an ancient Mayan sacrificial dagger - he looks to gain even more power. But when he runs into our heroine - her mother (Katie Finneran, who is great in this) has left her behind at a football game where all she gets to do is wear a beaver mascot costume - she battles the Butcher and when he stabs her, they end up switching bodies.So yeah - this turns into a body swap comedy and you'd think, after the gory as hell open, this is where they lose you. But no - if anything, this gets way more fun.Millie's friends make for some of the best scenes in the film. Nyla (Celeste O'Connor) and Josh (Misha Osherovich) have been with her through the worst parts of high school, so having their best friend in the body of a killing machine is just another trial to be endured.Speaking of that killer, Vince Vaughn shines in this. There's plenty of silly physical comedy, but also some really nice scenes like when he admits to the love interest that she left the note he treasures (body swap pronouns are a little hard) or when he has a moment with her mother while hiding in a changing room.Landon - who wrote the movie along with Michael Kennedy - said that the film was influenced by the Scream series, along with Cherry Falls, Fright Night, Jennifer's Body, The Blob and Urban Legend. There's also a fair bit of Halloween in here, particularly the opening series of murders, and references to Heathers, Child's Play, Creepshow, Galaxy Quest, Carrie, The Faculty, The Craft and Supernatural. There's also a bottle down the throat kill that came directly from the 2009 slasher remake Sorority Row.I had fun with this. Here's hoping you do the same.*The funny thing is that the teacher that is the worst to her is Alan Ruck, who knows a thing about bring bullied, what with playing Cameron in Ferris Bueller's Day Off."}, {"id": 128, "text": "This is an awesome was to put a twist on a classic. I haven't been this entertained since happy death day and scream. It's totally predictable, but made me Laugh out loud at least 10 times and even when you see it coming, it's a delight to watch.I was pleasantly surprised having gone into this with low expectations. Bravo once again Blumhouse."}, {"id": 129, "text": "This movie had great acting, a good story line and Vincent vaughn. This movie isn't best movie of all time but it's a good movie to watch with a girlfriend or family!"}, {"id": 130, "text": "The horror movie version of Freaky Friday. I thought this movie was gonna be lame at first, but I was surprised how much I liked it. At first, it feels like you're watching a Friday the 13th movie (the killer's mask is basically a knockoff Jason mask). Then the killer accidentally switches bodies with the girl he's trying to kill, and things get so ridiculous you can't help but just laugh. The killer is now in the girl's body killing all her friends, and the shy girl is now in the butcher's body trying to avoid capture. It's silly, fun &amp; scary all at once. The writers did a great job. Great to see in theaters!"}, {"id": 131, "text": "For those that don't know the lingo, body swap means exactly that - one person's consciousness is transferred into another person's body and often vice versa. You know, the Jack Black and Rock version of Jumanji, and Freaky Friday ( I can only remember the Jodie Foster one but there is at least one other). Plenty of good reviews here. I can only add that it draws inspiration from Mean Girls, Friday the 13th, and Freaky Friday, and it is original because of the inclusion that slasher/horror genre. It's as much a genre swap as a body swap! Blumhouse strikes again."}, {"id": 132, "text": "The show has a decent slasher horror theme. There is nothing grotesque here, the smut humour is easily tolerable. The characters are nice to look at. It was a decent movie. The advertisment song in Australia is a short from Die Antwerp, the songs name is Fink u Freaky."}, {"id": 133, "text": "Fun movie. You will be surprised what Vince does! Great action &amp; lots of laughs."}, {"id": 134, "text": "What a fun movie!! Love the opening, it's goofy and surprisingly super bloody (as is the rest of the film). Vince Vaughn is great when he portrays Millie. Super funny but also pretty tense, and that's hard to do. Ending was kind of ehhhh but overall the movie was a great watch. And how the heck did a high school have a cryogenic freezer?! What's that nonsense!!"}, {"id": 135, "text": "Amusing, violent, gory, &amp; crass with awkward moments between characters."}, {"id": 136, "text": "Two things that made this a fun watch: Vince Vaughn and the R rating.Vince Vaughn chews up each scene he's in as both the Jason-esque serial killer and body-swapped teenager. Every time he flails his arms as he runs brings a belly-laugh.And Freaky is a perfect example why they should stop making PG-13 horror movies. Christopher Landon's previous Happy Death Day movies were fun but they felt like they were missing something. I think that something was the ability to let loose.It does lose steam in the middle act with less action and unneeded character development, but you can't go wrong with this flick if you are looking for a bit of escapism."}, {"id": 137, "text": "If Hallmark and Lionsgate had a baby it would be this movie. It creates a new genre--feel-good horror. Teenage girl Vince Vaughn puts Lindsey Lohan to shame. Excellent musical score."}, {"id": 138, "text": "This is fun and even a little funny. It is NOT a horror film. It is an extremely violent comedy. As long as you don't take it seriously, you should have a good time."}, {"id": 139, "text": "This movie is sitting at a 7/10 right now. For my unprofessional opinion, that is a pretty fair assessment. Funny, but just as funny as the trailers you've already seen are. It is nothing unexpected, and yet the concept itself is still original. A decent watch all around."}, {"id": 140, "text": "Good funny movie. With lots of amazing kills. Very awesome with a low budget movie. Did very well with a small budget done right! Thank you!"}, {"id": 141, "text": "What I thought was going to be glued to dull stereotypes and boring cliches with no hope to breath as we all choke in bromides and everything that sucks about bad writing for High-School films that should actually be otherwise amazing but somehow manage to suck it up , this one stood up and said lets have some fun and not JUST WITH THE AWESOME writing but the acting and directing and everything , who ever thunk Ol' boy could act like a vicious cereal killer Vince! I mean he was deadly and violent and ugly and cute and fun and sweet and funny and witty all at the same time! I loved it, it was funny and witty and genuine and honest and cute and the violence was fun and compelling and all the characters worked together, the mom and sister totally added to the thing and the crisis was amazing and the ending made me want more! hopefully there is another one! I would love to see another one , cease this was super well put together!"}, {"id": 142, "text": "This is LITTERALLY, not figuratively, the plot of chucky. Accept, instead of a doll, a high school girl.Not complety original, but lots of fun, and Vince von as a cheerleader chic persona, nice.Not bad, not great, but definitely a somewhat classic."}, {"id": 143, "text": "Christopher Landon Has Done Swell With This Horror Comedy It's Got A Good Story And It Gives You The Laughs And Giggles You'll Need Especially For A Movie Like This Best Horror/Comedy Of 2020*Warning Movie Contain Strong Bloody Violence And The Deaths Are Just Gruesome Even For Younger Audiences*"}, {"id": 144, "text": "I liked the movie because it's very funny, I laughed a lot even in the creepiest moments. It is not original and can be forgettable, but it is very enjoyable. The acting is also good."}, {"id": 145, "text": "Vince Vaughn did a great job in this one. It was a fun ride from start to finish with plenty for horror and comedy fans to enjoy. I can't wait wait to watch this one again."}, {"id": 146, "text": "Can't believe what he does with this movie.Almost stopped watching this movie in the beginning.Glad I kept going because I got to see the master at work.Haven't lol'd this much at a movie since Bruce Almighty was in theaters."}, {"id": 147, "text": "It's exactly what I was looking for in a comedy/horror type of movie. It's light and really funny."}, {"id": 148, "text": "So have been waiting to see this movie fir awhile. Rented it the other day off of Amazon and i was not let down. Even though there were a few low points. Mostly this movie made me laugh and cheer and cringe and swoon. Most of the kills were epic. Vince Vaughn as the killer was amazing and as Millie omg it could have gone so wrong but was so right. The girl that played millie when she went pyscho mode omgshe nailed it. There a scene in it that made me laugh and cringe spoiler it the booker and vince csr scene it was epic. The supporting cast was spot one. The dialog and acting was superb and then the script and directing was good. All in all this movie was a great follow up to happy death day 1 and 2. Cant wait to see what else he can do."}, {"id": 149, "text": "I finally crossed off watch a movie at a Drive-in off my bucket list with Freaky (the resurgence of Drive-ins might be one of the very few good things coming out of the pandemic), and in that context, Freaky is a perfect movie to watch. Realistically though, it really isn't that great. Vince Vaughn is doing a good job, but that's pretty much it. Otherwise it's your basic horror/scary/comedy mashup with nothing all that original. So in the right conditions with some friends, turn your brain off and just let it happen."}, {"id": 150, "text": "Negatives first. I personally thought the movie was lagging at times. I felt like there were times where I was getting a little bored. Besides that, I really enjoyed Freaky. It was hilarious, at times, scary, and surprisingly heartfelt. If there's one reason you should see this movie, it's definitely Vince Vaughn. He gives a great performance. I never would've thought I'd ever see him act like a teen girl, but here we are. 7/10"}, {"id": 151, "text": "This movie is not unique in any way....except watching Vince Vaughan acting like a teen. Priceless! So.... I wholeheartedly recommend this movie"}, {"id": 152, "text": "It wasn't bad. For a Covid-19 era movie, it's worth a watch. It does have some gory moments, some funny moments, and the characters are relatable."}, {"id": 153, "text": "The first 20-30 mins of this movie was hot garbage. Every scene was filled with embarrassing clichés and lazy writing. However after a little while Freaky found its stride and turned out to be a fairly average horror movie."}, {"id": 154, "text": "Saw this with my 15 yr/old daughter and it was surprised me as I knew nothing about it. Had a good time and VV is brilliant as the butcher/body swapped teen."}, {"id": 155, "text": "Itis good if you are a fan of miss Newton, this movie is not for thinking or remember forever, noboy is gonna remember this movie, it just a movie for distraction watched during autum season into a pandemic time"}, {"id": 156, "text": "Funny and entertainingly gruesome. I had low expectations but the movie wasn't bad at all."}, {"id": 157, "text": "How can you not have fun when Vince Vaughn is acting like a high school girl? Add the shock value and this is a great watch."}, {"id": 158, "text": "Lemme just tell you. I wasnt expecting that good movie. It was cool and tense, just like I imagine some good horor-comedy. The plot isn't real, but it is really cool! I would def watch it again."}, {"id": 159, "text": "It's silly. It pokes fun at the slasher genre. But damn if it wasn't what I needed right now! Vince Vaughan's performance was understated, full of comic nuance and just down right sweet.This will be a favorite. Don't judge. I am a Kurosawa fan."}, {"id": 160, "text": "The casting was so good in this and made the jokes work so well. Plus a nice bit of nasty death scenes to. There was also some faces I haven't seen on tv for so long which was a nice surprise. I don't usually enjoy souly Jason Blum films but I was very nicely surprised by this one. Definitely worth a watch. 😊"}, {"id": 161, "text": "The movie had a fun concept like freaky Friday horror version. It could have been really good if they had found some decent actors and maybe took out the cheesy cliche high school scenes. I give it a 6 because Vince Vaughn was a 9 and everything else was a three so I meet in the middle."}, {"id": 162, "text": "All the 80s horror cliches in one movie , from massive knives perforrating doors to girls playing the bullyied student at the lockers aisle. Easy to watch on sunday afternoon , easier if your IQ is below 54."}, {"id": 163, "text": "When an ending is unsatisfying, it's like eating a delicious crepe followed by a crap. When Vincent Vaughan is shot conservatively 161 times, he not only doesn't die, but comes back later on completely unimpeded by his wounds, and seemingly stronger than before. The overall movie is pretty good and it's so much fun, but jesus that ending knocks the experience down so many points, seriously, its the dumbest thing I've ever seen he is mangled by bullets"}, {"id": 164, "text": "This movie is way more hyped up then it's cracked up to be. I thought it was extremely tacky. I think someone even said Vince Vaughn should get an Oscar nomination for his performance LMAO. Whoever said that must of been watching something else. And what was up with that lame mask he was wearing in the beginning? They couldn't come up with anything better then that? Not an all around terrible film but definitely not something I'd recommend or watch again. 5 stars 👎"}, {"id": 165, "text": "Lol Vince Vaughn I think it's over when you find yourself in the backseat of a car kissing a teen-age boy. This film was awful. Go watch Possessor 2020 a real visceral body swap film, nothing funny about it. I don't know why the Horror genre wants to be so goofy and funny nowadays. And do these writers think every male secrectly wants relations with other males? Yes they do think that just watch this film. Blumhouse (Outhouse) You are losing me. Just make the Michael Myers films and don't make Michael kiss Tommy Doyle please."}, {"id": 166, "text": "I for one liked the work that Kathryn Newton did on The Society so that was the main reason i watched this film.From the get go it's a very standard movie, all the cliché stuff is there for a normal teenage movie. Althought there was a interesting twist. Vince Vaughn actually played a interesting twist on the movie, and if it wasn't for him i'd probably give this a 4. At a certain point you get the plot of the movie and it's good they managed to add a touch of comedy to it, even if its minimal. You can definitely laugh."}, {"id": 167, "text": "This is quite a fun film. I'm impressed by Vince Vaughn's portrayal of a teenage girl. He's pretty convincing actually."}, {"id": 168, "text": "I went into this movie with low expectations because of the ratings I had seen. I don't read reviews nor do I judge a film off the ratings but anyone who says they don't take some of the praise or criticism to heart before they form their own opinions are just plain lying. Unless you avoid both at all costs. Well going in with low expectations from pretty bad the ratings/reviews I guess I enjoyed it more than someone with higher expectations. I was surprised by how much I loved Landon's Happy Death Day when it was first released because it just looked silly. I also really liked his sci-fi approach in Happy Death Day 2U which is an unpopular opinion apparently.BUT this. I don't know what Christopher Landon was going for here unless he was told by Universal to cut half of the movie out of the finished film because this is my first and only explanation as to what I just watched. It went no where. Mediocre. It was predictable. I thought that the knife (yeah the one on display right at the beginning of the film it still triggers me) would have been a better plot device if we got a story of why it was created and how it was used. As I saw the knife I thought to myself maybe the knife was used for eternal youth by switching bodies with a younger person think The Skeleton Key. EVEN I had a better idea than this films did. I really do hope there's a better version of this film out there because I know Landon can do better than this. Newton's performance was the only thing I throughly enjoyed about this movie. Just more mindless entertainment akin to what I expected from happy death day but again that was a good film."}, {"id": 169, "text": "Definitely worth watching and extremely entertaining. It's almost an exact copy of The Hot Chick except for the horror aspect of it."}, {"id": 170, "text": "This was such good fun &amp; I absolutely loved it.So many recent horror comedies have been awful (I'm looking at you 'Tragedy Girls' &amp; 'Patchwork') so I wasn't expecting much, but this film absolutely nailed it.Well worth your time, especially if you want to see an enormous mass murderer mincing &amp; prancing around like a little girl."}, {"id": 171, "text": "I enjoyed the sfx kills, they were very well done. But I would expect that from Blumhouse. That's the part I most liked about this film, but ...What I didn't care for was the body swapping and old jokes. Same tired jokes from many other body swap movies. The screenwriters played it cautiously. We get jokes from Kathryn Newton character in Vaughn body peeing in the restroom with a peepee. But no jokes from Vince Vaughn character in Newton's body with a vag; double standard or tabou? Funny the screenwriters didn't show any restraint with the dialogAnyway, I think this film shows Vince Vaughn versality as a movie heavy in crime dramas, to comedic actor. I think its worth a watch but it gets a 6 from me. Mostly for the SFX kills."}, {"id": 172, "text": "I thought this was gonna be a less funny version of Freaky Friday, but it was so funny. I laughed out loud several times and the part where they had their kiss was hilarious. Vince Vaugn plays a better teenage girl than most teenage girls. It was on point! The only thing about this movie that grosses me out is that it was very gory, but I still enjoyed it."}, {"id": 173, "text": "This movie revolves around a girl that is picked on by everyone, by the fellow students, even the teachers. Then one day she swaps bodies with a serial killer. Vince Vaught truly carries this movie, Kathryn Newton does a very bad job at pretending Vince, the only thing she does is being quiet and looking like an infant who has to poop. It's the most predictable plot EVER, but the fair amount of slashing makes up for that. Then there are the demonic whispers in the movie, but that is more laughable then scary, I even dare to say there is not 1 scary thing in this movie. If you will never see this movie in your life, then you have missed out nothing, if you can't find a better movie, this one will fill your evening."}, {"id": 174, "text": "I can't describe how much Vince's Millie cracks me up and what a ride! I thought him not dead on the gurney signals a sequel, but nope. Still great tho."}, {"id": 175, "text": "Movie was pretty interesting I just didn't like ending."}, {"id": 176, "text": "When Millie gets the text about the murders her phone says Thursday February 12. They talk about the homecoming dance and the next scene is a football game. As far as I know Homecoming is in the fall and High School football is long over by February."}, {"id": 177, "text": "Actually, there is not much to say about the concept in the movie. It's a typical body swap serial killer horror movie. but special about this movie is how it was executed. The director did a decent job to stop being just a body swap movie. The acting also good but not great, the main two characters were good but the supporting cast didn't impress me. it's good for Halloween Friday night. The rewatch value for this movie is 2/10."}, {"id": 178, "text": "Cool visuals and extreme gore is not enough to save this poorly written movie based on a concept that has been done to death. Movie is not as good as the trailer makes it to be"}, {"id": 179, "text": "Super cute, yet gory flick! Vince Vaughn is absolutely the best part of this movie, period!!! He had me cracking up, and he makes it look so easy! If you don't watch for any other reason, watch for him!"}, {"id": 180, "text": "While the idea it's not original, but I don't have anything bad against this movie. Vince did a great job, although he's not my first choice. All I can think of is if Will Ferrell starred it would have been alot better. But no complaint from me."}, {"id": 181, "text": "Inventive take on the tired and contrived slasher trope. Vince Vaughan has shown a lot of versatility in recent roles - not easy to transition from comedy to....well, anything, really. Here he plays two roles in the old body swap comedy storyline with applom. This is better than it sounds, largely due to his performance as high school loner and bloodthirsty psycho killer. Disappointing and contrived ending though."}, {"id": 182, "text": "It's a little late for a Halloween/slasher movie, but it looks like they really wanted that Friday the 13th release date. And to my surprise, this was way more fun than I thought it would be.Just when you think it's another generic, teen angst, alcohol-drinking, sex-thirsting movie, the kills start happening. Not only were they gory, but they were also quite creative. The movie just knows exactly what it is and never takes itself too seriously. Plus, watching mean bullies die in horrific ways was just so satisfying to watch. (Hopefully, I'm not the only one...)More importantly, Vince Vaughn is the reason you should watch this. You have this 6-foot-5 giant of a man running around as a teenage girl. From the way he speaks to his subtle mannerisms, it was just plain funny. He's the man-- or the woman, I mean.As for the negatives, it mostly has to do with the writing. Basically, everything with the family was boring and predictable. It was probably the most generic part of the movie. They lazily tell you everything you need to know as soon as they're introduced.I also hate it when movies portray a character as ugly or undesirable and the actress is anything but. In other words, they want you to believe that Kathryn Newton's Millie is some kind of weirdo loser, but I just never bought it.There's also a disconnect between Newton's Millie, who is shy, timid and quiet, and Vince Vaughn's Millie, who is girly-girl, talkative and fun. They just felt like different people. There's also, sort of, two endings. There was the natural conclusion, and everything was good, but then it goes on for another 10 minutes, and it was just unnecessary.Despite some annoying tropes and poor writing, this was a fun, self-aware movie with some horrific kills and really funny body swap moments.Score: 7 out of 10 Overall: GoodRecommended for: Fans of Vince Vaughn, fans of Freaky Friday with a slasher twist, or fans of watching scumbag bullies get what's coming to them.Thanks for reading!"}, {"id": 183, "text": "When I saw the trailer firbthis I was cautiously optimistic that it could be ok. It looked like a Scream meets Freaky Friday. Well, it is that but it is really not very good.Of course this type of horror comedy is not to be taken seriously but it is not very funny or scary at all. The premise is just as the trailer shows. A high school girl gets attacked by a serial killer and they switch bodies. That's it.The serial killer the Blissfield Butcher is played by Vince Vaughn. The high school girl Millie is played by Kathryn Newton. Millie is attacked by the killer with a sacred Aztec dagger that has the power to switch their bodies. The fun of the film is watching each of them adjust in their new bodies. Vaughn does a good job with a very thin script. Newton just goes around looking evil. The film is gory but nothing we've never seen before in much better films. It has a couple of decent chuckles but again been there seen that.The film wants to convince you that it is really cool and edgy but it really isn't.Lazy film.Grade: C-"}, {"id": 184, "text": "This was a great twist on the overdone, high-concept, body-swap story... switch a shy teenage girl with a serial killer... alas for me the entertainment value was pretty low and I'm kinda surprised to see even a 6.9 rating on IMDB (and 80% fresh audience score on RT). The performances are adequate, even fun at times with Vince Vaughn going all in on his portrayal of a shy teenage girl.The biggest problem with the movie is it's inconsistent tone... it feels like a made for Disney TV movie with 30 seconds of inappropriate language and phenomenal gore shoehorned in, resulting in a film too mature for viewers under 14 and too juvenile for adult entertainment. It's second sin is failing to fully capitalize on the story concept; I assume that the script read better than the one dimensional characters and by the numbers plot points on screen.5 out of 10."}, {"id": 185, "text": "Vince Vaughn must be owing a lot of money to some loan shark, has some gambling debts or is behind on alimony payments to some ex from hell. He is (or was) better than this.Freaky is by definition very freaky. It not funny, there is no horror (haven't we seen people being killed in the most gory an gruesome ways before?) and the story is pedestrian. This body-switching idea has been used in much more interesting ways in the past.As it is, Freaky is just a few murders here and there intertwined with poor dialogue, poor acting and the traditional and expected and annoying jump scares.In the end I just wished they all died"}, {"id": 186, "text": "I absolutely love body-swapping comedies, such as Freaky Friday and The Hot Chick. I also absolutely love horror slashers like Halloween, Friday the 13th, and Scream. To combine these different genres was a dream come true. I'm glad it's getting such positive reviews. It deserves it. Kathryn Newton was great and so fun to watch her go from a sweet shy vulnerable high school girl named Millie, to bloodthirsty serial killer. Vince Vaughn was great too. It was also fun to see him as an evil killer, turn into Millie and acting like a teenaged girl. The gore and killings were awesome and brutal.Millie Kessler is an average high school girl. Her family is going through a tragedy because of her father dying a year ago. She gets picked on by her peers and even the teachers. The night before the Homecoming dance, she's sitting in the parking lot and the Blissfield Butcher begins to attack her. He stabs her with an ancient Aztec dagger that he stole and that makes them switch bodies.On Friday the 13th, the Butcher wakes up as Millie in her girly bedroom, and Millie wakes up as the Butcher in his gory grotesque lair. Millie must convince her friends that it's her in the killer's body and switch bodies back in 24 hours, or the switch becomes permanent. Throughout the day, the Butcher in Millie's body goes on a bloody rampage. It's so fun to watch. If you love body swapping comedies, and gory horror slashers, I would definitely recommend FREAKY!!!"}, {"id": 187, "text": ".... But this was a missed opportunity. The plot was predictable (but then with this sort of film, it always was going to be) and the acting was pretty poor with the exception of Vince Vaughn who absolutely nailed it as the teenage girl with some proper laugh out loud moments.This isn't a terrible film but neither is it great or something that will be remembered in years to come. If you treat it as a brain-dead popcorn film, you'll have a good enough time of it but, I won't lie, by the end of it I was starting to find myself a little bored.Also - got to be said - Kathryn Newton could have done with some extra direction for when she were evil because she just came across as a rubbish Terminator (Robert Patrick version) with the way she walked around and used her eyes to stare menacingly.Comes to something when you're rooting for the body of Vince Vaughn no matter what mind is inside of it."}, {"id": 188, "text": "This movie was an absolute blast to watch ranging from scenes that have you frightened and jumping to scenes that have laughing out loud.The acting is this movie was great mostly because Vince Vaughn portraying a teenage girl was pure comedy and practically perfect. As for Kathryn Newton she had a solid performance going from a shy school girl to a murderous madman.The plot was really well done as it brought lots of laughs and always felt like the movie was moving along and never really slowing down. Because of this the movie seemed to go by fast and be really enjoyable all throughoutOverall Blumhouse knocked this one out of the park making a perfect blend between Happy Death Day and their take on Freaky Friday.Overall score: 89/100"}, {"id": 189, "text": "Conservatives wouldn't like this movie. But it's okay. It's not meant for them.I never felt like I wanted to be part of a movie fandom as much as I do now. Sign me right now, I wand a sequel and I want it bad.This movie was funny, thrilling and even gruesome at time, all done very tastefully.The characters felt like real people living in today's society. I loved the representation, and how they subverted tropes and the way they even acknowledged the bad ones.Kathryn Newton as Millie, aka Murder Barbie, was funny, relatable and quite literally, a killer. She was such a blast to watch.Celeste O'Connor and Misha Osherovich (Josh and Nyla) were incredible as well. Josh was really funny, and Nyla was an amazing friend.Vince Vaughn as The Butcher... I mean, it was so seamless, switching from one character to the other. I loved him so much as Millie but that's hardly a surprise as I really enjoy the trope of middle age men playing tiny blonde teenage girls.I also loved Melissa Collazo as Ryler. I think she portrayed the mean type of girl perfectly.Uriah Shelton as Brooker on the other hand... can I just say, dreamy? because that's how I felt. Ugh my heart. He doesn't appear a lot until pretty close to the end, but I loved every scene he was in.The ending was so satisfying to watch. Some people might think the later part of it was unnecessary, but I was literally so tensed. I didn't know what's going to happen and I was scared it's going to ruin the entire movie for me. Luckily it didn't, and I loved every bit of it. But I was genuinely terrified there for a second. I was so engaged.It's not a realistic slasher, but that doesn't make it less of a good movie. In fact, unrealistic slashers, such as The Babysitter, are probably my favorite subgenre at the moment.If you haven't watch it yet, trust me, and go watch it now."}, {"id": 190, "text": "Bloody fun and often hilarious; Freaky is the rare instance that comedy and horror can come together and take you a wild ride.In the slasher-comedy, after swapping bodies with a serial killer, a young girl in high school discovers she has less than 24 hours before the change becomes permanent.Featuring an A+ performance from Vince Vaughn, Freaky is a non-stop violent and funny flick that kept me entertained for nearly two hours. It's definitely predictable and not perfect but this is the perfect film to stream on a weekend with pizza. I had a great time and seriously wanted more. Kathryn Newton is also really good and looking forward to seeing in upcoming roles. A gender-bending twist on Freaky Friday, the film will leave you satisfied and is definitely worth... the stab.Follow @snobmedia for more reviews!"}, {"id": 191, "text": "Compared to Black Christmas (2019) which is the last Friday the 13th film I saw in theatres from Blumhouse, Freaky left me wanting more instead of making me make dash to the exit.This was a great slasher film that exceeded my expectations. I had expected this Blumhouse Production to be another miss and make me feel life's regrets of trying to see a new horror film on Friday the 13th. However, this fresh take on Freaky Friday was most welcome. It was a vibrant display of kill or be killed with comedy being a side note throughout, and not in the absolute classic, cheesy way that older slashers offer. My initial reservations were with Vince Vaughn knowing that he was a comedic actor. Those reservations were unnecessary as Vaughn playing a teenage girl was hilarious throughout as he tries to convince those around him that he's not the Butcher. On the opposite side of the spectrum, Kathryn Newton who played Millie, did a fantastic job of carrying the ominous presence of the Butcher to high school where the killing continues. By the end you'll be left laughing one moment and in the same scene cringing at the acts of violence.Overall, a really great slasher/comedy that I would recommend seeing in theatres on any given night. I went in expecting a 4/10 or less type of film and left with double the score and not apologizing to myself for sitting there for two wasted hours."}, {"id": 192, "text": "Reel Tunez... The Radio Show All About the Movies Movie Review (11/17/20): FreakyWow!! LOTS of laughs with the horror/comedy! Just think of Freaky Friday, and replace mother daughter with nerd school girl and a killer. Vince Vaughn is hilarious acting as the nerdy girl in the body of the killer (and EVERY time he ran, he CUT me up (pun.. but yes.. LAUGH!)... while Kathryn Newton is great as the killer in the school girl body! The cast was great and so was the acting in this Christopher Landon directed film (and if that last name sounds familiar, his Pa was Charles Ingalls on Little House on the Prairie (Michael Landon)! Also in the film was actor Alan Ruck who we all loved as Cameron from Ferris Bueller's Day Off.. but who did a great job playing the VERY unlikable smarmy shop teacher Mr. Bernardi.This is a great horror movie.. yet a great comedy, and Landon really did an awesome job mixing the two! I won't give any details to spoil it, but lets just say that at times we almost cheer the killer on!I'd rank this very high with a 7.3, and that a high score on my ratings! It's GREAT to see a movie during these times (during COVID) that is actually a great flick to catch in the theater!!Go so Freaky.. and have fun being scared!"}, {"id": 193, "text": "After bringing us the genre blending slasher time loop comedy delight that was Happy Death Day and it's more sci-fi leaning sequel, Happy Death Day 2U, Christopher Landon is back with FREAKY.Keeping with his ongoing theme of taking two genres and slamming them together to great effect, FREAKY asks what would happen if The Hot Chick played out as a slasher film (who wouldn't want to watch that).FREAKY feels like a return to the straightforward simplistic fare of the first Happy Death Day for Landon, which works to great effect. After the fun (and quite gory!) stereotypical teen slasher film opening sequence we are introduced to Kathryn Newton's Millie Kessler, a student at Blissfield High who though some body swap magic gets put into the body of Vince Vaughn's aptly named serial killer, The Blissfield Butcher.This is where both Newton and Vaughn really start to have some fun, with Newton now a menacing serial killer in a teen body and Vaughn gleefully acting as a teen student in a comparatively massive and hilariously overpowered body.There isn't anything absolutely groundbreaking going on here but that's kind of what makes this film a whole lot of fun, It let's the focus stay on the great two performances and is honestly a perfect film to get away from 2020 for a while.FREAKY excels in every way you'd want it to, it fits perfectly into Landon's filmography and style with two great performances at the centre.Highly recommended if you enjoyed Landon's earlier Happy Death Day films or even if you're just a slasher fan, you won't be disappointed.FREAKY slashes into cinemas this Thursday the 12th November Australia wide! (Yes even Melbourne!!)Thanks to Universal Pictures Australia for providing the screener for review."}, {"id": 194, "text": "4 out of 5 stars.Freaky is a good comedy horror film which has lots of fun for a killer thriller. I think Christopher Landon may be on a roll with making killer thrillers and having lots of fun with the concepts. Like Happy Death Day having the main girl die in so many ways while attempting to stop the killer. Freaky being a freaky friday concept with a high school girl Millie (Kathryn Newton) who is struggling with a past in the family. And lacks the confidence in her social life. But when she comes across a killer known as the Butcher (Vince Vaughn). He uses some ancient artifact knife to stab Millie. And they both awaken the next day with swapped bodies. Millie being in Vince Vaughns body. And Butcher being in Kathryn Newtons body. Both actors had fun with there characters. Kathryn having a dark and sexy side. Which she lures her victims in. While Vince Vaughn enjoys playing as a high school girl. And on the fun side. Butcher is on the wanted list. So Millie and her friends are on the run from police. While trying to find Butcher and that knife to switch there bodies back.Fun concept and plot. It does add a little emotional connection with Millie. Who had a rough past and struggling emotionally. While she sees life in a different perspective as the Butchers body. It does lack the scares for a horror movie. But it does have some bloody fun thrills. The movie does have some humor added as well which has a few laughs.Vince Vaughn and Kathryn Newton did a great job. Celeste O Connor and Misha Osherovich were also great playing Millies closest friends.Overall, it is a thriller with lots of bloody fun. Great cast. Humor and fast energy for a killer thriller."}, {"id": 195, "text": "'Freaky' is exactly what you would expect it to be. Hip, slick, and contemporary. It has inventive kills, solid production value and a likable lead. It is similar in tone and style to Happy Death Day. And a cameo by Alan Ruck (Cameron from Ferris Beuller's Day Off) was an added bonus.Tons of praise has been given to Vince Vaughan but I feel the film belongs to Kathyrn Newton's Millie. (The same was true of 2003's Freaky Friday. Curtis got all the praise, but Lindsay's performance was the anchor of the film). Aside from Millie and The Butcher, the supporting characters are all stock, although Misha Osherovich does bring a certain whimsy and spunk to his role as the standard gay sidekick.Newton has a lovable presence and she plays the role of a serial killer with a lot of conviction and focus. I was surprised at how seriously she took the role, considering the type of film. Vaughan, on the other hand didn't possess the same nuance or energy, and I was never convinced he was inhabiting the body of a teenage girl. His mannerisms were stereotypically female but were not specific to the character of Millie-or at least the version of her we are introduced to in the beginning of the film. His performance seemed very dialed-in to me.The film suffers considerably by including the parent died last year and main character is still grieving cliché- one that is so over-used the writers should know better. Is there no other back story one can think of to provide the requisite heart these types of films require? Had the film developed a stronger backstory, it could have been far more rewarding.In any case the film provides 104 minutes of passable, mildly entertaining fare."}, {"id": 196, "text": "A fiendishly funny &amp; gleefully violent fusion of horror, heart &amp; humour, Freaky deftly balances elements of comedy, slasher &amp; coming-of-age into a fresh, lighthearted &amp; entertaining delight that gets plenty of mileage out of its outlandish concept despite the familiar beats and is all the more uplifted by Vince Vaughn's hilarious showcase.Co-written &amp; directed by Christopher Landon (Happy Death Day &amp; Happy Death Day 2U), the simple &amp; ludicrous premise may sound like a recipe for disaster on paper but Landon makes it work rather seamlessly on screen. Packing a healthy dose of thrills &amp; kills in the opening scene, the film only gets weird &amp; wicked from there on yet the momentum is never lost.There are several nods to slasher classics of the past, not all gags are effective but most do land on mark, yet what makes the ride so amusing is Vaughn behaving like a teenage girl for most of the picture, and it is easy to tell that he was having a blast playing this part. Kathryn Newton also chips in with a good input in this role reversal but Vaughn is the real highlight here and easily steals the show.Overall, Freaky is a slick, swift &amp; snappy comedy slasher that's brought to life with verve &amp; vibrance and delivers exactly what the premise promised. A fun, thrilling &amp; entertaining extravaganza that doesn't aim for much other than offering its viewers an enjoyable &amp; pleasant cinematic fare, Christopher Landon's latest doesn't bother itself with where its limitations lie and instead just takes its crazy idea &amp; runs with it. Definitely worth a shot."}, {"id": 197, "text": "I'm a fan of Happy Death Day, so when I saw that Christopher Landon was returning to make another comedic slasher, and this time it was rated R and starring Vince Vaughn, I could barely contain my excitement. COVID has us all spending the majority of our time in the safety of our own homes, but I gladly risked infection to watch this movie in a semi-full theatre (and yes, one member of my audience happened to be coughing at an intermittent basis). Now, a few days after my showing, I'm happy to report that not only do I not have the coronavirus, but Freaky is one fine film.I had a smile on my face for about 90% of this films running time. From its bloody start that's reminiscent of the best of 80s slashers to its very funny second act that leads to a tense final 20 minutes, Freaky delivers one hour and forty minutes of flat out fun. Let's talk about the horror: Filled to the brim with ridiculously horrific kills and geysers of gushing blood, if you enjoy slasher films, you will 100% like this movie. Christopher Landon didn't skimp on the violence, or the tension. With a cat-and-mouse game in someone's giant mansion and a fight in a high school woodshop classroom, Freaky has enough blood and gore to satisfy even the most diehard slasher fans.In terms of comedy, Freaky delivers in spades. Vince Vaughn is pitch perfect in the role he was born to play: that of a teenaged girl. There are so many hilarious set pieces that will have you squirming and laughing at the same (just wait for the already infamous car sequence - you'll know it when you see it). It also helps that Vince is a genuinely good actor, and when paired with the fantastic and utterly gorgeous Kathryn Newton, this film becomes elevated to new heights. A silly horror-comedy has no right employing actors as good as these, but Christopher Landon seems to realize that grade-A actors improve grade-B material; and that's not to say that the story here is bad, because it isn't. In fact, the basic premise of a high school girl switching bodies with a serial killer is so unique that even the most jaded movie-goer will find themselves entertained at the concept.Freaky is fun - if you're looking for a good time at the movies, 2020 didn't have much to offer you, until now. I would highly recommend this movie to comedy and horror lovers alike; if you happen to enjoy both genres, you just found your perfect cup of tea."}, {"id": 198, "text": "It's a lot of horror elements to it like Scream, but it never shy away from the fact it's also a comedy. Since Happy Death Day 1 and 2, the feeling for horror comedies has always been welcoming, in which Christopher Landon directed has well.Millie(Kathryn Newton, Blockers) a teenage outcast is attacked by a killer known has The Blissfield Butcher(Vince Vaughn) has he tries to stab her with a magical dagger that causes Millie and the butcher to swap bodies. And now have 24 hours to swap back before it become permanent. Vince Vaughn plays his part quite we'll, one when where he is the killer, he got inspired a little off of Michael Myers(Halloween) and Jason Voorhees(Friday The 13th), and then when he's a teenage girl in a 6'5 mans body, then he shifts from scary to funny like no problem,. Kathryn Newton is also great has the shy Millie, and also goes into a great shift when the killer enters her body, she sells it well with a cold eye stare. Supporting actors also really shine in there roles, the movie never tries to be something that it's not, if you loved both Happy Death Days, then I hope ya'll will give Freaky a look."}, {"id": 199, "text": "I really like where Vince Vaughan's career has gone in later years. He was undoubtedly one of the funniest actors working in the business in his earlier years, but these days he's more than happy to show his versatility. Films like 'Hacksaw Ridge', 'Brawl in Cell Block 99' and 'Arkansas' have benefitted so much because of his presence. Now a film like 'Freaky' comes along where he gets to play two characters, and does both masterfully. As a giant, menacing serial killer his is highly credible, and then playing a teenage girl in a giant's body he is hilarious to watch. This was a fun ride.The film starts with a truly great opening sequence. It was tense, funny, smart and creative. Not enough horror movies - or any genre of films to be fair - remember the importance of starting their films off with a bang. There are some extremely dumb characters decisions that are going to annoy some people, although at times the decisions almost seemed so dumb that the movie may have been parodying the genre. I'm not entirely sure about that one.'Freaky' is 'The Hot Chick' meets 'Freaky Friday' meets... pick any slasher horror movie you like. The concept was a lot of fun and the movie itself worked pretty well due to some smart writing and good casting. There's a lot to like here. My advice would be just sit back and enjoy the ride."}, {"id": 200, "text": "Freaky is to Freaky Friday what Happy Death Day was to Groundhog Day. Essentially a horror comedy spin on the body-swap genre of movies, Freaky tells the story of a young insecure high school senior swapping bodies with a deranged serial killer, and has 24 hours to undo it before the swap is permenant.The biggest standout is the performances of Vince Vaughn and Kathryn Newton, especially when they play the 'swapped' versions of the characters. Vince Vaughn does a fantastic job playing a funny, awkward and nerdy teenage girl, similar to Jack Black's performance in Jumanji, and Kathryn is incredible as a serial killer in the body of a teen, especially as she tries to figure out how to effectively kill without the strength of her original body.This movie certainly isn't perfect, but I honestly can't think of any specific issues I have with it. Freaky knows exactly what it wants to be, and does that very well. I'm very happy I got to see this in cinemas. This is certainly a dumb fun crowd pleaser, but not quite as 'dumb' as you might expect from the premise.Definitely worth the watch. I personally think it's better than Happy Death Day, but with the pandemic, I don't think it'll be as successful as that film. I was all by myself in the theatre (albeit for a matinee showing) so not sure if it'll get the recognition it deserves. I personally am a big fan of this recent Horror Comedy trend coming from Blumhouse. Looking forward to seeing what they do next."}, {"id": 201, "text": "As I sat down to watch the 2020 movie titled Freaky, I must admit that I wasn't really expecting the movie to be very outstanding or memorable. But still, it had Vince Vaughn in it, so chances were that it would be watchable.Turns out that Freaky was surprisingly good. This movie totally surprised me. I will say that the movie started out by having me thinking it was just a senseless rip-off of the Friday the 13th movies, but that all changed - and for the better.The movie's storyline turned out to be one that brought suspense, comedy and thrills along with it, mixing the elements in a very enjoyable manner. I was genuinely entertained by what writers Michael Kennedy and Christopher Landon managed to deliver for Freaky.Now, if you think Freaky Friday meets Friday the 13th, then you actually have the result that is Freaky. I kid you not! And it works out so very, very well. And yeah, a body-swap horror comedy done the way that director Christopher Landon did with Freaky just worked marvelously.I will say that Vince Vaughn definitely had nailed some iconic and classic Kane Hodder as Jason Voorhees moves and mannerisms in the beginning of the movie, and he pulled it off so very well. But when the story progressed and The Butcher (played by Vince Vaughn) switched bodies with Millie (played by Kathryn Newton) the movie took a turn for the better, and it become absolutely splendid.And it should be said that there were so many nods towards established and well-known horror movies throughout the course of Freaky, and that was just so much fun to pick up on.Freaky was made so enjoyable and entertaining mostly by Vince Vaughn's performance as a teenage girl trapped in a hulking body of a mass murdered. There were just so many laughs to be had there, and his ways of delivering the dialogue, his expressions, his mannerisms and behavior all just came together so well for a very, very funny outcome.This was definitely a very good movie, and I can highly recommend that you sit down to watch it if you have the chance. My rating of Freaky is a well-deserved seven out of ten stars. This movie was such a wonderful surprise."}, {"id": 202, "text": "So to all parents wanting to have a time out away from cats dogs and kids, dont put this on for juvenile entertainment, because its actually the pure opposite of the forementioned film...but for grown ups who loved freaky friday as juvenile will find that this is a pretty decent comedyhorror slasher with similarities in caracterbuilding and plotsetup , will actually love this one. its the switching from kid to adult vice versa, just not a love/hate mum-daughter, but a cute little girl vs an above average sized male serial killer.i had some good laughs, the production are colourfilled with twisted sisters and other twisted twists and caracters and well updated on genderick correctness, that is well edited together with some pretty spectacular and quite unimaginable groovy gutwrenching gory execution style killings that makes the ''texas chain saw massacre'' look like a kids movie, the score works very well at all levels, and the main cast works very good.but there are some slow moments, and also exhagerated violence occationally, allthough this its a watchable flick for sure. would have attracted even more people with a little less boost on the gore-pedal,like my wife that love the kind of comedy, but evades blood and gore. so a recommend from the grumpy old man"}, {"id": 203, "text": "It finally crystalizes with Freaky, the latest in the kind of high concept genre cinema Hollywood used to release on the regular (with slightly higher budgets) from Christopher Landon following his two Happy Death Day movies that this filmmaker is a bit more rote when it comes to Horror than he is totally adept and a natural (or at least has a clever sensibility on the regular) as a comedy writer and director. He takes this concept we have seen so often - echoes of the obvious Freaky Friday, sure, and even for a couple of minutes Big, but I see a lot more of Face/Off once this teenage girl is embodied by a serial killer and that's as high a compliment I could think to grant - and uses his R rating for hilarious bloodshed, and then some (body parts do come apart at points) while taking the poss out of what it means to be a somewhat neglected/bullied teen girl... Or Vince Vaughn.Vaughn hasn't been this funny in (checks calendar, holy sheet man) 15 years, which is when Wedding Crashers gave him that opening ten minutes of raucous insanity with some other moments of inspired dialog. Here he commits completely to embodying this type, but also makes her human as well. And when Catherine Newton is swapped with this Blissfield Butcher (and of course the town is called Blissfield), she especially goes to town, perfects the Kubrick stare and gets to have fun being the violent psychotic type (who, you know, can get knocked around a lot being a teenage girl). Where Landon falters is with the casting and writing of Millie's co-patriots, who are (Patton Oswalt voice) GAY BEST FRIEEEND and sorta woke black girl, and in those brief but notable moments when it means to be more heartfelt (a scene between Butcher/Millie and the mother in a dressing room between doors is exoected) doesn't work as well as it should, which is where Death Day has the edge.Where it excels is as a self-conscious and knowing horror comedy, which occasionally goes for drawing out suspense and shocks and is by no means bad at it but nothing we haven't seen before (keen lighting for that, uh, haunted indoor mini-golf set, I think) and draws out giant belly laughs at the kinds of jokes and dialog and even physical comedy that logically has been done but is executed with enthusiasm and two very game performers. It'll be an ideal party movie for the teens of many stripes for a while and gives me more of what I'd want out of a Scream sequelboot than I know Ill get when the time comes."}, {"id": 204, "text": "For those who enjoyed Jack Black getting to role-play as a hilariously sassy teenage girl stuck in a man's body in Jumanji: Welcome to the Jungle, you'll get to see the same schtick here in Freaky- Vince Vaughn's soul is swapped with an outcast teenage girl. He's more hilarious than the film has the right to be, but also frightening as the Blissfield Butcher. Kathryn Newton in her two roles also have considerable effect, switching from the typical outcast student girl next door to the hot serial killer next door. Of course it's essentially Freaky Friday the 13th, but it also harkens to Face/Off (of which I now want to see an official Horror equivalent to).In brass tacs, this is a one-and-done effort built mostly of spare parts and every high school screenplay cliche in the book. Early on in the film, every student and teacher has that Netflix syndrome where they talk 30-60 overly clever words a minute. There's the jagoff jocks that turn into wannabe murderers, snarky mean girls, a stereotypical gay token sidekick. Add in a sibling rivalry (the sister is a police officer which is cool), a dead family member and alcoholic parent that serves some pretense for an arc that weaves in and out; but nothing of major impact comes of it and especially with the somewhat abrupt ending.Freaky can serve as a nice pitstop for those wanting to visit the theater, but if you're looking for another true quality picture worth the cash and travel- that will have to wait. Grade- C+. 2.5 out of 4 stars."}, {"id": 205, "text": "A high-concept film combining elements of films like Freaky Friday, Friday the 13th and Scream, Freaky is entertaining enough for people who don't mind the mingling of disparate genres. If you don't like taking liberties with genres, well, then, for a family friendly comedic Disney film, see the original Freaky Friday, which starred a very young Jodie Foster (15 years old). For a straight horror film see Friday the 13th. Scream is a self-aware slasher film which had fun with the genre and its tropes.For fans of slasher slash horror films, Freaky is par for the course as far as the gore goes for MA 15+ films. The plot involves two people unintentionally swapping bodies: a middle-aged man who is a serial killer (played by Vince Vaughn) and a teenage high school girl (Millie, played by Kathryn Newton). I can't say that Freaky Friday started off that genre of story but it's where I first came across it as a child, watching rental videos. Now, obviously, you're wondering how on Earth two people can swap bodies. You're overthinking things! Just go with it!The film is amusing enough in the comedy department. Can you imagine a cute teenage girl trying to be a serial killer? Absurd, right? Well...not as sublimely ridiculous as an even younger Hit-Girl (played by Chloë Grace Moretz when she was 12 years old) in the gloriously violent superhero film Kick-Ass. When Freaky is not being bloody or sexual (sex scenes are minimal in this film but there is sexual talk and moments of sexual menace), it does later come across as a comedic Disney action film.The only person whose name I knew in the cast was Vince Vaughn, which I knew for his work in comedy films (right now I can't think of a film that I've seen with him in it but I'm not a film nerd). I can't say that I could have come up with his name to star in a film in which he plays a serial killer whose body is inhabited by a teenage girl. However, if someone had mentioned his name I'm sure that I would gone along with it as an appropriate choice. It's hard to say what names that I would have come up with for this role. Steve Carrell, perhaps, though he is terminally short and one scene would have been weakened with a short man doing it (the scene with Vince and a teenage boy in a shower room at high school).Whilst you get scenes of bloody horror, you do get meta humour and sociological satire. Millie is not a stereotypical teenage girl like you see in Hollywood films. She's attractive but bland, like her female best friend, Nyla (played by Celeste O'Connor). Her male best friend, Josh (played by Misher Osherovich) is gay and sassy and is the most interesting of the three of them. He comes up with some of the meta humour and sociological observations in the film.Freaky is not a film that takes itself seriously but that being said, it does its mocking with a straight face. Vince Vaughn perhaps best exemplifies that. Playing a teenage girl, he is almost subtle with it. He doesn't over-egg the pudding of his performance. In fact, there is a really 'interesting' scene with his character in the back seat of a car with a teenage boy who Millie has a crush on. The two actors in this scene must know how absurd the film is at this point but they bravely push on. Vince could quite possibly earn an Academy Award for Best Actor just for this scene!I don't know if there are plans for any sequels to this film, turning it into a franchise. That being said, if they do plan sequels, I'd be surprised if they surprised me with what direction they wanted to take things. I've seen the first few Friday the 13th films and I've casually read about some of the further sequels its spawned. It's hard to imagine any sequels to Freaky breaking new ground, whatever direction they wanted to take things. On the topic of being predictable and I don't mean this in a negative sense, I could tell what was going to happen at the climax of a scene where Millie is trying to regain her body from the serial killer. I feel pleased with myself for having being able to recall the scene which presaged that moment. Maybe I should rewatch that scene though to make sure that it makes sense and there are no plot holes in it.Before I forget, there must be some dark wish-fulfilment occurring in this film. I don't have a degree in English Literature, so I can't posit in detailed terms Freudian notions of transference or whatever but I do have to observe that the choice of murder victims is well set up and you could theorise notions of dark desires, displacement, transference or schizophrenia in these choices. To be more transparent about what I'm saying, I'm suggesting that these are the kind of everyday choices that ordinary people might fantasise about after a bad experience with someone.Lastly, I do have to mention some plot holes...or just self-aware absurdities created for the film. Firstly, the first murder committed by the serial killer in their new guise...and what, exactly, was that device doing in a high school changing room? Secondly, how, exactly, was the serial killer able to continue on, after the 'resolution' to the body swap issue after they'd been......with regards to that second plot hole, that pretty much seems a bog standard scenario for those slasher films where the killer is like the ones in Friday the 13th and Halloween.Oh, the score for the end credits reminded me of the theme from the film Jaws."}, {"id": 206, "text": "Blum House has successfully refreshed the horror genre several times with good ideas and more irreverent tone. The recent box office success like Happy Death Day, its follow up or Invisible Man shows that you still get good mileage of the classics with some imagination. Freaky is basically a version of Freaky Friday but this time the body exchange is between a very insecure and shy student and a violent serial killer. The prologue of the movie is quite promising for slasher films fans. Four young persons are killed in very violent way. The killer gets away with a sacrificial dagger by mistake with some magic characteristics. Vince Vaughn is the killer and is really terrifying in those first scenes. Then enters Kathryn Newton; the shy adolescent who after a failed attempt by the psycho swaps bodies with the killer. Sounds interesting ? And funny ?. Well it really is; and Vaughn is excellent as the killer and is even better and lots of fun as the adolescent girl. Sadly Newton is not near as convincing and/or good in any of the parts. The rest of the cast is decent but cliched. The gay and the black friend, the controlling mother, the school bullies, etc. While the first four death are fine, set setup and the middle of the movie lags with unnecessary sentimental dialogs and stupid actions/decisions. The third act and epilogue recover the pace; but you keep waiting for more deaths and / or more comedy or perhaps both. In brief; entertaining but not as fun as Happy Death Day"}, {"id": 207, "text": "I guessed I enjoyed Freaky more than I was supposed to. And that's mostly due to Vince Vaughn, who rises above the mundane script, adding little comedic touches of his own. Otherwise, this is a straightforward teen slasher that comes bundled with its modern clichés. Vince Vaughn is an actor who has played tougher roles of late (especially in the Craig S Zahler films), but one who hasn't forgotten what he's incredibly good at. He plays serial killer 'The Butcher' (à la Jason Voorhees, minus the texture) who switches bodies with a reserved 17-year-old high-schooler named Millie (Kathryn Newton).Millie's backstory is a complete 'seen-that-before', replete with a dead dad angle, a cop sister and a mostly drunk but caring mother. Her friends, one black and the other gay, round up the character sketches. Things only get interesting when Millie and The Butcher switch bodies. For more than half the film, Vince plays a teenage girl and generates the loudest laughs. Newton, on the other hand, doesn't have much to do except alternating between foxy and vicious. So, this clearly isn't her film (performance-wise) though she's compensated with some pretty fun kill-scenes.This is as good a throwback teen slasher as it can get - nonsensical, entertaining, and downright gory. However, Freaky also feels like this toned down high-school romance hiding quietly under its slasher layers. Yes, there are jarring tonal disparities but if there's one thing holding it all together, it's the sheer delight of seeing Vince prance around like a teenager. Also, Vince's version of Millie is a lot more buoyant and chatty. I'd say this is a good thing even if it slightly messes with film's continuity. The extended climax is what made me cut half a star because it felt completely unnecessary. Nonetheless, you'll certainly be entertained by most of what Freaky has to offer."}, {"id": 208, "text": "If I'm being honest I was expecting another Disney type PG13 horror version of the classic body swap movies. Wrong! Four people die brutally before the opening credits roll on Freaky. There is genuine horror on the screen that might make you squirm and look away. Like all good horror movies it mixes both the terror with comedy and a self awareness that's been apparent in this genre since the 90's. Blumhouse have produced some of the scariest movies of this century and now you can add this slasher. Try if you will to picture 6 footer Vince Vaughan as a teenage girl in the backseat of a car kissing her boyfriend. OK too scary. Vince puts in an outstanding performance as The Blissfield Butcher and its not the first time we've seen his scary or effeminate side. Who remembers the remake of Psycho? Kathryn Newton stands her ground brilliantly leaping from bullied schoolgirl to deranged serial killer. Freaky is a mash of Halloween, Carrie&amp; Friday the 13th plus a few other classic fright movies get a nod in this comedy, horror, thriller. Congrats Director Christopher Landon on landing on this winning formula. In cinemas now, but not for much longer, so if you want to see something scary before the avalanche of Christmas movies....giddy on up."}, {"id": 209, "text": "Although it may not be totally original, Freaky is an absolute blast, combining both horror and comedy geniously, as well as having many solid performances. First off, Vince Vaughn is fantastic in this film, in both parts. He provides a hilarious depiction of his female co-star, as well as proving to be an interesting and frightening killer. He is by far the films standout, and although the other actors are rather good as well, there is no doubt that Vaugn certainly had more to work with, there for more to do. It's a nice, fun change of pace from the typical oh so serious horror films we have received recently, an is truly entertaining all throughout. The beginning is a bit average, nothing too special, but I found myself kind of amazed at how well this plot worked in this film, and how well it was executed. The kills are creative and gruesome, the cinematography is often excellent, and the music is often rather fun as well- if not a bit expected. In the end, Freaky is a creepy little delight, that proves to be rather funny, as well as somewhat thrilling to watch at times. It has familiar moments, weaker moments, but it's a delightfully eccentric twist that is executed properly and very well. Certainly one I would be willing to watch again. My Rating: 9.5/10"}, {"id": 210, "text": "REVIEW - FREAKYWhat do you get if you cross, Halloween, Happy Death Day, Big.You get this slasher / horror / comedy, sound good?Actually the slasher theme isn't too bad with a very sick in the head killer walking around killing people for fun in some nasty ways, both as a male and female, yes read on.The comedy element for me was just not funny especially as Vince Vaughn is literally camping it up.Ok now to the nitty gritty, basically the killers mind gets transferred into a teenage girls body and visa versa, so the teenage girl is running around looking like the killer and the killer has become the teenage girl by the power of a magic dagger.I know this is just the start of the sillyness there is more to come in the film.One very interesting part was the whole concept of male and female and how each treat each other also throwing in a gay character, I actually found this more interesting in places than the film itself.Such a shame because this could and should have been a lot more than we got, it's basically a light hearted teen smashed but it could have dropped the whole comedy and concentrated on sexuality, gender stereotypes and slasher elements then this could have been an epic movie which for me was just lost.Ok to watch if you find it on TV.Rating 6 out of 10"}, {"id": 211, "text": "Centered on director-driven productions that are low-budget and made fast, Blumhouse productions share similar values in the vein of Roger Corman productions, which give their films an old school efficiency to them.In the case of Freaky, the script gets straight to the point. In the beginning horror movie section, the film practically holds a clipboard and just proceeds to check everything off before you get to say hello, That's our villain. That's the girl. That's her problem. This is her family and their recent tragedy. These are her friends. Happy Death Day director Christopher Landon executed in an intentionally cheesy self-aware meta fashion. Vince Vaughn's serial killer wears an Incan mask that resembles Jason Voorhees. The tongue-in-cheekiness is intentionally cheesy and funny at times, other times it is just cheesy and formula.At the point of the body switch, the genre shifts to being a straight-up situation comedy. The irony and the jokes are in place but they are not tight enough nor pushing its clever premise far enough to get maximum laughs. Vince Vaughn is hilarious playing out the body swap gag but isn't given enough to do because he is always hurried along to the next scene. I laughed a few times but didn't leave with a full stomach of seeing Vince Vaughn acting like a high school girl.Originally titled Freaky Friday the 13th, which is actually a better title, the film never tonally reconciles the meta-horror and the Freaky Friday family comedy elements together. At times, when Millie as Vince Vaughn is running around the high school with her friends searching for the killer while hiding from the adults, it feels like a Goosebumps movie. When there are brutal killings, it is R-rated graphic to an extent of where I feel like I am supposed to laugh at the violence. I can't quite give an R-rated dark comedic belly laugh at a brutal killing cause of the PG-13 nature embedded into the context.If director Christopher Landon said the point was to have both the PG-13 and R-rated elements together, I would say fine, but the script and the jokes have to be clever enough to make that meta tone consistent. It is as if the speed of how fast they made this movie has compromised the potential of its own premise. There is a great premise here. I do think the humor and the tone could have been drafted some more and chisel the dialogue.I know there's a better version of this that could have been made."}, {"id": 212, "text": "Being 40+ one of my biggest fun slasher movie was Scream at the theatre in 1996. I can also add Urban Legend and I Know What You Did Last Summer. This is almost kind of like a wannabe Scream for todays kids. And I get it, it's fun, has some good kills and it is with and about teenagers. If I were 16 being at the theatre with my friends messing around, I would love this, I think.It's not at all a bad movie, it's just the wrong decade, or even millennium, for me. I had my teenager slasher moment back in the day. I will admit that Vince did a really good job here. I had to laugh here and there.If I should compare it to some other movies, it would be a mashup with Scream, Child's Play and Friday The 13th and maybe a bit of Trading Places, with Eddie Murphy. That should almost cover all the bases. I will admit, it was quite fun at times.I liked Happy Death Day 1 &amp; 2 better, with the complication of time and space.I can't go higher than 6.5/10 on this. But hey, you could have more fun than me!"}, {"id": 213, "text": "This is pretty good. A few laughs, an interesting concept, good acting, and overall a good watch. But this could have been a lot better, and it is not nearly as funny as 'happy death day'.The negatives: First of all Kathryn Newton is gorgeous, sexy and pretty far from being a weirdo hanging out with losers and playing an undesirable girl. It is impossible to buy into that premiss. She also looks like her age i.e. 23yo, so not really high school. The writing and directing is also a bit off. They could have made this more creepy, less peppy, and darker but still put in a couple of better jokes, but they did not. I also think they should have taken the concept a bit further and had the killer in Millie's body explore the sexual bits more. The writing about Millie's family with a dead husband, how they act towards each other, who they are, and what they do is all very generic, very boring, very lazy writing. I suppose that was sort of the point, but it does not work. And finally, with better writing, better directing, and perhaps a few changes to characters they should have also draged it out a bit more and really hammer in the creepy-ness and stalking feel of normal slasher movies. Due to the above this almost feels pretentious, almost too much of here we are! We are twisting the slasher genre and we want you to laugh and this is a great movie! - vibe from this.With that said, and almost contradictory to what I just said, this movie also don't take itself too serious. This is gory, but also creative. This is fun and good watch. I just wish they put in a little bit more effort into making the movie and it would have been great.The good stuff is about the actors - they all do a great job. The premiss of Freaky Friday with a slasher twist is fun and interesting. Kathryn is very good as a killer, perhaps she has found her calling? Set design and music is used very well and there are a lot of fun good moments.I really recommend this, especially if you have nothing else to watch. I give this a 7/10, a pretty weak 7 though, but I had fun watching this and I love the idea. The movie is sadly not as funny and great as it wants to be, but this is still a very good watch. Check it out!"}, {"id": 214, "text": "Freaky is a fun horror-comedy where you don't have to think too hard and can sit back and enjoy the ride. It has all the gore someone would want in a slasher flick with some creative kills filled with cartoonish reactions. It mashes the genres up in a fun and interesting way while staying completely true to itself.From Director Christopher Landon, Freaky is a fun-filled blood galore. While not perfect, it's still a great entertainer joined together by amazing performances and a decent script. Both the horror and comedic aspects of the film are established well with graphic kills and actual moments of suspense while the characters, especially the leads, react to the absurdity of the situation. The main thing I didn't like was that not too much backstory is given for the killers origins or the ancient knife responsible for the body swap. It's a bit cartoonish as well and that works both in favor and against it at moments. For example, the lead is a despised girl who is constantly bullied in school because she doesn't look like other girls. One day, she ties her hair, puts on a leather coat together with red lipstick, and now she a hot chick who grabs everyone's attention. Though, those are minor things that do not drag down the immensely fun and well-crafted story.Acting-wise, Vince Vaughn is just too good in both his characters and so is Kathryn Newton. They both completely own their characters. Though, as mentioned previously, the lack of development with Vince Vaughn's character is a major drawback. Celeste O'Connor is good as Nyla and so is Misha Osherovich as Josh (Millie's friends). The rest of the cast also do the required decent enough job.A major asset of the film is the brilliantly executed set-pieces when it comes to killing. The Cinematography by Lorie Rose is also decent though it had some lighting issues. The Production Design team also did a decent job in creating the high school set up together with the aftermath's of the killings even if it had to look cartoonish in some instances. Another asset was the Editing which showed great pace in build-up to the story carried all the way to the finish, though, as mentioned before, it could not pick up the exclusion of The Butcher's or the knives back story. The music from Bear McCreary was disappointing, though, as it never gave you the chills of a horror-comedy.Overall, Freaky is surprisingly a really good film filled with a fun rollercoaster of events and thrilling kills. Vince Vaughn and Kathryn Newton both play their roles excellently, and it could not have been as good without them. It's really recommended. Please Hollywood make more mindless (not dumb), entertaining, movies."}, {"id": 215, "text": "Mashing up genres and recalling mean teen cinema's finest moments, Freaky delivers a fun new take on the slasher, but fails to embed itself as anything more.Millie gets attacked one night by mythical madman, The Blissfield Butcher, while waiting to be picked up from school. She survives the attack but wakes up the next morning in his room of horrors, and he wakes up in what looks exactly like his idea of a room of horrors (Pitch Perfect posters, cutesy pajamas and a mum that just made banana french toast). Millie finds power in being a hulking monster of a man, and the Butcher finds it much easier to lure kids to their death (though, frustratingly, with the strength of a 17 year old girl who is not an athlete). Unlike the film it apes most of its material from, not many lessons are learned and so the film has to rely on its hyper gory kill scenes and cast chemistry to do the heavy lifting.The main attraction here is Vince Vaughan. Having disappeared from mainstream cinema for a while, he's back in fine action as both a sadistic killer of horny teens and as a shy, nice girl. Any scene that lets him (as Millie) rediscover her new body is just hilarious. Unfortunately, for Kathryne Newton, the job is much harder. She has to play both the shy, nice girl, and the hulking masked killer, without the mask. The latter is never consistent enough despite some times being funny and menacing. This is probably because the Butcher is not at all defined before the swap, so Newton has to create a new character within a new character, and stick to it.The film has to juggle its existence as a genre flick while also working within the confines of both a Teen coming of age/ school sucks frame. Unfortunately, it doesn't succeed fully to find interesting angles, and, while direction is tight, there's some inconsistencies in the delivery of so many references. Still, it is worth the watch, for Vaughn alone, and I can't wait to see how any sequels will play out!"}, {"id": 216, "text": "🔪 FREAKY (2020) REVIEW🔰 Streaming : Amazon Prime (US)If you have a liking for slasher flicks, then freaky will definitely quench your thirst in that genre. Freaky is fast paced , humourous, with relatively good horror scenes and crazy characters which keep you glued till the end. Slasher comedies doesn't bother your brains to exercise much rather gives you the adrenaline rush if you just want to enjoy a movie as a concept. Please keep logic out of the context while watching this one and sure you will have a great experience.The Movie is wildly entertaining with some great performances by Vince Vaughn and Kathryn Newton . Both understand the genre and give a fine performance.As a teenage slasher flick it is filled with humour and horror moments for you and your family with a Tub of Popcorn to enjoy over a weekend. With a 102 min run time , you never get bored with this body swap episode. Director Christopher Landon has done a good job with the screenplay making it fast paced which elevates a fun and engaging movie experience.🔰 PG : Swearing + Slasher Blood Scenes + No Nudity✅ Overall, Freaky is a familiar but fun riff on the classic body swap concept , makes you terrified, laugh and gives you a decent enjoyable movie Experience.Rating : 7/10Ritesh Mohapatra (Odisha)"}], "reviews_amount": 217}