{"name": "The Forty-Year-Old Version", "titleId": "tt10642834", "reviews": [{"id": 0, "text": "Wow, am I really leaving the first review? This movie made me laugh (a lot, lots of giggles) and made me think. On a universal level, there are so few movies that address the humor and pains of being 40 (The 30 yos get all the fun) so, anyone who is about to turn 40 will find something to relate to in this movie. But on another level, it made me think about what being a black female playwright and poet is like (I'm a white dude), and did so in a way that made me laugh and feel uncomfortable at the same time. That's a rare quality and I feel like a better human being today for it. So, in short - LOVED IT."}, {"id": 1, "text": "When I first saw this advertised I thought oh wow a refreshing comedy tackling some interesting concepts.Sure there parts which are touching, funny and insightful but I was left with a sense of disappointment. There were characters who could done with more substance to them and development in the story as a whole. And the chance to developer her art form further was a change that was missed. It could of taken the movie in a refreshing direction.Overall it worth a watch as it does address some genuine and authentic life experiences."}, {"id": 2, "text": "This movie is absolutely fantastic. It may be 2 hours long but it felt like 1 hour 20. Charming and amusing from start to finish. Really good comedic acting, great direction, full of brilliant one liners and if this was the 90s I'd be buying that OST on cd. 100% a must watch."}, {"id": 3, "text": "I wonder why this movie has been rated so highly everywhere, because it is unwatchable. Most of the characters act inauthentic like they are caricatures and not people, and each one of rap compositions, whether of Radha's or from a (supposedly inspiring) rap battle, is so mediocre, it's a source of great annoyance. The protagonist has nil potential as a writer and is so horrible at spitting rhymes that you'd hate her face (even if you weren't raised that way), and yet everyone involved in the making of this film, playing a character in the film, or rating the film highly is treating it as an underdog artist story. At the risk of sounding insensitive, has everyone lost their senses to COVID? Finally, what's with the white-and-black format? Did they rip it off of Manhattan or Roma to pretend that they're in that league?"}, {"id": 4, "text": "The film industry has given audiences of cop shows a dump truck load of profanity over the past four decades, but the coarse language of high school children in this black and white indy film is somewhat shocking. I haven't been in high school for many years, but, if I were teaching, the language would be cleaner. Or the students would have to go somewhere else to vent,The music is great, and the camera work is exceptional.The acting isn't good, and the script is flat. I would not recommend this film to anyone. Comedy is hard, and this film did not make me laugh."}, {"id": 5, "text": "As a 70-year-old white guy I got to say: wasn't too sure this would be my cup of tea. So glad I saw a high meta score and gave it a shot. It covered so much ground. The star and the supporting cast were fabulous. great humor. Enjoy the movie !!"}, {"id": 6, "text": "This film start with a woman Radha listening to her next door's copulate voice, and she watching TV scene! As turnout, this film is about Radha while struggle with her playwright career, dreaming to become a rap star! Entire film full of boring conversation, and super annoying overuse scene! Such as, overuse of the switching left to right angle scene, overuse of the interview of the neighborhood scene, overuse of the imagination picture scene, and overuse of the smoking weeds scene! Make the film unwatchable! Barely intense scene is, Elaine and Rosa fighting with each other! Barely laughable scene is, Radha forget the lyric she rapping, while knowing Archie watching she performing! At the end, after attending her playwright opening night, Radha back to accompany D! Still have two post credit scene! The homeless guy yelling at the old lady to shut up, and Radha rapping on the stage! That's it! Another disappointed film!"}, {"id": 7, "text": "Forty year old version was somewhat dissapointment to me,i just coudnt find any character that was actually likeable or symphatic and because of that i wasnt invested in a story as i wanted when i started to watch this film.Story wasnt nothing great or brilliant but in a first and second act it still had captivating touch around it,but as we were going towards third one everything was starting to become stale and tiresome.I mean who wants to hear a middle aged woman complaining all the time that she is 40 and that she didnt become what she wanted,also im not a good rap expert but honestly she wasnt even that good in such staff,this film was in end a let down in a way"}, {"id": 8, "text": "This is a mildly interesting movie about a woman trying to reach her ambitious goals before middle age. The struggle of the character is the typical one of mid life frustration that everyone goes through in their own way between forty and fifty. As an artist, the protagonist seems to want to be famous more than she wants to produce great art and this is demonstrated by her willingness to use any form or style that might bring her popularity. There are some funny scenes, but overall I didn't find this movie especially deep or insightful."}, {"id": 9, "text": "What i hate already from the get go is how you took the title from a real comedy movie 40 year old virgin. I consider that not clever but cheap and uninspired."}, {"id": 10, "text": "This story sounded promising, but I found it a let-down. The central character is a playwright who was much-praised in her youth, winning awards, and at nearly forty has a fulfilling teaching job. She is nevertheless resentful because she lacks the success that eludes most writers and because she is ageing at the normal rate. She complains about this in rap as well as in other forms of communication, and she blames society for the fact that she is not recognized as the genius she believes herself to be. Based on the writing skills displayed in the rap, the audience will have to take her word for it. A lot of depictions of middle aged women show them as whiny and pathetic, and sadly that's the case here."}, {"id": 11, "text": "Probably the Roma Oscar lead to the decision. It makes the movie more impressive ? I don't know. It's a good production for a 40 yo woman story. Is it the black white cuz the lighting can be cut?"}, {"id": 12, "text": "A dramatic comedy with rap. It is about a woman of almost 40 years old who in the twilight of her failure as a playwright tries to enter the world of rap. The photography is spectacular. In black and white. The address is good. Quality. Entertaining It stays almost all the time, only in two or three lapses it becomes slow. Due to its duration at times it can be a bit overwhelming. The verses are at the moment. Good performances. It talks about how sometimes fears hold us back, how we passively live without experiencing those talents we think we have or what we can exploit. How sometimes you have to sell your talent for pennies to eat. Explorative. Light sexual jokes and others not so much, as well as situations, sarcasm and intelligent comedy. Try to be profound without being pedantic. The problem is that inside everything it becomes hackneyed by how they try to put a little romance in it. An extraordinary option if you like smart movies or rap."}, {"id": 13, "text": "Dang, Radha Blank slays in this movie about a black woman playwright trying to keep her voice and be a success. It made me think about so many of my friends in decades past -- talented black women playwrights, directors and actors who made brilliant work but weren't heard or known on a large scale. This movie speaks for all of them. It speaks to me, as an aging creative person. Watch it for the sharp dialogue, compelling characters and joy of seeing a talented black woman saying her truth."}, {"id": 14, "text": "This is what cinema is about, I don't want say too much other than this movie is gonna make you feel whole again! I went in blind you should too"}, {"id": 15, "text": "I wonder how many people will miss out on this phenomenal movie just by over analyzing the title and film still. Great cast! Great writing! Great Cinematography! Main character (Radha Blank) will have you laughing and cheering for her at the same Time!"}, {"id": 16, "text": "This movie utilized a bunch of visual and audio differences to impact the watcher. Starting with the shooting in black and white, then leading us to believe this was a movie about an up and coming Broadway play, to only find out she was a drama teacher in a urban school. It took a moment to figure out exactly who this person was! Little sarcasms and witty punchlines kept a smile will keep a smile on your face, as the viewer goes through the circumstances of her life, starting with the bus scene, the school scene, the gay friend/manager who believes in her. Only to find that her dreams with the Broadway play are dashed by the nemesis Broadway producer. So what does she do? She grungily considers her play being done in a small community theatre. (seems a logical sequence) however, she has an epiphany and decides to make a rap record?!?? Really?... So now, the viewer doesn't know where this movie is taking us, but the wit &amp; humor of it all continues and you'll be itching to find out where this journey will take you. Thus, a change of scenery, and we leave the light of day to the dark apartment of a weed smoked, hip hop recording session. One minute she's listening to the music and the next moment she's waking up from sleep and told she would have to leave. For anyone who doesn't know anything about hip hop culture and it's process of making a cultural record, this is a glimpse of that world. This movie takes the viewer deep into hip hop culture, with the experience of the cypher and the Queen of The Ring battles."}, {"id": 17, "text": "Excellent performances and a theme that crosses racial lines"}, {"id": 18, "text": "Radha's this is forty rap was about my life! Loved this film! Magical. I'm sure more creative artists can relate to this than one would think.comforted me."}, {"id": 19, "text": "The story lies from the east coast to the west coast,the final point is sundance."}, {"id": 20, "text": "This movie felt like it was intricately woven into the fabric of my being. It felt like my story. Blank airs out every piece of dirty laundry in the mind of a black woman and does so uniquely, genuinely and unapologetically. This movie is a true inspiration and deals with the beauty in the struggle of self-acceptance and the confusions of Life, death and staying true to who you are. This movie felt like it was made for me instead of in spite of me. Thank you."}, {"id": 21, "text": "Well written movie with original and fully realized characters. The writer-director has done an amazing job in her first feature. Very similar to spike lee movies but in a good way. Also a realistic and compelling depiction of New York. Was a great movie!!"}, {"id": 22, "text": "What a great movie and Radha is amazing. Watch out world! Thanks to Netflix for recommending it."}, {"id": 23, "text": "What a cute movie, despite our common age, in vodas they differ in terms of protagonism and accomplishment, I am realized, but not always the protagonist, Radha is always the protagonist, but does not feel fulfilled, and we both get a brand new 20-something little , kkkk, I love it ... I loved the approach, that almost informal thing, camera in hand, dialogues full of messages, reflections and comic strips, interrupted by photographs and memories, (would they be real?!?!), but it is to be proud of, woman , black, non-standard, directing, scripting and acting, all masterfully, a real pride..."}, {"id": 24, "text": "The movie was such a pleasant surprise. The script more towards intependent European films, it evoced a mixture of feelings, it was funny and often hilarious, embarrassing moments occured that had me off the sofa and some sadness inbetween. It felt authentic and honest. I got the feeling that Radha showed her true self, as far as you can in a movie with actors. Very courageous. I must mention that this is one of the first movies I watch were African Americans dont steriotype their characters to get laughs (as I live in Europe I mostly get box-office hits in theaters so maybe I only have a limited experience). I am looking forward to see more of Radhas work. (Typos and grammar is due to english being my third language)."}, {"id": 25, "text": "Beautiful, funny, interesting, surprising and cool 😎"}, {"id": 26, "text": "Radha's direction feels like jazz; sharp, delightful, calm, dazzling at the same time while she let us see her, hilariously both true and exaggerated, world through a sincere, always honest and deeply intimate lens. Lens in which she puts herself in not just physically but emotionally and personally giving to this semi autobyographycal story a soul and a heart."}, {"id": 27, "text": "Starring, writing, producing and directing her own film, taking full control of her own project, just shows how much of a powerhouse Radha Blank really is. The Forty Year Old Version is extremely clever and an instant favourite. A star is born!"}, {"id": 28, "text": "Excellent movie from beginning to end, the only thing I can complain is the fact the music is not on the internet to listen because aside from a great filmmaker she's an amazing mc, excellent movie, stop reading this and go and watch it."}, {"id": 29, "text": "I've never written a movie review, but this movie rocked my World, so I had to. It is hilarious, in such an original way! The humour feels grounded, based on real, nuanced characters, relatable situations, and points of view that I have never seen portrayed on screen before. I loved the characters, they all feel like real people with personalities and lives of their own. The movie shows healthy and supportive relationships, as well as toxic relationships, and the struggles we all go through to manage them. The movie explores deep questions of artistic expression, race, gender, age... All in an engaging and natural way. Afterwards I felt like I had grown as a person AND had a great time. It's such a different movie than anything else I've ever watched, it deserves to get more attention. And it's on NETFLIX. So no excuses, go watch it now!"}, {"id": 30, "text": "I think I'm in love with this movie! If you were a an art kid of the 90s, you'll love it. If you don't even remember the 90s but may have struggled as an artist, you'll love it. If you are anyone who appreciates a complicated, awkward, hilarious, and beautiful human experience, you will love it!"}, {"id": 31, "text": "Radha, a screenwriter in her 40's, living day by day, without anything significant in her career, sees in rap music a way to rediscover herself, under the name RadhaMUSPrime.A dramatic comedy that does its job: makes you laugh, and also reflect and think about life, at different moments.The narrative is based on the feeling that currently many pre-adults/adults tend to think over and over again, which is their role in society, in the form of professional fulfillment, and on a personal level, like will I be remembered as a good person? while struggling with inner demons.The sarcasm used is well applied, and stands out in the characters who use it.The black and white photography makes sense, as we are being guided to the end of the film and we see the bigger picture.The social critic, about gentrification and the shallow and hypocrite social support by the upper classes in a pretentious way is one of my favorite parts."}, {"id": 32, "text": "Radka is a playwright who has somewhat fallen from grace since her first success and as she approaches 40 is having a sort of mid-life crisis - what is she about? What's it all for? How can she become fulfilled? Well - indefatigable, she goes about setting herself up as a rapper and it becomes quite clear to D - the young base track layer that she has some skill at it. He even presuades her to do a live gig so perhaps her rather hum-drum, routine, existence might be about to change for the better... ? Well, simultaneously her agent Archie (Peter Kim) is trying to get the rather seedy, gay casting-couch merchant J Whitman (Reed Birney) to produce her play and the film juggles her rapping and writing aspirations set against her day-job teaching a disparate bunch of students with attitude and talent - but both need to be controlled! At it's best, this is great - the rapping is potent and poetic; the comedy can be funny - if somewhat predictable; and she is an engaging and likeable character. It is, however, far too long and auteur Blank struggles to maintain the pace and focus of the film for much of what just turns out to be a fairly ordinary tale of a single woman trying to recalibrate. I enjoyed it, but it really could have been doing with a more objective hand at the helm."}, {"id": 33, "text": "GRADE: B-THIS FILM IS RECOMMENDED.IN BRIEF: A flawed but intriguing look at an artist's journey.JIM'S REVIEW: Artists are often told to make art based on what you know and that sage advice is exactly what Radha Blank did in her autobiographical indie debut entitled The Forty-Year-Old Version. This engaging comedy, filmed mostly in b&amp;w and on a the smallest of budgets, depicts an artist's journey with many interesting characters and stops along the way.Ms. Blank directs, writes, and stars here, making an impressive triple-threat debut. She plays Radha, a struggling playwright unable to find success she drifts into the world of hiphop, her real passion. A 30 year-old prodigy, Radha has gone nowhere in these past ten years, except for her teaching job which helps to pay the bills. As she wrestles with self-doubt and depression, her latest artistic project improbably gets green-lighted for Broadway. This contrived plot device leads her and moviegoers to this question: Will the artist stay true to her own vision or sell out? It's a fictitious version of herself and any artist's on-going dilemma. Ms. Blank uses her real life experiences and unique talents to convey those two conflicting worlds quite effectively.As an actress, she is a commanding screen presence with some droll comic timing. Her screenplay creates an authentic world, one step from poverty and living off the gritty streets of Harlem. Her dialog has sparks of insight and wit. However, her depiction of her Caucasian characters in the film is slightly offensive though humorous. There is a a reverse Uncle Tomism subtly on display as these white stereotype characters become mere bobbleheads, walking cliches of ineptitude and silliness who are out of touch with the world and more concerned about their white privilege. In her directorial debut, Ms. Blank establishes her narrative well, but lets too many scenes go on past their expiration date, including a rap smackdown sequences that honors the craft but adds little to the story. The movie felt padded with too much attention to atmosphere and not enough on the plot structure. A shorter film version itself or more judicious editing by the filmmaker could have made the movie have greater impact.Peter Kim as her gay friend/agent Archie and Oswin Benjamin as D, her rapper friend and muse, provide strong support as does Reed Birney as J. Whitman, in a thankless role as the pompous producer of her play.The Forty-Year-Old Version is as crude and raw as its profane language and liberal use of n-words, but there is much to say and hear from a promising and gifted artist. One looks forward to her next project."}, {"id": 34, "text": "I very much enjoyed this movie. The female lead, who also wrote and directed the movie, tells a funny if sad story of a middle-aged black playwright who cannot get her works produced until she finally agrees to sell out and rewrite one of her works to make it conform to the East Side white liberal view of what Harlem must be like. (Imagine the world of New York East Side pseudo-intellectuals that Woody Allen has been lampooning for decades.) Her compromised play succeeds - with an audience of white East Side intellectuals - and then she has to decide where to go from there.There are wonderful scenes in this movie. There were others that didn't hold me.I wish more time could have been devoted to how the original play was changed/compromised during rehearsals.Still, I definitely recommend this movie."}, {"id": 35, "text": "If you liked: BirdmanThe Forty-Year-Old Version is a 2020 black-and-white dramedy about the mid-life crisis and artistic struggles of an African-American playwrite, Rhada Blank. This is her actual name, she is the lead actress, director and scriptwriter; and the film is a dramatized version of her own experiences to achieve artistic fulfillment. The whole time as I am writing this I feel that I am not qualified or informed enough to do so; but it is a film I want to share, so go easy on me.Rhada is approaching forty, it's been 10 years since she wrote anything that has been recognized (or paid her rent), and her mother passed about a month ago; all this goes on to fuel her insecurity and doubt about her life-accomplishments and her future. This crisis pushes her to explore new possibilities, as she decides to try herself out as a rapper, simultaneously signing a contract to write a Hollywood-friendly Harlem play.Now, the plot sounds a bit boring and ridiculous, and it is ridiculous but not boring. First of all, it's a hilarious sarcastic comedy. It even seemed a little pretentious at the very beginning because of the amount of sarcasm, but you quickly pick up on it and laugh your booty out for the rest of the film. The amount of sarcasm is so overwhelming, it almost seems like a parody of a comedy if that makes sense, which gives the film it's very own style. The dramatic messages are also quite powerful; it's the first time I recognized the rude, raw, cruel self-reproach in somebody's rap lyrics which made sense; spitting harsh truths as you call it. Her play is being heavily edited, and she obviously doesn't like both this and herself, for allowing such a thing. She is torn between feeling like a complete artistic pushover without a real voice, and justifying it as simple survival during hard times. All that mixed emotion is mirrored in her music. This movie doesn't follow the usual narrative of suddenly experiencing great success against all odds. It is more interested in the little details and is all the better for it.The message is clear: don't be conformist to what anyone thinks true or write. Say only what you know is true. One word of truth shall outweigh the whole world. Find your own vision. Fill your own void. Find your own voice. I recommend this to anyone who has some kind of artistic aspiration, and to anyone that wants to broaden their film outlook."}, {"id": 36, "text": "I don't know where to start with this movie. I loved it so so much that I've watched it twice now, back to back. I told my husband, my 26 year old son (he raps and makes beats so I know he will appreciate it), a few friends and a cousin about it and insisted that they too watch this wonderful film. By the way, this is a film, not a move, a film. I never really paid enough attention to recognize the difference, but seeing this film, helped to clarify the difference for me.I related to Rhada on a level like no other. I'm a forty eight year old black woman, who's been married for 26 years and have five children. I'm going through some things...kids getting older, marriage breaking down, and me coming into myself. This movie though, it changed me, and with a quickness. Today my husband said you're carrying yourself differently, my kids kept starring at me and I'm sure wondering what's up with mom. Nothing my dear loves, mommy just feels like she's got this ageing thing, this life thing. Because after having watched this film, I feel like I do! I loved EVERYTHING about it. The acting, the chemistry and the flow gave it a vibe that most movies these days are missing.Rahada if you read this review, gurl, you knocked it out the park! Thank you, from the bottom of my heart, you changed how I see myself and my future. Also thanks a lot, now I'm looking at the younger brotha's like hmmmmm, LOL.I really do thank you for creating this film, it has truly been a blessing, and came to me at the right time. Like a previous reviewer stated, that they feel like a better human being today for having seen this film, well so do I and we owe that to you and your fabulous cast. xoxox to you all!In closing, do yourself a favor, and watch this delightful, uplifting and life changing FILM, you will be a better human being for it!"}, {"id": 37, "text": "Incredibly funny, sweet and uplifting; The Forty Year Old Version proves that Radha Blank has a long cinematic career ahead of her.In this comedy, an unlucky playwright desperate for a breakthrough before she turns 40, reinvents herself as a rapper to find her true voice.Thoroughly original, personal and heartfelt; this film offers everything you'd love to see in a filmmaking debut. Radha Blank is an absolute QUEEN and it will be tough for someone to dethrone her. I thought the film brought up great cultural points that will have you speaking about them after the movie is done. A true New York City movie that pays homage to its glory. These are films that I love and wish we had more of. Definitely one of the better films to come out of 2020. It may be shot in black and white, but damn this flick will make you happy. You can stream The Forty-Year-Old Version on Netflix.Follow @snobmedia for more reviews!"}, {"id": 38, "text": "As director, writer, and star of The Forty-Year-Old Version, Rahda Blank creates a powerful amalgam of creative energy and anguish. On the one hand her drama quietly fuses the artistic aspirations of an emerging Black artist with the realities of cultural and fiscal mandates (like paying the rent) that a Broadway play attaches to itself; on the other hand, is plain old turning 40!Her play within this film, Harlem Ave, would have been a frenetic tale of joy and sorrow for Blacks emerging from underprivileged circumstances to successful artistry in their own Harlem hood (think a young Spike Lee). Yet, the reality is it will turn out not like that in part because the white producer, Josh Whitman (Reed Birney), forces on her his cultural poverty-porn and happy ending tropes without the benign tensions that cultural differences bring to the creative process. Finding her voice is a struggle given the strong forces against her.The ending is concerned with the misfit between reality and fantasy, the Black experience, and the white dream of harmony. Radha's connection with D (Oswin Benjamin) is a refreshing bit of old-fashioned romance amidst the not so glamorous artist's life.The rest of the film deals with white dictates because it focuses on Radha's own dream of either writing her play and compromising her integrity or switching over to a career in hip-hop. In that way, the film is a sobering commentary on the challenges of mounting a play in any place, any time, or any color.Radha's teaching drama technique to young teens has perhaps the richest meaning for Radha and her film: It allows her to show her considerable talent to draw out the best in her students and in herself. Although teaching is not her passion, it ironically shows her best, more than playwrighting or hip-hop could ever do.Although in real life Radha Blank has written for Netflix's She's Gotta Have It and Fox's Empire, in The Forty-Year-Old Version she reflects her brooding dreams of a much bigger struggle. Given her charisma and remarkable wit, Radha is bound to make it very big as she almost does in this almost-autobiography of her talented rise."}, {"id": 39, "text": "Sometimes there are films that come along that are surprising in how unassuming and effortless they are. This weekend a great indie comedy from a star-in-the-making, Radha Blank, is just that type of movie premiered on Netflix. It is called The Forty-Year-Old Version, and it was written, directed and stars Blank.Although The Forty-Year-Old Version is her first feature film, Blank know exactly what this movie is about and how best to present it. She should since she has her hand in each pot and it seems autobiographical as well. In the film, Blank plays a character named Radha, who was once a promising, up-and-coming playwright in New York but her career has stalled, and now she's knocking on forty. Radha struggles to get her plays produced and otherwise makes her rent by teaching a rowdy group of high school students about theater. One night, Radha unlocks what's been stifling her creatively by spitting some raw rhymes and she decides she going to be a forty-year-old woman making a mixtape - seriously.What is evident is that Blank knows New York and loves her corner of the city. Shot in black and white, the film has a feel of early Spike Lee. There is so much attitude and just cool, bravado that bursts through the screen. Blank portrays all of the funny moments well and there's emotional depth too as she deals with getting older, loss and self-doubt. Some of the best scenes are when Radha is freestyling with a lot of gusto and wit. The themes that flow through about artistic vision, taking chances, and the temptation to compromise are handled well and make this funny film poignant.I have a minor quibble about one subplot that I feel is unnecessary. I don't begrudge it in the movie and I won't spoil it here. If it is cut from the film, it would only be about 5 minutes, so it's not that distracting and doesn't ultimately detract from the enjoyment of the whole.There is no reason not to watch The Forty-Year-Old Version. Get your box of popcorn and start this film now."}], "reviews_amount": 40}