{"name": "The Life Ahead", "titleId": "tt10627584", "reviews": [{"id": 0, "text": "Sophia Loren at 86 has returned to us along with her Co-Star Ibrahima Gueye in her son's film. Though the film is a re-make and the story rather predictable, what is not is the performance of these two actors. The cast is good, but the leads are on a different level. And their final scenes together are deeply moving. I have never seen Ms Loren more touching and filled with grace, nor a 12-year-old boy more beautiful and talented. Sophia has given us a gift in both the film and this young actor whose future is so brilliant."}, {"id": 1, "text": "The movie is an emotional tour de force, taking the audience through the trials of age, loss, loneliness, tragedy, respect, religion, friendship, and life.Sophia Loren is captivating and she's surrounded by a strong, supporting cast."}, {"id": 2, "text": "An Italian drama. It is about a Muslim immigrant boy in the street who is taken to live with a retired prostitute who was a victim of the holocaust, making the meeting a moment of reflection in their lives. Quality. Raw Timeless Slightly parsimonious. Talk about love, empathy, charity, about belonging somewhere. About how hard life is for orphans and also for migrants, prompting them to do anything to survive. It even also shows how human beings sometimes live with fear and fear of being hurt that is why we put a huge barrier to others. The performances at the level. And it shows that, life itself. If you like dramas you will enjoy it. A drama that shows that the only thing a person sometimes needs is attention and love."}, {"id": 3, "text": "What a movie! Sophia Loren comes back from retirement to deliver an amazing performance... Gueye manages to make u remember the cruel reality where we live: immigrants, prostitutes, trans, abandoned children... From the performances, photography... it's entirely worth to watch it... ah! This is not a happy meal box, it's a real piece of art... And Laura Pausini's song... oh! she does deserve an Oscar for that... suggestion... watch it Italian with subtitles in your language... you will miss a lot with the translations..."}, {"id": 4, "text": "There are two major problems with this film. First, it basically ignores all the reasons why the original story was so strong. Secondly, it has to compete with the original film version (La Vie Devant Soi - called Madam Rosa in the English title) - starring Simone Signoret.The first big error is in changing the focus of the story. Yes, it is still told from Momo's point of view (sort of) - but it has suddenly made Momo a problem child and incipient hoodlum - which was not part of the original story I don't believe - and instead of simply a kid who had been left with Madame Rosa, he is suddenly a thief who improbably has to be put in her care in the most unbelievable way.These changes mean that the story is no longer about a kid learning from the life around him but rather a fight between good and evil within him - which was not at all part of the original. All is angst - where as the original story is humorous and philosophical and filled with the lessons of discovery. Instead of true understanding and growth, this film depends more on stock clichés. Madame Rosa's children are of all backgrounds and religions, and in the original story she insists on making sure that each child remains true to his own religion and culture. This is done out of respect for the individual children, but is not at all made clear in the new version. Yes, Mme Rosa has a tattoo on her arm and mentions Auschwitz, but we get absolutely no sense of her being attached at all to her Jewishness. The audience is supposed to understand what all this means, but she doesn't explain any of it to Momo -and this is the real problem with the film. There are no convincing diaologues between them that don't simply sound preachy. Everything is surface - nothing seems to be deeply rooted in anything except facile melodrama.Finally, there is Sophia Loren, who I have always liked in the past, but who somehow seems to be sleepwalking through most of this part. Everything is underplayed, as if she is counting on her reputation rather than her talent to pull this one off. She is supposed to be an aging , physically exhausted older prostitute, but we get no indication of age or pain in her body. Anyone remembering Simone Signoret's Madame Rosa (for which she won an Oscar) realizes how much more Signoret inhabited the character - making us feel like every movement and every breath was an effort. She was far more believable than Loren, who still gives the impression for most of it of being in far too good shape physically. Even the script is illogical about this; she excuses herself and two minutes later the two others go looking for her. She is eventually found in an orchard which is so vast that she would have had to be a marathon runner to have reached the point where they find her in the time allotted... yet she is supposed to be barely able to walk. Yes, she keeps lapsing into catatonia - but we get the impression she is going into Alzheimer's instead of being physically enfeebled by a bad heart. In the end, the IDEA of this story is better than the execution. A huge disappointment - much of which should be placed at the feet of Loren's son, who directed and co-wrote the script - making unnecessary changes which allowed for simplification instead of depth. All those who have been raving about how touching this film and Loren's acting are have obviously not seen the original film or read the book it was based on. If they had, they too would be less enthralled. This version would almost certainly never have gotten off the ground without the Loren/Ponti names behind it."}, {"id": 5, "text": "I checked on this movie after reading an article on NYT about Ms. Sophia Loren - an exemplary actress. I wasn't prepared for how emotional this movie will make me. I bawled several times while watching and it actually made me contemplate my latter years. Phenomenal acting by all (Madam Rosa, Momo, Lola ). I'll remember this movie for years to come. Please watch it in Italian then subtitle in your language . You won't regret it !!"}, {"id": 6, "text": "This film was heart wrenching and heart fulfilling at the same time. The story is superb and the acting is phenomenal! It could easily be nominated and win an Oscar. I urge you to watch this! The mother/son acting/directing duo of Sophia Loren &amp; Edoardo Ponti creates such a beautiful dynamic for this film to take you where it wants you to go"}, {"id": 7, "text": "An old ill ex prostitute and holocaust survivor after several dramatic situations bond with a young orphan immigrant whose present is poied between loneliness and delinquency. Doesn't it seems too much? Yes and it really is. Too much for one movie and definitely too much for Edoardo Ponti to handle. His direction struggles to deal with this amount of themes and it eventually shows his inexperience. Every character is artificial, every dialog is contrived and every scenes is forced, pushed harder and harder trying, almost desperately, to move the audience, to manipulate their emotions. Yes manipulate, Ponti doesn't try to move with his ability to direct and shoot but by dramatic situations stacked one above the other and hastily connected, by a rigid editing, exploiting the reality behind them. Even the acting, even Sophia Loren's (and this really hurts to say), are mediocre."}, {"id": 8, "text": "It was an indescribable joy to watch the great star who became more and more beautiful like wine over the years. I just revere..."}, {"id": 9, "text": "With veiled meanings, stories not entirely explained on purpose, but brought to light with ingenuity, so The Life Ahead manages to establish itself as one of the best films by Edoardo Ponti and the glorious Sophia Loren, son and mother. For anyone who knows Sophia Loren (impossible), they know that she's a guarantee and a pleasure to see on screen; woman with a unique charisma, the representation of a Naples that was, representation of the diva and the humble, woman of the people and of the dreamers, art made woman, cinema made woman, once again manages to enchant in her so simple speeches, but so effective. Ibrahima Gueye, an amazing revelation, who manages, despite his debut, to act as a coachman for a tough film (by theme) to carry on. A motivated, incisive and clear Edoardo Ponti, with a warm and simple direction (not always in-depth and scrupulous), but perfect for representing a story of depth, thus bringing life not only to the story, but giving images to a novel that is already spectacular in itself."}, {"id": 10, "text": "Both actors did a great job. An Italian emotional drama, but with the right dosis humor."}, {"id": 11, "text": "What a beautiful story! Incredible acting from all of the cast especially the main characters Momo (Ibrahima Gueye) and Madame Rosa (Sofia Loren). It shows the importance to have compassion for the misfits, the ones who are already written off. I loved the diversity, this simply shows that love and friendships have no age, skin color, religion, social status and so on. It's all about human-connection. Thank you for this sad yet uplifting scenario. A true masterpiece."}, {"id": 12, "text": "Filme LINDO com a Sophia Loren que está soberba, como sempre. O garoto também é incrível. Tem cenas lindíssimas e emocionantes (talvez ainda mais pra quem tem tantas saudades como eu). Super recomendo. The life ahead BEAUTIFUL movie with Sophia Loren who is superb, as always. The boy is also incredible. It has beautiful and moving scenes (maybe even more for those who miss someone as much as I do). I highly recommend it.#movieslover #netflix #sophialoren"}, {"id": 13, "text": "You got to watch it! The movie deals with many critical themes one of them is racism. It makes you understand that the real meaning of life is the life itself despite skin color, religion or age. Without mentioning the fact that Sophia Loren is the main character"}, {"id": 14, "text": "Sophia Loren never ceases to amaze me with the range she has in her genius as an actress. Even when she is typecast into the roles of fallen women within these limits she plumbs the depths of existence and endows us with expansive vistas... but here is a film where she opens up even more questions to the lived existence. What a supremely generous &amp; deft performance of the strength &amp; fragility that awaits those lucky enough to survive to old age. Her co-stars, especially the superb Ibrahima Gueye are equally impressive &amp; form a lovable contemporary family in new senses of what is normal, yet defeating what prejudice might expect. Utterly loved it."}, {"id": 15, "text": "It's precisely when you give up hope that good things happen.Both Mimi and Madame Rosa have gone through so much pain. Most of the characters were outcasts. Momo, the orphan and protagonist who learns to grow as a person though understanding Madame Rosa. Madame Rosa the Aushwitz survivor who is living as a migrant in Italy. Iosif, who never gave up hope on his mother coming back for him. Lola, the transgender woman who exudes femininity and warm hearted energy through caring about Madame Rosa and the children she takes care of.I cried so much when Momo snuck Rosa out of the hospital and took her to her safe place, her refuge. When the police were looking for her and she was reliving her trauma of hiding, Momo was there to comfort her and relive her fear and pain. This made me cry so much.Also, when he was crying that Iosif left that made me very sad because he lied to Iosif saying he wouldn't miss him. Momo holds in a lot of his feelings and for him to let them out when no one around is looking made me learn a part of myself that does the same. Madame Rosa came along after and comforted him.Iosif showed the power of hope, faith and prayer. He did not lose faith or trust in his own belief which was inspiring. He had empathy for Madame Rosa and prayed for her. He was an angel in the film, keeping hope in times of uncertainty where one could easily feel lost and give up.Overall, it made me very emotional but there was also parts of the film that I didn't care much for."}, {"id": 16, "text": "Wasn't put off by the English dubbing which I assume is done by the original actors. Great to see Sophia Loren again too.."}, {"id": 17, "text": "Yes, as some have said, the characters' backgrounds were thin but you really didn't need to know more because it is really abut their interactions in the present. Every single one of the actors was right on. And each character added a layer to the life of Momo. We see how a seemingly irredeemable child can turn into a loving one with the love and attention of all those around him.The song during the credits was also beautiful and it fit the movie perfectly."}, {"id": 18, "text": "Beautiful story, extraordinary acting from the young Ibrahima Gueye.. Sophia Loren was incredible. Definitely worthy of Oscar nominations for both actors here.Outstanding!!"}, {"id": 19, "text": "The Life Ahead was a good return of legend Sophia Loren and it was nice to see her once again on the big screen but this entire film could be far better if it had some interesting story that would occupied me far better then this one did.Well story wasnt something completly awful but i had some bigger expectections from it but still it was fine for a one time watch.Characters werent so interesting but i didnt cared about such staff to much and more focused on great acting from Loren and young lead kid who give very good performance.The Life A head was a good one time watch"}, {"id": 20, "text": "If you're looking for a movie that shows you the beautiful side of humanity or just want an escape from the madness of reality, then you should definitely give this film a watch. Sophia Loren and Ibrahima Gueye are fantastic and will bring you to tears; the rest of the cast do a wonderful job as well. It's the tale of two characters whose initial meeting isn't the best, but in time discover that they have more in common than they think. With that description, you think you know what to expect, but the story is executed in a way that makes it stand out. Perhaps it's the acting and the connection you both see and feel between Madame Rosa and young Momo that help this film turn a fairly common story into something fresh and all it's own. I was moved to tears for a couple of scenes and I was not expecting to cry at all. I hope this film gets nominated as it's one of (if not the only) a few masterpieces that have come out this year. So glad I watched this beautiful film."}, {"id": 21, "text": "The eagerly awaited performance from Sofia Loren, was ruined for me by Netflix, dubbing the film with American accents. Why do they think audiences don't have the intelligence to read sub titles. Not hearing her speak in Neopolitan was a shame. Well acted but flawed"}, {"id": 22, "text": "A very good swan song for Sophia Loren. Directed by her son Edoardo Ponti, she plays a holocaust survivor who takes on an orphan boy who is destined to have a life full of failures. The film works with a specific and common formular, which doesnt make it less appealing. From the first moment you can identify with the characters and care for them. Sophia Loren is fantastic. Its actually more of a supporting role to be honest, but every scene she is in she is absolutely electrifying. The grande dame of Italy probably will say good bye with this film and she couldn't have chose a better one. Wouldn't be surprised if she make some appearance at this years Oscar race if the film is handled well by Netflix. A similar fantastic performance comes from Ibrahima Gueye who is simply fantastic as the orphan kid. Such a natural, appealing and beautiful performance I haven't seen in a long time by a kid actor. The two play off each other just brilliantly. Another good performance came from Abril Zamora. Its really a nice feel good film, nicely executed. Worth to see."}, {"id": 23, "text": "I thought it was a very well done movie. Very emotional... I think Sophia Loren's performance was wonderful."}, {"id": 24, "text": "Bad direction and terrible narration, the movie forgets of very important elements. The movie is predictable, and the only good point of the movie is the good development of the relationships between the characters."}, {"id": 25, "text": "What a shame to have Sophia Loren play in a film that didn't layer her or utilize her incredible acting chops. I seriously thought this film was about the unique relationship between the boy and Sophia's character. Well at least this is what they sold us in the trailer. The film never stays with them. Instead the boy is pulled in all directions that sadly took away from the heart of the film. Sophia's character never really teaches him anything. They never truly grow to know one another. Her dementia comes too quickly, by then the film is only about that and not about them. The dementia should have come in the last 30 minutes of the film. The moment he saw her in the hospital, is the moment the dementia should have hit the story. That would have shocked the audience and no one would have seen it coming. Even the little boy. If they built a beautiful friendship, and in the hospital all of a sudden she didn't know who the little boy was, would have been a huge tear jerker moment. Very powerful. Also aligns with the little boy's past that everyone comes and goes.It's almost like the writer/director couldn't figure out what he should focus on. The film didn't lend heavily into the humanity of the piece. Then there is a transgender who seriously looks like he is about to laugh in every scene. Why is he there? He adds nothing to the story but to dance, walk in heels, and help find Sophia when she's lost. Just not deep enough.Sophia Loren is magnetic. You can't take your eyes off of her, but probably being her son directed this and he's been looking at her his whole life, he can't see the power of her presence. Sadly the film was hurt by his lens on his mother. And The Life Ahead falls flat and short of any awards in my opinion. But I can already see the reviews are not so honest in ripping apart. Or how mediocre the film really is."}, {"id": 26, "text": "This is a movie that runs like a Fairy Tale. It is totally predictable and completely illogical. The focus is that of a feel good experience but to expect viewers to believe that all the actions carried out by a child were possible....it's just asking too much! The film has all the components of an Italian production.....a lot of drama and crying! Loren's acting is impeccable and believable but not even that could rescue a weak and improbable script of pure fantasy!"}, {"id": 27, "text": "While 'The Life Ahead' refrains from fully exploring the potential issues that arise in the story with its simplistic plot and sentimental nature, director Edoardo Ponti provides a beautiful story of respect, understanding and love between unlikely mother and son. A snapshot of an unexpected friendship born of mutual pain. Sophia Lauren shines in a charismatic role and effortlessly creates a strong presence whose rugged exterior slowly evaporates to reveal vulnerability born of trauma."}, {"id": 28, "text": "Loved this! It was a simply beautiful experience. So great to see Sophia again. The main actor was astounding. As we're all the supporting roles.So glad I found this"}, {"id": 29, "text": "This is a beautiful film full of heart. Excellent acting from the leads , Sophia Loren is still such a brilliant actress in this her swan song."}, {"id": 30, "text": "The movie itself is a masterpiece. I didn't expect such a beautiful movie from Netflix. It showed the meaning of love, affection and family. This movie is an Oscar worthy. The ending got me real hard. It's a slow paced film but trust me you're gonna love every single second of it. The acting was very well done. The color components of the film was bright and sunny which I really liked. This movie deserves recognition. Some movies really hit you hard and makes you realize things and this was one of them. I am thankful that I watched this movie. And the direction was also well made. Definitely would recommend you to watch it."}, {"id": 31, "text": "The Life Ahead, directed by its star Sophia Loren's son, Edoardo Ponti, is a heartfelt film about love, friendship, being wanted and feeling needed. 86 year old Screen Icon Sophia Loren is sublime as Madame Rosa, a Jewish-Italian Holocaust survivor, retired former prostitute, who takes in and looks after the children of prostitutes and kids who are orphaned. One of these orphans is Momo, wonderfully portrayed by 14 year old actor Ibrahima Gueye. Momo is a Muslim immigrant from Senegal, now living in Italy, who survives by selling drugs and stealing from people in the streets. After swiping a purse and pair of candlesticks off Madame Rosa, Momo is sent to live with her to get off the streets and rehabilitate. An unlikely match, Momo and Rosa grow on each other and soon develop a bond of mutual support, friendship and love. An Oscar-nomination worthy performance from Sophia Loren; a real and beautiful performance from young Ibrahima."}, {"id": 32, "text": "This is a remake of the French film Madame Rosa from 1977. Many details have been changed to adapt to life today: for example the Algerian orphan in Madame Rosa is a Senegalese orphan in The Life Ahead. And in the later version the boy sells drugs to make money while in the 1977 version he does puppet shows. These changes don't really change the story, though, which is very touching. Sophia Loren's character is a strong elderly woman who survived Auschwitz and life as a prostitute and now she takes care of children of prostitutes. Her best friend is a beautiful transgender woman. She takes in the Senegalese child reluctantly because the child had just robbed her, and life on his own had made him a handful."}, {"id": 33, "text": "Such a good Italian Style Dram story. Amazed on how good Sophia still looks and so good to see her perform again. Loved the funny moments as well as the dramatic ones. Full of flavour.Incredible performance by Ibrahima, had to hold back the tears in quite a few moments.The end of the movie develops quite fast and maybe it would have been nicer to see more of relationship and back story of the 2 main characters. Wish the movie was longer but prob it was all down to $Hopeing to see some Oscar nomination"}, {"id": 34, "text": "It's a simple story about complicated lives. It never judges the characters who all live at the fringes. It never rushes the story along . It simply does a beautiful job at giving you a glimpse into these lives. And let's the viewer decide what is right and what is wrong.Sophia Loren is so poignantly cast; her face alone emotes and moves the story along. Abril Zomara almost steals the whole movie and is a joy to watch.There is a particular scene where Momo holds Madam Rosa hand and the shot zooms in. I have to say it one of the most moving things I have ever seen in movies. In that one moment you have young and old, Hebrew and Muslim, man and woman, black and white. All inexorably bound together - United in their struggle. Her remembering her youth in Auschwitz and him trying to survive his own youth.It just feels so very genuine to me. And with a cost of only 8!This is what filmmaking is about.I loved it."}, {"id": 35, "text": "If you don't get misty eyed watching this film then you missed the point. Great acting and cinematography. The people rating this low need to re-examine their souls."}, {"id": 36, "text": "A true to life story with deep meanings. Great performances by Sofia Loren and the kid"}, {"id": 37, "text": "What a pleasure it was to see Sofia Loren in this marvelous role. Thank you director Ponti for casting your mother in the role of Madame Rosa. truly wonderful performances from Sofia Loren and her enormously talanted costar."}, {"id": 38, "text": "I will preface my review by saying that I read all the hype before seeing the movie and, perhaps I would have enjoyed the movie more if I had watched it without expectations. If Sophia Loren was not in the film, I doubt that it would garner the attention that it has. The relationship between the main characters (Momo, Madame Rosa) was rushed and inorganic. Sometimes less is more and in this case, too many themes led to a superficial exploration of the characters and the pacing of the film appeared forced. I wanted to believe in the bond between Momo and Madame Rosa, but I didn't. Not a criticism for the actors, but for the writers and director."}, {"id": 39, "text": "The movie is missing to deliver the poverty life of the characters and the hate and love relation between Momo and Rosa created in the novel."}, {"id": 40, "text": "Both main casts shine in this otherwise somewhat above average drama. Other casts did a good job too.The portrayal is realistic without being overly melodramatic. Scripting and story could be tightened and paced better to really bring out the sap to bring it from good to very good.Recommended - especially if you get to see this current aged Sophia and her spunky youthful outings in 'Scandal in Sorrento' and 'The Sign of Venus' back-to-back all on Netflix."}, {"id": 41, "text": "I wish that this was a movie I was hoping to see. All actors were great, but it was like the movie cut out some important scenes. I think that they didn't make a good connection between the main characters. I expected to feel all the emotions through the movie, but I couldn't feel anything but a little bit of boredom. I was asking myself how he could be attached to Sophia so quickly and see her as his protector when nothing special happened between them. I am disappointed that such a good story didn't turn out into a beautiful movie."}, {"id": 42, "text": "Loren is superb as usual. This may be considered her last movie and her will. I hope she can earn a well deserved Oscar nomination for this role."}, {"id": 43, "text": "Oscar missed an opportunity in 2018 when he failed to honor Zain Al Rafeea with a nomination as Actor in a leading role for his portrayal of Zain in Nadine Labaki's Capernaum. Here's the opportunity to make up for that major miss: Ibrahima Gueye as MoMo. This child oozes sincerity, joy, anger, hope, and love--whatever the script necessitated--and the camera loves him. The onscreen chemistry between this young unknown actor and the legendary Sophia Loren is palpable and mesmerizing! The settings are exquisite. The story, if somewhat predictable, remains thoughtful and poignant. The score by the incomparable Gabriel Yared (Betty Blue!!!) pulls everything together. I loved this film and hope that this is not the last we see of its two leading actors!"}, {"id": 44, "text": "Based on a novel by Romain Gary, this film is a confrontation between a kindly ex prostitute Mme Rosa (Loren) who takes in the children of prostitutes, and a young African child Momo (Ibrahima Gueye). The confrontation plays out in the Italian seaside town of Bari, where Momo crashed into Rosa's life by stealing her bag at the market. Rosa takes him in as a favour to the local priest. Wary distrust and open confrontation give way to understanding as Momo realises that Rosa is as traumatised as he by her past... This film, in the hands of Loren's son Eduardo Ponti, shows this great actress at the height of her powers, elegant and dignified, bearing the magnificent traces of her age like proud battle scars. And newcomer Ibrahima Gueye is astonishing, carrying the film along with his youthful energy and a wisdom beyond his years. This child is a born actor. It's beautifully photographed and efforts should be made to watch this on the largest screen possible - please no smartphones or tablets. A truly beautiful film."}, {"id": 45, "text": "While I was watching the film, I found that the core of it was the relationship between an old woman and an orphan boy, two age groups that humans are most vulnerable. The boy was an excellent actor who changed his facial expressions showing us all sides of him good bad wicked angry surprised emotional. Sophia Loren was as always perfect. A nice story , hope is when you think you have reached the bottom"}, {"id": 46, "text": "Just to note that I watched this on Netflix, and didn't have the issue with dubbing as it was subtitled with Italian dialogue. I don't know why some people thought American dubbing was the only option? Thoroughly enjoyed it all."}, {"id": 47, "text": "I liked the movie but not as much as I wanted to. The story is interesting but not emotional enough. I didn't feel the connection between the two leads, it was kind of rushed."}, {"id": 48, "text": "The test of a good film is how authentic it is ; how well it comes across, the emotional force of the film delivered by the players in it and the script make for a memorable film and one that tugs at your own emotions. Comparing it to so much other 'Netflix Fare' this film stands apart. Ibrahima Gueye , in the lead role role of Momo , a child orphan and refugee delivers the performance of a lifetime and he probably isn't even a teen ager yet. To see him in this film, that alone makes it worth watching and there is even more to recommend the film."}, {"id": 49, "text": "Beautiful done and acted. It was a great pleasure to see again the great actress who is Sofia Loren. In addition, in my opinion, the rest of the cast and crew were as outstanding, all contributing to bring to live a more complex story than it seems at first look. I read a criticism that this movie is a remake. So what? There are lots of remakes our days, it just helps us not to forget beautiful stories and also to facilitate sharing them with the new generations. Well done Netflix."}, {"id": 50, "text": "I became aware of the film because of Sophia Loren and only watched it for this reason. Normally, Italian realism doesn't suit me very well, but I was curious. You don't have to tell much about the content, such or similar stories already exist, of course, but how a friendship develops out of the very patient old lady Madame Rosa and the young Senegalese Momo is well told, but above all it is played very credibly. And the still unknown Ibrahima Gueye might still make a name for himself. Sophia Loren is, of course, a rock and manages with little means to draw a character that is always credible, human and comprehensible. That is her great art."}, {"id": 51, "text": "The dubbing of the dialogue is flat and totally take away from the emotional content of the film. It ruined the whole experience Keeping the original Italian with subtitles would have made a far superior experience Too bad because Sophia Loren's performance was excellent"}, {"id": 52, "text": "Phenomenal. Sofia Loren is fabulous. The young actor that plays Momo is unbelievably talented for such a young man. The whole cast is fantastic and each character brings the story together to create a masterpiece. The use of the Italian scenery is amazing. The angle of a street view, the use of natural light, it's breathtaking. One of the final scenes in the basement (ties into the opening scene) took my breath away and brought me to tears. If you can appreciate art, emotion and loyalty then watch this movie. You'll enjoy it immensely."}, {"id": 53, "text": "Amazing story and acting, but I think the background stories of the main characters was totally missing. I would have loved to see some more details..."}, {"id": 54, "text": "A remake of the movie 'La vie devant soi' (1977) with Simon Signoret as Madame Rosa, but now in a more modern setting. Finally, another film after so many years with the diva Sophia Loren, now a bit stiff, but just as graceful with her short dance, played her role with flair. The little, somewhat bitter crook, Momo (Ibrahima Gueye) played superbly. Strange, after being away from the silver screen for 10 years, another film with La Loren. Hopefully not her last! The director is Sophia Lorens' son Edoardo Ponti who did an excellent job. Worth watching!"}, {"id": 55, "text": "Perfecto. Very beautiful movie. She is a great actress. You have to watch this movie"}, {"id": 56, "text": "Great Movie a bit predictable but the two leads did some amazing acting and truly a touching story."}, {"id": 57, "text": "The story hits no doubt a very actual problem of the integration of all young refugees around the world. Here the hotspot is Italy and shows two little boys and an adopting mother played by the great Sophia Loren. I don't spoil other details here just watch it. It's lovely done and was never boring. Everybody made a good job especially the boy Momo. 8/10"}, {"id": 58, "text": "A real-life film, without big devices, without big fuss, a mirror of what our society was and is and a crucial alert to what matters most, the human being. Bravo!"}, {"id": 59, "text": "This is the very beautiful story, done with beautiful cinematography and good cast. Great benefits to Sofie Loren but also great start for young and talented Ibrahima Gueye. My rating is 10! Bravo to Edoardo Poni and all crew!!!!"}, {"id": 60, "text": "The film in itself is brilliant and the acting amazing. So, as a film freak, I have to give it a 10. Nevertheless, I'm also an avid reader and having read the book which is one of the most moving ones I've ever read, I was deeply disappointed as this film misses out on the most important points: Madame Rosa has been looking after Momo since he was a baby. Momo (Mohamed) is a North African Muslim and Madame Rosa is Jewish. The core of the book is that's it's a lesson in tolerance, as she brings him up as a Muslim. In this new film, Momo is Senegalese. Another crucial thing that is missing is that in the original story, Momo's father comes to look for him to take him away and Madame Rosa tells him he is not his son, that he is Jewish and that his name is Moses. So, if you've read the book or seen the original fillm with Simone Signoret, you will be disappointed."}, {"id": 61, "text": "Engrossing, great characters, historical and emotional context. Wonderful actors and a perfect role for Sofia Loren, a testament to her acting talent without the distraction of sex appeal. A reminder of how honest love can heal the trauma of xenophobia."}, {"id": 62, "text": "I was really excited to watch this as it really seemed like the type of film i love. I was unfortunately a little disappointed.The movie looks great and it made me want to visit this gorgeous seaside town. Every scene has this warm, golden glow from the sun, it looks so good.The acting is also great too, both leads did a great job. I think they really help keep this film afloat because it has a mixture of different problems that weigh it down.I can't exactly put into words what it was missing but it just didn't fully click. It was a little bit surface level and i wanted to really get to know these characters and really feel the happiness and sadness that they feel. I didn't feel much of a connection between the two main characters. I wish they had jus done a little more to show us them bonding.I also think the score and soundtrack is really here, there and everywhere. It really effected the film for me and took me out of it. Some parts where subtle and melancholy but then it has these really modern songs blasting out and sometimes a different score playing that just seemed really out of place. I guess i wanted more of the sad, moody score.I think that describes what i wanted from the whole movie to be honest. I just wanted more emotions, more sadness, more happiness. Don't get me wrong the ending is pretty sad but i just think it would have had such a bigger pay off with more emotions before hand.I would definitely give it a watch as it looks great and the acting is as well. I don't know it just didn't click the way i was hoping it would."}, {"id": 63, "text": "The Life Ahead will capture your heart while modeling what an ideal world would look like if we could all understand each other and get along.What better way to show your mother love than to direct her in likely her final film performance,. The Life Ahead IMHO is her most befitting role as Earth Mother. Sophia Loren is so beautifully moving and astounding in a role that was created back in 1978's French film Madame Rosa with the legendary Simone Signoret. Signoret's interpretation of Rosa earned her accolades across the world's film communities.It being 2020 the year of COVID, and the festival circuits are either virtual or all together cancelled, the star spotlight will be very different for actors whom deserve to shine. With this film it is truly tragic that the film community will miss out on the stunning presence of Miss Loren. At 86 Miss Loren is not the true lead in the film, but it is Ibrahima Gueye, who at 14 whom plays a street tough whom Rosa takes into her care. These two performances make a very simple film into a fitting tribute to love and the resiliency of the two leads characters.I will say if the Academy was truly worthy of its accolades after giving Parasite the best film honors, it will honor both stars with statuettes come this winter in Hollywood. Loren is truly spectacular to behold as a once great beauty and the mother and caretaker of the children of the women of the night, as she slowly succumbs to the ravages of dementia. In her scenes of her withdraws Lorens facial expressions and those eyes tell of a back story we only can imagine from her faded numbers on her left forearm. With the arrival of Momo ( Gueye) Rosa's life begins to become more fulfilling again, and the two start off as adversaries, and the end their love is truly etched in each other's hearts.NETFLIX has possibly one of the contentions for this years Best Picture Nominations with this ( as well as Mank) and hopefully a son's gift of Oscar to Miss Loren's heartbreaking performance that will easily be compared to her first Oscar win in Two Women. It may be an Oscar win as well for 14 year old Gueye in a magnificent turn as the street tough Momo who allows the kindness of Rosa to value his life ahead."}, {"id": 64, "text": "I hate to say this but I wish Netflix would stop making remakes of brilliant films from the past. The 1977 version of this, MADAME ROSA was winner of an Oscar as Best Foreign Film and the performance of Simone Signoret was outstanding and also won various awards.Sad to say Sophia Loren was a brilliant actress in her day but in this film it is obvious she is failing fast, now 86. Most of the film she spends sitting or lying dow, resting against other people and against walls. She should now retire gracefully.I was desperate to see what year this was set in but the only notice I saw of this was 1981 across the back of Momo's Shirt. This film was so badly dubbed into English. I can't understand why other reviewers here have rated it so high. Obviously they never saw the original.Surely it is time Netflix reviewed it production system as it has had so many disasters lately namely. THE CROWN, REBECCA, HAUNTING OF BLY HOUSE (Turn of the Screw) and also Haunting of Hill House.Very disappointing."}, {"id": 65, "text": "This film hit Netflix lately and I have now watched the Italian film The Life Ahead and here is my review for it. The premise of the film sees a Holocaust survivor take in a 12 year old boy who robbed her.Main Character Sophia Loren is a legend of the film business, with almost 100 credits to her name in a 70 year long career and this is her first project in 6 years and she is really good here. Her character is strong and has so much heart to her, her story arc is really emotional and you see why she looks after this child due to her own personal grief. You will care about her character and you will care about her and the story she has with the young boy Mo.Supporting Cast This film doesn't have a very big cast but everybody does good jobs in their small roles, but the standout is 12 year old boy Ibrahima Gueye who plays Mo and is a great young performance. You see how him and Loren need each other and how both of them coming into each others lives really affects them and makes them both better people and they do a great job of conveying that.Story The story is a nice tale about how two completely different people can come into each others lives and affect it to make them both better and it achieves it well enough. It is a heart-warming tale that does its job well, but I mean it doesn't do that much to really stand out and push to the next level, it is a nice film but not a story that will stick with you for a long time.Script The script is fine, some nice dramatic moments and nice charming bits of dialogue but similar to the plot, none of it will be very memorable and stand out but a nice enough written film.Style The style does an effective job in showing the relationship between the two leading characters and using there time pretty effectively as it is only 90 mins long. But then maybe we could have done with a bit more time to have some elements of the story expanded and make us truly care but it doesn't.Overall Overall, this is a pretty simple film to review, it is just a nice charming film that won't exactly stick with you. If you have ninety minutes and are fine with subtitles then The Life Ahead is worth a watch at some point."}, {"id": 66, "text": "I was prompted to watch this movie by people that had watched it and told me I should not miss it.When I read the credits and I learned that the movie was based in a book by Romain Gary I told myself nothing can go wrong. Well, I was wrong. The screen-play is terrible. It fails to provide any support for the story that develops in the film.The movie is well filmed and well acted. What can you expect if Sophia Loren is on the movie!Nice photography too. Unfortunately the screen-play is not up to the job and then it is difficult to sustain how the story develops. As a result nothing is credible. Too bad!This is un update of my review. I was curious about what was missing in the movie. So I read the book by Romain Gary. Romain Gary's original story has nothing to do with this movie and it made plain clear to me why it fails to provide any support for the story that develops in the film. The movie not even present key scenes from the book. It is not easy, I recognize, to adapt a book that was written using a child language, because this is what the book does. But if you are willing to have an idea I recommend you to watch Madame Rosa. It is the original movie with Simone Signoret. You will see the difference. It is available on YouTube."}, {"id": 67, "text": "Nothing more to say, it is enough to see the list of actors who filmed with her to know that she is a living myth and deserves an Oscar, without a doubt: Clark Gable, Charles Chaplin ,Frank Sinatra,Marlon Brando,Cary Grant,Burt Lancaster, John Wayne,Charlton Heston, William Holden,Robert Taylor,Jean Gavin,Richard Burton, Gregory Peck, Paul Newman,Peter Sellers, Peter Ustinov,Anthony Quinn,Peter O'toole, Omar Sharif,Alan Ladd, Charles Boyer,Víctor Mature,Peter Finch, Trevor Howard,George Peppard,David Niven, Maximilian Schell,Stephen Boyd,Steve Forrest ,Tab Hunter,Michel Piccoli,Robert Wagner,Jean Pier Aumont,Jean Paul Belmondo,Giancarlo Giannini,Christopher Plummer, Anthony Perkins,Maurice Chevallier, Gerard Depardieu,Klaus María Brandauer, Alec Guinness,Philippe Noiret, Marcelo Mastroianni,Jack Lemmon,Alberto Sordi,Walter Matthau, James Mason,Tim Robbins, Vittorio de Sica,Daniel Day Lewis,Robert Loggia,John Turturro,James Coburn,Yves Montand,Anthony Franciosa,David Doyle,Elli Wallach,Rossano Brazzi,John Cassavets, Vittorio Gassman,Robert Vaughn,George Kennedy,Richard Harris,Martín Sheen,Adriano Celentano,Raf Vallone etc etc..."}, {"id": 68, "text": "Being a film buff and fan I just don't know how I've missed most all of the work from the legendary Sophia Loren however I just caught this touching emotional drama of unlikely friendship and love. The Life Ahead has Loren(still glowing at 86) as a Holocaust survivor and ex prostitute and now Madame Rosa who runs a daycare house center by taking in the kids of local sex workers. Things get shook up some when she encounters again and full circle takes in an orphaned Senegalese immigrant Momo(the fire bug Ibrahima Gueye). The film spans thru the lives of both after war torn times in seaside Italy as both grow they have their dramas and differences while each earns an understanding and they develop tough love underneath for one another.The film explores the themes of honesty and truth and time and circumstances brings it all out Loren's performance is top notch as her vocal tone and facial expressions are dead on and tough as her character is one haunted lady the rain storm scene on the rooftop is telling with flashback memories. Rosa slowly fades as Momo still earns a buck and gets by as a tough street and smart ass kid. Thru it all love is developed by both learning kindness and honesty in a raw way. Overall well done film that connects and touches emotions proving that bonding helps with choices and the future that lies ahead."}, {"id": 69, "text": "This is a magical tribute to one of the most important actresses of all time, Sophia Loren, who holds the screen like no one before or since -- she is a force of nature. To add to this, the young man played by the boy actor, Ibrahima Gueye, somehow holds his own, and presents Sophia with the only other option that she can riff on, a young child who needs her love and compassion.The entire film is a tour-de-force, holding one's attention even in the most difficult moments. In the simplistic summary of the plot, the boy, a feral animal, is left abandoned and orphaned and is unable to accept the care of an adult -- until Madam Rosa, played by Loren, reluctantly takes him in, mainly because she will make a few extra bucks. Madame Rosa, a former hooker, now subsists on receiving a tiny income from the care of unwanted children from young hookers.The fact that Rosa is able to maintain a state of dignity in spite of the desperate straits that she is forced to accept, makes her something of a saint. The boy, at first unable to appreciate what she has to offer, eventually comes to an understanding. The other great role is the transgender actress Abril Zamora, who is a former fighter and now a transgender prostitute, who presents us with a character that defies all stereotypes: she is all fight while still maintaining her femininity, and projects a deep fragility underneath a steely exterior.The entire project is a work of art by Sophia's son Edoardo Ponti, son of Carlo Ponti, the greatest of all Italian Producers, who's mark was left on such classics as Contempt, Doctor Zhivago, Blow-Up and LaStrada, and well over 160 other major films. This film is nothing less than a class act and should take its rightful place among the great films of all time."}, {"id": 70, "text": "Powerful, beautiful and an emotional knockout; The Life Ahead proves that talent can rise above a basic storyline and that Sophia Loren delivers without a doubt the best performance of the year.In this drama, a Holocaust survivor with a daycare business takes in a young kid from the street who recently robbed her.After retiring from acting in 2009, Loren makes a beautiful comeback in The Life Ahead, directed by her son, Edoardo Ponti. After seeing this drama, you can't help but think how difficult it must be to make a film like this with your mother in it. The set must've been an emotional rollercoaster. The story itself is basic but thankfully Loren's performance has you locked in for the entire film. Gorgeously shot and emotionally resonant throughout, The Life Ahead will tear at your heartstrings and trust me, you'll need the Kleenex box next to you. Loren delivers hands down the best performance of the year and at 86 years old, let's hope she becomes the actress to sweep awards season. Stream it now on Netflix.Follow @snobmedia for all reviews!"}, {"id": 71, "text": "Although Sophia Loren has played too many parts to recount in her 86 years, The Life Ahead is probably as close as she will get to depicting an aging, caring senior who is about ready to leave permanently. The good deeds she, Madame Rosa, has done for others, especially youngsters, travel with her as we see how she guides her latest waif, 12-year-old Momo (Ibrahima Guye) from thief and dealer to loving child for an old lady.While this premise may sound maudlin, it is not. Directed by her son, Eduardo Ponti, this melodrama with thriller touches is all about Momo finding love and connection and Rosa coming to terms with her Holocaust memories while doing her best good deeds at the end of her life. The screen has a few touching minor characters like Dr. Coen, who attends to Rosa also as a friend, and Lola (Abril Zamora), a transgender caregiver who shares affection with her dear old friend.The Life Ahead is restrained with few high moments. Rather, small interactions lead to our seeing the good in every life, even those of which we don't approve. Rosa is a former hooker, about whom one couldn't harbor criticism or disdain. Like her friends, Lola gives succor when she can, indulges regrets when they come, and searches for love right to the end of the film.She is good just as she tells Momo he is. And that's enough."}, {"id": 72, "text": "Another adaptation of Romain Gary's novel, after the Best Foreign Language Film Oscar winner Madame Rosa (1977), The Life Ahead lacks some of the timeliness of the prior film being seen as an allegory for Middle East peace between Jews and Muslims even before the Egypt-Israel Peace Treaty was signed, and it's entirely devoid of the prior film's reflexivity. Despite Sophia Loren's Madame Rosa being a Holocaust survivor and shopkeeper Hamil treasuring his Quran, religion seems surprisingly unimportant this time around. Rosa teaches one child Hebrew, but encourages another, Momo, to be influenced by Hamil. She's initially distrustful of Senegalese orphan Momo, but this is never explicitly made into a racial or religious issue. Momo is barely even aware that he's supposedly a Muslim. Nobody is seen going into a mosque or a synagogue--not even for a funeral.It does a fair job of avoiding turning into a white-savior narrative thanks to the diversity of the cast and characters. A transgendered prostitute has a more prominent role in this version, and there seems to be a good deal of racial and religious diversity throughout the cast, which seems to be the point of the proceedings, of people coming from different places and backgrounds to become family and friends. Unfortunately, nothing is done with the easy analogy of prostitution to acting, especially given Loren's fame as a sex symbol as well as a legendary actress, but at least the drama doesn't become a PSA on the matter or on Momo's drug dealing, either. It's an amicable-enough picture, but not an interesting one. Momo's narration adds nothing. Loren is fine, and I suppose she deserves to be applauded just for still being active and making a movie, here as directed by her son, but I wouldn't jump to call her performance worthy of the Oscar-nomination rumors she's been receiving. I predict the entire movie will be one that I soon forget. The 1977 film is better. There is a CGI lioness in this one, though."}, {"id": 73, "text": "GRADE: BTHIS FILM IS RECOMMENDED.IN BRIEF: A sentimental but moving melodrama.JIM'S REVIEW: The Life Ahead is a retelling of the 1977 Oscar-winning French film, Madame Rosa. This remake, based on the film and Romain Gary's novel, The Life Before Us, takes this dramatic tale and switches its locale and international star while keeping the same storyline and theme of redemption. Whether the life is before or ahead of us is a moot point. What we do know is that the lead role, once played by glorious Simone Signoret, is now being helmed by glorious Sophia Loren. The torch has been passed most assuredly to the more-than-capable Ms. Loren and the actress takes a firm grasp of this complex character and excels once more, after a rather long absence from moviedom.Solidly directed by Edgardo Ponti, we discover Madame Rosa, a former prostitute and Jewish concentration camp survivor, caring for children of the streets. One such victim is Momo (Ibrahima Gueye, in a breakout debut), a street-wise and embittered orphan selling drugs to get by. Their relationship is the crux of the film, as they start off as distant strangers who ultimately bond as family.The Life Ahead has a sentimental streak of optimism amid the chaos of discarded lives. The director and co-writer Ugo Chiti celebrate the movie's tearjerker roots unashamedly in their film adaptation. As Madame Rosa grows old and begins to slip into bouts of dementia and Momo gets more involved in crime, we know the end will not be pretty. The film follows the conventional story route to its predictable climax, but it is the director's willingness to concentrate solely on the relationship of the movies's two compelling characters, plus the fine acting by Ms. Loren and young Mr. Gueye that gives the film the needed gravitas and emotional build.The Life Ahead is a quiet and moving little film that satisfies. Though far from innovative and ground-breaking in its execution, including an odd and unnecessary fantasy sequence with some truly dreadful CGI and heavy-handled symbolism, it remains a traditional throwback to the well-acted and character-driven melodramas that populated our cinemas some 60 years ago. And that, in itself, is deserving of your attention."}, {"id": 74, "text": "This is a gently poignant story of an elderly lady - an holocaust survivor - Madame Rosa (Sophia Loren) who takes in young lads and gives them a temporary home. She is obviously less than enthusiastic when asked to take in a 12 year old Somalian boy Momo (an engaging effort from Ibrahima Gueye) who had just robbed her. For quite a while, it's not all chocolate and roses between the two - or between Momo and her other lodger - but despite their initial reservations of each other they gradually develop a level of trust and respect. Insofar as the story goes, it's not the most innovative nor imaginative tale. It tugs on the heart strings in a predictably sentimental fashion and that rather disappoints. Loren is every inch a star, but somehow even she doesn't manage to set this rather formulaic story alight. She is old, he is young - we know that - but the script (don't get me started on the terrible English language dubbing) offers us little by way of augmentation to what we can plainly see. It's emotional, but because it ought to be, not because the performances generate that sensation. It is worth watching - who knows how many more films this legend will make - but I fear it will go down in the annals for who was in it, rather than for being a good film in itself."}, {"id": 75, "text": "A simple enough film to watch, that showcases the remarkable talents of Sophia Loren and newcomer Ibrahima Gueye. They had excellent chemistry and helped make the film both feel heartfelt and genuine - despite some of the emotional manipulation going on.It felt like a slow film, but one that kind of drew me in as it went on. It creeps up on you in that regard. Despite the tenderness and heartache on display, I still somehow found myself a bit emotionally disengaged. I don't know whether it was the pacing or the I've seen something like this before aspect of things.Despite some downfalls, it's a film with a lot of heart and great to see Sophia Loren still at the top of her game age 86. May also now have a crush on Abril Zamora who was great and immensely likeable in her supporting role of Lola.The Life Ahead made me smile, and in a year like this, that is worth its weight in gold."}, {"id": 76, "text": "Both in cinema and in real life, the protagonists of The Life Ahead are very different with regard to age and fame. However, this difference is practically impossible to notice in relation to the quality of the excellent performance of each of the two.Inspired by a novel written by Romain Gary, entitled Life ahead, the work is the second film adaptation of the book and the first interpretation of actress Sophia Loren in many years.Sophia Loren is a renowned Italian actress, winner of an Oscar award for her career rich in memorable performances. The movie star plays Madame Rosa, an elderly woman who worked in prostitution to support herself, and now, in her own home, takes care of the children of other women who have no one to leave their children with.In addition to this long and already difficult journey, Madame Rosa faced, in her youth, one of the greatest crimes committed against humanity, the Holocaust.As a Jewish survivor of the Holocaust, Madame Rosa has little prejudice in her life. Even so, at the beginning, he is very reluctant to promise to accept Momo's stay, played by the young Ibrahima Gueye.Ibrahima is a newcomer in cinematographic productions, however, possessing an enormous charisma worthy of those who are already professionals in the field. In the role of Momo, a young Muslim refugee from Senegal who lives in the streets of Italy, the boy is under the care of a doctor unable to continue welcoming him.After stealing and pushing the lady, Madame Rosa, young Momo has no idea that Dr. Cohen, the doctor who welcomes him, will successfully try to convince the young man while a new shelter and guardians are sought.In a promise moved to financial compensation for the boy's care, Dr. Cohen signs Madame Rosa's acceptance of the services.In this abrupt union of such divergent figures is the focus, the positive and negative points of the script.In a work on the difficult and progressive relationship between an energetic street boy and an elderly Holocaust survivor, the production places little emphasis on each of these themes. In a single moment of the plot, exciting details, however, shallow details of the horror faced by Madame Rosa are exposed, and Momo, at that moment, does not seem to even know what the period is about.Still having as main objective the creation of affinity and bonds of affection between the two figures, the development of the scenes did not contribute enough to subtly reinforce this difficult task between the characters. In 1 hour and 34 minutes, the film seems to run or be edited in such a way that, in one scene, the disaffection between the protagonists is expressive, and in the next, a forced relationship of empathy and acceptance emerges uniting the characters.This brief cinematic cliché reduces what could be an excellent production. However, it does not reduce it enough to prevent us from feeling and sympathizing with the situation of those involved.With deteriorations in Madame Rosa's state of health, the sad pact sealed between the new friends leads to striking and unusual journeys for the fulfillment of the promise and the attempt to keep the life and affection experienced by both of them permanent.The Life Ahead fail to converge in a natural way for the beginning of the friendship between their very different characters, but it does not fail to do so in the continuity of the development of this relationship. In the same way, this beautiful production fails much less in the elegant and charismatic air of its interpretations, if not to say that it is impeccable in that fact."}, {"id": 77, "text": "My Review - The Life Ahead La vita davanti a sè My Rating 7.5 /10In The Life Ahead, Sophia Loren's third collaboration with son Edoardo Ponti, she plays an Italian Holocaust survivor known as Madame Rosa who takes in and eventually bonds with a Senegalese orphan, Momo (Ibrahima Gueye). Like many Netflix funded productions, it was originally intended for this film to be given a limited theatrical run a few weeks before its Netflix debut, in order to make it eligible for awards season and to generate publicity in the press. However that plan had to be abandoned because of the Covid-19 pandemic of 2020, and the film went straight to streaming instead. This film is Sophia Loren's first acting role since 2010 the star, now 86, was looking for a personal connection to a script. Then along came her director son and the Netflix drama The Life Ahead. This film is actually a remake of the 1977 famous French film Madame Rosa that starred Simone Signoret this time Sophia Loren is cast as Madame Rosa a retired prostitute who happens to be a Jewish holocaust survivor living in a modest apartment in the seaside Italian town of Bari in the Apulia region, on the Adriatic Sea, in southern Italy. While Sophia Loren is brilliant in the role I think the grittier black and white French film is superior. I was so impressed with Miss Loren's performance it's a brave woman who is so relaxed and confident of her talent to appear with little makeup or any of the glamorous trappings that crowned her one of the most beautiful women on earth. Sophia Loren filmed this movie (under Covid-19 restrictions between the scenes) in Italian. But, the English-dubbed version was also recorded by Loren. The interesting fact to me that her elegance and beauty till shines through even though Sophia Loren is obviously now a much older woman ,especially in this film where she plays a tired unwell ex hooker who has fostered many of the children of her working colleagues . The trauma and horrible experiences that Rosa endured during her internment during the War are obvious and haunt her still. The Senegalese orphan, Momo (Ibrahima Gueye) who also gives a wonderful performance that Madame Rosa reluctantly takes into her home has attitude plus and on a path to crime eventually realises that this crusty old lady has his best interest at heart . These are the scenes I loved in this movie the naive streetwise teen hustler versus the world weary wisdom and affection of a woman who has experienced life and survived its cruel reality. I wish I'd have seen this film in a Cinema first as I think it would be a better experience on the big screen ,hopefully one day it will be released as it was intended to be seen. Personally it's one movie I would have liked to be longer than 1:34 minutes as I wanted to know more about Madame Rosa and Momo's past life but it's Director Edoardo Ponti has done his mother proud and vice versa.l This is not one of those movies where you see a great Star coming out of retirement to make a movie then after you watch it say Why did she do it? Sophia Loren did this film because she's still a fine actress,"}], "reviews_amount": 78}