{"name": "The Prom", "titleId": "tt10161886", "reviews": [{"id": 0, "text": "I'm a 50 something straight man and I loved it. As a parent you can do nothing more than love your children for who they are. A joy of a film."}, {"id": 1, "text": "We gay people have been normalised (and that's a very good thing) to the point we can make movies just as bland as straight ones. I guess that's good news."}, {"id": 2, "text": "I truly can't understand the people who rated this 1, I mean come on people its really worth more than that! You gotta take this movie for what it is, sure its not the greatest movie of all time but its a heartfelt feelgood movie who just makes you happy. Instead of scoffing James Cordon for his accent laugh with him for it. Its just like Stellan Skarsgårds singing in mamma mia, yet another fun adding to the prom.Go see this film if you wanna have a good time and escape from reality!Ps: I have to mention the catchy songs! They have been occupying my mind ever since a saw this."}, {"id": 3, "text": "What we all need in this desperate year is a little bit of hope and love!"}, {"id": 4, "text": "I'm just a basic middle aged white lady from the Midwest who had never even heard of this musical on Broadway. But I thought the movie was delightful. It's just an old-school campy shiny musical with a really great message. It's exactly what you would expect it to be. And by the way James Corden is great I don't know why everybody felt the need to call him out on the other reviews. His performance actually brought me to tears twice. All the actors were great."}, {"id": 5, "text": "My family and I had a lot of fun watching this movie. I don't understand the hate toward James Corden, I thought he did a good job. If you go into it not trying to hate it then you will have fun, if you go in trying to have a bad time you will have a bad time."}, {"id": 6, "text": "Meryl Streep and Nicole Kidman are my favourite actors. However, the script and score of Prom didn't use this stellar cast's potential.... not even in the slightest bit. Every song sounds the same... and follows the same unremarkable, easily forgettable form and melodic styles and resolutions."}, {"id": 7, "text": "I'm a bit tired of Ryan Murphy doing the same thing all the time. I really loved Glee and thought it was groundbreaking but this movie is so disappointing. Okayyyyyy it's about inclusion , I'm all for it trust me and it's a good start. The cast was promising too. I think Meryl Streep can play anything and she can sing. James Corden is a great talk show host but not a good actor. Nicole Kidman seems completely lost and does not bring anything to the table. Shame. The only positive point is the two girls who are truly a revelation."}, {"id": 8, "text": "This movie is genuinely the tonic to 2020 we all desperately crave. It's campy, it's silly, it's wild and it's fantastic. Meryl Streep continues to show us that she's the best actor on this Earth by taking on the lead role of Broadway Legend Dee Dee Allen. Not only does Streep bring a certain camp to the role she also explores Dee Dee's softer and more vulnerable moments... plus she sings the HELL out of the score. The rest of the cast are in fine form but Meryl is the one you want to see."}, {"id": 9, "text": "Absolutely crap. Where is the talent of Ryan Murphy in this film?? Unnecessary long... so stereotypes personajes waste of a magnificent cast! It was impossible to connect with the personajes and the story... so cliché The movie has all the ingredientes to be great (actors, director...) but got lost in the way.."}, {"id": 10, "text": "If you can get past the disastrous first 30 min and James Corden awful over acting the movie is pretty good. At times the film is bad really bad but then other times it's a lot of fun. It's one of those movies where you just have to go with the flow it is what it is. It's over the top but I think that's the point but does it work well at times it does and other times it's doesn't. The actors are underused there good but they could of been better but I'm not blaming the actors they did there best for what they got. Is this the best film or musical ever made no it doesn't come close but it's a fun musical."}, {"id": 11, "text": "This was so boring. Even Streep could not save this movie. Cliche after cliche. The songs are terrible and they all sound the same. Moving on."}, {"id": 12, "text": "You're supposed to be on the inside joke that this is about the hubris of Broadway stars and these stars are making fun of those stars. They lay it on with a backhoe. They're afraid you won't realise they're actually not stars being stars but stars making fun of stars being stars. I know reviews are subjective but it's difficult for me to understand all the rave reviews for this awful mess. The other theme is sticking up for gay students but the storyline is forced beyond belief. The whole thing is forced beyond belief. It's a farce of a farce. The stars making fun of stars are showing up to save their careers by saving clueless small town ordinary people. Maybe the character arcs allow everybody to learn and grow by the end. Boy, I sure hope so. I couldn't sit through more than 20 minutes. Just horrible. Maybe you'll like it. Such of waste of everybody's time, the cast, crew and viewers. Too bad. Again, just my opinion."}, {"id": 13, "text": "Your heart must be of Beskar if this musical does not melt it. Great music, fine actors, fantastic choreography and a touching storyline. It won me over by storm, brought some tears to my eyes and felt like dancing after the overwhelming, Ryan Murphy colourful finale. Great entertainment for the festive season!"}, {"id": 14, "text": "I'm so disappointed in Ryan Murphy and, frankly, most of the cast. As a huge fan of everything he's done in every genre, I almost can't believe he had a hand in this. The cheese level worked live and loses its charm here and then some. I am a huge fan of movie musicals, especially ones that adapt existing Broadway shows. This movie wasted its potential to add more poignant plot elements, opting for unnecessary, less-than-charming camp and boring filler scenes. Kerry Washington is insufferable beyond what her role calls for, James Corden's portrayal of a homosexual actor is offensive, and the writing is lazy. Such a bummer that folks who didn't get to see it live are getting this instead."}, {"id": 15, "text": "No depth, too many sub stories, painful, an effort to watch. Left me feeling empty."}, {"id": 16, "text": "It is definitely cheesy but it's a lovely feel good movie. Despite the movie's cheesiness and how it spoon feeds a lot, it's beautiful and enjoyable due to its nice story and its important cause and life messages. And to me that's more than enough to love and enjoy it. Meryl Streep and Nicole Kidman are literally perfect. The colors are catchy and nice, the music is awesome as well. The Prom is a cheesy entertaining beautiful emotional movie. Give it a try."}, {"id": 17, "text": "I just don't know how this movie can help raise attention for the lgbtqia community. You thought it's about the equality issue in the first place and then it started to talk about the narcissism in the produciton industry in the next second with really bad cliche jokes. Plus you really can't cure homophobia with musicals within few days. This movie is a good example for overpresenting and appropriating lgbtqia culture in order to cover up bad screenwriting and cliches."}, {"id": 18, "text": "Despite all of the glitter, glamour as well as the renowned cast, The Prom (2020) fails to become the Oscar contender it aspires to be. The subject matter is definitely worthy of attention, but this movie will probably not stay in your mind for long. An easy movie to watch that is close to deserving a failing grade."}, {"id": 19, "text": "I have great respect for Meryl Streep and Nicole Kidman (not so much for James Cordon who should stay on TV, as late at night as possible) but this film is a mess. It's theme seems to be about 20 years out of date, the acting is so bad that it fails to even be campy and the music is monotonous and drab. I don't understand the love for this show but then there's a lot about 2020 I don't understand. If you think it's impossible to be too woke, jump right in."}, {"id": 20, "text": "I loved that it tackled the issue of performance activism and how most stars are hypocrites, helping people just to get good press. It was corny, in a good way, it made my heart happy. Also, the costumes and the art direction were phenomenal, bright/shiny colors and patterns. While watching it, you should understand what it wants to achieve instead of criticizing it harshly. It is a pleasant watch, with a simple script , perfect for the anxious times we are living."}, {"id": 21, "text": "I am a massive fan of the Broadway show, and I was looking forward to this movie since it was announced. I didn't think it would be fantastic, but I knew it would be fun to watch, especially as a fan already.And fun it was. As expected, Ryan Murphy really did Ryan Murphy, with all the glitz and glamour, colour, and vibrant look of his work. I do wish it wasn't a Netflix film so I could see it in a cinema (if this was a normal year), because a bigger screen would certainly benefit it.However, it wasn't great. Yes, I had a lot of fun with the film, it was certainly enjoyable. I wanted more Andrew Rannells, and the fact they cut almost all of The Acceptance Song makes me annoyed, because that is one of my favourites in the show.Additionally, the auto-tuning and overly done pitch correction of many of the actors is hard to listen to. I didn't know Keegan Michael-Key could sing, but the rest of the main cast all can.Love him or hate him, but James Corden can sing. His accent isn't great, overly done in some scenes, but he can sing. He was probably the one I noticed the least editing done on his voice, him and Meryl Streep. Andrew Rannells was in Book of Mormon on Broadway, he doesn't need his voice altered, nor did Ariana DeBosse, who was in Hamilton.As mentioned, the severely shortened The Acceptance Song was annoying, as well as cutting Emma and Alyssa's verse from You Happened. I can take changing some lyrics, and while a great joke is removed in one change (Just Breathe), it ultimately isn't a big deal. Luckily, no full songs are cut (though I wouldn't have minded the removal of Zazz).The pacing of the film is good, with songs coming in reasonably quick succession. It helps that the musical creators wrote the screenplay, they can make sure the film follows their show from a script perspective. The ability to change scenery a lot mid-song helps at times, but it makes you question Murphy's choices a bit (like, why does part of Just Breathe take place while Emma is swimming backstroke? Why is she singing then?)Everyone does a fine, competent job, but it isn't a movie that is going to win any Oscars. I had fun watching it, and I went back and watched a few performances again. I would watch it again, but unless I want to hear a little Andrew Rannells, I am sticking with the Broadway cast."}, {"id": 22, "text": "If you're a fan of cheesy come together musicals, you'll like this. It's very wholesome."}, {"id": 23, "text": "The perfect feel-good musical! All actors are amazing."}, {"id": 24, "text": "While it is in no ways perfect, The Prom is a prime example of how fun and heart-warming, a good old musical film can be. In a year were Broadway has shut down its fills me with joy to see this catchy, foot tapping, progressive film. Great acting, some truly emotional moments, breathtaking choreography and awesome songs make the Prom a watch-must."}, {"id": 25, "text": "Just what we needed, a little bit of campy fun. Thought the production was well done. Acting was over-the-top campy. Excellent singing. A little long, but to be expected when doing a film of a Broadway play. Why not just sir back and enjoy yourself."}, {"id": 26, "text": "A fun and beautiful movie about a very important subject. There is still so much intolerance in the USA and the world."}, {"id": 27, "text": "Look it may be over the top but it's heart wrenching for anyone in the lgbt+ community, you just feel connected with at least one member of the cast"}, {"id": 28, "text": "This movie makes me fun and happy. Meryl Streep is really excellent and i love her. This movie is pink and i could feel better than cruel anything in the reality for people in LGBTQ"}, {"id": 29, "text": "I've seen better production of a show at my daughters high school. Wasn't funny and for me had nothing going for it. What was Meryl Streep thinking!"}, {"id": 30, "text": "Songs were awful the singing for the most part even worse. the dancers looked like the were on having seizures. Our Lesbian gal had less charisma than Hannibal Lector. Only a trump fan could call this a win."}, {"id": 31, "text": "The film LOOKS great, but the story goes out of its way to also push down the Bible and make insulting one liners about faith and God. No wonder why the world gets the wrong view of Christianity. They think every single Christian is homophobic and judgmental. The town in Indiana according to the movie is conservative, but antagonizing Christianity is a no. This film tries to normalize: Do what YOU feel is right, whatever YOU want. Disappointed in the performances of James Corden."}, {"id": 32, "text": "I went in expecting to hate James Corden in this and he was one of the best parts. The songs were great, the message was great, it had so much heart and made my day. What a fun emotional rollercoaster. The Prom has a great story mixed with great music and succeeds in every way."}, {"id": 33, "text": "The movie really lacks depth and emotions. Meryl Streep is absolutely great and gorgeous as usual but James Corden, as much as I love him, honestly, but his acting in this is God awful! Absolutely terrible! Nicole Kidman is really trying and for the most pulls through. The songs are also a musical cliché.... Exactly what you'd expect from an amateur musical- I am shocked that with this level of A list actors that the songs weren't better. I can't even remember a single one... And the character Emma lacks depth too. She's always smiling even though her world is crushing down and when she cries, it looks so shallow with your typical facing the camera, back turned to whoever is with her, and pretty crying. Absolutely unbelievable! (The girl can sing though) It's like they want her to constantly be this happy go lucky person but it's just not realistic for a teenager to be that way when facing a crisis! I was pleasantly surprised by Michael Keegan's musical debut though. I love that he was in this movie. Thank God for him and Meryl Streep. But seriously don't watch it. It's horrible."}, {"id": 34, "text": "I wanted to hate this film because of James Corden's offensive depiction of a homosexual man but the rest of the film is great. The lead of the film shines and the songs are catchy AF. It really doesn't need Meryl or Nicole but they gain 2 stars for their casting alone."}, {"id": 35, "text": "If you enjoy checking out from reality with a pompous, cliché, mess of a film with hypocritical elitist actors who are way over paid then you might like this film.Also... didn't we get enough of James Corden with that mess Cats. Pull. My. Hair. Out."}, {"id": 36, "text": "Don't listen to the haters of James Corden. They are just being very audible here. He is actually good in this and has several scenes in which he shows real depth as an actor. Is he overpaying the gayness? Yes and no.. As a Gay man I know several of this type and I can be it myself, the drama-Gay, it's real. But in his real scenes he is heartbreaking. Part from this, So refreshing to see something uplifting and positive with good music and actors. The pairing of the cast is brilliantand Jo Ellen does a great job of portraying a slightly naive high schooler with big ideas. Love the scenes with James and Meryl, and pairing Meryl with Micheal-keegan was brilliant. Music can sometimes be a bit predictable but there are several great numbers despite of that. Nicole finally does a sympathetic role again and is a bit downplayed.. Thought it would be bigger but never mind, love her. Best laugh--Meryl going for the fight Best tears- James heartbreaking moments with Meryl and later Tracey Ullman Best song- my unruly heart Best full cast shownumbers-any of them"}, {"id": 37, "text": "I went in with high expectations because of the cast ('grats to them, they made the film look loads more interesting in the trailer) but it disappointed terribly. Predictable and cliche to a fault - the film missed its opportunity to use more poignant scenes given the main messaging, leading its grandiosity in the production without having much to takeaway from the plot. The conflict (so to speak) was resolved so early on in the film that it just went downhill from there. Just my opinion as I know the movie is still well-loved by many but seriously, that movie didn't have to be 2 hrs and ~15 mins long. Incredibly bland and pretentiously campy."}, {"id": 38, "text": "Double sucks !!!!! Horrible to see aging women selling their talent &amp; integrity for cash. Shame on u Meryl &amp; Nicole."}, {"id": 39, "text": "I haven't seen a stage production of The Prom, but the movie addresses homophobia as well as the problem of celebrities trying to champion political causes (especially when they don't understand the complexities). The original musical was based on an instance in Mississippi in 2010, when a girl wanted to bring her girlfriend to the prom, and some celebs rallied around her.Like many of Ryan Murphy's productions - think Glee - this movie is so over-the-top that it defies reality. Nonetheless, I enjoyed every part of it, particularly the scenes where the celebs got a shock at having to adjust to small-town life. It won't be for everyone, but it's fun enough for its brief running time."}, {"id": 40, "text": "I think they really tried to be worse than Cats, to win every award for the worst film ever, as some kind of in joke. It is so awful, it seems intentional, because there are actually a lot of talented people involved."}, {"id": 41, "text": "The Broadway cast (that made the musical as popular as it is) were better. Ryan Murphy should have used them since it was wrote specifically for those Tony winners and nominees. James Corden was almost offensive to me. Netflix, stop giving money to Murphy."}, {"id": 42, "text": "Dazzling! A feel good musical that you can watch with the fam. Loved the colors and extravagance. Made me very happy to watch."}, {"id": 43, "text": "Greetings again from the darkness. The success of his TV series Glee and American Horror Story has delivered Ryan Murphy the creative freedom to explore other projects. This time out he directs the cinema version of a Tony-nominated musical, and blends star power with newcomers in an extravaganza meant to fill the gap left by the darkened stages of Broadway during the pandemic. Created by Jack Viertel, with a book and screenplay from Bob Martin and Chad Beguelin, it's a story of homophobia and narcissism, and the battle to defeat both.Meryl Streep stars as Dee Dee Allen, and along with James Corden as Barry Glickman, their opening night exuberance for Eleanor! The Eleanor Roosevelt Musical fades quickly when the reviews hit. Licking their wounds at Sardi's, the two are told by the producer that nobody likes narcissists. Joined by chorus girl Angie Dickinson (played by Nicole Kidman) and Julliard-educated actor/bartender Trent Oliver (Andrew Rannells), they decide what's needed to revamp their careers is a 'cause celebre'. Thanks to Twitter trends, they locate the plight of Emma Nolan (newcomer Jo Ellen Pellman), whose Indiana High School PTA has just voted to cancel prom rather than allow Emma to bring another girl as a date.As you would imagine, becoming an activist for the wrong reasons (publicity) can make things messy. These flamboyant city slickers aren't exactly welcomed with open arms by Midwestern folks. Plenty of touching moments occur between Barry and Emma, Barry and Dee Dee, Angie and Emma, Dee Dee and school Principal Mr. Hawkins (Keegan-Michael Key), and mostly, Emma and her closeted girlfriend Alyssa (Ariana DeBose, who will also star in Steven Spielberg's upcoming remake of WEST SIDE STORY). PTA leader and leading homophobe Mrs. Greene (a fiery Kerry Washington) does a nice job as a bigot and caring parent.So while a story exists and messages are conveyed, this is, more than anything, a glitzy musical covered in primary colors as only Ryan Murphy can. Each of our main players gets a featured song, with Ms. Streep's campy Not About Me a highlight, along with Ms. Kidman's Fosse-esque Zazz. Mr. Corden probably gets more than his fair share of screen time, while Ms. Pellman and Ms. DeBose shine brightly in their numbers, and both possess lovely voices. Young Ms. Pellman is especially impressive holding her own on screen with Oscar winners Streep and Kidman.There likely aren't many gay teen rom-com musicals set in middle-America, especially ones with a Tina Louise reference, but leave it to Ryan Murphy to make it work. There is some quality humor, though it's likely the song and dance segments are what will draw the audience. Choreographer Casey Nicholaw takes full advantage of the athletic youngsters and fills the screens with backflips and leaps - complimenting the dance moves of the stars. It's a shame inclusivity must still be addressed, but at least it can be battled in a fun and colorful way. Opening in theaters December 4, 2020 and on Netflix December 11, 2020"}, {"id": 44, "text": "This movie stays true to the Broadway show and delivers in all aspects! The performances are on point. Ryan Murphy did a great job at directing as well. I highly recommend this movie for its music, acting and message. This is everything I could've hoped for a movie version of this musical!"}, {"id": 45, "text": "Ryan Murphy aimed for a glamorous, fun and colorful movie but nothing quite works. Extravagant performances, very very cliche songs with lots of unnecessary long notes and yelling, nothing worth re-listening. A bad musical. Don't fall for fake comments."}, {"id": 46, "text": "10/10 - astounding Broadway movie adaptation has great music, a fantastic cast, an admirable message, and a whole lot of heart"}, {"id": 47, "text": "I loved this musical so much!! I laughed &amp; cried. It was so touching &amp; campy &amp; fun. It has so much heart! All the actors were incredible! The low ratings are undeserved. Open your heart, watch, listen, &amp; enjoy!"}, {"id": 48, "text": "Another bloody stupid film about a bloody stupid prom."}, {"id": 49, "text": "It wasn't my tv, but every song was swamped by its soundtrack. I'd rather have seen Ross Matthew's playing the Corden role - at least his accent wouldn't have slipped as often as a bad ice skater..."}, {"id": 50, "text": "I truly cannot understand why such a cast (streep &amp; kidman) of this movie even accepted to be in this movie. Were they so desperate????? Hated the movie. Hated the singing."}, {"id": 51, "text": "Not for me. Like Ryan Murphy and Meryl and Nicole are just better than this nonsense. The main actress falls short, despite a beautiful voice. What a shame to wreck what was an important message and potentially a wonderful story to tell."}, {"id": 52, "text": "Such a good movie. Great music. Great dancing. Loved every performer. Now this is how one does 2020. ❤"}, {"id": 53, "text": "This movie was way too long and definitely did not need to be 2 hours it could have easily ended at 1. Songs were given one after another after another and felt to remove any meaning from what was being said in terms of the story line.If you were a fan of la la land you'd most probably like this however if you didn't then this isn't the film for you. Felt way too dragged out and when I finally made it to the end of the movie it felt to be lacking."}, {"id": 54, "text": "Movie is overall great however it has some flaws and they don't get why they always hire James Corden he is so unlikable he just reminds me of the emoji movie and other disasters movie he's done"}, {"id": 55, "text": "It's really a bad one.. wasting 25 minutes of my precious time watching it"}, {"id": 56, "text": "Amazing how Netflix got this excellent cast to play in this nonsense. Yes, agreed, discrimination is bad - should you go for any project just because of the theme?"}, {"id": 57, "text": "This movie not only grabbed my attention (as I'm a much older lesbian now), I was emotionally connected as it reflected the story of my teenage years as well as my young adulthood. This is a tear-jerker in some parts as well as exhillerating in others.Growing up in a strict religious family and community during the 80's, I was treated horribly. I was shunned and disowned at 17 yrs old and thrust all alone into a society that never really understood people like me and systemically rejected LGBTQ people. So many of us could never dream of going to their prom; certainly not in any way a straight teenager could enjoy it. After losing our families and friends with not a shred of community help, what is left at such a tender age?This movie delightfully portrayed how our society is slowly changing for the better. I want to buy this movie on DVD, if ever I can! And yes, I give it 10 STARS!"}, {"id": 58, "text": "I cried, I laughed because this is literally the best musical movie I've ever seen. The cast (Nicole Kidman, James Corden, Meryl Streep, etc) is out of this world, with their talented performance they definitely turn this movie into a master piece!!!"}, {"id": 59, "text": "Like most Ryan Murphy vehicles, 'The Prom' soon overstays its welcome. It overdoses on sparkle and star power to overcome the inconsistencies in its story and characters. The film's biggest crime may be stuffing itself with too many subplots, some of which are just time consuming, and, at the end of the day, aren't needed. But despite its shortcomings, 'The Prom' has its winning moments with the cast is having a blast throughout, and it's utterly infectious."}, {"id": 60, "text": "So much talent. A very good script. A wonderful score. Anyone who loves musical theater will love this picture. The beautiful voices. The wonderful dancers. I loved it. Don't know how anyone couldn't. There aren't that many good feel-good movies being made anymore. This is one. And how."}, {"id": 61, "text": "Take the fun and run/dance with it. It's not trying to be anything else but what it is, it's not taking itself seriously. Cast is great, just having fun. Sure there are flaws but it's the end of a crazy year for a little crazy fun."}, {"id": 62, "text": "So much fun. Such a positive message and they didn't bash on Christians while still making their message known. I appreciate that. Dancing was awesome, and every single actor delivered a top notch performance with so much zaz! ;)"}, {"id": 63, "text": "Besides being a terrible movie overall you have overplayed clichés and James Corbin. If that's not enough to change your mind you just might be a masochist."}, {"id": 64, "text": "After all negativity about this movie I was surprised how much I enjoyed this movie!!! It's a perfect film to take the 2020 blues away!!!"}, {"id": 65, "text": "To begin with I'm no fan of musicals, in fact I can't stand them.This movie is no exception.And James Corden should stick to his loud and annoying late night show because his acting stinks."}, {"id": 66, "text": "I found James cordon's portrayal of a gay man kinda Offensive (Why not some who is) aswell as he can't sing we learn that for the Disaster that is cats"}, {"id": 67, "text": "Ryan Murphy must be stopped. His continued attack on the American people should be considered a hate crime. Pose is still really good tho.Also stop casting James Corden. The fact that he continues to get work amazes me. Nathan Lane would have been the perfect fit for Corden's role and has a much better singing voice. He's also easier to like."}, {"id": 68, "text": "I'm only 30 minutes into The Prom and wanted to encourage people to watch it."}, {"id": 69, "text": "Blown away with how great this movie was. Reviewing because for the life of me I can't understand negative reviews unless you just don't like musicals. I don't like horror movies... so I don't watch them and then write poor reviews. If you like musicals or just want a fun experience, enjoy."}, {"id": 70, "text": "First off, there's a few bad reviews on this movie simply because it's a musical. You signed up to watch a musical without liking musicals? That's a recipe for disappointment. Secondly, I thought they did a great job touching all the very scary and very real problems that people (especially kids/teens) struggle with in the LGBTQ+ community. And lastly, the bit about cherry picking the Bible is something I've been saying for years. The Bible isn't a choose your own adventure story, if you think so I think you're missing the point. Love. Thy. Neighbor. Above. All."}, {"id": 71, "text": "It's great, don't understand the criticism. Put your personal prejudices aside."}, {"id": 72, "text": "Not even finished and I'm loving it! Smiling and laughing the whole time."}, {"id": 73, "text": "Fine, this movie might be a bit long and bit cheesy. But it makes you feel - A LOT. It shows the pain that LGBTQ+ people feel when they feel misplaced in this world and the unfiltered joy and relief once you can finally be yourself and feel free. And it makes this really accessible for everyone and by this plays a big part in spreadjng acceptance.Plus the two main actresses are fantastic! What amazing young talents!Also the soundtrack is great, especially Unruly Heart has become one of my facourite musical songs of all times."}, {"id": 74, "text": "All the charm and heart of a modern day musical. Loved it!"}, {"id": 75, "text": "I'd argue that it's worth watching for the end of Act 1 gut punch alone.The cast is great, the music is great. The production design is great. It's the correct amount of over the top.I feel like some people don't understand that it's wildly satirical. And that satire isn't reserved for one specific group. If you think it's PC political propaganda, you're just wrong. It's a movie about love. It's also about how hard it can be when people don't accept you for who you are. Last time I checked, that's not a political statement. One might even say the lesson is love thy neighbor. It's just a shame that most people who need to hear that won't make it through the first 80 minutes."}, {"id": 76, "text": "Lazy, derivative writing. A couple of genuinely awful performances. And just a little bit offensive. Really disappointed. Love thy neighbour.... turn the volume down."}, {"id": 77, "text": "I enjoyed this movie!! Does not deserve the hate it's getting. It's cheesy for a reason. It's a Broadway play turned into a movie. The cast did a great job. James cordons accent could use some work but overall and enjoyable experience!!!"}, {"id": 78, "text": "I love musicals, from My Fair Lady to The Greatest Showman, I really do watch a broad range and a great many. The Prom was an absolute delight. (The flow of story to song and back again kind of reminds me of My Fair Lady actually.) The Prom made me laugh, made me cry, made me clap, made me smile. And the cast just made it perfect."}, {"id": 79, "text": "A Dramatic LGBTQ youth musical. It is about a girl who is forbidden to go to the dance with her partner and unleashes the furor of the network, causing a group of theater actors to take the opportunity to claim their career and in the process give a message of tolerance. Quality. Entertaining. With light jokes and sarcasm. Quite a few emotional and warm moments. An extraordinary job of directing by Ryan Murphy. Meryl Streep spectacular as always. The performances are top notch. The musicals and their respective ensembles are wonderful. Music, lyrics and choreography in place. Talk about love and tolerance that we do not have in front of what we do not know. How it costs us to accept and love others as they are that it does not affect us, that is what this film shows. It also talks about being ourselves in life leaving appearances. A powerful movie about inclusion and love. If you like musicals, this movie is for you."}, {"id": 80, "text": "I have spent the pandemic fighting sorrow, economic depression, and just plain scared. This movie was uplifting, joyful and took me away from all that...if only for a fraction of today. James let me cry for the first time in months, Meryl, Nicole, Michael and Andrew had me tapping my feet in delight. What could possibly be wrong with that!"}, {"id": 81, "text": "No spoilers. But fair warning, I am a lifelong theatre geek... and I LOVED this musical movie. Loved, loved, Loved it. Such a delightful break from all the bleak, depressing news out there... and truly inspirational. Bravo to cast and crew!&lt;3"}, {"id": 82, "text": "Such an uplifting positive inclusive musical. You just need to take it for what it is. There are great songs in it and performances. I will definitely be watching it again. Blooming love Andrew Rannells as Trent. Jo Ellen Pellman is brilliant too."}, {"id": 83, "text": "The Prom truly is one of Ryan Murphy's best creations. The songs. The powerful message. The adorableness. The emotions. The FLAWLESS and AMAZING cast. The prom in the end open for everyone. Just wow. I admit I cried in some parts. I still have chills. Just beautiful! I loved it A LOT"}, {"id": 84, "text": "This film is so beautiful. The sets, the songs and the message are all so beautiful. I was so touched. I even watched the credits because I didn't want it to end."}, {"id": 85, "text": "This was such a great movie and an amazing feel good movie!! I was smiling so big by the end and my heart felt so amazing!! Ignore the criticism people and please watch!! Also it's an incredible cast!!!!"}, {"id": 86, "text": "I wasn't expecting anything and I'm not a big fan of music-hall but it's super good."}, {"id": 87, "text": "This is a movie adaptation of a fun play. Flashy, funny, good performances and high production. Certainly poking fun at society while turning off our critical brains at the end of this year. A joyful ride full of talent. Live a little."}, {"id": 88, "text": "I think with any musical movie adaptation, it is safe to count on losing some of the authenticity of the voices. With that being said, yes, some of the songs sounded off or overly autotuned, but they still had their effect in the end. If you're an automatic anti-James Corden fan, then this is not the movie for you. If you have an open mind though, I did not find his performance horrible in the least bit. Can he be over dramatic in all the wrong ways, yes. For this role though, I think it fit better than I expected and I appreciated what he did with the character. The others in the Broadway cast aways group were also fun and at times lovable characters as well. One common thing I saw in the reviews was that you could atleast relate to one of the characters throughout the movie. With the different array of personalities, acting methods, and voices, I would strongly agree to that. I think Emma's character got lost in certain sections and the storyline got carried away, but in the end, the story found it's way back."}, {"id": 89, "text": "Having seen the original Broadway musical i knew it wouldn't be the same but it truly was a great movie. I didn't love the casting of James Cordon but he actually portrayed the character well and as written, yes it was a stereotype but it's how the character is meant to be.A few of the nest numbers were trimmed for the movie which i didn't love but at least they are on the album.It really is a feel good movie with a important message. Show stopping numbers and stunning costumes. Please don't miss this"}, {"id": 90, "text": "James Corden ruins everything. His performance in this is no exception... but this one is also offensive. I'm sure Ryan Murphy has full rolodex of talented gay men who could've made this movie a 10 star effort with its sweet message and catchy songs... as soon as Hollywood stop casting Corden the better musical movies can be."}, {"id": 91, "text": "Worst ever film i have ever seen, dropped in the middle"}, {"id": 92, "text": "Boy is this on the nose and political. Fortunately, it's self aware of the trappings that come with this material. If it was obvious or serious I think it would've been quite frustrating. I like the overall tone that this has including and outside of the tongue in cheek aspects. I enjoyed it's painting of celebrities as these vain people who only think of their brand, even when they are trying to make a change. This is all emphasized by the hyper glossy style. Think Greatest Showman but everything is more thought out. Where it lacks is in some performances, inconsistent at best musical numbers, and some questionable editing/structure choices. I realize the big names demand screen time, but it's not their story. They should've been relegated to the sidelines, allowing us to get more acquainted with the main character. Imagine if La La Land had a batch of scenes following Ryan Goslings sister or Emma Stone's girlfriends. That's sort of how this feels jumping between the gluttonous cast. It's feel good entertainment that does well at entertaining but loses most of the feels it aims for."}, {"id": 93, "text": "This was a great feel good film. After days of being bed ridden being sick I actually felt better after watching this film. Music really does heal the soul plus the story was one that very applicable to today's youth and I feel will give those struggling with their voice and fear to step up and not feel alone. The acting was a bit hammy but when you think about it they're playing Broadway stars so they're over acting it was well done. A little slow in one or two places but nothing to write home about. Highly recommend!"}, {"id": 94, "text": "Great cast, great music, great dancing. Just a fun, enjoyable movie with a positive message."}, {"id": 95, "text": "Love the camp, the colors and the songs. Fun movie."}, {"id": 96, "text": "There is musicals with breaks and then there is endless singing like this movie. Andrew should have been the lead over James Corden. Corden was very lackluster over this star-studded cast."}, {"id": 97, "text": "I adore how Ryan Murphy is creating uncompromising, perfectionistic fare. This is a wonderful, rollicking film. So much fun and love and kindness permeates. It's idealistic AF but I like THAT."}, {"id": 98, "text": "At the eve of 2020 comes this musical from Hollywood that proves all of the US politics. In one piece of film. I acclaim the actors in it. Loved the music. Absolutely not bad But why Indiana ? All the red states are the same rot and the Trump is as infantile as ever with their blessing. But just to have a song celebrating lesbians is so about time. Can't give you 10, but 8 is more than ok. PS. Stop dissing on James Cordon - he was great - almost gay :))"}, {"id": 99, "text": "Were looking forward to this film because of the cast. Very disappointing and very surprised that such great actresses were involved. We watched film for about half an hour before giving up."}, {"id": 100, "text": "A group of aging narcissist Broadway actors come to the aid of a small town Indiana girl who recently came out of the closet which cancelled the school's prom.This is not a squeal to anything that starred Jamie Lee Curtis. Based on the Broadway play and has an A list of stars. The musicals numbers were superb as was Jo Ellen Pellman. I didn't like the religious scene. You really can't debate the Bible in a 3 minute song. I felt the production would have been better served to change the method to convince the students to come around, maybe through self examination of their former relationship with Emma."}, {"id": 101, "text": "When I was watching this movie I thought it was an average movie but at the end it put up a big smile on my face and made me feel good. So that's why it deserves a 7/10 (thought of giving it 6 at first).A feel good movie."}, {"id": 102, "text": "It's fun, cheesy and has a good storyline. Is it believable? Somewhat...if you suspend your belief and just roll with it. It's got some great bits and a perfect cast. I don't know why people were hating on James Cordon, he was FABULOUS in the roll. And Meryl Streep?! She was perfect."}, {"id": 103, "text": "Oh boy that was painful to watch. Even Cats was more entertaining....."}, {"id": 104, "text": "A touching message, an engaged ensemble, but mediocre music, which doesn't leave a lasting impression and a kind of plastic atmosphere all around. I am not sure if form and content made a convincing match here. But I enjoyed the actors, led by the great Meryl Streep, good moments brought in by Jo Ellen Pellman and Keegan-Michael Key. Nicole Kidman performs a charming number, reminiscing the good old ( and way better Musical times ) of Bob Fosse, for me the only number with some individual personal character. The rest sounds and sings more or less the same quite stereotypical way with choreographies executed in a very athletic, almost robot-like perfection, not adding much to lacking charisma, inspite of the fact that the movie's message is worth to be heard and understood."}, {"id": 105, "text": "A very relatable story. I loved the development and growth of the characters.It is a beautiful story that will engage you from beginning to end. A beautiful message that every people should see.I am so glad that we can have such a good representation, something that teenagers can see and hopefully create a better world with it.THIS is the way to stop bulling, to stop hate, to just love thy neighbour ;)"}, {"id": 106, "text": "Just another idea with potential, which was shut down. I mean, man, it's so hard to screw something so promising, for the audience and for your own career, up that bad. It physically hurts me to rate that low a movie with such a cast..."}, {"id": 107, "text": "I love Ryan Murphy's creativity but I think he let him self go with this film. The topic is great but poorly executed especially with James Corden who can't act and has a terrible American accent. I lost interest 30 mins in and gave up to watch the rest in honesty. Would of given a 1 star but Ryan directed, so upped it."}, {"id": 108, "text": "Supremely frustrating outing with a musical that I could only describe as a vastly inferior 'Hairspray'. The forgettable music just bounced on and on, while the insipid lyrics really spoiled almost every tune.The cast, all of them (yes, even Corden, who hit his moments perfectly), did a good enough job with this college-level musical. Streep was a little more over-the-top than the others but it was all in fun---which is what this drone-fest of a musical needed more of."}, {"id": 109, "text": "Very very poorly written. You have characters popping in and out mid-scenes without explanation. Nicole's character? Why is she here? No sense. And it is 2hrs+ of nonsense...Some songs are catchy thou, that's why the two stars. Avoid losing your time."}, {"id": 110, "text": "This movie is a tad over 2 hours when it should have been no more than 100 minutes. Every title character had to go through their polar attitudes (typical) but the simplicity and predictability just wore this viewer out. Their were at least 3 songs to cut and even Ms Kidman's role could have been deleted.Stuck at home with not much to do, this movie was fun and catchy and many times enjoyable and funny.It's worth the 2+ hours when stuck at home."}, {"id": 111, "text": "Very cheesy story line and awful acting and singing"}, {"id": 112, "text": "But 40 minutes too long. After an hour and a half, I was ready to move on. Keith Urban is one lucky guy. Nicole Kidman is amazing."}, {"id": 113, "text": "Even with James Cordon..granted he is not my favorite actor, still this was a fun light-hearted movie. I enjoyed it. I guess I like rom-com musicals. The songs were cute upbeat and I found myself singing with them. A feelgood movie that I got to turn off my brain for awhile which was a welcome relief."}, {"id": 114, "text": "This is the campest thing Murphy has ever made. The syrup is poured on SO THICK. The message isn't just rammed down your throat, it's smashed in your face every time someone opens their mouth. It's so over the top though I was laughing in the last scene waiting for all the hetro, conservative reviewers falling over themselves to shovel hate on it."}, {"id": 115, "text": "Got the feels. Loved the songs. James Corden and Andrew Rannells' characters are great."}, {"id": 116, "text": "The scene with Alissa and her mom at the final prom reminded me of my mom and I when I came out and the scene with Barry and his mom was so touching i cried my eyes out. So much emotion from start to finish. Say what you want but I enjoyed watching James Corden in this production."}, {"id": 117, "text": "This movie is so good, watch it before you judge it."}, {"id": 118, "text": "It's a beautiful story! Yes there are some campy musical numbers but who cares. I laughed and cried. I highly recommend!"}, {"id": 119, "text": "A bunch of PR obsessed Broadway actors come to a small town to protest a lesbian girl not being allowed to go to prom and learn a bit about themselves along the way.Musicals aren't usually my thing, but I found it hard not to be charmed by moments of this. The cast is excellent, the musical numbers are bouncy, and the message is beautiful."}, {"id": 120, "text": "All the love and laughter and tears that I needed to forget about how hard things are right now. I want to be friends with everyone in this movie! Also, the takeaway message is on point."}, {"id": 121, "text": "I will always love Meryl. But Meryl, what were you thinking? Obviously you weren't. Was The Prom this year's Cats? Is that even being fair to Cats?"}, {"id": 122, "text": "I must admit that I absolutely loved this movie. Unfortunately, the play did not make it to Australia so I have no comparison basis. It is as simple story which teaches about tolerance and acceptance, such simple concepts yet widely ignored and the year is 2020! The cast is engaging, the music and choreography are amazing, it has a good pace and it put some tears in my eyes but mostly big smiles and by the end I was happy and hopeful. I also loved all the references (either in lines, songs, gestures, etc....) to other musicals. Not the movie for Blood Thirsty Zombies or Car Exploding type movies' lovers, and I can only figure out that the low score will come from this crowd."}, {"id": 123, "text": "I didn't know this was a Broadway musical before I watched the movie so have nothing to compare it to but I enjoyed it immensely. I loved the cast especially the girl who played Emma.. she has a great singing voice. I am not a fan of Nicole Kidman ( probably a sin given I am Australian..ha ha) but even liked her in it. Just watch it , enjoy it and if you are homophobic then shame on you .. we are all equal."}, {"id": 124, "text": "Favorite movie of the year! Absolutely loved it! So much fun, great musical. So much cheese but in a great way! Love love love this movie 😍😍"}, {"id": 125, "text": "It's a good concept, except for the stuck up theatre stars. I love Meryl Streep but I absolutely hated her in this movie. Nicole Kidman was great, she reminded me back to moulin rouge. The music was beautiful, the message was perfect. Overall it was a good movie."}, {"id": 126, "text": "Was waiting for this and it is a major disappointment. The only shining light is Andrew Rannells. I fast forwarded for his scenes."}, {"id": 127, "text": "But worse.Great cast wasted on sub-par material."}, {"id": 128, "text": "Ryan Murphy shows once again his brilliance. The Prom, while making fun of everyone and everything in an edgy fashion, in the end has just a disarming message for everyone: let Emma go to the prom; straight or gay does not matter!The writing is sharp and funny. The songs are catchy. The actors are delightful. Murphy's movie version knows to capture and deliver the big and small moments. While Glee lost it's soul, becoming a direct-to-iTunes music video commercial, The Prom makes you feel warm and fuzzy.It captures the best of the old Hollywood musicals, or the Stephen Sondheim kind, while being modern and can melt hearts of everybody ... if people will allow it to."}, {"id": 129, "text": "Well... That was... I mean... That was a CHOICE! Production is on point for sure, but everything else... James Cordon and that guy Andrew ruined everything for me. There's too much of Corden to ignore in The Prom, but there isn't much to like..."}, {"id": 130, "text": "Giving all my stars to Meryl Streep. Removing Meryl Streep from the equation because she is fantastic as always. The rest of this film is nothing but cliches, stereotypes and pedestrian choreography. Andrew Rannell is COMPLETELY underutilized! Nicole Kidman, stop making her try and dance! Uugghh! And exactly what accent is she supposed to have in this film? James Corden, God love him but he's always James Corden whether he's doing musicals on a crosswalk or starring opposite Meryl Streep. Honestly I'd never heard of this production until the Netflix presentation. With the glitz, over the top trailer and stellar cast I went in with high expectations. Shame on me. I did like Keegan-Michael Key's song. It was a surprising delight and brief departure from the rest of this musical mess. I LOVE musicals. They are my favorite genre! Watching The Prom was like watching paint dry on cardboard."}, {"id": 131, "text": "This was a great feel good movie, I see that a lot of people didn't like James Corden, I personally didn't like him in this role either. I think Tituss Burgess would've been a better choice, however that's just one peace of the movie and I don't think that's a good reason to give this movie one star, come on people, ugh... y'all so ANNOYING!!!!!!"}, {"id": 132, "text": "I've never bothered to write a review previously but I genuinely enjoyed the film. The songs are catchy and the acting in on point to the type of film this is! They poke fun at themselves and still get a good message across. Well worth watching."}, {"id": 133, "text": "This was sooo good!!!!!! Great writing!! Great cast..love your characters!! What a wonderful message!! The choreography!!!! The music!!!! Thank you Ryan!! We dont need riots and destructive behavior to get messages and everyone to listen!! This was done in good taste and checked all my boxes!! And I'm straight and a Senior!! God bless us all!!"}, {"id": 134, "text": "I love this movie. I thought the acting was where it needed to be and Kudos to all. So many Americans are ignorant when it comes to these subjects and the feelings that go along with them. For our children's sake, if you're willing to learn some different ways of thinking then it's a good movie. It's feels like an entry level movie to basic humanity. Reminds us about being open minded and loving our neighbor. I hope people give it a chance and understand where it's coming from"}, {"id": 135, "text": "This was pure Fun Escapism! Meryl! James! Nicole! What more do you need?! Songs were ace and the film was Bright &amp; Bold and Beautiful to behold! It also sends and incredible message of tolerance and acceptance and equality for all, which is still relevant and important in this day and age! And as for James stereotypical portrayal of a Gay Broadway Star! I thought it was Brilliant! Full of Heart &amp; Humour! What is wrong with a straight man playing an effeminate Gay Man??! They are just as much a part of the Gay community as straight acting or any acting Gay person. Love Wins! And this film has certainly Won my Love! Thank you Ryan Murphy!! And all who brought this Gem into our lives xoxo"}, {"id": 136, "text": "Amazing film. Fantastic score throughout. Meryl Streep is incredible as usual. A really good cast, great singing. A film we really needed in 2020 when we've all had such a challenging year in so many ways."}, {"id": 137, "text": "I loved it! The music was catchy, the acting was superb, the sets and costumes were gorgeous, and the message was timely. This was a best-in-class version of what Ryan Murphy can do with a big budget, great actors to work with, and strong source material. It was joyful, touching, campy, and funny. It's skewered self-important Broadway types while poignantly letting us empathize with the marginalized main character. I didn't notice any auto-tuning, however the singing was pitch perfect so that might explain it. As far as the criticism of James Corden's slightly over-the-top Broadway queen, as a gay man I had no problem with it. James Corden has a great voice, and I know plenty of gay men who act like that. I also know plenty more gay men who don't act like that, but that's not the point. He played to character. This show made my heart sing, and it was exactly what I needed after this year. The Prom clever escapism done exceptionally well."}, {"id": 138, "text": "I loved this movie! When I heard Keegan-Michael Key had a new movie coming out and it was called The Prom, I quit listening because I think he is that great and I knew I was going to watch it right away. I was surprised it is a musical, but it was a delightful surprise. I was only surprised because, as I said, I quit listening.All the musical numbers are quite good, some are really excellent! I thought everyone, and there are sooo many important names in The Prom, was wonderful. The amazing Meryl Streep is here and so so good. To think how good she is in so many different characters is unfathomable. I loved Andrew Rannells in The New Normal and it was so wonderful to see him here. He brings something special to everything I have seen him in. I have never paid attention to James Corden before, but he was really great. He was funny and selfish but also selfless and poignant. I don't see how you could watch the movie and think that he was not wonderful. Nicole Kidman was great as the most thoughtful one-on-one of the Broadway bunch. She is so beautiful it is hard to wrap your head around it. That's not important to the movie, but it is unmistakable. Kerry Washington was so convincing as narrow minded and defensive. Django Unchained convinced me that she is the most beautiful woman in the world, and this one had me seeing her as one of the most controlling mothers in the world. It is the role of actors to see the character and not the actor walking around. They were more than wonderful.The movie made me think about whether narcissism rooted in abandonment and self survival is less or more deeply entrenched than narcissism rooted in pure conceit and entitlement.This movie made me very happy even if I also sobbed like a baby more than once. If you do not know what it feels like to be an outsider no matter what the reason, I cannot image what kind of life you have had. The reason here is played out over and over all over this country and many others. To have the story told with a peaceful resolution is not simpleminded, it is modeling. We all have the choice to do better. This shows that eventually happening."}, {"id": 139, "text": "In spite of some pacing issues during the 2nd half of the movie, The Prom is a great time and one of the better movie musicals of the past 20 years. The cast is great and Meryl Streep hasn't been this funny in ages. I was also surprised by how much her singing voice has developed. Maybe these songs are just more in her range, but she's never sounded better. I laughed, I cried, I smiled from joy - it gave me everything a movie musical is supposed to and I can't understand where any hate is coming from."}, {"id": 140, "text": "I love this movie 100%! Will watch this movie over and over!!!"}, {"id": 141, "text": "We need more movies like this. Happy and uplifting."}, {"id": 142, "text": "202012120813myt. LOVE the movie, its great movie ending 2020 for new start come what may."}, {"id": 143, "text": "I have never been big fan of Ryan Murphy since his movies and series are so similar. I gave this a chance since my boyfriend loves musicals but I have to say- after 25 minutes I couldn´t continue. Super boring storyline, boring acting and not a single catchy song. Even Meryl Streep couldn´t save that train wreck."}, {"id": 144, "text": "I had the lowest expectations for a film version of a just ok Broadway musical. Wow. It's not perfect but it's perfect for right now. Great cast, great message. If you're not a musical theater fan or interested in stories about LGBTQ+ tolerance, then best stay away. It's not for you. But if you like these things or are open to learning about them and have ever been to a Broadway show it somehow captures some of that magic. During a time when theater's return is looking iffy at best for another year, I'll take it. They all look like they were having the time of their lives making it and that joy is infectious. Meryl Streep has said the experience changed her in interviews. She really can do anything. And who knew Keegan-Michael Keyes could sing?? It's lighthearted fun that lights up the end of a dismal year."}, {"id": 145, "text": "I put it on to watch Smithy be all Hollywood and I was not disappointed! His biggest hit since cats! Go Smithy!"}, {"id": 146, "text": "Started off positive being someone who enjoys musicals and understanding that musicals often challenge controversial issues (think hairspray).Great names, great acting - seriously crummy story.I'd be better off watching an educational about fresh food a jungle."}, {"id": 147, "text": "Jo Ellen and Ariana were perfect! Their voices were beautiful and inspirational. Loved the plot and chemistry between the cast. I was in tears many times."}, {"id": 148, "text": "From beginning to end. Enjoyable. Fun. Amazing cast. Love the songs. A much needed movie."}, {"id": 149, "text": "Fantastic costumes and gorgeous dancing! Meryl Streep is a rock star (obv) but Corden stole my heart! This show should be viewed by every teenager in the US"}, {"id": 150, "text": "I don't get the haters on here. Sure, it got a little long in spots, but when was the last time you saw a blockbuster musical film like this? The production was insanely over the top (in a good way) and most of the performances were terrific. We loved it."}, {"id": 151, "text": "I enjoyed this film. It made me happy. The dancing, singing and music. Reminded me of Mama Mia with one song after another, non-stop. It had a simple message, LOVE. Haters will hate, critics will criticize but no matter what others think. I liked it."}, {"id": 152, "text": "I didn't know what to expect and was pleasantly surprised. The whole cast is amazing. Everyone should see it."}, {"id": 153, "text": "I don't know what to write, this movie is everything, this movie is amazing, awesome, and absouletly fascinating, i really not expecting all of this, i though this movie will be an usual musical movie, but the real thing is this is unusual musical movie, like i said before this movie is everything, there's a lot of lesson that you can take it from this movie, learn to love your family, learn to love, accepting, and understanding your kids, learn to not differentiate people, no matter if she or he is gay, lesbian, transgender, straight, and all of that because they all same, this movie makes me happy, angry, and cry, all the song is beautiful, jarring and amazing, the ending is perfect, this movie have a pretty long duration but i enjoy all the moment and just not want this to end, for me personal this is the best movie in 2020, highly recommended and remember being different is normal"}, {"id": 154, "text": "THIS MOVIE IS SO AMAZING! IT IS SO CREATIVE, COLORFUL, UPLIFTING, AND POSITIVE!! I LOVE MUSICALS SO MUCH AND IT FILLED THE EMPTINESS IN MY SOUL SINCE BROADWAY IS CLOSED!!! IT HAS SUCH A GREAT MESSAGE AND IT IS SO HOPEFUL!"}, {"id": 155, "text": "Oooh, this is the joy we need at the end of 2020! The musical is not one of the greatest ever, but it has the makings of a comedic and fun tale using stereotypical characters. The message is simple: love is love.It's sad to me that the movie is receiving such backlash - the antithesis of the message! It's a tale about love. It's a tale about acceptance. The majority of the characters are created from stereotypes and foolishness.The dancing is not Chicago; the singing isn't Les Miserables. They aren't supposed to be.I had fun watching this and soaking in the sweetness of it all."}, {"id": 156, "text": "NOMINATION BUZZ! Great cast,Great music,Greatmovie."}, {"id": 157, "text": "I loved this so much, for so many reasons!! Love, acceptance, joy!!"}, {"id": 158, "text": "Loved it came here just to write a review Songs are catchy , Merryl your voice is getting better and better! Cordon bittersweet moments , Nicole you always shine and so beautiful wish u were in it more. Rannels your a crack up love you and Keegan I wish there was principals more like you . Rest of cast Jo Ellen and Ariana loved your singing as well as critical mum Washington wasn't over the top . I've seen it twice in 24 hours"}, {"id": 159, "text": "Boy meets girl , girl meets girl in a small town homophobic Indiana High School. Touching at times and annoying the rest. At least Nicole Kidman still looks good. Since everything is closed due to COVID and there's nothing else to do I guess it's worth the time."}, {"id": 160, "text": "I never heard of this musical before and I was pleasantly surprised. The songs were fun and the cast looked like they were having a blast. The emotional heart of this film got me because I still don't understand people who don't understand that you can be whoever you want to be and that love is love. If you are a fan of musicals, give this film a watch."}, {"id": 161, "text": "Nice story. I really enjoy the core actor it's, and fun to see them signing. Nicole Kidman and Meryl Streep are particular favorites. Very upbeat show."}, {"id": 162, "text": "A film so filled with clichés it made me want to go back in the closet...Seems to work for the Ryan Murphy groupies though."}, {"id": 163, "text": "Honestly, the movie storyline is still currently the subject of all times. No matter what year we gonna be past and future ... there will always be discrimination, bullying and struggle for those people who wants to come out. The singing are awesome."}, {"id": 164, "text": "I love the movie and the song and the actors - every one and I know I will be watching it again and again"}, {"id": 165, "text": "Lighten up folks (off-the-mark professional critics)--it's fluff and full of great talent. Watching Streep's send up of La LuPone was awesome. The rest is a message that needs to be sent time and again until the bigots get the message. Great to see James Corden work himself up into a lather, along with the fabulous Nicole Kidman and Andrew Rannells. Honestly, what was there about this production that couldn't be liked? It even kept me awake and interested at 8:30 at night."}, {"id": 166, "text": "The Prom 2020 12A Director: Ryan Murphy Starring: Meryl Streep, Nicole Kidman, James Cordon, Keegan Michael Key, Kerry Washington, Andrew Rannells, Ariana DeBose, Jo Ellen Pellman etcOverall rating 31/100The prom is about a group of self obsessed narcissistic theatre stars who travel to the conservative state of Indiana, in support of a high school girl who wants to take her girlfriend to prom. Apart from a few sweet moments and fun distractions the prom was absolutely terrible, missing in the mark in so many different aspects, so lets get started.I am going to be nice and start with a few positives. Its cinematography was good and the soundtrack was great. The movie did look visually fantastic, with breathtaking set locations and costume designs, and provide a good visual distraction from the movie. The Soundtrack was also fantastic. There was some fantastic songs in the movie that were very catchy and took you into a different world distracting you from the movie itself which provided some moments of greatness, with great vocal performances from the cast.However. My first few negatives would be the rushed beginning with no background or development, the offensive LGBTQ casting, the lack of convincing conflict, and the poor set up making most of the characters very unlikeable. I thought the movie had a very rushed beginning which didn't make a lot of sense, the movie just started straight away with the main set up for the movie of the main character not being allowed to the prom, without one single bit of development or background into the plot or any of the characters, the movie was just expecting you to know what was going on and care about the characters straight away and it didn't work. I also found the casting of James Corden terrible and offensive. No offense to James I do like him as a talk show host, but not as an actor. A straight man playing a gay character like this was a very poor decision, James's performance was very bad and offensive to the community that the movie is trying to represent. I also thought that there was a complete lack of convincing conflict throughout most of the movie. The conflict just lacked any form of believability and it just made the cast of theatre performers seem even more self obsessed and unlikeable, none of the conflict was very convincing and it just didn't leave any impact. I also thought the set up of the main plot point including all of the characters was poorly done and made most of the characters seem very unlikeable. The main motivation for the characters to help the main character go to her prom, was to get good publicity for themselves, this instantly made them dislikeable and the movie never did enough to convince the audience that they had changed throughout the movie.My next few negatives would be the generic high school formula, bland script and corny tone. The movie followed such a generic high school formula, where there was just a bunch of characters with no personality there to create generic conflict or to reflect a part of society, all following generic and lazy character types that are just boring now. I also thought the script and tone were very corny, there was so many generic lines of dialogue that were so cringy and poorly executed by a lot of characters it really dragged this movie down, for a movie with these kinds of themes the script needed to be a lot more powerful and heartfelt than what it actually was.My final few positives would be the performances from Meryl Streep and Nicole Kidman, some decent character conflict for the main character, and a partly heartwarming ending portraying the representation and the themes of the movie well. Meryl Streep and Nicole Kidman made the movie for me, Meryl as expected was fantastic her performance was fun and charming, her musical numbers were fantastic and she stole the show every time she was on the screen, Nicole Kidman also did this for me, she was criminally underused for the movie but seemed the most actually genuine character in the movie and her musical numbers were also fantastic. I thought that there was some decent character conflict for the main character, the concept of the school making a fake prom for the main character, it fitted with the theme of the movie and the isolation for the main character, making the leaders of the prom committee very unlikeable. I also thought the ending was heartwarming and was the one place in the movie where it portrayed the themes and representation of the movie well, having a prom where everyone is accepted and the admittedly powerful musical number was excellent, everyone was accepted and it really showed a positive representation and portrayed the themes well, its just a shame that this was not executed throughout the whole movie.My final few negatives would be the movie playing it safe with its LGBTQ themes, lack of character depth, odd narrative structure and inconsistent with character screen time and its structure. The movie played it way to safe with its LGBTQ issues and themes, this movie had such a big importance on acceptance and different peoples experiences, it had hardly any of that, There was teased moments with the main character and her parents but it was never included and the stupid insults made the film feel very unprofessional and it just didn't handle or execute these themes or the proper representation for most of the movie. There was also a complete lack of character depth for any of the characters, the movie just thought having one moment of some form of depth ordevelopment or depth was enough to carry the movie it wasn't, the attempts at death was largely just exposition and long pieces of dialogue, the main character completely lacked depth, she wasn't in the movie enough, and she felt more like a plot device for the theme of the movie than an actual person or character. I also thought the narrative structure was bad and poor, the movie had its climax randomly in the first quarter of the film, and then a very slow build to another climax with the different prom, this really effected the movies pacing and dragged the movie down a lot. And finally there was inconsistent character screen time with the structure, The movie didn't have a clue how long to have each character in the movie, it was completely messy and messed up the pacing and how much we cared for the characters, most of them just had a couple of scenes and then it moved onto someone else.Overall, apart from some visual appeal, some good songs, Nicole Kidman and Meryl Streep and some good representation towards the end, The prom has nothing, and did nothing for me, lacking the believability and authenticity that this kind of movie needs, also with poorly constructed plot and characters that lacked any notable development or depth."}, {"id": 167, "text": "The prom is as hypocritical, opportunistic, manipulative as the characters that it wants to criticize. Always too busy trying to be appreciable, recognized, praised for his commitment to the good cause, trying to appear good, innocent and honest (and to include as many product placement as possible) that it neglects everything else with extreme superficiality: from the two-dimensional and stereotypical characters and the mediocre choreographie to the repetitive, forgettable and corny songs. Nothing really works, not even Meryl Streep can save it and at the end it's difficult to ignore the sneaky intentions behind the shiny lights and the glossy colors."}, {"id": 168, "text": "I love everything but not Emma character Emma and her partner , if you just wanna dance with your partner just dance why you have to make it such a issue. i fell so sorry for the song, costume, dance choreography this movie will be really really good, if you don't pay most attention on Emma character really waste resouse."}, {"id": 169, "text": "That is another disappointment for me what a year! Such a big production looks like lots of money spent. First of all singing does not sound real as top 4 they should be famous singers if they could sing that well. Film full of cliches you can easily guess what will happen next and songs are very basic they all sound like a high school musical. It could be an amazing film but sadly it didnt happen."}, {"id": 170, "text": "Jis Joy - #AsifAli again joining for a new movie after the success of #VijaySuperumPournamiyum... Script - Sanjay Bobby... Shoot from - 2021 Jan Last Release Plans - July 2021 theatre release... Distribution - Central Pictures...Jis Joy - #AsifAli again joining for a new movie after the success of #VijaySuperumPournamiyum... Script - Sanjay Bobby... Shoot from - 2021 Jan Last Release Plans - July 2021 theatre release... Distribution - Central Pictures..."}, {"id": 171, "text": "This film start with the prom cancel by the PTA, and the introduction of two broadway stars(Dee Dee Allen, and Barry) scene! As turnout, this film is about four celebrities(Dee Dee, Barry, Angie, and Trent) need to bring back their fame by helping a lesbian girl Emma attending the prom! Entire film full of inspiring song, and touching scene! Make the film quite watchable! Touching scene! Such as, Dee Dee become a generous person after she met Tom! Emma been left at the empty gym hall, while her crush Alyssa attending another prom! Dee Dee, Barry, Angie, and Trent contribute the money for Emma to organize the prom! Barry eventually forgive his mom for not understanding his sexual orientation! Emma invite Barry as her date to the prom, because Barry has an unhappy prom experience at his young age! Mrs. Greene eventually accept Alyssa sexual orientation! Alyssa, and Emma eventually get back together! At the end, Emma successfully organize the inclusive prom! Still have a post credit scene! All the winners at the prom showing their award titles to the audience! That's it! A quite entertaining film!"}, {"id": 172, "text": "I have seen the Broadway show and now this -loved both. All the main characters are all so talented. All this talk about james cordon is so ridiculous he is one of the most talented people around. I will be watching this again. Don't listen to the downers just watch and be happy. We need joy in our lives at this time with all that is going on."}, {"id": 173, "text": "What a fun little movie. I'm a big musical theater fan and somehow I missed The Prom. It's a good old fashioned musical and Ryan Murphy did a nice job directing. However, now that James Corden got to live out his childhood dream at last can people please stop casting him to act? He's a great performer and talk show host and miserable to watch as an actor. If Cats didn't stop this madness, The Prom should."}, {"id": 174, "text": "Talented artists, some fine songs, don't over think it just enjoy"}, {"id": 175, "text": "Watch this movie! it gives you a message against racism and intolerance that we need to remember!"}, {"id": 176, "text": "I mean the basis of the movie of people helping out a child in a small town who was being oppressed because of her sexual orientation is great. But when they start throwing all the other garbage. It side tracks from the main issue. It just could of been done with alot more ethical thinking and logic. It almost turns it into trash. It makes wrong generalization about all sorts of different people. So according to this movie if you're conservative you hate all LBGTQ people which is not the case at all. Love is Love period. You love who you love regardless of whatever they are."}, {"id": 177, "text": "Seriously, keep religion out of movies unless they're specifically about religion."}, {"id": 178, "text": "A group of narcissistic actors desperately in search of a hit, decide to find a cause to help promote themselves. They discover a girl in a small evangelical town who is gay but cannot take her partner to the prom. The celebs decide to 'help'.Essentially a long episode of Glee with one belt it out loud number after another. Whilst this is a bit of a swipe at homophobic small town America and hammers inclusion, not very subtly throughout, there is plenty to enjoy here if you can swallow the schmaltz and a plot like a Mickey Rooney / Judy Garland musical. Streep inevitably walks away with this - very nearly, as Corden is at his best (frankly not that hard) and they both perform some impressive numbers and happily send themselves up leading to both funny lines and some convincing drama, mainly from Corden. It could probably have been15 minutes shorter and Kidman seems quite out of place, otherwise it's fun, undemanding musical stuff."}, {"id": 179, "text": "Catchy, easy listening and fun while bringing attention to some common and saddening issues facing LGBTQ+ youth"}, {"id": 180, "text": "I went in dreading this... I was afraid it would be another Mamma Mia: another musical with Meryl Streep and brain-dead lyrics. Wrong! I didn't realize this was based on an actual Broadway show, and that pedigree showed up immediately in the clever, funny, snarky, and sometimes insightful lyrics. It's nothing horribly profound, but it _did_ make his 60+ straight white guy tear up several times. And I laughed out loud even more often than that! Great fun. I told my wife I might even want to watch it again... she demurred for herself, but I meant it. Streep is great, James Corden is fine, and every member of the cast pulls off their roles well. The end is a bit much, and there are a few characters whose turn-around is unconvincing, but those are the exceptions, not the rule. (And keep an eye out for Tracey Ullman, of all people, showing up in an extended cameo!)"}, {"id": 181, "text": "In a year like this, we need a feel good musical and this fits the bill completely. With a powerful message Of inclusion and the reminder that 'loving your neighbour' is the most important commandment. Great songs and phenomenal choreography and a stellar cast."}, {"id": 182, "text": "Don't let the rating fool you. It's camp as hell and it's terrific. NY meets hick town. I loved it! Only thing missing was Jeffrey Star! It was like a big Glee fest"}, {"id": 183, "text": "Love it! What a closing for this 2020! The cast, the music is inspirational. Shimmering, costuming, and choreography is fantastic. The story is just perfect for this time of change. It is a fun ride. Love it. Come on, Oscars, some nominations."}, {"id": 184, "text": "The Prom is most likely not the best film you will see this year. There are plenty of complaints about James Corden and others regarding their acting, singing, dancing, etc. abilities, but he truly isn't the worst part of the film. The fairytale attempt at solving issues that LGBTQ+ people face in their personal lives is. But for the sake of film, that is all fine and dandy. It's supposed to make us feel happy and sad and ultimately root for the characters. The second fault the film has is that it barely focuses on Emma, the main character. It seems like the supporting cast from the gigantic hollywood superstars overshadowed the entire plot of Emma trying to go to Prom with her girlfriend. But it's still worth a watch. The singing is good, it's entertaining (though does drag a bit), and it's an important message all around. Plus it's new and aren't we all looking for something new these days!?"}, {"id": 185, "text": "This musical is a great satire of the disconnect between the Coasts and Mid America. Even though it's only 2hr10min, it feels like it drags in many parts in the middle. Also, the premise is super difficult to suspend your disbelief for."}, {"id": 186, "text": "A very inspirational story with awesome cinematography and great acting performances. The whole cast made me feel all warm and fuzzy"}, {"id": 187, "text": "The people who rate this movie lower than a 6 are the people that watch this and don't think it's about them or that they can't relate. NEWS FLASH you relate....just to the bigoted people. This is an amazing cast with a great story and more people need to watch this and more stories like this need to be told....Period."}, {"id": 188, "text": "I don't normally go for musicals, but this film is an exception. The music really carried this film along. Enjoyed the celebrities who starred in it, as well."}, {"id": 189, "text": "Although I like what the movie tries to do, it is filled with stereotypes and might even be polarising... Shameful, because I normally really like anything Ryan Murphy."}, {"id": 190, "text": "It's about time that someone is brave enough to call out the hypocrisy of so called Christians, bigots and close minded people. Soooooo tired of the heterocentricity that is so constant in film. The Prom was so very refreshing! But then again I'm biased I guess... I've been out of the suffocating closet since age 13 and longing to see a good show wherein the lesbian doesn't get killed off or portrayed as some evil man hating female but rather as a smart, Thoughtful, courageous person... after all this is how most of us lesbians are in real life. BRAVO!"}, {"id": 191, "text": "Best movie in 2020, this movie is heartening! Deep meaning and full of love."}, {"id": 192, "text": "This is beautiful. I love it. this is hit me really hard"}, {"id": 193, "text": "May have only seen the medley on the 73rd Tony's, but this was twice as awesome!"}, {"id": 194, "text": "The Prom is a excellent example on how a musical adaptation should be. Its songs are perfect and the cast is perfect and the good thing is that they didnt change anything big."}, {"id": 195, "text": "As a fan of musicals, my expectations were pretty high. But after Streep's number  It's not about me, I knew I was in for a treat. Since the cast is having a blast, you just dive in with a huge grin on your face. 2020 has been so horrible that this movie lifts your spirit and gives you hope for better days ahead. Murphy's magic does it again !"}, {"id": 196, "text": "All big stars were great. There is no need to add anything about Streep, Kidman, Korden, Key, Rannell. They were awesome! If you like those bunch, you would like their performance. Another thing was newcomers. Those young actors were brilliant. They sang even better than those big shot stars:) Music and story was very compelling. Of course any movie musical could be a risky thing to do, but this was good. Musicals are maid for positive and loving energy. Like any superhero movie - there would be some things that you would think could have been done better. But... jut enjoy)"}, {"id": 197, "text": "Loved this movie! It was hilarious, visually stunning, a little cheesy (in a good way lol)....and definitely touched my heart. Highly recommend."}, {"id": 198, "text": "Just finished watching it and I loved every minute of it. When I heard that this movie was coming out I looked up the musical version and had been listening to the songs ever since. From the actors to the story, every part of it was amazing. I really don't know why people are criticizing James Corden. No matter what other people say I thought he was great. As a mother of a 14 month old boy who really doesn't have anytime to do anything, I think this movie was worth watching. Once again, loved it!"}, {"id": 199, "text": "A delightful film with a terrific cast and great songs. All about acceptance."}, {"id": 200, "text": "Liberal tropes and boring storyline. Netflix mostly makes newage woketainment and this certainly fits the bill. Netflix makes checklist garbage."}, {"id": 201, "text": "I really love it. The story is rather a cliche but it echoes family value. A perfect movie for a family night."}, {"id": 202, "text": "This was better off left on the stage. If you grew up gay in the 60s and 70s, which I did, and even today there is no semblance of reality in this banal, shallow piece of crap. Ryan Murphy should have his gay card revoked. And, I cannot believe the stellar cast could take any of this seriously. The vanity is intolerable and I don't understand how the cast didn't laugh their asses off at the drivel while they were shooting it, let alone when they read the script. Art does not imitate life in this one. I hope that the gay youth of today don't watch this and believe one iota of it could have any impact on their lives. Truly sad!"}, {"id": 203, "text": "The cast is great so I decided to watch it. The music is horrible and the story cannot be more corny. At some point like 10 minutes before the end I had enough and changed the channel. I love musicals from classics to modern but this was unbearable."}, {"id": 204, "text": "Pros: It certainly had glitter. Star quality cast. The story had depth and obviously deserved to be told. A couple of songs really stood out and I'm sure, after a couple of listens, you would be humming them round the house.Cons: Star quality cast. I didn't know this was a Broadway production. On finding this out I then realised that it was produced to give actors that had never got the chance to be leads, to become leads. Apparently, the original cast auditioned for their own rolls but the decision was made to go for STARS. They mostly did a good job, but did we need them? James Corden casting was wrong. I felt it was just insulting to put a straight guy in the roll. I know he's an actor, he plays many different rolls, but that's my opinion. He played gay as a straight guy would to try and get the laughs."}, {"id": 205, "text": "Full of good intentions and GREAT musical numbers, especially from Meryl and Nicole. Kudos to Andrew Rannels too, he was much better than I thought he would be 😂"}, {"id": 206, "text": "Totally over the top and totally fun. Dancing and singing great."}, {"id": 207, "text": "I may be biased as a fan of Glee, but did thoroughly enjoy watching this film. Great ensemble cast, with some sparkling performances from everyone. I didn't view with any preconceptions, and was hooked from the first burst into song and dance. Just what we need in these weird times."}, {"id": 208, "text": "The acting wasn't the best, but since it is a musical, does not matter so much.The songs were great, the singing was pretty good, and the message in general was spot on.Only drawback is the generalization of a small midwest town. The movie's theme was to open the mind, but did its self a disservice by stereotyping what the midwest is like..."}, {"id": 209, "text": "The idea is very uplifting and great, and it's truly important topic, yet it doesn't look genuine. It is quite weak, sort of a mockery in a way. They could have made much more out of such an idea. It feels like they are doing it just because it's a hot topic. Even if in reality they are genuine, it just simply doesn't look so."}, {"id": 210, "text": "This wonderfully heartwarming musical is exactly what we all need at the end of an awful year. A rollercoaster of emotions so well presented by the cast. Unfortunately even now, there remains prejudice against LGBTQ community and this beautiful story warms your heart through and through. Songs are catchy and dances just brilliant. Fabulous film!"}, {"id": 211, "text": "The movie plays like a stage show. Campy, exciting, story, songs! What a beautiful treat. I cried, laughed, and fully enjoyed myself. On top of it all, a beautiful reminder to continue building a space for ALL. I can't wait to watch it again."}, {"id": 212, "text": "Don't get me wrong, I did like the movie but it almost did my head in. There were more musical numbers in this movie then any musical I have ever seen. 17 Musical Numbers 🙀"}, {"id": 213, "text": "Is scintallating in the Fosse number.I kept seeing Little Fires Everywhere"}, {"id": 214, "text": "I loved everything about this .... except James Corden! If Andrew Rannells played Barry it would have been perfect (Andrew was wasted in this movie)! Meryl was amazing (as always), Nicole - boy the actress can act, pure perfection! It was just 2 hours of smiling and fun"}, {"id": 215, "text": "Why is James Corden in this. He has half an American accent and half a British accent. He's like Emma Watson. There weren't Broadway actors that could play that role? They're all out of work right now. Andrew Rannells and Ariana DeBose aren't enough. They went for name recognition and not people who can actually sing."}, {"id": 216, "text": "We couldn't pass the first 30 minutes! It was horrible! The story the music the dances! None of them made sense! The characters were mot likable.... I don't know why Nicole Kidman and Meryl agreed to be in such a horrible movie! The rating should be 3 not 7! Seriously! It reminded Cats for me."}, {"id": 217, "text": "Loved it. Have me all the feels absolutely amazing"}, {"id": 218, "text": "James cordon is the reason for the low rating. Other than that it was ok."}, {"id": 219, "text": "Meryl Streep in an LGBTQ-themed musical! What's not to love? Sadly it's all autotuned singing, plastic colours, gel lighting and ugly cinematography. As well intentioned as it may be, it's difficult to find much authenticity or real emotion in the characters."}, {"id": 220, "text": "A lovely &amp; light hearted film of Broadway meeting rural Indiana. The songs are awesome &amp; the acting, staging &amp; singing are all wonderful. Don't let the haters put you off watching this fantastic gem of a movie."}, {"id": 221, "text": "Middle aged mom here. I adored this. A feel good love letter to musicals with a message of inclusivity. What an ensemble! Capping off 2020 this is exactly the film I need right now. I hope that we can download the soundtrack."}, {"id": 222, "text": "I really loved the stage version of The Prom. This movie does a pretty good job at doing the story justice. Overall I really liked it but I had my issues with it, the whole story line with Barry needing to let his mother back into his life kind of glorifies forgiving toxic people just because they're family, that story line could have been left out and they could have focused more on Emma and Alyssa's relationship, the whole story revolves around them wanting to go to prom together but they don't get nearly enough screen time on their own, much less together. The other problem I had was the fact that a couple of the songs are cut before their over and they sound off, like their cut in the wrong place, and maybe I'm just too used to the Broadway versions of the songs but it didn't work. Despite what this review might seem like I really enjoyed this movie because I never actually got a chance to see the Broadway show live and with Broadway and theatres everywhere still shut down I may never get to see the staged version. So many people can't afford to see live theatre and making this movie gives them a chance. Overall, it's a good movie but, I wish a few things were different."}, {"id": 223, "text": "For those looking for reality, look somewhere else. For those looking for a feel good time and fantasy, watch this. Great performances from the cast especially Ms. Streep. Kidman is awesome in a support role. Music, dancing, singing top notch by entire cast. We need this type of fun and fantasy in these trying times which also sends a deep message at the same time for gays and lesbians. Can't forget they are human beings with feelings. The Prom brings this all together. I guess you could call this a 'realistic' fantasy !! See it again and again. Reminds me of a combination of Bye Bye Birdie and Glee. Like Glee the editing of the dances is not right. Too much editing ruins the dance numbers. Why not just focus a while on the whole number and not jerk it around. Same thing that ruined Glee. Do like Fred Astaire insisted upon. Keep the numbers intact and keep the editing at a stand still and let the performers PERFORM. It's really cheating the great choreography. Other than that this is a must see!!"}, {"id": 224, "text": "So many musical numbers, great performances, amazing actors."}, {"id": 225, "text": "And then exited... if thats your opening play then you don't know the world let alone your audience. James is probably a really nice guy - he keeps saying he doesn't know how he has got where he is...and I agree!!... Truman show maybe? And within that four minutes, Streeps accent and hamminess... just awful. Ryan Muprhy is also why I ditched AHS... I don't mind a point but being beaten over the head with it (yeah, yah, fill your boots) was just too much."}, {"id": 226, "text": "Full of cliches , boring and miscast James Corden. Avoid"}, {"id": 227, "text": "Campy fun, catchy songs, great dance numbers, great performances, really can't understand the Corden hate here at all.. It's light, fun and uplifting. Stop being a negative Nancy and just enjoy!!"}, {"id": 228, "text": "I loved this film, if you like musicals and glee, i reckon you will love this."}, {"id": 229, "text": "I don't understand the hate for James Cordon. I don't even think he played the part in a gay stereotype. I think it was very much like his actual personality. He repeatedly made me cry.It was awesome to see Nicole Kidman in a musical again.I really just loved all the performances!"}, {"id": 230, "text": "It's fun, positive, feel good movie with a great message!"}, {"id": 231, "text": "Camp and loud and fabulous. A good message , great show tunes and a bit of fun in grey times"}, {"id": 232, "text": "Very disappointing. Totally irrelevant and outdated, at least by European standards. By US and Indianan,maybe not (sadly). Can't believe that Meryl Streep and Nicole Kidman went into this.Besides: Nicole K far to botoxed (again: sadly) Meryl S. not ( well, good for her..)"}, {"id": 233, "text": "Considering some of the bad reviews this received from professional critics and knowing Hollywood doesn't know how to make musicals anymore, I expected this to bomb. Instead , it's extremely entertaining, and wonderful in an over-the -top, glitzy , glamourous way. While it does drag a bit during the non-musical segments and is extremely cliché, there are no surprises, it completely soars during the many musical numbers and the songs themselves are for the most part pretty great. There was only 1 song I didn't like and I think many people are going to want the soundtrack. Everyone sounds fantastic. All the big stars in this were wonderful although I felt the standouts were Streep, Rannells and Kidman in her one big number with Jo Ellen Pellman. Plenty of singing, Plenty of dancing, big production numbers, this was a joy to watch and Ryan Murphy really deserves a round of applause for how well he handled and filmed this."}, {"id": 234, "text": "I have been waiting for a long time for a feel-good &amp; powered-cast movie to take on that kind of story!!! Take it for what it is .. simply a warm felt movie."}, {"id": 235, "text": "Maybe not everyone's cup of tea, but it's light, fun and uplifting with great showsongs that need to blast out of your speakers."}, {"id": 236, "text": "People need to give this movie a chance. I loved it!"}, {"id": 237, "text": "Very touching movies, nice songs and the actors are amazing"}, {"id": 238, "text": "As long as you don't take it too seriously and expect it to be the musical of the century...there are some good laughs and one liners!!!"}, {"id": 239, "text": "I can write a book as to how much I loved this film, but I'll keep it simple: in no particular order- the colors, the costumes, the songs, the acting and the dancing. I watched it twice in one day : the first viewing was organic and was so high from it, the second was with my parents who also loved it. It's so uplifting- just finished a 5mile run listening to the soundtrack and of course threw in some of my own dancing in the streets!!!"}, {"id": 240, "text": "This musical, with its message of love and tolerance for others, is perfect end of year entertainment. Although it has a first rate cast, its musical numbers are unlikely to stay in your head for long, so it isn't in the class of 'Chicago', even if the Nicole Kidman character aspires to be in it. It certainly is one of this year's more positive films, and please will everyone stop knocking James Corden. I thought he looked and sounded like Russell Grant, and everyone likes him. And of course Meryl Streep had lots of fun with her diva character, so similar to Miranda Priestly in 'The Devil Wears Prada'. It's a fun evening's entertainment to enjoy over Christmas."}, {"id": 241, "text": "At most 100 minute screen time. First 50 minutes is leading up to the prom, then the fake prom, then they head over to the real prom. First it's sad and uncomfortable, then lessons are learned, people come to new understandings and then a joyful ending. The hour between the fake prom and the inclusive prom is too damn long with forgetable music"}, {"id": 242, "text": "There were a lot of fun moments, some tears and overall loved the cast but the main actresses face and acting really didn't do it for me. I really didn't enjoy her at all. Only when she was singing. I honestly didn't think she was a strong actress. And this made it harder to want to finish the film"}, {"id": 243, "text": "If you take it for what it is, you'll love every second of it! I have never seen the musical so I was in love from start to finish. Loved the actors, characters, and the costumes and sets were great as well. Plenty of laughs and tears for me, too."}, {"id": 244, "text": "The story is good and worth telling, but the actors kept me watching."}, {"id": 245, "text": "I had so much fun watching it and that's the whole point! Cast are very talented and it's a very good production"}, {"id": 246, "text": "I don't normally do reviews but this gem of a movie deserves it . The cast is perfect . In my opinion James Corden does not deserve the backlash he has from so called critics for portraying a gay character even though he is straight . He played his part brilliantly as did Meryl Streep and everyone else. I love Musicals and thought I was well up on Broadway and the West End but have to admit I've never heard of this one. I'm glad I do now . This is so funny , Heartwarming and feel good. It had me laughing and Crying too . Very Well done to all involved ."}, {"id": 247, "text": "I watched this movie on a day where i really needed something to cheer me up. And I can only say this movie worked amazingly. It has the whole package. Funny moments, some sad moments, amazing songs and most important Meryl Streep. I would totally recommend this to anyone who needs some cheering up."}, {"id": 248, "text": "This is absolutely the best musicall movie in many years. Even if you don't like musicals you have to love this and the energy it brings to you. It has a strong message- love love love and I love this"}, {"id": 249, "text": "This movie has some really catchy music and the actors play to their parts accordingly. It has a strong message of tolerance and even has a few sappy moments. It was like watching a movie version of Glee. Take a chance, who knows, you might enjoy it."}, {"id": 250, "text": "I thought the SINGING was excellent the story was okay but predictableon a snowy wintery day it was a good time waster"}, {"id": 251, "text": "I love musical but there were just too much singing that the gist of the story was compressed a little bit. Character build up was overshadowed by the musical of course. There was no back story about Emma's parents or reaction towards her coming out. Chemistry between Emma and Ashley was not shown as much, I wanna see more dynamic of the relationship that makes me feel like Yes, do all that to celebrate love but it was too minimal. Barry's character was entertaining as well as Dee Dee. But I feel like Angie's character seems more of a filler. We've got Nicole Kidman to play that character, imagine what she could show.I give it a 7/10 because I enjoyed the movie but I wish there were more character build up."}, {"id": 252, "text": "I was a bit hesitant in liking this in the beginning, but definitely warmed up towards the middle. This reads very much like a Broadway musical, snappy tunes and message heavy. Fairly like-able, fun teen lead, adults were okay."}, {"id": 253, "text": "I adore this movie. It's funny and poignant and fun, and full of phenomenal talent. I was impressed with how it DID not play into stereotypes from my perspective. It had a really diverse cast with people playing roles that were not stereotypical (example, Kerry Washington as the Karen). I thought everyone was fantastic! And the girl who played Emma... wow. Amazing!"}, {"id": 254, "text": "Coming from a 17 year old lesbian (like Emma) this movie felt like a hatecrime. It was so dumb and unrealistic, and not in a good way, and it felt like homophobic satire the whole way through"}, {"id": 255, "text": "The Prom is a wonderful, bright musical, great to look at, with a marvelous cast, good music, and an old but so often ignored message - the world is for everyone. Everyone deserves to be who they are.However, everybody being who they are does not, in my opinion, extend to acting. Acting is playing someone different from yourself - not in all ways all the time, but certainly in some ways. This is why I can't understand the insistence on casting a gay actor as a gay character, referring to the bad reviews James Corden received. Ridiculous. Grow up. He did a great job. I don't know about anybody else's gay friends, but my gay male friends loved him.If you're sick of hate, and want to feel some optimism about anything (and of this writing, I don't know about anybody else, but I need it) this is the film for you. Take it for what it is. It's not Citizen Kane. It's a typical Ryan Murphy, somewhat campy production. I'm not a particular fan of Ryan Murphy, but I enjoyed this immensely."}, {"id": 256, "text": "Despite the presence of mrs. Streep and Kidman and the beautiful message of inclusivity, this Murphy's effort to set a memorable musical (based on the same Broadway play) crushes into the weakness of its songs and the absence of depth in its characters."}, {"id": 257, "text": "You guys, I don't think this was meant to have Oscar award-winning acting or plot lines. Like other reviews have stated, this is JUST what we needed to end this year! Cheesy, uplifting, a little cringe on the acting side (but 2020 was one big cringe so call it paying homage?) I will always love James Corden, he has a naturally friendly demeanor. Andrew Ranells I've loved since seeing him on Broadway and the other two well....do I even need to talk about them? Goddesses. Of course it's not the most in-depth piece we've seen but come on. It was a fun watch."}, {"id": 258, "text": "Having seen this on Broadway three times from different angles to get the full perspective of one of the most original new musicals in quite a while (not based on a movie or a catalog of someone's songs), I was quite delighted that this was quickly chosen to be made into a movie. Not many musicals are filmed within five years of its Broadway run, let alone two.Two years ago, the Macy's Day Parade scored a victory for gay people by showing two young women romantically kiss. The show had an extraordinarily talented ensemble led by Beth Leavel and Brooks Ashmanakas whom I suppose outside of Broadway didn't mean box office.So who to cast? Who else gets to play the top stage roles on film? Why Meryl Streep of course and if she's not exactly in the league of Leavel as a belter, Meryl equals her with a commanding presence and manages to make the egotistical Dee Dee Allen still as big as she was on stage yet show those human elements to make her not a complete monster even in her most self centered moments. Her Dee Dee could easily have been a variation of Madeline Ashton from Death Becomes Her, and there's not one sign of the star of that musical version of Sweet Bird of Youth present.As for James Corden, he's not among my favorite modern performers, having found Brooks to be completely loveable in everything I've seen him in on stage, but in spite of that found him to be quite a bit more subtle than what I've been lead to believe. He just doesn't have that certain stage bravado that I expected for the role of Barry so it's a slight mismatch for a role that required someone less reserved. His Barry doesn't feel like a big Broadway star who may or may have replaced Nathan Lane in The Producers. He does have a pleasant singing voice, just not Broadway lead quality.While Jo Ellen Pellman, as teenager Emma, certainly can sing and has a nice personality, what she's missing is an edge that someone who's had to defend herself from a bunch of bullies would have. These teenagers, basically nice kids manipulated into being homophobic, are a product of their upbringing, but oh what a lesson that this small town will learn when Streep and Corden arrive in toe with Chicago chorus girl Nicole Kidman, former sitcom star Andrew Rannels and press agent Kevin Chamberlain.To adapt this to screen, the producers have allowed it to remain nearly 100% faithful to the Broadway show, keeping the score and only making select edits, some for the better. This is still great for everything it is fighting for, whether being acceptance (something that younger generations seem to embrace a bit more) or showing that people can change either through wake-up calls (Barry and Dee Dee), revelations of their own bigotry (Kerry Washington's PTA president) or seeing the world through a bigger light (the young people).In one of the few roles in the show where someone doesn't have a lesson to learn, Keegan-Michael Key is a big ball of heart as the completely accepting principal, aiding Pellman in achieving her desire to go to prom. Flashbacks showing him seeing Dee Dee in her first big show expressed what every Broadway fan feels when that curtain goes up, and that even includes the straight male members of the audience. Kidman and Chamberlain are the others, with Kidman scoring in her big Fosse number. Smaller roles played by Tracey Ullman and Mary Kay Place (not in the stage version) bring on more story perspective.By opening this up to outdoor scenes and sets other than the hotel, the school and the Broadway theaters, this really does indicate the heart that audience members on Broadway saw and brings it to a much larger viewing capacity. This is not for those who hate musicals, or anything that expresses the gooey feeling you get in big brassy numbers on the stage or the rare movie version or anything more accepting out of their own comfort zone. The power of theater rarely transfers over to film, and this one is quite a delight in spite of the magic I felt those three visits to the Longacre Theater and missing Beth and Brooks."}, {"id": 259, "text": "Just enjoy the film. Don't listen to any bad reviews."}, {"id": 260, "text": "Initially chose to watch it because of the well know actors/actresses in it and was rated #4 on Netflix today. Started out as a musical...and I first though great, another strange modern musical... I was pleasantly surprised. It pulled at the heart strings in the right places, a bit of comedy added in, very entertaining, brought in ALL the excuses of how some people justify their hatred.... I would watch it again. PS. Nice addition staging in Indiana. And 'Trumps them all'... Well done Netflix!"}, {"id": 261, "text": "I was concerned when I saw the low ratings and averages but this is everything a musical theater fan can love. The storyline seems a bit dated for a musical written just a few years ago but it is the set up needed for stitching together all the musical tropes to create a wonderful new musical. Corden and Streep chew bits of the scenery every chance they get and it is over the top corny, much like Hairspray was. They are great together, dropping great little asides that you sometimes have to pay attention to get. The songs were great and the dancing, although nothing new and kinda cliche, is a lot of fun. I will be watching this again soon because it was 2 hours of complete entertainment."}, {"id": 262, "text": "I just watched it as I needed something 'happy' to cheer me up. Love the cheesy story, the cast is great. Main cast is really entertaining &amp; fun to watch especially Nicole and Meryl. I'm not sure if Kerry Washington can actually act, I see Olivia Pope in every performance she gives. But that's just my opinion."}, {"id": 263, "text": "I came in expecting to like it and I did, but the movie was overlong and could have been done in 1:50 min. If you like Glee or High School Musical there is stuff here for you to like."}, {"id": 264, "text": "I loved it but it should have been shorter. We didn't need to many details about Nicole Kidman's character or Meryl Streep's."}, {"id": 265, "text": "Meryl Streep and James Cordin....pass is what I should have said when I saw these two on the poster before going into this thing but I was in a good mood and thought how bad could it be? Well, the answer is very bad, very cringey and not even extra butter on my popcorn could save this hot mess of a film from sucking. 2020 strikes again."}, {"id": 266, "text": "After I fast forwarded most of the over the top scenes, I was on the point of stopping watching this movie. But I knew a bit of the story so I decided to stick with it. And I was glad I did, because the acting of Ariana DeBose got to me and made me cry as a straight man of over 40. I never saw her before, but she was so real where all the other actors where over the top. If I could give out Oscars, I would give her one. I rarely rewatch scenes, but I did this time, just to appreciate the acting, and I **** cried again. I also liked the main theme, I just want to dance with you, the rest of the music I don't remember.As her acting could maybe convince people to treat LGBT+ better , it will never be watched by them because of the rest of the film will put them off."}, {"id": 267, "text": "The National touring group for The Prom was supposed to come to my city and was a part of my season tickets. Because of Covid, that didn't happen. It's hard to make a Broadway musical into a movie and doesn't usually result in a memorable movie. Music is very Broadway. Stars all did a great job portraying the characters in a very Broadway way- big, exaggerated characters. I didn't love it but it was a nice diversion. Andrew Rannels is a favorite and James Corden has a beautiful voice. It's not a movie I would watch again but it did make me miss live theater."}, {"id": 268, "text": "Musicals - and westerners - are very American in their narrative style. Both do not work well abroad and should have been put to rest, with very few exceptions. This is not one of them, but just another Netflix patronising flick.Not being interested in Broadway musicals, I had no idea of what this movie was about, but I discovered it quickly and to my disappointment. Here we go again with sequins and silly songs that try desperately to be relevant, being sung by the likes of Streep and Kidman. Unfortunately, it looks like both are going down the De Niro way, playing whatever part for the paycheque. Good for them and for me, taking full advantage of my freedom to zap away."}, {"id": 269, "text": "As my cousin said the other day, there are 7 Billion people on this planet and everyone of them has an opinion. I'm only chiming in here because: 1) I was totally captivated by all the talent crammed into one movie. Wow. It is corny and fun. If you like musicals there's no reason not to like this. 2) I'm not giving it a 10 because the message the movie is based on got pretty heavy. Its obviously targeting a specific audience and designed to help turn the tide, so to speak. It was a little too much for me and hubby, it was preaching to the choir at our house. Otherwise, Definitely fun and makes you smile."}, {"id": 270, "text": "I love Meryl Streep but having her play love interest to a man 20 years younger was a strange choice of casting. Enjoyed the music and cast was energetic but movie dragged a bit in the middle. Not great not terrible.!"}, {"id": 271, "text": "One of the best movies for 2020. Rollercoaster of emotions andI love the musical side of the story."}, {"id": 272, "text": "This film is great, the actors and music are amazing and the best way to end 2020 on a positive note. I truly enjoyed this movie."}, {"id": 273, "text": "The actors were good, the songs pretty good also with some bits that was wierd. But this was a decent musical from the broadway show."}, {"id": 274, "text": "If you're looking for solid entertainment, a great score, smart lyrics, great choreography and stellar performances, don't miss this movie. At the heart of this fun two hours it's all about love, acceptance and tolerance, and most importantly to love thy neighbor. Outstanding cast! I can't wait to watch again!"}, {"id": 275, "text": "I loved it. We have to say we are here. The movie's just too long."}, {"id": 276, "text": "Good concept of the film and their message they want to send but too much singing simply trying to be like glee or high school music ."}, {"id": 277, "text": "Never would you see a cast like this come together if they didn't believe in the ultimate message of the movie. Be kind. Don't judge. Be yourself."}, {"id": 278, "text": "The Prom musical is a smart commentary on performative wokeness and at the same time a heartwarming romance between two compelling female characters.The movie tries to be those things too. The actors did a great job singing the songs and saying the lines and genuinely trying to convoy the same sharpness and wit of the stage show. James Cordon in particular, who I normally find over the top and disingenuous, I found to have a grounded and believable performance. However something got lost in the shuffle and there's seems to be a giant hole where the substance of the stage show was ripped out by none other than Ryan Murphey."}, {"id": 279, "text": "Musical! Musical ! And maybe you like the message(s) or the acting, or the dance, or the characters, or the concept... i found it entertaining, from first to last minute. grateful for that."}, {"id": 280, "text": "The Broadway Show was really good but the movie is fantastic! Finally a movie that follows the same story, songs and did great with the songs, actors and overall the inclusive message as all people should be allowed everywhere: A Prom, At Work, At any place."}, {"id": 281, "text": "The Prom was a fine musical, that pointed out some important and true aspects of the LGBTQ community. For that, I think that the movie is worth watching for the funny, playful way of raising awareness to serious problems. The whole movie was the basic musical, the actors were decent and the music was not so exciting, but it fit well in the movie. The idea with a lot of glamour, lights, costumes was interesting, everyone was nicely placed in the background of the movie, and every scene was colorful in a very extreme manner."}, {"id": 282, "text": "Wow loved the movie! You can see that the actors had so much fun doing it."}, {"id": 283, "text": "Ryan Murphy presents viewers with a shiny, extravagant affair in this 2020 Netflix adaptation of the Tony-nominated Broadway musical. 'The Prom' packed full of playful, peppy musical numbers that you can't help but tap your feet to.The 2hr 10m runtime follows a quartet of egotistical Broadway stars who, after receiving negative reviews on their new play, decide to head to Indiana to see Emma, a highschooler banned from her prom because of her sexuality. Once the four arrive, they make it their mission to get Emma to her prom so she can celebrate with her girlfriend Alyssa (DeBose). However, there's one problem, as Alyssa isn't out to her conservative Mother (Washington). When Emma decides she doesn't need the star's help, she decides to share her story via social media in the form of a heartwarming song. With the help of Andrew Rannells, the classic popular mean girls are wooed with a Christianity fuelled performance. By the time the film comes to an end, Emma and the stars have set up their own prom where Emma can finally celebrate with her girlfriend and new-found friends.One of the surprising things about Alexa L. Fogel's cast is how well the primary quartet carry the plethora of songs, especially considering the scarce amount of background in musicals they all have. As always, Streep is a delight to watch on film, as are Kidman and Key. However, James Corden's performance as 'Barry Glickman' is out-right awful! If you're one of the few viewers that don't despise Corden by the closing credits, then I applaud you. Corden's performance is borderline homophobic! Maybe 'The Prom' will be the kick Hollywood needs to finally realise James Corden should stick to presenting! Newcomer Jo Ellen Pellman is joyous to watch on screen, she portrays Emma with the perfect amount of emotion and heart, just like the writers intended.The limited amount of humour throughout 'The Prom' is just enough to keep you from exiting the film altogether. Streep probably plays a part in that too. But something the prom doesn't escape from, no matter how hard it tries, is feeling like it's musical counterpart - the neon lights and awkward set design reminds viewers that this isn't an original concept. Also, something about a straight man (Corden) complaining about being a gay man won't sit comfortably with some viewers.Like some musicals, 'The Prom' conveys themes of love and family across to Netflix viewers, and a message of being true to yourself seems to seep through your screen too. One of the heavier themes 'The Prom' deals with is parents disapproving of their children being apart of the LGBTQ community. This storyline is portrayed by Pellman graciously, but it is also put into the hands of James Corden, so I'll let you make your own assumption on how that went!Overall, Ryan Murphy does a menial job in the director's chair. 'The Prom' isn't anything special and doesn't stand out among Netflix's crowded production line, except for the fact it may earn Streep her 21st Oscar nom. So, if you're looking for a light-hearted, upbeat extravaganza then this should be on your watchlist. But if you prefer something a little more subtle and low key you might want to keep scrolling."}, {"id": 284, "text": "Great music, singing and story. Just what Americans need to bring us out of the dark times of 2020! An added bonus was watching Hollywood make fun of the uptight religious nutcase Hoosiers living in Indiana!!! I should know since I'm living among these looney folks now."}, {"id": 285, "text": "This musical was wonderful. Great cast. Great songs. I knocked off 3 stars because it was just too long. It has an amazing message and is such an important musical but if it were around 90 minutes this would be a 10! Please don't pass on this because the messaging and songs are wonderful but also don't be surprised if you find yourself fast forwarding a bit to get through some of the music. It's very funny to begin with and just fun to watch but it starts to get a little stale then gets back at it. Enjoy this and the message which is truly the best about this film!"}, {"id": 286, "text": "Like Dolly Parton's Christmas on the Square, The Prom is an upbeat (and predictable) musical that we can enjoy from the comfort of our own homes at a time when live theatre isn't possible. Goes well with champers and chocolate! PS: Kudos to James Corden, Nicole Kidman, and Tracey Ullman for their spot-on American accents (that said, there's no difference between the New York and Indiana accents -- they all just sound bog-standard American)."}, {"id": 287, "text": "They always lift me up, and this one is a lot of fun. I adore Streep, so I'll watch anything with her in it, especially a musical!! Definitely enjoyed it."}, {"id": 288, "text": "Love love love this movie and James Corden is amazing in this , its camp,fun and magnificent xxx"}, {"id": 289, "text": "Really enjoyed this film, Felt like I was watching a show on Broadway! High Energy, fun"}, {"id": 290, "text": "Nicole Kidman sazz was the only good thing about this movie and the lesbians"}, {"id": 291, "text": "As a queer woman I absolutely loved this movie! It was moving and special and beautiful! Watch it!! Open your heart!"}, {"id": 292, "text": "Normally not a big fan of Ryan Murphy's work but he is perfect for this and did a great job on this project. Great choreography, beautiful camera work! Nice acting, good speed! A joyful film with fantastic music! Enjoy!"}, {"id": 293, "text": "Touches on very real subjects and emotions. Cried several times. Great adaptation!"}, {"id": 294, "text": "Clear your head of all the trauma of 2020, and suspend your disbelief. We can't go to Broadway shows right now, so watch some A-list actors have a blast."}, {"id": 295, "text": "I enjoyed it tremenduously. Even made me cry a couple of times. Enjoyed the singing and dancing as well as the humour. Acting cast played their roles so well and there are no complaints. Thoroughly enjoyed it. Very upbeat and kudos to the singer, Emma, who just wants to go to the prom with her date."}, {"id": 296, "text": "This follows the same kind of story line somewhat like Footloose about being denied the opportunity to dance in a small town with equally small minds. But in this case it impacts a girl who wants to take her girlfriend to the Prom. Following a failed Broadway Musical enter James Corden and Meryl Streep, accompanied by Nicole Kidman and Andrew Rannells, to save the day (for publicity) for the girl played by Jo Ellen Pellman. Kerry Washington, head of the PTA and influential to the townspeople have denied not only the girl from going to the Prom but has eliminated the Prom entirely. While Streep and Corden are both excellent and Kidman had her moments Pellman steals the movie with both her presence and her singing. Ariana DeBose, Pellman's girlfriend, demonstrates her acting and singing capabilities in her first film role. There are a couple of memorable tunes but this movie won't challenge the Rodgers and Hammerstein successes. Although I'm sure some may be offended by the subject matter (those with small minds) it is nevertheless an enjoyable film."}, {"id": 297, "text": "Great cast and cinematography, however some scenes were a bit drawn out a little too far, dragging this out about two hours. Singing and the choice of songs were great as well. I do recommend this film to others."}, {"id": 298, "text": "The movie is really good but I think there was a bit of offensive stuff in the movie that not everyone will agree with I do like the movie but they could of been said in better ways"}, {"id": 299, "text": "This was a good movie. I was entertained and I thought the funny moments were funny (at least some of them). The music was good. This movie would be a 9/10 from em if it wasn't for one thing. James Corden. Why do people keep putting him in musicals, let alone movies. He can't sing, dance, or act. All his funny lines are so terribly delivered and his American accent may be the worst I've ever seen. Seriously, I like Ryan Murphy, and usually he makes good casting choices, but NO MORE JAMES CORDEN!!!! Overall the movie was good, but I don't want to watch a sweaty, out of breath potato singing off key and dancing out of sync. I heavily considered giving this movie a 1/10 just because of James Corden, but luckily, the other actors great performances halfway canceled out James Corden's awful performance."}, {"id": 300, "text": "The movie was fun to watch. The actors where great but I missed the wow factor."}, {"id": 301, "text": "The Prom is an interesting film, mostly because it's biggest problem is it's just not long enough. It would have worked better as a series because the runtime didn't allow for character development. There was too many characters which just didn't get long enough to flourish. What we had was less of an arc and more of just a quick transition from narcissist to everything's fine.The main characters I had a problem with were Emma, Barry, Alyssa and Ms. Greene. Emma just didn't have enough depth simply because of the low runtime. Many people can pull into question the casting choices of James Corden, but it could have worked, he just needed to either fully commit to this overt camp character or tone down the campiness so his he could flourish in the role. Instead what happened was a mix of Barry and Corden which felt confused and restricted Barry's character arc. Despite this I'm still a Corden fan and hope he gets a musical role which he can stand out in. Finally Alyssa and Ms.greene. the problem that I had here was first that neither Alyssa or Ms.greene really had enough of a story for the conclusion of their arcs. Also this should have had a better story because they hinted at parental problems throughout, when it finally came to have a mother-daughter relationship on screen we just had the mother immediately change her mind after continually undermining Emma's sexuality and also mistreating her daughter. You could have had the same ending if it was in limited series format and it would have felt like more parts of their relationship and particular themes had been fully explored.It is also worth mentioning that the film didn't fully grasp LGBTQ+ culture and probably could have if it was longer. They could have had something which truly celebrated this but instead they had a short snippet of something so big which only really had stereotypes and clichés. It felt like a missed opportunity.Apart from this the films musical numbers were still fun, the visuals were well done and general I still enjoyed it. It's just there are some looming issues which kind of spoiled it."}, {"id": 302, "text": "The Prom is the movie adaptation of a Broadway show bearing the same name. It has an important message, and for the most part, is entertaining. And while most of the music is good, the way it translates to the silver screen is, unfortunately, quite hit or miss.Since music is what makes or breaks a musical, let's start with that. Most songs were catchy and fun, and the ones that were meant to be more emotional worked fairly well. Had that not been that case, The Prom would've been an absolute disaster. While some musicals may save the singing for the most important story points, this one used them for everything. It's song after song, and the breaks in between tend to be quite short. Some, I'm sure, will be opposed to that as is, but I didn't mind it too much. However, when the entire narrative is told through song, they need to be good. And most of them certainly are. In fact, I don't think that there was anything wrong with the songs themselves, unfortunately though, some of the performances worked well in a movie form, while others didn't. What makes musicals on a live stage good is the sense of wonder and admiration. It's always more impressive to watch someone sing and act and dance live on stage, rather than in a movie. And on stage, even if the song itself isn't the most memorable one, the props and grandeur of the whole performance make it come to life, literally. So when you take music and performances designed for a stage and put them into a movie, they are already at a disadvantage. And while watching The Prom, it's easy to see that. However, movies do also bring their own possibilities. And it was those songs and performances, that used and benefitted from the movie format, that worked the best. While others, unfortunately, felt like cheap and lifeless copies of what they could've been on stage.The story, which introduces us to a group of dishevelled broadway actors who have lost their charm, is quite good. While the group of four actors are the main focus of the story, we also follow the life of Emma, a 17-year old girl who is trying to fight for a prom that welcomes everyone, no matter who they love. The group of actors help Emma on her journey, while learning a lot about themselves, as well. Although the story didn't offer anything new or groundbreaking, it does come with a crucially important message. The message that we should all be proud of who we are, and we should all be free to love whoever we want to. And it's that message that really carries this film.However, while the story and the musical performances were great, the movie as a whole wasn't. What baffles me the most, is how slow The Prom felt. You'd think that a movie that is basically one colourful and striking performance after another would go by in a whim. But, this one did the opposite. I checked how much there was left at least three times, and every time I was amazed by how much there was. The only reason I can come up with for its sluggish feel is an overuse of music. Since the story is quite a simple one, it could've been told much quicker in a non-musical format. While the songs and performances are fun, they also make the narrative take a lot longer. And although I did enjoy most of the songs, I guess they just lacked the effect that they would've had on stage.It's quite unfortunate that The Prom felt like it was twice as long as it actually was. Had that not been the case, I think I would've enjoyed it quite a bit more. It has a good message, as well as a good heart, and what it lacks in originality, it tries to make up for with entertaining musical numbers, and for the most part, it succeeds. While it does a lot of things right, the end product just felt underwhelming and lacked the charisma and wow factor that it would have had on a stage."}, {"id": 303, "text": "I saw The Prom on Broadway a couple of times, and was so moved by it (as was the whole audience). I told everyone about it, bought all the merchandise, played the soundtrack over and over, etc. Point: I LOVED the Broadway version. So I was super excited to find out that Netflix was making a film version, and have been looking forward to it for a long time.I was a little hesitant when I heard about the decision to cast Names only in a show that ironically purposely cast a lot of actors who had been in small Broadway roles for years, but never the leads, until now. There are also some incredible vocal numbers that Broadway performers are trained for, and I wasn't sure that the Names could handle them (with the exception of Andrew Rannells, who became famous due to Broadway). I happy to say that I needn't have worried.All of the actors cast were incredible in their respective roles, did all of the beautiful numbers justice, and brought these characters to life. Yes, it is very campy and over the top, but that's how it was originally written (and done) for Broadway. On purpose, because, campy, flashy, etc. not only makes for a magnificent feast for the eyes (and ears), but it also makes it much easier to digest what are serious issues (Inclusion, Homophobia, Bullying, etc.), without being too preachy or angry. The film is made with the lavish style and camp magic that is a Broadway Musical and embraces that, basically, it's not made to look like a dramatic film, it's meant to look as if you were watching a Broadway show. The original Broadway choreographer, Casey Nicholaw, also choreographed the screen version as well, for example.Keegan-Michael Key actually sings a number called We Look To You whose lyrics literally explain the reason for a film like this. It's fun, it's moving, it will make you want to sing and dance along, and hopefully appreciate Broadway and Musicals more, and perhaps Celebrate people, and all of their differences as well. Meryl Streep is amazing, as are everyone in the cast. I'm seeing a lot of negativity towards James Corden in reviews, but to his credit, he plays Barry exactly as he should, and he is really heartwarming in what I feel is one of his best performances ever.Watch this film if you love musicals, dancing, big production numbers, optimistic stories with heart and tales of love, acceptance and redemption. I've already watched this film twice, and I will definitely own a copy when it becomes available. I highly recommend this film, especially in these times, as the perfect way to forget your troubles and be really entertained. Trust me, you'll come out of it singing the songs afterwards and just feel happier because of it."}, {"id": 304, "text": "The Prom begins cleverly enough with the play-within-the-play starring self-righteous, narcissistic hacks. They laughably sing about their power to change the world. After a bad review, they decide to double down and take their supposedly world-changing song-and-dance numbers to saving a lesbian teenager in Indiana. It's amusing enough to see Meryl Streep bursting in on a small Midwestern town's PTA meeting belting out lyrics about how her singing isn't about her. It's a ridiculous caricature of oblivious coastal celebrity elites lecturing bigoted middle America. A FoxNews nightmare--the Broadway/Hollywood liberals coming to corrupt the children's prom. Panic! The movie's message of inclusivity is admirable, too, if heavy-handed and the picture generally overlong. Yet, it turns out, this first act wasn't a joke at all. The rest of the movie is the same obnoxious nonsense as the Eleanor Roosevelt musical. Ryan Murphy and company's featherbrained idealism once again reduce social problems to black-and-white issues to be solved by corny and monotonous speechifying and auto-tune. They are the narcissists.Murphy did the same thing with his prior Netflix project, Hollywood, bowdlerizing history to pretend that had there been some brave people who spoke up that racism and homophobia would've been conquered in 1940s America. Not only laughably stupid, but insulting to those who really did speak up and those who suffered from bigotry. Hollywood started off rather well, too, by equating acting to prostitution, but, then, it never really got to the acting part. At least, The Prom isn't set in the past and any lip syncing isn't as atrocious as in a Glee episode, although it's instead about the most frivolous thing in the world, proms. According to Murphy, he still thinks he's making an old-fashioned musical film instead of another iteration of High School Musical (2006)--no, really, he compared The Prom to Singin' in the Rain (1952). To the contrary, every song here sounded the same to me; it's awful. Same auto-tuned, singing-and-dancing lecture in unison to the same melody--every time, over and over again. Singin' in the Rain made fun of the transition from silent films to talkies, but it didn't follow that up with the rest of the movie being as bad as the movies they made fun of. Plus, the singing and dancing was delightful and variegated.Besides reducing discrimination of homosexuals to self-centered fluff, Murphy's formula is also terribly cloying. Pathetic TV, tear-jerker melodramatics. Make sure you give all the main characters a prize at the end and that everybody declares their affection for one another. The bigots, too, learn their lessons. Grab the tissues or barf bags. What a waste of the talents of Streep and Nicole Kidman, among others."}, {"id": 305, "text": "This movie is genuinely so good. Ryan Murphy really delivered. There were a few things going in that I was worried about (namely James Corden playing Barry Glickman rather than Brooks Ashmanskas who absolutely amazed me in the original Broadway cast). However, Corden really delivered the heart of this character so beautifully. Now, Ashmanskas was definitely funnier and still had as much heart as Corden did, but I was in no way disappointed with Corden's performance. I, in fact, really loved it. Meryl Streep is the star of this film. Her acting, singing, and just all around charm is infectious. I could watch this movie JUST for her over and over again. Luckily, I loved the rest of the cast. Andrew Rannells, Nicole Kidman, Kerry Washington, Keegan Michael-Key, and Ariana Debose all gave such heart-felt and honest performances. I GASPED when I saw Kerry Washington's final costume of the film.There is definitely some cheese in this movie, but I expected that so I wasn't bothered. I enjoyed what was added from Broadway to Screen for the character of Barry Glickman. It is a lot of different characters to follow, but I feel they did a great job of keeping me invested in all of them throughout. Honestly, I really want to go watch it again because it really touched me and made me happy and excited."}, {"id": 306, "text": "First of all, I have to say I've never been impressed with James Corden's acting abilities, but there was absolutely NOTHING whatsoever I could find in his performance here that was stereotypically gay. It's more than obvious reading these reviews that we have a group of people here who have pulled themselves together to use The Prom as the sacrificial lamb to protest that they don't want straight people playing gay roles. The sad thing is that they've chosen a production by Ryan Murphy, of all people, to rally against. Murphy has done more for us in the the gay community for the last ten years than any producer has before. It's also interesting to note that Andrew Rannels is playing a straight man in this film but none of these reviewers have commented on that.The plot of The Prom revolves around a lesbian high school girl in Indiana who is being denied entrance to her school prom due to discrimination; as a result, the school P.T.A. shuts the prom down completely. A group of has-been Broadway stars go to Indiana to support her (We're liberals from New York, a particularly embarrassing line) in the hopes of changing conventional ideas.Let's face it: The Prom isn't a very good film. It's mostly predictable, the plot just isn't that interesting, and it doesn't have one cast member that's ever been known for being musically inclined (in a couple of numbers the performers actually sound dubbed). It's also overlong by about half an hour. Like most musicals, the narrative basically revolves around one song after another, but the problem here is there isn't one number that's particularly memorable.Still, with all the television Ryan Murphy has produced, he's entitled to a miss now and then. What is is notable about The Prom is that despite its clumsiness, it still manages to make an important message about tolerance and being different. It won't hurt you to watch it, but there's definitely nothing remarkable here."}, {"id": 307, "text": "I had never heard of this musical before watching. I can say that this film has made me never want to see it.This film has so many issues but Jesus Christ James Corden is on of the main ones. He is unwatchable in this movie. It is honestly so so bad. The accent is so bad but the worst part is the terrible portrayal of a gay man. I think a quote from the movie its self sums this performance up best ' An Insultingly misguided, offensive and laughable performance'. It was painful and embarrassing to watch and it is even worse when on screen with an actual gay man who is just a normal person because it may come as a surprise to James Corden but gay people are just regular people they are not cartoon circus clowns and just spin and clap all day. He also has no emotional range so all of his dramatic scenes fall flat.I found the songs to be grating most of the time and found that they just didn't flow very well. They were all sung sort of out of time with the music it was really strange. I wanted to skip some because they were just boring and really lacklustre. Some were also pretty embarrassing. Especially the ones that come from secondary cast members.The cast was a complete mixed bag. I enjoyed Meryl for the most part, i think because you could tell that she was just having a good time with the character. I think that Jo Ellen Pellman was pretty good however i did find that sometimes when she was sad it just didn't read she looked like she was smirking or about to giggle. I think Nicole Kidman was the biggest waste of money and talent in this movie. She is so good but she was just completely wasted in this movie. She is hardly in it and just does nothing. When she gets her moment it is really interesting and i would have appreciated more time with her character.The message of this film is really good and really important but it is so heavy handed.I sort of liked the sets so there is one thing.I would honestly skip this its a huge waste of money and it is never ending. It felt like it dragged on for 4 hours."}, {"id": 308, "text": "What do you expect?It is exactly what it is meant to be - just brainless song dance camp faux-emo theatre w very mehh story and loopholes gala. As such, not great but sure good enough.The songs are far catchier and flow more naturally into the scenes than other musicals of this genre. Everyone sang better than expected - Meryl Streep's assured singing exceeds her shaky performance in Mamma Mia.I don't particularly like James Corden either (but certainly not to the extent of his compatriot Piers Morgan whom I find a total yuckky loud ego fake), but to be fair I can't fault his good-enough performance here as with every cast member. Also, everyone else (except for Keegan-Michael Key who played it pleasantly 'normal', surprisingly) was camping it up so why shouldn't Corden? And his level of campiness suits the character and is by no means overdone. I don't know why so many people have an issue with him, when nobody seemed to bat an eyelid when Eric Stonestreet (who is totally straight also) camped it truly all the way up in Modern Family - why the double standard? Gays play straights, straights play gays - who cares as long as the performance suits the characters.I recommend this good-enough brainless musical. Enjoy! 😊"}, {"id": 309, "text": "The first thing which hit me about this film was the beautiful colour palettes in every shot; in particular I couldn't take my eyes off the stunning jewel-toned outfits which made me want to rethink my entire wardrobe. However, the second thing which I noticed, and unfortunately struggled to un-notice, was James Corden's fake American accent. It actually took me two separate attempts to finish the film because it distracted so much from his actual acting performance (which really wasn't bad) and it made me quite uncomfortable. Also, do we really need another straight white guy playing a gay character? Not really.As for the story, it was a bit slow at times with a lot of dull dialogue and not very memorable songs (apart from Love Thy Neighbour, which I would highly recommend listening to for an accurate and hilarious middle finger up to Christian homophobia). I think the premise of the film was very original; I did very much enjoy the sarcastic take on the performative activism of celebrities which we often see. The Prom set my expectations high with its fabulous cast and the promise of being a feel-good musical centred around LGBTQ+ rights, however for me it fell short by having only one memorable song, unremarkable characters and a forgettable plot. I will probably watch it again, but it will mainly be for outfit inspo."}, {"id": 310, "text": "By no means is The Prom an Oscar contender but despite its obvious flaws, it is a great time for all involved and anyone into musicals. If you're into Glee and High School Musical, you're the demographic for The Prom.A quartet of self-absorbed Broadway actors - Patti LuPone-esque Dee Dee Allen (Meryl Streep), openly gay Barry Glickman (James Corden), former sitcom star Trent Oliver (Andrew Rannells) and eternal chorus girl Angie Dickinson (Nicole Kidman) - seek a publicity revival in a Conservative Indiana town, where high school senior Emma Nolan (newcomer Jo Ellen Pellman) has been barred from the prom for wanting to bring her girlfriend.Pellman is a powerhouse in her first role, her performance so real and so relatable to anyone who's ever been cast out. The ever-talented Ariana DeBose is Emma's closeted girlfriend Alyssa, whose mother (Kerry Washington) is the ultimate Karen. The top billed stars are scene-scarfing narcissists but they each have their true colors shining through. Even Corden, who has been blasted for being a straight actor in a gay role, has stepped up from his previous movie musical spot (last year's critically lambasted Cats).In supporting roles are Keegan-Michael Key as the high school principal (I've never heard him sing before this and he is an absolute delight), and Nico Greetham, Nathaniel J. Potvin, Logan Riley Hassel and Sofia Dieler as a group of Emma and Alyssa's classmates who receive perhaps the most character development.The music and choreography are the film's highest point. It's a Ryan Murphy project, so those are bound to be of high quality, and the outrageously campy Prom is another notch in my guilty pleasure musical repertoire."}, {"id": 311, "text": "Pretty typical and brings nothing new to these sorta films, but it still has more to it than I was expecting.I had predicted it was going to be a full-on forced comedy and cringe teen romance, but it actually has a little bit more substance to it. Added to the fact that none of the cast irritated or annoyed me, which is always a positive. You can guess what's coming up from minute one, but that didn't stop me from enjoying it - albeit to a minor degree.Aimee Teegarden (Nova) and Thomas McDonell (Jesse) are a decent enough pairing, while the characters of Danielle Campbell (Simone) and Joe Adler (Rolo) are more interesting than they seemed to be early on. Dean Norris, midway through 'Breaking Bad' at this point in his career, also appears.'Prom' may have absolutely nothing special about it and is very plain, but I'd very much be lying if I said I disliked it to be honest. It's passable."}, {"id": 312, "text": "When the trailer for this film came out two months ago, I knew nothing about it or the Broadway musical it had been adapted from. Since then, however, I became quite a fan of the original show. I was very disappointed when I learnt some of the first reviews had negative connotations but I went into the cinemas with an open mind and thank god for that. Like always, Ryan Murphy used colour, and lots of it, to his advantage. It gave the set and costumes the feel that was required to suit the actors and the story. The music was amazing but I do not appreciate the cut verses from The Acceptance Song and You Happened. However, with an already long run-time of over 2 hours, I understand cuts need to be made. Meryl Streep and James Corden did a spectacular job playing the stuck up Broadway stars and the whole cast seemed like they had a tremendous time making it. I feel the whole plot was a little confusing and hard to communicate but this is truly how I wish all movies were made today. It is by no means an Oscar contender but definitely a fun, charismatic pic that will hopefully inspire more films similar to this in the near future.Follow @reviews4musicals on Instagram for more musical content!"}, {"id": 313, "text": "I enjoy a good Broadway musical.This was fun The music was okay. The dancing was great. The costumes and sets were fabulous. The main actors were all good. The various plots -- the main story and the ancillary stories are interesting if predictable. So really although there's nothing super thrilling here -- for me it was a nice way to spend a couple of hours and I don't regret watching it.I think I had hoped I'd be blown away by it, but i wasn't. If there are people out there who over-the-moon loved it and after watching it were happy and exhilarated, i am envious.I read a little about the provenance of the original musical/etc. The message that we are hit with is worth being reminded of as we come out of the dark days of the last four years of the toxic Trump presidency. Inclusiveness and Love Thy Neighbor are things we can only hope as a nation to recover one day.And maybe that's the point of this."}, {"id": 314, "text": "I usually refer to Netflix as Sh'tFlix, apart from Eurovision, but this is an outstanding film. Amazing cinematography, beautiful colour palette, 'A' list cast and perfect storytelling.Anything that Meryl is in is good enough for me, and she absolutely excelled here with yet another mesmerising performance. All the cast were brilliant, loved the songs and orchestrations, innovative and energetic choreography.Fantastic theme and uplifting ending.A true musical in every sense.What a mood lifter in these horrible times.Thank you to ALL involved in this piece of excellence."}, {"id": 315, "text": "If you know me you know I adore Ryan Murphy shows. All of them EXCEPT GLEE. I hated Glee. Something about the impossible sweet episode of the week everything works out eventually happy ever after just didn't appeal to me at the time. The Prom has that same feel but for whatever reason it works. Maybe because it is in a movie format or maybe because I also adore Meryl Streep and Nichole Kidman who play failed narcissistic Broadway actors who with a couple other also failed Broadway actors become convinced that all they need to revamp their own careers a cause. They pick a high school prom that was cancelled because a girl wanted to take her girlfriend and instead of not allowing her to go the school cancelled the prom all together.Anyone expecting a drama doesn't know Ryan Murphy. And I bring up Glee because like Glee this is also a peppy musical. A musical about doing the right thing and fighting the right battles. Where a bunch of Broadway fakes learn lessons on being their true selves by someone who refuses to be anything else.The movie isn't perfect but it is at least worth watching."}, {"id": 316, "text": "My Review The Prom- my rating 8/10 The Prom is a joyous celebration of music and choreography with a strong message that shows the trauma and rejection many LGBTQI youngsters in school go through because of prejudice and ignorance . Sound a bit bleak and heavy ? Well it's the opposite it's bright and colourful and overflowing with some of the best talent on screen today. Film Musicals often get a tough time from the critics just look how they blasted Cats last year and that also featured great talent including James Corden who is quite brilliant in The Prom. I've already read some very negative reviews saying things like describing The Prom as Ryan Murphy's inconsistent musical and criticism of James Corden a straight actor cast as a flamboyant gay man . I'm a lover of musicals and have been all my life and I appreciate an enjoyable entertaining musical when I see one. The Prom as you may have read is loosely based on a true story Perhaps the most notable incident took place in 2010, when the Itawamba Agricultural High School in Fulton, Miss., refused to let high school senior Constance McMillen and her girlfriend attend the prom as a couple. ... In response, the ACLU filed a lawsuit against the school district. The original stage musical The Prom made its world premiere at the Alliance Theatre in Atlanta, Georgia in 2016 and premiered on Broadway at the Longacre Theatre in October 2018. It was a critical and audience success and won The Drama Desk Award for Outstanding musical. Frank Rizzo, writing for Variety wrote that with a tuneful score, a playful book, and performances that remind you what Broadway heart and chutzpah are all about, this cause celebre of a show turns out to be a joyous, funny, and sweet production that should appeal to several generations of musical fans. I haven't seen the Stage version but I agree 100% with Frank Rizzo's comments. The plot is simple basically it's about a troupe of hilariously self-obsessed theater stars who swarm into a small conservative Indiana town in support of a high school girl who wants to take her girlfriend to the prom. What a great cast in the film as these troupe of actors who's careers are starting to fade . They converge on Edgewater High to help Emma Nolan in a bid for good publicity to help their careers. Meryl Streep as Dee Dee Allen a narcissistic and egotistical star is brilliant , her showstopper It's Not About Me is a vampy hymn about ego disguised as humility. Then we have her co star on stage James Corden who I really admire in this performance as actor singer dancer in The Prom .James Corden is a true musical performer as he proved in Into the Woods. Nicole Kidman is also wonderful as Fosse Girl Angie Dickinson she has a great number in that Fosse style channeling the late Original star of Chicago Gwen Verdon. Andrew Rannells as Trent Oliver faded young Soapey star is also good fun . The star that impressed me most in The Prom is 24 year old Jo Ellen Pellman as Emma Nolan the young woman who wants to take her girl to The Prom. I've seen Jo Ellen before in The Marvelous Mrs Maisel but in The Prom she reminds me of a cross between a young Anne Hathaway and Elisabeth Moss , my prediction is that we are going to see much more of JoEllen Pellman. Summing up The Prom I'll just say if you don't like musicals you probably won't like The Prom but watch it anyway just for the message of acceptance and open mindedness and the talent . It has some very good songs by composer Matthew Sklar and David Klotz and great dance numbers . If you enjoyed the series Glee which Ryan Murphy the Director of The Prom wrote you'll enjoy this movie. I hope I get to see it where it should be seen on a giant cinema screen."}, {"id": 317, "text": "Somewhere along the way, the patronizing general American audience dusted off a fedora they found in the back of their closet. They plopped it on their heads and they became eye-rolling, over analytical movie critics. Keyboard warriors. Telephone tough guys. Unfortunately, your venomous egos have found your way to this movie.Ironically, you've attacked the agenda of the material. Granted, I will give you Love Thy Neighbor. Aside from the impressive dance number, it was underwhelming. But you stand alone everywhere else. I don't believe the agenda of the actors was self-motivated. I believe James Corden has left us with his BEST work- gay men play straight men all the time. It is NOT offensive for a straight man to play gay- it is not over the top either. It is ornamental but I know plenty of PEOPLE who are. Nicole Kidman: nailed. it. Meryl Streep: typical. Typically wonderful. Keenan: a breath of fresh air. There wasn't a stale performance. I absolutely adored this film. In a year when cinema needed heart, we got it with The Prom."}, {"id": 318, "text": "I must've teared up a dozen times during The Prom, but when Kerry Washington enters the finale, I literally sobbed - ugly, audible crying. I can fully endorse this movie for its energy, cleverness, and talent. It's better than I was expecting.Meryl Streep blew me away. I was expecting her to be great, but never expected the depth &amp; commitment. Of course I loved the heck out of Nicole Kidman, too. Kerry Washington was excellent in her playing against type, again more effective than I expected. JoEllen Pellman couldn't have been better as Emma.I've seen a lot of criticism for the cinematography, and call me tacky idc, I love the use of lighting and some of the framing. Also the way the original song is featured at the end is cute.My two issues with it: 1) offensive casting aside, Corden is plainly bad in the role; 2) the overly perfected Murphyesque ensemble numbers feel more wooden at times than everything else which is infused with heart and emotion.A strong 8 for me."}, {"id": 319, "text": "I have been familiar with the works of one Ryan Patrick Murphy since the debut of the television series, Glee. As such, I wasn't expecting much from the film adaptation of the Broadway musical The Prom. Murphy has a tendency to hide his failings with big bright sparkly production designs. Like an elegantly designed easter egg, they look beautiful but fall apart at the single bit of criticism. Unfortunately, The Prom is no exception to this.The movie follows a group of Broadway has-beens. Eternal show divas Dee Dee Allen (Meryl Streep) and Barry Glickman (James Corden) are at a low point after their latest show fails harder than the original production of Carrie. So they join forces with life-long chorus girl Angie Dickinson (Nicole Kidman) and Juillard graduate Trent Oliver (Andrew Rannells) as they head to Indiana to help out Emma Nolan (Jo Ellen Pearlman) after the PTA cancels her high school's prom when Emma strives to take her girlfriend to said dance. This, they hope, would be just the big activist event to give their failing careers a boost.There's much to be said for the concept, a mockery of celebrities playing at activism without actually doing anything. One could even say something for the differing viewpoints of city elites vs the small-town midwest, perhaps in a way commenting on the fact that most of said small-towns get written off as bigoted hellholes with no care being paid for those in small-town who are being bigoted against. Hell, one could've even focused said movie on Emma herself since she's a much more interesting character on paper. Instead we get a movie where every issue can be wrapped up with a song and the stakes never seem that high in the first place.The acting throughout is full of....choices. While Keegan-Michael Key is solid as the school Principal and Emma's one major supporter and Andrew Ranells does what he can with his small role, the rest of the cast falls short. Meryl Streep can do great acting in her sleep, and as far as I can tell, that is exactly what she does here. Jo Ellen Pearlman is fine, but her performance seems to have its level stuck semi-permanently in Gee-whiz mode throughout. Nicole Kidman is pretty much irrelevant to anything in the story, with her one big musical number being edited so much that you can't tell if she can dance (which is a major part of the number with it being heavily influenced by Bob Fosse). And then there's James Corden, an actor who plays his role so flamboyantly that Liberace has dug himself out of his grave to tell Corden to tone it down.The movie is odd, because on one level, it does look good. The costuming of both the Broadway actors and the Indiana natives is decent (even if Indiana seems to come from the same sitcom stylings that covered Glee). But there's an artificality to the whole thing that seems odd. Matthew Libatique does what he can with the cinematography but there are moments where you wish the camera would stop moving and just sit for a bit. The whole thing feels like a sitcom episode writ-large, like a Disney Channel Original with a slightly better budget. Every ounce of cynicism and edge a story like this could have has just been wiped away. I personally have not seen the original stage production, but if the movie is any indication, it's the kind of show that Broadway viewers play 500 dollars a seat to feel good about themselves for supporting the fight against bigotry.The Prom isn't without it's good sides, mind you. The musical for the most part is pretty good, with one of the better numbers being Andrew Ranells' creed against Christian hypocrisy Love Thy Neighbor. But the whole thing just comes off as fake, and it's hard to get past that. Ryan Murphy is a showman, and deeper meanings are hard to come by in his work. At the end of the day, any issue in a Ryan Murphy work is just to serve the bigger show. To quote the musical that Angie Dickinson has been stuck in the chorus for, Razzle dazzle 'em, and they'll never catch wise"}, {"id": 320, "text": "The Prom (2020) was one of my most anticipated films of 2020. As an avid broadway fan, I had heard of the smash hit musical of the same name, and listened to the soundtrack a few times. While it has never been my go-to, it always creeps up and never seems to fail at turning my frown into a smile. Just before its closure in 2019, Ryan Murphy announced that he was so moved by the project that he wanted to share it with the rest of the world, by making it a movie. I have always admired Ryan Murphys work (Glee, Hollywood, etc) so I was excited and scared to see what he would do, as this was very heavy source material.The Prom tells the story of Emma Nolan (Jo Ellen Pellman), a lesbian high school student who just wants to take her closeted girlfriend Alyssa (Ariana Debose) to her senior prom. Sorely based on homophobia, the PTA of the school, led by Alyssa's mother (Kerry Washington) decides to cancel the event entirely. This catches the attention of four failing broadway stars, Dee Dee Allen (Meryl Streep), Barry Glickman (James Corden), Angie Dickinson (Nicole Kidman), and Trent Oliver (Andrew Rannels). Together, the four come up with the massive plan to help the girl in order gain some positive publicity, after a review called them narcissists. As time progresses, the four retreat from their shallow thought processes and truly open up their hearts to Emma and Principal Tom Hawkins (Keegan-Michael Key) and help her find courage to speak up for herself.The scripture is beautiful, it truly makes you feel for each and every character that you cross and teaches the valuable lessons of acceptance and empathy. Meryl Streep as Dee Dee Allen is utter perfection, she makes the role truly fun and unique, a kind of acting that we rarely get to see from her. Her vocals are great in her songs, but her performance in It's Not About Me is amazing and truly breathtaking. James Corden was also great in his role as Barry, and while his accent could use some work, his overall emotional vulnerability and dedication to the role really shows. His song Barry Is Going To Prom is really inspiring, and while maybe not sung the best, the performance really sells it.Andrew Rannels' Trent Oliver is nothing short of hilarious, and while we are all sad that The Acceptance Song got shortened, he gets a big show stopping number with Love Thy Neighbour, which is one of the best parts of the entire film. Nicole Kidman, while perfect in the role, really lacked in screen time. Her solo song Zazz if fun while it lasts, but is completely forgettable amongst the other songs. Keegan-Michael Key really surprised us with his singing and acting abilities in this film, same with Kerry Washington. Ariana Debose is stunning and a beautiful singer and actress. Her song Alyssa Greene is truly heartbreaking and really makes you feel for the character. Jo Ellen Pellman's Emma is a perfect representation of that character and both of her songs, Just Breathe and Unruly Heart are amazing and true tearjerkers.Now, with all this good, there is a little bit of downfall. First off, the synching the actors lips to the prerecorded songs was noticeable in some songs and it took away from the spectacle. Second, the major cutting of two songs, The Acceptance Song and You Happened was noticeable and really made me mad. Lastly, the glitz and glamour of colour in each song was kind of distracting and made it feel very overdone.Overall, The Prom is a great watch for friends and family alike. Everyone can relate to these characters and their stories. The world can learn from this movie how to be more empathetic and not live in a world based on fear. Overall, The Prom (2020) gets a 9/10."}, {"id": 321, "text": "Self-centered Broadway stars, Dee Dee Allen (Meryl Streep) and Barry Glickman (James Corden), are devastated by their latest review. Barry decides to take on an advocacy issue to raise their profiles. Dee Dee, Barry, Trent Oliver (Andrew Rannells), and chorus girl Angie Dickinson (Nicole Kidman) descend upon Edgewater, Indiana to fight for lesbian teen Emma Nolan (Jo Ellen Pellman) and her right to take her girlfriend to the prom. Tom Hawkins (Keegan-Michael Key) is the supportive principal. Mrs. Greene (Kerry Washington) is the opposing head of the PTA.Liberals from Broadway are the worst. That's how this Ryan Murphy movie starts. They are the most annoying characters. It may work on Broadway as irony but it's off-putting on film. It's meant as a joke but it's utterly unfunny. There is some controversy about Corden playing a gay character. I have a bigger problem with the way he's playing the character. I don't want to hate on the man but I hate his character. He is both too light for the comedy and too self-concerned for the appeal. The turn with his parents is diminished and I don't want him doing this.While I don't hate musicals, it's not my favorite genre. I don't particularly like any of these songs and quite frankly, I don't remember them a few hours afterwards. This movie is way too long at over two hours. Ryan could easily cut out a couple of the songs. I wish that he would cut out the entire Broadway group and hand this story to the kids. I guess that's not the objective. The objective is for liberals from Broadway to force their way into the kids' story and make themselves the story."}, {"id": 322, "text": "The Prom based on the 2018 stage musical of the same name, has always had a fight with itself for story, at its core telling something important and earnest but doing so in a way that's bright and flashy. If you go into it knowing this you'll have a fun time, but it's easy for that to be off putting to some unfamiliar with the original story. Ryan Murphy is both the best and worst choice to direct this, as his big style production aspects clearly shine through in all of his work, but his direction has never necessarily been subtle or deft, however this is some of his better work. Meryl Streep is phenomenal as always, her larger than life persona mixes well with the picture, and Jo Ellen Pellman and Arianna Debose are a huge highlight within the film, Pellman has a wide eyed innocence about her with a beautiful voice to back up her performance and her relationship with Debose is beautiful and quite realistic for this fantasy of a film, she isn't as shy or reserved as Kinnumen is in the original Broadway musical, but there's something about her that just makes you enjoy her any moment she's on screen, I hope to see more of her and Debose in the future. The rest of the characters and actors do their job well, Keegan Michael-Key, Andrew Rannells, and Nicole Kidman sell what they are given and make for entertaining people to watch. I'd be remiss if I didn't mention the elephant in the room that is James Corden in the role of Barry. While I won't lie and say it would've been nice to see an actor apart of the LGBTQ+ community in that role. (Not that straight or gay actors can't play roles of a opposite orientation,though in this role it should have at least been a consideration) , I think Corden does adequately with what he's given, though at times he may come across as a caricature I don't think that's what he's doing. I think he's portraying a proud gay man, but he and much like the others he is cast aside (Streep, Rannells, and Kidman) are just as larger than life as the characters they play. This can at times make the satire of them feel very awkward because these actors are already famous in their own right. Altogether I believe The Prom is a modern day send up to musicals of the 1950's. Large ensemble cast, tons of bright colors, and lively set pieces, but this time with a story to tell for the modern era. If you're looking for a comedy that's much more nuanced and less showboaty detailing similar issues please watch Happiest Season on HULU. But if you're looking for an escape into glitz and glamour with some talented actors and stand out new comers leading the pack as well as an amazing soundtrack. I'd say Ryan Murphy's film is a fun watch, that may have you feeling quite warm inside by the end, pop it on and give it a watch."}, {"id": 323, "text": "If I had a choice of doing nothing or watching this film again, I might watch it... Might. I was not impressed. Streep did the best she could with the material, Kidman looks FABULOUS, Keys raises the quality, but Corden is now my theatrical 'red-flag.' If he's in it, it's bad.This is a musical with an emphasis on music-too much of it and none of it memorable. The story is an old one, from some event that I occurred decades ago. Predictable, thus boring and uninformative.Tracy Ullman has one or two scenes and through her appearance, delivers 90% of the acting quality that resides in this film.Oh, and I forgot... Kerry Washington is in it. THAT's how bad it is... I forgot about Kerry Washington."}, {"id": 324, "text": "The basic premise of the film is that these Broadway actors (who have just had a flop) decide to help out a young girl have the prom of her dreams after its cancelled when she cant bring her girlfriend. It sound nice in theory but truthfully I found the Broadway actors (played by Meryl Streep, James Corden, Nicole Kidman and Andrew Rannells) to be the worst part. Andrew was the only tolerable character in those scenes but overall its played too over the top that it almost comes across as parody. They sing a song early on in the film where they have to help the little lesbian because they're thespians and I swear it sounded like something you'd hear in The Producers. And the other part of the film (the school side) while being a little cheesy was at least very heartfelt and earnest. So the tone on the Broadway side just didnt always gel. I totally get that they're supposed to be out of touch and dramatic because theyre theater actors but its just a bit too OTT. James in particular comes across as very grating as he tries to play very stereotypically gay.I also feel like the film doesnt have a lot of real conflict in it. At the beginning of the film the prom has been completely cancelled over Emma (played by Jo Ellen Pellman) being gay. And shes fighting the PTA over this matter. But as soon as the Broadway actors show up (without them actually doing much) boom prom is back on now. So that conflict is over. The mean popular kids are no longer homophobic because Andrew Rannells sings them a song about how they're hypocritical for cherry picking the bible. Sop that conflict is easily resolved. Not too mention that if all took was to bring up that its also a sin to have a tattoo or get divorced then Im sure there would be no more homophobes in the world. Like, it aint that easy. Kerry Washington plays the pTA ringleader who's trying to stop Emma and the Prom. She also plays the mother of Emma's secret girlfriend. And that could be an interesting thing to explore but they dont really give much between the two characters. And once the daughter finally does confront her mom and tell her shes gay, literally 5 min later in the next scene the mom is all I love you and she has accepted her. Like everything in this film is wrapped up too neatly in a bow. Im not saying this film has to end dark...I know they want to have the happy ending and thats totally fine...but conflicts are resolved to easily.I've never seen the stage musical so I dont know how it compares. But I feel like this film had the potential to be good. I just think they could have done without the broadway actors storylines...they dont really do much to push the storyline forward anyway. And instead focus on Emma and her fight, maybe have some students be the ones to rally behind her and expand on those relationships."}, {"id": 325, "text": "The Prom - C (Mediocre)Too many songs, and sluggish pace and mediocre songs can give you a headache at times. I had to mute multiple times or fast tracked songs especially featuring the young lead actress. She was painful to watch, always gleeful even in more serious situations. You barely think she suffered because she is always super cheerful. Who talks like that, with mouth wide open in a grin all the time. Also forcing her girlfriend to come out of closet relentlessly when she is not ready. I bet in Real life Emma there must be heartening story but unfortunately in this Emma they're unable to find it. I was very disconnected to her motives because she wants a prom dance she should have it eventhough her girlfriend is not ready for big comeout infront of whole school, friends and her mom. Not sure why almost 25+ And 30 years old girls are playing teenagers.Meryl Streep and Nicole Kidman made it possible for me to push through this mediocre songs's bonanza. Soo many songs after songs after songs and sung even more painfully by character actors. Also the whole controversy about James Corden playing a homosexual is ridiculous, isn't for years str8 actors Sean Pean, Hilary Swank, Joseph Gordon Levitt, Laura Dern, Felicity Hoffman and Jared Leto etc broke the bearers and made ways for LGBTQ+ Characters to get mainstream attention and respect. An actor should be able to play anything even a tree as Scarlet Johansson once said.Why actors personal life and preference matters, lot of actors don't want their personal life in limelight. So, it means they should not even audition for these roles because they are not bold enough to comeout of closet. This shows the narrow mindset of current Cancel Culture, we have a bold mediocre maybe but still a movie like that and instead they pick on why they cast James Corden in it. World is truly becoming a toxic place for artists where they're getting judged with whom they sleep with rather than their craft."}, {"id": 326, "text": "My feeling towards this movie are quite mixed. It doesn't suffer from the same problems many other movie musicals face (overly long, really boring, etc.), but it still has problems.Firstly, I'll start with the things I liked. Most of the performances were very good. The lesbian lead was especially well-acted, especially because this is the actress's first movie. Her emotions felt genuine, and she was always able to evoke a lot of sympathy from me. I also really liked Meryl Streep and Nicole Kidman. Both had some funny lines and a few good songs. Additionally, the initial premise of the movie is quite clever and topical. Mainstream LGBT+ films are always welcome, and especially one that deals with performative activism and homophobia. I wish the film had explored its theme of homophobia more (such as seeing how it effects the main character's day-to-day life), but it's still a good starting place.Now let's get into the bad stuff. To start with, next to Corden, Streep, and Kidman, there's a fourth character in the movie who doesn't undergo any transformation as a character. I get that he was supposed to change the town instead of changing himself, but that doesn't excuse him being a two-dimensional character. Another thing: Nicole Kidman is very under-utilized. She has no arc as a character, and only has a handful of lines. Considering that she's my favourite of the four main characters, this was really disappointing, especially considering that her number is one of the best in the film. Speaking of the songs, most of them don't feel memorable or distinct whatsoever. The only two exceptions to this are the catchy gospel number Love thy neighbor that's also a a good critique of certain Christians' hypocrisy, and the aforementioned Kidman number Give it some Zazz, which is a nice reference to the song numbers of Bob Fosse. But other than them, most of the songs sound weirdly similar, as if they're all part of one, ginormous song. Even the obligatory song that's only added to be eligible for an Oscar nomination leaves no impact at all.Now, let's get to the problem that everyone's been talking about: James Corden's performance. I'll say that it isn't the worst gay man performance I've seen (Betty's ridiculously stereotypical friend on Riverdale still takes the cake), but it's still pretty appalling. When your only gay man is saying lines like I'm as gay as a bucket of wigs, you should completely rewrite him. Corden's subplot where he comes to terms with his past doesn't work, because his character is so cliche I can't empathize with him at all. It never feels like I'm watching a gay man reckon with his troubled past, it feels like I'm watching James Corden perform every harmful stereotype in the book. When films like A Chorus Line and My Own Private Idaho (both 25+ years old) have more realistic gay men than you, then there's a very big problem.What's especially baffling is that there's a very simple fix to the problems with the film's leads: why not just have Love thy Neighbor guy be gay and undergo the transformations that happen to Corden's character? That way, Kidman can take Corden's place as the lesbian lead's friend and have her arc be about being appreciated by someone. Traces of this are present in the film: there's a scene where Kidman and the teen are talking and it's explained that they're friends. Kidman even expresses how happy she is that someone is noticing her, as normally seems just thought of as a chorus girl. So have her help the teenage girl with getting ready for the prom and encouraging her instead of James Corden, and use that extra screen time to expand on her issues with being ignored. As for how the solution would work for Corden and Love thy Neighbor guy, it hits two birds with one stone. It gives Love thy Neighbor guy a character arc (accepting his past), and it gets rid of Corden's offensive caraciture of a gay man. The movie would be vastly improved if they implemented this change, and my rating would go up at least a number.Overall, The Prom is an average movie. The acting was mostly good, and the story was relevant, but the songs are mediocre and there were many missed opportunities and two too many underdeveloped characters, made worse because they're ostensibly the protagonists. Additionally, Corden's performance was ridiculous in its offensiveness. Whilst The Prom may make for a fun evening for some, I think it should've just stayed on the stage."}, {"id": 327, "text": "We have come to show this community that gay people, and gay positive icons such as myself, are made of the same flesh and blood as they are. Dee Dee Allen (Meryl Streep)Who would have thought: A Netflix musical about lesbians from Indiana? A musical with rousing numbers that fit the book? A-list actors singing and dancing in a Teen musical? A heavy-handed message that works no matter how many times it is repeated?Such is The Prom, an adapted Broadway musical and an unlikely uplift in parlous times, that loudly preaches love trumping all, even homophobes and deranged presidents.Dee Dee, an acclaimed Broadway actress, and her friend, Barry (James Corden), having come off a musical that tanked first night (about Eleanor Roosevelt, no wonder it did), seek a venture that will gain them repute as socially conscious, not narcissistic, as the New York Times claims in its show-breaking review.Angie (Nicole Kidman) discovers on Twitter a senior at a high school in Indiana who is denied going to a prom with her girlfriend. The troupe has found its cause, which they hope will counter the Times' claims and does make them better humans by the end.The film is all about inclusion, the ideal assimilation of lovers of all persuasions into the mainstream, in this case a specific prom. Although songs and dialogue constantly reinforce this idealism, the approach doesn't mitigate the abundance of good will for gay social outcasts like Emily and Alyssa (Ariana DeBose). I was elated that the tolerance motif never seemed bothersome, so highly pervasive it is.Just about everyone can enjoy the new year with this spirited production easy on the eyes and ears: Love thy neighbor trumps them all! On Netflix."}, {"id": 328, "text": "Is The Prom perfect? No. Is The Prom one of the most entertaining and rewatchable movies of the year? Definitely. With a fun story and fun characters The Prom is a great musical with phenomenal music and great dance sequences. It has flaws, at times in the middle is kind of repetitive and some storylines are not well developed, but at the end of the day it doesn't affect that much what this film brings to the table. The story is moving and compelling as well as the journey of every character wich even though some of them don't have enough time to develop they are all still working overall. The use of color is great and fun, and the presentation of the dance numbers is always delightful. Meryl Streep's performance is pure fun and completely hilarious, she is fantastic. Nicole Kidman has very little screen time but she really commands the scences she is in. Andrew Rannells and James Corden are also very good, although Corden can be kind of annoying at times. Keegan Michael- Key is a complete scene stealer. A highlight is also the great chemistry between Joe Ellen Pellman and Ariana DeBose, both of them really great. Overall the movie has a few flaws but it really doesn't affect the energetic and compelling story that The Prom gives us. Is fun, filled with great humor and great performances. A must see movie if you like to cry and laugh in a span of minutes even though I need to say not everyone will love it. Really great!"}, {"id": 329, "text": "What a wonderful movie from the team of Ryan Murphy. The all star cast delivers what can only be called great in terms of the characters they are playing. There have been so many bad reviews for James Corden yet his over the top, outrageous performance is wonderful.In my opinion the most stand out actor is Andrew Rannells who has finally been given a role which shows what great talent he has. His dance routine in the Shopping Mall is just spectacular. When he stood in the middle of the water fountain at the end of the dance I could see Esther Williams rising in the water. In Boys in the Band he gave an amazing performance with his real life partner, and now Ryan Murphy has given him an outstanding opportunity in continuing to build his career.So much of this film reminded me of the CinemaScope musicals of the 50s and 60s. I even expected to see a water ballet scene at one time but alas that did not happen.This movie is certainly what we need in this difficult time of Covid. Those who give it bad reviews should never have watched it in the first place without reading what it is about.CONGRATULATIONS TO A WONDERFUL CAST AND CREW"}, {"id": 330, "text": "IN BRIEF: Dubious casting and bad direction take some of the fizz out of this effervescent Broadway musical about intolerance and homophobia.JIM'S REVIEW: (MILDLY RECOMMENDED) Critics were decidedly mixed with a love-it-or-hate-it attitude to Ryan Murphy's film adaptation of the Broadway hit, The Prom. I did thoroughly enjoy the live production on stage with its talented cast, good score, and flashy dancing. It was a enchanting romp about intolerance ala Hairspray. And it is hard not to compare these then and now versions of the same musical. (Decidedly, Broadway wins!) This movie adaptation is still lively, but it is also heavy-handed and preachy. However, there is still much to enjoy in this diverting movie.The gist of the film is a musical romp that deals with homophobia. A idealistic teenager wants to take her girlfriend to the prom and faces prejudice head-on. Her protests becomes a cause for some out-of-work actors who come to the town to support her cause and gain some needed publicity.Ryan Murphy directs and he does open up his film to avoid theatrical excesses, but he stages his performers in realistic setting that dwarf them and make the musical elements all the more jarring. Add to that, the film's lousy photography and editing that seriously hampers Casey Nicholaw's energetic choreography, with too many close-up and faraway shoots that always cut off the dancing from the knees down. Not the best approach for a musical and Mr. Murphy should know better. (The usually reliable cinematographer Matthew Libatique does his weakest work here and Peggy Tachdjian and Danielle Wang abet his musical crime.) As with the original production, the songs are solid, if not truly memorable, but they do advance the story well.The screenplay by the original Broadway writing team, Chad Beguelin and Bob Martin, remains mostly the same as the play although some dramatic additions to the plot (plus Mr. Murphy. To his credit, the filmmaker does try to bring in some diversity in his casting by giving some Black and Asian actors supporting roles in his film.So let's talk casting. The original Broadway cast soared. It's a shame that Hollywood rarely allows the talented stage performers to reprise their roles. Instead they seek out bigger names to substitute in order to lure moviegoers into the theaters, or nowadays, streaming into your home. And that again is the case here...with decidedly mixed results.The roles played by Tony nominated Beth Leavel, Brooks Ashmanskas, and the talented belter, Caitlin Kinnunen as Emma, the crusading lesbian, were prime examples of Broadway talent enhancing the material. They were all such a delight on stage. Here in moviedom, Mama Streep inherits the showiest role as the narcissistically challenged DeeDee Allen, and she is charming, a close second to Ms. Leavel. The remaining cast members never reach her level of zaniness, although Mr. Conden playing Barry Glickman, the swishy queen diva, comes close. Less than solid support is given by Andrew Rannells as Trent Oliver and Nicole Kidman as Angie. Their second banana comic status proves to be challenging. Newcomer Jo Ellen Pellman is a fine choice as our plucky heroine and Keegan-Michael Key as DeeDee's love interest has a nice chemistry with Ms. Streep. Kerry Washington and Kevin Chamberlin are wasted in their still sketchy and throwaway parts.The Prom loses its zazz as it hits home its positive message of tolerance. It is high-spirited entertainment, but you might want to sit this one out. Just where are those jazz hands when you need them? (GRADE: C+)"}, {"id": 331, "text": "The prom is a movie that I wasn't looking forward to after watching the trailer and honestly I had no plan to watch this movie but I choose I was going to give it a try and honestly the prom isn't as bad as I thought it was going to be BUT it's not amazing either there is a lot of things to like about this movie but there is a lot of problems with it too that do weigh down this movie from being it's true fun self because honestly at times this movie is ALOT of fun and really energetic. The good in this movie most of the cast honestly fit really well in there roles but the cast in general even though most of them don't fit are really good in this movie especially Jo Ellen Pellman who just nails her roll as the main character Emma. The characters for the most part are likable and you really feel for most of them. The music because this is an adaptation of the hit musical for the most part is good there is some really good songs in this movie like just breathe, dance with you, you happened, tonight belongs to you and the reprise version, Alyssa Greene, unruly heart, and it's time to dance are all great songs in this movie. The 3rd act had me smiling and at times on the verge of tears because of how sweet it is. The movie is also very pretty to look at. The message of self love is a message I can get behind. But there is a lot of problems with this movie to. Some members of the cast just don't fit in there characters meryl Streep and James cordon are both really good in the movie but it's really difficult seeing them playing there characters because they are just so miscasted. The 1st and 2nd acts even though there is moments that are good are just so slow in pacing and at times are just really boring. The rest of the songs that I didn't notice are just bland and unoriginal. The run time just feels to long. The story even though it is an interesting story is just at times poorly executed. Overall, I think this movie does have talent and at times there is a lot of fun to be had in this movie BUT the movie just doesn't work at times and there's a lot weighing it down from being honestly a really really great movie because currently it's just okay and enjoyable. This movie well for sure be loved by people and maybe it's aimed for a certain audience but in the end I think you should give the prom a chance and maybe someday in the future I'll give it another shot and if my thoughts change I'll re review it."}, {"id": 332, "text": "It takes a while to get used to the style of the film and the characters but if you take that time its worth it. At the beginning it all appears a bit irritating, cartoonish and fast spirited. But the more we get to know the characters and their conflicts the more interesting it gets, I am also always a bit divided on Ryan Murphy. As a creator and creative mind I love him, as a director he rarely meets my expectations of good quality direction. This is no difference. The actors however make up for this. Meryl Streep is really good and developes her character quite well but you wouldn't expect less. Its not an Oscar worthy performance but I am sure she will become a Golden Globe front runner once again. James Corden is really annoying at first but also developes his character so well that he ends up giving a really good performance. Nicole Kidman is rather wasted. She has her Roxie Hart moment but other than that sadly rather forgettable. The young girl who gave her debut performance Jo Ellen Pellman is very good and so is Ariana DeBose. Kerry Washington was very stereotyped and never got out of this. Keegan-Michael Key is very smyphatic. Most of the songs were very good, the chereopgraphies mix between amateurish and very professional and entertaining. The look was nice. All in all a good light entertainment film with a strong message. Worth for the cast. Always nice to hear Meryl Streep singing."}, {"id": 333, "text": "I don't understand the 1 star reviews, just watching the trailer gives it all away. You know what you're signing up for!! If you dont like musicals, cheesy, camp, singing etc......... Then dont watch it!!! So easy!!Ok so first of all there was a loooot of tears. But let me say this. MERYL STREEP. She is a delight. And I was worried about her performance because Beth Leavel's voice in The original Broadway version is so extra and sharp. And I can't help comparing. But I think she did an amazing job, I was not worried about the acting (obviously she's Meryl) but the singing I mean I know she's a good singer, and it's one thing to sing Mamma Mia but it's another to sing The Lady's Improving!! So 5 stars for Meryl!!I love Nicole Kidman and I think her character was breezy and peachy but I wanted more of her!! I loved her version of Zazz!! But it was not enough screentime!!You know what James Corden didn't even annoy me. Usually he's always hyped up and he gets on my nerve but he was fine this time!! My only issue is that his character could have been played with more depth, but as a straight man I understand he might not have wanted to overdo it. The best thing in my opinion would have been to cast a gay actor.It was basically everything I wanted it to be. So I'm not complaining at all. It was camp and full of sequins!! The Prom scene at the end was shouting DIVERSITY!!!! And I'm loving it, seeing all the Queer kids go to the prom waaaaas sooooooo cute the last 15 minutes I was fully sobbing!!! I think it was just the right amount of humour and the exact right amount of seriousness due to the subject and I think it was sooo beautiful!!!Jo Ellen Pellman was perfect as Emma, her voice is so beautiful and she gave such a strong and emotional performance. It was so well balanced!!Ryan Murphy is really good with colour pattern, all of his shows have this pastel colour theme. This film was pretty much the same, the cinematography is always on point with Ryan Murphy and he did not disappoint!!! It's always so colourful and bold and tacky but in a good way!!The Prom sends a message of self acceptance and tells Queer people to be proud of who they are!!"}, {"id": 334, "text": "From my perspective, it is not a movie that bad. In this period of global crisis, along with all sorts of social problems, this film passes on turning energy indeed. Echoing the situation of discrimination that does happens in our world, the film instantly acquire a broader moral lesson and that's the very aspect which touches me most. It wants to teach people, who live in a isolated and self-centered people, to love your neighbor, to be inclusive, to show more humanity concerns.However, just a personal view, the film is a noisy one for me. And it's too happy. That itself isn't wrong, but not my piece of cake. Performance is awesome, but it seems that the main characters hasn't changed into a better version of themselves, although getting through so many things, their inherent lacks just hide under the mask of the cheerful atmosphere.It's literally not a bad film, but not a good one either."}, {"id": 335, "text": "2020 has been a drag to say the least. Everyone is down from the years events and the pandemic and the holidays seem to be a bust. So here comes Ryan Murphy's joyous old school musical based on the broadway show. Featuring a barrage of wonderful stars. The film centers on a young gay woman whose not being allowed to fully participate in her prom by the PTA. So some broadway celebrities with bad pr travel to the town to rectify the situation for some supposed selfless headlines. The movie is just a blast of positive energy with great performances by Meryl Streep, Nicole Kidman, Andrew Randall, Michael Keegan, newcomer Jo Ellen Pellman and most surprisingly James Gorden who delivers a wonderful and engaging performance. Directed with creative zest by Ryan Murphy of Glee and American Horror Story. The film features dazzling choreography, a great soundtrack and wonderful musical numbers. I wish I could have seen this in theaters but it's still an amazing cinematic experience. It's funny and sad and it's just the experience we need right now. An energetic, inspired, campy, fun explosion of epic proportions. One of the best films of the year.****.5/5"}, {"id": 336, "text": "Movie musicals are normally a mixed bag. Even the good ones can be polarizing and characters bursting into song can sometimes be a hard sell to modern audiences who expect gritty realism. The Prom embraces the format completely with some mixed, but mostly positive results.After their latest show bombs, two self-obsessed Broadway actors recruit two of their out of work friends to get some much needed positive press by crashing into a small town to teach the yokels a thing or two about tolerance after a lesbian high schooler isn't allowed to take her girlfriend to prom.It could be said that The Prom is a little over directed. Some musical numbers work wonderfully and others seem to be edited to have a cut every 5 seconds to either keep the audience awake or distract from some less than stellar footwork from the Hollywood actors coming into the musical world. These choices can be distracting, but everyone involved in so joyful and game to entertain that it becomes a slight weakness rather than a huge drawback.Armed with a wonderful cast, director Ryan Murphy pulls every laugh and tear he can from the material even if certain moments can get a little too sweet and sugary for its own good. The 2nd half has the tendency to drag a little bit more than the first, but all in all, The Prom is a delicious confection that had me smiling from ear to ear."}, {"id": 337, "text": "My opinion on the various themes I've seen in the reviews : The first 30 mins are tough: the songs are not really entertaining or specially harmonious so you don't get swept up in anything. So instead, use that time to get excited at the thought of watching a musical (cuz if you don't like musicals or this is your first, this is the wrong one to see), know it gets better and enjoy the visuals and costumes as those are awesome from the startAgain, about the songs: some are great, others really not so good. Generally the ensemble numbers I find are better. I will say though, I find a lot of the lyrics are lame, verses too prescribed just to make the point.The story does seem like it's 10 years too late... but I guess it's the point? This acting group was looking for an easy cause to get behind because in 2020 how could a community stand by such bigotry when the spotlight is on them? I think? Not sure. I'm sure there are still schools where this could happen, and if so... shame on you, humanity...I see mixed reviews on James Corden, so here's what I'll say a) his accent is REALLY not that bad (In fact, it's fine, it's not like he's forcing a southern accent or anything, he puts on a harmless middle of the road, generic American accent) plus he sings 1/2 the time so you can't even hear it b) his character is really endearing after the first hour c) love that he got the love song at the end during credits shows he really can sing.Quick tangent: James Corden's character's mother thing? Uh huh, it's not that easy... at least put in a line about still lots to work out and work to do for him to truly forgive but he missed her and needs his mama Nicole Kidman: seriously wtf? She did nothing in this movie, why waste such a great star? It's not her fault, there was nothing for her character (is that supposed to be a reflection of her character's story of always being a chorus girl and not getting the lead?) We know she can sing and dance. Plus story wise: Emma thanks and hugs everyone at the end but never a really moment with Nicole's character, and even the choreography, James dances away from her, she's on the sidelines... even Trent gets two small moments, she gets nothing.Yes. Meryl Streep is fabulous. How can anyone be that perfect that she nails every role? 'Nuff said.Conclusion: This won't win awards. And you have to like musicals to enjoy it. And you may forget it by tomorrow. But while watching, you'll have a good time. Lyrics: not edgy enough. Songs/music: some great, some eh. Dancing: good. Acting: great with what they've been given. Costumes and visuals: everything you could wish for from a campy musical."}, {"id": 338, "text": "Charming, glitzy and filled with heart; The Prom will have fans of musicals in the palm of its jazz hands.In this musical comedy, a troupe of hilariously self-obsessed theater stars swarm into a small conservative Indiana town in support of a high school girl who wants to take her girlfriend to the prom.OK, yes, The Prom is cheesy af BUT it's entertaining and filled with great performances and musical numbers. Jo Ellen Pellman delivers a break out debut performance that will leave you inspired and feeling good. Streep, Kidman and even James Corden are respectively grand in their roles. Along with Pellman, Andrew Rannells delivers the next great performance, with his scenes literally jumping off the screen. I believe what filmmaker Ryan Murphy is trying to do in this day and age is give us stories with underdog characters that we can all relate to, and it works. Murphy is one of the hardest working people in the business and with The Prom, you're sure to have a good time.Follow @snobmedia for more reviews!"}, {"id": 339, "text": "Ryan Murphy offers us a well-meaning and optimistic message about diversity, homophobia and inclusion (his usual themes) but through a somewhat old-fashioned musical, both in its musical bill and in the educational way in which addresses those issues. The film works best when it focuses with sharp humor and irony on the vanity of its characters and, last but not least, gives us a new festival of the marvelous Meryl Streep.Two musical comedians, Dee Dee Allen and Barry Glickman (Meryl Streep and James Corden) are defenestrated by critics after their last Broadway premiere, which they were celebrating in a New York bar. Along with a showgirl, Angie Dickinson (sic) (Nicole Kidman) and the bartender of the place and also an actor on hiatus Trent Oliver (Andrew Rannells) find out that in a conservative town in conservative Indiana the parents' meeting of a school He decides to suspend his graduation dance (the Title Prom) to prevent a lesbian student, Emma Nolan (Jo Ellen Pellman) from attending it with her girlfriend. The comedian quartet decides to travel to Indiana to defend Emma's cause and thus regain notoriety and prestige.We could place El baile in the subgenre of movies about proms, a true institution of Yankee culture, so it affects rites. A masterpiece of the subgenre would be Carrie, for example. So there are two thematic lines of this musical comedy: homophobia and the struggle for inclusion on the one hand and narcissism, the selfishness of the stars and their attachment to success, embodied above all in Dee Dee and to a lesser extent in Barry.Regarding the first, the film is a well-intentioned but somewhat exhausting permanent down-line on the right to diversity, in favor of inclusion and against homophobia, faced with unchanging seriousness or sentimentality. Instead, the best moments of the film are when he humorously describes the vanity of the characters. They could have included fewer educational songs and more songs by the villains and introduced more disagreements or nuances into the group of good guys.The songs: the songs sung by comedians fit in with the emphatic and bombastic (and somewhat old-fashioned) style of classical musical comedy that works best with irony. The songs of Emma and her girlfriend have a more modern and pop nuance, but up there.The dances: it shows off an epileptic and overly edited choreography.The cast: the film includes perhaps the two greatest Hollywood divas. The one that saves the film is the marvelous performance of Meryl Streep: she sings excellently well, she again shows herself as an absolute comedy dominator, her character is the only one who presents some folds and contradictions and at the age of 70 she shows energy and her usual magnetism. The wasted Nicole Kidman gets a fairly minor character, a loser. As always, she does it well. The most sentimental character is that of Corden, who as an actor is quite bland. The girls sing well. Emma's girlfriend Alyssa (Ariana DeBose) is a reincarnation of Leah Michelle.Watching this film, we come to understand that the universe of its director, Ryan Murphy, the exasperated style in which she frames all her fictions, is that of the musical."}, {"id": 340, "text": "With an A-List cast based on a hit Broadway musical, you'd expect The Prom to be hitting every production high note. But something about it felt compromised and rushed, as if there wasn't quite the time and budget to do it right.For one thing, it was choppy; scenes were obviously cut out, probably to hit the two hour run-time. I would love to see the deleted scenes reel. For example, we're suddenly in a scene with Emma's grandmother with no set-up or explanation. You can figure it out, but something's missing. Similarly, the climactic resolution between Kerry Washington's character and her daughter needed something more than just being suddenly dropped in there.While the setting was bland, small-town Indiana, the scenes in the high school and mall looked like someone said, go out and find us a place we can shoot, cheap. Nothing special. On the other hand, the early number on the street outside Broadway theaters was brilliant.As you would expect, the acting was first rate. Streep is Streep - she can do anything. Kidman made the most of a smaller part. The young performers, especially Jo Ellen Pellman's Emma, are excellent. My only minor quibble was that I couldn't get used to Corden's (excellent) American accent, but he played the character perfectly.Don't get me wrong. It's still entertaining and well worth seeing. It just feels like it could have been so much more. The Prom reached for Great, but didn't quite make it."}, {"id": 341, "text": "Frighteningly miscast (Mr. Corden's performance is the least of the objectionable performances here; Joe Ellen Pellman as Emma and Andrew Rannells seem to be the only ones in on the joke that is The Prom. On the stage, this is a gentle and loving spoof to a formulaic Broadway musical, that gently nudges you in the funny bone, giving you some spectacular choreography, framing a social issue. Ryan Murphy takes something airy and light and jabs you with very sharp elbows in the ribs so that everything quickly becomes bruised and painful.There's no reason for Meryl Streep ever to perform in a musical again. Thank you, this is enough. I feel like she's using her well-deserved fame to weasel into roles that no one would have cast her in if she wasn't Meryl Streep. The use of VFX de-aging on Streep's face is the first sign that choosing her was a mistake. First, she's not that old for this particular role. She just doesn't have the instrument or talent for musical comedy. Ms. Kidman has a sweet, though thin voice, and her ability to dance is...none. Why an A-list actor would take a B-role in a, yes, winning though minor musical, boggles.I'm a little baffled at the heat James Corden has suffered. If anything, I think he plays against the swish stereotype successful on the stage by the wonderful Barry Ashmanskas. And he's as over-eager here as he is in anything. Did people complain he was offensive in Carpool Karaoke? I'm not rigid in filming the original Broadway cast in a film adaptation. Often it's not a good idea, but you really want a step-up in the film version; plus, you have the luxury of picking from anyone you want. This film didn't need this kind of star power to bring in an audience.Based on the true story (along with some other cases) of Constance McMillen, a senior at Itawamba Agricultural High School in Fulton, Mississippi. The subject material is worth sitting through all the noise and clutter. And while the choreography, the only thing that survives the transition from the Broadway stage to the screen, is as athletic and fun, Murphy doesn't know how to hold his camera still long enough for us to enjoy it. Putting it in actual (and poorly chosen) locations, undermines the fun, a shopping mall being an especially grievous choice.The candy colors and very hard focus of the cinematography distracts from what weight the film has, that is, the bigotry endemic in small Midwestern towns. But it's worth being reminded of the actual event the book is based on. So buy a ticket...and find a YouTube of Beth Leavel's performance on Broadway and see how much we were cheated by not bringing her as well as Brooks Ashmanskas' Barry is Going to the Prom."}, {"id": 342, "text": "I found myself laughing out loud several times during the opening number. I loved the star studded lineup of actors with Meryl Streep, Nicole Kidman, and James Corden. I wasn't as familiar with Andrew Rannells, but he performed my favorite number Love Thy Neighbor. In a scene reminiscent of a flash mob, he performed Love They Neighbor in a mall with the cast of Godspell as his chorus. This song was at the heart of The Prom. I could identify with the lyrics with how people often pick and choose which rules they follow from the scriptures. For example, it's no longer acceptable to stone a child for disobeying his parents. If there is anyone who curses his father or his mother, he shall surely be put to death; he has cursed his father or his mother, his bloodguiltiness is upon him. It's not acceptable to follow that Bible rule anymore thankfully or we wouldn't have many children left. The point of the song was that loving your neighbor as yourself trumps all other rules. The point was well taken, and the musical number was fantastic as a bonus!!The Prom delivered an important serious message, while offering great humor and fun musical numbers. That's a tough task. James Corden and Nicole Kidman both were fantastic when they had one-on-one scenes with the teenage Emma.The ending wrapped up too nicely and neatly for me or I may have given an extra star."}], "reviews_amount": 343}