{"name": "I'm Your Woman", "titleId": "tt10243992", "reviews": [{"id": 0, "text": "Love Rachel Brosnahan and couldn't wait to see this. I don't need lots of action to find a movie satisfying but this one was just too slow, ponderous, and unnecessarily long, for my taste, though it did pick up toward the end. Guess I will just stick to Mrs. Maisel for my Rachel Brosnahan fix."}, {"id": 1, "text": "Take a slow movie, ad intermittent tension AND a crying baby! I'm NOT your WOMAN to watch this show! If the baby hadn't cried the entire time I could have maybe stood it."}, {"id": 2, "text": "I tried very hard to be patient, hoping that it would get better, but gave up. This movie is like nails on a chalkboard. The acting is terrific but the script, plot, and art direction is so drawn out and repetitive! Two-thirds of the audio is the baby wailing which just gives the viewer a headache!"}, {"id": 3, "text": "Couldn't watch more then half with the baby crying Continuing turned me off. Driving me crazy."}, {"id": 4, "text": "When it comes to movies, the audience should believe the characters and understand the behavior and situations.At first I thought this would be like Quarry, the excellent one season show but No. Instead here's a movie that tried to be too many things at once, some scenes so awkwardly badly acted I felt embarrassed for them. There are a few potholes they try to explain in drawn out crying scenes which is so silly why bother.And the unlikely fair maiden/damsel in distress who just learned how to shoot saves all the black people who happen to be great cooks and are somehow magical baby whisperers. Best thing about this movie was the music."}, {"id": 5, "text": "Most of the movie is the lead and a crying baby. The rest falls flat. Good performances from everyone including the crying baby. A lot of time invested on a plot with no return."}, {"id": 6, "text": "Terrible script, hollow story, hollow characters, makes no sense. It looks good, that's it. I am surprised that Mrs Mazel bothered with this dreck, I guess she needed money."}, {"id": 7, "text": "I like Rachel Brosnahan. That's why I watched this. Nothing about this film makes sense. Clothes and hair aren't right for the 1970's. She keeps a stolen baby. That's just wrong. But the end all is: there is nothing compelling about this film, not the plot, dialogue, or acting."}, {"id": 8, "text": "I don't really understand what's the point of making this movie. It would have been better if they have mentioned some things in a more clear way. Rachel,marsha and kene were brilliant. Rachel's talent was wasted on this movie. Anyway, i loved their performances and it is engaging surprisingly."}, {"id": 9, "text": "This film begins with a man bringing a baby home to his wife and telling her not to worry about where it came from. Soon, she's awakened in the middle of the night by a man who tells her to get moving while packing thousands of dollars from her husband's closet into a bag. Something has gone wrong and Eddie is nowhere to be found. A captivating premise! As the movie progresses, it becomes clear that Eddie is not just a thief but a killer who has likely been killed by the men looking for the money, so his wife has to run, protected by a mysterious man. Again, a very interesting twist on the usual crime story. But then things bog down and become farfetched and just inexplicable instead of creating more tension and intrigue for the viewer. Most egregious is the last 20 minutes, which fail to account for anything or tie up any loose ends, instead opting for a self-conscious ending that tries too hard to be arty in a vague and unsatisfying way."}, {"id": 10, "text": "I've given this 3 stars because of the committed cast, the fine score, and the fitting production design. But these elements could not save the day.How would I describe the writing? A Tarantino wannabe? Trying too hard to be a hip, violent film? This screenplay meandered, and lost its compass early on. The 2 hour run time was excessive. At about the halfway mark, I looked at my watch-always a sign that I want to make a quick exit.In the initial 20 minutes, I thought the lead (RB) would pull this through, but as more plot points were revealed, it just became a mess."}, {"id": 11, "text": "I still don't know just what this movie is about. Waste of time -"}, {"id": 12, "text": "The crying baby made the boring film even worse. Hard pass"}, {"id": 13, "text": "Although it started on a positive note with a crime driven husband, a wife and an unexplained child, I'm Your Woman derailed in the second half wherein there was not much explained about the past or any activities of the characters.Rachel Brosnahan was good, but the story seemed a little bit weak at the end with no strong resolution. Ultimately, the end kept on hanging between revealing Eddie's truth &amp; the unexplained child and saving oneself from some unknown gangster.My Rating : 2.5/5"}, {"id": 14, "text": "I enjoyed it. Sure, there might be plot issues, if you over-analyze it, but I try to not do that. I enjoyed Rachel Brosnahan's acting, and the plot was not predictable. I also enjoyed how much of the action was off-screen, how viewers and the main character did not know what was going on, how the story was told from a minor character's POV, and the relationships that developed."}, {"id": 15, "text": "No idea where this movie was going from it's placid opening and then it takes off with a female twist on the usual crime gone wrong movie and keeps on hurtling to the end. Standout performances from the leads and great art direction."}, {"id": 16, "text": "Nothing about this movie made any sense. It's very poorly written with tons of plot holes and it never really goes anywhere"}, {"id": 17, "text": "The chords that accompany the opening shot of this costume drama are a direct rip-off of the Moody Blues song Go Now. After struggling through 30 robotic, inexpressive minutes of this overly art-directed and stage-managed shell of a movie, I realized that the Moody Blues sampling was actually a covert warning from the production's music department: Go now, run, stop watching because there's nothing to see here beyond the wallpaper they used to cover up the gaping holes in the heart of the story."}, {"id": 18, "text": "Just saw it today and it's ok, but not anything special. It's really slow moving. Also, I kinda hated Rachel Brosnahan's character from the beginning when her husband walks in the door with a baby and says it's all set. WTF? She just accepts the baby and doesn't ask any questions?! What about the poor mother whose baby her husband stole? So lame."}, {"id": 19, "text": "45 minutes into this movie and NOTHING has happened other than a screaming baby. No thanks, I'm done!"}, {"id": 20, "text": "This film is boring. It seems as though you're waiting for something to happen, and when it finally does it's off screen. Don't waste your time."}, {"id": 21, "text": "This film was just boring, I want my 2 hours back!"}, {"id": 22, "text": "Slowburn movie that really drew me in and kept me engaged throughout. Characters are all interesting, did an excellent job with the time period, and the plot was easy to follow. I loved it, it ended too soon! Rachel Brosnahan was excellent, I'll be watching more with her!"}, {"id": 23, "text": "This is not an action movie, this is a movie about people fighting for survival. It's shows humanity at its best, the main characters are only doing the best they can to survive and help each other. Let this movie takes you where it wants to, don't watch it with ready answers and Hollywood action expectations and you will have a wonderful time."}, {"id": 24, "text": "I saw this movie on Amazon Prime just the other night and it surprised me very positively, I think Julia Hart directed a very different 70's noir than usual, it starts as a family drama and then becomes a full-fledged thriller, with some even very intense and raw moments. The film takes its time, Hart expands the times, but despite this, the film is never boring and keeps interest alive. Special mention for the talented Rachel Brosnahan who offers a truly remarkable performance."}, {"id": 25, "text": "I personally enjoyed this movie to a great deal! I felt as a woman what a young mother could have felt of that period of time with a child, living in an insecure present, with no financial or emotional support from anyone. Initially, she seems insecure, weak and stuck in a relationship which only trouble has brought to her. Eventually, as the movie continues, we see the lead character's powerful side unveiling. I loved the scene where she is holding her baby's shoe in the disco club, reminding us her purpose in finding the truth and escaping from the crazy mafia that is after her. About the other woman, I loved her persona. She is badass and helps our lead character find her inner power. All characters are interesting and compelling to watch. Loved all the 1970s details on the carbon box (eggs, shops, even diapers packages of the time). Great movie for those who don't want an easy and quick fix but instead a movie to understand in a deeper level and connect with the characters."}, {"id": 26, "text": "Solid performances by Brosnahan, Blake, and Kene. Script could have been a bit tighter, but it was generally a well-written and executed production. Also, Pittsburgh never disappoints."}, {"id": 27, "text": "I loved this film. Amazed to see so many bad reviews, likely due to a Michael Mann audience not knowing what to make of Kelly Reichardt stylings. Excellent period design, cinematography, and superb performance by Brosnahan, with a subtle script, heavy on interiority, that allows most of the action to enter without much explanation.I loved the way it left so much of the chaos and violence off stage, and brought just enough in to validate the terror of the characters, and the way it managed to play on some strong ant-racist and feminist themes without ever commenting on them. If you're looking for Heat, walk on by, if you're patient and motherhood thrills you, you might love this as well."}, {"id": 28, "text": "The two female actresses, the 70's setting and the little details were phenomenal. I love realistic life movies. Thank you for this picure."}, {"id": 29, "text": "The negative reviews here indicate that some viewers were perhaps expecting an action movie or straight crime thriller. This film isn't that (not until the final act, anyway). It's a nuanced character piece that begins in the guise of a genre flick and evolves into something more, and it's that sleight-of-hand and refusal to do the usual thing that makes it so compelling for an open-minded viewer. Much happens offstage - we're as in the dark as our lead character, Rachel Brosnahan's expressively confused Jean, from whose POV the story advances. Marsha Stephanie Blake is superb as her counterpart-cum-mentor Teri, as is Arinze Kene as the stoic, enigmatic Cal. The cast as a whole is absolutely terrific, the direction and cinematography supremely stylish. Not a shoot-'em-up then; much more of a slow-burn that develops into an unfolding portrait of two women navigating a world they're both far too good for."}, {"id": 30, "text": "I really liked this movie. The story and the acting were really good. Just as the action picks up that's when the movie ends. I don't need action in every movie I watch. I love a good story. There could be zero action in the film. This movie however does have a little action and suspense. I don't do spoilers so I'll say to give this movie a watch. Hopefully the ending works better for you. It definitely wasn't a terrible ending. I think because the acting and the characters were so good that you were left wanting more. Over a good movie and I'd recommend watching it."}, {"id": 31, "text": "Im Your Woman is a very slow film that will put to sleep many people and im not gonna lie i was also rather bored in some moments and i was thinking why isnt nothing happening but then i accepted that and i started to go with it.But still im not gonna lie i wanted something more from this movie and i didnt get that and because of that i give this film lower grade then i wanted.Story was fine but little cliched and like we have seen it many times before.Im Your Woman is a very slow film but it had some quality directing and acting"}, {"id": 32, "text": "The 1970s crime scenes and wardrobes were fantastic! Main character was very relatable and her performance was superb. A normal housewife immediately thrown into chaos after something goes wrong with her husband. She learns what to do on the fly to survive. Wonderfully acted and good story that continues to move throughout. Definitely worth watching!"}, {"id": 33, "text": "I've seen better acting in a 6th grade school play. Story was boring unless you like baby crying and people that don't know each other staring and acting scared."}, {"id": 34, "text": "Just saw this one. Really enjoyed the performances from all of the leads, in particular Rachel Brosnahan and Arinzé Kene, and it is always nice to see Frankie Faison. Really good, motown soundtrack that sets the mood and complements the story. I honestly never thought about what the backup vocals were singing in (You Make Me Feel Like) A Natural Woman, before, but after this film i can't stop singing Aaah-Oooh to myself...Very much enjoyed."}, {"id": 35, "text": "Rachel Brosnhan really shines with beauty and incredible acting! I understand bashing the movie based on the excessive crying and pacing but I'm Your Woman deserves more credit. The way the cinematography was done is so incredible along with magnificent music that is soothing! Such great parenting done if anything more than all the other positives is that Rachel is a wonderful mother to her daughter in this film."}, {"id": 36, "text": "Made it through the first episode.If I had some to show up I'm not even sure if it's good yet. But the first episode all I did is listen to the damn baby cry."}, {"id": 37, "text": "Did they cast slow robots or did they cast real human beings to act like robots acting like actors being robots. Ridiculous movie."}, {"id": 38, "text": "What were people thinking with these low ratings? This is basically an Oscar worthy film and performance by all involved. The story is gripping from beginning to end. Action suspense drama mystery all part of this great production. Bravo!"}, {"id": 39, "text": "Rachel Brosnahan and the whole cast shine. Loved this movie!"}, {"id": 40, "text": "Killing and more killing, then running from one safehouse to another. I just don't get what was the whole point, it just sucks so hard that I can't believe this has been done intentionally - surely something went horribly wrong somewhere, there has to be some excuse for the lack of any intelligence. Stay away from this garbage at all cost, do yourself a favor!"}, {"id": 41, "text": "Jean (Rachel Brosnahan) is a woman about to have her world upturned. Unable to have children her husband Eddie (Bill Heck) comes home one day with a baby boy and tells her that this is their new child. In the new Amazon Original Film I'm Your Woman; Jean is unexpectedly forced to go on the run with her child when an associate of Eddie tells her that things have gone very wrong and they must flee right away.It seems Eddie is more than a simple petty crook and has upset the wrong people resulting in Jean being forced into hiding. Her protector Cal (Arinze Kene); offers few answers about Eddie's fate but tells Jean that the danger is very real.The fact that Cal is African American and driving a white woman and her baby around in the 1970s does raise some eyebrows and makes keeping a low profile even harder. This results in Cal setting Jean and her son up in a home with instructions to not speak with nor befriend anyone and to only plug in the phone and call a number should danger arise.What follows is a steadily paced film that does not fall on the usual Hollywood tropes of extended action scenes and chases as Jean attempts to stay alive and get away from the danger that has taken over her life.The film is a departure from her Mrs. Maisel character and it is refreshing to see an interesting story that is content to move at a steady pace and develop characters versus the need to insert an action scene in every 10 minutes. The cast and story are engaging and the film makes for a very entertaining watch and one well worth a look.4 stars out of 5"}, {"id": 42, "text": "I get it! The pace adds to the emotional buildup! Finally a happy ending! Get'em girls!!!"}, {"id": 43, "text": "It's the '50s. A woman is barren and traumatized because she can't fulfill her obligation to produce a child and preserve the lineage of her gangster husband. She is a total mystery an alien in another world and unto herself as if she was suddenly dropped into another alternate reality. She does not know how to fry or boil an egg but was standard curriculum to little girls in americas home economics education system in that period. The supporting cast do an excellent interpretation of Hart's vague and intriguing script which leads to an inevitable contrived end."}, {"id": 44, "text": "With a phenomenal Rachel Brosnahan performance and a powerful story I'm Your Woman is a visually beautiful and emotionally thrilling movie with some amazing scenes. Great direction, very smart screenplay, beautiful aesthetic and great supporting roles. At times it feels like is going no where, especially in the middle where it even feels kind of messy. But still, this is a a phenomenal experience that will keep you at the edge of your seat, and it really is one of a kind."}, {"id": 45, "text": "I'm Your Woman, (2020). Directed by Julia Hart. Starring Rachael Brosnahan and Marsha Stephanie Blake. I stumbled upon this film while surfing Prime Video. I had never seen this title, and it seemed like it might be noirish. And it may be that this is the new style of noir. This movie reminds me of Mads Mikklesen's movie Flickering Lights. In FL the characters are also criminals who want to have a normal life: wife, children, home, money, employment. However, the way they go about achieving their goals is to take shortcuts through criminal activities which, of course, must be masked in secrecy to give the illusion of propiety. Jean, fragile from harrowing fertility problems, is viewed as incompetent by her husband, Eddie. She can't have children, can't cook, and is in a fragile mental state. Therefore, her decisions are made for her. She is kept in the dark and treated like a mushroom. But she is actively collecting data from the visible world around her and connecting the dots. The setting for this film is a specific time period, the 1970s. A time when women were treated as objects and were used and treated according to a perceived dehumanizing economic value. Jean reacts according to her conception of marriage. The wife is loving, loyal, obedient, trusting, and the arc of Jean's journey changes only when she is convinced that Eddie is dead. She is now able to make her own decisions. She demonstrates her intelligence, stamina, acumen, and foresight. Most notable throughout this film is the device of lack of exposition. Things left unsaid that must be figured out carry and determine the plot. The stars in this film are relatively unknown but did a wonderful job of characterization and acting. The action is always taut and propels Jean to new levels of awareness at all times. Deeper meaning. The breakfast scene. Jean serves Eddie a burnt offering for breakfast. He tells her that her cooking is incompetent. It is odd that she cooks the same thing everytime she cooks, and she never learns how to properly cook eggs. Eddie is incompetent because He cannot perform his duties in a legal or moral way without making someone his victim, displaying a lack of intelligence And competence. So the moral of this story has to do with competence and what and how one brings his/her share to the table. Totally engrossing. I give this tour de force film 5 of 5 stars. It's on Amazon Prime."}, {"id": 46, "text": "Takes it's time. May be a problem for those with attention deficit issues, their loss."}, {"id": 47, "text": "The basic story was okay, there were some good scenes and some interesting interaction between the characters, but they could have cut AT LEAST 90 minutes from this film and it would have been a LOT tighter. Halfway through I said to myself-- what, another hour?! The baby was pretty cute though. LOL"}, {"id": 48, "text": "I'll just say that given the run time, the characters should have been better developed. Too many throw away scenes that could have been spent exploring Jean's psyche or the minor characters that help her along her journey. Also, I didn't read any reviews from critics until after the film and I have to say that I'm constantly becoming less impressed with their reviews as they are based on identity politics. I feel like most normal folks who like film don't care about the color, gender, religion, socioeconomic status, etc...of the main characters, director, or the setting itself as long as it makes for a good movie. Too much emphasis is put on checking boxes. This was an average to above average crime drama told from a woman's perspective and an exploration of her identity, plain and simple. I wish I would never have read the critics reviews, it sullied the movie for me to an extent."}, {"id": 49, "text": "I laughed when I saw Michael Mann thanked in the end credits. Aspects of the this film reminded me of Thief (1981), Michael Mann's first film starring James Caan and Tuesday Weld. I am guessing that Brosnahan's character continues where Tuesday left off in the film when she was sent off with a guard and a bag of money by Frank, who had a whole syndicate after him. Same situation, Frank met Jessie who could not have children and because the former had a criminal record, they could not adopt either. A child was delivered from a syndicate connection. Thus, a pretty hefty nod to an earlier film classic (and one of my all-time favorites). I think Frank would have been nicer and more competent than Eddie in this film. Same with Jessie and Jean, as in Jessie from Thief would be more competent than Jean, but maybe the former might not have the courage to use a gun, as jean does. Speaking of which, is 'I'm you're Woman' any good? Yeah, it's alright. Not great but not bad either. Sorta dark, not-so-feel-good trying to be a feel-good, but plot sort of T-bones all that. I was chuckling throughout, but I like dark humor. Not bad, it's okay. As for those who complain about the crying kid, eventually he does stop and the story picks up."}, {"id": 50, "text": "I would have loved to see little twists and turns especially in an action movie well not so thriller of course. Rachel is the main highlight in the movie , a couple of scenes were intense but rest was just not up to the mark .Very ordinary movie / some time ordinary impresses a lot but sadly this time it became a slow plot ."}, {"id": 51, "text": "Seemed promising in the beginning, but just turned out - even with multiple killings - more slow, boring, and pointless. Seemed to have pretensions of being different and interesting, but it's main/only theme of all white males evil (yes, all), just made it more predictable and tedious. A bright spot is Arinze Kene, has a real presence, every seen he's in shines"}, {"id": 52, "text": "Name one character you cared about in this movie. The killed off the only interesting character."}, {"id": 53, "text": "There should be a law against producing such mediocre fare! Great acting but crappy storyline. It has some suspenseful moments which made me sit through it till the bitter end as I kept hoping for the action to pick up. Frankly, I got duped into wasting two hours of my precious time."}, {"id": 54, "text": "Nearly ruined by the script. Too much confusion and very mean spirited. The poor Evelyn character. No need for Cal killing her. He was supposed to be the good guy but ultimately just as bad as every other hood. Much tool long and some very unbelievable situations that strain credibility, especially the last half hour. And how do these people keep getting those cars???? Rachel does a good job for whats given her, and the rest of the cast just OK. Skip this....don't waste your time unless you are truly bored...And that crying kid!!!"}, {"id": 55, "text": "I really wonder who thought this script was movie material and more importantly who was the numb scull that gave the thumbs up to make it into a movie?The script is terrible, and to add insult to injury 3/4 of the audio features a crying baby just to make the movie even crappier that the dull script would on it's own.To sum it up, it's 2 hrs of pure boredom that even fast forwarding can't cure."}, {"id": 56, "text": "Nothing at all what the trailer led me to believe I would be watching. Spent the first hour listening to the baby cry. Made me want cry for watching."}, {"id": 57, "text": "Although there is great acting, (including the seemingly endless crying baby) this movie is so slow that you almost don't really need to watch it, but rather have it playing in the background and you'll still pretty much know what's going on. Or, even better, a great watch to fall asleep to, due to it being mostly uneventful and slow.The cinematography is decent with some well done segways here and there.The ending is about the only aspect making this title worthwhile.Over all, it's not a worthy title, unless you simply just need something mindless to play in the background while you work at home."}, {"id": 58, "text": "Maybe it's just because it's been a crazy, crazy year but I really enjoyed this slow burn.Yes, it has a baby crying for the first half...but it's part of the character development.Yes, it's slow...but if you grew up on 70's films, they were often slow, with little dialogue.The set design is amazing, the acting is great, the cinematography beautiful, the music score and sound track was near perfect. Yes, the story was thin and chaotic...AND that's the point. Several of the characters even state that no one knows anything, so it's obviously intentional. If you want big explosions, non-stop violence, over the top dialogue, don't worry, the vaccine is starting to roll out and those types of movies will be back before you know it. If you're looking for something different to get lost in, give I'm Your Woman a chance."}, {"id": 59, "text": "This is a 1970's crime story. Eddie (Bill Heck) is a criminal type. His wife Jean (Rachel Brosnahan ) knows it. One day Eddie brings home a baby because they can't have one. Then suddenly Jean discovers she must leave with the child in the middle of the night and Eddie is missing. The rest of the film fills in the slightly twisted back story and she keeps asking, So what do we do know?Story was not well constructed. Didn't care about any of the main characters.Guide: F-word. No sex or nudity."}, {"id": 60, "text": "My wife and I both like Rachel Brosnahan. She was excellent in the movie, but it was too slow moving for us. The entire plot around Eddie was too vague and uninteresting. We kept waiting for Eddie to reappear but of course he never did."}, {"id": 61, "text": "If this story had an ending I would rate it 9/10 instead of 8.Ever realize you drove your life a few miles down the wrong road? But turning back looks worse? This story puts you right back in that spot.Two strong personalities take care of one frightened woman, and she grows up to return the favor. Beautiful interactions between all three."}, {"id": 62, "text": "Even the baby did a great performance. I'm a Rachel Brosnahan stan now. The film could've been better but I'm satisfied with what I saw."}, {"id": 63, "text": "The title made no sense but I digress. The baby screaming was a bit to much. Not to mention the right off the showroom floor cars. Wish the movie would have shined like the cars"}, {"id": 64, "text": "A sheltered woman who's never been independent suddenly Gets thrust into the violent reality of her husband's life. It's about survival, facades, and coming into ones own. Loved it!!! And totally recommend it!!"}, {"id": 65, "text": "Genius + Remarkable Talent = Brilliant Original Gangster Flick. When everything is recycled this movie will leave you sitting in silence once the credits have rolled. Wondering where this story came from."}, {"id": 66, "text": "'70 s themed movie with excellent acting and direction. Good character development and evolution. Paced on the slower side, however it needed to be effective character growth. Must watch."}, {"id": 67, "text": "Was a slow suspenseful take on an action movie. Loved the action, believable characters, and the thought out plot line. Something you need to watch can't spoil it the fact I had to keep guessing every scene is what made me keep it on."}, {"id": 68, "text": "So I watched this movie only for Rachael Brosnahan to see her after her brilliant Mrs Maisel. Safe to say she is good here. But felt like this movie was made to cash in on the Mrs Maisel brand and use it's rejected wardrobe. Unnecessarily pointless &amp; long which could have been made in a 15min YouTube video. But we'll made though even though it's boring af"}, {"id": 69, "text": "I love Rachel in Marvelous Mrs. Maisel, but in this movie, my gosh, her character is so annoying and so stupid at times. She is a woman who is a damsel in distress and who needs saving!!! She can't even fry a freaking egg and she's very dependent on her husband!!! I got tired of waiting when she is gonna show some backbone. The most irritating part is when she tried to hide under the floorboard with the baby! My gosh!! How can someone be so stupid."}, {"id": 70, "text": "At the beginning, nothing makes sense. As it moves along through the story and pieces are revealed, it makes less sense. It's a world of intrigue that I don't think any normal 1970's housewife would have any idea how to navigate. It makes it a great story."}, {"id": 71, "text": "This film start with a woman Jean talking about her and her husband Eddie, and she take away her price tag in her clothes scene! As turnout, this film is about Jean, and her baby Harry need to take refuge under a couple(Cal, and Teri), after the death of Eddie! Entire film quite slow, full of boring conversation, and super annoying overuse scene! Such as, overuse of the smoking scene, overuse of the driving scene, overuse of the sleeping scene, overuse of the song playing at the background scene, overuse of the taking care baby scene, overuse of the blackout scene, and overuse of the dining scene! Make the film unwatchable! Barely intense scene is, Jean shot at Mike's head to kill him! At the end, after get away the mess left by Eddie, Jean drive away Harry, Cal, Teri, and Paul away from their hideout place! That's it! Another disappointed film!"}, {"id": 72, "text": "Not your typical crime drama! characters are very likable and secrets unfold as the movie goes on. i was on the edge of my seat, as you weren't quite sure what would happen. also enjoyed the score."}, {"id": 73, "text": "Seriously well done. Can't believe the low rating. 👏"}, {"id": 74, "text": "What's the story? Who is Eddie? Whose baby? Why did the woman get killed? Why did they make this movie? Why didn't I watch Carol Burnett re-runs on youtube? An average episode of Rockford Files has this totally beat."}, {"id": 75, "text": "But I see the viewers already beat me to it! The sets, wardrobe and cinematography was great. I love the 70s aesthetic but the baby incessantly crying and the imbalanced sound (extremely loud music, very quiet dialogue) forced me to call it quits by 20 min mark. No plot development and very slow. The characters weren't engaging enough to care about any progression. Especially the baby. Ugh"}, {"id": 76, "text": "It's so often and so bad you can't hear the dialogue sometimes!! Rachel is too good of an actress to be in such an annoying movie. Too bad."}, {"id": 77, "text": "So poor. Says nothing. Love Brosnahan, but there's nothing here.😐"}, {"id": 78, "text": "The pacing of I'm Your Woman is painfully slow. The first hour drags on into pure boredom inducing the desire to turn it off or fast forwarded it. Funny its suppose to be from the lead female character Jean's point of view but it is actually the characters Teri the wife of Cal and mother of Paul that is much more intriguing and dynamic. Makes one wonder the type of mentality that by pass the strong dynamics of characters Teri and Cal to make Jean the focus or rather a slow move to nowhere."}, {"id": 79, "text": "So a good looking woman sitting while smoking a cigarette. In walks a distant husband with a kidnapped baby. Now we are talking. We learn the new mother doesn't have the skill to fry an egg. Should have been a pitcher because she put a dozen fastball eggs on the wall. Now add gun battles, gun training, of course a car chase with a flip and rollover. The highway patrol man summed it up when he said What is going on here? I asked the same question at the end."}, {"id": 80, "text": "Watched half of this movie and stopped then went back and finished it. Wish I had not. Did I miss something why this movie had that title? Don't Look Back would have been a better name. The best acting was done by the baby. Can't recommend this movie to anyone."}, {"id": 81, "text": "Brosnanhan is a 10 actress. This is worth watching for a while just to see her range. Its about a vicious organized crime gang war from the perspective of a clueless gang leader's wife who doesn't know what's happening or why. Its just an ok movie."}, {"id": 82, "text": "This movie goes absolutely nowhere painfully slow. I came for the talent of Rachael Brosnahan and left because there was no entertainment value. The thought occurred to me 30 minutes in that Mel Brooks might have been able to salvage this movie. Then reality set in. There was no saving this film from its director and writers. My first thought at 20 minutes in was Heavens Gate (1980). At least in Heavens Gate there were moments of redemption for an otherwise painfully long movie trying to get to the point. It grieves me to say that I'll never get the 2 hours back I've invested in this movie. The stovetop Jiffy Pop was good."}, {"id": 83, "text": "This was a strange movie. It had a plot without it ever really feeling like it had a plot. Pretty much from start to finish you have no idea as to the what or the why, but only the how. It was extremely difficult to stay interested in this movie. It drags a lot, and it provides next to nothing to keep you enthralled. The acting was decent, and it had a somewhat satisfying ending, but that's it. For the rest of the movie I kept asking myself why I'm still watching it."}, {"id": 84, "text": "Waste my time watching this movie , it's about nothing and the title has nothing to do with the movie. Makes no sense and 2 hours long for nothing"}, {"id": 85, "text": "The actor who played the part of Harry was amazing. Definitely an Oscar worthy performance. Probably the best infant actor of all time. His crying was so real and believable. I was blown away by how he could cry on cue over and over and over. Crying on cue is the golden standard of emotional accessibility, and this kid is golden. He deserves several awards."}, {"id": 86, "text": "I am not sure if this is how a real mobsters wife life was in the 70's. All of the movies I have seen before the mobsters are all about family, maybe that was for mostly the big bosses. The movie goes through the life of a 1970's wife who was not in the know. The movie follows the wife and she goes from not knowing anything to becoming stronger towards the end of the movie. It was interesting, but a little slow."}, {"id": 87, "text": "What you need to know about me is that I am okay with everything not being presented in a perfect package. I really struggled to get through this movie; it took four stops and starts. It was difficult to connect and understand all of the players. I have zero interest in Mrs. Maisel and so I won't make any recommendations for that. The acting is still good, but it took me until the very end to feel as if I could tie everyone together, but I still didn't care about them. The hugs felt false. I think if anything, viewers are going to get a kick out of vintage threads and cars."}, {"id": 88, "text": "I like this movie I enjoy it Deserves rate more than that"}, {"id": 89, "text": "I understand why many people have reviewed this film negatively. It's not for everyone. If it were meant to be for everyone, the producers would have dug up another comic book character and we'd have another steaming piece of Marvel to stare at for 2 hours. With great production value, I'm sure.This is a slow burn. I like that. I want to care about the characters before I know (or I am left to determine) their fate. I want to see Jean's transformation-especially since she is simply Eddie's woman for the first part of the story. She starts off purposeless. Maybe a pretty face he didn't marry for her cooking.Anyway, the plot moves soon enough and we are presented with a crime movie not dissimilar from most crime movies. Except for the transformation of Jean. And the humanity. The kindness of strangers along the way. The touch of a stranger at a laundromat. Some good people.There are a couple of events in the film that cannot be overlooked. Maybe these events will cause some viewers to find one or two of the heroes irredeemable. (I'm being vague to avoid spoilers.) But at least it gives you something to think about as you watch it.Also, I love the two Aretha songs (covers) in this film: Natural Woman and The Weight. (Sorry, I had to throw that in.)If you like independent films, I think you'll like this one. Personally, I am glad I watched it and enjoyed seeing Jean's arc."}, {"id": 90, "text": "I'm astonished how many reviewers can't handle quiet suspense and subtle acting. This movie builds a personal and eventually gripping story by taking us into the experience of a 1970s wife and mother who has no idea what her husband does. So we follow her slow and scary realizations of his work, his enemies, and his violence, even though we only meet him at the start of the movie.There's a whole inter-racial story here, too, topical for 2020, and worth seeing just for that story.In watching Rachel Brosnahan, I was reminded of Ryan Gosling in Drive, and began to think there's a developing genre here, where quiet characters don't let us find out how they feel. what they do, and what they value, until the movie is over.There's some wonderful acting in I'm Your Woman, personal storytelling and personal camerawork, and many great 1970s outfits. Slow down and check it out."}, {"id": 91, "text": "My wife and I watched this on first night of availability on Amazon streaming movies. It stars Rachel Brosnahan who I like so much as The Marvelous Mrs Maisel. Here she is the somewhat simple wife of a man deeply tangled in some form of crime operation. In a beginning voice-over she tells how they wanted children but were not able to.The thrust of the movie gets started fairly quickly when her husband shows up one day carrying a baby boy of maybe 6 to 8 months old. He says This is our son. With no actual explanation we understand it is part of his criminal activities. Then the story really gets going when a man comes to her home at night and tells her they have to leave, NOW, and bring along a bag of cash.I expected to enjoy this movie more than I did. The actors are fine but I often found the story lacking comprehension. We see lots of things, most of them difficult situations, and we see how the characters extract themselves but it is hard to form an overarching view of what is going on with these people and what their salvation might be.Not a particularly good movie but entertaining in the way a weekly crime TV series might be entertaining."}, {"id": 92, "text": "Gripping, finely acted but slow paced; I'm Your Woman pays off but struggles to find its groove which may frustrate viewers.In this crime drama set in the 1970s, a woman is forced to go on the run after her husband betrays his partners, sending her and her baby on a dangerous journey.Rachel Brosnahan continues to prove herself as one of the industry's leading actresses. It's so great to see her in a dramatic role and I can't wait to see what other roles she takes on. Regarding the film itself, it's a massive slow burn but I'm Your Woman is about 30-minutes too long. Not all viewers will be on board for this ride. It's aesthetically pleasing and looks real good but you do expect more punch throughout even though the final pay off is well worth it. Overall a decent drama and I do look forward to seeing what filmmaker Julia Hart does going forward.Follow @snobmedia for all reviews!"}, {"id": 93, "text": "Jean (Rachel Brosnahan) lives in a comfortable home with her husband Eddie (Bill Heck) and turns a blind eye to the latter's business, a mobster on the whole line. A short time later, her husband disappears and Jean has to hastily leave her home with her young son.I'm Your Woman raises those situations (almost a narrative subgenre) in which a character with a comfortable but dependent life literally collapses the world and staggers on a path of inner transformation and empowerment.Julia Hart's film (set in the 70s) combines drama with gangster thriller and consists of two parts. I make this clarification because the first one is difficult to navigate due to its extreme delinquency, since it appeals too much to dead times and a generally failed suspense. The subsequent entry of other characters who provide more information breathes movement into the plot and gives the main character depth.Thanks to its second part, I'm Your Woman is saved in part, despite the fact that the too quiet tone of its dialogues persists.Rachel Brosnahan plays a good role (far removed from The Marvelous Mrs Maisel), in a film that could have been better, since based on good ideas, it partially fails in its realization.Postscript: set in the 70s, it is part of the movie squad in which a part of its plot would disintegrate had cell phones existed in its time ..."}, {"id": 94, "text": "Set in the 70's, Jean (Rachel Brosnahan) is married to a criminal. They can't have children and the marriage has gone stale. One day out of the blue, he comes home with a baby. Suddenly, she raising the baby as her own. Her husband goes missing and she has to go on the run with Cal whom she has never met before.This is a fascinating little crime noir. Brosnahan is great. The movie reaches a high point with neighbor Evelyn. There is a great question about her motives. It could have spent more time at her house with the two thugs. The rest of the movie rambles on and the movie is way too long at two hours. That's not to say that it doesn't have some great scenes in the second half. It's just that it would work better to stay at Evelyn's for the climax. Instead, the movie becomes various killers randomly finding her and trying to kill her. It feels very random but Brosnahan delivers some great work. One thing, I expected that she would leave her friends at the hospital. Those are gnarly injuries and they can't just sleep it off. They are likely to die from them without treatment."}, {"id": 95, "text": "I don't think a lot of people got this movie. It's not really an action movie. It's more of a character study of bunch of people thrown together by a situation that is outside their control.The story revolves around Jean, a disillusioned wife married to a professional criminal. It begins with her husband coming home and giving her a baby. From there we get thrown into a situation that nobody fully understands but is obviously some sort of rip off gone bad.Racheal Brosnahan does a great job with Jean. She seems so naive at times you start to wonder if she is all there, mentally. Jean is told she has to leave her house by her husband's associates. She is given a big bag of money, takes her new baby and goes on the run. That's when she meets, Cal, a friend of her husband, as they are chased by gangsters and try to survive the onslaught brought about by the theft.This movie is a tribute to 70s outlaw films like 'Gloria'. The production and direction are well done and movie does good job of capturing the 70s look and vibe.This is a good movie if you realize it is about the characters, not the action."}, {"id": 96, "text": "Julia Hart seems a promising filmmaker. I'm Your Woman is only the second picture of hers I've seen, but it's very much in the same vein as the prior one, Fast Color (2018). I went into a bit of my wobbly comprehension of Lacanian psychobabble--based as it's from my struggles to stay conscious during lectures and readings on outdated notions, such as psychoanalysis, since dumped from the social sciences onto the humanities--in my review of Fast Color. Suffice to say, there's the theoretical dichotomy between the mother, with her domestic sphere, and the father, with his societal realm. We could also call this the old-timey world as presented in blast-from-the-past TV and web series such as The Marvelous Mrs. Maisel (which is also from Amazon studios and starring Rachel Brosnahan)--y'know, women as housewives and men working and running the world outside the home. Hart emphasizes all of this by working in the most typically-masculine genres: the superhero movie with Fast Color and, here, gangsters. But, she records them from the female perspective and ultimately subverts expectations with the female heroes seizing power outside the home and in the larger world.I will say, though, that there's a lot about the law in the musings of Jacques Lacan, and this law is associated with the Father. In Hart's prior movie, all the male characters, including the father figure, were law enforcement. Here, they work on the opposite side of the law, but such is nevertheless coded as the domain of men, whereas Brosnahan's protagonist spends all her time at home raising an infant. The place of the female superheroes of Fast Color was likewise restricted to home. Brosnahan's character can't even drive a car initially.I'm also growing fond of Hart's patient pacing and how there's no hurry to explain the plot. Sure, it might put one to sleep just as well as it does her baby, but it's tranquil, and that's in contrast to the picture's sudden moments of suspense and violence. I'm Your' Woman is only slightly more expansive than Fast Color, though. I would like to see her tackle something more ambitious than mommy and daddy issues through the prism of genre pictures. I look forward to it."}], "reviews_amount": 97}