{"name": "Survive the Night", "titleId": "tt10303324", "reviews": [{"id": 0, "text": "The characters from this film reminds me of that of the brothers, Mattias(Tyler Jon Olson) &amp; Jamie (Shea Buckner) in from dusk till dawn. There is a pair of criminals on the run after stealing money from their mob boss. One is the criminal mastermind, Mattias, and the other an unhinged character, Jamie, with whom his brother has the inevitable role to try and keep him in line &amp; out of trouble.As John Steinbeck famously once wrote, the best laid plans of mice and men: sometimes things occur that cannot be planned for. They are heading off to Mexico &amp; stop off to fill up their vehicle with fuel to make the remaining journey. Jamie, instead of paying for the fuel, decides to rob them instead, when they have already enough money to live off of, and during the shot out Mattias is injured.They cannot stop at a hospital as gun shot injuries are reported to the police but they so happens to stumble upon a disgraced doctor, Rich(Chad Michael Murray of One Tree Hill &amp; House if Wax), &amp; follows him home. They hold Rich and his family hostage and forces the doctor to perform surgery on the shot brother to save him.The most recognisable actor is Bruce Willis who plays the retired cop. There is a battle of wills and survival of the fittest in this film. This is one of Willis's better films he had done recently."}, {"id": 1, "text": "Why of why Bruce agreed on playing in this movie. The movie is simply bad and plot doesn't make any sense."}, {"id": 2, "text": "I saw Bruce Willis &amp; Chad Michael Murray so I knew I was going to watch it. I didn't have the biggest hopes for it but I thought it would still hit in most places. This movie had the potential to be really good but fell flat in a few places. I will start by saying this is another movie that pointlessly starts with a scene later in the movie &amp; then goes back in time. Some movies that works for but most it doesn't &amp; this one didn't need it. Outside of that, the first part of this movie was very good &amp; suspenseful. You get to learn the characters &amp; dynamics inside relationships setting it up very well. Once the brothers got inside the house, that's when the movie halted for me. It had its moments &amp; I felt the casting was very good, the acting was perfect for this film but there were also some head scratching moments. I won't go into them all but when Bruce Willis character leads the bad guy on the car chase, that goes for a few good minutes, how does Chad Michael Murray's character not get to his family in the barn (on the property he's already on) during that time, instead conveniently gets there once the bad guy returns setting up the final scenes. There was a moment at the gas station the worker mentions a 3rd brother that had passed in a tragic way but that's not explained any further which seemed odd. The money also seemed to play a large part of the story early but lacked at the end. I would've liked to see if the family took it (god knows they deserved it after what they went through)I love both Bruce &amp; Chad &amp; feel they put in fine performances. The story is good. The execution just didn't hit for me but it's still a movie I'd recommend watching at least once. It will hit for some &amp; miss for others."}, {"id": 3, "text": "The Home Invasion sub genre has been done to death at this point so to find a refreshing take on it is hard enough. This one is an admirable attempt to push the genre away from the violent and edge recent efforts and more into the deliberate and character driven roots of its origin.I won't spoil the story much but suffice it to say its got a lot going for it in terms of the way the tension builds. This isn't Bruce's best efforts as he still just a supporting role here but he does hold his own well enough compared to his prior B movie efforts. The real stars of the show are Shea B. and Tyler Olson as the layered bad guys with more going on for them then meets the eye.Worth a stream for sure!"}, {"id": 4, "text": "Films with Bruce Willis are sliding lower and lower. He was a good actor."}, {"id": 5, "text": "Survive The Night is a terrible movie almost from start to finish. The acting is not a problem as such but the story is so badly written and unbelievable it resembles badly written fan fiction. Two brothers who are criminals and on their way to Mexico end up in a shootout and one needs medical assistance. They break into a house where a doctor and his family are staying with the parents of the doctor. And from there the movie dissolved into an almost hillarious sequence of events and dialogue.The story is so bad it's difficult to describe. The doctor is apparently responsible for a death of one of his patients in the big city. Oh, and he has a job practicing in a clinic near to where his parents live because apparently small towns don't care if the doctors have killed patients in the big city. The wounded criminal says that he is bleeding out and almost dead but it takes him about 8-10 hours or so to bleed out even after the doctor says he has been shot in the Femoral Artery. The doctor actually says that he is not a leg doctor and then he also says or that kind of doctor when he is being forced to perform surgery. Because hospitals have leg doctors apparently. He also states that his last patient died on the operating table because he stitched when he should have cut or cut when he should have stitched. You would think that he might remember these small details.The brother who hasn't been shot and is the dumb psychotic criminal threatens the doctor numerous times because they literally had no better dialogue to include in the film. And I mean he continuously repeats his threats as if the doctor has forgotten that his family is at stake. Or it might be the case that who ever wrote this movie thinks they need to remind the audience. The dialogue also gets worse and worse as the movie goes endlessly on and on.The actions of most of the characters make no sense for most of the film and the scenes are so drawn out and repetitive that they might both make you cringe and laugh at the same time. The protagonists get free, run away and are captured again, then they are wounded and run away and are captured again and again. And of course the process is repeated once again. The wounds that they receive only bother them at certain times though and other than grandma everyone in the family lives through the ordeal and ends up sitting and smiling on the porch.This was lazily written by someone who tried to stretch out a story that should have been 30 minutes into 1 hour and 30 minutes and they couldn't even do basic medical research into gunshots or their effects. And for the record anyone shot in the Femoral Artery would have bled out within minutes. The criminals make dumb choices to advance the plot and the heroes of the film have numerous chances to run away but they don't and are recaptured repeatedly and then the villain actually gives up on chasing them for a while and continues in the morning...Avoid this movie at all costs unless you want to watch a really bad movie and write a long review on why this movie should be avoided."}, {"id": 6, "text": "A taut family thriller set in one house. A simple story about a father/son and two brothers. Sometimes the simplest ideas can be very effective and produce great thrills because the script knows the boundaries and generates thrills by reminding us all the time that we are stuck within those boundaries. The two bad guys here are throughly vivid in their performances. Their imperfections give them a more realistic unpredictable sinister-ism than the typical scare movie villain with a mask.It takes awhile to get started, but once it does, the suspense and mystery is undeniable. The soundtrack dictates a suspense atmosphere very adequately, and the actors are quite good (though no crazy standouts). The story, even clichéd, is still interesting and suspenseful. Worth a watch!"}, {"id": 7, "text": "This was a pretty straight forward home invasion thriller set on a farm but with the criminals as more sympathetic villains. What kept me engaged was trying to guess how things would play out for the family and which side would come out on top in the end. The redemption story for Chad and Bruce (Frank and Rich) was the obvious central aspect. It was well done and had a nice conclusion to it that felt genuine. There's a couple violent scenes but it never crosses the line into all out gore. Worth a stream if you're into more dramatic thrillers."}, {"id": 8, "text": "This cleverly conceived thriller is about a doctor and his family trapped inside a farm by two criminals. The film is well-paced and the camera work is slick. Bruce has a surprising larger role then I expected as the grandfatherly patriarch and he's effective enough to keep be engrossed. The rest of cast are admirable. With the stand out being, Shae Buckner who plays a unhinged but sympathetic criminal and does well to add layers to the role. The single location setting is brought to the fore here by expert claustrophobic direction. The violence is intense, sometimes graphic but never over the top, and completely tense. It's not a big blow 'em up adventure story, it's just as dark, gritty, and realistic, in which things never go according to plan and innocent people always get hurt.Unfortunately, after an engrossing game of cat and mouse, the conclusion is somewhat weak. Staple clichés crop up and the film goes for a crowd-pleasing finale that doesn't quite feel right. Still watchable though and a recommended stream."}, {"id": 9, "text": "This was a refreshing home invasion thriller that took a typical plot and elevated the drama between the parties involved. Bruce can still CRY on screen? That was a surprise to me. Shot well, edited with precision and given a subtle and nuanced score. Might be one of the better b movies I've come across in awhile."}, {"id": 10, "text": "This movie is solid for what it is, using scenes based on the mountain of movies of this genre, but keeping it´s identity, altough it has a pretty simple plot and recicled moments all over itself. The 2 robbers that this film presents to the audience aren´t anything new or refreshing, one compassionate and other irrationally violent and dumb, wonder where they picked that idea, (Pulp Fiction) maybe, my opinion. There are also some flaws in the way that the image is shown, because in some moments it´s clearly visible the green screen behind the actors. Even though the film is a little bit repetitive, the soundtrack is appropriated for what is worth and the moments of compassion between the characters are almost believable for the spectator that is really, really into the movie. The movie is short, doesn´t even have 130 minutes of itself, and for it´s runtime the plot develops poorly and slowly, promoting a near slasher in the end, wich is quite bad. They really didn´t need that scene. I´m terribly sad that Bruce Willis isn´t getting opportunities to shine, this wasn´t obviously even close of his full potential."}, {"id": 11, "text": "We weren't perfect but no one is. Survive the Night (my latest review) isn't perfect. Heck, it's not even close. But Night does have a few tense moments. And co-star Bruce paycheck Willis does emote slightly. In verity, he even manages to move from point A to point B and probably showed up on set for more than a week (ha-ha).Survive the Night while compact in its first half as a ruffian thriller, descends into senseless and labored drivel towards the end. Reminiscent of home invasion stuff like No Good Deed and 2018's Breaking In, Night recycles its evil that men do screenplay to the point where it rights itself into a corner. Night's eighty-six minute running time feels like darn near two hours. I kept wondering why the protagonist characters didn't just get in a car and drive away when they had the chance.Nasty, remorseless, violent, and taking place in the middle of nowhere, Survive the Night is a sweaty B-movie where the authorities are phantoms that never show up once. Filmed on location in Columbus, Georgia, Night's direction by Matt Eskandari is amicable but pretty basic.On the plus side, the kicker is that Survive the Night has an original hook. The only reason the good cop/bad cop criminals invade a country home is because one of them is dying from a gunshot wound and a failed doctor happens to live there.All in all, Survive the Night does have decent performances (especially Chad Michael Murray as the doc mentioned in the last paragraph) and it effectively hammers the notion that bad things happen to good people. Still, I can't for the life of me recommend Night (it was difficult experiencing a scene where a pregnant woman persona gets executed at a convenience store). By tooth and nail, I did survive it though. Rating: 2 and a half stars."}, {"id": 12, "text": "I am a fan of Chad and Bruce and this movie had all the ingredients to be great but it was poorly executed. At times it was repetitive and unrealistic when it came to how the characters would and should act. There were pointless scenes that seemed to drag on for no reason whatsoever. Finally some of the other cast, Bruce and Chad aside where (to put it plain) terrible actors. I have given it 5 stars because it wasnt all bad. It kept my interest and the story was good. To truly enjoy it though I had to look past some shoddy editing and directorial work. I really wanted to like this more but I guess sometimes yout favourite actors get it wrong."}, {"id": 13, "text": "This is another recent Bruce Willis makes a cameo action/thriller flick, but a definite notch above many of his other films(if not the best), at least in terms of story and performances.It manages to make a compelling home-invasion seem suitably layered, presenting the bad guys as rounded individuals with differing yet believable motives and personalities. The photography and acting from the main ensemble are all above par. The direction is tight and I liked the tense score also. It still feels immediately dangerous, though, never losing sight of its protagonists and the escalating peril they're placed in, until it finally reaches its truly tragic and slightly expected finale."}, {"id": 14, "text": "The only reason I watched this was because Bruce Willis was featured. I can't imagine why he decided to act in/put his name on this film. I am astonished at how disappointing this movie was. Willis's son's wife is a plastic surgery nightmare. The characters have dozens of opportunities to save themselves from their predicament. What a disappointment of a thriller. Waste of time."}, {"id": 15, "text": "Don't waste 1.30 hours of your life. Even with Bruce Willis, the movie sucks in every way."}, {"id": 16, "text": "Don't watch this. Waste of my time and such a bad movie."}, {"id": 17, "text": "Home-invasion movies are driven by a universal fear: Who hasn't worried about someone breaking into their home with malicious intent? It's why creaks and bumps scare you when you're home alone. It's why wind chimes become instruments of terror when the sun goes down. It's pretty twisted to think about watching movies that exploit these fears for fun, but there's something to be said for sharing such an emotional experience with people from across the world. The universal fear of domestic violation transcends language and local custom. It's the connective power of art in practice, manifested in mutual terror.What we have here is a similar told story but not with the anything new or exciting. I do give the writer and director credit for maximizing the suspense and giving us an ensemble of characters we care about. Ultimately, it gives you a tasteful and elevated 90 min excuse to watch something."}, {"id": 18, "text": "This film has great aspects, but it looks very average. Firstly, the plot is interesting, but it's very predictable. The beginning is intriguing, the finish is pale. Secondly, yhe cast os good, but all film is on Bruce Willis and his talent. So, it's a little bit pale film with good actors."}, {"id": 19, "text": "I quite enjoyed this. It wasn't super violent save for a couple gory bits of surgery. It's got a nice build up of events and keeps you invested in the characters as it unfolds. The mother/daughter duo could have used some fleshing out themselves to balance it out. Solid stream and worth a watch."}, {"id": 20, "text": "Predictable and very lame and disapointing. Many things were not tought at all liket the handcufs to the table, going back and forward in a house that hes aware is not normal , acting like a hero instead of making sure his family is safe.. ican go on and on and on"}, {"id": 21, "text": "No logic, stupid decisions, no trama, dialogue! Worst movie ever!"}, {"id": 22, "text": "Bruce, are you bored or something? Got a huge debt? Why do you keep showing up in these seriously bad movies with scripts as if they were written in the late 80ies or early 90ies?You have been in so many good movies, it's weird that I no longer can take it for granted that it's a quality film if your name is on it."}, {"id": 23, "text": "Disgraced doctor Rich (Chad Michael Murray) gives up the fight to clear his name. His father Frank (Bruce Willis) is disappointed in his son's surrender. Two criminals shoot up a convenient store and one of them is injured. They invade the isolated family home and force the doctor to operate.There are a few moments of intense action. The convenient store holdup is actually quite compelling. After that, it's all rather run-of-the-mill action. Some of it is unnecessarily dark. I know it's the night but they could turn on the lights. They don't have any neighbors. There isn't anything that interesting in this unless you're a fan of Willis or CMM and you're a completist."}, {"id": 24, "text": "As the title says... Poor ol Bruce.. on the downhill slope :("}, {"id": 25, "text": "Small Georgia farm gets invaded by a couple goons who want the son to perform surgery on on of them or the family is dead. Kept me involved for the most part. Bonus points for that muscle car Dodge Charger blazing in the country roads."}, {"id": 26, "text": "It's a simple story. And I guess Jamie is the worst brother someone can have OMG issues whaha"}, {"id": 27, "text": "What a waste of time.It starts OK, and keep you hooked, but as soon as BW escapes from the house, you will be more and more asking yourself Are they really that stupid?, as the characters start making dumb decisions until the end of the movie.After some point, I was only hoping they all died and the movie ended. I believe BW had some bills to pay when accepted to take part in this one.Stay away."}, {"id": 28, "text": "I rooted for the bad guys the entire movie due to the unlikeable main family."}, {"id": 29, "text": "From beginning to end ... just a bad movie ... Lousy acting, boring dialogs, lame story, unlogic and unrealistic."}, {"id": 30, "text": "Even though I watched it with very low expectations but it was able to disappoint me, with this kind of movies you only hope for action but the director wasn't able to deliver any good action sequences through out the movie adding the immature screenwriting and really bad acting especially from the lead actor and the daughter made this movie annoying and hard to watch but at least Bruce Willis showed up for this one, go watch Hostage or Trespass instead of this cheap"}, {"id": 31, "text": "It's hard to put into words how bad this movie really is. The dialogues are laughable, the characters seem to lack basic intelligence and the plot makes no sense. Bruce Willis looks like a fool in this... Don't waste or money or time. I wish I had trusted the bad reviews before renting it."}, {"id": 32, "text": "This is not a particularly violent movie, though at least two people do die. This is more of a psychological thriller than a Bruce Willis action movie, though at one point a comparison to an action movie would make sense.The direction works well with his whole ensemble often placed in the living room like actors on a static theater stage, and the camera views the psychological warfare often from a very distant ankle like in a documentary. The minimal and seducing sound track score adds much tension to this well-done drama/thriller."}, {"id": 33, "text": "Despite the small budget of the film (which is noticeable), done well! The acting is good and the action is enough to keep you engaged. Bruce has a pretty big role in this from start to finish(which is surprising these days).Chad Murray from CW days steals the show as his eldest son who has to step up and be the hero in the end. There's some great drama here for the villains and you see different sides."}, {"id": 34, "text": "This movie starts out slow, but it builds tension very quickly. This would be a very terrifying situation. This movie has a sense of realism. The dialogue is not fancy, nor presumptuous, but adequate for these type of dramas. It flows well with the fast paced events. And the scenes are not overwhelmed with bombastic actions to make the story messy and senseless. There's enough material in this film to capture the interest of viewers even if the ending twist lightens my intrigue."}, {"id": 35, "text": "Boring with no story really. They keeping repeating the same thing, they're tied up, escape, then get tied up, then escape then get tied up AGAIN. I can't even with this film. Bad guy overacts and the other characters are just annoying."}, {"id": 36, "text": "From the moment the movie started... I could tell it was going to be interesting. I was very right. It's well shot, tense and the performances from the cast all around keep you engaged. Bruce actually seems to bring it for once. He's in at least 40minutes or more of the movie and has some dramatic moments with some actual ol' Bruce on display."}, {"id": 37, "text": "The story might move slowly, but it's still well developed and ratchets up the suspense well. What really stands out to me is the cinematography and the score. the dark cinematography actually helps the audience to feel the dark and tense tone of the movie. and the score complete some moments at the movie.The ending is simple, and actually predictable, but left me satisfied.I really recommend the movie, if you're looking for an enjoyable thriller. but, if you're looking for a pure action, i actually don't recommend you since this movie is actually far from that."}, {"id": 38, "text": "Realy love bruce, but this is a terrible one! Don't know if they made the movie for stupid people or is stupid people doing a movie... yes i'm stupid too"}, {"id": 39, "text": "This is a movie they should not have produced ever. Extreamly bad script with dumb dialogues. Terrible acting, lighting, shooting. Dont waste your precious time!"}, {"id": 40, "text": "Bruce McClane Willis brings it for the first time in a long time. He's got some cool moments and I loved him in that badass Dodge Charger car chase on the farm. Well done lil thriller with heart."}, {"id": 41, "text": "Bruce Willis should not be in this movie, he doesn't have a role at all, the only good thing was the special effect in the wound."}, {"id": 42, "text": "I've been a Bruce Willis fan for Many years. This movie is the worst or one of the worst B. Willis movies I've ever seen. Nothing makes sense in the movie. The acting is atrocious. Look, , unless you have a choice of going to jail or watching this movie, I would not recommend this Movie. A real disappointment in almost every way. Good luck if you survive this movie."}, {"id": 43, "text": "Survive the night What a stupid cliche movie. Nothing is acceptable from the beginning. He probably wanted to make another Desperate Hours by great William Wyler and with Humphrey Bogart or In cold blood by Richard Brooks but this director failed miserably. Bad story, bad acting, and above all bad directing. The other actors are all bad enough but Bruce Willis is in his worst performance if his career . This has been the worst movie I have seen this year so far ."}, {"id": 44, "text": "When writing a review for a film to recommend to others, it needs to be based on a series of factors. For starters it needs to be honest and not a way to destroy this art. For me I enjoyed the film, although as an actor myself I do see parts where it can improve in terms of story to expand on the character devlopment and to have Bruce Willis and Chad Michael Murray, a pair of actors that are easily recognized, it helps build that dynamic but overall it does have a positive review on the offset."}, {"id": 45, "text": "This movie is the worst movie I have seen in years! I cannot believe Bruce Willis would stoop to this level to take on this project I I don't get it! I swear this had to be a high school project that he volunteered his time too! The screenplay is terrible, the Movie is completely unbelievable, the only thing halfway good about it is the acting but everything else is completely ridiculous. All you have to do is read all of the other bad reviews and it will explain why you should not waste your time to see this at all. The only reason people are watching this is because Bruce Willis is in it and expecting it to be good, but it is terrible! Can't believe Bruce would just rip off his loyal fan base Like this. They owe everyone a refund!"}, {"id": 46, "text": "It looks like once again, a relatively pleasant looking 2cnd/3rd tier actress starts to get older. And some one (the boyfriend/the Agent / the ????) convinces her (Hull) to get an ill advised facelift or worse. My God. Who tells these women this looks good ? Who convinces them ? It is downright tragic, and whoever took the $ for that oughta be Horsewhipped at the very least ! Yikes."}, {"id": 47, "text": "None of them uses a Ak47 or even a balaclava as we can see in the poster. The plot is terrible. The actors need some improvements in order to aquire the terrible status. My sugestion to the director is to dismiss everyone then quit the job."}, {"id": 48, "text": "What is wrong with you Willis ???? are you soooo poor and need to do anything for living ??????? Im very very very disappointed with your last bunch of movies....this is not appropriate for D class movie"}, {"id": 49, "text": "I let Bruce Willis's name persuade me to watch this, but it's honestly a waste of time. A plot full of holes, chances for the family to overcome the baddies ignored more than once, shockingly poor."}, {"id": 50, "text": "This film start with a man Rich perform the surgery on another man Mathias, and the introduction of two robbers(Jamie and Mathias) scene! As turnout, this film is about Rich and his family need to survive in their house while Rich force by Jamie to perform the surgery to remove the bullet from Mathias body! Entire film full of boring conversation and overuse scene! Such as, overuse of the nonsense crying scene, overuse of the walking scene, and overuse of the searching scene! Make the film unwatchable! The shooting scene just simply shot here and there! The car chasing scene also quite slow! Barely intense scene is, Jamie shooting in the grocery store at the gas station scene! This scene quite bloody! At the end, Mathias die, even Rich manage to remove the bullet from his body! Rich kill Jamie by several shot! That's it! Another worst action film!"}, {"id": 51, "text": "So many mistakes in this movie, it's sad. It's 4 against one, Bruce being a retired trained sheriff, and no one can even move against the bad guy. He ties them up and they just loosen the rope several times, but can't move. Bad guy turns away from them but they can't grab something and defend themselves. Shovels, pitchforks, tools in the background and they just cry. Doc gets a bullet in The shoulder but it's his legs and ankles that don't work? They have a gun and a shotgun, but can't seem to get the strength to shoot them. Just lay down and cry then."}, {"id": 52, "text": "Every scene in this movie was horribly written, the acting was terrible and the story was even worse........while watching you hope no one survives the night and the movie will just end."}, {"id": 53, "text": "That was a waste of time..... I don't recommend it. It was really far from that I thought about."}, {"id": 54, "text": "I just watched this and had to make an account because Bruce actually shed tears in a scene? He seems like he's cleaned up his act. The film actually has some tense moments and he's in more then 3 scenes here. Hopefully it's a new trend from here on out. Welcome back Bruce!"}, {"id": 55, "text": "This was one suspenseful and well done thriller. Great performances especially form the lead bad guy brothers who manage to be unhinged and also sympathetic. Bruce seems to have cleaned himself up too. He's actually into many of scenes. Well done."}, {"id": 56, "text": "It looks like a cheap movie, I couldn't believe that they are producing a movie in this level and expect the actors to be the star, why they have made so funny, he got shot for no reason and the other man wasn't shot while he was in front of the shop owner, terrible cenario !!! Why should they shoot the wife for no reason, I don't think we have to rate this as a unbelievable job of begginers. They just used Bruce Willis to push the ranking to higher level but still NOT WORTH TO WATCH IT"}, {"id": 57, "text": "Extremely poor! Bruce's worst so far! Definitely one to avoid unless you're really bored!"}, {"id": 58, "text": "Idiotic movie. Can't give less than 1 star.. Don't be misled by the 5 star rating."}, {"id": 59, "text": "The characters and the plot are very bad. One of the worst movies I've seen so far. You get to the end of it and ask: this is it?"}, {"id": 60, "text": "I am big fan of Bruce Willis, he gave us some the classics from the 90s. Think 'Die Hard', '12 Monkeys', Armageddon and many more, he is a legend but these C-Grade movies he is in lately are heartbreaking. This movie is bad just like his previous one and the one before that too. I cringed at a number of scenes and plots that just did not make sense, the whole thing is meant to be a thriller but turns into this annoying predictable babble. I guess this is where a I should bid farewell to Bruce Willis just like I did Nicholas Cage. If you were thinking of watching this, rather find something better to do with your time."}, {"id": 61, "text": "It was filmed with the feel of daytime soap. Amateur actors with Bruce Willis chuck in there. I don't even know how anyone would waste the megabytes to store this film let alone produce it!"}, {"id": 62, "text": "Nonsensical film from start to finish. Very thin plot. Enough said"}, {"id": 63, "text": "There is nothing more to say.Since this website won't let me submit what is an accurate review of this movie, i have no choice but to say more.Sooooo many plot inconsistencies. Extremely implausible scenarios. The set up was weak. The continuity was broken.Seriously, I don't do reviews but I just had to warn people. I doubt you'll listen to me, if you watch this atrocity, make sure you remember who I am. If you see my name in another review, you'll be able to trust it. Because you'll know I give accurate reviews"}, {"id": 64, "text": "Movie is bad- And I mean really bad. Actors act like complete strangers among themselves. There's no empathy or anything. Surreal story, poor dialog... bad, just bad. Avoid it and watch something else. You'll thank me later."}, {"id": 65, "text": "Worst Bruce Willis movie. Ever. I want the 90 minutes back I wasted. Even during COVID19 quarantine and movies were thin...I shoulda watched paint dry."}, {"id": 66, "text": "Bad on so many levels. Bad plot lines, bad acting, unbelievable stupidity by key characters. It gets a 10 if you only rate the violence and gore. Is Bruce Willis in trouble with the IRS, cause this Nick Cage level crap.."}, {"id": 67, "text": "Two stars is literally from the goodness of my heart! Story sucked. The killer brother Jamie is the dumbest SOB ever! And due to that fact all the events in the movie suffer! Bruce Willis must've owed someone a favor."}, {"id": 68, "text": "The acting is bad and it seems immature to me in a lot of scenes. The movie also includes major medical errors, like mentioning that the bleeding was from the femoral artery, which is a major artey in the body and its injury would make the victim die within minutes, not hours like in the movie, due to loss of blood and low blood pressure. And every hostage in the movie has so many chances to escape, but they didn't do so, I wish I know why!"}, {"id": 69, "text": "Thought even bad is ok with Bruce Willis &amp; Chad Michael Murphy, how bad could it be....come one, come all can't act, no name or use to be a name, come on down because this movie is a stinker &amp; nothing you do will save it. Don't watch this movie even if some you know, are related to or grew up with is in it, wrote it or made it possible in any way!! The time you spent reading this review was time better spent than it would be watching this movie!!"}, {"id": 70, "text": "There are so many errors made in this movie that I ended up laughing at all the mistakes How can Bruce Willis agree to play in a movie like this. The story line falls apart and I blame it on all the errors"}, {"id": 71, "text": "Somebody should have watched that movie before they released it and noticed all the mistakes in it. That is really one dumb movie."}, {"id": 72, "text": "Don't expect this movie of Bruce Willis. He is only a helpless grandfather (although having retired sheriff he forget his all skills how to handle criminals). Story is noting new and presentation is also average. Thrills are missing. It seems story stretching a long way and make an end anyhow. Not much recommended, Don't bother if you miss this flick, it has nothing to watch 1.30 hours. Looks like waste of time. Why do Bruce make such movies ? If he is not here and any other actor would play this role then nothing will be different."}, {"id": 73, "text": "So amazingly poor, whats happened to Bruce? He used to be in good films."}, {"id": 74, "text": "Unintentionally funny hostage flick, implausible scenarios, ridiculous acting, dead guy blinking , gaffes, wooden dialogue ,and The great Bruce Willis with his sleepwalking performance ,makes Nicholas Cage in MANDY seem like Daniel Day Lewis"}, {"id": 75, "text": "Really wanted to like this but they made it impossible, bad acting and characters made really stupid decisions for the situations they were in."}, {"id": 76, "text": "This was without a doubt one of the stupidest movies I have ever saw. What a waste of Bruce Willis. Do not rent/buy."}, {"id": 77, "text": "This is like somebody fed every bad guys on the run and home invasion movie into some bad AI system and it produced a common denominator of the whole lot. Seriously disappointing and I can only guess Brice Willis is here for his retirement fund. Actually gave up 10 minutes before the end and skipped along at 20 second intervals til the end. No twists, wish I could give no stars."}, {"id": 78, "text": "If you're a Bogart fan, then you'll recognize his work in The Desperate Hours &amp; that of Frederick March as a 'normal, everyday hero' in an extremely dangerous situation, with wife &amp; daughter in jeopardy. We've seen the story line more than a few times. This version is not a good example at all. To begin with, the known 'actor' Willis, in a secondary role, walks through his part like a zombie. He's almost as static in this movie as his sleep-walking performance in Death Wish. But, Willis wasn't even the worst part of this movie. The story had so many holes, it could have been called Swiss Cheese Goes to the Country. The two 'villains' were miscast. One of them could have been / should have been the 'hero' because of an underlying dynamic appeal, in place of the actor in that role. All in all, the movie had too many flaws, too many weak parts, too many hackneyed scenes, too many plot breakdowns. It's worth about 4.2 stars."}, {"id": 79, "text": "Bad acting Very slow Bad dialogue Very predictable"}, {"id": 80, "text": "In the UK, we would call this a Channel 5 film. It's hideous from start to finish. So cheaply made- the audio sounds like it was recorded in a toilet at times. The son, his wife and the lunatic bad guy have never acted before and were working in Greggs the week before. I actually feel embarassed for anyone who was involved in this. It really is that bad. Steer clear, it doesn't get much worse"}, {"id": 81, "text": "This was hard to watch. Acting was like watching an I almost got away with it episode for over an hour. I wish the whole family would have died because of the stupidity of their actions, Would have made it a better movie. This movie should be an example of what not to do during a hostage situation. And why would they even try to make anyone have sympathy for the two idiot criminals at the end of the movie like we care if they died at all. How sad they couldn't get away together in Mexico after brutality killing two innocent people in a gas station and a Grandma in her home. I wish I never saw this abomination of a movie 💩"}, {"id": 82, "text": "Survive the night is the wrong title. It should be called, Survive this film!"}, {"id": 83, "text": "Same scenario in multiple movies Without Bruce Willis who would press the play button ; Just for an easy pass of time"}, {"id": 84, "text": "Nothing special here. Goes as you would imagine it does. I was hoping for something a little clever but hey ho, it is what is; a standard movie about a family who become in threat of two 'bandits' and have to fight for their lives. Die Hard meets Home Alone."}, {"id": 85, "text": "Just finished watching this movie and already knew going into it was going to B-movie. With that in mind I always know to be little more open-minded but this one while not worst movie in world. I diddn't find it enjoyable either.First the acting Chad Michael Murray did pretty well in this role and I was quite impressed with him. He doesnt have massive movie resume and is mainly known for tv shows. Bruce Willis however as always in these type movies lately phoned it in. Terrible acting, weird facial expressions, just overall not believeble. The action in this was fairly engaging enough but not over the top and the visuals were okay.Second the movie diddn't make sense at so many parts. First one the brother goes to hold up the store he shoots the girl in the head and then the guy but doesn't proceed to take the money at all? The scene where Willis takes the car and drives off into different area with brother following him was strange as well. What was the son, wife, and daughter doing during that why not run while the other is incapiticated? The other brother gets out the car and doesn't even look for Bruce just leaves and comes back? Lastly the ending was just incredibly bizzare it shows Willis lean over as he is about to have heart attack then the son shoots brother walks outside with his wife and holds her and daughter on porch. No one checks or looks for Bruce though? He just casually strolls out and there all just still sitting there.Overall I didn't love this movie enough to recommend it to anyone."}, {"id": 86, "text": "This is the dumbest movie I ever watched. The movie is so predictable and stupid I have no words to describe how bad it is."}, {"id": 87, "text": "Not too long ago out came Trauma Center, the previous thriller piece directed by Matt Eskandari and starring Bruce Willis, and that one got me very disappointed, to say the least, even judged by B, C and by-the-numbers movie standards. Survive The Night, a (farm) house invasion thriller, has all the same flaws, plus it manages to feel even more flavorless, empty, and as if it doesn't have a lot of respect for the viewer.I'd also like to point out that multiple of the higher rating reviews here (as of 22.05.20) are from profiles who've rated little to none, and/or coincidentally have only written reviews for two movies, this one and the previous Matt Eskandari's and Bruce Willis's collaboration - Trauma Center. Schemes, schemes everywhere.Survive The Night introduces us to the disgraced doctor Rich (Chad Michael Murray), and his family, setting up to live with Rich's parents for the summer. Bruce Willis is the dad, naturally. Meanwhile, criminal brothers Mathias (Tyler Jon Olson) and Jamie (Shea Buckner) have pulled off a heist and are driving for the border to Mexico. With only 20 thousand. Oh, and their boss is taking a cut as well. Jamie is prone to violence and listens to nobody's advice and not even to the sound of common sense, which gets his brother shot and gets both of them on the search of medical help outside of hospitals. This is where our doctor Rich comes in - let the house invasion begin.Survive The Night is a real low budget thriller &amp; that's apparent on your every sense - eyes, ears and feels. No problem though, there are many decent and even great movies with very little financial means behind them, balanced out with extra creativity, experimentation and effort. Matt Eskandari's two latest features don't seem to have those qualities, quite the opposite, it almost feels like there's some money laundering schemes going on. Joke, of course, but you see the point. When a movie is bad-bad, there's often some comedic value to be found, when none comes our way we tend to find the entertainment ourselves - also not the case with Trauma Center and Survive The Night.The plot of Survive The Night is very straight-forward, and it isquite easy to predict it's entire journey and destination. The character's - both antagonists and protagonists - act irrationally more often than not, and basically have very little substance or individuality - one dimension all the way. Everyone can shoot a gun, unless the screenplay demands the character to momentarily lose all knowledge, skill and memory. The story, as whack as it is, is also rather short, and so it feels very stretched out over those 90 minutes, frequently making the pacing tedious, in other words, beware of aggressive boredom. Next in line is acting, and, well, it's fine, but... just fine. Trauma Center had the worst, most ridiculous Bruce Willis performance I've ever seen, and this one is a tiny bit better, though in both ones he's there for a short time, not a good time, and acts as if the paycheck's the only motivation. Maybe it is. I'd say Survive the Night's acting highlight belongs to the main villain Shea Buckner, whose character is weak and uninspired, but he seemed to truly try.The movie is presented in drab colors, the spaces often feel unfulfilled, until the third act there's no real fun with anything. Cinematography's alright, but it seems like nowadays most indies are shot at least somewhat decently. Make no mistake though, there's nothing interesting about the aesthetics of Survive the Night, unless you can be completely sold on them pulling out a good looking charger for a couple of minutes.Survive the Night will make you survive its runtime, for it is one of the most paint-by-the-numbers, uninspired, flat, clichéd quickly-made/quickly-forgotten kind of movies ever. I give it a very rare 2/10 and recommend it to none, but if you do decide to see it, I suggest going in with the minimum of 5 beers on hand."}, {"id": 88, "text": "The plot is pretty loose, but the dialogue is what made me quit. One of the first scenes two guys have $25k in cash, then one idiot decides to rob the gas station for maybe $100.Goes steadily downhill from there, with these beautiful lines soon after.Did you ever wonder? About? How we did We did the best we could. We weren't perfect, but no one is. Oh baby, I could have done much better.This is a b rated cringefest of cliche's."}, {"id": 89, "text": "It's hard to believe Bruce Willis continues to star is films that are beyond bad these past several years. It's as though he is new to Hollywood and just getting his start. He can't be doing it for the money as this (and most films the past several years) film is low budget. In fact, he turned down $3,000,000 for a four day shoot for Expendables 3. So I assume it's not about the dollars. Meanwhile, to keep it short, survive the night is a slow paced bore fest with little to no interesting plot development. Bruce and company meander through the film with terrible dialog and subpar acting. No character buildup and holes in storyline throughout. Typically, I would go into more detail as to why this film is so bad but it really is not warranted here. Simply skip it.Save yourself 90 minutes and get a root canal. It's less painful."}, {"id": 90, "text": "Very predictable outcomes with poor low grade acting. The story line is pretty good but the cast didn't do it justice. I expect more from Willis."}, {"id": 91, "text": "Wow, what can I say. This is an utterly pointless movie. So formulaic and it represents a new low for our Bruce. We we meant to actually care about any of the characters in it? It ended before it got started."}, {"id": 92, "text": "If you are a Bruce Willis fan give this a miss. it is awful. Maybe Bruce was related to the other people in this film and thought he would appear as a favour? No, he should not have bothered. Aside from Bruce whose performance was wooden or just about there. I think he must have filmed all his scenes in one day to get it all over and done with family or not. Poor story or just downright lazy? I could hve written better myself, on a bad day. Maybe Bruce was bored living with his ex demi in lockdown and got out for a couple of hours to star in this. Really Bruce? Shame on you, trying to pass this off as entertainment."}, {"id": 93, "text": "Honestly don't understand what's up with all the great reviews. Are they paid? This has to be one of the worst movie I have seen in many years, and there are a lot of horrible ones out there. How the hell does something like this even get released? This is just utter crap. Completely embarrassing for all involved. Maybe it's time to stop now."}, {"id": 94, "text": "Start of the movie does not imply its an action flick thriller and it is not. It is just a thriller movie with a generic plot. The screenplay is below average, the dialogues are pretty much boring. The only good cast in the whole movie is the crazy guy who shooting everyone, one of the outlaw brother, but still his performance was falling time to time. An emotional moment with his brother on the dying bed, he could not put enough acting in it. Bruce willis as usual but i feel like he is well below than his standard in this movie. I dont understand why he keep casting in movies like this, the guy look like out of money and dire to earn the needed, required last bit of money for his retirement. Now i understand the ups and downs of man's life."}, {"id": 95, "text": "From unlimited bullet shootouts to handcuffed to a tiny table wood unbreakable leg. This movie was so horrible. Shame on you Bruce."}, {"id": 96, "text": "Bad plot and disaster performance. Had to leave before the end ..."}, {"id": 97, "text": "Awful, awful dialogue, terrible acting, ridiculous plot points. It's sad to see Bruce has fallen so far. It can only be assumed that he had some payments to make to an ex wife. Utter garbage and that's being disrespectful to garbage"}, {"id": 98, "text": "Does Bruce Willis have a bunch of bills to pay or what? He seems to be phoning it in on a string of such boring, unoriginal, low budget movies lately. You knew exactly what was coming every minute in this movie, at least when the plot made sense, and the dialog was just painfully bad. At one point Bruce is sitting on the floor, tied up, his wife just killed (knew that was coming as soon as they said I would be lost without you) and he looks positively BORED. Even the title is WRONG, they survive the night and yet the movie isn't over! Don't waste your time, you will want it back if you sit thru this stinker."}, {"id": 99, "text": "It's just terrible. Like, really really awful. It claims to be a thriller but there was not one single thrilling moment in the entire movie. It's not even about the acting. It's the story and the plot and the directing. Just.... don't waste your time... you can't get it back."}, {"id": 100, "text": "I don't think even Bruce Willis liked being in this movie lol even his acting was horrible ..."}, {"id": 101, "text": "Absolutely aweful! Don't waste your time. The characters where brain dead and all I could think was WHY!"}, {"id": 102, "text": "Wow. Bruce Willis has decided to just walk thru some really bad movies lately. This is one of them. A formula script with poor acting and suspenseful music that drones through every scene. I think Bruce Willis has taken career advice from Nicolas Cage. Say your lines and collect a check."}, {"id": 103, "text": "The movie is full of gaps throughout. It's a movie that could leave it saying, It wouldn't be so much nonsense. Waste of time in two words."}, {"id": 104, "text": "It was so bad I can't even describe it. The music, the acting, just bad."}, {"id": 105, "text": "This is not a bad film, it is in places a bit predictable, and Bruce Willis actually acted for the first time in a long time, instead of just being there, worth watching."}, {"id": 106, "text": "No plot but love the characters. Felt very long and drug out."}, {"id": 107, "text": "I saw the bad ratings of the movie but wanted to see it anyway. I believed that it could be underrated and was really in mood to watch it. But hell was I wrong... the movie was really really bad. Poor dialogues with no sense, idiotic scenes with No meaning, bad playing from the actors and even bad actors that made me wonder how they got cast. It had moments that everyone was thinking damn this cannot happen, they cannot be making those choices for a movie in 2020. No one would make the choices that the characters were making in real life. It's too bad Bruce Willis played in this movie."}, {"id": 108, "text": "Terrible film. No storyline, no characters, mediocre acting.Same story has been told thousands of times before. This version is awful.If you feel like you have to watch it, for the sake of your mental health, please watch it on x4 or just skip to the end.Thanks"}, {"id": 109, "text": "Film is absolute rubbish, a child could work out what's coming ahead, Bruce Willis must be pretty desperate or greedy to be involved in a trash film like this, infact the script must have came from a kids competition it's that bad."}, {"id": 110, "text": "The producers could've better used the money of making that movie to feed the starving people in Africa. It scores minus 1. Bruce Willis what happened to you?"}, {"id": 111, "text": "Same old feces.this movie is a disappointment ..its hard to survive this movie after 15min."}, {"id": 112, "text": "Worst movie ever. Senseless thrill. Plot is as repeated. In all, world would be same if that movie wasn't made."}, {"id": 113, "text": "As above the movie was just bad. So many things could have been done. I continued watching just to see what idiotic thing would happen next."}, {"id": 114, "text": "Survive the night is an action thriller that neither has action nor thrill. Not a single likeable character, horrible acting and the worst thing that most of the actions did not make any sense."}, {"id": 115, "text": "The most stupid film of Bruce Willis! Why he has to be in this film! Elementary written film...a total waste of time!"}, {"id": 116, "text": "This film is terrible. I amost did not survive the night. Caution! Keep out!"}, {"id": 117, "text": "This movie dies hard alright and not worthy of Bruce Willis! Ridiculous plot &amp; dialogue. The non injured criminal brother is dumber than a box of rocks and apparently can't tie a rope well enough that family members escape repeatedly. It was like the screen writer threw together several plot ideas into one movie. The only positive in this whole thing is we watched it for free on Crackle"}, {"id": 118, "text": "Horrible! Waste of time Don't even think about watching it"}, {"id": 119, "text": "The only redeeming quality of this movie is that it does end. Hard to determine what is worst, the acting, the directing, the screenplay and/or storyline. It is so bad that I found myself laughing even though no jokes were told. I continued to watch this movie only to see if it could get any worse and it did not disappoint. Bruce Willis should not come out in daylight for at least a year after his performance in this movie. The director of this movie should never again be allowed on a movie set. Everyone who has ever watched this movie is dumber for having wasted their time."}, {"id": 120, "text": "Cannot decide why i did not close the movie at the first 3 minutes . It is one if the most annoyingly boring movies ever saw .Please make a favor to yourselves and SKIP this ."}, {"id": 121, "text": "The difficult here is to survive the whole movie-night watching this one. The script is a joke, acting is bad (when John Mclane became John's MClane pops?) and the whole thing as a movie is a failure. As predictable as avoidable."}, {"id": 122, "text": "Don't waste your time, it's absolutely the worst movie I have ever seen, poor acting, poor scenario , pooor everything, really disappointed.."}, {"id": 123, "text": "This movie was a waste of time. I'm surprised Bruce Willis was part of such a slow moving unrealistic movie."}, {"id": 124, "text": "How a 'big' actor can be involved in something so bad is mind blowing. Terrible plot characters and dialogue. By the end you wee hoping they would all die."}, {"id": 125, "text": "Do not waste your time to watch it. Bad acting, bad production, bad written ... I feel sorry for Bruce Williams to end his career like this :-/"}, {"id": 126, "text": "I actually enjoyed how the actors played their role but the script... no words. The victims had plenty of opportunities to do so much better, to escape, to take control. It was definitely annoying, very annoying. I wonder what Bruce Willis was thinking when he accepted to be part of this charade. Good money? Don't think so. Can't be. Ahhh, he was bored and decided to throw into the toilet the remains of dignity he still had."}, {"id": 127, "text": "Don't waste your time! This is NOT a typical Bruce Williams Movie. I think he did it for a charity or something."}, {"id": 128, "text": "A basic hostage/home invasion premise is given some extra complication by an injured hostage taker demanding help instead of money and a fully fueled jet with a blank flight plan. However, the plot development is so bad it actually makes you start thinking that maybe these hostages deserve to get shot. They 'escape' and are recaptured repeatedly... One time almost seconds after being tied back up after the previous 'escape'! It is ludicrous and takes huge liberties with the audience's willingness to suspend disbelief. A truly terrible plot that made me so annoyed I had to write a review😒"}, {"id": 129, "text": "There is one thing it seems you can always go to the bank on: if the credits say AN EMMETT/FURLA PRODUCTION then you know its crap, that a mostly has-been star has just gotten paid 80% of the budget to appear in a couple of scenes while a couple of second or third tier actors carry the film. And Willis is the worst offender, making two or three of these every year.Another home invasion thriller and unless you've never seen one of these before, you can spare yourself 90 minutes because there's nothing new here. I mean, really, who read this script and thought Wow, we have to make this!'?By the numbers. The actors try (I suppose) to keep their dignity -- although the fish lips on one of the actresses is rather annoying. Dull direction. At least its a short film."}, {"id": 130, "text": "The whole thing was just terrible! Just a movie about petty problems and family drama! This is supposed to be a Thriller right? Why is it so lame? It just is! Bruce Serriously, if you're just going to phone it in, then don't bother filming a movie. Plot was mediocre at best and was just too predictable to be enjoyable. If you value your brain cells, DON'T watch this movie! Serriously, save your money and time and watch something else. You've been warned."}, {"id": 131, "text": "This movie is full of mistakes and silly reactions of the actors. The storyline is total foreseeable abd boring. Fir my point of view its a waste of time."}, {"id": 132, "text": "Worse movie I ever saw. I don't have all the words to express my disappointing"}, {"id": 133, "text": "This was a horrible movie...waste of time...acting was terrible. The dialogue was terrible. The plot had a lot of inconsistencies. I could not bring myself to watch till the end."}, {"id": 134, "text": "This movie wasn't the worst and at the same time wasn't the best. The entire time I was waiting for a plot twist, and I have to admit that I was utterly disappointed. The storyline was easy to guess, I felt like I watched so many movies with similar concepts. All in all it was repetitive, I didn't feel like I was watching something new. I have to also admit that I love Bruce Willis, I always indulge myself with his movies, but in this movie I felt like he wasn't the star/hero of the movie, he didn't fit in with the character (although the poster of the movie makes it seem like he is)."}, {"id": 135, "text": "For top actors like Bruce Willis, this is a bad film. The story line doesn't impress me"}, {"id": 136, "text": "Screenwriter Matt Eskandari's predictable plot abandons realism - along with any unexpected character revelations. There's no shocking, jolting violence or queasy ick-making accidents."}, {"id": 137, "text": "Very poor, not a Bruce Willis movie. Bruce Willis was paid to be a guest of Honor Only."}, {"id": 138, "text": "What did i just watch!? Wow was that bad. Considered shutting it off but we paid $7 for it. The acting is horrible. Even from Bruce! It made no sense. Was boring. The just goes on. No one cares about the dead mom/wife/grandmother. They hang out all night in a barn and don't even try to get help. There's cars available and yet again no one goes for help even when the killer is sleeping. The doctor gets shot in the shoulder and somehow had a limp. And also somehow gets a new shirt! There was nothing appealing about this movie. Not one thing. Hated it!"}, {"id": 139, "text": "Oh ...my god ..so bad , had to watch to see if it got better ..did not ..."}, {"id": 140, "text": "Thought this would be much better considering Bruce Willis, but this movie was difficult to watch. The story line was off and not consistent with the plot. The writing was just bad. Just awful!"}, {"id": 141, "text": "One of the worst movies I've ever seen. Poor casting with even more horrible acting. I just wasted an hour and a half of my time. Extremely disappointing."}, {"id": 142, "text": "Such a disappointment to see the legendary Bryce Willis in a such poor acted scenes. Bad scenario, limited actors."}, {"id": 143, "text": "Sorry, I couldn't rate it lower. Very hard to watch, the only reason I did was because of the quarantine and having nothing else to watch."}, {"id": 144, "text": "Old idea, plot is ancient and over done! For a family on an ex sherif this must be the stupidest family in the history of cinema. At some point I caught myself yelling  good, u deserve it bcuz u r acting stupid!. The movie itself could've went the same line without Bruce Willis character, I wonder what he contributed to the storyline, also the little girl."}, {"id": 145, "text": "This is an absolutely pointless movie. The plot is so dumb, with 'character mistakes' that even a person with low IQ would struggle to make. Acting was terrible, with the slight exception of Bruce Willis...he was a 5/10 at best. This movie was just annoying."}, {"id": 146, "text": "How many times can the villain sneak up off camera and surprise hit the victim over the head? Well it happened at least 5 times in this piece of crap of movie. Bruce Willis you should have just run away after the opening credits."}, {"id": 147, "text": "When you've seen movies as much as I have you develop a sixth sense, this one stinks to high heaven. Heavy dose of melodrama, all made possible by some bad guy pointing a gun at a good guy, or good guys family. It's the trope of bad writers to get characters to do non characteristic things because someone with a gun threatens them. So the film starts with a weak premise and builds on that. it's not worth seeing.... and yet there will be people who still like it. Go figure!"}, {"id": 148, "text": "One of the worse movies I've ever watched, I only stuck to with it to see how it ends. I thought, oh Bruce Willis? This should be good. How wrong was I? Pathetic."}, {"id": 149, "text": "Bad acting. Bad everything Dont waste your time. Bruce Willis?????????"}, {"id": 150, "text": "I picked this movie for bruce Willis as he is one of my favourite actors but this movie really got me bored. I expected more."}, {"id": 151, "text": "You'll enjoy an hour or so of watching hide and seek with people aimlessly wandering around only to find really bad places to hide.You're then treated to the usual good guy gets the upper hand on the bad guy, but runs off to leave the bad guy to recover. Better still, leave him his gun (that you could have used to kill him with).But then we have the mighty Bruce who saves the day.'What you gonna do' says his son. 'Get his attention' says Bruce. So with that you'll have another 10 minutes of aimless wandering around (this time driving though).After Bruce's utterly pointless drive, they both pop back to the house - maybe for tea and cake, not too sure at this point.Back at the house Bruce and his son spend some more time fart-arsing wandering around.Are people lost in this film perhaps??Back to Bruce knobbing around doing nothing in particular again.By this point, I really wanted to bad guy to win, but sadly he didn't.Literally have no idea what Bruce Willis was in this film for. In fact, I don't think Bruce was meant to be in the film, he just turned up and was making a pest of himself.Aside from watching a bunch of blithering idiots stumbling around for an hour or so, the bits of acting (between the wandering) were quite good."}, {"id": 152, "text": "This movie is absolutely brutal... I figured with Bruce in it it couldn't go wrong. Well I was sadly mistaken. It's shot well yes, edited well yes... but the happenstances and lack of real life common sense is appalling. Very predictable. You know when the bad guy drops the gun, the victims could easily pick it up and end the situation right there and you're yelling at the TV Pick up the gun! Pick up the gun!!! Well, that happens a lot in this movie. Once, sure... but it happens 100 times here. Don't waste your time watching this."}, {"id": 153, "text": "I don't know if it's because of the COVID pandemic but Bruce Willis who is one of my favorite actor just keep getting casted in horrible films lately. Hard Kill, Trauma Center are two examples and sadly Survive the Night join the bad films group.The characters are just really dumb. The plot is very weak. Everybody in the family keep getting hit at the back and captured. The only time the doctor finally succesfuly ambushed the intruder and made him drop his gun on the floor, he decided just leave it there, let the intruder begin a pointless car chase with his dad that goes nowhere. Eventually the intruder just drives back to the house and hit the doctor in his back again and capture him, again. I stopped taking the film seriously at that point. And what are the wife and daughter doing in the barn all night anyways?"}, {"id": 154, "text": "Well, when you become aware that was filmed in 10 days then you realize why this movie was another flop for Hollywood."}, {"id": 155, "text": "Why Bruce willis is doing these bad movies recently! The movie is bad .. the music is bad .. the scenes are incoherent and instable .. I lost 1 hour and a half from my time watching this crap!"}, {"id": 156, "text": "Are these the stupidest people on the planet? Sleeping in the garage while a killer sleeps in your living room? Exposing the wife and kid's hiding place while the killer is looking for you? Hiding near the property while the killer looks for you when you have deep woods to hide in? No neighbors? Gunshots at night and no one hears? I guess the whole thing was to show the doctor's dedication? Driving the car away hoping the killer catches up to you? It all seems so totally absurd!"}, {"id": 157, "text": "What the hell was Bruce Willis doing in this movie?!He must have a few debts to pay off...Bad acting, bad screenplay, bad cimematography, cheesey storyline...Better than Scrabble, not as good as 'Star Wars Kid' on YouTube!"}, {"id": 158, "text": "I'm not going to give this a lengthy write up.. It started with die hard.. aground breaking film, that defined the genre.. and now this limp, insipid nonsense, that is so full of holes.. and Bruce, what was your role in this? it was all over the place and delivered nothing at any point.. Booooooo!"}, {"id": 159, "text": "I dont know what happened to Bruce's carrier to make him do movies like this, but its sad. I dont know what's worse the writing or the acting but I hope everyone involved finds new carriers"}, {"id": 160, "text": "Muito ruim. Péssimo. Sem pé nem cabeça. Muito ruim. Péssimo. Sem pé nem cabeça. Muito ruim. Péssimo. Sem pé nem cabeça."}, {"id": 161, "text": "Very weak in all angle of the movie plot.. even kids will laugh with this movie plot.Bruce! You better than this man.."}, {"id": 162, "text": "They had so many chances to get away. And I've never seen a sheriff's family that could not shoot!"}, {"id": 163, "text": "The worst acting ever. Such a sad ending for BW. Dont waste your time and money on this movie"}, {"id": 164, "text": "Absolute disappointment, I felt nauseous throughout the movie not from the open wound that did not bleed for 12 hours but from the quality of the details. A grown up hand cuffed to a table could not lift it or break it, hell my kid did that when he was 6! Bruce was the biggest disappointment though he's frankly too old to act. The movie from start to finish promotes the emptiness of the American dream. Bullets didn't run out and the police never showed up, a classic undermining of the watchers' intelligence."}, {"id": 165, "text": "How does garbage like this get made? The dialog was horrible, the acting just plain bad, and the story was not very interesting. I turned it off at 38 mins."}, {"id": 166, "text": "Such a waste of time. Do not get it how Bruce W. could agreed to play in that movie. Looks like a low budget film with no real story or plot."}, {"id": 167, "text": "Rich is such a dumb guy.. Stupid as his father sees him.. A disgrace and dumb."}, {"id": 168, "text": "Bruce Willis used to be a good actor. I saw a few films with him, over the last years, something happend with him... Bruce, is that you??"}, {"id": 169, "text": "I feel for Bruce, i guess its a paycheck. producers could have cast the supporting actors better, did not feel any chemistry between husband and wife, and whats up with the botox overdose for Lydia? The awkward silences meant for effect were just uncomfortable"}, {"id": 170, "text": "I dont know if it was too expensive to get a good director or make a half decent plot these days, bad acting, old story, no twists, no logicOne of the robbers goes away in a car chase (logically would take at least 15 min) and comes back to find the situation as if he never left.Get your **** together ppl, this just is not hollywood at all"}, {"id": 171, "text": "I am so sad to see one of my favorite actors ( Bruce Willis) playing in this movie..it was so annoying. Not real at all."}, {"id": 172, "text": "I was dissapointed in Bruce Willis that he agreed to publish this amateur movie."}, {"id": 173, "text": "Movie has a good story, but bad acting, music and filming and so on! Sorry to say almost a B movie. I wonder how much Willis salary for the movie or did he do a favor for the producer and is the writer a personal friend of him. Still i would give a 3/10 for just watching him in this «wasted my saturday night movie»."}, {"id": 174, "text": "Sadly this is one of the worst movies I have seen recently and I have watched a whole lot during lockdown. Terrible story, weak characters and acting, I seriously wonder how these movies get funding, dont waste your time!"}, {"id": 175, "text": "If this is a thriller, there was no tense moment at all. Everything the character did does not make good sense. A better director and a good editor could turn this around to make it a good film. The pace is uneven and slow. The timing between events do not make sense. Watch it and you see what i mean. The minute the bad guys entered the house, i knew it was bad. But i persevered to see if its gonna get better. It didnt. Seems to me nobody in the house knew how to use the gun except the bad guy. There were so many OMG that was so dumb moment that it became hilarious. I was counting what other dumb things they might do. It was pretty draggy as it is. I bet If It was edited tighter and better the timing of events could be fixed, they could have explored the Sheriff's background story. All actors did a good job. i put the blame solely on direction. Poor Bruce. He deserves to be in a good movie."}, {"id": 176, "text": "Totally sad anD predictable. This film is so by the numbers and boring. Bruce Willis has sunk to a new low. Please do not waste your time to watch this piece of trash. Last, grade D over the top acting. You have been warned."}, {"id": 177, "text": "Do yourself a favor and skip this movie. By far, one of the worst movies I've ever seen. Poorly written. Poorly acted. If you're like me, the trailer didn't really grab me. For some reason, my wife thought it might be ok. The first 5-10 minutes of the movie told me all I needed to know and I wanted to turn it off but since I paid $7 to rent it (on-demand), I figured I'd stay with it. Yes, I sat though the whole movie and yes, it was terrible right to the end."}, {"id": 178, "text": "This plot relies heavily on impossible coincidences and absolutely absurd medical miracles to get through this idiotic movie. Should be 0 stars.The dialogue sounded like a bad Lifetime or Hallmark movie. Zero character development."}, {"id": 179, "text": "How bad can a movie be? Watch this film and you will know it. Bad actors, bad script, bad movie."}, {"id": 180, "text": "Even before watching this I knew it would be one of those leave-your-brain-at-the-door types. The only problem was, in doing so I STILL felt too intelligent for this movie. Poor decisions by characters and total dis-jointedness throughout led to me really not care who lived or who died. If you're looking for a good Bruce Willis then this is not it!!"}, {"id": 181, "text": "I expected Bruce Willis character to be the hero. Wow was I wrong...he was no John McClane in this movie. Very disappointing performance!"}, {"id": 182, "text": "Richard (Chad Michael Murray) is a doctor who lost it all because he practices in a state that doesn't require doctors to have malpractice insurance. He is the center of a home break-in film with two robbers who need a doctor to remove a bullet. Bruce Willis is there, but it might as well be Grandma Moses. The drama had a Lifetime feel to it. They are on their way to Mexico in a car with Georgia plates and a guy in a convenience store near the border went to school with the driver's brother. Small world.Guide: F-word. No sex or nudity."}, {"id": 183, "text": "The story is okay. But everything else is not okay! The actors behave like they have no idea what they are doing. Like the script has been hidden from them! Oh sorry....script? Its so lousy that its discriminating to call it a script! They just do random stuff that makes no sense what so ever... I am very disappinted."}, {"id": 184, "text": "The whole story, in addition to the mediocre rhythm, is actually not that bad. In the real world, ordinary people who face difficulties may react more flustered. There are too many fierce films defending the homeland, including the uncle's own glorious past is also a variety of open, such a weak performance, better said it is closer to the real. The most disappointing thing is that the uncle drove the tiger away from the mountain alone with the injury. As a result, there was no big trick to chase for a long time, and the thief returned. And the emotional release of the audience."}, {"id": 185, "text": "This movie start out quickly there is no waiting you're wondering when the movie will start it gets right to it it has decent action sequences and keeps you wondering what will happen next it was worth watching if you don't mind blood and violence there are quite a few shooting scenes overall it was good"}, {"id": 186, "text": "The script is not only a cliche but also really bad and full of inconsistencies and errors. People are bound up and escape twice during the film without making any progress. Bruce Willes escapes with a car shouting come on come on ending abruptly because of a milk cart on the road and you realise they could have left hours ago with the two cars parked up front...apparently...man it is hard to convey how bad this film is."}, {"id": 187, "text": "The first 30 min are OK. Then, the dumbest people there ever were couldn't overcome one guy with a revolver. They escaped NUMEROUS times and just hid in the back friggin yard and barn! There were MILES of land around with no houses and a practically infinite number of places to wait it out, especially the ladies, one of whom may as well have not even been a character. I mean the women's roles were about as pathetic as it gets. The only one with any memorable lines dies early in The Night. Another took 5 mins to pull a goddamn trigger. LOL. It was laughable...They KNEW the area and the bad guys didn't! What is Bruce doing!? Surely he could make something better than this just off the top of his head! Hell, what am I doing still wasting my time on this movie!!!???"}, {"id": 188, "text": "There's nothing great to see in this film, but I enjoyed some notably bad acting - especially from the violent brother character - trying to wring a few tears from his eyes = so funny.The absolute best part was the super-bad makeup / FX on the bullet wound - it looked like a cavernous hole in the guy's hollowed-out leg. The doc had to rummage around in to find the bullet and he pulls it out clean - there was not one bit of meat in there! Hilarious.I enjoyed watching the wound throughout the movie, since it was left gaping open all night long while the brother who was supposed to be caring for his injured bro went off on rampages, gave long soliloquies and apparently slept through a large part of the night instead of sewing it up.Another huge laugh was the maudlin ending with shots of sky and clouds parting, birds singing, the characters smiling. So ridiculous its good."}, {"id": 189, "text": "Total waste of time and a garbage acting by everyone in the movie. the acting is subpar, the scenario is really badly written and the pace and chaining of events is boring. The main characters are not convincing at all halfway through I couldn't take it anymore so I skimmed through it in 1 min, boy I am glad I did. Don't waste your time on this one. Any review over 1 star must be fake."}, {"id": 190, "text": "Wow. Just... what happened here? You had a great cast and a decent plot but everything else was AWFUL. The story when it came down to it was weak and full of plot holes. The acting was terrible, even from Bruce Willis. The effects were decent, the score was great and there was a good car chase, but those are the only good things about this movie. This was anti climatic and just all around something that should not exist. When the title is survive the night, take that as survive the movie. It's only 89 minutes but it feels like it never ends. I'd rather watch The Turning (2020) again than this. It starts off okay but goes downhill faster than 2020. Spend your time and money elsewhere."}, {"id": 191, "text": "Yup....you can call it a movie... I guess!?! Thanks to VLC 1.6x play speed, was able to get thru this snore faster."}, {"id": 192, "text": "Bruce Willis' son's wife torpedoed this otherwise good movie from the start. The poor dialogue wasn't helped by her atrocious acting. Ignoring this, the storyline, cinematography, character development and direction was good. Bruce Willis helped to make this movie mildly enjoyable."}, {"id": 193, "text": "Very bad movie very bad acting from Chaf Michael Murray. Wow he made this hole movie go down to bottom. Bruce Willis was the only one who was good."}, {"id": 194, "text": "Just terrible. Nothing made sense. Nothing. And Bruce Willis wasnt the worst cast member in this film as it was all overshafowed by the bad writing."}, {"id": 195, "text": "Thought it would be bad before i started watching it. turns out, I gave it too much credit. the only thing worse than this movie is either the ratings above 2 that it got, or a frozen steel toe boot to the nuts."}, {"id": 196, "text": "The director is probably 8 or 9 years old. The acting is so bad that you feel bad for them. Bruce, Bruce whats going on?? Didn't you read the script before accepting this? The family gets captured...they escape...get captured again...they escape but don't run away, they hide on the property. PLEASE Can someone teach the bad guy how to tie hands properly!!!"}, {"id": 197, "text": "If you want to watch a movie with an awful script, this is it. You won't believe the stupidity of the characters. Amazed it is even rated 4 stars."}, {"id": 198, "text": "This movie is awful, the editing is awful, the writing is awful, the pace is awful and watching Bruce Willis over the last 5 years taking any role in any movie he's offered just for the $ is sadly awful. Don't waste your time."}, {"id": 199, "text": "I watch just about any kind of movies but that badly acted, overacted i should say and the dialogues don't really makes sense just like the scenes.It looks like it was written by someone who learned life watching movies and think clichés are cool.The actress with all the botox they could use on her face WTH!!! , I thought the days of really really fake Frozen alien looking faces were done!"}, {"id": 200, "text": "Awful script, plot, acting ..... Awfull .... waste of time...."}, {"id": 201, "text": "I am a fan of Bruce Willis but sad to say this film was a poor choice from him. The script was unbelievably bad; repetitive scenes going nowhere and on the nose dialogue. The characters are caricatures without believable motivations. And don't get me started on the acting."}, {"id": 202, "text": "This is just bad, in every sense. To simple story, to cheese acting. Not even the stars shine up. (What did the director do here?) This is an hour and half you never get back. I laught from time to time, but in the wrong way - at, not with. Don't look at this. Just don't"}, {"id": 203, "text": "After seeing the picture, I cringed then came here to read comments, a few encouraging comments do I decided to watch but.......when the very first action scene came up, by the gas station, nothing could convince me that this was worth watching! That acting was horrible."}, {"id": 204, "text": "Nothing happens for 1 hour 30 min, the villains are unfathomably stupid and all the good guys have plot armour. Just skip this one"}, {"id": 205, "text": "Well lets see what Bruce Willis has out this week. I think hes overtaking Nicolas Cage in the most straight to DVD work. Now he has out Survive the Night. Its a pretty generic thriller that has 2 brothers headed on their way to Mexico after ripping off 20 grand. After a incident at a convince store one of the brothers gets shot. The invade a doctors home (whos father is a retired cop played by Willis) and threaten their lives if they dont help them. Its a survival story but lacks any real tension and suspense. Its like if you seen the trailer you have pretty much seen the film. Not an awful film and not even Bruce Willis's worst work but pretty lame overall."}, {"id": 206, "text": "After a quite illustrious film career Bruce Willis continues his penchant for crappy films while any film that looks like it might make money demands a million dollars to get out of bed forJust retire BruceAs for the film - it's the typical bargain bin robbers get their comeuppance film - something to watch while you check out your Twitter feed, doesn't need much concentration as you've seen this film a hundred times before so know exactly what is gonna happen"}, {"id": 207, "text": "This movie is about a couple of criminals who break into a home to force the homeowner, who is a doctor, to perform surgery on one of the criminals who was previously injured while committing another crime. Bruce Willis plays the doctor's father and is as cool as always. It is not a bad movie but I found it really hard to enjoy any scene that the actress Lydia Hull was in."}, {"id": 208, "text": "An appallingly terrible movie. Was good for a laugh as my family and I were able to laugh at and critique this bomb. To say the acting and script were awful is an understatement. You've been warned!"}, {"id": 209, "text": "The storyline was pretty unbelievable, that acting was meh and Chad Michael Murray spent much of the movie looking like he needed to pee."}, {"id": 210, "text": "Bruce Willis in movie like this .... to shame. I can't believe why this movie to weak acting and directing"}, {"id": 211, "text": "Bruce Willis is always good, but this film is so bad. My husband kept watching because he loves Bruce, as do I; although, the sensation of hearing nails down a chalkboard everytime someone spoke drove me away fast. The dialogue is so simple and there is no one to like, only made matters worse."}, {"id": 212, "text": "Boring. Bad actors. No acting and no art directing. Poor music. Boring. BB-Movie. No suspense at all. Illogical. Awfull!"}, {"id": 213, "text": "Only One Comment, The Main Criminal Character Has A Six Shooter! He Shots The Gun 11 Times Without Re-loading! B S"}, {"id": 214, "text": "So many plot holes it's like a sieve. Pit's 2 of the stupidest criminals against 4 of the stupidest victims with improbable/unlikely actions as it's recurring theme and missing time made up by victim or criminal characters evidently waiting for the other to catch up to the other. Don't expect any Bruce Willis magic to hold it up, I think he was sleep walking most of the movie."}, {"id": 215, "text": "In one scene(chasing Bruce Willis) the criminal shoots at Bruce 8 times in a row with a 6 cylinder revolver and doesn't reload... not to mention the amount of ammunition he uses throughout the film, it never shows him reload or even have extra ammunition on his person, his gun just has an infinite amount of ammo."}, {"id": 216, "text": "I have never seen worse movie in my life ! I have never seen worse movie in my life ! I have never seen worse movie in my life ! I have never seen worse movie in my life ! I have never seen worse movie in my life ! I have never seen worse movie in my life !"}, {"id": 217, "text": "Really thought it was going to be good. However it repeated itself over and over. Such a waste of a good beginning. I was into it until you get away to many times just to end up in the house again. As bad as I still had hope that the ending would be better than the beginning I lost hope and was disappointed. The body language on these actors were lazy. Just my opinion."}, {"id": 218, "text": "Not the right genre of movie that add all kinds of family ties and affections."}, {"id": 219, "text": "And it shows!. We spent the whole movie questioning every single action, that was the fun part But seriously Bruce Willis should be ashamed of this so called film now I've got to go watch a classic film to get this one out of my mind Oh thank God I didn't pay to see this"}, {"id": 220, "text": "I felt like every five minutes someone in the film was crying. Most of the movie was filmed in a dark lit room with some dude laying in bed suffering. Got annoying and unwatchable. Turned it off about half way in. 👎👎"}, {"id": 221, "text": "Never seen such a poor role-playing, and poor FX... wasted 1h30 Even when Jane runs at 1h20 it's laughable, can you imagine running away for you life as slowly?"}, {"id": 222, "text": "Bruce Willis was in this movie, for about 10 minutes and even then he wasn't in it. This movie sucked so much it put Lela Star to shame. Should've saved the production costs and just took everyone to Olive Garden, cause when you're there you're family."}, {"id": 223, "text": "B movie at best. Why??? The script was not good. The actors were very dull."}, {"id": 224, "text": "I dont want to spoil anythything all i have to say is this one of the worst thriller movies. I can do better with my phone and a few cheap actors to give the story more life."}, {"id": 225, "text": "Such a waste of rental money and time; was hoping to see Bruce do his thing but nope! I would give this NEGATIVE NEGATIVE REVIEW"}, {"id": 226, "text": "Complete waste of time, not recommended, do no watch please, i thought there it would be some action but wastage of time, acting was not connecting with moments at all, the wife of doctor &amp; daughter could not act at all."}, {"id": 227, "text": "Two bad guys, brothers, apparently committed some robbery or something. They've got a bunch of cash in a bag and aim to drive to Mexico. At a gas station the really dumb one shoots the place up for no reason whatsoever and kills a woman in process, while the slightly brighter brother gets shot in the leg by the cashier.They find a clinic and Dumb goes in, is told the clinic is closing but he catches a glimpse of the dr. there. They wait for him to leave, follow him to his house, and break in. Again, Dumb can't contain himself and kills the dr's mother. They hold the wife, daughter and father hostage while the dr. is supposed to perform the surgery on the guy's leg. They get the bullets out and leave the wound wide open. The victims aren't any brighter though and constantly try to cause trouble for the bad guys instead of complying, which results in them getting injured, escaping, returning, etc. After going through this a couple of times they return to supposedly close the wound several hours later as things come to a resolution.The script tries to make something about the dr's. background. He's about to file for bankruptcy, I guess lost everything and has to return to live with his parents. His dad, the town's former sheriff has zero respect for his loser of a son. But all this doesn't amount to much. Willis's presence doesn't do much either here. As of late, attaching his name to a project is rather an indication of poor quality.Survive the Night manages to get you to dislike the bad guy, but then makes you dislike the victims even more, so you end up rooting for no one, or a bit for the bad guys. Direction is alright. Moviemakers still insist on setting these kinds of movies at night and in the rain of course. But here at least it turns day late in the movie. Can't really think of any reason to recommend this movie. It's got some violence, and loud gun shots, and blood, oh, and a great classic Dodge Challenger that surprisingly doesn't get destroyed, but nothing else."}, {"id": 228, "text": "What did I just witness? No spoilers here, but this was at best half baked. The movie had so much potential but the characters were unbelievably stupid in the way they reacted to the situation that this movie centers around. If you are expecting the usual macho Bruce Willis look elsewhere. This version of him is little more than a crumpled shadow of his former self. I can only guess that they casted him for his box office appeal. A bad movie, plain and simple."}, {"id": 229, "text": "Completely wasted my time watching this funny, false action and rhetoric movie. What was the point for the 2 man fighting together? The dialogues were so Stereotype and The director wanted to to make action, horror, mystery genre all in this movie but at the end this was comedy and you could easily what the end is..."}, {"id": 230, "text": "I BARELY SURVIVED THE FIRST HALF!! YAWN, SLOW AND SOOOOOO UN CAPTIVATING . I truly have seen Better. A No Go!!"}, {"id": 231, "text": "Doc was cuffed to the table. Ok, lift the table an inch to get free and help the father. Simple, stupid reason for having this narative..."}, {"id": 232, "text": "Where to begin ? Terribly written with abhorrent dialogue, nonsensical shifts between family drama and survival 'thriller'. This movie is absolute garbage. Bruce Willis obviously does not care about what kinds of movies he participates in any more as a survey of his body of work over the last decade shows. This is a slow burning nightmare. Not even worth the $1.99 that I reluctantly shelled out for it On Demand. Avoid at all costs."}, {"id": 233, "text": "This film may serve as an exellent example for why some film scripts should be burned on sight before people can create damage with them - the absolutley only thing nice in the film is the blue classic car but it only gets a few sorry minutes"}, {"id": 234, "text": "Why don't these 80's action movie heroes just retire and spend their millions in parties and stuff instead of trying one last nail in the foot, over and over again?!"}, {"id": 235, "text": "Story was good.. But the acting needs much more better..."}, {"id": 236, "text": "Kept annoying me, the many times they could have gone to get help and they all still stayed in the house! Guess they had to make the movie drag on to cover atleast an hour and a half lol!"}, {"id": 237, "text": "Even the legendary Bruce Willis couldn't save this extremely boring &amp; extremely slow-paced Drama about two convict brothers who terrorise a family out in the country Home invasion style but not as scary or violent as you would think as one of the sweaty bro's has a wounder leg from a gunshot earlier but the other bro is a psycho &amp; that want the doctor of the house to fix his bro so they can go to Mexico (From Dusk Till Dawn,Seth &amp; Richie style) the doc is the bland Michael Chad Murray &amp; Willis is his retired dad &amp; things go wrong. It's very slow &amp; very boring &amp; there's so many chances to escape or kill the bros but nothing happens, it's crap."}, {"id": 238, "text": "Nothing more to say. Why did Bruce Willis work in such an awful film? He makes me remember Nicholas Cage."}, {"id": 239, "text": "If you survive this movie, you most likely can survive anything ! No need for details or pros/cons , this pos is a bust"}, {"id": 240, "text": "SO many plot holes in this one and characters making idiotic decisions. A family dynamic and a strange backstory to make is care (maybe) about the villians? Willis and Murray do the best they can but this movie be is so B it makes Lifetime movies look like Oscar bait. And can we talk about the constant tying up, get loose or untie, get tied up again? Does the writer have a rope fetish? Will watch anything with Bruce Willis in it, but this was tough at times."}, {"id": 241, "text": "This is someone's passion piece that Bruce offered to help with. It is mediocre. Cheesy acting , weak and predictable story line. If Bruce wasn't in it no one would watch it."}, {"id": 242, "text": "And not in the way that you're used to with his action hero antics, but he is the only thing about the movie that's any good at all. Without him, the movie is mind numbingly bad with little in the way of saving grace.Who the hell decided that Chad Michael Murray should be allowed to keep acting? Seriously? Who did it? I need to know."}, {"id": 243, "text": "Saw the trailer and it looked mediocre, but I thought \\hey lets see what Bruce Willis has been up to' and rented the film on demand.The plot is very simple, which takes us through two brothers on the run to escape to Mexico after stealing loads of cash but are suddenly stopped in their tracks when one of the brothers gets shot in the leg and need medical assistance.The vigilante's find a clinic in the middle of nowhere and follow the doctor ( Chad Michael Murray) back to his father's house (Bruce Willis) where the doc and his wife/daughter are staying after a accidental death lawsuit cased cause Rich and his family to leave the city.So the Vigilante's follow the Doc home and eventually take hold of the family and force the doc to fix his brother's leg but the the family being take hostage wont go down without a fight.There, thats my synopsis onto the review:The film right off the bat seems low budget and the acting on the brother's stand point seems very subpar, i however must tell you that actor - Shea Buckner - plays a very compelling and convincing idiot-psychotic brother but unfortunately not much was given for him to work with as the dialogue was very limited, but I did like his approach.The story was simple, and some of the gunshot wounded scenes were pretty nice and enjoye dthose, but as the chase got on the story became a tad dull and he ultimate conclusion ended weirdly - I was left feeling Just Okay with the film. It wasn't super bad and it just wasn't super good, or even great for that matter.Bruce Willis's role as the father was good, I mean he did good for what his role was, i felt the tension of the bond between father and son, and it worked - I would like to see Willis and Shea Buckner come together in more defined film with a more compelling storyline.simple storynot the greatest dialoguefelt the relationship between both Brothers and the father son bondthe story became dull towards the endReview: 2.8 / 5 or 5 /10 - liked the story but the dialogue fell flat - chemistry was there, but the story as well as the conclusion was dull - wasn't bad, but wasn't great.Justin Leblanc - Host of Real Talk Radio #Reelreview Twitter: @RealTalkRadio8"}, {"id": 244, "text": "There are few directors in the game today who know how to weave a yarn like Matt Eskandari. Much like the two outlaw brothers speeding along the highways after their most recent heist, Eskandari goes 0 to 60 without sacrificing any nuance or plot, fitting 90 minutes of taut action on the head of a pin while your head spins with each new revelation, each heart stopping altercation.The movie opens on a downtrodden Chad Michael Murray, he's recently lost his private practice after a wrongful death lawsuit drove him out of business. He's working at a rural clinic-his wife, father and child all having lost faith in him.Little does he know he's unwittingly on a collision course with these brothers. After a robbery gone wrong at a local convenience store, Mathias is struck by a bullet in the leg. Knowing they're on the wrong side of the law, they seek out a doctor under special circumstances.Leaving the clinic, Chad is followed home and ambushed upon arrival. The brothers lay siege upon the house and demand treatment.I won't spoil the next phase of the film. There are so many layers to this thriller. Familial bonds stretched and strained, the distances one is willing to go for love. The ambiguities of good and evil, light and dark, how necessity and circumstance dictate so much more than we're willing to admit. Eskandari doesn't just serve you a classic, edge-of-your-seat joyride, he plumbs the deepest depths of the human experience, turning a mirror on his audience and forcing them to ask the deeper questions. What would you do for a dying loved one, how do you rebuild yourself after tragedy, and can you put aside your fears to survive the night?"}, {"id": 245, "text": "Chad Michael Murray and Bruce Willis star in this violent thriller about a family whose home is invaded by armed criminals.Frank, a retired sheriff who has a contentious relationship with his doctor son Rich (Murray), whose career is in tatters thanks to a malpractice suit after the death of a patient. Despite their personal difficulties, the two men live together in Frank's home, along with Rich's mother (Jessica Abrams), his wife (Lydia Hull) and their teenage daughter (Riley Wolfe Rach).As the story begins, we're introduced to criminal siblings Mathias (Tyler Jon Olson) and Jamie (Shea Buckner), who, like so many nefarious duos, have distinctly different personalities. Mathias is the brains of the two, not wanting to hurt people if he can help it, while the hot-headed Jamie is a loose cannon, all too willing to resort to violence. His careless brutality becomes a major problem when the two rob a convenience store, with Jamie gunning down a customer and Mathias getting shot and seriously wounded by the armed clerk."}, {"id": 246, "text": "This isn't your typical ultra violent and fast paced masked strangers break into your home type story. You get to know both sides of the invasion and genuinely care about them. One one side is the family patriarch lead by Bruce Willis who has a contentious relationship with his son. This has to be the hands down BEST performance from Bruce since his M.Night days. He 's in at least 2/3 of the film and actually emotes several times - not to mention has a great chemistry with Chad Michael Murray as his son.The other side of the invasion is led by two compelling brothers in Jamie and Matthias. Both these men are morally grey and filled with interesting conflict between them. After the unhinged brother gets the other shot they decide to break into the home of a doctor and force him to remove the bullet in the leg.From here, it turns very much into a slow burn thriller as the brothers plans fall apart. There's a moment between them where one asks the other to just leave but he refuses to abandon him. Then Bruce and his son reconcile while they wait out the right time to strike back. It's not a whiz bang, fast paced and violent piece but more meditative and slow burning about characters in real situations forced to confront themselves and earn redemeption. Worth a watch."}, {"id": 247, "text": "I absolutely LOOOOVED the cinematography! Shooting so close and tight at times made you feel like another person right there with them instead of just observing. Viewers became part of the story. The coloring and editing was fantastic too! Gritty and real. What you see and feel in your day to day on your worst days.The relationships between the characters felt genuine and raw. Brother to brother, father to son. Husband to wife. Its what you would expect true relationships to feel like. Eskandari wonderfully directed the cast and made you feel like they truly were family.I love that Bruce had one semi-action scene but remained normal just being an average guy and Chads character growth and not being shown as your average, preppy, happy-go-lucky handsome dude. Playing against the standard types but still being real and authentic to who they are was great and refreshing!None of this could happen without Eskandari's vision and direction. Between the film and all the BTS he shared on his social media pages with his passion right in the middle ...he has nothing but great things ahead. His vision is wonderful and he created a magnificent film that had me shouting out loud ..which is rare for me. It was a great watch and left me wanting more."}, {"id": 248, "text": "There were more plot holes than the unnecessarily long and sappy 90 minute cat and mouse runtime smh. I get that this is amateur writer Doug Wolfe's first ever writing credit, but c'mon, didn't anyone else proofread this ridiculous long dragged out mess?Here's the math: of the 90 min runtime, subtract 7 mins for opening and post credits. Then we have 20 mins of some bad guys involved in, what, I don't know, that also pull off a stupid stunt, as well as the Brady Bunch family, where the son is a failure, for, I don't know what. The remaining 60+ minutes is the most ridiculous and illogical plot-riddled to the point of hilariousness cat-and-mouse game, with dragged out long and useless scenes. Add the soap-opera sappy dialogue between two brothers, and the father and son trying to rekindle their relationship - amidst the so called terror. Escape, come back, hide, get caught, repeat. And even for criminals, the stupidity in their actions were laughable. It got annoying very fast. Had this film been a 20 min short, it may have received a 5 or 6 from me.Bruce Willis was his usual look at me I'm Bruce Willis attitude with his stale monotonic washed-up tough-guy demeanor. But that I expected going into this, because anything worse than a Bruce Willis film, is another Bruce Willis film. Even the pretty Lydia Hull, who oddly is in almost every Willis film, was boring and stale. The rest of the cast were ok, with the bad guys being the most convincing, and made the effort to act. I'm sure failure from the director to direct his cast properly was a big part of the rest of the characters' failed acting.The directing was also sub-par with some terrible editing. For a b-grade film, the score wasn't as annoying as I'd expected it to be, but still somewhat overbearing and unfitting. The cinematography was ok, but bad in the night outdoor scenes.If you watch this film at 5x faster speed, even without hearing any dialogue, you'll get the gist of the entire story, which is nothing new and done many times before. Sadly, it's a generous 3/10 from me, and I will never get my 90 minutes back."}, {"id": 249, "text": "Where do you go from Die Hard, The Sixth Sense, Pulp Fiction, Armageddon and other classics? In the case of Bruce Willis, the answer is down a steady stream of dull action movies that add nothing new to the genre and are blander than bread that only get blander. Survive the Night is unfortunately next in line of Bruce Willis movies that will be forgotten about within the next month, if it's lucky. And it seems Bruce Willis knows this, because he was bored throughout the whole movie and it was obvious. Bruce Willis wasn't as big a part of this movie as he was hyped up to be. My biggest problem with this movie is the pacing. It's all over the place. We keep seeing the same things happen over and over again. It's like the movie is stuck in a time warp. You just wish they'd move onto the next scene. On top of that, the movie became so predictable that you could guess the next plot of events a few scenes ahead. However, I couldn't have predicted some of the stupid choices the characters make (but I'll get to that in a bit). Everything is explained in such a vague way that you can't really connect with the characters. They always play the game of talking about something the audience doesn't know about so much that it gets annoying. The action scenes are either too static or too disorienting. The color of the cinematography was unpleasant to look at. Everything mostly looked dirty. So many choices the characters make don't make sense (a couple I could understand but that isn't the majority). Without spoiling, let's just say you see an obvious choice the characters should make and for some reason, they don't go for that obvious choice. It's so infuriating, you'll find yourself shouting Why!? at your screen. Some of the nighttime shots look like they were shot in the daytime, and not even the recoloring could change that. The continuity was weird in this movie. It almost feels like the film editing was rushed. The only saving grace was that at least a few of the actors had some decent performances and looked like they were trying but those people's characters weren't really fleshed out. We know almost nothing about them. Overall, I'm sure they weren't aiming for any kind of award, but it's like they didn't even make the attempt. Not even the movie title sounds interesting. I was hoping for a slight amount of effort, and that seems to be all I got: slight. This movie may have survived the night, but it won't survive the test of time."}, {"id": 250, "text": "Why not 1/10? I give it three stars for the acting, which I can't fault much, and, stupid as it felt while watching the absurdities unfold, there was some suspense through the movie. And, well, Bruce. I always liked Bruce. It doesn't change the fact that it was a waste of time and I really recommend you invest your 90 mins of life elsewhere. I found none of the characters really likeable. In this kind of movie it's a problem, as I couldn't care less about them, towards the end actually hoping they'll die so I can switch it off. Honourable mention for the most annoying on-screen presence get the main bad guy - a, no way around it, really dumb meat loaf who keeps on accidentally shooting people, and the doc's wife. Mostly, for the amount of botox she must've stolen from hubby and injected in her face, but she also scores the Home Invasion Headless Chicken award for most pointless actions. Speaking of chickens - the whole movie is like watching a free range farm at work. The protagonists somehow break free, walk around for a while, get smacked by the meat loaf, repeat. Cherry on the cake is the car chase interlude, a completely absurd race to the farm fence and back. I felt at times like watching a zombie movie, as everyone was pointlessly staggering around and getting back to the henhouse. After about half the movie I really didn't care about anyone on the screen and stared in disbelief wondering who wrote this trash and how much more surreal will it get. No disappointment here, it got completely bonkers."}, {"id": 251, "text": "Now it's not best film or greatest film it's one of those time waster films to kill time off not if you expect BIG action well their isn't big action there are some of it but everything that you think it's bigger action film. Now I know Bruce Willis doesn't care anymore so he makes films that are direct to DVD or straight to VOD but at least he comeback on big screens recently like Death Wish (2018) luv that film to Death,  then to Motherless Brooklyn then now he is gone back to straight to DVD films sadly like to this film now last Bruce Willis films I enjoyed like last one I liked was Extraction (2015).I thought it was alright but wished it was done better, wished it could had more action in film it could been on run film just like with Run All Night film but this film was low budgeted so that's why entire middle of film it's filmed at double story house surviving against bad guys. Story plot follows A disgraced doctor Frank (Bruce Willis) who use to be an cop as well he has son Rich (Chad Michael Murray) who is married his wife Jan (Lydia Hull) who appears 6 Bruce Willis films Vice, Extraction, Precious Cargo, Marauders, after 4 years later 10 Minutes Gone and this film Survive the night Stallone films she is known for Broken City, Escape Plan (2013) as Receptionist not as big character until she got her character Jules in Escape Plan 2 Hades, Escape Plan 3 The Extractors, Backtrace. They got daughter as well they moved to Rich parents house to Frank that's meant to be Bruce Willis father and his mother house because they were Bankruptcy.He has 2 brothers that are criminals Mathias (Tyler Jon Olson) and Jamie (Shea Buckner) were 2 robbery's that robbed Gas Station theirs this cold scene ever brother killed an pregnant lady that was so messed up that's not mess that everyone wants to see but at least you wanna hate those cold blooded criminals one brother got shot they drive away then they ditched their car they run to woods that's when they broke into Bruce Willis with his family in house that's what it got all started now with this film theirs few issues like family not Bruce Willis character but others ran escaped then they got put back in house tied up same thing they hit criminals they run escape they get caught again tied up again like 3 or 2 times it pissed me off but I can handle it because I know it's straight DVD film so I know writing isn't best of film. I mean Bruce Willis does some action in film but not everything he does I Liked him driving an cool looking as Muscle car he drives car chase scene they chasing each other drifting car stunt looked amazing shot it wasn't fake like you seen in B films not it was real stunt it looked amazing otherwise you have Bruce Willis hitting those 2 bad guys trying to kill them but I really wished he would kill both of them rather then the son. at end of day if your Die Hard fan of Bruce Willis you will like it or not but as I said don't expect too much what you think like oh extreme action or Bruce Willis gonna kick ass he did but not much sadly I wish this film would be titled Survive to Dawn because Survive the night they survived to night to at very end they survived on morning you might think oh so the film is gonna end at night but characters really survived until very morning. I wanna see more Bruce Willis films so I wanted to see hey lets see what Bruce Willis has been up to he has been back in big screen then he has been bouncing on to Slaright VOD sadly his career has been in big screen like he came back in remake that was my favourite film (2018) Death Wish &amp; Glass (2019) &amp; Motherless Brooklyn bouncers back to Slaright VOD direct to DVD films sadly at least his career is not worse like Van Damme or Lundgren or Seagal or Mickey Rourke or Nicholas Cage look not all of their direct to DVD sucked expect for Nicholas Cage career has gone worse then to Bruce Willis career. some are but with Bruce Willis has been doing good okay direct to DVD films I seen worst of his like Prince, Precious Cargo, Marauders, Split, First Kill, Glass I know that's not a direct to DVD but hey at very least it's big screen film but it's pure garbage. Film has simple story, doesn't have greatest dialogue felt the relationship between both Brothers and the father son bond. I liked mixed idea of this film with Hell or High Water lite meets The Desperate Hours with the criminals as more sympathetic villains. they were cold blooded brothers that's What kept me engaged was trying to guess how things would play out for the family and which side would come out on top in the end. look if you Bruce Willis fan your curious to see what he is up to this film is good but not great this is just for Bruce Willis I would have to say film has it's issues but if you can deal with it I can but I know not everybody could but end of day it did annoy me but it didn't make me to hate film I would even put this in my Bruce Willis collection 6.10 worth watching if your die hard fan of Bruce Willis give it a go."}, {"id": 252, "text": "Whether it's in the movies or real life, when really really bad people do the things they do, you don't have to be a really good person to root against them. While most of us want to be someone our friends, family and God can be proud of all the time, we all have a demon or two that makes that impossible. But no matter how flawed the average Joe may be, he has more good in his heart than bad. In fact a guy like Matty could ALMOST fit in to that majority. I say almost because his degree of badness is too overwhelming to ignore.Now you have folks like Jamie who pretty much have the EVIL and SORROWFUL molecules of the world monopolized. This kind of person is easily despised by the masses. Regardless of his unbending loyalty to his brother, he is the very essence of wickedness. You can be the Bible thumpingest christian or the epitome of a social justice warrior leading the charge for defunding police and still crave for this man to meet a horrible demise.Sometimes it's difficult but when watching a movie I do my best to block the fact that it's scripted entertainment out of my mind. I find it adds to the enjoyment of the movie experience. Losing oneself in a story is what it's called I believe. I'm sure there are many who won't agree with me on this one and I can totally understand that. Not everyone has the same mindset or perspective. But as an aspiring script writer I use every movie experience as education. This one taught me some very important things too. In fact it's the type of writing I've aligned myself with. Not FLASHBACKS, but not in exact chronological order neither."}, {"id": 253, "text": "Rated as 1 star because I am infuriated that this is yet another movie with a STUPID story where the CHARACTERS BEHAVE LIKE REAL PEOPLE WOULDN'T BEHAVE! There are also more than 2 HUGE plot holes that make absolutely no sense - you will see, if you waste your time on this.This is also a done-to-death-cliched story/plot..... If you see the trailer, you will see what I mean.The ONLY redeeming features of this movie are that the action and acting is decent. If you HAVE to watch a movie because you literally can't do ANYTHING else, then this might keep you entertained for 1 ½ hours.... Don't blame me if you are angry afterwards though... I was constantly screaming at the screen, 'Aw, come on!!! NO ONE would DO THAT!!!'How do movies like this keep getting produced?!?!!?!"}, {"id": 254, "text": "We all love a great movie, we love seeing top billing stars; similar to how Bruce Willis once was. He's still is a quality actor, however one can only work with what they are given, and in this instance, it wasn't a lot.Nothing at all wrong with the concept, nothing wrong with the aesthetic or general feel of the movie. However what made me think I had just wasted around an hour and a half of my life came down to what perhaps one call kindly relate to as continuity issues.Timing is everything, however the timing (no spoiler here, hence I won't elaborate) was so bad, so completely improbable, that it effectively ruined the plot. I'm all for a movie that involves you, irrespective of improbability for example with how a person is injured badly but is fine soon after.You can put those things aside if the movie is good and the action great. However it appeared to me that the writer or director was simply looking to pad out the movie."}, {"id": 255, "text": "As with many of Willis's movies in the past few years, most have been straight to DVD and unfortunately utter trash. This is slightly above some of his more recent movies, but it is still a low-budget and disappointing affair.Even despite my low expectations for this movie, during the beginning, I was surprised at the shockingly bad acting from the wife and protagonist, and also the kid. How the director allowed some of those cuts of the wife around the kitchen table to make the movie is beyond me, her expressions and acting were beyond bad and noticeably some scenes almost appeared as if they were an outtake or she herself figured it might be an outtake whilst acting, it was that bad. Similarly, even Willis let the show down with his attempt at crying in bed.The editing and cut scenes were brutal at times. So much so that it lends to a lack of complete discontinuity, to an already simple plot. The one saving grace in this movie were the brothers - in particular the crazy on-edge brother - it was a fine performance from him, especially considering those around him had no charisma to work off.The rest of the movie plodded along, until a point where I had to turn it off. Not recommended if you have any ounce of intelligence, skillful direction, and enjoy subtle plot-lines and fine acting from each and every character."}, {"id": 256, "text": "REVIEW - SURVIVE THE NIGHTIn these reviews I sometimes mention the issue of lazy writing something of which I simply can't understand. If you are finding a film this can and does cost a lot of money so why create a film which is just lazy writing?Unfortunately this film is yet another example, from people just not bothering to pick up guns to defend themselves, escaping and being captured in quick succession but simply the biggest issue with this is that one of the guys doing the home invasion is simply a nutter killing people for no reason at the start of the film and then with ample opportunity later in the film suddenly not so the story can play out.90 minutes long and 60 minutes too long with those 60 minutes filled with setting up the evening and not much else. Such a shame because as with other films which suffer from lazy writing this could and should have been much better but......Rating 4 out of 10"}, {"id": 257, "text": "Once so popular as he was Bruce Willis nowadays spitted out by Hollywood en his best friend (Expandables) due his difficult character and demands. But hey, I thought, I give him another change becaue he was a hell of an actor and made some classics.Sadly he isn't the main lead here and to make it worse, the flick itself isn't good. It starts all well and full of suspense and action but once at the house were they all try to survive the night this flicks become lame and slow.Towards the end it do pick up a bit due the Dodge Charger and the end scene but it's too late. On the other hand, the open leg surgery, no pain at all while his leg is open for hours, don't think so.The further the movie went the more I was grapping for the remote and push the stop button. Do I need to say more? Gore 1/5 Nudity 0/5 Effects 3/5 Story 2/5 Comedy 0/5"}, {"id": 258, "text": "Well, Survive the Night is not a movie, it's garbage. This is another one of those movies you find on Redbox and Netflix. Except someone bought it on Blu-Ray and me and my family watched it. Those are 90 minutes I'm never getting back. Why buy it on Blu-Ray anyways? The cover is not that great anyways.Well, what is this film about? It's a family held hostage in their house by two robbers who happen to be brothers. One of the family members is a doctor and he is forced to help one of the robbers who is seriously injured. It's like Trespass with Nic Cage. It's a home invasion film. Everything is dull about this film. The story is uninteresting, you don't care about the actors and to be honest, it's a boring film. Not to mention the video for the Blu-Ray looks ugly. It's yellow and orange and I don't like it. Bruce Willis is the one you're cheering for but he doesn't really help the family. The doctor is not that good. The two robbers are idiotic and I couldn't care less when they died at the end. The family is ok acting. Just a really ugly looking film and a forgettable one.Overall, Survive The Night is a disposable film. I can't recommend this. Please do yourself a favor and don't watch this. You can watch more excellent movies on Netflix and other streaming platforms. This was a waste of time. A big one, that is."}, {"id": 259, "text": "Bruce Willis Yippee Ki-yay days are long gone. The action star of mega hits like Die Hard, The Last Boy Scout, The Fifth Element, Armageddon, The Sixth Senseand Red is no more.Like Steven Seagal and Nicolas Cage he has reduced himself to cheap direct-to video productions, one even worse than the other.Survive the Night is no exception: extremely badly written with cardboard characters who do the most stupid and illogical things. Their actions are laughable at best and the story seems to drag on forever since the limited screenplay is only good enough for a 25 minute TV-soap episode.It's frustrating to watch Bruce Willis doing absolutely nothing after two bankrobbers kill his wife. One of them is injured badly so there are plenty of opportunities to take out the one single bad guy. Instead we get a ridiculous roadrunner cartoon of being tied up, escape, being tied up again. And speaking of the injured criminal, he has an open leg wound that is fatal within an hour, but somehow he survives right up to the end of this wretched tale.In Willis' defence, this is not his worst performance to date. That razzie award goes to last years' stinker Trauma Center where it was hard to tell if he was even conscious at all. If I knew beforehand that Survive the Night was from the same director, I wouldn't even have bothered. Just call it a friendly warning because it's 90 minutes of your life wasted you won't get back."}], "reviews_amount": 260}