{"name": "The Rental", "titleId": "tt10003008", "reviews": [{"id": 0, "text": "When watching such films, you are kept glued to the screen because you want to know who's doing all this and why. And when you find out it's a nameless, faceless person with no motive whatsoever, other than this being his hobby/full time passion, it renders the whole movie a waste of time."}, {"id": 1, "text": "A generic, pointless and anticlimactic movie that fizzle out into nothingness. It always amazes me when people get a shot at making a full length movie (in this case, Dave Franco) and when they don't have anything new or good to bring to the table. Then why even bother? A waste of money, time and talent (Stevens and Brie.)"}, {"id": 2, "text": "I wanted to like the movie, but sadly it's been done before and better with the movies in my title. That said the cast is great, I think Dan Stevens is one of the best actors around.So In my opinion it just doesn't do anything new and the ending was also poor, let's hope Mr Franco can come back with something a little more original next time."}, {"id": 3, "text": "The first half was about relationships that I couldn't care less about, and the other half some sterile killings, like slaughtering animals. And once again no conclusion. What is the director trying to do? Propaganda against Airbnb, so that people use agencies and pay their taxes?"}, {"id": 4, "text": "It was decently directed by Dave Franco and the cast is great but the writing is a bit meh. I will never understand why people like to hide bodies, avoid cops, get crazy over hidden cameras but also not want to solve the situation. So many things could have gone better but the characters are always dumbed-down for entertainment or story progression. Also who murders someone (or believe they murdered someone) and gets rid of the body but then gets upset over their partner cheating? Like hello your short temper just almost killed someone and you are ready to fight again like have you not learned your lesson? He easily would have killed his brother and girlfriend and dumped their bodies too with that short temper of his."}, {"id": 5, "text": "Two brothers and their significant others spend a weekend in a beautiful beachfront villa. What could possibly go wrong?Dave Franco does a decent job for a first time director. The Movie is beautifully shot, atmospheric and moody as all hell. The cast is awesome, I always enjoy Dan Stevens and he's a delight here, but so is everyone else. I almost loved this movie but sadly the whole thing falls apart in the third act. Its as if a tense thriller is interrupted by a slasher film and its as abrupt and awkward as it sounds. That said the movie does not go where you expect it to and it is shocking and surprising."}, {"id": 6, "text": "Way better than the ratings. It keeps the intrigue for the first part and the rest has a good rhythm. Pretty decent directing by Franco. I don't see it lower than at least a 6. It is one of the lowest ratings compared to the quality of the film I have seen in my whole life."}, {"id": 7, "text": "I didn't like a single character in this movie. A complete waste of talent!!! The characters were boring, stupid, selfish, and immature. I had really high hopes for this movie. It was pointless. Absolutely no closure. I didn't care if a single character lived or died. There are soooooooo many wasted moments that leave you wandering why. They should have used teenagers. At least it would have justified their stupidity."}, {"id": 8, "text": "Whilst this is a decent effort for a directional debut with a constant feeling of tension and uncomfortability, the R18+ rating and horror genre classification seems misplaced.There's a real longing for a decent new horror film, and this isn't it.If you've seen every other horror film and have nothing better to do with time to kill, then give this film a watch... but if you don't get a chance to watch it, you're not really missing anything great."}, {"id": 9, "text": "My oh my...The beginning is kinda OK despite the unpleasant characters and the empty dialog. But it takes a long time for anything to happen, and when it happens it is so cliched and anticlimatic one wonders what the writer was thinking about.The ending is one of these facepalm moments when one realizes that one has wasted precious time on a bland, toothless, generic pseudo horror film.The Rental is a semi-slasher film where instead of idiot teenagers being killed one by one after doing stupid things we have four woke grown ups being killed one by one after doing stupid things. The difference is that in The Rental all the killings occur in the third act.It is not worth your time."}, {"id": 10, "text": "This movie is just awful, I don't know what anyone working on this film thought they were making but the plot twists are ridiculous and only come about as a result of them all doing the stupidest stuff. It might have made more sense with a younger cast because between the affairs, drug use and childish attempts to hide crimes it was nonsense."}, {"id": 11, "text": "Two couples go for a country outting, hell ensues. You've seen it all before and this tired, oft-rehashed lukewarm not-so-scary horror fare will add nothing to your knowledge. Watch it if you're dead bored with your life. Or not. Yeah, better not."}, {"id": 12, "text": "This movie is gonna be underrated and it shouldn't be! I am such a fan of Allison Bre so I was excited to see this movie considering it is Dave Franco's directing debut. I was not disappointed in the film. It starts off pretty slow, but halfway through the movie it gets so much better. Unpredictable flick. I was the most impressed with Shelia Vands performance and I'm excited to see her take on more mainstream roles!"}, {"id": 13, "text": "Honestly, I was expecting more from Dave, there's a lot of wasted talent in this film. I kept an open mind about it, but overall was poorly executed. If you want something similar, but better I recommend 13 Cameras, Open House, and 14 Cameras. The only good actor was reggie."}, {"id": 14, "text": "Even though the film is a long way from being perfect, I think it can defenitly open a modern slasher franchise, with great and uniqe storytelling for this ganre. I'm really intrested in what Franco can further do with this concept. Dear Dave, if u see this - please, I want a sequel!"}, {"id": 15, "text": "It's a complete waste of money. All this above 4 stars (those are paid promotions). Very very bad and cliche story. Too many holes and too much nonsense."}, {"id": 16, "text": "Don't waste your money on this terrible clunker! What a waste of talent because the cast is top notch. The script is subpar and the story ridiculous. It was beyond amateurish.So sorry Lip, Trudy and Matthew. Wink!"}, {"id": 17, "text": "Overall I thought it was great! It was gripping, the storyline was solid and atmosphere was on point the whole way through. Would definitely recommend if you liked The Strangers and You're Next."}, {"id": 18, "text": "Two couples, cabin, weird land lord, cheating, death and no explanation, the end. Do not watch, anyone positive about this piece of feces is brain dead. Avoid like the plague!"}, {"id": 19, "text": "It's pretty good. It's very slow. Some interesting character drama in here. There's a little twist at the end. Nothing very scary, but nice tense atmosphere at times. It's fine, no problem if you watch it! It's pretty good."}, {"id": 20, "text": "I don't usually write reviews but this movie deserves one.Shallow characters with shallow motives + cheating nonsense plot to justify the characters' fear to call the police. I mean, what? The only thing that kept me going was the idea that I would get to know who this MyStErIoUs KiLlEr was, and not even that this movie gave me.Just a plain waste of 89 minutes of my life. Don't watch it."}, {"id": 21, "text": "Personally very much disliked the ending, would've rather seen some more story to it. Also poor Michelle."}, {"id": 22, "text": "Very predictable and nothing special. Been done plenty of times. Scenery was great acting was okay and story was terrible. Loved to see Lip again."}, {"id": 23, "text": "The build up is not bad. Ending a little disappointing. While we try to figure out who the killer is, we dont get any answers in the end. Thats frustrating. I get it, some faceless psycho just like to terrorize people like the ones in The Strangers. Keeping it mysterious and maybe making a sequel if ratings are good..."}, {"id": 24, "text": "What a bad movie, i dont understand it. Not a moment of tension. And i dont even know who the killer is?Dont go!!!!"}, {"id": 25, "text": "I made it halfway through the movie and gave up from it being super boring and cliché. Foreshadowing cheating couples.. really?.. The hot tub scene was super cringe. I expected more from one of the Francos. You are a normie Dave."}, {"id": 26, "text": "Terrible story....... If there are 5 characters and all 5 die, you don't know or care who the killer is!"}, {"id": 27, "text": "I have respected the film makers much more during the pandemic. We definitely need them. And I really had high hopes for this movie. Set-up was very well; a remote house, friends getting together and a killer on the loose! Tell no more, i am sold. But unnecessary dialogues, pointless character developments took forever, and the last 10 minutes some weak killings! Thats it! The whole mystery behind the killer was just comical. As if the budget came tight and they had to squeeze the real movie into this one."}, {"id": 28, "text": "We've all been there before, seen that before, copied that from any D grade horror script. Gawd, if your going to do something, do it good, or don't do it................"}, {"id": 29, "text": "Nothing made any sense, all the conversations seemed pointless and lacked depth and-or witt. They mostly just fought over weird stuff that didn't add any development to the plot (if there was one) or the characters.No resoulutions or consequenses to any of the issues they create/encounter throughout the movie. They created dilemmas, but no epiphanies... They just kinda ended the movie lolGood actors wins an extra star."}, {"id": 30, "text": "The Rental tries too hard to be something it's not and let me tell you, it's not a great effort.In this horror film, two couples on an oceanside getaway grow suspicious that the host of their rental house may be spying on them.Co-writer and director Dave Franco attempts his hand at being a filmmaker in this somewhat horror, maybe a thriller flick, and I felt absolutely nothing throughout. The four characters are one more annoying than the other and the overall The Rental is a flop. How this film is doing well amongst other critics is beyond me. The final outcome also raises the question; but what's the point of all this?. I won't break my head to find out.Follow @snobmedia for more reviews!"}, {"id": 31, "text": "This was really good. I'm not a psycho or anything 😂 but finally I was craving for a movie where the serial killer gets away with it and Kills everyone. As far as storylines it would have been better if he was the Dexter type, out to get bad people, cheaters and so on. I never got bored and enjoyed it a lot."}, {"id": 32, "text": "The movie is very slow events, the characters aren't that interesting, normal people with drama, it has a drama all the way, fighting, and mysteries, but I wouldn't say I was not interested to know what behind the door, with the code which is locked but moving on, at first, they were going in some far place to have some holiday or relaxing or whatever, not sure why they go to far place that no service there, or anything, it's like they want bad things to happen to them, anyway, I wouldn't spoil the end of the movie but many things which are not natural on the story and atmosphere here, well at the end it's a good movie to waste your time end, it wouldn't last a day or two remember this, as it's not going to hang in your memory for much of time."}, {"id": 33, "text": "It's about a group of four friends who decide to spend their weekend in a rented mansion, oblivious to the chaos that follows. The plot was a bit slow placed, nothing really petrifying or eerie takes place into the first 30 minutes of the film. Mediocre acting by the cast which was subdued by an intriguing plot. Well, I expected a lot from Dave Franco and he could have done better. The ending however was startling. brownie points for that! In nutshell, it's an enjoyable one time watch, so show some love and support for Davey y'all as it was a great attempt at making a thriller!"}, {"id": 34, "text": "This movie could have been good. But. Then there was no plot and no ending. Just a bunch of starters that you want to follow through, but end up leading nowhere. After watching it, I still cannot answer those questions?: who's the killer? Why is he/she doing this? What's gonna happen next? Why are the characters all imbeciles? I just don't know what this movie was about? A bit disappointing."}, {"id": 35, "text": "I don't understand the negativity here. This is a great crime movie. One that could even lead to series 2. The monotone and yet intense mood, that's very hard to portrait via screen but they managed to do it here. Not many crime movies or horror movies can do that these days. Perhaps low rating is because they watched this movie during day light? Classic inexperienced mistake."}, {"id": 36, "text": "I'm sorry, $crew the haters. D. Franco 👏 This was good!"}, {"id": 37, "text": "Dave Franco should stick to stupid dude bro movies"}, {"id": 38, "text": "I was actually rooting for the bad guy. The characters, minus the wife, were so horrible that I honestly could not have cared less if they died. I love James Franco, but this was so terrible."}, {"id": 39, "text": "I don't even know what I just watched. A bunch of stupid people do stupid stuff for stupid reasons and nothing makes even a little bit of sense. Just save yourselves the trouble and literally watch anything else."}, {"id": 40, "text": "This movie was bad. It starts bad, and it ends worse. The acting is so-so...predictable story. Honestly...the best part of this movie is the French Bulldog and he only appears three or four times. If you are planning to watch this movie, just think back to the last movie you wasted two hours of your life watching and then go do something productive like clean your bathroom, bake a cake, or spray for ants. When I read the reviews for this movie, Ifeel like I live in an alternate reality where there are no decent movies being made. Perhaps I traveled through time and I am the only one that remembers what a plot is and it's no longer important to today's movie-goers. I think, What if no one remembers movies from my time... I grow sad, but then I realize that I can still access these movies with my special time travel dvd collection of amazing movies. I fear talking about these because if I am traveling through time, maybe I don't want people to know...reading this is probably making you scratch your head. That's what this movie left me doing...I heard Dave Franco wants to leave us guessing at the end because PLOT TWIST the dude doing the killing is a former renter. Wow! That had to take hours or seconds to come up with that brilliant storyline. Honestly, this gives me hope that all of my ideas for writing a script will be the next Harry Potter or Star Wars series of blockbuster movies. I mean...as long as they're allowing this guy to direct movies any one of you reading this right now have a shot at fame.Honest Y, Dave Franco should quit this job and spend the rest of his time renting actual houses in Oregon. Cheerio!"}, {"id": 41, "text": "It really annoys me when people get drunk in these movies and drink in spas and pools.So dangerous.This movie could've been much better.The people in the story were not aware of their surroundings and were annoying.I switched off .Not my kind of movie."}, {"id": 42, "text": "I've had more fun watching water boil. I can not believe anyone thinks people want to wait an hour for anything to happen in a movie. Why even bother making it? One if the worst movies I've seen at the theater. Not worth a watch for any reason,"}, {"id": 43, "text": "I liked it. The premise is of course not especially original (some friends for the weekend go to a vacation house and are being harassed by strange phenomena and brutal force from un unknown source), but within this genre it's a fine movie with a solid story and pretty good acting. All four characters get some personal depth, the tension is slowly being built up and when things definitely go awry the pace is high and the violent goings-on are pretty scary.After the climax of the movie, there's some sort of epilogue that in a calm and matter-of-fact way shows how things can (and will) happen again, with the cynical message that it can happen to any of us. But this takes like five minutes of very slow images, so after all the turmoil it feels a bit as an anti-climax. Although partly incorporating the closing credits in these images was a nice touch."}, {"id": 44, "text": "OK so I was digging it, until the ending. That was the worst ending that I've ever seen that I can remember of &amp; I have seen a lot of movies. I think Dave Franco do not understand the meaning of the word Why. Why did the killer killed everyone why, there is no answer. I am sitting here like I could have watched absolutely anything but not this. Anyone reading please do not waste Ur time. Everyone's time is valuable. This movie is just a complete facade. Dave Franco just don't do this. I have never felt so strongly about any movie before then this one."}, {"id": 45, "text": "It's a slasher movie, is what it is. Friday the 13th? Halloween? Prom Night? Hundreds of others? This film is PRECISELY like those movies, complete with crazed, faceless killer stalking the young, good-looking cast in and around a wooded cabin (or rental house, in this case) and picking them off one by one.Allison Brie is a good actress, and does what she can in the thankless role of an initially loyal, then confused, then hysterical young wife. But she is the movie's only saving grace. It sure isn't imaginative, or believable, or scary.Again: It is EXACTLY like those slasher movies of yesterday, but with a lower budget, crummier photography, and more modern, millennial pretensions (e.g., the subject of racism is addressed, naturally).This film is actually getting some pretty good notices. Now THAT'S terrifying. The only explanation I can think of is that commercial filmmaking (and audience expectations of what a good movie looks like) has degraded dramatically in the last 25 years. Literally nothing else could account for it."}, {"id": 46, "text": "It feels like such a huge waste of time when you finish this. Do yourself a favor and skip this."}, {"id": 47, "text": "Biggest waste of time I have had in a long time watching a movie. The acting wasn't terrible but there is no substance to the movie at all. First half of the movie you wait for something to happen and it never delivers. The story is just bad. Sometimes the ending can redeem a bad movie but not this time. Might give this 3/10 for acting at least, but since the overall score is so high (5.8 atm), it has to be lowered so people don't think this is worth their time. Sorry Dave Franco, try again. Or don't."}, {"id": 48, "text": "... and then it just turns into a snuff hidden camera movie that you've probably seen 10 times already. So generic."}, {"id": 49, "text": "Yet another serial killer and he gets away with it plot. All except the serial killer dies in the end - no one escapes. The movie ends with scenes of new couples waiting to be trapped and killed. Serial killing as some kind of career-choice. It's not shocking anymore - it's just starts to be a little repetitive. I'm beginning to long after the traditional endings where justice actually prevails. As always a lot of things could go wrong with these set-ups in real life. But in the movie-script everything runs smoothly according to the serial killers wishes. Of course.Besides above, it's a reasonably good run-of-the-mill movie in this genre. But should perhaps avoid the premium cinema price-tag - wait for a cheaper rental price instead."}, {"id": 50, "text": "Kept me entertained from start to end. Don't watch the trailer. Go in with an open mind and you'll enjoy it. Creepy stuff.👏🏽👍🏽"}, {"id": 51, "text": "You're not missing anything groundbreaking, but it's worth checking out if you're out of other ideas. Acting is solid, but the characters aren't written to be particularly likable in the first place. Much of the tension isn't created by anything scary, as much as it's created by the characters' bad choices and relationship problems."}, {"id": 52, "text": "Honestly people are giving this movie a low rating for nothing. It's their opinion I know, but here is mine: The film kept me watching the whole time without a second of boredom and that's a very rare thing these days. I liked it, what can I say? Yes, it's been done before but this movie is well directed and it has a slow but really catching pace that makes you want to see the whole thing. The 4 main characters are well written and it's impressive how I didn't want a single of them to die, most of the time in horror movies there are characters that are just annoying or don't have anything to add but in this film everyone plays an important part in building up the tension. Overall I would say give it chance, maybe you'll enjoy it as much as I did."}, {"id": 53, "text": "There will be a couple of spoilers in this.So two couples rent an overly expensive 'beach' house for a weekend. Of course when they arrive, one of the women(Hispanic i presume) makes a big deal of the fact she wasn't accepted but her 'brother-in-law' who attempted a booking minutes later, was. From then on she claims the guy who rents the place is a racist, because...well, it's 2020. Of course our protagonist's girlfriend is neurotic and paranoid throughout because...well, she's a woman. Drama unfolds because otherwise it would just be two couples at a 'beach' house, there literally is no other reason for it. and then murders start to happen, because something has to at least attempt to put some life into this. Of course there's the well known trope of killer manages to wipe out everyone with total ease other than the last 'victim' whom he has to have some kind of struggle with or it's not a psycho killer film. Yeah this was ok, no better than that, no worse. There were no surprises, nothing shocked, nothing happened that you couldn't have seen coming if you've watched any 'isolated' horror before in your life. All boxes were ticked, it's just getting really tiresome now though. There's so many scenarios which could be used in horror, but we keep getting force fed the same bland fare time after time. Look, if you like bog standard horror films, knock yourself out...maybe even literally, it might make this a bit more dramatic and enjoyable."}, {"id": 54, "text": "Definitely worth a watch! Confused to many of the bad reviews. If you love Jason, you will live this movie!Enjoy!"}, {"id": 55, "text": "Movie was gripping but in the end you didn't get a clue who the killer was"}, {"id": 56, "text": "Terrible ending. Used every typical horror trope unironically. No pay off in the end. Dan Stevens was good though."}, {"id": 57, "text": "Dave Franco's directing debut Oh wow! one of the worst movies of the last decade, a stupid story we've all seen at least a hundred times - covered with a new, actually, not covered in anything, just a plain copy of other films - only done so much worse, so so much worse.... there is not character drama, and all the trnsion that is built - is wasted. the mindless director creates a character and gives this character abilities that turn out to be - surprise surprise - useless... Garbage is a better description than the one that this movire really deserve. Don't they know that a movie is about telling a story?"}, {"id": 58, "text": "This is definitely an enjoyable, immersive horror film especially for those who are staunch fans of the genre. The ominous and tense tone will keep your attention and the acting is absolutely solid which is no surprise considering the actors are all very talented and have skills exceeding those needed to master this film's particular roles. The overall concept centers around a fear that is nothing new in horror/thriller films, however Dave Franco adds some fairly novel twists that makes this movie stand out. Some may complain that the conclusion isn't neat and tidy - but that's something you get used to in with horror, and in this case, it works."}, {"id": 59, "text": "Dont waste your time...boring build up to a storyline that has been done before....many times."}, {"id": 60, "text": "Biggest waster of 1 1/2 hours eve r. Bad novice acting and dead ending in a nice beach house.."}, {"id": 61, "text": "Movie is rated as a drama/thriller more of a horror Does not even ahow a good ending,no direction,no storyline"}, {"id": 62, "text": "This film start with a man Charlie talking with his brother's partner Mina about the house at the coast, and Charlie chat with his wife Michelle at the house scene! As turnout, this film is about a man disguise himself with the human skin mask, spying on the house rent by Charlie, and he eventually decide to kill all the people live in the house! Entire film full of boring conversation, and overuse scene! Such as, overuse of the jump scare scene, overuse of the bathing scene, and overuse of the searching things scene! Make the film unwatchable! Barely intense scene is, the human skin mask mastermind stab Josh at the head with a hammer to kill him! At the end, Charlie, Michelle, Mina, and Josh all die in the film! Still have a spy cam video footage appear with the end credit in it! That's it! Wasting time to watch!"}, {"id": 63, "text": "All you need to know ..good movie, a just watch it and no thinking type of movie, enjoy a glass of wine, great setting and creepy atmosphere...Reggie is great ! And when you watch it you'll never rent another Airbnb again !"}, {"id": 64, "text": "It was a good try at being creepy / disturbing, but it never really got there. Ending was weak."}, {"id": 65, "text": "I'm being generous with the 2 stars, but the scenery was really beautiful and there was some nice camera work.Other than that?The dialogue, which half consisted of 'bro-isms', was empty at best. There were clunky scenes where the characters tried to fill years of backstory in a single conversation.There were two very different, very distinct plotlines that never came to any sort of conclusion.We ended up with another faceless killer with no known motive other than the fact he loves to kill people in his spare time? There was a passionless affair that was disappointing considering the tension build.In short, this movie is about 4 very unlikeable who get murdered in a holiday home. And to be honest, I can't believe old mate waited a full 48 hours before he came to murder them."}, {"id": 66, "text": "I loved it. It was quiet, understated, and ruthless. The cinematography was fantastic. It had a distinct foreboding but was really pretty. Really great acting."}, {"id": 67, "text": "Hated every second of this troglodyte of a film. Unlikeable horrid characters - Generic plot - Lack of anything even resembling what makes horror good in the first place. Not even Dan Stevens can save this worthless tripe. Skip it entirely And save yourself 1 hour and 27 minutes"}, {"id": 68, "text": "A psychopatic who love spying on people and killing them ,without even know who he is or what made him do this things. What a waste of time, character development was entertaining but there's no resolution to any of the stories. It was like this killer fell of the sky. It was so random. The deaths are not even good. Boring ending and nothing new. Movie is trash. No explanation on to why he does what he does, his identity is never revealed. I could understand if the guy killed because he saw the renters do something work cheating . Movie was extremely slow, build up was lacking."}, {"id": 69, "text": "This movie is about four empty characters, it's impossible to care about them, and considering it's 90 minutes of them in a house, it's a big problem...Luckily, there's a decent plot and the actors are doing a good job, which makes it watchable. You do want to know what's going on.Sadly, the ending is very disappointing."}, {"id": 70, "text": "Yeah, and he needs to finally pay attention to what makes a story addictive, or at least entertaining. The character arcs are weak, so sure enough the plot ain't there. We felt like when you catch a sci-fi movie on tv about a pixellated sabertooth messing around - you can't help but say it can't be so bad, it has to be on purpose, now throw some cubic shark in the mix... Same with The Rental, we were convinced there was going to be a punny twist or something that would justify it was in the box office. Nope. Never happened. By the end, Franco even teases us (see how I still give him credit after a whole movie of not knowing how to go anywhere?) with a cute payoff. But it seems by then everybody was too tired and broke from the nonsense. You do exit the theatre not being able to believe you just paid for that."}, {"id": 71, "text": "Overall.. the actor is very talented, the plot was very good, the sett and angle it was prety brilliant, in the a hour im prety sure the movie was end closer too beyond my expectation, but why not really seriously for the point? but not really bad for the firs time Dave Franco.. congratulation, will be wait for the next movie!!"}, {"id": 72, "text": "This movie had my wife and me on the edge of our seats the whole time. It opened with multiple potential conflicts so you didn't even know which was going to come to the forefront. In the end they were all explored AND there was a high level of tension the whole time. I don't know what other people look for in horror/suspense but this movie was well written, acted, paced, and much more than I was expecting from all the (excessively) harsh reviews on here."}, {"id": 73, "text": "10/10. I love everything about this movie. It keep me engaged from start to finish. I dont know the real reason why many reviewers gave 1 out of 10. They may find the movie fallen into neither pure horror nor pure thriller, to me, it is a true modern combination style of Thriller plus Horror. Or maybe they dont like the affair storyline which ashamedly reflect their real life."}, {"id": 74, "text": "The first 3/4 of the movie was great. Slow paced but great tension and the characters really lifted the story. Too bad the last part had to be totally different and became an average slasher horror like so many others and the same ending like so many other slasher horrors. In the end i liked the movie but it could have been so much more if the sticked with the writing part of the beginning."}, {"id": 75, "text": "I really don't understand what most of these people are talking about. Once again it seems that neckbeards and basement dweller virgins are negative bombing something the Franco brothers, do out of envy.The movie begins with two couples on a retreat, the characters are genuine, in the sense that we all know people like this (if you have ever had college friends). The movie goes on threough their common and expected issues between couples and friends before it takes several twists and turns that leave you wondering where is this really going to go.After the troubles with the landlord we are left uncertain to his involvement in everything that's happening, and that's when we see the real antagonist, a serial killer who kills, if for nothing else, out of pleasure. This guy is no nonsense, he doesn't play with his victims nor does he take 30 mins to track them down (looking at you Jason Vorhees) and the best part is that, unlike every single other slasher and scary movie, this guy doesn't get killed by some random teens.We later see that this is a regular activity, his MO is shown to us throughout the credits while he takes on other victims.Being filmed, mugged, killed or just be subjected to any kind of danger is something that is always in the back of our minds when we go to a hotel or to an airbnb, Dave takes this fear and shows us the worst csse scenario.My only criticisms are first, that there are some scenes that feel too much like fillers, I feel that there could've been a bit more character development and second, some of the suspense sounds were a bit too much for me, it made it feel cheesy."}, {"id": 76, "text": "I enjoyed this and thrillers are my thing. Took a while to get going but it had all you expect from 2 couples and a remote holiday house. Add the crazy mysterious killer who you goes all out towards the end. But overall it had me not able to take my eyes off the screen and thats all i can wish for in a thriller. Quite realistic not a bad effort from Franco. Its defiently not a 1 min a 5 at least. Does not deserve the rubbish reviews ive seen plenty of really bad movies and this isnt one of them . Give it a go."}, {"id": 77, "text": "Although not a genuine horror movie theme, however it is a very good movie, atmospheric and with a great acting! Keeps you on the edge the whole time..."}, {"id": 78, "text": "Run of the mill 2 couples go to a fancy cabin and things go awry.usual characters, ex con looking to make a fresh start, mousey sjw of ethnic origin, white girl from privledge, cheating douch bag trying to convince everyone around him that he is a good guy, and the borderline creepy landlord.starts out the usual way everything looks fine, then the cracks appear, dog goes missing and then the ex con over reacts, then some mystery guy ends him.then it decends in to cliche ' we got this no cops cos reasons' and each one is picked off in pretty boring basic ways, no reasoning beyond 'i can' and i'm psycho. then the villain just cleans up and starts over.done before done better, done worse, save your money and skip this, and to those reviews who say ' oh people don't get it. maybe it's you #iamverysmart types who actually don't get how bad this movie is!"}, {"id": 79, "text": "All they know is how to construct waste of times. It's really boring foul movie. If Dave Franco thinks that he's ready to make movies then this movie is a proof that he isn't."}, {"id": 80, "text": "I just watched the Rental and I liked it even more than I expected. I saw the meager rating on here before I started the movie and I went in with low expectations, but I was more than surprised, especially with the ending..As soon as the credits rolled I knew, clearly, why people have an issue with this movie. It did two things that turn off mainstream audiences, but I actually find refreshing. 1. It took its time and developed characters, whether you found them likable and care whether they live or not, is subjective. 2. The ambiguous ending. There was also a third component; not a storytelling device, but a plot point and turn in the story. 3. Why wouldn't you just own up to cheating and call the police immediately?Who was he?!! Why do we need to know anything about him or why he does what he does? Isn't that more frightening? Did we need confirmation that he did, in fact, have a heinous childhood? I think it was clear that this person is a psychopathic murderer that preys for pleasure and sport. The faceless killer (and winner in the end!) doesn't need more story. If you were secretly observed, stalked, mentally tortured and ultimately murdered by a masked person, you would never know who they were or why they did it.Some people say, it's slow and went nowhere. I disagree. We got to know the characters, infer their personality types, and see their strengths and weaknesses. Why didn't Charlie &amp; Mina come clean, admit their mistake and save the day? I don't know, maybe they're self-centered narcissists? Sometimes unrealistic decisions can be picked apart as a plot failure, but in this case I think that's just who those people were. They'd rather gamble and protect their assumed respective appearance. You don't have to like and respect all characters.Also, they did a great job capitalizing on a contemporary trope with Airbnb. This may have already been used in another movie at this point, but I thought it was a great choice, especially for a confined horror film. How much is staying in a strangers home worth it for the price and location?Great job, Dave Franco. I was skeptical but I'd definitely check out another horror flick he does."}, {"id": 81, "text": "I'm not sure why this is getting such a bad rep. I enjoyed it. Yes it was kind of slow, but this is more realistic than 90% of horror movies."}, {"id": 82, "text": "Not creative; same old story of several people renting a remote house where bad things happen to them. So many done (many times) before scenarios. Starting with opening scenes of future victims driving in car on their way to the inevitable. The only question is how many survive, and as always some more likable than others. Usual cliff by the ocean for you know what. Not believable were the unlikely technical use of cameras; the lack of disappearance investigation. Usual poor decisions. The ending was very unlikely dumb so must be setting us up for a sequel."}, {"id": 83, "text": "Quite enjoyed this one. The cast is comprised of talented and under-rated actors, and the plot is especially superb. It was a modern spin on a peeping tom. It felt real, and relatable. Yet I have to mention a previous review mentioning a flawed third act. I can attest to this, as I felt that it had a rushed ending. I almost wish the story spent less time on character development (although still integral), and more time on the tension build up throughout. Still really enjoyed the film, it makes you feel a little more aware of your surroundings, and it definitely fulfilled my horror quarantine fix!"}, {"id": 84, "text": "I cannot get around of how unlikable almost everyone is and then the  I know what you did last summer plot What the f..."}, {"id": 85, "text": "While the performances ensure that the movie is always watchable, the hesitant storytelling makes it far from compelling, a bad trip about a bummer vacation. Did not really care for this one. James Welch Henderson, Arkansas 12/14/2020"}, {"id": 86, "text": "It can never happen again. Yeah but it surely did. I rented The Rental. It's a nether thriller by James Franco's brother Dave and yeah, I never knew the dude was even a director. Not great but not too bad for his first go-around.Anyhow, 2020's Rental is my latest review. It was released in July of this year and was shot in the lush cities of Bandon and Portland, Oregon. In truth, Dave Franco knows where to put the camera in regards to The Rental. He creates a flick that is somewhat Hitchcockian, somewhat Brian De Palma, cloaked in frankness, and darkly atmospheric in its tack.Watching Rental, you might think twice about spending time in a seaside home for a weekend. That's especially if someone is secretly filming you making dampened whoopee in a shower (yikes).Starring Jeremy Allen White from Showtime's Shameless, featuring a disarming closing credits hook, and running a slight eighty-eight minutes, The Rental possesses two unlikable characters that are nonchalant about the concept of infidelity. One of said characters is even cheating on his wife with his brother's would-be girlfriend. Talk about cutting it close (ha-ha).So yeah, Rental is all about sardonic friction from the word go. The problem is that its antagonist is unknown, speechless, robotic, and without any clear motive. Who is this Mr. Clean-style killer? What is his stone-faced deal? And why does he feel the need to off some la-di-da millennials along with his D-bag associate?The Rental chronicles two couples who rent a home and are terrorized by a veritable, invasion of privacy wacko. This wacko also runs like a deer and seems palled on because he doesn't have anything else to do. Me, well if I'm in the lurch I write reviews just like this mixed one. Rent-a-cop-out."}, {"id": 87, "text": "Better than many movies we have seen, however the ending sucks. Lip and actors were decent. Oregon coast is gorgeous. Glad we rented it on Redbox instead of paying for prime video."}, {"id": 88, "text": "The many one-star reviews here provide an interesting glimpse into popular taste. Apparently, a movie about psychopathy is supposed to end with some Scooby Doo unmasking, where the crazed maniac who has just murdered the entire cast unmasks himself and reveals some perfectly reasonable, linear motivation for his behavior which, upon looking back, the viewer will realize has been cleverly foreshadowed by the filmmakers all along. This is the convention--oh, so that's what caused all this mayhem!--and of course it's sometimes satisfying, but more often than not it renders the film cheap, tidy, and forgettable. And the lengths filmmakers will go to in order to sufficiently shock you--the red herrings, the duplicitous sociopath best friends--is often quite awful. It's been decades since I saw the original BONE COLLECTOR movie, but I'll never forget my bafflement and utter disappointment when the big twisty reveal happened and all I and my companion could think was, Who the heck is that? Honestly, it would have been better if the killer had just been a random person.Which, I'm pretty sure, is how serial murder often works. The idea that some narrative bow is going to tie everything up at the end of a bloodbath is, well, disrespectful to the victims of the unfortunate number of real-life bloodbaths this country bears witness to. Sometimes people are just violent and deranged and like to watch people suffer, and though they probably have reasons for their behavior, that behavior probably has little or nothing to do with their victims. Would it have made things better if you learned at the end of THE RENTAL that the killer was the caretaker's brother, and that he had been cheated on by his wife, and that that's why he murdered anyone any time he witnessed a sexual transgression? Would that make it okay? Would that make their murders sensible and satisfying?That said, this isn't a great movie. I like the fresh, anarchic randomness of the conclusion, and Toby Huss and Jeremy Allen White are standouts in the cast, but the screenplay suffers from some implausible depictions of psychology and behavior--which is to say, too often the characters make choices that just seem terribly stupid and unnatural, and it seems like they only do what they do because the plot demands it and not because actual people would behave that way.So, yes, this was neither an excellent nor an awful way to spend 89 minutes, but anyone suggesting that a review of more than 4 stars is a paid promotion has an extremely narrow view of what a movie is allowed to be like."}, {"id": 89, "text": "I would have given more that 1 star if i hadn't all ready seen Welcome Home with Aaron Paul and Emily Ratajkowski. Very similar. At least this one had a super cute dog in it!"}, {"id": 90, "text": "So slow movie only the end is wow. Maybe you hate to watch it or not"}, {"id": 91, "text": "Dave Franco doesn't bring anything new to the horror genre with his feature film directorial debut (which he also wrote) but he does provide an entertaining hour and a half (give or take) in this film about two couples who have booked into an AirBnB type property, only to discover a number of hidden cameras around the building.Acting is decent enough and another good film for Dan Stevens' ever growing resume. Take this film as intended (a fun thriller - popcorn movie) and you will be entertained enough. Go in looking for the deep and meaningful and you'll hate it.Ignore the reviews stating it is pointless - they clearly expected too much."}, {"id": 92, "text": "I like Ed the filming and the cast was good. Not a Grammy winner but not horrible at all. I think with everyone staying home these days watching tv so often, that people are starting to get overly critical and expecting award winning movies lol It was fun. Enjoy!"}, {"id": 93, "text": "Very disappointing not worth it to watch very stupid"}, {"id": 94, "text": "Except the precious little dog. Fresh faces and decent acting made a simple plot with a twist or two, worth the 1.95 rental fee and it seemed to redeem itself at the end."}, {"id": 95, "text": "I went into this expecting the worst after reading all the negative reviews. I was honestly suprised. Great acting and characters that were interesting enough to be invested in the film.I understand why people have a lot of disappointment with this film but, as an actors directorial debut it's actually pretty impressive with such great cinematography."}, {"id": 96, "text": "A bit slow and unoriginal suffering from a lame ending. The story had the potential to be a twisty fun ride but was too slow to get going and never got up to speed. The acting is decent."}, {"id": 97, "text": "Decent movie, entertaining without any wow effects.It could have been better with a little bit more work from all production aspects.more focus on the « unknown » character would have improved the story."}, {"id": 98, "text": "Director/production - 5; Story - 7; Cinematography - 6; Acting - 6; Makeup/FX - 6; Sound - 7; Music - 6; Personal motivation - 7; My average - 6,25Yes it could be better and the midsection of the movie was a bit dragged. but it was satisfying enough for a movie night."}, {"id": 99, "text": "It captures one thing great the feel of realism which doesn't happens at first but picks up speed on the midway . There was no overreaction for which it's a plus. No jumpscares but a few secs of gore. It was realistic but leaves alot of questions answered ."}, {"id": 100, "text": "This is a very good movie. It could have been better I think with a little increase in budget. Having said that the movie does not disappoint. There are fair twists throughout to make it engaging and interesting.Do not read the reviews first. It seems people are not happy with anything these days.This is a good movie."}, {"id": 101, "text": "This 2020 thriller tells about 2 brothers and their girlfriends that decide to take a vacation for a week at a rented lake house. Soon, they discover that they're not alone and that someone is stalking them. This starts off ok, but goes downhill fast and like many people, I hated the ending. The film shares similarities with Vacancy and has nice, remote settings and an eerie score. Give this one a try if you're into psychological thrillers or horror."}, {"id": 102, "text": "It looked like amazing movie, chill, fun, interesting and intention plot but the ending was too rushed, bam,bam,bam,bam and everyone's dead. That's not how you should create amazing movies. It could be way better if they would've splitted killing scenes in movie parts. Like one of them missing, maybe the bad guy tortoring someone. I wanted something like that not just smashing in the head with no content... So it was above average but still could be way better. Possible to watch. Would I recommend? Not sure about that."}, {"id": 103, "text": "What the .... Is with the ending. Dog should have played a bigger part 🐕 Enough said!"}, {"id": 104, "text": "The Rental checks out as a movie which catches our eyes with the character interaction at the beginning, but at the end that turns out to be the only interesting thing in the movie. Both the screenplay and direction would have been better. The entirety of the movie felt like an episode of a TV show with a Michael Myers type villain. Overall it's definitely a one time watch."}, {"id": 105, "text": "The good thing - The cast &amp; the acting were all great, Dan Stevens handsome as hell, he's always great. The bad thing - Story line are predictable and flat..Not much suspense which was kinda bored at first..The flick only happens towards the ending..A COPYCAT Halloween movie invasion maybe lol..I always support any Indie or small budget films but this one could have been improved."}, {"id": 106, "text": "Ignore the haters. It's great !!! Well done. A nice slow burn."}, {"id": 107, "text": "Super super movie excellent suspense dégradation of everything I enjoy it too much"}, {"id": 108, "text": "I don't know what all the negativity about. I thought this was great. Gave me a proper chill!!"}, {"id": 109, "text": "While watching the movie I was thinking: this is way to much work for a Peeping Tom (which are usually profiled as cowards) to go through, JUST to get his cameras back. And let alone if people found them they would just blame the owner of the house.Then the very last frame of the movie rolled through and I got my answer. Pretty lame. Like an easy way out for Franco to get away with not writing something better; a more elaborate way to connect the story or give a motive.Directing/screenplay is an 8/10, writing is 2/10. So a 5/10 as a whole."}, {"id": 110, "text": "Well , horror films shall have some darkness to shade every piece of hope, and to make everyones sinister nightmares even worse. but when the darkness recorded in a film overwhelms every impression of whats going on and whos doing what, then its a great loss. so whoever made the choice of of true dark filming will not get a pass on his papers.otherwise its a story that youve seen before, a small cast, going on a trip to a desolated place at the coast somewhere nw'ern usa. YOU GET SMALL HINTS ALL THE WAY THAT IT ISNT LIKE IT SHOULD, AND THE CHAOS ERUPTS WHEN HIDDEN CAMERAS WHERE FOUND IN THE SHOWERHEADS. THEN THE BALL STARTS ROLLING, INFIDELITY IS EXPOSED, DRUGS ARE USED. and the landlords aidee gets kille accused for doing the filming, but it isnt the way the crowd thinks, and death starts to take its toll on them accusing eachone.its a film where the cast does a good job, the score are really boosting and prikling your heartrythm, but where the people in charge of production has destroyed much of the tension, leaving you annoyed cause you cant figure ot whats happening because of the dark. the grumpy old man awards a 6 for what he saw, and couldve given more if seesaw. its a small recommend"}, {"id": 111, "text": "Movie has a really good build .acting wise excellent but the issue comes when the movie reaches to final act it's like same thing which u seen before I through this movie is more focus on relationships drama the slasher.but still a good effort from Franco. Hope he make more movies"}, {"id": 112, "text": "Dave Franco, widely known for comedy, branches out this time to horror instead of being in front of the camera he's behind it. Having written and directed this fun horror I can't wait to see what's next."}, {"id": 113, "text": "Enjoyed this movie, just got better the last 30 minutes. Good acting, pretty good plot."}, {"id": 114, "text": "This barely even qualifies as a horror movie, as the majority is just plain old drama between the four characters, which veers into a few short bursts of thriller, and then jumps into full-on, but very weak, horror only in the last 15 minutes or so. Good cinematography and good performances from Dan Stevens and the rest can't save this film from its own lack of content. It's just these four people on vacation with some slight drama mixed in by two of them having an affair, a twist that's telegraphed hard from the very first scene, and that's pretty much the whole movie. Then faceless mystery man shows up to dispatch the main characters in as quick, clean, and unceremonious fashion as humanly possible in the very end. That's really all there is to it.It doesn't do anything new or interesting as a drama or a thriller and it fails miserably as a horror, so...what's there to like about this movie? It definitely felt like it was trying to be a bit like The Strangers (because wow no face, no motive = super scary for some people apparently?) except aimed specifically at what I'd imagine is a pretty small group of people with irrational fears of home-sharing. I guess the one nice thing I can say is that it at least it wasn't as vapid and braindead as The Strangers and the characters were more developed, but that's not saying much.This is a watchable, but very forgettable movie that deserves somewhere in the 4-6 range at best. Believe me or don't, but I think it's pretty telling that most of the gushing reviews here don't seem to be able to offer any insight on the film beyond don't listen to HATERS it's great! The end."}, {"id": 115, "text": "I went into this movie completely cold, knowing nothing but the title, and I think that's how the movie is best viewed. It's a very tense Rube Goldberg like machine. You put a set amount of well played and developed characters into a house and just watch as things go wrong and wrong and wrong. Don't know why it had to turn into a horror movie though, it worked best before that point."}, {"id": 116, "text": "A depiction of real life that we all need to know and be aware of. Only a predator would be offended. It's a true reality check for us all!!"}, {"id": 117, "text": "If you are looking for the worst movie of 2020 , The first half is about relationships , The other half a person comes and kills them in five minutes easily , Don't waste your time (Bad acting / boring/ no story )"}, {"id": 118, "text": "Just a big waste of time. Poor history, no ending, no reason!"}, {"id": 119, "text": "Great thrillers are rare, which is why The Rental should be treasured as a true-to-its-roots slow burning thriller. The Rental successfully manages to invoke longstanding horror traditions in a relevant, modern, and believable setting. The film is solid all around and excels at providing the audience with relatable and believable characters - something very few films are capable of in today's unoriginal, bland film industry. This goes triple for the horror genre, which is saturated with cliche jump scares and gore without any semblance of character development or realism. Although it relies on classic horror elements and twists, The Rental provides a refreshing take that guarantees a edge of your seat experience for even seasoned horror fans."}, {"id": 120, "text": "I watch a lot of movies, some good, many bad. This was well written, sharp, stylish and dark. I definitely did not see it turning into the type of movie it ended up being. The ending left me me properly creeped out and with goosebumps. Well done."}, {"id": 121, "text": "This is the story of two couples who go to a beach house for a weekend. After the first night, stranges things start happening. The story was full of surprises. It is hard to predict the next scene. I liked the acting crew. Dan Stevens played awesome like always. The angles of the camera and the movements of it were amazing. I loved the background music. My favorite scene is the chasing scene in the woods. In summary, I recommend this movie to fans of horror and thriller genres."}, {"id": 122, "text": "I thought this film was great - don't listen to the haters and false reviews of this film. This is Dave franco's first film he's directed and it's great. It's not meant to rely on cheap jump scares like any other horror film."}, {"id": 123, "text": "Whoever rated this film a 10 was obviously paid to do so. Easily the worst movie I've seen in theaters. Hands down. No plot. Horrible acting. Absolutely horrid !!!!!"}, {"id": 124, "text": "I don't understand the lower ratings unless most people just want a happy ending. Everything in the movie could have happened in real life and that makes it all the scarier."}, {"id": 125, "text": "Quite good, actually. It's slow paced but builds to an interesting climax. A valid critique to how easy we trust strangers nowadays."}, {"id": 126, "text": "Happily surprised to see it was directed by Franco. The cinematography is beautiful. Great actors. What's not to like?"}, {"id": 127, "text": "The director's debut was a success. The picture cannot be called outstanding, but it is certainly very solid. You don't miss a lot in the first half of the film, because nothing much happens. The emphasis is on the relationship between the characters. Although, even in this part, one can note a good camera and acting work. All the fun is left for the second part. It is worth noting the very smooth flow of the whole picture. Even at the most intense moment, you still feel how everything moves smoothly and slowly develops. This is not a traditional horror movie, but rather a drama with horror movie elements. At the same time, it cannot be said that the picture stands out within these genres. She seems to be missing something. For drama - tragedy, for horror - suspense. Fans of drive will not like this film, but I recommend it to everyone else."}, {"id": 128, "text": "This starts slow but really builds. Stick with it, it gets so tense!!"}, {"id": 129, "text": "Spoiler-free. I like the new trend of thrillers and horror movies digging into relationships (Midsommar etc.) as the focus of the plot line. This story of a weekend rental for two couples that goes seriously awry due to their own faulty choices and relationship tension is beautifully shot, well produced, and has a thought-provoking undercurrent especially at the end. I'm giving this a higher rating as it's not formulaic, the story is realistic, and the theme is very current. Plus I was completely freaked out and had to fast forward through one part. To me that earns a higher rating since I am an accomplished horror movie lover and am a tad jaded. HOWEVER, just why? The ending (last third of the film) was like having a mediocre dessert at the end of a great meal. The meal was so good, but you're let down and a little disappointed at the end. But, you still had a good meal. That experience is this movie."}, {"id": 130, "text": "Heard his interview today on Armchair Expert with Dax and Monica - Dave Franco did an EXCELLENT job on this project - casting was great, mood was fantastic and I am not at ALL A HORROR fan - I loved it for every minute!!Way to go D. Franco!! You should be very proud of this directorial debut!"}, {"id": 131, "text": "I'm going to have a fun time ripping this movie to shreds! It basically answers no questions. It's the flaws of every modern movie with bad writing, but they excuse it by saying it's like real life. Sometimes we don't know the answers and sometimes there is no motivation! That is an excuse. This is a movie, a work of art. I want to know the answers and I want to know the motivation. This is a lazy attempt at writing a random killer without giving a background.Now you can have a killer with no actual facial connection. You can have those mysterious movies. A movie called Unfriended: Dark Web had a great motivation. Basically, it was a secret elite force. Now that movie was hot garbage in other ways, but it was the correct way to have a killer with no connection or much interaction with the main cast. Or something that has the answers for yourself. Like Forest Gump, where it's implied that Jenny finally became free like a bird at the end of the movie.This didn't do either of those things. We never find out who the killer is. We don't understand why he's doing it. This movie just wants to make a slasher without giving us answers to the plot."}, {"id": 132, "text": "A movie with no reason. can't say anymore, because there's no anymore!"}, {"id": 133, "text": "The Wife wanted another boo movie, and I tentatively agreed. I really like Alison Brie and Dan Stevens, and assumed it would be good enough with both of them.You have to watch the entire movie for it to really make sense, and there is some misdirection (or missed direction) in what the theme of the movie is. It starts off as a stiff relationship drama with characters that aren't sympathetic...the only one that is even modestly likable is Alison Brie's character (I had to look up her name Michelle). A few exposition scenes and they have an awkward interaction with the renter of the house.Then there are jump scares and red herrings, and at about the hour mark you begin to think that maybe the evening's movie choice should have been different. I admit throughout the cinematography was well-done and the music was good.But then things start to take off quickly and almost every thriller/horror trope is ignored. Okay, maybe this was worth it but holy crap this is getting dark.Without giving spoilers, the last few minutes of the movie make the whole thing worth it, it's a montage that reveals the entire story and everything that went behind it. In a way it reminded me of Henry: Portrait of a Serial Killer in its motif.So the first two-thirds of the movie was a slow burn with unlikable characters, but the resolution was freaky, powerful, and made it worth the time."}, {"id": 134, "text": "My favorite thing about this movie was the fact that it was a different plot and not the same old junk you've seen a thousand times. It was fresh and funny and scary all wrapped into one picture. There are a couple of really cool shots that make it clear Franco is a talented director. Don't let the negative reviews scare you away- it's worth it"}, {"id": 135, "text": "I regret spending 90 minutes watching this. Over an hour of watching 2 couples fall apart and then a killer pops up in the last 20 minutes to remind you its a horror movie"}, {"id": 136, "text": "This movie was not scary at all. It builds up to an end that has no explanation and leaves you with a bad taste in your mouth because you wasted your money renting it."}, {"id": 137, "text": "Almost gave 5 stars. But while writing review, I changed my mind. I'm 40 years old and assume I'm a bit older than director/actor Dave Franco.... But I have a sneaking suspicion that he's maybe never seen a horror movie released between 1975 and on.... Was stoked to watch this movie. Constantly looking for decent suspense/horror/survival/slasher flicks nowadays. But this movie almost seemed like watching an updated Full length version of the first 30 minutes of I Know What You Did Last Summer. With plot influences from about 3 other movies. Dave! Please watch more horror movies"}, {"id": 138, "text": "In competent hands, this would have been a great movie but it settles for being average. Reasons: out of place, beginner dialogue that throws subtlety right out of the window and way too many that totally wouldn't happen in real life scenarios. It's not as atrocious as some reviewers are claiming it to be, as the idea is there but it's the execution that faltered. One extra point for being a remote location thriller/horror/slasher that seem to have vanished off late."}, {"id": 139, "text": "I really enjoyed this thriller, and always appreciate a bit of dark humour thrown into tense movies like this. I think overall review rating may be low due to how the film ends: the film builds really well, and everything that happens is relatable, but it feels like the writer/director needed to somehow bring the film to a close and tie all the threads together. I don't think the last ten minutes were necessary - you'll still have a complaining audience, but it's better to leave viewers guessing than to leave them with an unsatisfying end. This could easily have been the beginning of a franchise."}, {"id": 140, "text": "It's not clear how ,why everything the killer did, only questions without and reason or meaning Do not watch it!"}, {"id": 141, "text": "First of all, I can call this movie a thriller, it is not horror at all. The idea is not new. I expected some good twist at the end, but I was very disappointed. Also their acting was poor. It is a complete waste of time, unless you need something to kill your time with. I gave it 5 because I kept watching till the end without skipping (hoping to see some good ending, but that didn't happened)."}, {"id": 142, "text": "THE RENTAL (2020) *** Dan Stevens, Alison Brie, Sheila Vand, Jeremy Allen White, Toby Huss, Anthony Molinari. Actor Dave Franco makes a fine directorial debut (and co-wrote the screenplay with fellow filmmaker Joe Swanberg and Mike Demski) in this horror film about two young couples on a weekend vacation for a celebration that eventually downward spirals when they learn their rental is being spied upon. While relying on genre tropes (fog, wide shots to see something just on the horizon lurking, a pet in peril etc.) the story takes its time from a complex character study into full on terror with surprising restraint in say gore or exploitation. Familiar yet receptive."}, {"id": 143, "text": "The movie started very well and became very interesting towards the middle. The movie brought the tension to the top in the last half hour. But it ended so fast and superficially that I was left at the beginning of the TV saying So this is it. This is it."}, {"id": 144, "text": "Slow to start but pretty good. I didn't expect much and wasn't let down but I thought it would be better. Didn't like the ending."}, {"id": 145, "text": "I actually really enjoyed The Rental, it had this great build up with creepy things happening around this vacation home. But I feel like the build up just led to nothing. The only character I liked was the dog and I only cared about the dog. It was a good movie that has some decent jump scares and would recommend for a sleepover or something like that."}, {"id": 146, "text": "After reading all those negative reviews I can only come to the conclusion there are a lot of quickly unsastified people on earth. I don't what they expect from a horror thriller like The Rental. I thought that for this genre it was a pretty decent movie. It won't win prizes or so but it's certainly entertaining. There is some good tension building and the acting wasn't bad either. I only know Jeremy Allen White from the excellent series Shameless, the rest of the cast was unknown to me but they all did a decent job. As for the horror it's mild but yet effective. All in all it wasn't a bad movie, certainly better than I expected for a movie in this genre."}, {"id": 147, "text": "This may not be one of the best films of the year, but to be honest, I consider it an enjoyable one, elegantly executed, with certain tributes to the Thriller genre, an interesting acting exercise, considering the situation in which the characters are involved and how they should react to these. For a feature film debut, Dave Franco clearly struggled to find a balance between suspense, satire, and human psychology."}, {"id": 148, "text": "I totally did not know anything about the film. I just wanted to watch some horror or thriller film and this one was one of the choices. I am not disappointed that I chose to see this one. It is not bad at all. Better than current note that is showing below 6.I would give this 7.6 as a note.It is a bit of a slow start, but once in the house, it all becomes more entertaining. The last 10 minutes are really surprising! And final scene is wow!"}, {"id": 149, "text": "Firstly I'll just say I liked this film, it was an entertaining way to spend a Sunday afternoon with a slight hangover. It's not particularly original (gang of people on a holiday weekend being stalked by a stranger) and it didn't offer anything new, but it's still an ok watch.So, the soap opera bit, two couples - brothers with their wife and girlfriend - go off to a ludicrously posh weekend rental. Creepyish manager had previously refused to rent to Mina (she's a Muslim woman) but then happily rented to Charlie, her brother in law and business partner, an hour later. And there we have the PC, 'let's be woke' element which, in reality, doesn't really go anywhere except for Mina huffing around for a while and disliking aforementioned creepy manager. They unpack, Michelle (the only likeable character who I actually rooted for) has brought some 'Molly' which she gives to the others, she doesn't take any because she wants to hike to a waterfall the next day. Best of luck with that Michelle. Michelle goes to bed, the other three stay up, get high and drunk. Josh, Mina's boyfriend and Charlie's brother passes out. Mina and Charlie jump in the hot tun, things get a bit heated and you can guess the rest. They end up having sex in the shower whilst their other - better - halves sleep.Next day Mina and Charlie claim hangovers and stay in the huge house whilst Michelle and Josh go off on the hike. During the day Mina discovers a camera in the shower head, throwing her and Charlie into shock in case Michelle and Josh find out. On the hike Josh gives Michelle a few home truths about Charlie, which upsets her and she is cold to him when they return to the house. This is the point where the movie actually starts to move, because up until now it's been nothing more than a soap opera at best.Charlie and Mina now set about finding and disposing of the evidence. Michelle - upset, high and drunk - rings creepy manager to fix hot tub, and the whole thriller starts. Accusations, a fight, a body (the cliff scene is ridiculous), road spikes, a missing dog, remote controlled showers, and a few more ludicrous elements all come into play. It's pretty effective, the stalking and violence are well done. Like I said, the only person I gave a damn about was Michelle. The characters are pretty awful people, shallow and predictable. It's an ok way to spend a couple of hours, just don't expect too much. Slightly overhyped online."}, {"id": 150, "text": "The story was well written and the last part of the film you have to remember to blink!"}, {"id": 151, "text": "This movie had many elements I enjoy in horror films. The acting was very decent and the plot enjoyable but I kinda hope we get a second part so we get the answers we deserve. It's a nice watch but don't expect a happy ending."}, {"id": 152, "text": "This is a good plot due the stupidity of the choices they make. it s entertaining. give it a try."}, {"id": 153, "text": "Very good movie. The tone was maintained throughout the film and the music enhanced the tension instead of detracting. The characters had some definable quality traits, which helped them come across as real people. There is a good story with a lot of fleshing out. I see it as more of a tense thriller than a full-on, horror movie. Definitely watch it at night. Fans of Vacancy, You're Next or The Strangers should enjoy this movie."}, {"id": 154, "text": "Dave Franco knocks this one out of the park. From the lack of gratuity, to the absolutely perfectly flawed characters. The intensity of this film lies not in gore, but with good, old fashioned suspense. Not overly original, not a clone, a nice, solid standalone with a descent plot and a refreshingly clever twist on the character of the killer. I plan to buy this movie as soon as possible. Automatic top 10 for slasher flicks. Great job writing and directing. Looking forward to seeing what Dave does next."}, {"id": 155, "text": "All together this film was pretty decent, save for the so called twist that didn't work at the end if the movie. The good points, the acting was good, yes the story has been done hundreds of times, which I don't mind if the film is good and it keeps me watching. The French bulldog was a fun touch which also worked. The only thing that spoilt this movie was the silly ending. No I don't mind if I never find out who did it, which can work in other films but in this particular movie a good twist would have put this film up in the ratings of 7 and 8. Never mind, a very good effort by all."}, {"id": 156, "text": "What an amazing directorial debut for Dave Franco! He doesn't fall into the cliches of the genre and uses the serial killer stalker really well. Best movie of this kind i've seen in a long time. See it!"}, {"id": 157, "text": "Couple retreat getaway turned creepy Friday the 13th type of scenario..worth a watch if you like this type of movie 🍿..jason voorhies clone"}, {"id": 158, "text": "The Rental is a lot of things and it's directing and acting is well rounded and believable. There are number of things in this work well and up until the third half it does a good job of presenting the actors into tense situations that slowly unravel.This is where things take the wrong turn. The voyeur aspect served well to draw out the tension and had the movie remained on this track it would have been an interesting dialogue into people dealing with progressively worse decision making. It could have stayed with the voyeur theme but instead tries to quickly turn onto a slasher and it honestly doesn't work here.I couldn't help but find myself only really rooting for one of the four as she continued to make smart decisions that followed a moral compass and stayed grounded. It would have been interesting to see this play out from the standpoint of someone knowing what they were doing and pushing them to see how far they take the lie before it collapses but instead we get a rushed killer who makes quick work of the cast and it's this decision that I think is driving majority of the negativity. This is not a bad movie but it could have been so much more if they had continued forward but instead it becomes a slash and dash where the plot and decisions the characters have made no longer matter."}, {"id": 159, "text": "I tried to watch this FIVE times. I fell asleep everytime. This will be my go to movie for those hard to sleep nights. The only interesting thing about this movie was the scenery. Beautiful panoramic shots of the ocean, beaches and cliff faces. Bandon, Oregon is a pretty little coastal town of 3,000. Honestly, I think the sleepy town of Bandon, Oregon is FAR more interesting at 3AM then this movie ever hopes to be. If you are looking to watch something good...keep on looking. I'm pretty angry over the money I spent to rent this, but the rental price IS cheaper than a sleeping pill...there that. People Under the Stairs is a far better movie."}, {"id": 160, "text": "Hammer man don't play!Hammer man don't play!Hammer man don't play!"}, {"id": 161, "text": "Two couples who work together rent an expensive house on the coast. The landlord in a bit creepy and the angles we see indicate voyeurism. There is some cheating going on too.The couples were not that exciting. This is similar to other films with a slight twist on the end. The film is boring up until the last few minutes when the action happens but by then I was too far out of the film.Guide: F-word. Sex. No nudity."}, {"id": 162, "text": "I literally skip maybe 20 minutes when i reach the middle of the film there was no point at all if you play the movie and then you sleep for 40 min you will loose nothing"}, {"id": 163, "text": "The movie builds nicely, good actors in this one, playing on various relatable subjects such as relationships and identity, and what made this enjoyable is that the entire thing could be a real situation, nothing too far out, but it throws all away at the end for a conclusion I'm not sure if I couldn't figure out because it was completely meaningless + unrelated to the rest of the movie, or because there was nothing there."}, {"id": 164, "text": "I chose to watch this because Stephen King recommenced it. He must have been high when he watched it. This is the worst movie I have seen in a while. Literally NOTHING happens in the first 80 min. What little action there is happens in the last 10-15 min and then you are left sitting there rolling your eyes because you wasted 6$ and 90 min of your life for a random mediocre ending."}, {"id": 165, "text": "The worst character should have died instead of the remaining innocents."}, {"id": 166, "text": "This was supposed to be a good film.It starts off with some good efforts to establish a feeling of impending dread, but it's like the director got very impatient about 80% of the way into the film, which leads to a very rushed, unsatisfying conclusion.What was the point in establishing backstory about the characters? The creepy caretaker? Making them turn on each other? If it was just going to end up being some random Air BnB serial killer? Oh, that's right. Sequels. It was done to set up tons of (increasingly worse) sequels.A big disappointment.P.S.-&gt; Murdering your own wife in a film (Dave Franco's wife is Allison Brie), even if make believe, comes off as creepy to me."}, {"id": 167, "text": "So I skipped thru scenes because this film was just meh. Airbnb couples rents out a fabulous home for the weekend there is one act of infidelity and host of killings.... Meh. Absolutely nothing new to write home about at all. Because of its predictably, I only watched the killing scenes. And the ending? It was a real WTF are you serious?....type ending. A watch if you have nothing else better to do type film."}, {"id": 168, "text": "Its not a bad movie, nor its a great movie. If you like to watch really, really silly characters doing everything in their power to screw themselves over its a fun ride."}, {"id": 169, "text": "Nothing extraordinary about this film. Creepy property owner spy on renters with hidden cams. Stolen from real life news headlines about AirBnB. This is really a crime thriller than it is a horror film. Renters are two couple of Wokerati millennials that unfairly judge the property owner's brother as being racist against a woman with a common Islamic name and later the White Knight boyfriend beats the hell out of the old man and nearly killing him.I'll leave it at that so not to spoil the film. But the dialog is terribly boring. The dialog is mostly how the couples first met and some previous dating history; then stuff happens."}, {"id": 170, "text": "It's a complete waste of time. We end up not knowing what are the motivation of the killer, that's the only thing I expect from a good thriller.This movie in one sentence? Two couples that are going to die and you will never know why.There. Predictable movie, and the only thing that could've saved it - developing the killer - wasn't done."}, {"id": 171, "text": "I honestly don't even want to waste More time writing a review on this so I will keep it simple.I hate to say it, but not even the more talented actors in the film could save this empty/awkward dialogue. Not an ounce of chemistry between any characters and the relationships were completely unbelievable. No character development. The killer is just some random psycho with no motive &amp; no backstory. If this were done in a true horror genre, then perhaps it could've worked-But the movie just left the viewer hanging and waiting for some explanation of what happened and why. All characters, except for the wife, are completely unlikable. The story/plot is ridiculous and just makes no sense, nor do any of the characters' decisions/actions. Barely any music or added sound effects which just left it feeling awkward and hollow (and not in a good/suspenseful way).We laughed at the end when they had a shot of the killer removing almost every single camera in the house.What a stupid movie."}, {"id": 172, "text": "I saw this in the theaters and I didn't mind seeing it. I had nothing else to do. That said, there's absolutely no reason to watch this film. Technically it's adequate, but the plot leads to nowhere. Maybe watch it when it comes to Netflix?"}, {"id": 173, "text": "The last fifteen minutes are a great slasher. Do yourselves a favor and fast forward. No backstory necessary."}, {"id": 174, "text": "This movie starts off with a really good build-up, but it's completely wasted by a stupid final act. The entire cast was dead before I realized they were actually killed off, rather than unconscious and returning later. The deaths were so quick and lazy, that I literally didn't know any of the characters had died until the credits started.Most of the beginning tension is regarding an affair between the couples, but once everything has been revealed, half of the cast is already dead. It makes the whole plotline and build-up seem pointless, as there is no 'big confrontation' or conclusion, despite the affair being the focus of the first 60 minutes. It just doesn't make sense, such a waste of time to start all of that and take it nowhere.The movie simply ends, and then you realize that was all it had to offer - pretty much nothing once the build-up and tension is ruined."}, {"id": 175, "text": "This is a suspense film with creepy moments. Real characters that you don't necessarily like, but may relate to. It was well done and the actors were exceptional. The story was interesting and kept me completely engaged. I don't normally write reviews, but can't understand that bad reviews here. I'm beginning to think people just want a movie to be ALL horror or ALL action. The only part I did not like was the girl with a hurt ankle running through the woods making WAY too much noise. WHY!!!??? I would never do that. Most woman I know would never do this. Whimpering and having to cover our mouths so we don't scream. Nope! I am pretty sick of seeing woman portrayed like this in scary movies. Other than that, it was the best suspense I've seen since the strangers, but with a much better story and character development."}, {"id": 176, "text": "If you like reading crime investigations and watched a ton of it, you'll get the right idea about what was in director's head. The nice details about human behavior in such dreadful situations. I like that it was slow and tense, it was quiet like it never happened. Just another little story for a real main hero of a movie."}, {"id": 177, "text": "I can't remember the last time I watched a movie that had my attention as much as this.A wonderful debut.Part of what made it so gripping was I can tell the director had the ideas preplanned and then wanted to make the idea he had.It will be interesting if he can follow it up next time when perhaps the ideas aren't there and he's forced to create something.But this is a fantastic film for the budget. Incredible quality for the budget. There were just a few moments that could have been better acted and directed, but overall it's an A grade movie."}, {"id": 178, "text": "It's your standard slasher movie where a masked killer hunts down a bunch of friends staying at a rented cottage. A bit of mystery, some suspense, mix in a little romantic drama and you've got your average masked killer Scream type of movie. The buildup is not too bad but the ending disappoints. A better script would have made this more interesting."}, {"id": 179, "text": "I easily could've given this movie a solid 8 stars, but the ending ruined it completely. I still don't understand the ending. Left with more questions that were never answered. What a waste."}, {"id": 180, "text": "A mish mash of previous horror films with some hidden camera theme to give you the creeps. It doesn't work, and by the end it just gets annoying. With better pacing and a believable story this could have been much more interesting. Just a lost opportunity."}, {"id": 181, "text": "There is suspense and some mystery, but the ending doesn't answer any questions."}, {"id": 182, "text": "Way more interesting than I expected from reading all the negative reviews. Amazing screenplay, seems totally real and cinvincing, and very well played. These are ordinary people, could be one of us. Unlike many fashionable films today, the camera work does not distract from the story, but actually helps to tell it. Kudos to Dave Franco. The ending is very un-Hollywood. That and the realism probably account for all the negative reviews here. It's way better than the usual horror flick, which fortunately it is not. Devoid of sentimentality or gimmicks (digital or otherwise), maybe it is not surprising most movie goers don't care for it."}, {"id": 183, "text": "This is a Thriller/Slasher movie. Very slow burner. Cast is fine,but the Cop out ending will disappoint most."}, {"id": 184, "text": "The film is slightly below average for me. Considering this was Dave Franco's first movie, it was done well enough. This film is much more of a character driven thriller than a horror. The cinematography as well as the acting are strongpoints of the film. However the writing is a little bland and I just didn't care much for the characters. There are a few plot holes which are annoying but can be overlooked. Another weaker part of the film was the soundtrack. Much more suspense could have been generated with more punch from a good soundtrack in the right spots."}, {"id": 185, "text": "This movie is cooler and cooler the more I think about it - it's a pretty modern American drama: no one is clean, everyone has secrets, the only real relationship is family. It's also a slasher film, in which the nameless, unexplained psycho who does the deed doesnt show up or do anything until people start to 'transgress' or reveal their past mistakes - instead of drugs and sex and drinking at the lake, the moral crimes of the seventies and eighties in movies, instead it's infidelity, rage, duplicity, a lack of loyalty.The characters err, they are punished - a pretty standard horror movie formula, but because of the quality of the acting and script, it really plays like a drama, almost until the end of the film. That's a neat trick, especially for Franco's first time out as a director.In regards to the spate of really poor reviews: there's a new kind of amateur film critic {let's be clear, I'm one too, we all are} who views anything at all that isn't patiently explained in exposition to be an indication that the movie is bad and 'unrealistic'. I blame yout*be reviewers tearing into every movie looking for ways to fill time, but the result is that those viewers encounter a film like this - which is calm and patient and engrossing, but which chooses to explain *nothing* about itself, and these new amateur critics decide the movie is bad because of that choice, while thinking it was the result of mistakes in making the movie.I really, really dug this, and heartily recommend it."}, {"id": 186, "text": "I liked it, one of the better 2020 horror movies around and there haven't been many this year. The acting is spot on but the music scores are perfect and comes with a great ending."}, {"id": 187, "text": "The movie does a better job at highlighting everyone's need for retirement. Everyone in this movie is tired of their careers and problems at home that they all just want to retire-The Warden, her husband, the prison's priest , Woods' lawyer.What a depressing movie. It fails to deliver on its plot or theme."}, {"id": 188, "text": "This movie is not great by any means, nor does it deserve some of the poor reviews here. It is watchable and has some entertainment value. It takes a little while to get going, then it delivers some good thrills and chills. Not a lot, but enough. And I watch all horror movies. The reason behind the 1 or 2 star reviews is the fact the movie exposes racism. This automatically causes knee jerk reactions in a portion of our sad society today - perhaps maybe one day when aliens invade earth or some other type of human catastrophe, these types will realize that we are all human beings regardless of race. The End"}, {"id": 189, "text": "So here's the thing about this movie. The payoff at the end of the film can either be seen for what it is, an extremely smart twist leaving the classic teen horror trope behind, or as what a lot of reviewers want it to be, a bad take on a tired genre.Dave Franco's directorial debut starts as a classic horror movie, with a slasher character that borderline copies Halloween's Michael Myers, but where the movie takes a turn is when you learn our murderer has no vendetta against these teens, and just happens to find the airbnb a convenient method of finding serial victims. Which is an extremely intelligent, as well as socially-relevant, plot device."}, {"id": 190, "text": "Classic modern horror thriller.Everything already seen, 4 people placed in big House with beatiful view with strange feeling. Everything else is known but for movie to spend evening and watch it. Worth it !"}, {"id": 191, "text": "Spoiler alert: the entire budget was spent on having the two known actors. There's a huge plot whole in who is renting out the house in the beginning verses who is renting in the end. Garbage story. The kill scenes are incredibly underwhelming."}, {"id": 192, "text": "This movie is a whole lot of nothing for the first 85% of it, and then everything worthwhile or entertaining happens within the last 30 minutes or so.As with others, the cast had me excited. They weren't really at fault here, as much as the writing and directing were.Skip this and go watch something better."}, {"id": 193, "text": "The original promotion for this film was very minimal showing really nothing. I believe a more in depth trailer may have come out after the first teaser but I went into this movie with no expectations. I'm really glad I watched it because it was probably one of the best horror/suspense films I've watched in awhile. It's always best when you have a very limited cast for a thriller or horror film, it keeps things nice and tight. I was entertained through out the entire film and for this being Dave Franco's big debut, I am much impressed. I would advise him to keep it up with the horror genre... we need more good producers &amp; writers for horror. Definitely a fun movie, with a very intense final half hour. I recommend."}, {"id": 194, "text": "If you saw The Open House and didn't like it, you won't like this either."}, {"id": 195, "text": "You got drama, sex, infidelity, stalker, suspense, mystery, excitement, def a film to watch alone or with a partner. The real horror of it all is that it can easily happen to anyone of us, without us knowing. That's the beauty of this eerie film, the invasion of one's privacy. Dave Franco should make more films. Good job on this one, it's smart yet entertaining"}, {"id": 196, "text": "Was an alright movie but the killer without any back story or motivation left me dissatisfied. Just sort of ended with 'hes moved on and going to do it again'. Also the last girl Mina had an opportunity to take her death and come back to avenge her friends but that never came to fruition either..."}, {"id": 197, "text": "So bad you guys. Most of the plot was predictable and cliche, then there's the ending. The ending. Wasn't even really an ending at all. More like James Franco's middle finger to the audience while he tells us to take our best guess..."}, {"id": 198, "text": "It took an hour + into this hour and a half movie until something significant happened. It is a slow burn movie, but the ending was not worth the wait. The kills were too quick and short, and three of the four characters were killed within five minutes. The last one killed within the five minutes thereafter. Way too fast. The entire movie was drawn out, but the kills weren't at all? Oof.Also, the plot about the couple's affair took over and became cringy and awkward. I like character development, but the movie built on the two characters having an affair. Yes, the premise needed the footage of them, but the other two more likeable characters had little development, and so the audience is forced to only know the two having the affair. Yuck.Cinematography was okay, but in this day and age, that's basic. It's about the only thing that made the movie enjoyable. Otherwise, couldn't stand the movie. Left a bad taste in my mouth."}, {"id": 199, "text": "Love Franco and the cast but there was no thought to making anyone likable, except maybe the dog. No character or plot development makes for a lame movie no how good the actors USUALLY are."}, {"id": 200, "text": "Nothing surprising or shocking here it just goes nowhere and the end is ridiculous. Huge waste of time!!!"}, {"id": 201, "text": "The plot is rather good, two couples renting a beautiful house by the sea. Someone is watching them, scaary!The drama part of the movie is good, the acting as well!That's about it, it's some thrilling scenes last 5 minutes of the movie but not more then that!"}, {"id": 202, "text": "Just a quick review to balance some of the unfair reviews. As a debut from Junior Franco it's passable and perhaps an indicator of better things to come. I don't like unclear endings so that disappointed me but you can see where he was going with this."}, {"id": 203, "text": "The whole movie right up to the ending was suspenseful and twisted. We were very excited for the ending until the killer never got revealed... It was a HUGE let down.. if they could redo the ending it would be much better!! The climax of the movie led to a very underwhelming ending, I am very disappointed that I paid $20 for this movie and would really like a refund.. If you watch this movie you will see what I mean.. you think the killer is going to be one of the main characters but isn't.. I really hope you'll take my advice if you're reading this and DO NOT WASTE TIME OR MONEY ON THIS LET DOWN OF A MOVIE!!"}, {"id": 204, "text": "So this is stupid as soon as Jeremy Allan White's character gets killed by a hammer. I was liking it up to that part. It just ruins the whole movie. It's pointless building up characters just to have them die. I can't believe I wasted my time watching this horrible movie! The movie doesn't even show when people turn up mission. The police investigation. Why did the dog run away? There's so many things I want to complain about this movie."}, {"id": 205, "text": "Don't waste your time or money on this dumb movie. It was absolutely horrible and had no plot. It was a 16 year old drama with a creepster in the background. The plot had no context and was about stupid drama that had nothing to do with the movie. Whoever made this movie should retire from the movie making scene because they have no clue what they are doing. The ending was horrible and the whole movie had no twist. A serial killer killed 4 people.....that's it. So freaking trash I want to keep writing and choke slam whoever allowed this movie to be made. DO NOT WATCH THIS! I'd like an apology from the movie makers and also the characters for horrible acting and a waste of time and money. So angry and disappointed with the movie, I seriously wanna choke slam the producers of this film. Absolutely devastated by how garbage it was."}, {"id": 206, "text": "Always starts with a bunch of smart people going somewhere, then weird things start to happen, one glitch turns into a massive pile of mess, every decision they make is wrong and stupid. If you've seen this type movie, you can pass this one, nothing new."}, {"id": 207, "text": "This is another film that has been done many times before... 2 couples go to rental property in the middle of nowhere. They get drunk and discover that they are being spied on... Add to a mix, there is murderer that run amok and hunt them down one by one...It is undoubtedly predictable from start to finish. It borrows from Psycho, Texas chain saw massacre, Friday the 13th Jason etc... Just because you take inspirations from superior films it doesn't mean that guarantees it makes a good film. Instead it is fragmented and achieves nothing more than being an average run of the mill film."}, {"id": 208, "text": "For a horror movie fan, it was so bad! You don't know who the killer is, why he is doing that, and why the killer is in all the places all the time! Don't waste your time!"}, {"id": 209, "text": "As with so many , horror , slashers, the ending ruins it for me.I dont think this is a spoiler, to say, but dont root for anyone or get any emotional connection. If you are OK with that, then let the good times roll."}, {"id": 210, "text": "This movie is a solid 7, it was intense from start to the end, a decent thriller. Give it a watch, you won't regret it."}, {"id": 211, "text": "Surprisingly it is a quite decent thriller movie. The drama and story built nicely, But the bad thing is the ending, It is so pointless.. I expected a climax and intense ending, but i got nothing, because yep..it is pointless.."}, {"id": 212, "text": "As the directorial debut for Dave Franco, I expected this to be artistic niche film with political underlines, but going through it it turns out a solid horror with better than expected scares that kept me on the edge for the last 30 minutes, I absolutely loved it, great acting and loved the editing."}, {"id": 213, "text": "This was a pretty good movie. It was tense and definitely kept me engaged. It isn't a horror movie, it's more a slow burn psychological drama. I didn't realise Dave Franco directed this. As a first effort this was impressive and I'd definitely watch anything else he directs. I also like to see a follow up of this."}, {"id": 214, "text": "Characters were extremely unlikable and I was hoping they'd all die from the start. Why they died? I have no idea. This might be just the worst movie I've ever seen."}, {"id": 215, "text": "The main characters and their blind PC crap ruined this movie for me within minutes. A Middle Eastern chick has a chip on her shoulder for being who she is and makes it everyone else's problem, to the point you hate her. Like most under 30 PC idiots.I am now just fast forwarding, hoping she dies a terrible death. That she deserves,"}, {"id": 216, "text": "Big buildup, disappointing ending. Wish there was more suspense. BUT if you have nothing else to see, give it a try. There aren't a lot of quality suspense movies out there and this doesn't suck so maybe watch it on a Sunday afternoon."}, {"id": 217, "text": "The Rental tells the story of Charlie(Dan Stevens), his wife Michelle(Alison Brie), his brother Josh(Jeremy Allen White) &amp; Josh's girlfriend, Mina(Sheila Vand). The couples go on vacation at a home stay but, not everything is as idyllic as it seems.The Rental is a mind-blowing film. Dave Franco knocks it out of the park, in his directorial debut. Be patient with this film. You may think that it is slightly dragging, in the beginning. However, the pulse-pounding, edge of the seat climactic set piece, more than makes up for the slower pace during the early scenes of the film. There are jump scares aplenty. The performances help elevate the film &amp; make you care about the characters. Dan Stevens is superb as Charlie. Alison Brie is spectacular as Michelle. Sheila Vand is outstanding as Mina. Jeremy Allen White is fantastic as Josh. Toby Huss is unforgettable as Taylor. The Rental is a must watch for horror/thriller fans. Go &amp; get thoroughly spooked this Halloween season!"}, {"id": 218, "text": "I don't get why anyone would like this movie. It's boring as hell, and the definition of lame. It feels like it wants to be smart and original but fails miserably. It's like a generic student film with a bigger budget."}, {"id": 219, "text": "Real horror isn't flashy. An unconnected, unfeeling killer who sets his trap and patiently waits for his targets was an amazing approach.We crave answer and crave motive, but the real terror is knowing this was just a random and senseless murder that happened to 4 people dealing with their oen drama.Franco did something brave here by not making this another forgettable cookie cutter modern horror.Definitely worth a shot."}, {"id": 220, "text": "I like White in Shameless. The problem isn't the acting except Mina) It's that this has been one hundreds of times. The one with Lynne Shea was way better tho that was just a room rental same premise. I'm with the other reviewer that it was pointless. The brothers had issues with one another it would have turned out better if it was somehow Jeremys character involved but just a no one. Why even reveal him at all. It was an ok watch but the last 30 min were pointless. Edit to add: people quit saying if you don't like this you're a hater or cheater. People just don't like it because it's a cliche crappy movie that has been done 100's of times before but better. You must be under 30 if this is why you think people dislike this. It's simply because it isn't a well made film!"}, {"id": 221, "text": "Testtesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttest"}, {"id": 222, "text": "The movie is enjoyable in some way. However, it's truly nothing special. Half of the movie appears to be more on the dramatic side and doesn't include horror aspects whatsoever. The other half has some basic horror aspects but nothing significant enough to make the movie memorable. I bumped up my rating to a six because a few actors, specifically Jeremy Allen White and Allison Brie, performed really well in it."}, {"id": 223, "text": "Very good, it was due to a bias that I didn't expect, lovely, the good thing that young adults are so futile and doubtful in character, that we don't create any pity, and we still hope they're caught, except for the blonde girl... Yeah more of the same, but still very good..."}, {"id": 224, "text": "This movie is technically well made. It just suffers from one huge flaw: there is no point. You watch it and you think there must be some reason, some motivation or something behind these things that are happening - but no, there isn't. I wouldn't even call this a movie but rather a demo of how to make some scenes without any actual script."}, {"id": 225, "text": "I had fun watching this. I read that some people think it's pointless. It's not in my book. A nice little killer movie is always fun. Typical Friday taco-night movie with friends and a few beers. Nothing all that new in this movie, but as I wrote, killer movies are fun.It would be nice with a prequel or a sequel with some more background on the whole thing. Worth a watch. 6.3/10"}, {"id": 226, "text": "It is annoying I was very much into the film, the characters the actors and actresses and the mystery...really building up....then poof, the good, suspenseful movie stops with a very stupid ending in a very dissatisfactory way and then kills itself off.They butchered their own movie. Why?I'm giving it 7 stars, because 7/10th of the movie was good, but the other 3 stars are missing entirely.Some reviewers mentioned sequels. After thinking about the premise, it is possible ...but those characters are history, that's a stupidi way to deal with the ending."}, {"id": 227, "text": "The movie is plotless, but still an enjoyable watch, one of those it happens because it happens kinda thing"}, {"id": 228, "text": "I liked this a lot. I held off renting it because the rating is low &amp; the reviews aren't great. It held my interest, I didn't fast forward, get bored, fall asleep, or regret renting it. To make this better I would of added more threatening scary scenes because it IS a horror story."}, {"id": 229, "text": "Hits the mark- something new, something old and something borrowed.If you like horror movies you'll like this."}, {"id": 230, "text": "A beautiful house in the middle of nowhere is the place where 2 couples derail in an ever deepening drama with paranoid horror elements based on nowadays camera culture. I enjoyed this one thouroughly."}, {"id": 231, "text": "The Rental is well-made, atmospheric, old-fashionedly methodical; the four leads convince as regular, average people, the creepy red herring (?) is well-cast too. But if you're expecting some sort of twist or a capper of an ending, you will be let down; the final section of the movie is a prosaic boogeyman yarn. **1/2 out of 4."}, {"id": 232, "text": "The film trips over the classic home invasion horror and does nothing new with genre, but provides a well-balanced suspenseful buildup with a decent surprise ending, but clearly lacks in character development that could've been utilized better with a longer runtime to include more to the story."}, {"id": 233, "text": "Took way too long to build up suspense and the ending was not satisfactory"}, {"id": 234, "text": "Predictable, predictable, predictable. You don't even get into the killer at all, it's wasted on a slow burn of a boring basic cheating plot line. Thriller mmm more like drink how many times they say baby or babe. The most tragic death was my wallet, and the seven dollars that went with it."}, {"id": 235, "text": "The first half hour or forty minutes showed some promise for this film, and the acting was pretty good. However after that the plot falls apart, and it degenerates into every other dumb slasher-type flick that you wish you hadn't wasted 90 minutes on. Utter garbage, the four stars is really only for the acting."}, {"id": 236, "text": "The premise of the film is too familiar: two couples rent a remote place over the weekend. Then all bad things happens. I kind of liked it but the we-are-out-of-ideas-ending was totally pointless. One unsolved mystery is the fact that Dan Stevens signed for this project. By bow he can afford to say no to B-movie projects."}, {"id": 237, "text": "Got a feeling back to old time horror style, which is good indeed. Quite natural the scary scene come up but point deduced is no fight back. Superman he is?"}, {"id": 238, "text": "Paper thin characters. The dog is the best part of the movie. Super cute french bulldog which does not die, thankfully. I hate that trend in horror movies lately. You get one murder scene payoff but the rest are done off screen, those are huge let downs. Editing is completely abrupt. All the best scenes are in the trailer. You know what the characters will do before they do. Killer's MO not that surprising so the ending goes on a bit too long. Decent plot and acting but everything else is lackluster."}, {"id": 239, "text": "The appreciable atmosphere, cinematography, and setting of the film doesn't make it frightening. It attempted to become a slow-paced horror getaway film to a clichéd, laughable slasher flick. The lack of suspense, the predictable characters and suspense, and the bland storytelling makes it tedious to watch. The Rental is definitely not worth watching even for rental."}, {"id": 240, "text": "I love how dave directing movie. First half of movie tries to build character that very important in a scary movie. And with Classic Slasher's ending. It could be a better movie , But as i say it's very good for first movie. And in the end i want to say that movie was so underrated"}, {"id": 241, "text": "It's quite good, it kept me interested and entertained till the end. The end is pretty weak though and that's why my rating is 8 stars instead of 10."}, {"id": 242, "text": "It's all been done before and done much better. This is a very low budget movie where four actors try their best but fail miserably. A very weak plot that goes nowhere and makes you wish you'd opted for a root canal over watching this trash."}, {"id": 243, "text": "Don NOT watch this movie !! This is an awful one !!!Its really frustrating and emberassing that this kind of crap enter the big screen in Stockholm city. This dirt shuld have been direct to the dvd or streaming. It is very uncommon that i want to walk out of a cinema but it was close this timeIts a bit sad to see the decline of horror movies. This movie had all the cliches you have seen hundred times before. Four non-likeable characters go on a weekend to a big house in the countryside. Of course there is a mad killer killing them one by one. Heard that one before?Its not funny, smart, exciting, or anytihing else you would want from a horror movie. In fact this piece of crap is just bad, bad, bad . In a good movie you relate to the characters and identify with them. The idiots in this movies you just want them to die as fast as possible.The ending is useless and pointless. It just ends, without any explanations.Did i mentions there are a lot of plot holes too?The only, and only, reason this dog don´t get a 1 star is becasue the camera work is pretty decent.AVOID !!!"}, {"id": 244, "text": "I was looking forward to this and it started off well with a good build up but just fell flat towards the end, then ended without a single explanation. Basically there was just no point to it. Just didn't work."}, {"id": 245, "text": "This movie was pretty predictable and very slow.It wasn't terrible and wasn't too long just feels like a 1 hour story that was being dragged on to last 1 1/2 hours instead.Something to watch if you have time to kill. 6/10 from me."}, {"id": 246, "text": "I've read other reviews on this site, which I will address before giving my summation. First, someone said that it seemed as if Dave Franco was trying to do too much (ie directing, writing, producing) with this movie and that he sometimes got sloppy on one or the other. There's a scene in the movie where Mina (discount Nasim Pedrad) tries to show the maintenance man that a hidden camera is in their shower head. This is an example of sloppy directing because they never show the shower head, and the character never points and the maintenance man looks away while talking!! So, this must be what the reviewer was talking about: very poor and inexcusable directing!!! Next, this movie seems to be divided into two pieces: the first half is almost like a teen romance-drama, which turns into a horror-thriller in the second half. It is almost like Full Metal Jacket in that sense. Another thing about this is, there's a McGuffin regarding the identity of the villain/killer/pervert, which the viewer is left to think is the maintenance man. Again, half way through, this is revealed to be wrong. Let's go back to the beginning for a full synopsis. Four urban professionals decide to book a rental property as a weekend vacation due to the stresses of work. Mina (Discount Nasim Pedrad) and her boyfriend, Discount Jacob Weber, are suspicious that the landlord is racist because of how he talks to Discount Nasim Pedrad, who has a Muslim sounding name. So, Mina and the other guy have an affair in the shower, and later discover that it was recorded on hidden cam. Now, they must think of a way to cover it up, but can't come up with a good plan. The other girl is having trouble with her man, who just had the affair. They party a little bit, have a good time, then the story turns dark in the second half. Near the end the characters start getting knocked off one by one. The film ends with the villain winning. It's not as if it's bad, it's just average. As someone who grew up in the 80's, I find the whole dialogue of this generation in 2020 to be distracting, because this generation just doesn't feel like home to me. The main criticism is the unevenness of the whole thing. Maybe I'm being a little harsh. I'm sure that Dave Franco was trying to do something a little different. We never get to see the killer's actual face. This has a different type of motion to it which some might find a little distracting. It is competently done and entertaining, to put it that way."}, {"id": 247, "text": "I started watching How to Get Away with Murder due to my friends and family telling me how awesome it is and you just have to watch it. I didn't even make it through the first season because the characters are sooooo unlikable. The Rental has the same hype with even more unlikable characters making stupid, idiotic decisions. The first half is boring as heck with all the adolescent relationships being fleshed out, and the second half is just as bad with no pay off. Do yourself a favor and watch Don't tell Anyone."}, {"id": 248, "text": "Not nearly as bad as many of the reviews claim. That said, it is not a good film. If you are one that enjoys home invasion films you might as well check it out. If you don't, it's pretty hard to recommend. Within 6 months I'll probably rent it again--because it's so utterly forgettable that I will have forgotten that I'd seen it already."}, {"id": 249, "text": "If you look up boring in a dictionary you'll find this movie as an example"}, {"id": 250, "text": "Nothing in the film makes senseThings the characters do, you wouldn't do in real lifeBrings drugs, gets drugs out and says you 3 have some I will have some tomorrow, why not just get them out tomorrow once you have done all the stuff you had planned for the day you silly cow.Confrontations unbelievable and forced just so you believe what's happening but you don't because it isn't how a normal person would act.Stupid film crap acting don't waste your time"}, {"id": 251, "text": "The Rental is a fine directorial debut from Dave Franco and even if his first film wasnt on level of his brother first one,rental was still a watchable atmospheric horror with some good cast and some good use of atmosphere and suspense,characters were nothing special,they didnt have nothing interesting about them and they felt in a list of walking cliche characters,which is unfortunate cause this film has a talented cast compared to many other horror films,ending and third act were the weakest parts of a film and in that time everything started to break peace by peace,but solid staff from first and second act saved it"}, {"id": 252, "text": "Rented this based off Stephen King recommendation. What was he thinking?! I'll stick to reading his books instead of taking his movie recommendations. Boring. Stilted performances. Absolutely NO payoff. This is not a Thriller or a Horror movie. It is a waste of time."}, {"id": 253, "text": "It kept me engaged all the way through. A quartet arrives at a weekend rental. It consists of two couples, but two of the quartet who are not together slip their bonds and have a brief affair that lasts all of one boink in the shower. The next day the woman in question notices a camera in the shower-head. We then are in on the serial killer's moves. This movie has a strange ending that seems to pander to sequelism but then it becomes revealing."}, {"id": 254, "text": "A below mediocre movie with and ending worst than the TV show Lost. It's almost like there was no ending, except that the movie ran credits and stopped."}, {"id": 255, "text": "This really wasn't too shabby at all. Good acting, and i generally liked the plot. The only downside is i think they could have easily done a lot more with this movie to have made it a whole lot better.Wouldn't say this is a horror, but not a bad thriller by a long shot."}, {"id": 256, "text": "The story isn't bad but the direction and the acting doesn't grip your attention, pretty predictable and nothing new, if you've watched Ritual (2012)."}, {"id": 257, "text": "The Rental is the kind of polished, non-threatening horror that, despite a few moments that miss the mark, makes for a great weekend watch. Though it never quite reaches its full potential, it's entertaining enough with an engaging cast and a few genuinely creepy moments."}, {"id": 258, "text": "A nice movie. With a lot of realistic and strong acting and atmosphere. Story wise the are strong plusses and minuses. Clearly a beginner's movie, but a swell done start."}, {"id": 259, "text": "This is one of the few releases of 2020 that has been shown publicly (drive-ins). Given the lack of competition, The Rental could win an Academy Award. Doesn't that keep you awake at night?"}, {"id": 260, "text": "Have you seen 13 Cameras? Franco certainly has. It's pretty similar. This has better cinematography and better actors, but the story isn't nearly as interesting. Horror fans will easily predict where it's heading. Even the small twist can be seen from a mile away. I won't spoil whether there is a survivor, survivors, or are no survivors at all..but that's really the only part that mildly surprised me. All that said, this isn't a bad movie. It's also not a good movie. It's the epitome of an average slasher. That's fine though. I appreciate Franco choosing the horror genre. This may be a one time thing, but if he sticks with horror and has better material, he could carve himself a name in the genre. For his first attempt, it's hard to be overly critical. I do see promise and would gladly watch his next horror film to see the growth, should he choose to give it a go. I think a found footage film would be suit him well."}, {"id": 261, "text": "You have to go into this movie and realize that it was a very low budget movie and I think they did pretty good with it. Dave Franco took a pretty solid cast of actors and made them work together pretty well. It was as scary or tense as I thought it could be at times but it did have its moments. The plot behind the movie was fairly basic and predicted for the most part. There were still some things I did not seeming coming which I won't say. For the price I think this movie is well worth it."}, {"id": 262, "text": "Loved the cast, loved the idea - but it was very very slow."}, {"id": 263, "text": "It has been one of the most regrettable movies I have seen, don't waste your time watching it"}, {"id": 264, "text": "This is a different horror film than we're used to seeing. It's an independent, short, and simple horror/thriller. I might call it mumblegore since it relies on naturalistic acting of 20/30-year olds and a low budget. It follows a pair of couples staying in a rental house, when they realize something strange and creepy is happening. The film has some things I appreciate like characters blatantly calling out racist characters' microaggressions and a plot that subverts expectations. However, the film is weak in its motivations and the sense of emptiness it carries. There's not much going on and some plot decisions are strange and frustrating, in a sense that it ruins parts of the movie. Overall, my favorite part of the film was probably how interesting the montage scene is."}, {"id": 265, "text": "The movie is very slow and dull, only climax is interesting but again end is nothing explanation and we could not understand who was behind this drama. Story seems inspired by ' I saw what you did last night' theme series movies. Actors and actresses are average, non of impressed us. Once time watchable only keeping mind its slowness."}, {"id": 266, "text": "As a directorial debut, it is definitely not inadequate. As a horror film, however, it is not one.The pace is way too slow for a horror film, and for a thriller, well, it has not much thrill.The only thing I appreciate is that they do not over-use music to compansate the lack of action.As audience, I could not relate with the characters in the movie. Therefore, I did not care about them.Spoilers!The villain, or the killer is unidentified (unless I missed a scene or something) and the movie ends that way.One major plot hole, though: at the beginning, the character says the house belongs to his brother, and at the end we see the killer renting another apartment. So, when the bodies are found, his identity and digital finger print can be found easily.Yet, to be honest, this could happen in real life."}, {"id": 267, "text": "The movie is dark. I like that. But it also leaves you with a bunch of question marks. It was a bit hastily tied together. Actors were good I thought. Maybe not likeable but doesn't that make sense for this type of movie?"}, {"id": 268, "text": "Why is it some movie makers think people wanna sit through an hour of rambling, and nothingness, before getting to some actual point. Everything doesnt need 60 minute build up. Get to the damn action already. This movie is beyond boring. I didn't even bother to finish it. Do yourself a favor... Find another rental."}, {"id": 269, "text": "Pacing in these elevated horror movies has been awful the last 4-5 years... You leave literally 20 minutes for all the tense scenes with no gore for an hour and a half movie based on wacky tech bro hipster relationships.... Could have been way better."}, {"id": 270, "text": "With The Rental, first-time feature director Dave Franco has crafted a slow-burning thriller that's nicely tense even if it doesn't feel completely original. It's a movie that probably fits best into the home invasion category, but the on-screen violence is kept to a minimum. Instead, The Rental focuses heavily on building characters and their complicated relationships, so when the bad stuff starts happening, the characters' reactions feel more natural and understandable within the context of the movie. You might feel like you've seen movies like this before (and you probably have), but the acting is great, the writing is solid, and the direction brings everything together in a satisfying way that makes the movie enjoyable even if you can predict what's about to happen next."}, {"id": 271, "text": "First off I did not like the characters in the beginning, especially Mina. You can tell she is a leftist lib / millennial type. Californians are strange. Very predictable and rushed. It was not until about midway through the movie did I finally get over how strange or bad the acting / direction was in the first thirty minutes or so. It seemed rush and predictable. With that being said, the last 45 min was the best part of the film, it was scary and had some moments where you jumped. Its a one and done type of movie, but worth the 1 1/2 to see."}, {"id": 272, "text": "I was a little shocked that this movie didn't turn out to be terrible. Surprisingly it was a pretty decent film. Yes it was predictable at times, but it was still enjoyable. I didn't expect it to end the way it did. I was kind of surprised everyone died in the end. The kill scenes were pretty lame, with the exception of the backwards hammer shot to the head. That was a good one. I also thought the twist in the end was fairly clever. I'll give this movie one thumb up 👍"}, {"id": 273, "text": "Last weekend i've seen The Rental and I got to admit it's a very enjoyable flick. The first three quarters of the movie feel a bit slow and forced, it's all about setting the stage for the final act and feeding into the Paranoia-vibe. In the last 20 mins or so, all hell breaks loose (Horror enters the stage) and it goes downhill pretty quickly. I'd really have liked to see more glimpses of this in the earlier stage of the movie. It seems The Rental borrowed a lot from horror classics like Halloween and Texas Chainsaw Massacre but also more recent movies like The Collector. It tries, but in my opinion fails, to deliver this anxiety/paranoia In the same way these movies do. Nevertheless The Rental is a decent movie, mainly because of the acting. Don't expect anything innovative or new, just a basic digital-home-invasion movie :)"}, {"id": 274, "text": "Unlike most of the 'go some place, get terrorized' fodder out there (and there ar thousands it feels like), this one has decent character development, great actors and very nice technical production values. What it falls victim to is the genre tropes - got running in the forest, etc. It feels like as if someone had a great idea and just could not be bothered by finishing it with the excitement and enthusiasm that ignited the whole thing. I love what Joe S does with high concept, low budget fare and this one is a near miss. Nice first feature by Franco and it is always awesome to watch Alison Brie (oddly, it feels like her character in this is an extension of the one in GLOW) and Dan Stevens, even if it is in a movie that ultimately forces the question 'Why did I even rent that?'"}, {"id": 275, "text": "It's not the best horror movie ever but it's not bad either. The plot doesn't add anything new but the movie looks fantastic on camera. A decent movie to pass the time."}, {"id": 276, "text": "The movie was great in the first part - drama, mystery, story etc. and it all leads up to uncertain outcome and keeps the viewer in suspense BUT then... movie switches to a completely different style and everything you saw up till this point becomes useless. Feels like somebody came in the middle of the production and just shut it down. They had to save the movie and made up this ending like in 10 minutes. Excellent beginning, pointless ending."}, {"id": 277, "text": "The premise has been done hundreds times before,so there's not much something new to expect from the writing. Considering the run time is less than 90min, The Rental is really slow paced. There's little to nothing happened throughout the film. It's barely a thriller, let alone a horror film. Though it's really bland, but it's not entirely un-enjoyable either. I find it slightly entertaining for some unknown reasons. oh also, the acting is kinda good, i guess. so there's that"}, {"id": 278, "text": "The Rental is a new horror thriller directed, written and produced by Dave Franco. This is the first film he has directed and he is more known as an actor in the film world.In the film, brothers Charlie (Dan Stevens) and Josh (Jeremy Allen White) decide to go on a weekend trip with their friends. They have found a perfect house online by the sea and are trying to make it a pleasant weekend. They only suspect that their landlord is somewhat racist towards Josh his Muslim girlfriend Mina (Sheila Vand). Despite this mistrust, the four try to make it a fun weekend, but during this time together they get to know each other better than they expected. This is how their mutual relationships are tested. When Charlie discovers they've been secretly filmed all weekend, he must choose to find the hidden footage or confess what he secretly did over the weekend.Dave Franco has portrayed this film as his first directed film, but he has also taken on a bit too much hay by partly writing and producing this film. By taking on all these different tasks, he still struggles to convey the film clearly. At one point, the movie almost comes across as a long episode of Temptation Island and turns more into a teen drama than a horror thriller. This aspect comes to the fore without further explanation. Due to these unclear and sudden changes of genre, the film can come across as tedious.The acting comes across as nice, but due to the unclear script, the cast doesn't really have many chances to make something special out of their roles. The characters initially come across as adults with work, but later the characters behave more like teenagers."}, {"id": 279, "text": "In fact, you've seen it several times - in various ways and aspects. How many horror movies have you seen where the first 2 acts are fairly decent and then suddenly it all falls apart for the third act?How many movies have you seen where there's a build-up of tension between the main characters then suddenly the director realized 'Oh, we need to actually make something happen' - so a series of killings is shoehorned in... without any back story, without any rhyme or reason?How many movies have done the voyeurism angle and you think 'Well maybe they won't mess it up this time' - but then they do?There's nothing new here. You will watch this and not come away with any new experience unless you've never seen a movie in this genre before."}, {"id": 280, "text": "I'm really surprised why this has 5.7 when there're movie that deserve so much more with 4.5 stars.This is completely slow, which it wouldn't be a problem if it was a good movie but it isn't.When it seems like finally is going to start the action, there are 15 minutes left to the end. The deaths are just no sense and the principal character just vanish, ending in nothing.They don't explain anything about the antagonist, just leave us with nothing but confusion.Is a movie with the typical plot, which again, is not the problem. The problem is they couldn't make a good plot, they couldn't make a good ending, it leaves you with a really bad taste, feels really incomplete.I'm someone who gives a chance to every single movie and I really expected so much more for that 5,7 stars."}, {"id": 281, "text": "* There is no end credit scene *Dave Franco in his directional debut! plus crew brought a true effective nightmare to life. The story sets when two couples rent a vacation home and what should have been a fun getaway it turns into horror. A familiar concept, done in different ways, and yet Dave Franco's impressive mind came up with one of the most intense films, a fresh gem for this genre. Everything was perfectly calculated the right balanced buildup of introducing what the characters were about while the desired element lingers in the background, and an outstanding execution when it reaches the climax. The timely suspense was escalating the tension, from the moment it starts the tightness never stopped and loved every second of it. How terrifying it is to think that this could really happen and how also it rings of truth on relationship problems. A common situation in which surrounds the saying what goes around comes around gets an effective judgment. The ending sequence was flawless and terrifying, there is no better way to end it plus a sharp execution towards the music.I'm amazed by the composers Danny Bensi and Saunder Jurriaans! they really know how to get in your skin with their music! I love their work with the film The Lodge (2019) and now they keep bringing more of their phenomenal sinister vibe.The cast Dan Stevens, Sheila Vand, Jeremy Allen White, and Alison Brie performed amazingly. I have to give it to Dan Stevens, how he keeps nailing every role and his presence gives any scene a unique captivating vibe. Also much-love attention to Sheila Vand, what a beauty and outstanding performance, she needs to do more movies in lead roles like this one."}, {"id": 282, "text": "I really wanted to like this movie, unfortunately, there was nothing at all to like. A big calling point of this, for many, will be to see the directional debut of Dave Franco.Well, where to begin? This is yet another 2020 horror film that should not even be classed as a horror film at all. When over 75% of the movie is a drama, then it should be classed that way. There is hardly anything horrifying or thrilling about this one, well, except for the awful production itself. There's hardly any horror elements except for in the very latter part of the movie, even those are poorly executed.None of the characters here are likeable, there's a reason to dislike all of them. I found myself not caring about any of them, well, except for the dog. The pace is slow and the acting is mediocre. The concept itself is familiar and I couldn't help but think that I've seen this before, just executed a hell of a lot better in other movies.It feels like Dave Franco was going for a slow burn type horror that had a stunning conclusion. This is so much of a slow burner that by the time any of the action happened, I was completely disinterested. I stuck around, waiting for the climax and felt greatly let down. The conclusion, is confusing and doesn't offer any real resolve. It's a waste of time and feels like a kick in the teeth after sitting through the rest.The killer himself only gets a few minutes of actual screen time and those happen towards the very end of the film. You find out no information about him, his motive or his purpose. The kills are very weak and not at all graphic.There's literally nothing interesting here at all. A complete lack of atmosphere and tension, it feels very amateurish. Avoid."}, {"id": 283, "text": "The rental was a movie that I honestly didn't expect to be that good because from the trailer it looked like every other horror movie and honestly it is but this movie is actually pretty good and honestly Dave Franco did a great job with this movie for his first time in the directing chair. There is a lot to like about this movie even though it's not a perfect movie. First of the cast in this movie all do a great job in there respected roles but the 2 main stand outs of this movie have to be Dan Stevens and Alison Brie are both really great in this movie. The music in this movie honestly is really good to and it plays a great part in setting up the creepy autmosphere in this movie. This movie also has pretty good cinematography and also is a really pretty movie. The scares in this movie are very little but when they happen they are very well done and honestly had a chill going down my spine. The movie also doesn't overstay it's welcome it's only a 90 minute movie and that is perfect runtime for this movie. The movie is also a lot of fun to watch. But this is not a perfect movie at all and it does have some problems to it. The characters in this movie are not likeable at all they are all jerks yes Stevens and Brie's characters are the only decent characters in this movie but they are still jerks. The movies also has a lot of horror movie cliches that can't be escaped. Also, this movie does have a lot of interesting plot points that just don't get any looking into which sucks because they were really interesting. Overall, I really liked the rental more than I expected to, yes it's not a perfect horror movie but it's for sure a horror movie you should give a try."}, {"id": 284, "text": "3.5 out of 5 stars.The Rental is a pretty fair horror film about four friends who rent a beach house for the weekend. Only to discover they are being watched through hidden cameras in the house.The plot has some similarities to Vacancy film. But with two couples renting a house for the weekend. Only to be stalked by a creeper.The film does have a slow building suspense build up. Charlie (Dan Stevens) and his wife Michelle (Allison Brie) going with his brother Josh (Jeremy Allen White) and his girlfriend Mina (Sheila Vand). While the film does build some tension between Charlie and Mina. As they work together. And there is some tension like an affair. Or Mina feeling discriminated as her renting application got denied while Charlie easily got accepted.The cast did a good job with there performances. The music score also helped with the unsettling tone. Things do escalate in the last half hour when the characters are being stalked by a mysterious person. It may not be as scary or thrilling. It does have some suspense."}, {"id": 285, "text": "Well, firstly I'd like to say looking at the IMDB score, and the poor reviews, I wasn't at all optimistic heading into this. Yet with COVID-19 restrictions and what not, an abundance of time and lack of options led me to this. For sixty-minutes of this film, the drama, character building, story... basically every element of a horror film that is, all so often, done wrong... this had all that. For sixty-minutes I witnessed four characters with motives and moral dilemma's, indifferences and affection, pour out in front of me. Let's say this wasn't a horror film, but a drama about moral decisions and character studies, this would have been a hit. But then the last thirty minutes takes everything you have loved about these characters, condenses it completely and ties a lovely generic horror ending bow on top. This is still a six, this IS a film worth watching for that sixty-minutes of fantastic scripting and acting, but you will be disappointed with the ending. I hope Dave Franco gives this gig another shot, he's close, he's got talent, but pull away from the influences of production companies (if this was the case) and just go with what you feel is right."}, {"id": 286, "text": "Dave Franco's The Rental is the perfect tonic for those who hate the idea of going on a trip to a stranger's house, who has not been vetted, chosen only because some strangers online said he's a nice host. Cynical, tense and twisted, The Rental is a slow, violent romp around the worst parts of couple vacations.Although it takes its time getting to its brutal denouement, the film wastes no time in painting its four leads as horribly as possible. When chaos ensues, their addictions, malaises and secrets cause enough of a maelstrom that their inability to see what's happening before its way too late makes sense. Scenes of fake domestic bliss, close ups of roving eyes, guilty faces in the background and careless slips of tongue keep tension from ever ebbing as the situation worsens.A great first flick from Dave Franco, with a great cast ready to be awful. Definitely recommend if you ever wished you'd been invited out to the cabin in the woods."}, {"id": 287, "text": "SYNOPSIS: Charlie (Dan Stevens), his brother Josh (Jeremy Allen White) and they girlfriends decide to take a weekend trip out to a very nice house in the hills. What was supposed to be a celebratory get-away begins to get darker and darker.REVIEW: In case you didn't understand my title, it's a reference to the Showtime TV Series Shameless where Jeremy Allen White plays a character name Lip (short for Philip) and it's really nice to see him a part of another film since he is my absolute favorite character from Shameless.The Rental is Dave Franco's directorial debut and I will say that I can see potential in his ability. This film felt like a film that was supposed to be 2-hours, but was forced to cut 40 minutes out of the runtime. I'm not saying that 2 hours would've serviced this film, but it just felt rushed. The acting is this is done well as you'd expect from the cast, however, the story itself was just bland. It was a simple premise that's been used a million times and I'm not saying it can't be done well, but what Franco tries to do here, doesn't add anything. In fact, I'd say it took away from the sub genre. For being less than an hour and a half, it felt like it took forever for anything thrilling began to happen and when it finally did, there was 10 minutes left in the film and so it was rushed. Now, the twist they were going for could've worked in a film that moved at a faster pace or in a film with a long runtime. This idea of not knowing is the scariest part only works when you have time to build a connection. A perfect example is Michael Myers in Halloween. We have no idea what his motive is, but we have a connection to him. We know who he is and through the runtime in the original 1978 Carpenter version, we're with him and the main character long enough to build the tension. It allows us to connect to the main character and for us to be interested in this hunter and hunted story. A film that is able to encapsulate this well in a short amount of time is Hush. A very well made cat and mouse, where we don't know the motive, which in turn makes it a more impactful horror.At the end of the day, I could see Dave Franco as a talented director and this as his first lesson. I do hope he tries again and writes a script that captures what he was looking for in a more affective way. 4/10."}, {"id": 288, "text": "Taking the slasher formula, applying it to the Airbnb terrain, and still failing to bring anything new to the table, The Rental is a run-of-the-mill horror-thriller that takes a conventional approach to a premise that packed plenty of potential &amp; promise, and settles for far less than what it was capable of despite there being so many options to explore right in front of it.Co-written &amp; directed by Dave Franco in what's his directorial debut, the story does score points for its neat production design, excellent use of camera &amp; portent score but then, it also loses some for taking a fresh idea and creating the most unoriginal, generic &amp; derivative narrative out of it. Instead of subverting the genre conventions, it decides to play by the established set of norms.Every time an opportunity opens up to take the story into interesting places, Franco opts for the least impressive choice available. Add to that, all the characters remain just as unappealing despite the talent involved. The chosen camera angles evoke a sense of being watched, plus the epilogue alone is better than rest of the story. And for some inexplicable reason, even the gleeful violence is toned down in this.Overall, The Rental is competently crafted for a first time effort but it still finishes as yet another middling entry in a subgenre that's filled to the brim with such middle-of-the-road examples. Offering nothing that we haven't seen before, it is as predictable as I feared, and with no characters to root for, the interest starts to fizzle out at a far quicker rate than expected. In short, a mediocre at best home-invasion slasher film."}, {"id": 289, "text": "If you enjoy reading my Spoiler-Free reviews, please follow my blog :)The Rental is Dave Franco's debut as both director and screenwriter of a feature film. Making a successful horror movie was never an easy task, but I believe it's even harder nowadays. This genre has evolved in so many ways by delving into distinct subgenres and helping new directors deliver brilliant horror stories. Of course, every year has dozens of awful horror films, and most of the Worst Movies of the Year lists possess more than one horror flick. However, I firmly defend horror is reaching audiences like never before, and I genuinely believe that it's a matter of time until a Best Picture award goes to this genre.So, is The Rental one of the better ones or not so much? Well, it's as okay as it can be. I find it hard to heavily criticize a film that doesn't really give me much to actually analyze. It's a straightforward story with barely any complexity. Four characters with clear yet generic motivations. Their relationships and how they handle each romantic bond is surprisingly the most interesting aspect of the movie. Still, besides being somewhat predictable, it seems more captivating than what it truly is because one particular screenplay element fails to deliver a compelling narrative.The main (and honestly, only) horror component of the story is no more than a hollow attempt at creating a franchise. Now, there's nothing wrong with teasing an overarching story in the first film of a saga, but if this tease plays the entire horror role, then the only feeling Franco is getting from the audience is disappointment. Viewers might look forward to jumpscares and creepy sequences, but if the questions the movie makes are left unanswered, chances are people will dislike the ambiguity.I'd be interested in a sequel because this first film creates a really intriguing mystery that I'd love to see developed and eventually solved. However, this comes at the cost of sacrificing the latter flick since it basically uses the whole runtime to introduce the overarching character/element. The Rental follows the usual friends in a vacation house where things are not what they seem formula, which doesn't really set up Franco as a horror director to follow closely. He shows a bit of skill, the uneasy atmosphere is well-established, and he lets the actors play off their dialogues without too many cuts, something I deeply enjoy.Technically, it's quite good, to be honest. It's a very dark movie, but I could see everything clearly, which is usually a problem in this type of horror film. The third act might be partially a letdown, but its execution holds the necessary tension and suspense. Dan Stevens and Sheila Vand deliver two great performances, showing remarkable chemistry. Alison Brie and Jeremy Allen White are also good, but the previous duo steals the spotlight. I wish it had more horror-like sequences, even though I appreciate the focus on the character's relationships and dynamics.All in all, The Rental is a clear attempt at creating a new horror franchise, and honestly, it partially works. If success means getting the viewers interested in a sequel, then mission accomplished. However, sacrificing the first movie of a possible saga to just introduce its main horror element doesn't quite work as Dave Franco might have thought. In his directorial debut, Franco focuses on the characters and their relationships, which are undoubtedly the most captivating aspects of the film, also thanks to a fantastic cast. Despite some neat technical attributes, the formulaic screenplay and its predictable developments are far from being entertaining enough to hold my attention. The dozens of unanswered questions definitely leave an open door to produce a genuinely compelling sequel, but this first installment will always feel more like a prologue than an actual movie. If you're just looking for a simple horror flick to spend your extra time, this one won't surprise you, but it might be a good, inoffensive Saturday night pick.Rating: C"}, {"id": 290, "text": "While watching 'The Rental' I kept wondering to myself who the director was, because the film was made with a lot of class clearly. Then the credits rolled and I saw Dave Franco's name appear and I thought it must have been a mistake. I knew he was married to the film's star Alison Brie, but I also knew that he had never directed anything before, let alone a film this good. This is an incredible debut from him, and not only did he direct it but he wrote it too. Anyone who can breathe fresh life into a genre as tired as the horror one is deserves a lot of credit. Perhaps his future is held behind the camera rather than in front of it.The film blew me away by how patient it was. It only runs for 88 minutes, yet it was so happy to slowly set the story up, all the while only giving us small hints as to what the actual danger was to these characters. There is a cheap jump-scare or two early on that the film could have done without, but otherwise the first half of this film is extremely well done in the sense that we know there is danger, but we don't know who, how or what. It adds a mysterious element to the film that I absolutely loved.Then the final act kicks into gear and the film goes into overdrive. Very rarely anymore is a film able to raise my heart-rate or get me on the edge of my seat, but 'The Rental' did both. The scare sequences aren't conventional and I think that's why they worked. It was impossible to predict exactly what was coming next. I had a terrific time with this film and would highly recommend people give it a watch."}, {"id": 291, "text": "The pandemic has me wanting to get out and see a movie so I checked IMDB reviews and watched the trailer only to be a bit disappointed. Screw it! Went anyway.Ok, yes it's kinda' predictable with unknown to me actors but why was it getting me to talk at the characters in the theater (the theater was empty) as the plot slowly and casually unfolded with a dark and brooding atmosphere and creepy POV's by both the director and cinematographer? it's a very well acted, beautifully photographed slow paced mature interpretation of the thriller genre. And after it ended I felt I saw a very good movie because I was thoroughly entertained. HUH?! Was I being hypnotized into liking what appears to be a contrived movie?I mean every preconception and logical conclusion associated with this movie genre were displayed on screen but setup, presented and resolved with a quick delivery that defied all of this. Things aren't as they obviously appear which is even more evident at the end of the movie that had me scratching my head days after when it finally dawned on me this was a clever way to loop back to dash even further the audience's preconceptions of what they thought they saw and at the same time what it implies about short term vacation rentals like AirBnB.There's an antagonist that later appears you think is who he's suppose to be, motivated by actions you conclude is obvious revenge or entrapment as events and circumstances slowly unfold to prevent the renters from calling the police. No. That wouldn't make sense due to it conflicting with the screwed up relationships between the two couples that create more complex motivations and intent. How is this going to be resolved without police intervention?The writer, director and cinematographer appear to be guiding the audience using familiar short and brief scenes mixed with long contemplative camera angles and odd out of focus close ups that sneaks up on the audience to vaguely reveal a dark figure right of screen so you're not sure what it is but have to obviously conclude is the antagonist, or the landlord? And of course it's not WHO the audience thinks it is. Or is it? It's a very intelligently told thriller. I highly recommend it."}, {"id": 292, "text": "To start off, I liked quite a few things about The Rental, Dave Franco's directorial debut. While it deals with the concepts of racial discrimination and voyeurism that have been handled better in other films, The Rental adds a layer of sophisticated relationship chemistry between the four protagonists. They're flawed and vulnerable the way all young people are. While they display composure at first, when the situation starts to turn on them, they lose their cool and start making naive decisions. This complexity being explored to a great extent is what made me like The Rental.The performances are good across the board - Dan Stevens, Alison Brie, Sheila Vand, and Jeremy Allen White - all of them did a neat job with their respective roles. The beautiful hilltop house (with splendid views of the ocean), the foggy night atmosphere, the tension-inducing background score, and the overall restlessness of the screenplay certainly work in the film's favor. From the 30-minute mark, it's mostly an intense, thrill-filled ride all the way. Except for the rather bland climax, I suppose. I really wish there was more to the bad guy and his motive. The Rental may not be the best voyeur thriller out there, but it does make you rethink staying in countryside BnBs or at least, just be a little more careful in that regard."}, {"id": 293, "text": "Dave Franco's writing and directorial debut, The Rental, is a good entry to his portfolio as a new film-maker. It's not a bad start by any means and with further development and experience, I can only imagine that he'll get better. The Rental is a horror/thriller in the style of The Strangers, Last House on The Left, or When a Stranger Calls. The story follows two couples who rent a seaside home for a short vacation and discover that they are being watched by a mysterious presence. The film painstakingly develops each of the characters so that they're not just expendable victims like in other films, this is both good and bad as it explains who these people are, why they are there, and what motives and personality traits they have. However, this intricate process of character development causes the film to take too long to get to the violent tension at the climax of the story. Throughout the duration of the film we're provided with minor details and nuances that hint at a presence or some mysterious event that will eventually unfold. For instance, a locked door, strange items, or a feeling that they're being watched someone somewhere. When all of these things come together and the true story is revealed, the payoff isn't really that great. Alot of the violence is perpetrated offscreen and the ending leaves more to be desired. I would define this are more of a character study set within the backdrop of a home invasion thriller. In that regard, it's OK, if that was the intention."}, {"id": 294, "text": "The Rental is a doer upper with potential...This is a basic but functional horror film with a simple framework that's in need of a little extra TLC. In short, it gets the basic's right with a workable premise but delivers mostly perfunctory, rather than spine chilling scares.In the latter half of the film, you really get the feeling to a degree, that its going through the motions. That said, It does have its moments. The scene with the car window and the end to the final pursuit, work extremely well.I suspect this film leaves the door open to a second or third house call. Indeed, I hope they pursue this further, taking a little extra time, to craft more of the nail biting and jump scare's, horror viewers crave.6/10."}, {"id": 295, "text": "Well, this is my first review here, and I hardly care to even if I like the movie. Reason being is that I think 'complaining' has become the audience's norm these days. Too much available consumption and little time to appreciate. I had to literary unsubscribe from two long time movie review channels on YouTube for putting this movie down.If you care to hear me out, let me explain:1) If you've ever traveled enough times to find yourself worried about being watched in an airbnb (especially abroad), you will love this movie. Tackling the subject with a horror / thriller genre just hit home for be.2) Let's talk about directing. For a first time directer; fantastic. The scene in the end with Mina by the cliff is the most subtle 'hold your breath' I've seen this year. I mean the few seconds you need to understand what really happened. Wow. Not only was it surprising and metaphorical, but it actually flipped the genre on its head.3) Let's talk acting. I believed everyone. Not to say I loved them. This isn't that kind of movie. People are real, stupid and selfish like all of us. But are they underdeveloped? Hell no. I didn't need to know more about them. I understood them perfectly that their decisions in the last few minutes came natural to me.4) And now let's talk the two things I liked the most about the movie: a - Tension. Tension. Tension. Sometimes inconsistent or slow, and sometimes you're not sure whether this is a thriller or horror or drama (though you do in the last ten minutes) but I enjoyed every moment. b - The ending. It's not that big reveal or twist, but the way it's presented, that's the horror. Again two strikes in one. You get to have an unusual and different ending and (don't want to spoil anything) it's terrifying because of what it MEANS, not what you SEE.I lOVED this movie and will watch it again.In the end, I always remind myself that The Shining was a flop when it was first released. Is the Rental as good, not there, yet. But If Dave Franco grows into two more movies of this caliber, he will come up with something as good. You can sense it. I want to see his next."}, {"id": 296, "text": "The Rental is Dave Franco's directorial debut. What I thought would be a marketing move turned out to be a refreshingly competent first movie. The cinematography is great, and the movie doesn't rush shots, which I very much like. Some shots just linger, waiting to show something, not cutting away, not yet revealing the next information either. Direction and cinematography are seriously great. Sadly, the script and acting are not.Two couples go on a weekend-long trip away. At the rented oceanfront house, they discover that they are being watched.The idea isn't original, but it doesn't have to be. There are many movies out there that follow a simple or unoriginal premise, but still turn out to be great. The Rental is not one of these movies, despite my initial praise.The buildup takes a bit too long for my taste. I don't mind a slow burn, but this movie really takes its time. There's a tense atmosphere built throughout the movie. The slightly desaturated look, the dark music, the shots looking off into the grey distance, all convey a sense of dread.Then, there's the exposition. God, is it awful. The way information about the characters or their intentions are revealed, especially in the first half, is ridiculously bad.Speaking of the characters, they are really bland. The movie tries to give them distinct personalities, but fails to make any of them really likeable or interesting. Part of that is the writing, the other is the acting. Alison Brie does a good enough job with what she has to work with. Dan Stevens, Sheila Vand and Jeremy Allen White are between mediocre and bad. There is no chemistry. All relationships feel forced. The dialogue is mostly not believable.All in all, the great direction by Franco and cinematography by Christian Sprenger are let down by a bad script (also by Franco) and mostly mediocre acting. Given something better to work with, I am still looking forward to what Franco does next - maybe he should let someone else write for him and focus on directing instead. It could be a winner."}, {"id": 297, "text": "While this film made my brain hurt a couple of times because of how unrealistic and stupid the characters were, I reassessed my thoughts on this one when I was writing this.The film gets much better if you finish it, even though it is incredibly painful to watch so much stupidity at times. Many things in this make no sense but I don't want to get into spoilers. The weirdest thing, probably, was the awkward racism and misogyny commentaries, these felt really out of place.Why I gave this 7 instead of a 4 or 5 is because I'm almost sure that due to the way the ending was shot, this film is not a case of the creators messing up, this was quite intentional and was made in this specific way to emphasize certain key points.I can't say this though about the whole film, since it is very inconsistent and barely believable at times, but the core idea, again, if intentional, is worth it. I can't really discuss it without diving into spoilers, but I loved the vibe that makes you feel like you're watching a crime mystery documentary. I love how methodical and cold it got in the end (powered by a great soundtrack). I really hope that the message I got from this film was the one the creators wanted me to understand.Thus, in my head, this film came all the way from garbage to an interesting experience.P.S. The poster seriously misrepresents this film, it looks like the film is about aliens or something."}, {"id": 298, "text": "Writer/director Dave Franco's first directorial debut, The Rental, has enough of the horror, thriller tropes to make the genre's devotees happy. For the rest of us who merely want a straightforward depiction about what can go wrong with two couples vacationing together on the Oregon coast, satisfaction is within reach.Relative depth of characterization and expert acting supported by reasonable suspense reveal what we really know and how we react to the unknown. Case in point: Charlie (Dan Stevens) and Michele (Alison Brie) are experiencing Charlie's business success, and his brother Josh (Jeremy Allen White) and his wife, Charlie's new partner, Mina (Sheila Vand), join them in a typically stylish coastal rental to celebrate.Franco smartly distributes his exposition before disclosing the identity of the genre-requisite stalker. More so does he slowly expose the real stalker-the attraction of Charlie and Mina, which leads to indiscretion that leads to mayhem between the couples. What Franco is careful to preserve is the realism of dissembling characters and the effects of their ill-considered actions.While a surveillance motif is prominent-cameras all over the house most notably in the shower (several Hitchcock similarities)-it is within the consciences of the miscreants that the disclosure of their secrets weighs most heavily. The utterly human urge to sin and hide the disclosure is more potent than the suspicion that the property manager, Taylor (Toby Huss), is a wacko stalker.The first hour and 10 minutes or so are expertly low-key, building to naughtiness and death with an unusually small set of jump scares and red herrings. Franco remains true to the operative motif that mining information and letting it go is the most lethal act of all.The Rental outstrips star Kevin Bacon's recent You Should Have Left if for nothing else because it's the fraught relationships that menace, not the stalkers. Bacon was mostly interior-The Rental is people.Yes, The Rental will make you pause before you take on Airbnb."}, {"id": 299, "text": "I'm sorry for Dave Franco (I fairly like the guy), but this isn't the best way to debut as a director. This film is bad and so corny.The premise is quite a cliche, but I said ok let's give it a try. The main issue here are the protagonists. They're a bunch of mediocre characters that will just annoy you. They act either as morons or as despicable people so much that by the end you will want them to meet their end.There isn't much in terms of plot. It's a straightforward plot about four people renting a house for a few days and than something bad happens. Something bad does happen, which is that the characters are bad, you will have no interest in their personality and in what they do.I'd say this film isn't worth watching. It's just annoying."}, {"id": 300, "text": "This started all right but went schlocky.It sets up to be clever and different but ends up being the exact same as every other horror film.The main problem, though decently acted the characters are just sooo unlikeable.It really could of been a great film if they knew exactly what film they were making. Felt like two ideas neither particularly strong.I appreciate the Cinematography, that was pretty good. It was low budget but they made this look decent.Just needed a better production in the creative side of things."}, {"id": 301, "text": "12 minutes. That's how far I got into this movie. I gave it 4 stars randomly. After all, I turned it off after only 12 minute.Why so soon? No, I didn't pass my judgement on it and determined that the movie was not good.It wasn't anything like that. I just couldn't get past that zit scene at the beginning of the move. I was so disgusted by it I couldn't think of anything else and finally, I realized that it was no use to keep watching it. That scene would stay with me for the next 90 minutes and I won't be able to think of anything else.It makes me wonder. Did director of this movie really think it was a good idea to give the viewers that little peace of realism. I understand gratuitous nudity. Everyone enjoys it. But bodily fluids? What was that all about? What's next, people are going to blow their noses or take a dump and spend a long time examining what they have just ejected?Too bad I won't be able to finish watching this movie. I probably would like it."}, {"id": 302, "text": "The rental, is the debut movie of director Dave Franco, brother of James Franco. It has decent acting, a few cinematic shots, some original ideas based on which it was marketed. But as the movie progresses, the story becomes complacent and predictable.If the writers actually wanted to make points about race and the current culture of staying in other peoples houses as rentals... why go the already done route and make it a slasher? Instead I think race was just used as a check mark on diversity and add a layer into characters which clearly lacked any. It's like there were sparks of originality in the beginning but eventually succumbed to the tried and tested route of the slasher genre. Having characters with more nuance would have helped. A critic actually compared it to a Haneke movie(I don't agree) but it brings up the point of how an effective movie actually builds on tension instead of releasing it. Maybe keeping the smaller sub points of race and relationships subtly woven into the story to add tension instead of being used as a distraction would have helped. Instead it feels like it started as a different genre but turned into a slasher. Building an atmosphere goes beyond just adding a few shots of natural landscape and a little foreshadowing. It has to be felt through the characters or else It's just surface level. I wouldn't recommend it if you've already seen movies in the slasher genre and if you haven't I still wouldn't recommend it as there are better ones than this (see Hush)"}, {"id": 303, "text": "We were excited to see this film based on a handful of positive reviews. However, we now feel like we wasted our time because while there are 10 (very) interesting cinematic concepts (written) - The director and actors destroy them with horrific execution and 20 totally unrealistic acting (situational response) absurdities that make this film no better than the worst of the 80s slasher films.This film is timely and relevant given the popularity of rental homes today. However, the cast do things that make no sense and are unbelievable to the point of rolling your eyes. You might stick into this film because it has enough entertaining concepts that you want to believe it, but in the end you do not believe the people and you do not care about them and you do not think that any of this is possible.That said, it may not help you sleep.The biggest disappointment here is that someone came across an interesting concept and whoever actually executed on this concept failed everyone.3.5/10."}, {"id": 304, "text": "I wouldn't say I had high hopes for this film, but when the trailers released and Alison Brie and Dan Stevens showed up I did put this on my calendar.I enjoy a good horror/thriller and having two more or less A-listers in the main cast gave me hope for some elevated material.Despite solid dialog and acting I'm afraid the entire affair was largely hohum. I don't think I'm spoiling anything to say the plot revolves around a cast who rent a summer home for the weekend and something something serial killer stalker etc.In order to avoid yawning through these genre features you really just need one of two things; either an interesting dynamic between the prey or an interesting antagonist. This lacked both. The cast is largely unlikable, there's no one interesting here. The villain, while given a somewhat interesting twist at the end, is largely one note. It was just all very milquetoast.It's a shame really, I noticed this is Dave Francos writing and directorial debut so that may account for the lack of polish. I hope a respected colleague can point him towards one of the experts like Mike Flanagan (HUSH) to beef up the script for the next outing. I did like the twist. It just needed..more."}], "reviews_amount": 305}