{"name": "Christmas on the Square", "titleId": "tt10627548", "reviews": [{"id": 0, "text": "It's embarrassing, cringy, sickly sweet, unoriginal, but, God help me, I do like this film. It's not going to win any awards, and I'd definitely change the channel if someone walked in and caught me watching it, but it's adorable and uplifting with a positive message. It's the sort of film where you get the impression that the only thing the creators wanted to achieve was to put a smile on your face."}, {"id": 1, "text": "I love musicals, I love Dolly and I love Christine Baranski. I hate this movie. The story is utter garbage, character motives are nonsensical, the songs are horribly written and the acting is hard to watch, bar 2/3 exceptions. Christine Baranski does what she can with the role, but the bad writing combined with the surprising amount of religion heavily sprinkled throughout this movie, I found myself pulling my hair out. I hate this move so much and I will never ever watch it again."}, {"id": 2, "text": "I love musicals and I love Dolly but wow this movie contains nonstop music. It was a little hard to get my head around it. I probably won't watch it again and I do watch movies I like over and over again."}, {"id": 3, "text": "Seriously already an classic christmas movie, have a perfect soundtrack, with great performances and choreographies and a consistent story with magic, mystery, have some regular characters but in general, Dolly and the protagonist hold the movie, reminded me Scrooge and still have your own originality."}, {"id": 4, "text": "Ok you have to go into watching this with an open mind. The sets are like it's a play and I think that's the point and that's what oddly worked for the film. The songs are fun and serious and again it oddly worked. The acting is over the top and at times bad but it's a Christmas musical what do you except. The plot has been done countless times before but with Dolly she just makes it magical. Overall it's full of chess and over the top acting and musical scenes but it all works cause you can't take Christmas in the square serious."}, {"id": 5, "text": "I loved Dolly Parton Heartstrings and I love Christmas movies. This was so bad I turned it off after 5 minutes."}, {"id": 6, "text": "It's bad. Really bad. The writing, the effects, the singing, the choreography, the sets. There are some talented people involved, but sadly their talents are obviously consumed by the general awfulness of everything around them.Seriously, don't think that it'll be funny. It won't.Oh, and the constant harping on about religion and piety just makes it that much worse.Our baby shrieking was a welcome distraction."}, {"id": 7, "text": "I love musicals but this was a little boring one. Story is so familiar, nothing is new actually, musics are so easy and simple almost in every song there were only 2 notes so that makes kind of boring...i couldn't get in the movie.. i didn't feel the christmas sprit."}, {"id": 8, "text": "Wonderful songs and message of light and forgiveness. Because the story is set over a couple of days you can't look into it too hard but it's throughly enjoyable and packs a punch if you embrace it for what it is. I'm planning to watch it again this side of Christmas, when work and planning gets too stressful."}, {"id": 9, "text": "This is really so bad that it's kind of fun. The story is dreadful, a merging of A Christmas Carol and It's A Wonderful Life, with vapid, uninspired characters singing mediocre music and lots of silly moments. It's heartfelt, but essentially empty. It's nice background noise while you're doing other things like cleaning the bathroom."}, {"id": 10, "text": "I had such high hopes. I mean, c'mon... Dolly? Christine? Jennifer? Seriously hard hitters here!! The very first scene with people dancing in the square had a huge Best Little Wh*rehouse in Texas vibe... and it just kept going downhill from there. There are so many different storylines going on, and it feels like you've been dropped in the middle of all of them."}, {"id": 11, "text": "I have never written an IMDB review before, but this movie was so mind-bogglingly terrible, I can't stop myself.I love Christmas movies. I love Dolly Parton! I love musicals!!But the biggest Christmas miracle is this movie getting a 5.1 average.... Wow, just wow.. The acting, the story, it's all ten times worse than, say, the Princess Switch, seriously."}, {"id": 12, "text": "First of all, if you are looking for blockbuster quality, high production value, you've come to the wrong place. This is, however, is a great movie, with a great cast, amazing message and even better music. Yes, some parts are sappy but it is much better than any Hallmark movie.The story is inspirational and especially relevant for the holiday season. The music is beautiful. Debbie Allen did a great job directing especially given the resources she had."}, {"id": 13, "text": "This isn't bad. It's not really good, but it's a Christmas film so it's cheesy and cheery and the songs are corny but sung well(especially Dolly). I don't really agree with organized religion or it's inclusion with Christmas, but I get that some people do so it is what it is, a religious Christmas movie.Some of the lip-syncing was bad at times, but I enjoyed the LGBT+ inclusion and dancers.SPOILERS: But what was with them justifying the dad giving the antagonists child away because he was embarrassed???!! She was like Oh well he thought it was the right thing to do and people make mistakes. Uhhh ignoring a woman's/parent's right to their child is a SERIOUS mistake. And she just forgives her father like that? Girl spit on his grave, destroy that prototype lamp, and burn his portrait.Also what was with the love story between the antagonists and the general store owner? It contributed nothing and was unresolved..."}, {"id": 14, "text": "I honestly couldn't really tell you what this was about. I don't think Dolly could. I don't think the writers could to be honest.It's such a tragic awful mess and hugely predictable at times, while overwhelmingly confusing at others and they suddenly burst into random awful forgettable songs.My favourite part is towards the end when they give solo performers fairly sizeable songs and scenes - WHEN THEY HAVE NEVER BEEN IN THE FILM UNTIL THIS POINT. LolsiesShame shame shame"}, {"id": 15, "text": "I am writing this mid-watching, and I must say, I haven't laughed this much in ages! Cue 5 espresso martinis and this turns into a hilarious comedy! Dolly is the most glam homeless person I've ever seen &amp; the music is CHEESE! Horrible musical, but if you fancy a giggle, it's worth watching! A mentally challenging film, with or without the booze!!"}, {"id": 16, "text": "I found this to be a charming Christmas story. The dancing reminds me of West Side Story. The singing was more operetta than musical. Yes, it is vary campy. But so is A Wonderful Life and A Christmas Carol. So what, it is still fun. Predictable, yes, but then so is Santa Claus. Tis the Season."}, {"id": 17, "text": "Five minutes in and that was enough. Sickly cheesy vomit inducing. Everything here including if the kitsch(en) sink. I bet that is was a stage show but little effort on the set to make it look real. I've been looking forward to this for ages Shane as I'm a huge Dolly and Christina fan. Was this was just to much. If you put twenty drag queens in it couldnt be more camp."}, {"id": 18, "text": "Oh, man. This was sooo mawkishly sentimental and noticeably contrived. I watched the whole thing because I love Christine Baranski and Dolly Parton (and usually love all Dolly's projects) and this contained very good acting (except for a few quips here and there that were reminiscent of amateurs in a stage play that is a comedy instead of a musical drama).It would have been better if cut down to one hour by removing (or at least depopulating) several of the most overpopulated and ridiculous dance numbers. (Then it could have just been included as one Dolly's 'Heartstrings' episodes, which are all good.)"}, {"id": 19, "text": "Dolly Parton as the be-platformed rhinestone angel that she is. The one and only Jenifer Lewis sings Christine Baranski's Scrooge to filth. Wigs. Redemption. Iambic pentameter. Set aside your cynicism and have fun."}, {"id": 20, "text": "Cringe is the word here. I think dolly went prowling churches and homeless shelters looking for the cast of this one.It started bad and at a very rapid pace, steamrolled its way down, crashing through the gates of hell where it was quickly rejected too.It was hard enough to watch, never mind the difficulty I had keeping my dinner down!Self indulgent doesn't even begin to cover it!Dolly, why?"}, {"id": 21, "text": "I'm still watching with twenty minutes to go and it feels like I've been watching for days. Where can I buy the DVD so that I can burn it. We did put on at eight and it's now midnight as we have had to pause so many times because we couldn't stop laughing. Please don't make a sequel to this. I think one movie is quite enough ."}, {"id": 22, "text": "The political undertone is lovely to see. Within the format of a feelgood christmas movie, there are a healthy social democratic message. Yes, we all need Change. Who benefits? High income people that get tax cuts I love it! &lt;3 Thank you Dolly."}, {"id": 23, "text": "This is over acted and under written. How this got the go ahead I do not know. The lyrics and songs and general writing is so basic as if a child wrote it. A slightly deranged child with learning difficulties. Its just so sickly like a school play.If you are constipated or bolimic then this movie will sort you right out.It's gone a long way to killing my affections for Christmas!"}, {"id": 24, "text": "Yes this is corny and cheesy but it's very watchable. Dollys voice is dream."}, {"id": 25, "text": "Would be great to see this (or anything) live for Christmas 2020. As that's not possibel this year, it's nice to see a show that was captured as it was intended to be -- like a live stage show. It's not opened up as most shows are when turned into films (with location shooting, etc.). This keeps the theatrical aspect alive with stage-like sets, acting, etc. A refreshing change, really. Long live Dolly!"}, {"id": 26, "text": "I absolutely LOVE musicals &amp; thrive off of cheesy Christmas movies but this was, well...a hot messy mess! If your going to try to politicize a Christmas movie at least have good acting &amp; singing to cover up the fact that you are pushing an agenda. It was a bad middle school production with no true plot line &amp; in your face political correctness. Save yourself from this tragedy &amp; go back to watching cheesy Hallmarks movies that are guaranteed to please with their perfect romances &amp; fake snow!"}, {"id": 27, "text": "So much talent and so little of it utilized. I really like a lot of the people that appear in this movie. The whole thing just didn't work. The set, the songs, the lack of plot and motor, the acting and direction. The two things that amaze me about this movie is that there was so much talent involved in it and that the reviews average 5.1 rating. I honestly could not give or even two stars. There are plenty of ok Christmas movies out there to watch, this just isn't one of them."}, {"id": 28, "text": "... to enjoy this. But it was terrible. The cast was promising but even that couldn't save it. It's sad that the bad lip syncing during the songs was better than the acting."}, {"id": 29, "text": "Dolly doesn't even have the decency to appear in scenes with other people. I realize she values plastic, false beauty, but those values don't work when it comes to filmmaking. This is so painful to watch because of the phony production values. Nothing looks real, it's awful."}, {"id": 30, "text": "I was really anxious to watch this movie. I love Christine Baranski and Treat Williams and Christmas movies and musicals. But the songs were kind of boring, too much religion and God, some bad acting and the plot was so lame. A mixture of scrooge with all sorts of romantic cliches. But I was kind of going along until the twist near the end. So the main character is mean and cruel because she had a love disappointment and gets pregnant at very young age. So her father forces her to give the baby for adoption and she keeps resentment towards him throughout her adult life even after he died, but then she discovers that he gave the baby to a local person and kept watching and caring for the boy until he grew up and then the mother simply forgives the father and thinks he was a wonderful man. Come on, your father stole your baby and kept you from raising him and knowing who he was!"}, {"id": 31, "text": "Let's start by saying I love Dolly Parton. I will watch anything that she has anything to do with. She's amazing. This movie is not. It's bad. I recommend watching it to know how bad it is. It's bad. You will yell what is happening?!? at the tv a lot."}, {"id": 32, "text": "Remember this isn't a big budget movie this is based on a stage play and it plays that way on screen too. It's a sweet story with a message. People need to get off their high horse when it comes to reviews. This is meant to be fun and entertaining with a moral. That's the basics. I love the effort and heart put into this story."}, {"id": 33, "text": "Cheesy, ridiculous musical that is painful to watch. When Christine Baranski's Regina decides to evict everyone in the town one of them responds, Please don't do this Regina That's as good as the writing gets."}, {"id": 34, "text": "Is it a musical? YES! It's unabashedly a musical, that's about Christmas. Throw this on, grab a cuppa cocoa, and do your Christmas shopping. It is the standard Christmas story line, but it has DOLLY! It's great."}, {"id": 35, "text": "If you are someone who watches for the actors, like me, you will enjoy Christine Baranski and Jenifer Williams to bits. Plus, Dolly Parton is exactly who you expect her to be. If you watch for anything else, you'll probably hate it. The side actors were just so over the top, they were stage actors not film. The pastor and his wife just made me angry for no reason. The best moments are between Christine and Jenifer and also Christine's assistant/angel is a pretty good actress. Best scene is probably Christine speaking to the little girl at the bar-props to the kid who was a better actress than most of the adults. The writing wasn't great, the set was low budget, and the effects were low budget. It felt like a movie from the 90's/early 00's in that sense (which I don't mind because I love nostalgia, but might turn some people off). The whole church/town hall scenes were soooo cringe. I also just thought the ending of her relation to pastor felt forced and since I was just overall in disdain of the pastor and his wife, I was mad that Christine's character would be connected to them at all. I think a better ending would have been if she was the mom to the guy at the bar and the little girl was her grandchild, they had so much chemistry and her story seemed to be cut to short and resolved too quickly. Overall, I enjoyed it for the main cast, but many of the other cast members and the writing brought the quality down."}, {"id": 36, "text": "Fun, family entertainment. Love Dolly. Great vocals."}, {"id": 37, "text": "Come on y'all don't be so grinchy! I mean it's Dolly in a dozen costumes dripping in rhinestones &amp; feathers and looking gorgeous at age 74! Yes, yes...it's cheesy and hokey and waaaaaaay over the top. But it's DOLLY and it's CHRISTMAS...how could it be anything else?!!"}, {"id": 38, "text": "I nearly stopped it 5 minutes in. It was cringe bad acting and ridiculous choreography. But I hung in there. And I'm super glad. Dolly has such a art for lyrics and Cristina's acting was hooked me. And she sings even better than in the Momma Mias. The story is very sweet and some of the songs are very shazamable."}, {"id": 39, "text": "I love Dolly. I don't particularly like Christmas movies in general. To be honest, this wasn't my favorite movie - it was too sugar coated and boring to watch for the most part. The songs are also kind of forgettable, after watching the movie, I can't actually remember even one of the melodies. And there was a LOT of this very mediocre music to fill the space. However, when the movie was approaching the end, the plot took some very touching and heartfelt turns, which actually made me cry. So if you decide to give this film a shot, just be sure to watch it until the very end, however clumsy the beginning might feel. It really surprised me positively towards the end, even up to tears, which was the last thing I expected to happen, based on the most part of the movie. PS. I love you Dolly, just keep being you."}, {"id": 40, "text": "The best movie ever that Netflix has had anything to do with in a long, long time. I do understand all the bad reviews here. It's Christmas, it's a Christmas movie, wonderful songs, wonderful choreography by Debbie Allen. So the story is not what everyone wants but it's lovely to watch. Great to see Treat Williams again. Dolly is magnificent.Watch it for what it is and enjoy the Spirit of Christmas. I remember reading many years ago that WHITE CHRISTMAS got many negative reviews but now it is a classic."}, {"id": 41, "text": "I wasn't sure I'd like this based on other reviews but thought I'd try it as I'm a fan of Dolly. Yes it is a bit cheesy and sickly sweet but then it's a Christmas musical! As a musical I enjoyed it. Don't watch it if you don't like musicals."}, {"id": 42, "text": "Christmas on the Square is a Christmas-themed musical film. Debbie Allen (Grey's Anatomy, Fame) is the director. Some DNA is lifted from other Christmas films, but the overall effect is acceptable.Christine Baranski plays an overbearing businesswoman, who is poised to buy out all of the home properties of the small town of her youth. She also holds a painful secret, revealed later in the narrative.Dolly Parton serves as an executive producer and a contributor to the soundtrack. (This is adapted from a stage play she produced). Her character, the angel, is not the main character but serves as a background character and a guide for the protagonist/antagonist.Allen is an adept director (note to nitpickers, I said 'adept', NOT 'inept'!): in particular, her background in dance - choreography serves this type of production well.This is an explicitly faith-themed narrative, which would not have been blinked at before the 1990s, but kind of fell away from the traditional networks and drifted onto cable and indie Christian stations instead. In an era of deep polarization on the perception of proselytizing in popular fiction, this film may not be overly convincing of hardline secular households, but for those actively seeking out family friendly TV this will suit them just fine.On the down side- it is frequently off-putting when much of the main dialogue is recited in song, as opposed to spoken. I don't know what the exact breakdown is but I'd say it could easily be 65% sung, 35% spoken."}, {"id": 43, "text": "The rest of this is a mess. The songs are trite and instantly forgetable. The acting is hammy and overwrought. The dancing is flouncy and on a par with a Village People concert. And Dolly Parton looks like she came directly from a display at the wax museum in Branson. But I guess Treat Williams singing and dancing is worth a star."}, {"id": 44, "text": "This is the best movie we seen in a long time!Great music, great actors and good story!A movie we will see every Christmas!We really recommend this movie if you like musical movies!"}, {"id": 45, "text": "Major cheese. Tad eye rolling and cringe. However, you can't help but have a big smile. Put the subtitles on and sing along..."}, {"id": 46, "text": "This was just a great movie. Most of the musical numbers were spectacular but I disliked the love songs with Pastor Christian and his wife. I ended up skipping those parts but the rest of the movie was just amazing. It had character development with multiple people, it was uplifting, again, most of the music was great and so was the dancing and great is just the best adjective I can think of. I've already watched it 3 times now and I can't wait for the soundtrack to be released."}, {"id": 47, "text": "This is more of a stage production than a strict movie. And that's okay! But, as I said, Dolly can do no wrong. Lighten up, sit back, and enjoy!"}, {"id": 48, "text": "I give it a 7 only because Dolly is in it! For the rest it's a low key movie that was quiet cheap I think :) it's Scrooge kinda movie. At the start of the movie you can see some actors are not singing live so it's lipsynced. Nevertheless there Christine Baranski is in it and makes a lot good! Real musical movie. Nice movie but not the best."}, {"id": 49, "text": "It tries, I guess.I can't say I enjoyed 'Dolly Parton's Christmas on the Square' at any moment, though it does have (minor) peaks and (major) troughs. Some parts are OK, a couple of the songs fit and there's one nice scene between Christine Baranski (Regina) and Selah Kimbro Jones (Violet). Parton, meanwhile, is fine in her role.However, the rest is a slog to watch. Far too much emphasis is put on the musical numbers. Yes, it obviously needs them but you must also have more meat on the bones if you're going to make a film out of it. The plot is tedious to watch unfold, as you know what's coming and it doesn't do anything to throw you off the scent.If you just want a music-filled film then head this way, if not it's probably best to avoid."}, {"id": 50, "text": "If you can get past the grating singing voice of the pastor's wife..."}, {"id": 51, "text": "Love Dolly Parton and Christine Baranski but just couldn't make this past the first 15 minutes to the point it made me feel nauseas. I'm sure it appeals to some, but unfortunately, it made me cringe. Not sure how it could have been done better other than different characters and storyline. It's a no from me."}, {"id": 52, "text": "Honestly, I didn't watch the whole thing. I love Dolly Parton's music, but the lame story line and awful choreography made it almost unwatchable. After I caught myself checking for technical glitches, I turned it off. It was easy to guess how much was green screen low budget special effects and what was real. These are tough times in 2020, but this won't be a landmark of overcoming obstacles. At best it's an exercise in mediocrity."}, {"id": 53, "text": "I love cheesy Christmas movies and I also love musicals, but this was not it. I watched the whole movie, but the movie was literally just nonstop singing, and to me the songs were not even that great. I also felt like all the dancing was unneccessary and took away from the plot that was there. Christine Baranski was great in role, but she could not save the movie. This Christmas musical was definitely not for me."}, {"id": 54, "text": "This is probably an unfair review due to the fact that I only endured around 10 minutes of this 'film'. However, what I saw was utterly terrible. If I wanted to see a stage show I would've gone to the West End!"}, {"id": 55, "text": "Ummm.... well, then.... lessee: a couple singing about fertility treatments, guys prancing around the beauty parlor, some praying stuff to maybe water-down the PC preachiness, and the mean lady evicting the entire town. No, really, the entire town.If you're looking for A Coat of Many Colors, or even the likes of 9 to 5, believe me - this ain't for you. We sat here staring at the TV with our jaws dropped, wide-eyed, occasionally glancing at each other, like do you believe what we're seeing? But then again, it was so weird, macabre, and bad, that we couldn't tear ourselves away until about 30 minutes in. You know how it is when you drive by a reeeeeally bad car/semi-truck accident on the highway and you can't pull your eyes away from the body parts strewn on the highway? Well, there you go.I'm starting to wonder about poor Dolly. She is in her 70's, after all. Judgement?"}, {"id": 56, "text": "I dare anyone to watch the opening number without your mouth dropping in amazement at just how bad this is. Nothing works. Dolly Parton should hang her head in shame!"}, {"id": 57, "text": "I love Christmas movies and musicals, but this was almost unbearable. Christine Baranski and Jeanine Mason are both amazing actresses, but even they couldn't save this campy trainwreck. The pastor and his wife were so cringeworthy. The rest of the cast was decent but this movie was a waste of their talent."}, {"id": 58, "text": "I find musicals difficult to review as I always find myself trying to disentangle the singing from the acting, which, of course, does not work. Overall, it is a fun movie, especially if you like musicals. It is not a very original story, of course, as the Scrooge plot has been done many times. The twist here is it is done in a musical. Regarding the story, I did find the plot around building a mall in a bit funny, given that they have been closing across the country. Anyway, the choreography in the song and dance scenes is fun and engaging. Indeed, the strongest scenes, I felt, were those when the full cast participated (e.g., the opening scene, the church scenes, the closing scene). The individual performances, I thought were mixed. The lead, Christine Baranski (as Regina) and Treat Williams (as Carl), both had good performances, even though they are not what I would call naturally good singers. Josh Segarra, playing the pastor, could really sing, but his acting was rather weak. I was unimpressed with Jeanine Mason's (as Felicity, the other angel) performance overall. The producers could have cast a stronger actor for this role, a pity really. Jenifer Lewis (as Margeline) and Matthew Johnson (Mack) were excellent, great voices/singing. And there was a cute performance by Selah Kimbro Jones as Violet; I really enjoyed her scene with Regina. Overall, a fun movie. However, if you are not a fan of musicals, you should probably sit this one out."}, {"id": 59, "text": "This movie is perfectly lovely. It is sweet and more grounded than your typical holiday movie. It has lots of cute moments too.It does have the same trappings but it has more going on than them sort of movies. It runs rings around Hallmark movies as it is so inclusive and diverse. I will say it was a little bit too pious for me but that is just me and i guess some holiday movies are like that, it is about Christmas at the end of the day i guess.I didn't love the dancing if i am honest too. It seemed a bit manic at time. It was hard to keep track of and it felt like there were just too much people all trying to dance together.Christine Baranski is fantastic, i would watch her in anything. She is so great i was in fact kind of here for her being this no nonsense business lady just doing what ever she wanted. I don't think the movie wanted me to feel like that but she is just so good.The acting starts to plummet from there though apart from Jeniffer Lewis and Dolly. I really didn't enjoy the pastor or any of the towns people to be fair. At times when watching just the towns folk i felt like it bordered on your local church group putting on a Christmas show. I even skipped some of their songs because it was pretty bad.I think you could probably watch it if ou like this type of movie, like i said it does have something over Hallmark movies and it has Christine Baranski and Jennifer Lewis that is all you really need."}, {"id": 60, "text": "Now, who doesn't like a bit of Dolly at Christmas? Well, add a little Treat Williams and make Christine Baranski a baddie, and that should have been a recipe for success. Well - it isn't. The whole thing is so sentimentally cheesy that it's almost excruciating to watch. The plot - insofar as that remotely matters - is a sort of A Christmas Carol affair, with Baranski deciding to sell her town to some property developers - and so she decides to deliver eviction notices to the populace with only days to go until Santa arrives. Dolly, complete with angel dust, decides to step in and stop the mean and wicked lady from carrying out her plan and... well, you can guess the rest. The whole thing reminded me of a cannibalisation of a school performance of Godspell I was in, in 1974 - the production and dance routines are staged to within an inch of their life - and a couple of episodes of Glee. I doubt even at this time of year, this can resonate with anyone who isn't under ten years old - and I'm afraid Treat Williams just can't sing. One, perhaps, to leave the kids in front of the telly for, whilst you wrestle with the turkey but otherwise, even the schmaltzy lyric doesn't help. It might be borderline sacrilegious to say this but sorry, Dolly - this is terrible."}, {"id": 61, "text": "If you ask anyone why they wanted to watch this movie, you'll probably be told it was because of Dolly Parton; after all, that's also why I turned it on.The opening musical scene is generally where most viewers start to have regret for tuning in. I too was a bit overwhelmed with this bright, overly jolly, and way to long of an opening musical number (of that caliber) to start a down-home, feel good Christmas story. Unlike most reviewers here, I stayed tuned-in to see where this was going to go from here. I just wasn't about to give up on Dolly Parton yet.This movie does have its ups and downs, but I started to realize that this is definitely 'I'm always happy and grateful' Dolly style and quickly dropped my preconceived idea of what this movie was going to be.From the 30-minute mark going forward I started enjoying the story more and more, but I found myself looking at my phone during many of the following musical numbers, only to find myself watching again when the story returned. Not every musical journey was bad, and they did tie into the story itself, but in Dolly fashion they were very exuberant and busy on the screen.Christine Baranski was a joy to watch in this film, and I believe they could have made this movie great without the musical numbers and a bit more of the storyline. With Dolly steering the musical direction of the film, she could have had a few beautiful and soon-to-be Holiday classics or even had a great duet with Christine. However, this movie was intended to be an off-Broadway style film with a simple storyline and lots of over-the-top numbers, and they certainly achieved their goal.It's clear to me Ms. Parton and the entire cast wanted to cheer us all up through the musical numbers and have fun too. After all it's 2020 and why not watch a Holiday musical comedy with a few laughs and snarky quips sprinkled through the movie while adding a touching conclusion and good performance by Christine Baranski."}, {"id": 62, "text": "Do you know that feeling, when you attempt to make your first big birthday cake with frosting,fondant and at least three stories? Then you might also know the feeling of failure. And that's also my feeling with this movie-musical. Too many ingredients and (you might not expect) lack of experience?There are a lot of cringeworthy moments. The only thing I appreciate is the acting of Christine Baranski and Jennifer Lewis and Dolly's apperance. I don't mind a set looking artificial, like you can tell it is a sound stage. But please, the story is flat, the effects look very cheap. Was Dolly even on set for a minute? It appears she was edited in in postproduction over many scenes throughout the movie. And also, everyone lipsynching their parts feels even more fake.Of course the plot isn't new to any of us. There's just too many story lines squeezed into those 90 minutes and the whole thing lacks goodwill and passion to me. Sorry Dolly I love you, but this is a no no."}], "reviews_amount": 63}