{"name": "Breaking Surface", "titleId": "tt10081762", "reviews": [{"id": 0, "text": "Keeps you at the edge of your seat. You just have to get over how dumb the main character is.Also, the movie could have done without the backstory. I would have cared about what happened to these characters irrespective of their past."}, {"id": 1, "text": "It's hard to write a review like this, it's a small, swedish film that needs all the support it can get, yet I can't rate it higher than 4 out of 10. Why? Well, first of, to me this was a 40-60 minutes long film, stretched out to barely 90 minutes. Keep it in the water the whole film through instead. I also guess my hopes were too high because of tag lines on the poster, calling it the best swedish thriller and other sentences with Best in it.The thing is, all the technical stuff is great, the cinematography, the sound, the music, the scenery, it was a very easy film to follow and not shaky cam or something like that, it felt like I was watching a Hollywood film at some scenes.What drags it all down is the story. We get some flashbacks to the main characters lives as kids, some look at their daily lives with one working as a repairman/diver and the other one having a difficult relationship with her husband, none of it really matter to the story. Then there's arguing among one of the sisters and their mom, feeding their dog cigarettes (wtf?) and then for some funny reason, a stranger on the road having a flat tire that one of the sisters decides to help, even if the owner of the car already called for help. Why? To show the jack-screw that lifts the car, it will obviously have an important role later in the film... but then again, no, it doesn't. An important thing when I watch a film is that I can somehow relate to the characters or if nothing else, get some kind of reward throughout the film, something that makes me like it, but as the film went on, I just didn't care if anyone lived or died, there wasn't really any reason for why I wanted them to live - one of them have kids, the other one going travel to the Philippines next week, not enough reason for me to care. At least make the main character smart, or even smarter than the viewer, that way I can actually cheer more for her - instead I was just rolling my eyes over every new mistake she made that lead to nowhere. It's noot until the end that she does something smart, but by then I had already stopped to care.I think another thing that would've made the film more real, would be if the main character didn't talk as much, most of the things she said was obvious and already known by the viewers without having it told to them. It just made her sound more stupid. Just look at All Is Lost (2013) another thriller about a single person in a dire situation, barely no words are said during that film and it's not any side stories or flashbacks in it. I'm sure the two lead actors are great at their jobs, but with the wrong screenplay or direction, it's just another forgettable film among others.Oh, and then there's the dog that gets killed, was that even necessary? It would've been enough with her being bitten and barely escaping the house, but to kill the dog and leave a message? There just wasn't any reward with the house-scene. At least she could've found a jack-screw or something else to try and save her sister, instead of destroying their car any more. It just made me dislike the main character even more."}, {"id": 2, "text": "Why dident she fell the seat so she could get to the back?! Instead she walked 1km to get to a random house and kills a dog on the way! (wtf)"}, {"id": 3, "text": "The cinematography is great. The many frustrating issues arise from the many situations that befall the duo, and the emergency decisions they must make. One poor decision after another. It is definitely worth a watch."}, {"id": 4, "text": "The most stupid character. i was so mad at the blond girl. you cant sit and take a break when her sister is dying at the bottom. signals to a plane and drops the airtanks when her sister has 1% air and looses them."}, {"id": 5, "text": "Can't imagine the girl can be that stupid, she is the real disaster!"}, {"id": 6, "text": "I can't believe what I have seen, sometimes I thought it will be better, but that wasn't."}, {"id": 7, "text": "She kills a dog. The dog is in it's own house. She breaks into the house then stabs the dog. Ruined the movie for us. We didn't want to watch any further. Don't understand why that was needed in the movie. Animal cruelty in this film."}, {"id": 8, "text": "You need a lot of patience to watch this without cursing. It's so stupid. She just screw up everything on her way."}, {"id": 9, "text": "Wow I was happily surprised with this one. It really kept you on the edge of the seat! There is not much talking so even if you dont like foreign movies, this one will engage you :-)"}, {"id": 10, "text": "F... me... For what? Too many moves for nothing. Bla bla bla."}, {"id": 11, "text": "I was so frustrated by her sister stupidity that I had to stop watching after 15 min . Maybe she just didn't like her and let her drown but I guess I will never know ."}, {"id": 12, "text": "This is one of the stupidest movies I have watched.Everything you can think of that can go wrong have gone wrong."}, {"id": 13, "text": "Movie is fine.. Just wondering about opening a car compartment... isnt it juat a latch located somewhere on the seat?"}, {"id": 14, "text": "Initially bad decisions lead eventually to bad solutions - as the theme of any script based on creating suspense works as it is. To further on claim it pictures reality on any level among experienced professional divers is hogwash and is quite telling about the asserted skill and knowledge in the field of the writer comparing this to an actual possible scenario. Any diver - professional or amateur - shouldn't be diving at all if this is their conception of events that even could occur during any dive if thoroughly planned and implemented properly. Rather consider this as but a movie."}, {"id": 15, "text": "I think they did a really good job with this movie"}, {"id": 16, "text": "Going diving in the middle of winters in Norway, and in a secluded place, is not the best thing to do. Well, this is the very type of movie where the story is built to stress the viewer until the end and make them hold their breath, for that, the movie succeeds, stress free! But it stops there. Of course there are worse movies."}, {"id": 17, "text": "Excellent movie if you have any idea how diving works. It keeps you at the edge of your seat the whole time. Pretty good for a low budget movie."}, {"id": 18, "text": "This movie is a great lesson about how should we care and admire our siblings.. Outstanding picture takings under the water.."}, {"id": 19, "text": "For an independent movie Is very very goodEspecially after 15 minutes Doesn't drag and keeps on your toesVery realistic"}, {"id": 20, "text": "Now for certain things to happen, some mistakes or things have to happen. A certain amount of small things that lead to something bigger. Now not all of those things may seem plausible to all watching. You just have to suspend your disbelief and let the flow of the story and the characters take you on a journey and dive in.Now I know that some didn't really like this and it is imperative to not have anything against movies taking mostly place underwater. The tension is there and the movie really builds that up nicely. I don't even want to know what the actors (and stunt persons) had to go through, including some of the crew of course. So if that amazes you and you can forgive some cliches and flaws the movie has, you are in for quite the ride ... dive!"}, {"id": 21, "text": "Looks great, decent acting, fast paced. Very claustrophobic. Thought I'd add this review as too many low scores undeservedly dragging it's score down. Better than most of the stuff Hollywood churns out. Loved it. Recommended to mates."}, {"id": 22, "text": "The movie starts off with a big mistake. A professional diver should have ensured the circuit breaker for the thruster would have been locked off and secured against power-up... Ruined the rest of the movie for me... Producers did not have enough info about this and the story should have included a part with someone actually removing these securities measures. like a drunk sailor maybe"}, {"id": 23, "text": "Great great movie. liked the characters. the suspense. I kept on holding my breath. I felt like I was with them every step of the way"}, {"id": 24, "text": "My biggest take away from this film was the scenery and cinematography on the sisters drive to the dive site which was beautifully shot and made you wonder why they wanted to go diving in the dark rather than hiking.I think the lack of any 'wonder' in the diving scenes did make what they were doing seem a little pointless and the younger sister, who we see taking one risk after another throughout the film, more unsympathetic.It was very well shot and must have been a lot or work for the cast and crew to make. It had some tension but it would've been better if I'd cared a little more for the characters.Shame for dogs in this movie too."}, {"id": 25, "text": "I've been a diver for over 30 years and Ive seen a lot, ppl do get very causal about diving and this move depicts how it can go wrong very quickly. The first thing to do is plan your dive, something they didnt do very well, it went down hill from the start. Very atmospheric and the the cinematography is wonderful, the 2 women acted their parts very well. A freshening edge of the the seat movie worth watching despite the subtitles... turn the heating off and open the windows, this will get you feeling a little how they must feel"}, {"id": 26, "text": "In Breaking Surface we get a thriller that has plenty of action scenes, some of them literally breathtaking as the story becomes ever more intense. Breaking Surface deals with scuba diving, an activity not often depicted in movies, at least not with the attention to accuracy like this one. Most of it takes place in a Norwegian fjord, which makes the plot even more unusual. We are also treated to spectacular Norwegian scenery above ground, and eerie underwater imagery. It's probably impossible to imagine the headaches and challenges that director Joachim Hedén and his crew had to overcome to pull off the underwater scenes. His two lead actresses, Moa Gammel and Madeleine Martin, create three-dimensional characters that viewers will start to care about after a few minutes. Twists to the plot? Yes indeed!Long to short, Breaking Surface is 82 minutes of entertainment at its finest."}, {"id": 27, "text": "This movie looks very authentic.... the gear, the drill, the experience of the younger sister makes you feel she is in charge. Minor spoiler alert : Her role as leader is about to change, and her older half-sister has to deal with an emergency.... the older sister is overwhelmed by panic and distress at first, but when finally she comes to the last straw, her brain goes into overdrive, and just when you think she has played her last card, she comes through with super insight and goes into pure survival mode. This is, from my experience, a unique and rare mode that we enter when facing mortal danger... we enter a zen like state of mind, in which every possible option is analysed at fast speed... she comes up with an idea and follows it through, and after a massive crescendo, the movie unfolds every turn for the better..... I think a genius of suspension and a great puzzle solver put this film together. Respect for the directot, and excellent female actors. This was an unexpected gem of a film, which i will never forget. Amazing and unique. A classic. Bravo to the director, cast and crew."}, {"id": 28, "text": "This is a Swedish/Norwegian production, and only the fourth full length feature film written and directed by newb filmmaker Joachim Heden. It's a tense, and well executed film that portrays a very accurate representation of the dangers of diving. The cinematography was perfection. Norway's Lofoten Islands setting was spectacular and breathtaking. The underwater filming was on par with big budget Hollywood blockbusters. I've read some reviews complaining about the writing; sure it's not perfect, but the weird offside scenes add to the real-life when it rains it pours events. It was a refreshing non-Hollywood-ed film, and considering this was written by a newb filmmaker, it was still much better than some of the big budget Hollywood flops put together by seasoned filmmakers that have been coming out lately. The score was on point and the acting very convincing. The 80 min runtime was just right, as was the pacing. Had the writing been a little tighter, this would've been a perfect film. It really felt like it was based on true events, and even caused me, a certified diver, anxiety watching the drama unfold. It's a well deserved 8.5/10 rounded up to a 9 from me. Click on my username to see more of my 1000+ ratings and 900+ reviews."}, {"id": 29, "text": "Felt and went rockbottom at 20 phatoms below the sea surface. do you have any kind of cronic obstructive lungs issues, do have your oxygen at hand ,because youre automatically catching and holding your breath in this flick.but its not the very best of die on a dive films ive seen through the years, but its intense though. the dynamics between the actors are so shallow and bad ,i would never have dove with any of then because daredevilism isnt my preference. and if all the signs from heaven had occured to me before my dive i wouldve called it a day long before dipping into the water. im not a certified diver, but have done a lot of diving as a freelancer in my younger days, though i still have my orange scubapro wetsuit .but all the dire straits these two women are up to could never have been foreseen or predicted.. if there are one bad thing about norway ,its darn desolate where they are diving and the phone signal basicly dead if turning round the mountain.but to all viewers that doesnt understand the language, the 2 dames are swedish and not norwegian,that maybe the reason for all their bad luck and headless hunting for rescue. the wooden stick brought to the seabottom would actually have been a near impossible task to take down, just a little glitch among others.but its a viewable film and im very squemish and grumpy and old man tonight so its just a 7 from me."}, {"id": 30, "text": "As some have reviewed it before me, the movie certainly has good elements: the environment is beautiful !the shots under &amp; above water are really goodacting is goodBut personally for me, some elements were irritating as hell: the main actress plays a pretty stupid person (some could argue she's maybe inexperienced as a diver and does silly things and/ or attribute her reactions to panic). But still, it's ok to be stupid in a film - but if it starts to be irritating... it's too muchI'm a diver and wow some pretty amazing stuff happening under water. Maybe for the non-educated viewer it looks ok, but as a diver ... it's not realistic. The amount of dives/ quick surfacing/ recompressing she's doing... don't think she'd still be walking. Freediving to 33m (in a drysuit), looking for the bottle on the bottom on one breath, ... a lot of those things are not realisticA pity ! I think with some small finetunings this could have been a very good movie."}, {"id": 31, "text": "All really good films have a good start sequence like films like Cliffhanger or Vertical Limit and this film is no exception with a heart stopping sequence beneath a ship being sucked into its propellers which immediately grabs the viewers attention - well done to the director for paying attention to the rules of good movie making.Add to that some utterly breathtaking photography and drone footage and it starts looking very good indeed.Good acting and nice characterization, one character is focused, extremely intelligent and capable then we have the other one who obviously has problems , ruined her marriage and is a bit of nightmare and of course its the intelligent and capable one who becomes trapped and so the incompetent partner is the one who has to try everything (and mostly failing) to free her sister and save the day - it has all the things a good movie should have right from the off and it does not disappoint! As one reviewer has pointed out it is actually quite close to reality when you are diving so they clearly researched before they made the movie and having seen someone with a case of the spinal bends its quite disturbing and a completely horrifying experience even for people watching it happen to someone else as i did once so this film did bring back memories!You have to laugh at the one star reviewers complaining about the dog scene or this and that would not happen in real life and the sister was stupid - Err yes that is why she was chosen to be the one not trapped under the rock as she was the incompetent dimwit of the two sisters - what didnt you get? When are people like this going to stop reviewing movies? If everyone did the logical and sensible thing then the movie would last 10 minutes and be over immediately - its what is called making a fictional movie guys - perhaps stick to dominoes if you cannot review a movie properly or dont understand the construction of a screenplay! It really does disappoint me to see low brow reviewers giving a good film like this a 1 or 2 star review which means its the worst film you have ever seen and which this is plainly not if you have ever seen the Bad Batch with Keanu Reeves - Go watch that and then tell me you still think this is a 1 or 2!The only disappointment is that they went for the usual hollywood happy ending when they should have ended it with what would really have happened if someone had made so many ascents and descents without the safety breaks they should take to remove nitrogen from the blood then it would really have broken movie making rules and we need this to make movies that truly shine. Overall a good exciting 7/10 nights entertainment."}], "reviews_amount": 32}