{"name": "Bahut Hua Sammaan", "titleId": "tt10916102", "reviews": [{"id": 0, "text": "Srsly amazing Concept of film, Comedy is quite original, the only thing it lacks is Visual effects in some scenes. Still it is understandable that budget would be an issue. Still the VFX does not disturb the concept of film"}, {"id": 1, "text": "A must watch. Hilariously junkie and unafraid to make a satirical statement on the system and the politics of the system. The humour in Bahut Hua Samman is a mix of old school slapstick comedy, sharp lines, along with a sizeable dash of crudeness. The use of popular and peppy songs of the 80's era adds its own special touch. In the end, when all's well with the world, everything has fallen back into it's right place, Bahut Hua Samman leaves you with the message to speak up, to question, to demand answers - in other words - to keep the spirit of democracy up, running and healthy. It's a good one-time watch, funny and entertaining, if you don't overthink things much, that is."}, {"id": 2, "text": "Satirical dialogue fresh story explaining punjivaad and consumerism affluently.. Sanjay Mishra and raghv Juyal as always good.. but surprise pack is Abhishek Chauhan.. Nidhi has done great job... Overall I like it only lacks it's pace in middle but cover up at last"}, {"id": 3, "text": "For some anti Modi and so called democratic people, It's a kind of sarcasm on the so called current situation in the country. Just keep your political views aside and enjoy the movie, it's a masterpiece. Haven't seen such creativity in a while."}, {"id": 4, "text": "This one out of nowhere arrived on Hotstar, is a treat. Refreshing, satirical, crazy zany humour, likeable leads, awesome performances from all the casts and amazing compilation of soundtracks is a must watch. Abhishek Chauhan is someone to look out for. Sanjay Mishra is always reliable. Nidhi Singh does justice to her character always and Raghav too has good comic timing."}, {"id": 5, "text": "Must watch! Good acting by Raghav, Sanjay Mishra &amp; nidhi... 10/10 to the writer for speaking his heart out.Brave Indeed!!"}, {"id": 6, "text": "A worth watch, doesn't bore at all. Eventful and engaging. Sanjay sir as usual, legend. Raghal Juyal is good. Cubicle fame Abhishek Chauhan has done a pretty decent job here. His is spontaneous. Hope him to see more. Nidhi Singh has also done a good job. All other characters are also good. Ram Kapoor in cameo role of a shooter is also worth watch.Story is good. Based out of Varanasi. Please do watch it."}, {"id": 7, "text": "Hilarious, fun, lots of satires on our political system and the dynamics of our country, along with some very sharp satires on the current regime too... This is a very bold attempt...the humour is a mix of old school slapstick comedy, sharp lines, along with a dash of crudeness. Use of peppy songs of the 80s &amp; 90s just touch it up all at right places. In the end, all ends well and everything falls back into it's right place, but Bahut Hua Samman will leave you with the message to speak up, to question, to demand answers - in other words - to keep the spirit of democracy up, running and healthy. All in all, it is a good one-time watch, funny, entertaining, if you try not to find the story line or don't overthink on it.... For me this one falls in the category of Jane Bhi Do Yaaron league. Thumbs up 👍"}, {"id": 8, "text": "Something different with great comedy for adults. just awesome."}, {"id": 9, "text": "The much needed film in this democratic crisis in this country."}, {"id": 10, "text": "Was intially hesistant to watch the movie but still gave a chance. Movie is way way higher than expectation. Thought plot may not be entirely new , but how it is shown and comic timings in movie is awesome. Sanjay Mishra acting gives brings the movie to entirely level. Much watch and so much better than usual senseless and scriptless movies"}, {"id": 11, "text": "What a movie! Finnaly watched a great movie after so many months. The multicharacters in the plot portraying their role is too elusive, detailed and charismatic performance. From all of my friends and myself a big salute to the scripterand to actors and actresses.With regards Filmy lover"}, {"id": 12, "text": "It's a good mixture of comedy &amp; reality. You're going to love it. The cast, hands down the best I've seen in recent times. Great writing. I'm out of words actually. Pls go and watch it."}, {"id": 13, "text": "Cinema, story telling and associated craft is an Art . Bahut hua Samaan is a perfect example of art which is used a is a tool to educate, motivate, and activate our citizenry, inspire or may be open our hearts and minds to look beyond what they are being shown through the media. It's a dark satire and also a tribute to Indian Cinema of 80s. The uncanny reference to the social and political issues is remarkable. Some action VFX looks hilarious but then it's a brilliant take on action heroes of this era. Sanjay Misra and other actors have done a great justice to the writing and direction . It's a new version of Jaane Bhi Do Yaaron"}, {"id": 14, "text": "Sanyay Mishra is a star, all other actors too performed well. You may complain about the narrative but this is entertaining, absolutely one time watch."}, {"id": 15, "text": "The Movie concept is clearly and bitterly against a single and most successful Political Party and one of the large established Indian Business of the country. The movie is an illogical yet entertaining story. The movie is simply a political and business revenge trying to silently infuse hatred amongst the audience. This is what is called as silent poisoning."}, {"id": 16, "text": "Another political and librandu drama.. started with expectations of light comedy and good acting.. again same target story.. corrupt politicians and a Baba.. useless plot"}, {"id": 17, "text": "Bahut Hua Sammaan is very hilarious movie of the year 2020 after Lootcase. One Line Dialogues And situational comedy too fun. All actors performance is brilliant. Comic timing perfect. The way this movie is tightened by looking at the situation in this country, it is quite interesting. Much better. Some People (Modi Bakht) Offended after watching this movie. Because those persons are devotee some stupid reasons. Please away negative reviews. One Time Watch Movie My Rating: 7/10"}, {"id": 18, "text": "Cheap proganda . Could have made better . Propoganda should be subtle not overt . Better movie could have made without propganda and better screenplay ."}, {"id": 19, "text": "This movie is illogical and doesn't make any sense. Hypnosis really couldn't find anything better. Its just another propaganda movie."}, {"id": 20, "text": "Great acting and direction. But the political messaging at the end took away the sheen. Nice movie. One time watch. But don't get brainwashed by political messaging . We know how Bollywood works."}, {"id": 21, "text": "Seriously Sanjay Mishra deserves credit in this film. And appreciate the directors role to keep cost low and make such a nice film in low cost."}, {"id": 22, "text": "Wow! I didn't expected the movie to be this good. Enjoyed completely. Great comedy and good writing. As far as the performances are concerned. Everyone is too good. Sanjay Mishra is just fabolous. Something very different from what we see in movies these days."}, {"id": 23, "text": "Just leave your brains out of the movie and boom, you hit the comedy masterpiece. During this pandemic times this movie is everything you need for 2 light refreshing hours. And sanjay mishra sir just take all my money and please deliver us 5 movies a year atleast."}, {"id": 24, "text": "Rare gem .. perfect combination of humour, thrill and satire. Sanjay Mishra and Nidhi Singh are always a pleasure to watch but this one is exceptionally well written and directed. Must watch for any one with a few brain cells who appreciate humour .Warning - those looking for slapstick, comedy circus, Kapil sharma or sunil Grover type comedy needn't waste their time ."}, {"id": 25, "text": "Movie is good. But not sure what is agenda to make it anti hindu and anti modi."}, {"id": 26, "text": "It seems that after a long time I saw an entertaining movie of Bollywood. The script was fair but the movie direction was humorously good"}, {"id": 27, "text": "They have taken up matter of capitalism and consumerism in such a light funny Bakchod way..!!! Powerful performance by all..! Sanjay Mishra rocks as always Must watch"}, {"id": 28, "text": "Absolute banger of a movie. definitely watch it. It starts off as a unassuming light hearted comedy, but by the end you'll be blown away seeing how the plot keeps developing, keeps thickening. And absolutely hilarious throughout!This movie will never get publicity, nor it will be popular, but make sure you watch this gem."}, {"id": 29, "text": "Horrible comedy... after 30mins I really can't drag it. I have better ways of spending time rather than seeing this crap. Take my advice :- don't waste your valuable time and if you want to watch have a aspirin ready for full headache"}, {"id": 30, "text": "This is left propaganda against bip and Hindu gurus who is resembling baba Ramdev, has been shown in bad light. Baba Ramdev has done great service and it is bad to portray him like this."}, {"id": 31, "text": "Anti-Hindu &amp; Anti-Modi mindsets are clearly visible who so ever made this movie. The movie nothing but a propaganda movie to propagate leftist, Maoist &amp; anti-India ideology. This movie is targeting a well known org. Completely frictional movie i.e. saying people are losing there intellect due to consumption of so called drug &amp; unable to make political decision. The so called leftist do not dare to make a moving on ethnic cleansing done by Lenin, Stalin &amp; Mao Zeodong in the name of cultural revolution. Crores of people lost there life due to these leftist ideology &amp; still our soldiers are losing there life on Naxalite area."}, {"id": 32, "text": "This movie is an example of movie should be made....Keeping it absolutely realistic and having all the elements for a successful end result. The BGM was absolutely fabulous, had even forgotten some of those evergreen songs until this beauty. Has a very important and thought provoking message too!!!...worth the watch... Definitely enjoy it!!!! PS::: Sanjay Mishra is a Legend!!!!"}, {"id": 33, "text": "The best movie I have ever watched since ages.. Hilarious Rollercoaster Ride from Start to End. Best and smart retro background music score.. Loved every bit of it... This would definitely be KOHINOOR in the bunch of Gems.."}, {"id": 34, "text": "One must appreciate the story writer for such a hillarious script. Lovely execution of a not so lovely bank loot plan. Sanjay sir is amazing as usual. Ram kapoor is also decent with his more serious character. The punches are good with great comic timings. Each and every character has done a decent job to make the movie a must watch."}, {"id": 35, "text": "These kind of movies should be promoted. Good acting, good story and funny till the end with a good message."}, {"id": 36, "text": "Best acting by every character.BABA ki acting jabardast .BEST THINK IS THAT GRAPHIC IN ANOTHER STYLE JUST LIKE YOU ARE ENTWRING ANOTHER SCENE...."}, {"id": 37, "text": "Satrical dailogue , best movie , love to watch this movie"}, {"id": 38, "text": "Outstanding movie I love this movie very muchhh Sarcastic movie"}, {"id": 39, "text": "Omg this movie is sooo good , excellent performance"}, {"id": 40, "text": "Worth movie , worth movie , nice movieee, excellent movie, outstanding movie"}, {"id": 41, "text": "Fresh movie, sarcastic movieee ,love to match this movieee"}, {"id": 42, "text": "Sarcastic movie . Love to watch this movie . A very good movie Nice to watch"}, {"id": 43, "text": "Sarcasm movie Love to watch this movie Very good movie Love yo watch this movie"}, {"id": 44, "text": "Fantasia movie When you watch this movie you learn different things"}, {"id": 45, "text": "Nice movie Based on today's world Love to watch this"}, {"id": 46, "text": "Dialogues are very good , worth of the movie is excellent love to watch this movie"}, {"id": 47, "text": "Worth, movie , realistic , nice , love to watch this movie ,"}, {"id": 48, "text": "The Movie start as a punch line comedy but have a dramatic turn and surprise us as a document of current political situation of today's India. It give us glimpse of present toxic situation of India Satirically. 80s song included as background score give it a different touch while 'bookish' special effect give it a unusual feel."}, {"id": 49, "text": "It's well crafted storyline which will be remembered for the screenplay. Sanjay Mishra steals the show. Multiple characters were introduced yet the storyline didn't flinch away from the original concept. The concept of the Kohinoor was great. 70s music in the right time and the literary writing the sound effects gave a movie a unique touch of comedy.Overall it's a good movie and junta should watch it to encourage such kind of movies."}, {"id": 50, "text": "Incoherent story line and crass comedy full of vulgar language."}, {"id": 51, "text": "One of the best funny movies of recent times. Great Actors. One of my few Recommendations of 2020."}, {"id": 52, "text": "The movie is well directed, full of comedy and a good story. If you liked tumbaad youll like this too."}, {"id": 53, "text": "Don't underestimate this by thinking a low budget boring movie. Even I think it as a local movie with some unknown casting, but this movie makes me surprise at every stage.... And yes!.... SANJAY MISHRA did a great job as always."}, {"id": 54, "text": "All characters have done superb acting. Story line is good as well. Comedy to be watched for sure."}, {"id": 55, "text": "Amusing to watch such movie and I would recommend my friends to watch it"}, {"id": 56, "text": "Amazing 🎥 movie!!!!!!!! I loved it!!!!!!!!! Nd i would recommend my friends nd family!!!!!👌👌👌"}, {"id": 57, "text": "Good storyline, amazing acting. These actors never fail to entertain us."}, {"id": 58, "text": "Really an amazing movie to binge over pizza! Light movie and a great mood buster"}, {"id": 59, "text": "This has been a joy to watch during lockdown and such a great uplifter! Must watch"}, {"id": 60, "text": "Cast contribution is worthy.....give it a watch once...!"}, {"id": 61, "text": "It was a fantaboulos experience watching this movie. It is really interesting nd I would suggest you that u must watch this movie atleast once...it was quality time seeing this amazing movie....."}, {"id": 62, "text": "The movie characters was fantastic!! I really enjoyed this movie!! Awesome!!"}, {"id": 63, "text": "Really enjoyed the movie. I would recommend everyone to watch it at least onece.✌"}, {"id": 64, "text": "Truly loved the movie. Full on entertainment movie. Must watch with famiy"}, {"id": 65, "text": "What a fabulous movie.loved it..! Awsm movie must watch one time"}, {"id": 66, "text": "Amazing movie...i recommend my friends too... That at least watch this movie once..."}, {"id": 67, "text": "Very funny and creative. Full of comedy with current situation. Full of entertainment in movie. Make more comedy movies like this. High level sarcastic comedy. Excellent and worth to watch."}, {"id": 68, "text": "Awsm movie must watch everyone...great time pass movie🔥🔥"}, {"id": 69, "text": "If you are a lil into politics you will love the sarcasm full of entertainment worth watching want to watch more movie like this"}, {"id": 70, "text": "Full of entertainment and sarcasm loved it must recommend"}, {"id": 71, "text": "What are you waiting for.. Just go guys and waich it.. I can bet you will love it"}, {"id": 72, "text": "I gave 10 star for this one . Haven't seen such a masterpiece creativity things super creativity Mind blowing. This is current situation , the creativity is super"}, {"id": 73, "text": "Among the best I've ever watched, who so ever is reading please ! You guys should also watch it."}, {"id": 74, "text": "Its an amazing one . I won't give you spoilers go watch by yourself"}, {"id": 75, "text": "I recommend you to watch it atleast once . All characters are already familiar . entertainment at its peak."}, {"id": 76, "text": "Our Bollywood really need movies like this... It's a masterpiece based on some kind of politics.. I loved it"}, {"id": 77, "text": "Worth watching trust me...title of the movie is not that interesting but its really a worth watching movieeeee"}, {"id": 78, "text": "Its a must watch movie.. As you can see I rated it 10 stars so grab your popcorn and enjoy your movie."}, {"id": 79, "text": "I loved it alotttt!!! Amazing characters!! Fabulous actinggg!!! I would love to recommend this movie to my friends...."}, {"id": 80, "text": "Do watch it.. its amazing 😂😂😂😂😂 was Rofling all along"}, {"id": 81, "text": "Amazing flim. Full comedy and entertaining movie . I really enjoyed."}, {"id": 82, "text": "Such a amazing movie 😂 Must watch highly recommend 😂😂👌🏻"}, {"id": 83, "text": "Must watch movie . amazing comic timing . Casting is too good."}, {"id": 84, "text": "Amazing movie i loved it a lott ... and i would recommend my friend and family to watch this ..."}, {"id": 85, "text": "You all should watch this amazing piece, the acting is superb. Really very entertaining 😄😄"}, {"id": 86, "text": "I loved this movie!! I definitely tell my friends and family about this movie... and suggest them to watch this movie once atleast..."}, {"id": 87, "text": "Awesome. Really enjoyed watching this. Do watch it people."}, {"id": 88, "text": "Such an amazing movie, will keep you hooked to your screens till the vwry end. Must watch."}, {"id": 89, "text": "Amazing movie with amazing casting . Maza hi aagya kataiiiii ..."}, {"id": 90, "text": "Fun to watch . Great movie. I recommend everyone to watch this movie."}, {"id": 91, "text": "It's great movie, very fun to watch . Will recommend everyone to watch it."}, {"id": 92, "text": "I think this is the most underrated movie of 2020, i wound recommend everyone to watch it .It is full with humor and every actor has played their character pretty well."}, {"id": 93, "text": "Quite an entertaining and intriguing movie plot. Definitely worth watching!"}, {"id": 94, "text": "It was a great watching a movie like this after so long one should definitely watch it ...."}, {"id": 95, "text": "Really enjoyed the movie. was quite entertaining and funny. I would recommend everyone to watch at least once."}, {"id": 96, "text": "Wow what an amazing movie, star cast also played a good role in movie. Ko"}, {"id": 97, "text": "Fun and family movie. It's direction and story is too good and simple.The use of popular and peppy songs of the 80's era adds its own special touch. In the end, when all's well with the world, everything has fallen back into it's right place"}, {"id": 98, "text": "A must watch movie , quite entertaining. The movie is full of humour and its a much watch irrespective of age!"}, {"id": 99, "text": "Loved it !!! Sanjay Mishra is a gem 😍😍 and Raghav Juyal really great work"}, {"id": 100, "text": "Was fun we watching this with my friend ishika. You all should also go for it. Have fun"}, {"id": 101, "text": "It was marvellous and auspicious work One should definately watch it"}, {"id": 102, "text": "Excellent work one must learn these minuate things from tese so talented people."}, {"id": 103, "text": "A decent movie review should entertain, persuade and inform, providing an original opinion without giving away too much of the plot. This is a great movie review can be a work of art in its own right."}, {"id": 104, "text": "It is a masterpiece with some real.good acting skills by these eyeconic actors. I thoroughly enjoyed it and you all must watch this"}, {"id": 105, "text": "Amazing movie. Will keep you entertained till the end. Also Ram kapoor and Sanjay Mishra's acting will make u watch this over and over again."}, {"id": 106, "text": "Sanjay Mishra is such a versatile actor who always does justice to his roles. Totally loves his acting, you have to watch this."}, {"id": 107, "text": "One heck of a movie it is. You should definitely give it a try. Loved it from the very beginning."}, {"id": 108, "text": "Good to watch for especially sanjay mishra is at its best role the movie is outstanding and also it has a good concept of idea to tell fun to watch."}, {"id": 109, "text": "I don't know why it's kept in comedy catagory where as it contains only foul language and wrong interpretation of people based on a propegenda. Pity that great actor like Sanjay Mishra chose to work on it"}, {"id": 110, "text": "The movie very calmly shows two useless young men trying to ease their way out of the normal rat race by unlawful means, in this process they stumble upon a scam by a so called HERBAL company run by a BABA that plans to enslave the whole of India through a hallucinogen mixed in their products. I would just like to point out that the makers of this movie are calmy trying to nudge the general public to believe that this is the current scenario in India. I would advise all viewers to refrain from such conjecture and not fall into the negative agenda being spread by the makers here..!! I'm rating this 5 because the movie entertains if you keep aside Marxism and Leninist ideology being portrayed. Communist ideas have no place in a country like India."}, {"id": 111, "text": "It is good one time watch. Except the climex where bakchod baba becomes commando..."}, {"id": 112, "text": "Movie is bit slow and someplace you will feel uninterested to continue. So completing movie could become herculean task for some people.Makers really tried hard to make movie to next level but I feel some way they have done overediting and feels like making of immatures.Mishraji and Neha Singh performance is outstanding, Ram Kapoor got very less screen time but he absolutely fabulous.Yes story has many loop holes and request you watch keeping your mind beside.Verdict - One Time watch (Time pass light comedy)"}, {"id": 113, "text": "One more movie with Anti Hinduism agenda. Worst story, worst screen play. Don't waste your time on this third class movie."}, {"id": 114, "text": "Nice movie nice comedy I am enjoy this movie nice movie scene Aur Bhi acche ho sakte the this movie my rating 8 star"}, {"id": 115, "text": "As a mechanical engineer myself, this drama is like a lever sometimes ups and many times down.Film starts with two mechanical engineering graduates from Banaras. The writing is both splendid and stupid at times with lot of revolutionary vision and foray into bringing a change while fighting the current system. Sarcastic comments like phool and andh bhakt were really fresh and nice. Lacks grip but enjoyable in fragments. The real star of the story are Baba and the writing. This is quite like Pariwar on the same platform with at times below average comedy &amp; overperfromance. Both promising premises wasted.Directed by Ashish Shukla, produced and bankrolled by Yoodlee films, film division of Saregama starring Raghav Juyal, Abhishek Chauhan, Sanjay Mishra, Ram Kapoor, Nidhi Singh, Namit Das and Flora SainiThe plough position and taati scenes were interestingly nice. The run time is long and editing was one of the awful parts of the movie along with unnecessary cuss words.Disney Plus Hotstar's latest direct to digital release Bahut Hua Samman is a satirical comedy, which seeks to create awareness among the masses about their duty in a democracy - their duty to question and censure those they've voted to power."}, {"id": 116, "text": "Very good entertainer. I laughed after a long time while watching movie."}, {"id": 117, "text": "With some really good and funny one liners and a decent storyline the movie is quite interesting. Sanjay Mishra steals the show with a role of a lifetime, but the other actors do a great job as well. The comic format of story keeps it very interesting all along. This movie may get lost somehow in heaps of new content pumped by the internet on a daily basis, but this one is decent enough for a few laughs."}, {"id": 118, "text": "Very very entertaining movie a must watch this movie is with a social message"}, {"id": 119, "text": "Must watch, Good acting from all starcast and 10/10 for Story and dialogues."}, {"id": 120, "text": "Must watch movie, shows the reality of babas and politicians in India. Especially politicians from BJP like Yogi etc."}, {"id": 121, "text": "The movie is one of the best dark comedies,I have ever seen after andhadhun,ludo and apharan. The cinematography and direction is Soo good and also the performance of lead actors also Sanjay Mishra,Nidhi Singh, Abhishek Chauhan and Raghav Juyal all were very good.The film deserves high promotions so that it could reach to larger interested audience. This type of movies should be encouraged..."}, {"id": 122, "text": "Everything about movie is great. amazing story ,amazing actors , amazing direction. everything is best. perhaps most underrated movie. at least 1 time everybody should see this film instead of watching other superstar's film."}, {"id": 123, "text": "Loved every bit of movie and Don't miss it. One of the most underrated movie of this year and hats off to Sanjay Mishra"}, {"id": 124, "text": "Must watch.. great movie. Small budget but fresh and clear comedy.You wont bore even for a minute. .... Story and acting is superb."}, {"id": 125, "text": "Simply loved it. Out of the box movie.... Hats off to the director."}, {"id": 126, "text": "Awesome movie. Sarcastic, hatke and those machanical concepts explaination are truly amazing (especially lever pulley ). Must watch"}, {"id": 127, "text": "Bahut mast movie hai Bhosdike* Speechless acting and direction. Background music Ultimate. Guys, wish this would have released in theatre"}, {"id": 128, "text": "Its amazing storytelling, much like comedy in literature. Featuring amazing dialogues with major relevance to reality with such ease sense of humour.This movie is golden.Baba is the funniest, always has been! Surprisingly the best movie to come out in comedy and story telling."}, {"id": 129, "text": "A must watch an excellent merge of morals and comedy enjoyed a lot Sanjay Mishra is an magnificent actor 👍🏻👍🏻👍🏻"}, {"id": 130, "text": "Today i came across this movie &amp; have enjoyed watching it. Its a comment on our current political situation in a very funny way. Just watch it guys."}, {"id": 131, "text": "Superb combination of comedy and subject. Great acting by all."}, {"id": 132, "text": "This satrical comedy is must watch film. sanjay mishra as bakch*d baba is really watchable. His (Sanjay) performance Is Top notch, love to see him in main stream. Story, performance, punch lines, acting is really good."}, {"id": 133, "text": "This movie is simply worth watching. Everybody is so damn good. Sanjay Mishra nailed it again."}, {"id": 134, "text": "Slow start but worth the watch at the end. Sanjay Mishra is one hell of an actor! He can easily be casted as something like desi iron man 😄"}, {"id": 135, "text": "Comedy, timing, story, sarcasm at their best level."}, {"id": 136, "text": "What a Comedy Movie ....Mind Blowing Too Much Funny ...... All Dialogue Are Very Very Comedy Punches Are Also Funny ...."}, {"id": 137, "text": "Fantastic movie laoved it awesome use of abusive hindi language"}, {"id": 138, "text": "In this time of stand up and comedy shows with demeaning comedy, this is a fresh breath. Comedy and subtle sarcasm makes this a wonderful film, and with Sanjay Mishra in it."}, {"id": 139, "text": "I love every thing in the movie But the way director use OLD SONGS in each scene that was awesome!"}, {"id": 140, "text": "Movie is very good. But Ram Kapoor should not be in the movie...."}, {"id": 141, "text": "Beside a comedy it is very interesting to you will really surprise"}, {"id": 142, "text": "BHS, a hilarious movie worth watching. Sanjay Sir raising the bar for other actors. It is what a comedy movie should always be. LAY BACK CHILL AND ENJOY THE MOVIE."}, {"id": 143, "text": "I think the fact that i just went through the process of registering myself on IMDB to review the movie speaks volumes about it . Kudos to the writer for such layered writing . I will be short - The movie is ahead of its times in terms of content . Same masala could have been used to write a suspense thriller spanning 10 episodes , but it would never have been such fun . I'm waiting for more such work , (to whomsoever is reading this)."}, {"id": 144, "text": "This is simply time waster. Avoid this. Try something else even if you have spare time. This is disaster."}, {"id": 145, "text": "Sheer waste of time. Half baked story and underdeveloped characters."}, {"id": 146, "text": "Satire is one thing but to make a whole movie just to insuslt a political party and one specific religion is sick ."}, {"id": 147, "text": "Bollywood just cannot shy away from spreading commie propaganda relentlessly. It's not even subtle anymorePolitician name is ajay singh parmar from UP... Capitalism is ohh so bad and commie comrades come to save the day! N the obvious attack on babas as the evilest ppl...I mean once upon a time it was subtle...aaj kal to its just in your faceC for Chutiy* propaganda movie"}, {"id": 148, "text": "Besides a few initial scenes there is barely anything funny. The movie is a subtle Commie propoganda in the name of satirical comedy. They keep talking about Kranti. Glorify mass murderers Marx Lenin. The same old story of an evil Godman and politician nexus while taking a jibe at Bhakts. Wasted my 2 hours."}, {"id": 149, "text": "Just love the movie ... Good story and screenplay was just Superb"}, {"id": 150, "text": "Sanjay Mishra is an amazing actor he doesn't need any introduction, he nailed it.This movie is one of the best satirical movie made on the current situation in India how so called dhongi babas are making us fool by doing a political collaboration.All the actors did what is required in this movie. Characterization, screenplay everything was so perfect and yes background music is one of the finest you would have ever seen on Indian celluloid.A unique way director has presented a story. An extraordinaire job done by entire team."}, {"id": 151, "text": "An amazing movie in 2020.. the best movie of this year.. pankaj mishra did a fantastic job!! Like some people are saying that it is against one ideology... its not... its just giving a point of view from the other ideology and that too in an amazing way and in now it tries to change your ideology.."}, {"id": 152, "text": "Is slow and steady like a Coen Brothers film. The humour is sometimes loud and in your face but sometimes subtle with a subtext. In either of the cases, it is a great watch. Watch for a good laugh sprinkled with some Sanjay Mishra's Bakchod Baba gyaan."}, {"id": 153, "text": "Don't waste your time guys ... I saw this movie . Found this movie neither comedy nor funny.... You won't find any thing to watch for. I started to watch movie with hype and hope after watching rating .. but m still cursing myself why I watched this one.."}, {"id": 154, "text": "A brilliant satire and comedy. Reminded me of the cult classic Jaane bhi do yaaron. I will watch it again when I need to de-stress!"}, {"id": 155, "text": "Truly awesome.... Do watch... Can't say much about it."}, {"id": 156, "text": "The story reflects the current democratic situation of India, where people are so much dipped in bhakti that they've stopped questioning which is a basic right of every citizen. And that's why the story is relateable. Cast and crew support are all outstanding actors and there is no sign of nepotism. It's a movie that should be in your must watch list."}, {"id": 157, "text": "This movie scores everywhere. Very good actors, great direction, amazing camera work and of course superb comedy thriller. A must watch"}, {"id": 158, "text": "This movie is the best contemporary satire. A must watch movie with great acting and writting."}, {"id": 159, "text": "Fresh content and griped story line are driving factors for this movie. Cast and acting is justifiable and relatable to youth. Good watch for everyone."}, {"id": 160, "text": "Direction- poorDirection intent- goodActing- 90% over acting but interesting.Graphics- rubbish, third grade."}, {"id": 161, "text": "The movie is a must watch for :Storyline Cast Acting Visualisation MusicDo you need anything else??"}, {"id": 162, "text": "Don't expect too much.. it will be predictable but still an easy watch.. Just simple, light movie..enjoy it with popcorn!!"}, {"id": 163, "text": "Simply full paisa wasool. Hell of a entertainment."}, {"id": 164, "text": "The movies storyline was great. But it didn't require the evergreen Hinduphobic ideology of bollywood. For instance: 1. Akhand bharat - a term used by Great Chanakya to unite entire Bharat (India) is used as a name for a company which destroys people's lives. 2. Again a Hindu sage whose only ambition is to earn money and attain power. There are idiots in every religion but every time hindu. 3. The sage and story around him is created in such a way that its character (of swami) resembles Baba Ramdev of Patanjali. I think the writers forgot to look the level of expansion yoga got through his teachings. I am not a fan of Ramdev but neither of this idiotic film. 4. Bhola (as name of Shiva) and yadav (Krishna's vansh) are both criminals who want to have intercourse with one woman. 5. A minister is doing vipaasna in a deep state or as the movie says 3 days and 4 to go after that he gets up and start abusing a man with foul language and starts beating him. Maybe vipaasna doesn't treats your mind well.These are just few examples. I will not say don't watch the movie. Do watch it and see what these people are feeding in the minds of teenagers of Bharat. And then think how you should rate this movie."}, {"id": 165, "text": "'Bahut Hua Samman' brings back the crime-comedy genre, which had taken a backseat for quite some time. It has all the prerequisites of the genre and makes for a fun watch, if you are not expecting too much.The film starts with introducing the two male leads and how they get involved in a bank robbery plan. It takes too long for the narrative to reach till this point. An engineering college backdrop is setup, a quirky mentor (Sanjay Mishra) then comes into picture and an elaborate hiest takes place. And if you get restless while reaching till this point, be warned that this is not even the main plot.As the robbery goes wrong, more characters are introduced and a deeper conspiracy theory unveils behind the bank robbery. Ironically, the film gets interesting only now as the story comes to its actual core and you wonder why was so much surplus added in the start just in the name of wacky characters and funny dialogues.Some scenes are very interestingly conceptualized and the humour works in most places. The director tries to bring in some originality to the crime-comedy genre (holds true until the inspiration behind it is caught) which has its own limitations. Thanks to Saregama being the producers, the makers get access to a huge music library, which they put to liberal and effective use. Retro songs, and primarily disco numbers, are very smartly superimposed on scenes, uplifting the flavour a notch above. The climax action in particular is very well edited! The comic-strip type scene switching is functional though and doesn't add too much value.As the focus shifts to the bigger conspiracy, the two male leads take a backseat in between and you do not mind it much. They anyways seem overused in the initial reels. One does feel that the buildup behind the robbery could have been more original and interesting beyond the formulaic diary with some secret information. Also the climax could have been more imaginative rather than the archetypal shootout in a warehouse.Suddenly in the epilogue, the comedy tone of the film abruptly changes to a social tone with references galore to capitalism, Marxism, patriotism, democracy and a lot other jargons, perhaps with the intent to justify it's title. This attempt however seems forced as it never comes as the underlying subtext from the start but is only touched upon in the very end.Raghav Juyal and Abhishek Chauhan are decent in their parts though they tend to go a little overboard at times. Nidhi Singh is good. Ram Kapoor plays his part well. Sanjay Mishra certainly steals the show.Watch it as a timepass caper and you will enjoy the film."}], "reviews_amount": 166}