{"name": "Let Them All Talk", "titleId": "tt10808832", "reviews": [{"id": 0, "text": "This film is very human, very touching and real, and oh so Steven Soderbergh. Except for his most commercial efforts, all of Soderbergh's films are experimental in some way or another and many have also used improvisation, like this film. If you've lived a life and have had strange changes in your friendships with groups of people over the years, you will get a lot from this film and be able to relate to it and all the interesting characters. People's ideals and motivations change throughout their lives, and it's reflected here. The past is remembered differently by different people. While some can move on from the past, others cannot. Some people grow and change while others remain the same. The story in the film reflects all of this beautifully. Maybe if you're still very young, relatively inexperienced, and haven't done much, or lived, or traveled, this isn't the movie for you. But if you are okay with a film that takes its time and sometimes meanders to strange places, but is always fascinating, like a life well lived, watch, rate and review!"}, {"id": 1, "text": "There. I've said it all in one short sentence. 113 minutes I could have spent doing something better!"}, {"id": 2, "text": "I'm not sure if I liked the movie as much as I wanted to. The story sounded more interesting than it actually is. I catched myself a little bored at moments, waiting through the whole movie for something really exciting to happen.. but nope. It could have been better though if it wasn't for Lucas Hedges' annoyingly-forced acting."}, {"id": 3, "text": "So unfortunate - I was looking forward to seeing this. The three actresses are so talented. Only Dianne Wiest comes off as interesting.It wasn't bad, it was just boring."}, {"id": 4, "text": "Knowing ahead of watching that the dialog was totally unscripted and improvised I found myself appreciating the true art form by the actors. Knowing how petrified they all were during the shoot, it's never apparent from their seamless performances. They were all given a frame to stay in and also an ending to each scene. The rest is them and their own words and reactions. Shot in only 8 days, the film is a triumph of modern day filmmaking. My only criticism was the ambient lighting was at times distracting."}, {"id": 5, "text": "I guess you can see why Soderbergh thought this might fly. Three accomplished, intelligent, charismatic actresses, each of them capable of improvising scenes, developing interesting characters and building relationships without the benefit of an actual script. And, yes, Meryl Streep, Diane Wiest and Candice Bergen are all eminently watchable. Unfortunately, that's no substitute for a strong story, well-crafted scenes and smart dialogue. Let Them All Talk (the title seeming more like the underlying concept than anything pertinent to the content) is just a rambling, undisciplined, mostly tedious attempt at fashioning a movie out of a not-especially-inspired situation and a rather time-worn back story. It doesn't help that much about the writer/agent set up is unbelievable, that it's indifferently directed, extremely slow, often poorly lit and blighted by a dull B-story that involves two seriously dull characters. One sort-of satisfying late scene between Streep and Bergen and a last-minute surprise twist isn't anywhere near enough to save the enterprise."}, {"id": 6, "text": "I really enjoyed this film. I loved watching Streep, Bergen and Wiest. A lot of dialogue seemed improvised so there was a couple moments of awkwardness. This is a modest film. It's never quite predictable. It has little things to say about getting older, friendships and the fickleness of fate. If you like movies with thrills and salaciousness you may be bored. I have to add, the music soundtrack is fantastic and helps set the mood. Thumbs up!"}, {"id": 7, "text": "Colossal disappointment, especially considering the acting talent. Seems like they threw out the script at some point and decided to let them all talk. That would explain the many painful silences (none more painful than the final scene) and the tendency of the actors to talk over each other. The most meaningful dialog in the movie-between Meryl and Gemma-occurred without sound, but they really nailed the facial expressions."}, {"id": 8, "text": "Please. Don't. Watch. This is like a Woody Allen movie without the comedy. I can't imagine anything more boring than this. I would like to corner the writer and director and demand my money back plus a fine for wasting my time. I feel sorry for the actors who will be vilified for foisting this mess on the public."}, {"id": 9, "text": "If you're looking for some witty banter this is not it. With these three great actresses you would expect a lot more. The whole storyline is a mishmash of thoughts and ideas. Nothing flows. And the ending leaves you with what did I just watch. If you don't like it after 30 minutes. Give up. It doesn't get better."}, {"id": 10, "text": "I did not know until after viewing the film, the protocol used or that it was shot in its entirety in 8 days! Bravo!I refuse to address the inane negative reviews here because unless you haven't noticed as yet; that's the way the world goes round folks.Simply Loved it"}, {"id": 11, "text": "Three stars, one each for Streep, Wiest, and Bergan. Hedges was a misery to watch.Obviously, there was no script. A jumble of scenes filled with nurotic insufferable characters.The most painful was the nephew. An insufferable millennial who should be smacked, hard.I fast forwarded through much of it.Soderberg should never direct again.just horrible."}, {"id": 12, "text": "Waste of great talent maybe there should of been a script. Incredibly boring and no plot I hated hated this film."}, {"id": 13, "text": "I subscribed to HBOMax just to watch this movie and I was sorely disappointed. I was so looking forward to this wonderful cast and I knew that most of the dialogue was adlibbed but it was almost like these women couldn't hold a conversation.I watched 30 minutes and gave up; I'll give it another try to finish it.And after browsing the offerings on HBOMax, it doesn't really appeal to me, so will cancel that. And probably will cancel regular HBO."}, {"id": 14, "text": "It's beautiful and well crafted. The script is brilliant and it's the strongest element in the film, it is full of nice and interesting conversations as well. Also the beautiful well written story unfolds smoothly and beautifully. Performances are solid by Meryl Streep, Lucas Hedges and everyone else. The film also has some really beautiful shots and sceneries. But it's not everyone's cup of tea because it's slow-paced and a bit long. If you love this genre you'd highly enjoy it but if not you'd feel bored."}, {"id": 15, "text": "Given no script, which I only found out about after watching this movie, the actors do a nice job. But their monotone deliveries lacked expression and emotion. Sleep-inducing. After investing an hour into it, hoping for more, I stuck with it to the end. It has a nice ending, but again, couldn't wait for it to end."}, {"id": 16, "text": "With a proper script and some character development this could have been soooo good. Instead what we get is an unscripted mess with endless boring dialog. Meryl Streep couldn't even save this movie. What a mess. So disappointing."}, {"id": 17, "text": "Even the best actresses need a script and some well written dialogues! Both is missing in this movie. Boring!"}, {"id": 18, "text": "I don't know. I loved this movie. I watched it twice in a row. It is such a great character study helmed by an able director and steered by the ablest of casts.It never goes where you think it will. And there is so much that goes unsaid that it created a great tension for me.This isn't a fast paced film, mind you. But I found the cadence thoughtful and deliberate. And, on a personal note, as someone moving along in life, having left youth long ago, the story struck a cord with me. And it left me often in tears. Faithful, real, genuine, and poignant are the word that come to mind.It's not for everyone. But it has solidified Soderbergh's talent to tell a story."}, {"id": 19, "text": "Where was the comedy? Meryl Streep acted like she was bored and inconvenienced throughout, Wiest and Bergen were underused and the ending will leave you hugely dissatisfied after almost two hours. Only great thing about this film were the interior shots of the Queen Mary 2."}, {"id": 20, "text": "A low key movie movie about a narcissistic writer aboard the Queen Mary two and it all its luxury.Surprise ending."}, {"id": 21, "text": "I approached this title with extreme skepticism, but from the beginning it spoke to me in a realist, naturalist and unpolished sense. Every conversation you hear feels raw and improvised like in real life however there is huge contrast when it comes to the flow and the planning of the film which feels effortless and elegant. It is a surprisingly beautiful piece of cinema touching on an artist's social struggle and the many ways one can touch other people's lives. In my opinion, essentially it is a film about the intricacy of everyday relationships and an artist's struggle between their social life and their work. It is about self-obsession and betrayal. And the loose way these themes have been portrayed in, gives you an odd sense of rhythm, the kind that you find in an actual conversation. At the end of the day the film feels like a conversation, and a beautiful and moving one at that. With the help of brilliant acting and simple but alluring cinematography."}, {"id": 22, "text": "What a pity. I expected more from them three. They don't feel comfortable shooting this movie. You can feel there is no too much energy in every scene. Alright, Meryl Streep is always an attraction and skipping a chance of seeing her performing is unforgivable."}, {"id": 23, "text": "If you're a fan of Richard Linklater's naturalistic films (Boyhood, the Before trilogy and Waking Life), Steven Soderbergh's Let Them All Talk will be more familiar territory. Dialogue is ad libbed, but in doing so, it mimics real life, which may be not very exciting, but the payoff is it feels real. People hesitate and struggle to say what they mean. That's not to say it's bad dialogue - some of it is really good, really relatable and often funny. They give you just enough to understand them without revealing everything - each personality just the tip of an iceberg - as it becomes clearer there is a mystery at the heart of this little story. Without spoiling anything, there is a plot twist which changes a lot of the meaning of the preceding conversations. It really is a clever and provocative film, so stay engaged and read between the lines. Also not to be missed for fans of Meryl Streep."}, {"id": 24, "text": "I always wanted to go on a cruise in the Pacific or in the Caribbeans or something. After seeing this movie I realize I would be bored to death. So, no cruise for me.Some great acting performances here, but the story overall is not that interesting. Pity."}, {"id": 25, "text": "This film, egregiously misrepresented in most of the reviews-- and even descriptions-- I've read, hits all the right notes. Everything from the pacing to the performances are pitch-perfect. This is not a cruise movie. This is a film that, if you let it, takes you into a world that is richly and convincingly populated. It is symbollicaly laden but never heavy-handed. It doesn't stray from its purpose, and it keeps us interested from the first scene to the last. Streep and Wiest are especially compelling, but there isn't a weak link in the cast. Soderbergh's greatest accomplishment to date."}, {"id": 26, "text": "That movie is not for the wide audience. Brilliant acting and seance of something real as the real life"}, {"id": 27, "text": "A really boring, feeble imitation of a film of Woody Allen. These two actresses have been great in the past but now I had the feeling that Meryl Streep is mumbling for almost two hours."}, {"id": 28, "text": "If you want to see just an animated story, try something else."}, {"id": 29, "text": "I had high hopes for this movie...3 accomplished actresses on a beautiful ship sailing the sea....but, it was more of a disaster. I was hoping for a compelling backstory about these three friends and why they had grown apart, but I still don't know who they are and why they are even traveling together. Shallow and pretentious. A waste of 2 hours."}, {"id": 30, "text": "Three stars for three great actresses. And that's where it stops. Couldn't get through it, what a boring mess."}, {"id": 31, "text": "I am an hour and 27 minutes into this movie. I think they're are 25 minutes left. Please just shoot me in the face so it will all jusy end now."}, {"id": 32, "text": "I am so furious about this movie. They are on a luxury cruise, and they are doing nothing but talking and complaining😅"}, {"id": 33, "text": "With this cast, the only thing that I can think is that they all needed the money. Very sad."}, {"id": 34, "text": "This might have been a good idea but they forgot actually write the story and add the dialogue to the script. They didn't fill in the characters, missed all the conversations that should have been filmed with dialogue, and just added music and silent scenes of the actors apparently interacting - maybe to make it seem arty? Did the script writer die before fleshing out the notes used to pitch this to investors and they just decided to shoot what they had? Sad waste of some great talent and a terrible disappointment."}, {"id": 35, "text": "Was looking forward to this. Such a talented cast. The writing is excruciatingly stilted and pretentious. The characters are all uninteresting. The actors seem bored, too. Lucas Hedges is awful in this. I wish I wasn't in COVID lockdown so I didn't feel compelled to watch stuff like this all the way through."}, {"id": 36, "text": "The ever-adventurous Steven Soderbergh's latest experiment, 'Let Them All Talk,' assembles a fine cast that includes Meryl Streep, Candice Bergen, Dianne Wiest, Lucas Hedges, and Gemma Chan and... well... let them all talk and improvise on a script that reportedly served as more of an outline for the cast. It's a slow-moving cruise but the acting is so comfortably genuine that it's a really enjoyable, delightful ride."}, {"id": 37, "text": "Life, friendship drama all those twists and turns in life, how the lack of communication ego can affect a relationship I found it smart, funny and sad"}, {"id": 38, "text": "I was very hopeful about these wonderful actresses getting together, but what a disappointment. It was slow, story did make sense, and I was still asking questions at the end."}, {"id": 39, "text": "I had an enjoyable experience watching this movie. I liked Meryl Streep; you can feel she was into her role so well..as for the other actors they did what they had to do no more no less,especially for the nephew and her friends.and that's a good thing don't get me wrong. One other thing that you're gonna notice is the quality of the dialogue,you keep watching them talking and talking but you're not bored totally the opposite you're enjoying yourself in a way of ease and satisfaction. It's a fun movie but some people will not like it,they'll say there's not any point to this,for the whole movie they're just talking and rumbling about stuff that i really don't care about,the story didn't attract me enough.. I say to them this is the kind of movie that you watch when you're chilling on the couch drinking a glass of wine and just want to watch something refreshing and unheated. Really cool movie,I really recommend you to watch it."}, {"id": 40, "text": "These are three of my favorite actors who were simply wasted in this movie. They clearly did their best with what they had...nothing; and, each proved their metal. If I want to spend a couple of hours watching a show about nothing, I'll watch Seinfeld. There was no tension, no emotion, no catharsis...not even a real explanation of what happened. I couldn't help but think that much of this film was left on the cutting room floor. And...at the very end, Alice's journal is added to an entire collection of them...are they planning a sequel????!!!This movie meandered around looking for a place to land and never found it. I hope these phenomenal ladies find something more worthwhile for their next endeavors."}, {"id": 41, "text": "I love these actresses, but this movie is super slow."}, {"id": 42, "text": "Love the cast, but the movie was incredibly boring."}, {"id": 43, "text": "Constant breaks between dialog, ramblings, a very weird Meryl Streep, a creepy nephew, strange friends, and NONE OF IT GOES TOGETHER."}, {"id": 44, "text": "Ugh! Seemingly pointless, meaningless interactions &amp; connections that you keep waiting to make sense. It never happens! If it did, I quit caring enough to notice. The nephew was excruciating to listen to. One word description for this movie - TEDIOUS."}, {"id": 45, "text": "It looked SO good on paper. Supremely talented actresses - what could go wrong? Sadly, I have had more fun cleaning out the refrigerator. It was just meh. If there was a plot, they hid it from me. I've had telemarketers who had brighter patter. I really didn't care what happened to any of the characters, the pedicure I was giving myself was more absorbing. It wasn't horrible by any means - just had the thrill of overhearing a stranger during her duty call to her aging mother in a senior center. If this was experimental in that there was no set dialogue - failure!"}, {"id": 46, "text": "Loved it. Excellent. I was shocked at the reviews. This is an exquisite piece of work. Soderbergh is beyond his time. All of these women are legends. They should be celebrated for their hilarious and raw performances. Excellent material. This is a treasure."}, {"id": 47, "text": "Better than the indicated rating, it's definitely not for everyone, but if you like this kind of movie, you will enjoy it. Had to write a review because of the so-so rating and negative reviews. Didn't know what to expect other than the powerhouse casting of Meryl, Candace and Dianne. I did notice the dialogue was different while watching, then understood it after reading that the director and actors were improvising given the scene, context and desired end result. With that said, I thought it was a lovely movie. The only mark I thought was a miss is when Alice and Karen's talk was over music. I would have loved to listen how they reconciled and what they said - a young, ambitious career woman and a mature, experienced woman of a certain age. The ending left me happy, melancholy, but hopeful. As for the characters, the 3 main actresses brought their own wisdom, regrets, jealousy, love and fears to the role because they have lived it in a full personal and screen/stage life of their own. If you're looking for a quiet, thoughtful afternoon movie, give it a go."}, {"id": 48, "text": "Although taking place across the ocean, this movie is dry and boring.... an endless splash of over indulged intellect blah getting thrown at you, no strong thread, endless monologues.... the only thing that keeps your interest is the collection of stellar actors.... disapointing flop!"}, {"id": 49, "text": "A wonderfully refreshing break from the relentlessly paced action movies so common today. Like the ship itself, this one helps you to settle down your pace and actually listen to dialogue and watch the wonderful acting and scenery.The characters are like flowers that slowly open up as the plot procedes and we learn more and more about each one and how they all intertwine in the past and in this present.Very well written, directed, and produced. But if you need fast action to maintain your interest, this is not for you."}, {"id": 50, "text": "Good actresses together in slow but nice move. The main and the most interesting part of this move are all dialogue"}, {"id": 51, "text": "Improvised and you can tell. The movie could have used a little more structure."}, {"id": 52, "text": "I really appreciated the relaxed pace of this movie as it weaves its tale. Loved the ending!"}, {"id": 53, "text": "Such a shame with such great actors that this movie is not enjoyable. It's obvious that it is unscripted as the dialogue is very strained. The setting makes me long for better times before Covid."}, {"id": 54, "text": "This film is the reason Covid 19 has affected the movies of late, Past talent have embarked on a journey of self serving platitudes to revive their careers with scant writing and even worse acting. I was hoping for a great film, but was left wanting. It was a long and drawn on out with no end in sight. Sorry...I love the actors but was disappointed."}, {"id": 55, "text": "Great actresses got together and the only feeling I got at the end was dull,,,, boring, exhausting, a bit dumb,,,, I am not sorry to have watched it but waste of time and talents for me,,,,, as well - if there should have been some secret message - couldnt anticipate one! could have been so much better and more lively"}, {"id": 56, "text": "But Candice Bergen looks like she has put on weight ..her breasts look huge. Lol"}, {"id": 57, "text": "1. The conflicts that are hinted at are underplayed - except for one scene at the very end, but with no fireworks 2. Very little humour 3. Slow pace, glacial 4. Sketchy script 5. Sadly, Meryl Streep was Meryl Streep, not Alice. A first for her, perhaps 6. Poor character development 7. The boy doesn't even get the girlWhen I see movies like this one, it makes me desperate to get a look into the mind of the storywriter and director, to figure what was the point they were trying to make - unless of course there wasn't any point to begin with! And if they'd indicated that,I wouldn't have wasted a portion of my life watching this paint dry."}, {"id": 58, "text": "When i saw the trailer of this movie, i looked forward to seeing it, since it has three leading legends in it. It also had a nice Titanic vibe to it, since most of the film takes place on a huge fancy ship. But throughout the film, it felt like it wasn't a film at all, it was just the daily routine of the three lady friends, and the young man accompanying them. It felt very long and tiring to watch almost two hours of this. The ending also was quite surprising, and when it was over, it didn't feel any good at all. I feel it was such a waste of talent, and i am very surprised that it was directed by Steven Soderbergh, it felt very different from his previous movies. I guess the approach of letting the actors improvise, has really not been a good call here. I didn't feel like there was any message that needed to be said here, just a bunch of unimportant and boring situations. But what i loved the most was the Queen Mary ship, now that is the modern version of Titanic, it's like a world of its own, what an experience it must be to sail on it."}, {"id": 59, "text": "No script made this movie fun and playful at times but overall boring and lacking direction. Sometimes this made the characters interactions more genuine but mostly made them sound lost. At times they would ramble on and on, stepping over their words as they grappled over what they were going to say next. I'm glad I watched it but I thought it was just okay."}, {"id": 60, "text": "Stellar cast with three of my favorite women. I love them in spite of the slow going in this film. I think improvising works wonderfully in a sitcom or a series. In this movie it feels like everyone is afraid to talk to each other when the reality is they are loosely managing a script. Generally when people communicate to each other like this one is a bully. That character really does not exist here unless Alice is the bully and I don't see that. The dialogs are somewhat painful in that it feels like no one can be honest with the other or simply get their words out. That may be the message here which is relevant when friends have been estranged. Nice effort to combine stellar talent."}, {"id": 61, "text": "What an enormous disappointment.I was very much anticipating this. Meryl Streep, Dianne Wiest, and Candice Bergen - what a cast!What a bore. It felt like there was no script, that it was all ad-libbed and nobody knew what to say or how to bring any story.ZERO character development. Almost NO conflict. Maybe five lines of conflict for the first 90 minutes. Then one scene sort of out of nowhere. It was strange.The kid playing the nephew could hardly act. And apparently is incapable of washing nor brushing his hair.The only thing I can figure is that they wanted to be directed by Steven Soderbergh. And with the music crescendo at the end, it made you feel like Soderbergh thought he just directed something deep. Instead it was almost two hours of... nothing."}, {"id": 62, "text": "The irony of this movie is that it is about a writer. What this film needs more than anything is -- a writer. The actors did their best, but this meandering mess lacks coherence, point of view, or plot. Perhaps his cast of big stars took the lion share of the budget and Soderbergh was too cheap to hire a decent writer. Take it from me, it would have been money well spent.The three protagonist characters are soul-less cardboard cartoons. I suspect Dianne Wiest, Meryl Streep, and Candace Bergen chalked it up to a free trip on a cruise ship, because each of these women have had amazing careers and wonderfully realized parts. They surely know what a solid script means to a project.The most believable characters is this drek are the Kelvin character played by Daniel Algrant, and Karen played by Gemma Chan, whom I first noticed in a British potboiler about androids, in which she was an android. I guess they were more comfortable with improvising dialog.The last thing I saw of Steven Soderbergh's was a film done by amateurs about the solving of a murder. It was equally pompous and self-important. He obviously thinks he's more talented than his work displays."}, {"id": 63, "text": "As a late middle-aged woman, I was really looking forward to this because I can relate to friendships of aging friends.I love Candace Bergan and Meryl Streep can be good but most of the time, it just seems like she feels like she is too cerebral to be sharing the earth with the rest of us unwashed masses. I don't recall seeing anything with Wiesz but she definitely seemed like she could be good. but it was so disappointing.Have you ever been to a party where you really don't know anyone and you find yourself talking to a group of people who are all friends? It is if they are talking in code about stuff you don't know about and making all these inside references and you are just sitting there listening... out of the loop... and bored. If you like this type of experience, you will love this movie.You wait nearly 2 hours for something to happen and just about the time it does, the ending credits roll and you are just kind of MAD -- because you're thinking really, that's IT? Yup -- that's it.About the only cool thing was seeing the Queen Mary 2.For those who are rating the movie 10/10 and saying that we just are too dim to get it... I can only assume they are being ghost written by Meryl Streep because that is exactly what I would expect her to say."}, {"id": 64, "text": "How much you like this will depend on how well or how little you think the ways Soderbergh and Eisenberg develop the characters (apparently from what Ive read it was semi improvisation, Altman but with locked-down Soderberghian angles and mis en scene instead of long lenses and wandering pans). I would have loved to see how much the actors just came up with dialog on their own (usually not what we expect seasoned pros like these women to do), but over this story of a storyteller and her friends and what stories and romance inform the fictions we create is compelling and interesting, and the setting makes for these characters to have literate, thoughtful exchanges about how bloody difficult it is to be emotional with one another (or you can *confide* in others, but depending on the company).In other words, I can see how this is an experiment in some part of the form, but it's so satisfying to see that this direct or made sure to craft it into a film and not just a bunch of ramblings that don't come to a head (and this does). It's really about something, about how we reconnect or make new connections and how tenuous those can really be based on what's happened in the past and trust issues or just how much a planetarium can bring a man and woman together, and all the while it feels like the setting and style and music are closer to a Golden Age Hollywood movie (but with a Soderbergh twist)."}, {"id": 65, "text": "What. A. Fascinating. Film.Steven Soderbergh has outdone himself with such a fascinating, rich and unique film. What I found so unusual is that the screenplay consisted of only basic outlines for scenes. The dialogue was entirely improvised by the cast, which is just incredible. I've seen this happen before, and usually to a less successful end.I'll interpret this to mean, that Steven Soderbergh presented the cast with a basic plot - and it was up to them to interpret their characters and roll with it... which is perhaps why this film is so unique. Each character was so rich, so human... so truly complicated and imperfect, it was a wonder to watch.It's this style of film making that I love, because although a story has been conjured up, you're really leaving a lot to the imagination of your entire cast - not just a handful of producers and a writer sitting in a room. Each character was truly able to come into their own.The cinematography and editing was, as is standard with Soderbergh films - done by Steven Soderbergh himself, under pseudonyms (in this case Peter Andrews, and Mary Ann Bernard). So although the dialogue was rich and diverse, the architecture, and physical structure of the film was directly tied to Soderbergh. There were a few of the scenes that I wish lasted longer, the visuals were simply so stunning I wanted to linger over them and take everything in for as long as I could... which for a film directed almost entirely on The Queen Mary 2 - is an exceptional feat.Another significant stand-out for me, was the score. Thomas Newman (Tolkien, 1917, Skyfall, The Help). Newman is a well versed composer, with dozens of well known films under his belt. The score was rich, delicate and unique - inspired by vintage jazz.The acting, given that the script was non-existent was truly, truly inspiring. Meryl Streep - as always is a visionary actress to behold. Lucas Hedges was a constant source of admiration and bewilderment, mostly because his character was continuously so sweet. Dianne Wiest and Candice Bergen were hilarious and gentle, giving very intimate performances. Gemma Chan was a stand-out as well, delivering a really intriguing performance that made you question the character, whilst also caring about what they were going to do next.I can't wait to rewatch this film with a fresh new perspective, keeping in mind that there was no script; and that the performances were all inspired by the cast."}, {"id": 66, "text": "I'm always interested in the self-imposed restrictions this director brings on himself, and I found Steven Soderbergh's experiment interesting. Although, it's not a film with wide appeal. The New York literary scene is a heady, oft putting racket where temperamental writers run up against a publishing house's need to be responsible fiscal managers. It's a familiar trope of writers not always being confident in their work, making the publisher nervous as deadlines draw near. (And maybe its a little too familiar for us to be spending our time watching this.)However, the hook is a bartered trip to England on the Queen Mary II, where Alice (played by Meryl Streep) drags along some old buddies who have old issues needing resolution, and like Auntie Mame her young nephew, a mutual ally, is in tow. The publishers sneak aboard a representative to keep tabs on Alice to make sure the investment of the trip will actually produce a finished work...or any work at all. No one knows what the new book is about or how much of it has been written.Complications ensue.The nephew has feelings for the publisher's spy which Alice, rumored to be unreasonable and demanding, may feel like there's been a double betrayal by her relative and her publisher. The two old friends also have issues. Susan, played by the always reliable Dianne Wiest, is damned to be a mediator of conflicts but, like mythology's Cassandra no one listens to her. And Roberta, played by the sensational Candice Bergen (who doesn't make enough movies as far as I'm concerned) has a festering 30 year resentment due to a not-too-lovingly constructed character in Alice's most successful book is based on her life. So much so, her husband learned things about her and divorced her. Or, so Roberta believes and is loading her emotional guns for a showdown and payback.The film's dialog is improvised. Soderbergh gave the actors a goal for each scene, and let them come up with the dialog that--yes, slowly--pushes the narrative along. They are on a transatlantic ship, and there's lots of time to kill and lots of void to fill with talking. Whether the technique is successful is up to each viewer. I found it interesting to watch some major talents reveal just how creative and intelligent they are without a script to rely on. (Admittedly mixed results, but interesting nevertheless.) Lucas Hedges is at a disadvantage. He's pitted against some very experienced actors who have a depth he couldn't possibly match. And he stands out as weak, and that's really unfair.Soderbergh who put all of this together is masterful with his little digital camera working his visual magic as usual. And he's got one of the greatest floating sets in the World as background to his story. Part of the excitement is that we the audience can experience what it's like to be on one of the most famous passenger ships in history. Not an altogether bad seat to be in while watching this.The narrative has few highpoints. The nephew needs to resolve his attraction to the publisher's spy as well as reveal his betray to his aunt...and let those cards fall where they may. Roberta needs to confront Alice for ruining, she feels, her life. Susan needs keep everyone happy. Plus, the manuscript underway needs to either be exposed as non-existent or yet another betrayal to Roberta by reviving the character (which is what her publisher is counting on). Not really a high stakes story that would keep everyone on the edge of their seat.I thought the resolution came out of left field. Information is withheld from both the characters and the audience that felt...literary and contrived. And once they reach their destination (as travelers and as characters) it all happens too quickly. It felt like, Well, we're off this magnificent ship. It's cold and rainy. Let's wind this up so we can all go home. But. The end--as in life--often comes unexpectedly and is often at odds with what we have planned.Streep is--as always--watchable. Wiest, too, is an always reliable actor, contributing more than she's asked to do which is a joy for, I'm sure, the director as well as the audience. Bergan is a hoot playing a not-too-likeable (no one wants a bitter friend on a cruise) Texas divorcee who can see that the end of her life will be long and hard. The fact that she makes the character the comedy relief in this overly intellectual story stands out. And we thank you. Gemma Chan brings grace and intellect particularly in her scenes with Hedges, which elevates both of them and the film. Thomas Newman's jazz score also adds sparkle.But the real star of this 2+ hour gabfest is the magnificent R.M.S. Queen Mary II. Luxury décor may not be to everyone's taste, but when my focus flagged, I found something to look at in the background. There wasn't even a terrorist or an iceberg or lifeboats being dispatched. And the restraint it must have been not to include what we usually buy a ticket to see was a relief."}, {"id": 67, "text": "The filming was beautiful except for the discotheque scene on the QM2. The scenery was really interesting.The writing was interesting in concept.The actors superb. The actors improvised the dialogue. While I like having actors work with writers to bring a collective best performance to a film, this should not have been done.This was slow, boring, monotonous, and a self-absorbed bit of cinema that should have been chucked overboard mid-crossing.1 hour 53 minutes and 8 seconds of my life was lost to this. Don't let it take your precious life too.I love Meryl Streep, Dianne Weist, and Candace Bergen. This could have been so very much more. It was very disappointing.Not to put too fine a point on it, but I very much disliked this film. Beware."}, {"id": 68, "text": "IN BRIEF: A futile exercise that wastes the talent on board.JIM'S REVIEW: (NOT RECOMMENDED) Let Them All Talk is probably the most apt name for any movie. That is all they do...talk and talk and talk...and never say much in this slow boat ride. The improvisational conversations may seem natural, akin to Richard Linkleter's style of filmmaking crossed with a Woody Allen set-up, but the spoken words here have no wit, clever retorts, or real insight. (It seems incongruous that a screenwriter, Deborah Eisenberg, was given screen credit to this idea disguised as a movie.) Director Steven Sodenbergh takes an interesting premise and bores his audience in what amounts to a 2 hour commercial for the Queen Mary cruise-ship.Meryl Streep plays Alice, a successful author sailing to England to pick up a prestigious award who brings along two old friends to reconnect after 30 years. That they are played by Dianne Wiest and Candice Bergen certainly adds to the film's pedigree. She also invites her nephew Tyler (Lucas Hedges) as her companion to watch over her friends. Secretly aboard is Alice's book editor (Gemma Chen) and her bonding with Tyler becomes a distracting and dull subplot. Filmed in two weeks, the talented cast is hopelessly stranded aboard this luxury liner with not much to do or say, though it is beautifully filmed by the director (under an alias). Mr. Sodenbergh actually seems more interested in the physicality of the ship as his setting than his cast of actors who need more direction.There is not much character development or action although the three actresses supply some credence to their roles. But the whole exercise seems superficial and contrived. Except for one well-acted scene between Ms. Streep and Ms. Bergen in the third act, Mr. Sodenbergh's movie lacks any real tension, drama, or humor.Let Them All Talk is a wasted opportunity with all of the talent involved... Well, at least they all traveled in style. (GRADE: C-)"}, {"id": 69, "text": "I liked it. I read the reviews here before I saw it and didn't expect much, so I got surprised with how much I liked it.Many people found it boring, but I just don't think they knew what they were watching. Because yes, it is boring in the sense that it's not an action thriller or drama where things happen fast and the dialogue snaps. It is exciting by how realistic it is, because your life doesn't contain suspense background music or quick dialouges that always has a message behind it. This movie shows life in a wonderful way.I think the dialogues and the character arcs were really interesting. The movie is not the typical movie containing some dramatic storyline with the same recipe as all other dramas. Let Them All Talk is a realistic movie. Three old women who has grown a part not able to communicate as well as other cliche film characters.The nephew, played by Lucas Hedges, also really hit me. The way the character is awkward and a bit weird, but in a realistic sense. He is not the way he is for entertainment purposes, - he just is himself. His awkward but kind self isn't often portrayed in cinema and I really fell for it.I'd say give it a chance, but know what you're throwing yourself in. You are going to watch a movie with another pace, another way of telling a story - and this tells a story of four normal people where some have long life experience and some not."}, {"id": 70, "text": "This movie took 8 days to film aboard the Queen Mary 2. They should have spent some of that time rewriting a very poor script. The actresses improvised much of their dialogue and did a fairly good job with their lines. Too bad the plot is a mess, the characters, except for Dianne Wiest, are unlikable and unrelatable and the ending is a letdown. Everyone seems to think Streep is a great actress. I think she's unwatchable. She hams up every scene she's in with her deep emotions. We're supposed to believe that Streep's character somehow cares about her friends and her nephew but she shows no signs of it. I kept thinking there was a method to her portrayal but it went nowhere. Candace Bergen has never been a good actress and her character here is thoroughly unlikable. She's sees herself as the victim when it's her own actions that resulted in her current circumstances. You can't tell if the nephew is a gold digger or if he truly loves his aunt. Soderbergh must think he's Ingmar Bergman. Lots of lingering and extreme closeups of hands, staring faces and books. Very little plot and very little character development. The characters end as they began and you feel like both you and they have learned nothing. The ending is somewhat of a surprise but that's tempered by the outlandish development with Dianne Wiest. Nothing remotely plausible. The most enjoyable part was the filming on the actual ship. It's a marvel of luxury and a bygone way to travel across the Atlantic. If any of us could afford it."}, {"id": 71, "text": "The characters actually all of them for one reason or another all make you feel like slapping them repeatedlyso self-absorbed they are. self-congratulatory. setting it on an extreme conspicuous wealth sea-liner is a stroke of geniusas in all Soderbergh babies since SL&amp;VT the rhythm is there the Jazz the soundtrackthe creepy nephewthe English literary agent career-climbing spinsteronly her 2 friends she has brought along do not ALWAYS make you want to reach for the barf bucketSoderbergh is excellent at starting a conversation and then truncate it to jump to another so not a jumpshot but a jumpconvo it keeps you interested gives it a pulse; the communication has been made let's move on; no lingering ... a good 6 maybe a 7"}, {"id": 72, "text": "Let Them All Talk is a very strange movie. Most of it is improvised (shudder) and the result is so slack and inconsequential that it barely registers as entertainment; like a filmed adaptation of Brian Eno's ambient records of the eighties. Mannered naturalism is the hardest trick for an actor to pull off (though Woody Allen can do it in his sleep.) But Meryl Streep is the absolute master. She makes such a brilliant art out of throat clearing, 'pausing with meaning,' and a whole arsenal of seemingly random face-touching that it's a wonder to behold. You know it's artificial, but you can't take your eyes off it. In the hands of an amateur, however, mannered naturalism is exhausting. Poor Lucas Hedges, who plays Meryl's nephew, just can't stop working the tics and sniffs and meaningless pauses. His hands wander over his face constantly, and he makes the simple act of 'listening' (and we watch him listen A LOT) into something studied and inauthentic. Even in the wide shots you can see him busily twitching away, actively engaged in being 'real.' When, at the end of the movie,he energetically gazes at a pair of photographs of his younger self, it's amazing to see what he looks like when he's still. And the photos give the better performance by far. For a full hour Let Them All Talk is utterly casual, static and fatuously chatty. And then in the middle of a scene with Gemma Chan (as Meryl's agent) the movie suddenly becomes about something. Both Dianne Wiest and Candace Bergen (channeling Gena Rowlands) snap into focus. All this vague jabber has apparently been preparing us for the heartrending moment when Wiest's character stops the film in its tracks to talk about the stars in a way that made me almost weep. Then, thank God, Bergen and Streep have a killer scene together; gorgeous, and subtle - that makes the slog of the first half almost worth the time. I've never had a chance to realize what a terrific actress Candace Bergen is. And her work here is sublime. Then, unfortunately, the ending of the movie is handed over to Hedges, who can't stick the landing, and who makes the act of staring into space seem as natural as juggling lobsters. However, there is definitely something to be said for a film that lets us look at and listen to a group of women in their seventies. Yes, they could've used a real script. But if you can make it to third act, there is actual meat on these bones."}], "reviews_amount": 73}