{"name": "Chick Fight", "titleId": "tt10944486", "reviews": [{"id": 0, "text": "It is almost as if they are trying to compete for the title of worst movie EVER nowadays,Don't,just Don't wast a moment of your time viewing this monstrosity of a movie,unless you are pondering taking your own life,then this will help push you over the edge."}, {"id": 1, "text": "What an incredible waste of time for everyone involved, especially the audience. Do the companies actually make money off this garbage?Maybe if they didn't give the cop friend so much screen time with her extremely unfunny personality, it would be better."}, {"id": 2, "text": "This comedy is perfect for 15 year old edgy girls? I apologize, I have no idea who would enjoy this. There are many things that are bad. Cinematography, camera work, acting, dialog, script, editing, fighting choreography, sound design, but what ruins bad comedies, is the comedy. Although I am not sure if it just a typo, because nothing is funny.The female black cop who is sassy, steals drugs and helps an illegal organisation is not funny. A caricature of a gay couple is not funny. Also Alec Baldwin? How does he still find work? He is unfunny, untalented and just god awful.Man I was disappointed by this movie. I was genuinely exited for it. I hoped it would be a commentary about our society and how woman are treated and/or seen. Bad or Good. Something that would subvert our expectations about the capabilities of women. Anything good really.But instead it is about money?! This club is supposed to be a save place for women, but instead it is just B*tch Fight. This save space thing would be good, but they ruin it with every single character being an absolute a**hole. Some forced BS cliches: 1. her mother was the leader of the club 2. Love interest 3. Training without any physical transformation while she still punches like a girl 4. Not a single woman looks like they ever fought and they always look absolute perfect.The only good thing is, take a drink every time they do a slow-motion."}, {"id": 3, "text": "She can't even be a good Thot on only fans. Lol worst and most pathetic acting from her. While everyone else was half way decent"}, {"id": 4, "text": "In Come Back To Me director Paul Leyden's Chick Fight, dames put up their dukes and puke up their blood at a female only underground boxing arena like their male counterparts in the Brad Pitt film Fight Club (1999). Comparably, this estrogen-driven, LGBTQ-friendly romantic comedy glamorizes stereotypes of sweaty, hard-bodied babes sparring in sexist tropes scavenged from landmark male boxing epics. Not surprisingly, this feel-good but featherweight female empowerment opus qualifies as neither the first nor the last movie about lady palookas. Indeed, several robust chick fighting films proceeded and undoubtedly influenced it. First, Frank Clarke's Blonde Fist (1991) charted a woman's rise to prominence as a professional boxer. Second, Under Siege darling Erika Eleniak came out punching in director Eugene Jarecki's The Opponent (2000). Third, Karyn Kusama's Girl Fight (2000) offered Fast and Furious star Michelle Rodriguez hammering blows home. Fourth, in Million Dollar Baby (2004), Clint Eastwood showed Hilary Swank how to stay off the ropes. Fifth, we have Jonathan Dillon's Fight Night (2008), featuring Rebecca Neuenswander. Indian director Omung Kumar's film Mary Kom (2014) is sixth, while Miguel Angel Ferrer's Female Fight Club (2016) with Amy Johnston is seventh. Finally, Hüseyin Tabak's Gipsy Queen (2019) depicted a single mom who fed her family by climbing into the ring. Nothing about Chick Fight is remotely original, but freshman scenarist Joseph Downey and Leyden put their charismatic cast through their paces with such giddy glee that you cannot help but enjoy this slick but shallow saga. Twenty years ago, the R-rated Chick Fight might have hoisted eyebrows with its profane dialogue, sexual innuendos, bloody fisticuffs, and fleeting drug use, but content like this now generates marginal shock value.When we meet beautiful, blond, but woebegone Anna Wyncomb (Malin Akerman of Rampage), she is having a bad day. First, she finds herself out of toilet paper. Second, she watches helplessly as her Prius is repossessed. Third, not only are customers in her coffee shop growing scarce, but Anna also is still sinking in a sea of red ink. Fourth, imagine Anna's surprise when her recently widowed, blue-collar father, Ed (Kevin Nash of John Wick), a brawny Paul Bunyan type of a bruiser at 6' 11¾, comes out of the closet! Anna is still reeling in shock when he introduces her to Chuck, (Alec Mapa of Hard Pill), his sniggering, pint-sized, bespectacled, Asian boyfriend. Ed explains his wife's death and his subsequent loneliness has opened him up to a new kind of relationship. The sight of Chuck clinging happily to Ed spins Anna's head. This topsy-turvy day is just warming up when Anna's African American, XXX-sized, trash-talking, lesbian BFF barges through the door. As it turns out, Charleen (Dulcé Sloan of Baby Mama's Club) is also a pistol-packing, uniformed patrolwoman who loves to play with her handcuffs. She persuades Anna to smoke pot as well as gargle moonshine, courtesy of the police evidence locker, to sooth her soul. It doesn't help matters Anna hasn't recovered from the recent death of her mom. Absent-mindedly, she knocks the joint into a puddle of illegal moonshine that Charleen had splashed on the floor. Later, an inferno engulfs Anna's coffee shop. Naturally, our heroine had no insurance. If things couldn't possibly get worse, not only does Charleen order Anna to put a pillow case over her head, but she also escorts her into an illegal underground fight club for women! According to Charleen, Anna must confront her fears before she can achieve her dreams.Anna finds herself in an auditorium with a boxing ring in a giant cage where women dodge haymakers. The catch is Anna must challenge an opponent before she can exit the club or she must battle the burly owner, Bear (Fortune Feimster of Friendsgiving), who won't let her out without a scrap. Reluctantly, our heroine squares off against a mousy librarian. Ms. Bookworm decks Anna with a sucker punch. Tradition dictates each victor must pin a dollar bill to a wall of fame papered with Washington's portraits. The major revelation of the evening for Anna is the news her dearly departed mom launched the shelter as a safe haven for women! Bear plays a video of Anna's mom before she succumbed to cancer. Just as everything appears to be returning to normal, Anna encounters an upstart contender, Olivia (Bella Thorne of Infamous), about half her age who vows to annihilate her. Not only does pugnacious Olivia want to take over the club, but she also aims to steer in fresher blood and oust the old dames! Predictably, Olivia flattens three adversaries at once in short order, and this feat petrifies poor Anna. Charleen introduces Anna to an unorthodox trainer, Murphy (Alec Baldwin of Heaven's Prisoners), a pot-bellied drunkard who can't carry a tune in a bucket at a karaoke bar. Miraculously, no matter where he lands after he falls, Murphy never spills a drop! After he takes Anna on as a client, Murphy puts her through a rigorous boot camp reminiscent of Sylvester Stallone's training in Rocky (1976). Murphy toughens Anna up. First, she must burst a watermelon open with her fists while dancing barefoot on a sizzling hot Florida beach. Eventually, after slugging half the day away, she manages to pulverize the elusive, thick-skinned fruit! Second, Murphy teaches her to crave pain. Anna spars with a partner, but she must take the blows rather than parry them!Director Paul Leyden keeps the action fast and frivolous, and Chick Fight taps out at a tolerable 97-minutes. Malin Akerman qualifies as a sympathetic underdog heroine who constantly finds herself stumbling over one predicament after another. Bella Thorne makes such an obnoxious but gorgeous villain you want to poke her in the face. Alec Baldwyn behaves like he had a blast as Anna's boozy trainer. Chick Fight ascends to hilarious heights every time comedian Dulcé Sloan steals the limelight to indulge in her brassy antics. Although it often pulls its punches, Chick Fight manages to go the distance."}, {"id": 5, "text": "One of those comedies that offering a few laughs with a don't take it seriously message... I actually enjoyed this movie over many supposedly good comedies... So don't listen to the nay sayers... Instead... Use your head ..."}, {"id": 6, "text": "Anna Wynncomb (Malin Akerman ) is the owner of a failing coffee shop. (Filmed in San Juan). She is depressed after it burns down. Her policewoman friend (Dulcé Sloan) takes her to an underground fight club for women. Anna finds out her mom had fought there. Circumstances causes her to have to fight Bella Thorne is 2 months and Alec Baldwin is her trainer between drinks. Bella can fight three girls at one time. Fortune Feimster made me laugh.This is a comedy of fairly stock humor. A few lines made me laugh. There was a lot of sexual humor.Guide: F-word. No sex or nudity."}, {"id": 7, "text": "No one is going to ever call this one a classic, but it was cute and entertaining enough. Plenty of cliches to go around, but it had a decent heart. Solid actors and a decent script."}, {"id": 8, "text": "In a couple words: entertaining, predictable storyline (what fear does to you, it makes you give up before fighting); quality acting, some funny but also a lot shameless, dirty, vulgar lines; good fighting scenes (excellent bloody slo-mos); decent soundtrack. It is what it is: a good entertaining movie!"}, {"id": 9, "text": "Lord this one is bad, was it supposed to be funny? The trailer was more exciting than the movie. Predictable to a fault and poorly acted. Completely under utilized Fortune Feimster. If I could give a lower rating than 1, I would."}, {"id": 10, "text": "OK I've just watched it and it's a simple feel good little story with a few good laughs, if you want a deep serious film, this ain't it, if you are prepared to check your brain at the door it's a bit of light fun entertainment, I was actually surprised to find I enjoyed it more than I thought I'd do, so my advice to you is take it for a spin and see what you think."}, {"id": 11, "text": "Hilarious movie. Must watch. Or not. Don't take my word on it."}, {"id": 12, "text": "I was surprised by the low ratings and reviews, but I was keen to watch it. And I'm glad I did. Yes it may be predictable and a little bit familiar if your a movie buff. But it is certainly worth viewing. If your up for a fun spin on fight club, totally do it."}, {"id": 13, "text": "I'm glad I didn't listen to the reviews who said this movie was not funny and a waste of time, because I really enjoyed watching it. Sure it's an absolutely unrealistic story, and a lot of the actors are definitely not best actor/actress material,but it's a hilariously fun watch. Oh and BTW on the subject of best actor/actress, I had a total ball watching this compared to some previous best picture movies."}, {"id": 14, "text": "Don't let the reviews fool you , watch it for yourself , it's a funny movie."}, {"id": 15, "text": "We get it, Hollywood and some viewers feel that certain character's genders or races are unrepresented. They do not ALL have to be in one film though. At it's core, I feel that this had a decent story to tell and from a unique perspective. It all was cluttered in too much WOKEfulness though and not in a subtle or thought-provoking way. The writers just hit you over the head with it, repeatedly.Final thought, this tries to be an empowering film, but too much going on in the sideshows to develop characters and keep the story progressing to a conclusion."}, {"id": 16, "text": "As far as entertainment goes, it's that at a basic level. It's not intended to be an award winning movie by a long shot. Lots of pop references which are a tad funny and it's shameless, brainless good fun. Don't expect to be wowed"}, {"id": 17, "text": "I just love Bella throne ...she is gorgeous ...and about movie ,it is a much predictable movie ...a person with failure made a better life with his hard work .... Story is okay but not brilliant....I enjoyed it because it has some amazing comedy stuffs and my fav Bella throne ..love from India"}, {"id": 18, "text": "Turned it off faster than any movie before. No need to review. Don't watch. No acting, no script. How is this even on the screen????????? Honestly."}, {"id": 19, "text": "Alec Baldwin a fight coach ........ What else is on ?"}, {"id": 20, "text": "This was entertaining. high quality actors and production. There could have been more fight scenes, but all in all its fun movie"}, {"id": 21, "text": "Other hand-wringers here reviewed this movie negatively because of its violence. But that was the point of this film, and it mocks itself even as it promotes fighting. No it isn't a remake of fight club, nor is it trying to be. It's a humorous film about being a grown up and the frustrations of real life. Millennials just won't get it."}, {"id": 22, "text": "I mean it's definitely not the greatest movie of all time. However it was not bad at all. It served the purpose of being funny.Acting wasn't the best from some of the cast. The story was kind of silly yet fun to watch.Overall; stop being so damn negative. I bet all the low reviews are from depressed people who don't want to laugh at anything."}, {"id": 23, "text": "I loved it!!! It's not for sexists, prejudiced people No wonder that a bunch of guys didn't liked it! So just ignore the bad reviews! It's supposed to be entertaining and fun, the movie achieved that!"}, {"id": 24, "text": "Me, one: how are people keep confusing it with a good idea to hire Bella Thorn for their movie?"}, {"id": 25, "text": "I liked this movie. I would have scored it higher if it wasn't for Kevin Connelly stinking up the joint. Gawd this guy can't act. Malin is so hot with her Swedish teal eyed good looks, she needs a hot guy to play opposite. It didn't work on Entourage for a threesome with Sloane, its not gonna work now. He is a ginger garden gnome that scares himself looking in the mirror."}, {"id": 26, "text": "If you thought 'The Room' was the worst acted, worst plot line, worst movie ever this movie might just change your mind"}, {"id": 27, "text": "We rented this movie expecting more than a few laughs. Alec Baldwin and Fortune Feimster were responsible for the handful of laughs in this unfortunate waste of time. I'm only writing a review because I wish someone would be warned us ahead of time."}, {"id": 28, "text": "This had alot of potential to be a top tier movie i get the message of women empowerment but lacks in production for example i dont really believe Dulcé Solan's betrayal of the character it would of worked so much better if Tiffany haddish played the character think this would of made the film so much better"}, {"id": 29, "text": "Chick Fight i just watched but did not catch everything a my eyes were flooded with tears of laughter and my belly hurt form laugh cramps and rib ache. The story is really catching Chick Fight is simply fantastic Its a fun filled story packed with that old school slapstick comedy mixed with some great acting and good fun. 10/10"}, {"id": 30, "text": "Not sure why some of them gave a low ratings. Good production, some funny lines . Great acting from Malin and Dulcé Sloan. Dulcé Sloan is funny. I enjoyed her acting! Its an entertaining movie and thats all that matters. ."}, {"id": 31, "text": "Average movie but I'll rate it a 10/10 because of bella. Love her even on her disney channel days. She is what drew me to this movie otherwise I wouldn't care for it. She played her character really nice, someone I wouldn't personally want to mess with. Bella kicked ass in the movie both literally and figuratively. This kind of movie rare that shows strong women who are fighters. We need more movies that show women in this kind of light. I'm here for it"}, {"id": 32, "text": "I'm not sure what the audience is, I don't think they planned that far ahead.The director just convinced a production company to make this, found some poorly written script from a 1st time writer that looked good. Found some actors who are willing to do anything in a pandemic for work. Throw it all together and hopefully things will work out."}, {"id": 33, "text": "There is a lot wrong with this film that could have been easily fixed... The fight choreography was amateur level, it would have been better to give the girls mouth-guards and just let them slug it out naturally. Alec Baldwin's talent was under-utilized, he should have had a larger role in Anna's (Malin Akerman) life akin to Mr. Miyagi as was even joked about. This would have allowed for better arcs for the main characters. Some more of the limited budget should have been spent on more experienced comedic writing... So many missed opportunities. Just too much effort spent trying to include everyone in the playground, that leaves the whole story looking disjointed, like a Victoria's Secret sponsored Pride event that degenerated into a bar brawl. It's a good premise that had potential, it was well shot, and most of the cast makes an effort. There are even a few slap-stick moments that might elicit a chuckle but in the end a different movie would have been a better movie. Save this one for when you run out of good ones."}, {"id": 34, "text": "Movies like this is why the world keeps getting dumber. I lost brain cells watching this."}, {"id": 35, "text": "It's definitely better that I expected, Malin Akerman was good but Bella Thorne was great, bad b**ch vibes and obsessed with the slow mo scenes, would definitely only recommend for girlies but I watched the movie with guys and they thought the fight scenes will great!"}, {"id": 36, "text": "It was a complete waste of time, idk how it's possible to make such a terrible movie but then i remembered hollywood's potential to make garbage and peddle it as entertainment."}, {"id": 37, "text": "This movie is OK, mainly do to the fight scenes. You can tell they actually spent time with the fight choreography. The fights are pretty well done,. You can also see that they cast and used real female athletes. Bella Thorne even looked good in her fights (or her stunt double). Some folks may hate this film simply for Bella Thorne, I like her, can't knock her for playing the system. Everything else is just below average."}, {"id": 38, "text": "I'm not sure if this was a real movie of just a spoof. It was a disaster either way."}, {"id": 39, "text": "I'm not entirely sure how this movie got made. I don't know how they got these actors to sign on. They must've been severely overpaid. The script is full and unfunny. The lowest common denominator humor imaginable. May have been written by AI. Sets back women's fighting a decade."}, {"id": 40, "text": "It's just predictable all the way thru to the point it is boring. I kind of figured the protagonist would win-I get that, but the dialogue was mundane too. It feels like they wrote nothing of substance for some of the main characters and expected them to riff great lines. It just didn't happen here. Baldwin may be the biggest disappointment. I'd expect more from a drunk coach in the perfect opportunity for one-line zingers. He had nothing."}, {"id": 41, "text": "This is so bad on so many levels, that they actually invented new levels to stink up.If you aren't going to watch just one movie this year, this is the one to skip.Movies like this are hurting America (and the rest of the world). The big picture here is that violence in the answer, although to what isn't clear at all. The biggest sin is that this just isn't funny, not at all. They obviously wrote this using the new MS screenwriting program which allows you to choose clichés from a drop-down window1- Sassy, Black, grammatically-challenged woman who is morbidly obese but strong and violent.2- Gay couple. This is an absolute must-have for any movie these days.3- Vulgarity used as if it were a synonym of humor.4- Someone has to have an English or Australian accent. It's a new rule.Seriously, I want to know how such a complete piece of garbage was rolled out of a real studio. Did someone get paid to write this? They should try paying someone instead of just asking for volunteer writers or unpaid interns."}, {"id": 42, "text": "One time watch at best. Production quality is good. Fight scenes are BAD, you have people waiting to be hit like they use to do in 80's &amp; 90's movies. This is magnified when they use slowmo, you have a fighter standing there with their arms down just waiting to be hit.This feels like a feminism overcorrection movie with a side of racial overcorrection. This seems to be all the rage at the moment in hollywood, people feeling guilted into choosing these loosely entertaining ideas and hiring people based purely on the colour of their skin, gender or sexual orientation rather than the merits of their hard work or suitability for the job.I feel as though the budget and talent in this film could have been used in a better way to make a movie that wouldn't collect such review as Don't even bother watching. Bad stuff aside, movies as entertainment, it was reasonably entertaining but the lack of original thought left me thinking it could have been more."}, {"id": 43, "text": "So I watched this turd, thinking some hot chicks fighting. It maybe so good it's bad.....NOPE!It was bad from the beginning to the end. The jokes were not funny. Usually in terrible comedies, you can laugh at 1 maybe 2 jokes, but in this movie I did not laugh or smile once.It's about a female fight club. I figured it was going to be an anti-man movie, it wasn't even that. In fact I am not sure why they fight other than work is hard.This was an awful movie, lacking sex appeal. Despite having some gorgeous women and a few beasts of a women. Nothing was eye candy nor entertaining. No great romance or even point to the story. It's an aimless piece of horse manure.I give this a generous 2 out of 10."}, {"id": 44, "text": "I'm gonna be totally honest in this review. I had fun with the movie, i did. I think both the lead actress (Malin Akerman) and Bella Thorne did a great job in their role. I don't think either of them are martial artist yet the fights did look convincing and were fun to watch. Part of the comedy is good, and some of the message is also nice, but the problem is this movie try to litteraly go for a tsunami of Social Justice.First of all the sidekick character, the cop, she is SO annoying. I really couldn't stand her at times. And honestly, no way a person this obese could be a cop. Secondly, the dad played by Kevin Nash. I like Kevin Nash, both from my childhood in Wrestling and even as an actor in small roles here and there. But here his character serve no purpose at all in the movie beside an sjw message and some terrible attempt at comedy.But despite those flaws, like i said i had fun with the movie. I just wish they didn't tried to cram so much social justice in it, because it does hurt the movie."}, {"id": 45, "text": "Here's the first fail of this movie. It's R-Rated and never once, delivered on it's R-Rated promise. I would think a comedy based around the notion of an all female fight club and starring the comedic talents of Dulce Sloan and Fortune Fiemster, two very well known and talented comediennes would be an over the top, rollercoaster ride of ridiculousness. Instead Chick Fight feels like it's afraid to throw that knockout punch needed to make a movie such as this one memorable. If there is anything worth praising here, is the fight scenes. While way too short, they were well choreographed and I appreciated that. I did laugh a few times as well. Seeing one of my favorite old school wrestlers turned actor, Kevin Nash play way against type was not only fun, but surprisingly well executed. Bella Thorne has proven to me there isn't much she can't handle and as a young actress, I see big things in her future. Sadly Malin Akerman is overshadowed by almost everyone else in this movie and I think she was terribly miscast as the lead. I hate having to go all negative on a movie like this one. We need more female positive movies out there, that show women are capable of so much more than just finding a man (sadly they do stick that in here as well) and with a stronger lead actress, better comedy and slicker editing, this could've been Hangover meets Fight Club for the female demographic. I don't even need the ten count, Chick Fight hits the mat and never gets up again."}], "reviews_amount": 46}