{"name": "Safety", "titleId": "tt10649016", "reviews": [{"id": 0, "text": "Safety is the sort of movie one would expect from Disney: a rousing, heartwarming, family-friendly story dramatized for the Big Screen (or now, for streaming). But the film is not shot with flair, the jumps in logic are obvious and distracting, and aside from the commendable character development, the film felt rather flat and thinly plotted.Safety is a safe holiday film for the whole family. But beyond that, there is nothing here that remotely resembles a touch down."}, {"id": 1, "text": "It's pathetic that the rating is being dragged down by jealous gamecock-loving, Clemson haters. Their only weapon; a 1 star. That's the case with movie ratings and football players."}, {"id": 2, "text": "Apparently based on true events and a great story about a young man taking on tremendous responsibility while in college. Great story about how the community surrounded him with love and helped him move forward. Well worth watching with your family. Very positive images of young black men!!!"}, {"id": 3, "text": "After all the great PR and positive press, Clemson dropped his scholarship after he switched positions to RB and tore his ACL. They left him high and dry, injured, with a wave goodbye, and a good luck, we'll help you with future endeavors. Google his name and scholarship and you'll see."}, {"id": 4, "text": "Standard feel-good movie. Absolutely nothing interesting or unique about it. Might be good for kids under 7 or 8 but anyone with even the slightest bit of refined taste in filmmaking and story-telling will spit this one out by halftime."}, {"id": 5, "text": "This is just sad. This movie is just a poor man's Remember the Titans. Just look at the actual critic reviews and that will tell you all you need to know. If you aren't a clemson fan, don't waste your time."}, {"id": 6, "text": "Disney fails to tell the full of story of Ray Ray's time at Clemson and seems to be more concentrated in filling your screen with vomit orange instead. What Clemson did to Ray Ray is one of the bigger travesties in college football where they decided to pull his scholarship when he tore his ACL because they moved him to offense. This all after he brought them national attention. Also, overall, is just a sad attempt to try and create another Rudy movie."}, {"id": 7, "text": "I remember when the story of Ray and his brother became national news. Even back in 2006 I thought this story would make a great movie (it certainly wouldn't be any worse than Rudy). As a HUGE Clemson fan, I was so psyched when I heard that a film was actually being made. Sure, it has your typical sports movie schmaltz... a la Remember the Titans, but, again, being a Clemson fan, I loved it from start to finish. I'm sure that many South Carolina Lamecock fans will rate it very low, but don't listen to the haters and decide for yourself. Now I guess I know how Norte Dame fans felt about Rudy. Perhaps the movie is terrible, but seeing it through rose colored glasses due to my passion for my beloved Tigers, it's awesome!!"}, {"id": 8, "text": "A great Good Feeling movies to watch with the kids me and my son loved it"}, {"id": 9, "text": "I had average expectations for watching this movie as Disney has been historically below average when it comes to sports movies, but I was very surprised at how bad this film was. Weak story line, worse acting and horrendous attempt at a decent football movie. I can think of 20 better sports movies made with half the budget. I regret watching it and allowing my family waste their time on it as well. Maybe next time Disney."}, {"id": 10, "text": "My daughters and I love this movie. It was little fake at times. But overall this was a typical Disney movie. Can't go wrong right now with a feel good story. 🏈💨"}, {"id": 11, "text": "Hard to imagine, Disney, with such a reputation for quality entertainment, would put their name behind such tripe and blah blah blah of a film. Apparently we are in the age of telling these people anything they do is great and should be put on the fridge. Glad to stop visiting Disney if this is the sheer crap they are going to stand behind."}, {"id": 12, "text": "I bet it felt real good when they cut him and took his scholarship the next year after he got hurt. A supremely basic movie that glosses over reality with filler and ends up coming across as a two hour Clemson propaganda piece. Shameful."}, {"id": 13, "text": "Just awful movie. Doesn't help seeing the orange and purple the whole time either"}, {"id": 14, "text": "You're gonna see a lot of 10 star reviews. They are all Clemson fans. This movie was boring, predictable, and a little off key. It's a money grab taking advantage of a young man. I would give it zero. I cried because I'll never get the time back."}, {"id": 15, "text": "Church money wasn't being distributed throughout the program to the players then like it is now or Ray could have supported his little brother more easily. As it was he still received thousands of dollars of donations to help raise his brother."}, {"id": 16, "text": "Very inspiring story about family. Disney did a great job capturing this story and telling it in an entertaining and inspiring way."}, {"id": 17, "text": "It's formulaic. The acting is more than subpar for a flick with a budget this size. The script is a collection of predictable one-liners and faux-motional conversations. The soundtrack and wardrobe are anachronistic- more 1998-2002 than 2006. There is much unexplored opportunity for depth, depth that would have made this movie something really lovely. Unfortunately, the far-reaching, nuanced, and layered effects of poverty and addiction go almost entirely ignored.The story, however, is so good that you kinda don't care... I mean, you do, but you watch it anyway, and you're not mad you did.The actor who plays Fahmar is probably the best actor in the movie. He's a funny kid with good timing."}, {"id": 18, "text": "Love the look and feel of the movie. Perfect CC and well scripted.. A+ from me"}, {"id": 19, "text": "I like movies based on real people so I was looking forward to this one. While it had potential, it never really lived up to it. Somehow it never grabbed you like other movies of this type. Look to movies like Rudy, Invincible, Remember the Titans. We Are Marshall. Greater and others before watching this one. Perhaps the writers and directors should have watched them too."}, {"id": 20, "text": "I loved this movie! I was able to relate to it and gain something from it. Whoever said it's fake should know that this is most definitely a true story. This movie deserves more positive reviews. Some of y'all like it because y'all can't relate. This is many peoples situations now a days and he brought it to life."}, {"id": 21, "text": "It certainly has a heart warming story and if you are a fan of sport movies you would be satisfied. But the problem is the acting and in some cases directorial problems. You can not see the power of emotion in most of scenes and sometimes the actors are able to glare at each other. The lead mumble and stumble in his encounter with the female lead and doesn't produce a believable act. Although the straight forward way of story telling and cutting the unnecessary drama and detail was a risk that worked out well in the tone of the movie."}, {"id": 22, "text": "I recommend this to all football fans and families."}, {"id": 23, "text": "You have to be incredibly cynical to not love and appreciate the story behind this movie. So many positive role models to learn from. I hope Disney makes more like this -- great for the whole family."}, {"id": 24, "text": "Much needed positive film that ends 2020 on a positive note."}, {"id": 25, "text": "Wow! I had heard small pieces of this story but this makes me that much more proud to be a Tiger!"}, {"id": 26, "text": "Great story of how a young man looks out for his family."}, {"id": 27, "text": "I watched this film yesterday, and it almost broke down &amp; cried. That man taking so much time off for his brother, that means that his heart is bigger than any football players I've heard. Plus this film is NOT AT ALL likeRemember The Titans. I was reading more about Safety &amp; finding out that this was more than just football. Ray-Ray went the distences for his family (including his teammates as well). Re-watch this film &amp;you will really understand of how much one young man can go farther than just school &amp; football. I respect Ray McElrathbey."}, {"id": 28, "text": "A good family movie ! Definitely recommend watching !"}, {"id": 29, "text": "Nothing but Clemson propaganda. Don't waste your time."}, {"id": 30, "text": "Not sure why there's so much hate for the movie other than maybe sour grapes from opposing fan bases to clemson. Other than FAU I don't think any other teams were mentioned really at all... even then nothing negative.Don't think this has the same lasting impact as a movie like RUDY but it's also a completely different story altogether. It did seem a lot of creative license was taken in A LOT of the subplots/characters but again, it was still heartwarming.Brought a smile to my face and was a welcome relief to the stress the world is in currently"}, {"id": 31, "text": "So it's a true story, Oprah validates it at the end, and you won't find fault with any acting or craftsmanship involved in this film. But it's also oh so painfully predictable - regardless of fact or fiction - and it just detracts from making this a really good film. Too Disneyfied? If you had to rewatch either Safety or Remember the Titans from the Disney football library, which one would you choose?Regardless, Messrs Reeves &amp; Mixson are good and pleasant to watch, Mr Sansone has a really great voice, and Ms Foxx is surprisingly electric - right up until the NCAA hearing scene, when her wardrobe just didn't make sense. Okay, my subjective #firstworldproblems. The bottom line is during this particular era, when we're streaming everything in sight, there are probably worse ways to spend two hours. Chill &amp; enjoy."}, {"id": 32, "text": "Great movie for a Sunday afternoon with the family!"}, {"id": 33, "text": "The whole family loved it. I thought it showed the struggles of a very good athlete having to balance between the game he loved and the brother he loved."}, {"id": 34, "text": "Great film with a different perspective of college athletes, their families, and their Clemson University. Most people's view of the college athlete is the view of the 10% that are the stars. But all honesty the student athlete in most cases is facing a multitude of challenges. Some played out in Safety. Proud of Ray Ray, Fa and their family as well as players along the way: Gaines Adams RIP that would buy Fa school supplies and others. Dabo understood Ray Rays situation and lived something similar himself. Proud of The Clemson family and a great film! Love the game film and that great crowd for filming. Your family will enjoy this one!"}, {"id": 35, "text": "Love this movie. Such a touching great true story. It makes me proud to be a Tiger fan. Go Tigers"}, {"id": 36, "text": "This movie was a wonderful family movie based on an inspiring true story, and it perfectly showcased how no matter what- at Clemson you are part of the Clemson family. While some parts were a little cheesy (what heartwarming Disney movie isn't?), it was still done really well! Had some really funny parts we enjoyed too. Overall a great football movie. I loved this movie, I definitely recommend it!"}, {"id": 37, "text": "This movie is great. Beautiful actually. Funny, happy, sad... victorious... all the feels. It kept the attention of an 11 year old and two 7 year old boys as well as myself and husband. It's great to have a solid family movie with pretty good acting too! It's definitely worth watching."}, {"id": 38, "text": "Really good story with the happy ending you don't always get with something based in reality. Really shows the courage of convictions, with an athlete at the highest level willing to put his dreams at risk in order to provide for his younger brother and give him a better life. Such a selfless act and it was good to see everything work out for him in the end, despite the obstacles."}, {"id": 39, "text": "My family and I thoroughly enjoyed this movie. It won't be winning any awards, and no one will ever talk about it as a classic, but for feel-good family entertainment - something that is in seriously short supply these days - it's a great movie. I did some research into the true story and the movie is surprisingly true to all the main points. While this is obviously filmed at and about Clemson, it is NOT a Clemson movie. It's a family movie, and in this case, the family is a football team that happens to be at Clemson. If you're a 28yo who is looking for a great sports movie, you'll probably want to pass. If you're a parent looking for a great movie for your family, or you just want a feel-good positive movie during these crazy times, then this is a must-watch."}, {"id": 40, "text": "The acting started off a bit shaky but, when that little man, Thaddeus showed up, he showed up. He made me lose sight of the distractions (ex, game footage and film not fully jiving) and sucked me in to the story. Also, Ms. Amanda Warren was ridiculous. The chemistry between her and her sons was moving, relatable, and believable. So, in short, if you can get pass the minuscule casualties of poor filming (there really isn't that many), then you will enjoy this story of family, love, and hope."}, {"id": 41, "text": "I loved that the focus of the film was on the family relationship."}, {"id": 42, "text": "This was a very well done and inspiring story. Great for the whole family!!"}, {"id": 43, "text": "This was a classic feel good and tells a fantastic story of perseverance and the value of family!"}, {"id": 44, "text": "Very surprised by this movie. Well worth the watch."}, {"id": 45, "text": "Ray-Ray McElrathbey (Jay Reeves) is a man with a bright future. He is a gifted athlete who has accepted a Football scholarship to Clemson and is about to take the first steps towards a better future. In the new Disney + film Safety Ray-Ray is about to learn how complicated life as a student athlete can be.Based on a true story; Ray-Ray struggles with adapting to the more complex defensive schemes, Freshman hazing, class and practice schedules, and adjusting to his new life. His roommate and teammate Daniel (Hunter Sansone); offers him frequent support as being a low on the depth-chart kicker has taught him a perspective on things.Ray-Ray meets a lady named Kaycee (Corinne Foxx) and sees his life on campus start to improve until life steps in to further complicate things. His young brother Fahmarr (Thaddeus J. Mixson); has been removed from the care of his mother due to her numerous substance issues. With only his gangster relative available; Ray-Ray agrees to care for his brother rather than turn him over to the Foster systems. Unfortunately for Ray-Ray; having his brother in the dorm with him is a strict violation and his continued care of his brother and the complications it causes threaten his scholarship and very future.The film is a very touching and engaging look at the extent a person is willing to go to care for a family member and how the politics of college sports often conflict with what appear to be sensible and worthy actions by players and coaches.The film does not go overboard with game sequences and there is no big game moment as the focus is on the characters and their relationships. Safety is one of the more pleasant surprises of the year and one not to miss.4 stars out of 5"}, {"id": 46, "text": "Watched Safety with Jay Reeves (Listen) as Ray Mcelrathbey, Thaddeus J.Stevens(The Grind) as Fahmarr Mcelrathbey, Corrine Foxx(47 Meters Down Unchained) as Kaycee Stone, James Badge Dale(Iron Man 3) as Coach Simmons, Miles Burris(Code Black) as Keller Hunter Sansone(Swat) as Daniel Morreli And Matthew Glave(Argo ) as Head Coach Tommy Bowden .I Really Enjoyed This film in sports movies although predictable we are given positional perspectives as well there life outside the field this was a great example of it Ray balancing his life as a Student-Athlete for Current National Champions Clemson Tigers Football Program while trying to be a caretaker for his brother which lead to great to moments of Comedy as well as drama i really enjoyed how everyone rallied around to my fellow football or sports fans don't expect The Big Game trope most of the Football action happens in practice and also that moment is against FAU but it isn't climax which it isn't a bad thing also it was great to see a perspective of a student-athlete who cant escape his upbringing it was a fresh perspective on social issues which hasn't been explored in depth like this also showing we can overcome anything. . Great Music By Marcus Miller(Marshall ), Cinematography By Shane Hurlbut(Terminator Salvation) , Direction By Reginald Hudlin(Django Unchained) An Interesting Perspective of A Student-Athlete Balancing Sports and Being A Caretaker 8/10"}, {"id": 47, "text": "Ray-Ray McElrathbey is a freshman scholarship football player for Clemson University. He's a first year safety. School and football is overwhelming but they don't compare to his home. His mother is in jail. His younger brother Fahmarr is abandoned at home. With her going to rehab, Ray-Ray decides to hide Fahmarr on campus instead of leaving him in the foster system.This is a true story which got some media play including Oprah. It's a sports bio inspirational story. It is too easy to say that this is too safe. It is too long at two hours. This type of movies needs to be ninety minutes or so. It feels its extra length. The film needs to snip out extra seconds everywhere in the movie. First, it needs to be compressed for a simpler reason. It needs to get Fahmarr on the screen much sooner. The brothers' relationship is the heart and soul of this movie. It needs to bring that out as quickly as possible. They need to interact and build that chemistry. As for the two actors, they're fine especially for lesser known actors. They are able to build that chemistry over time. They have some great moments like the North-South scene. The movie needs to zero in on that like a laser beam. The other stuff often feels like overloading on Ray-Ray's back. If the movie wants to end with the NCAA stuff, it needs to be set up with some better foreshadowing. I know that I advocated for cutting out the fat but the movie could start with his recruitment. It would show his mother's condition, the brothers' relationship, and the NCAA restrictions all in one scene. In the end, just cut out about thirty minutes and this would be better."}], "reviews_amount": 48}