{"name": "Scare Me", "titleId": "tt10126434", "reviews": [{"id": 0, "text": "I feel like this movie isn't getting great reviews because it's not full of jump scares and gore but that's what makes it great. I love comedy horror due to the fact that it's not to be taken seriously and it's lighthearted while still carrying that element of spooky. Give it a watch!"}, {"id": 1, "text": "This is a movie about storytelling. Not a horror movie as much as a movie about telling a scary story. I found it pretty brilliant and funny. Like a lesson in the craft of telling a good story. It has an improv vibe and does a lot with one location and for the most part, two actors. Chris Redd is not in it as much as I would like but his appearance is a lot of fun. Worth watching, but not what you expect."}, {"id": 2, "text": "The whole movie you sort of just sit there, waiting for it to start. Then it drags on for an hour too long and suddenly it's over, leaving you wondering why the heck you didn't read some reviews first before wasting time on it.Cast is okay. Camera work is passable. But the story is just... absolutely terrible."}, {"id": 3, "text": "The only positive thing about Scare me is the Acting is great other that the film was so boring it's went for way to long It didn't scare me nor make me laugh once the plot twist was so late in the film that it wasn't effective.overall it wasn't a good horror comedy"}, {"id": 4, "text": "I've spent my entire life wanting somebody to tell scary stories with me by a fireplace during a power outage with pizza, beer, and cocaine. This movie made it happen and for that I am forever in its debt. The actors are perfect, the sound effects had an old-timey radio days feel to them (which I loved), and the whole little red riding hood game within a game was creepy af,just like in real life. Everyone who did the work making this film happen should be proud of themselves, and I wanna congratulate the actor/director/writer on his courage to subvert expectations. Keep it up, I guess. And hey, the Guardian liked it."}, {"id": 5, "text": "I like Aya Cash but not in this, her talents are wasted. Chris Redd was brilliant for comedy relief he should've been introduced in sooner. The idea is great, but this doesn't fall under horror more like student indie movie with no budget."}, {"id": 6, "text": "If you wanted an anthology of people telling scary stories you will be sorely disappointed. If you wanted any scares you'll be disappointed. It is literally 2 people TALKING about scary stories the entire time. Yup. Virtually no blood, no jump scares, no anything. I loved the cast and loved the set up but the payoff and entire run time is incredibly disappointing."}, {"id": 7, "text": "This was a really pleasant surprise. A horror comedy that had me grinning from ear to ear until I was legit creeped out. It's just about people trying to scare each other with scary stories in a cabin but the writing, acting and visual tricks from a writer/director/actor who absolutely knows their horror movies make this a really good time."}, {"id": 8, "text": "Shudder please stop with this crap. What an utter waste of time. If I want to watch improv I can, but this really isn't a movie. The woman is great, buts it's not horror it's drama wannabe comedy improv. You're demeaning your brand putting this crap on your app."}, {"id": 9, "text": "Not sure why there are ratings of ten and not sure why there are ratings of one as it deserves neither. I really enjoyed this film, it's not really a horror (although there's a jump or two) but it is funny, it is engaging and the acting is top notch. If you're not totally dead inside, like some of these reviewers, then in sure you enjoy it."}, {"id": 10, "text": "Spoiler AlertNot sure who at Shudder green lit this terrible waste of 2 hours they call a movie. It was boring as boring gets. 2 hours of watching 2 ding dongs tell non-scary stories. Absolute waste of time. If Shudder continues putting out bad originals like this I will definitely be cancelling."}, {"id": 11, "text": "Scare Me is probably going to end up fighting it out with the Black Christmas remake for the title of worst film, in any genre, I have seen this year. Which, considering the competition includes The Room, is quite some achievement. Well done, Mr. Ruben. You must get up very early.How can I summarize this cinematic treat? Imagine an hour and 40 minutes of improv, put on by the freshman class of the gender studies course at your local community college, and directed by a guy who has seen The Shining way too often. Now imagine something less entertaining than that. If you wanted to get a federal law passed to stop people from writing, directing and starring in the same movie, this film would be Exhibit A."}, {"id": 12, "text": "Scare me tries to be many things at the same time - a Twilight Zone episode, a teenager slasher movie, an anticipation horror and unfortunately goes far from hitting the mark.Some of the horror and slasher movie convention tropes (which, by this point have become memes ) are subverted and some aren't.The trouble is with the plot which can't decide what exactly it wants to be and by the decision point, it gets hit with a big wooden piece of dream logic straight on its barely-coherent head.Dream logic works fine in the Twilight Zone or a claustrophobic survival or loneliness-focused horror, and doesn't work well at all in all the other genres that the directors tried to put in there.Add some overacting and stereotype-jumping on the part of the main protagonists, as well as on the part of the mini-stories ones and we have this movie.Not bad, not terrible, not memeable.5.3 roentgen out of 10 cabins in the woods."}, {"id": 13, "text": "First of all, horror, barely. The female lead was a rude, annoying a&amp;&amp; of a person. Then, midway through they invite the pizza guy into the bore fest. Why?! I guess to gas up the female lead... I guess. Thankfully he didn't stay long.This movie was like watching something when you're high or drunk, like they slipped me acid before viewing... really.I only watched to the end, hoping it would finally turn into a real horror movie where the male lead kills the female lead in a homicidal rage to protect the world from her rude, no it all, boring storytelling a&amp;&amp;! That would've at least somewhat made up for the other 100 ridiculous minutes of drivel they called a horror movie. I gave it three stars because he tried but didn't succeed in the end."}, {"id": 14, "text": "I summed up my review in these above mentioned words. Seriously what were the makers, if there were any thinking of this junk. Let me guess they had a camera, a location and some really bad actors at their disposal so lets make a movie. I don't believe Shudder actually produced this nonsense. Not funny, no story , avoid at all costs even if it's free avoid it. We don't need movies like these ,this will ruin the name of horror, slashers or any genre ever in cinema."}, {"id": 15, "text": "I don't understand where the 1 star ratings come from, and people saying after five minutes they turn it off, it's not the movie that's the problem, it's the people with short attention spans that expect a movie to climax after 5 minutes. That's the day and age though I guess.For me, I chose the movie at random, was pleasantly surprised and the acting was amazing.If like me you watch movies before reading any sort of review then carry on, if you come to the reviews first, DON'T. Watch the movie yourself first and make your own decision."}, {"id": 16, "text": "Oh my. This film shattered all my expectations. Go in with an open mind and enjoy the ride. 10/10 will watch again."}, {"id": 17, "text": "This movie may lack in the story department but it's extremely well acted and really fun. The three characters are great and hilarious! Well done all involved!"}, {"id": 18, "text": "The 2 annoying leads distracted from the experience. Forced and brash, unlikeable as could be."}, {"id": 19, "text": "This movie is great, I put it in the category of intellectual horror because you either get it or you don't. Loved it!"}, {"id": 20, "text": "This is not a horror film so if it's scares, gore and jumps you want pick something else. However, it is a great story which is kept interesting by great acting. It is a film about writing horror stories. I really liked it. It had humour and depth."}, {"id": 21, "text": "Starts slow then builds then builds more it gets fun and exciting then it goes insane and campy and then it takes a left turn and ends with what I'm assuming they they thought would be an ironic twist. The amazing build to the insane campy and creepy third act had so many better options for ending. But definitely a need to see for fans of horror, especially if you grew up in the 80s / 90s. Also Aya Cash is awesome in this"}, {"id": 22, "text": "This movie should have been listed as a horror comedy, although it was lacking in both."}, {"id": 23, "text": "So this movie is nearly TWO HOURS long. It doesnt get exciting until literally the last 5 mimutes of the movie and then its over. I gave 4 stars because it did make me laugh a few times. Mostly it's cringe humor, though. Spoilers next: The female character is very unlikable. The pizza guy served no purpose to the story at all. Here for 10 minutes of cringe and them gone. No furthering of the plot. I REALLY REALLY REALY wish they would have persued the horror aspect a little more. As they told stories, if we could have seen them come to life from the view of the imagination if the listener as the other told the story. They used this a FEW times with the warewolf claw, the troll eyes, and the door opening. Would have loved to see that way more. It was the only exciting part. Like, when he looks over you really see an old man laying there. Or when the dog comes downstairs to really see that. It made no sense to show us a REAL werewolf claw and the glowing eyes of the troll but nothing else???? Ball dropped big time."}, {"id": 24, "text": "This is one of the best movies I've seen in a long time. The acting is brilliant. The script is fresh and well written. I truly liked where the film takes you in a direction, that isn't the true direction of the film. I think this film rivals anything coming out of Hollywood now..."}, {"id": 25, "text": "I dont know who paid for the 10 out of 10 stars, but they must have paid alot. Please dont waste your time. Find something else or you'll never get that 1 1/2 hour of your life back."}, {"id": 26, "text": "This is a great little movie. Simple premise well executed. Whilst not a traditional horror film it is a great way to spend an hour and a half. The performances are great and the way the characters develop and spark off each other is charming and very well done. Don't expect CGI, buckets of blood or any tired jump scares, just enjoy the storytelling and have a little fun. Those giving it 1 and 2 stars are plainly wanting something this is not, don't listen to them and enjoy."}, {"id": 27, "text": "Not your usual scary, story, anthology, type movie, but it really works. Totally enjoyed it and the acting was second to none!"}, {"id": 28, "text": "Being kind of a cross genre film this won't hit with everyone but those who love not only horror but the creative, silly, fun storytelling and imaginative side of horror will dig this film. This is a very theater driven movie as well as I can see this play on a stage as equally well as it does on screen, single location, mostly monologues and tasteful use of horror tropes. Lots of fun but don't go into it expecting a straight ahead horror or comedy."}, {"id": 29, "text": "I've fallen foul of the films recommended by Shudder before (Confessional, just awful) so was sceptical of this one. However, at under 2 hours long it was a real gem.'Scare Me' has a very small cast, and for the bulk of the film features two writers of varying success telling each other scary stories during a storm. As an aspiring horror writer (a lockdown hobby with no intent to publish) watching these characters conjure monsters and devils with such ease and style was really fun and inspiring.The last 10 or so minutes were is where the film really did get scary. One half of our duo is confronted by the other, that very real and dangerous creature of a man who can't deal with his own mediocrity. It wasn't the ending I quite expected, but it pushed this film from maybe a 7 to a 9 for me."}, {"id": 30, "text": "With its fascinating characters, brilliant performances from its cast, and a well-executed clever concept, 'Scare Me' is able to deliver fresh and compelling thrills to its familiar anthology formula."}, {"id": 31, "text": "This was a great little horror and part comedy at times and when you are sitting at home on lock in it makes it a 10. Acting was good, gore was good, story kept you entertained. I went in thinking B movie crap but it actually turned out pretty well and if you like horror a def watch"}, {"id": 32, "text": "This movie is fun &amp; adorable. The lead/ director is cute as hell. I loved it"}, {"id": 33, "text": "Scare Me is a simple, successful, perfectly performed horror comedy. I'd say 3 parts comedy. 1 part horror."}, {"id": 34, "text": "It's honestly so refreshing not seeing a horror movie that doesn't rely on an unsettling music score, cgi, or torture to try to be entertaining. It's super original with really great acting. I think people who are easily frightened will have an easier time watching this one. It's overall a fun time!"}, {"id": 35, "text": "A lot of other reviews on here dismiss this film as boring or too long, however I actually found it entertaining and I dislike almost everything shudder does. Admittedly, I've had a thing for Aya Cash since the early 2000s, however she's also a very talented actress. This movie is about two writers, one a successful horror novelist, the other an aspiring writer, who meet during a chance getaway to a couple of remote wooden cabins. During a power outage, they decide to entertain themselves by telling scary stories, to the point THEY become the story. There are no actual monsters, zombies, etc...for the most part, this is a comedy. At the end, it becomes more of a psychological thriller. The wannabe writer lays the groundwork the entire film, talking about his failed relationship and all his mental issues. It's really no surprise when he comes unhinged at the end. This script doesn't break any new ground, far from it, but the acting was great and even though it probably could have been a 20min short, I never got bored or felt it was too long. Honestly, it's probably not for everyone, but in my opinion, I thought it was a great way to pass the time."}, {"id": 36, "text": "I loved this movie. Like others said, it drags somewhere in the middle, but it finishes strong. If you're a writer, you may appreciate some of the ideas of the characters. When I was done, I had to rewind to catch some things that I didn't realize before. It's not your typical horror comedy. It's not really scary or creepy at all, and it's more witty than laugh out loud funny. Ultimately, I found it to be a clever and unique movie."}, {"id": 37, "text": "So here's me thinking this was going to be an anthology horror. Two people telling horror stories to each other. Acted out in about five short stories. With a cast of players.Think again. This awful film only has the two actors in it. Actually verbally telling stories. I switched off as fast as I could. Avoid."}, {"id": 38, "text": "I didn't know what to expect going in, but it was really fun and weird!"}, {"id": 39, "text": "Two strangers meet in the middle of nowhere. Both are writers (one published and famous, the other not so much). When the power goes out, famous (Aya Cash) and not-famous (Josh Ruben) play a game of Scare Me. Basically they act out scary stories made up on the spot. Cash is delightful, but all the delight in the world can't save this increasingly hackneyed improv exercise. Ruben also wrote and directed, and that's where the problem lies. It's always difficult for actors who write their own vehicles to edit themselves. So convinced is Ruben of the originality of his concept, he repeats it over and over and over again. It's Groundhog Day, minus any semblance of grace and soul. And groundhogs. There are plenty of stories though. And I do mean plenty. That should be enough to scare anyone, but not in the way the filmmakers intended. Four stars (an extra star for Aya Cash - she deserves way better than this hooey)."}, {"id": 40, "text": "The description of the movie sounded interesting, so I gave it a shot. It was a mistake. Essentially this movie feels like a boring awkward short that got stretched into a movie. The main female character is unlikable, and the main male character is generic, flat, and uninteresting. The scary stories they tell all night are lame. There were scarier stories told on Nickelodeon's Are You Afraid if the Dark. They were like listening to stories from someone's annoying 5 year old. This movie had glimmers of potential occasionally, but nothing ever developed. If you're considering watching it, just be warned this one is a dud."}, {"id": 41, "text": "I REALLY LIKED THE ATMOSPHERE AND SETTING OF THIS FILM. MOST OF THE MOVIE TAKES PLACE IN A SECLUDED CABIN ONE STORMY NIGHT. THE ACTORS REALLY DID AN AMAZIMG JOB. 95% OF THE MOVIE IS FOCUSED ON THE 2 MAIN CHARACTERS TELLING SCARY STORIES. THIS MOVIE IS A SLOW BURNER, BUT THERE'S SOMETHING ABOUT IT I REALLY LIKE. I KNOW I ENJOYED A FILM WHEN I WAKE UP THE NEXT MORNING STILL THINKING ABOUT IT, WELL... IM STILL THINKING ABOUT IT."}, {"id": 42, "text": "Seeing the poster and reading the summary i had very low expectations for this, especially considering the usual quality of shudder productions. The premise of the film is super simple and yet the writing combined with the stellar performances of all (four or five) actors involved in this just totally made my evening. The production quality in general is also surprisingly high. Sure the general plot, especially the ending is nothing super exciting but this movie is just so much FUN to watch! I have no idea how anybody can find this boring. I didn't mind at all that the horror stories here were simply told instead of shown. Quite the contrary actually. That's because they're being told so extremely well and in an interesting way. At times this was more immersive than so many other horror films. With so little innovation or even ambition to be found in most horror movies these days, films like this one should be celebrated!"}, {"id": 43, "text": "This movie was really fun... like it's not really horror per se so that's probably why there are an abundance of bad reviews cos who likes to be disappointed, am I right? The movie is just very entertaining, but then again I am a fool for small-cast claustrophobic movies (that could just as easily be intimate theatre) ever since being mesmerized by the original Sleuth as a child... I really don't understand people saying this was boring and overly long, I was thoroughly amused throughout and to me, it felt like a short run-time. The acting was super quirky and enthralling and I laughed out loud way too many times. From reading the reviews I can see that this movie is not for everyone, but it was certainly 100% my cup of tea!"}, {"id": 44, "text": "Given Scare Me takes place mostly in a small winter cabin, the movie rests squarely on the shoulders of a very small cast. Aya Cash, a recent standout of Amazon's The Boys season 2, is excellent in this tight, compact thriller about two authors (one successful, one struggling) trying to scare each other with impromptu stories. The pizza delivery guy Chris Redd injects welcome humor and energy as he gets roped into the rap battle (with scary stories instead of rap). Decently entertaining but would make a better play on Broadway."}, {"id": 45, "text": "1) 45 minutes into it, you'd be thinking this can't be the whole film, right? There's gotta be some avenue that'll save this 2) But we are greeted by some open mic improv guy being as unappealing and repulsive as he can be. In fact that's the theme: Get 3 characters and give them the likeability of a school bus fire. 3) Shout out the woman who starts this film off well with her funny quips that last an appropriate length (3 minutes). Yeah, length.... Not sure if they've heard of editing, pacing or even audience test scoring. 4) Quit this after 70 minutes after we just had to fast forward to glance if there's any change and ofcourse, there was nothing. Just an endless sea of nauseating theatre antics. 5) There is a self own moment in the neverending dialogue when the girl interrupts the guy (director?) that's not a story that's an idea. You can say that again!"}, {"id": 46, "text": "This is a billed as a comedy horror, if that was really their intention then they went about it the wrong way. It contained horror themes/topics but at no point was it really a horror film, and while it is clearly trying to be funny, it's the kind of post-woke humour that's too smart and socio political to ever make you laugh. And the low brow humour falls flat too, maybe doing coke is fun, but it aint funny as a punchline. It's an interesting premise but it really failed to deliver in any entertaining or enjoyable way."}, {"id": 47, "text": "I see a few negative reviews here and all I can say is that I think they didn't understand what sort of movie this was going to be before they watched it! Even when I read the plot I thought it was going to one of those horror anthology movies consisting of several pre existing horror shirts with an added subplot to connect them all, but it's not one of them at all. It's basically a 3 man (1 woman) character driven play like you would see in the theatre. 3 characters telling scary stories which they are making up on the spot with them acting them out with no actual visuals. It's one of those films that could either be a hit or a tots miss all depending on how good the writing is and the talent, comedy timing and charisma of the actors telling the stories and that's what this movie has in bucket loads! This was such a unique and original movie and I was never bored and finished it wishing for more. I honestly can't wait to see more from Josh Ruben!"}, {"id": 48, "text": "This movie could have been funnier if it was improv, but it was scripted and seemed like a back street improv show. Way too long!!!!"}, {"id": 49, "text": "You came here for chills and thrills did you? None to be had. Tip for writers in general: If you lack soo little imagination and think Hmm I'm trying to write a horror story. What should it be about? *looks around room* It should be about a person trying to write a horror story!!! Just stop. It's not meta, you have no imagination. 2 stars for the actors, they are pretty good (or could be good in a movie that wasn't written and directed by a hack). Supremely boring."}, {"id": 50, "text": "I don't know if it's the dearth of entertainment that makes people rate new releases so highly or what. This movie and the male lead annoyed me by the five minute mark, and the addition of the quippy female protagonist didn't help -- although she was more palatable, albeit grating at points. The premise of two authors challenging each other with the telling of scary tales might be compelling, but the execution in this case is flawed. Boring and pedantic, this movie is like a low-budget episode of Tales From the Darkside or Freddy's Nightmares where 30 minutes of content is stretched out to more than 100 minutes. Maybe some animated sequences ala Creepshow would have made this bearable, but it fails the fundamental needs of storytelling while simultaneously failing to entertain as a movie."}, {"id": 51, "text": "3 stars for originality and great acting...the rest...well...would be great for some high school theatrical production and that's all.Boring,like hell...why anybody would want to listen to people telling stupid scarystories for couple hours???That is not a horror,that is a joke.Definitely ,not recommended!!!"}, {"id": 52, "text": "For a low budget film where nothing really happens, it could have been much worse. However, the I found the 2 main actors and their characters quite annoying more than anything- not funny- nor scary or compelling by any means.Again, just my opinion, but I am very thankful Chris Redd dropped into steal the show for a short time. Made it well worth sitting through the rest xD"}, {"id": 53, "text": "A couple of horror writers in a stormy night trade horror ideas and stories trying to scare each other.A light refreshing take on the Comedy-Horror genre. Somewhere there's a buried gem under all of this rubble in what I feel that could've been executed more nicely and interestingly. The plot is good, the acting is great, the ending is funny but the second act fails to keep the interesting factor across the whole experience.I really admire that the filmmakers force the audience to use their imagination for being entertained instead of drawing the scares for us like any typical horror...Quite challenging and daring try from the filmmakers but appreciated!The directing is good, aids the story telling with limited yet nice effects, the introduction of the pizza guy was a good bore breaker but with the repetitive attitude it didn't succeed to elevate the middle of the movie from falling into the boredom trap. However, Scare Me is considered an intriguing shot and can be moderately enjoyed by many horror fan."}, {"id": 54, "text": "Horror is my favorite genre, but I swear only one out of every hundred films is watchable, and one out of every thousand are good. The rest are evenly split between movies that are so bad you turn them off after five minutes, or movies that are actually on track to be great... then end so terribly it ruins the entire film, and leaves you more angry than anything..This movie is definitely a prime example of that last horror movie type. Aya Cash puts in a stellar performance... really, just top notch... but it can't save this movie. The first 90% of the film it feels like it's building to something, for sure; has its own tempo, its own style. Kinda goofy, but laced through with just enough seriousness you feel there will be some sort of supernatural twist in the end. (Now that I think about it, it felt like a really long episode of Tales From The Crypt or Tales From The Darkside).I don't want to spoil the ending, but the finale is such a complete tone shift it feels like it was added by a different director and crew entirely. And the tropes they lean on for the finale aren't entertaining, aren't funny, and are not he kind of scares you've been primed to expect for the hour-and-a-half leading up to it (or you would have expected going into the film). It's just so...bad.Honestly, if it weren't for Aya Cash's performance, this would have ranked a one or two stars, at best. If the ending had just been more in line with the tone of the movie, it could have been an eight or a nine. But really, don't bother with this one, or if you're too big a fan of Aya Cash at least go into it prepared for an unsatisfying ending."}, {"id": 55, "text": "... the moment they started talking about being writers. You know what those films are like. All too often. But I didn't, mainly because I fancy Aya Cash, and I'm glad I didn't because it steadily grew more ridiculous and more fun.Didn't like the plot very much but that's okay it's only in the last ten minutes plus seeing them all do like, three lines of cocaine each with no way to get more made me super uncomfortable because they'd just spend the next three hours wanting more cocaine which is not a good feeling.But the acting was great and the banter with the little stories, how they were carried out and how the characters performed them made it really worthwhile.Edit: I see a lot of bad reviews, saying like oh, it's like a student film yeah that's what happens when you make a movie under covid, you can't have hundreds of people involved. Others saying baww it's too sjw shut up; it is (or has, as it's not the central theme) a meta commentary ON sjw stuff, it just happens to not be an incel take on it."}, {"id": 56, "text": "Horror comedy almost never gets it right, this film pretty much got it right...except for one part...If someone told me the basis of this film, I'd never have watched it, it just would sound boring... but the cast makes it worth!!It is way more comedy than horror though, I'd say around 70/30 actually.I can honestly say I absolutely HATED Aya Cash in THE BOYS, she didn't fit, &amp; I felt she wasn't talented... but then I saw this &amp; I loved her so much.. she was born for this sorta role! She's sadly always going to be pegged as a comedy girl, like what's his name from American Pie..I enjoyed so much of this really, as I said though one part missed the mark... the ending. It just made NO SENSE... I won't spoil it, but all I'll say is WHY!?!? Why make them think what they did... only to then say ...I won't spoil it... but it was lame to finish it that way. I get that they wanted to go for the twist within a twist thing... but it almost felt like they ran out of script n said wing it!Yes, I also realize one character is suffering from life issues &amp; may have just WANTED that ending... but when it happens? It doesn't seem they were very happy to have it happen... just didn't like that at all.Overall I loved it!!! Ayas AHHH, COMON, SCARE ME MOTHER EFFER! WE'RE BURNIN' MOON LIGHT!!! I was laughing way too much!!"}], "reviews_amount": 57}