{"name": "Kaali Khuhi", "titleId": "tt10235600", "reviews": [{"id": 0, "text": "This aint a horror film, there is nothing scary, absolutely no tension n suspense. The subject of female infanticide n female foeticide which is highly prevalent in my beloved country, especially in the northern regions shud have been dealt seriously rather than trying to make it into a lousy, non scary horror film."}, {"id": 1, "text": "If you don't have a story, don't make a movie. It is as simple as it is."}, {"id": 2, "text": "We understand Netflix wants to create cinema with a message but they need to understand this understand your audience , what could had been a 20 minute short film it was turned into a movie which was utter boring , bad cinematography , bad acting and to top it all a very bad story for the intended message."}, {"id": 3, "text": "Hello all, I wasted another Friday night with this garbage. Netflix movies used to be far better. But now their standards are going way downhill. The message in this movie, if any, is about female infanticide in India. But the direction and story is so bad that half way through you start cursing its producers for wasting their money on this director. Save urself some time and watch something else. This movie is a waste of your time and producer's money."}, {"id": 4, "text": "I felt good watching this movie ....coz I wasted only 2 hours of my life while movie makers wasted many more. There wasn't an option to give a big O zero rating else would have given a zero instead of 1. I mean why would you even make a movie when you have no story at all, just why ? Funny thing is the review submittion mentioned does this review contain spoilers lollzzz there is absolutely nothing going on in this movie , this movie itself is a one big pathetic, worst ever time spoiler."}, {"id": 5, "text": "This is why people goes into depression . Concept was good but everything else was disgusting"}, {"id": 6, "text": "There is no storyline, nothing!! From first to last it's utter garbage."}, {"id": 7, "text": "Set On the backdrop of contemporary rural north India, this endeavour of making an eerrie film with the theme of the rural India's apathy towards girl child, is ofcourse a failed attempt. But, we know Indian or rather Hindi horror genre, where in the recent times, except Tumbbad, none is even watchable. This movie is an exception to that. Despite it's shortcomings it stood through because of the performances, specially the child actors together with a splendid role by Shabana Azmi, and ofcouse the direction and beaitiful cenematography. Whatever the script is, it has been presented fatless, lean manner. Definitely a good watch."}, {"id": 8, "text": "This movie starts out with amazing atmosphere right from the start. The cinematography is stunning. I've watched many horror movies in my life and lately they all seem to be the same thing over and over. I found Kaali Khuhi to be a refreshing take on a haunted tale. Even better to watch a film that has important meaning. The acting was strong especially from young actress Riva Arora. She has a bright future ahead of her. I don't recommend many scary films to my friends especially recent scary films, but I will recommend Kaali Khuhi to everyone."}, {"id": 9, "text": "Whenever something from Bollywood comes on Netflix, I am always apprehensive that it is going to turn out to be a waste of time. This is one of such movies. I don't understand what the movie wanted to convey ?Guys, please donate the money to some poor kid in India, but don't torture us with movies like this"}, {"id": 10, "text": "A spooky, atmospheric meditation on the twisted ways tradition can manifest in the real world, with real consequences. This isn't your usual horror film, so don't come in expecting jump scares and gory sequences (though there are plenty of creepy moments!).Instead, Kaali Khuhi is a dark, surreal story that connects a young city girl to the girls who lived in her father's village before her. The spirits are angry, and rightfully so. Worth a watch, and a discussion afterwards, about a practice that still unfortunately happens worldwide, and about the director's POV on who's complicit and who's innocent - and who really has control over their future.Engaging and thought-provoking, beautifully shot, and far more interesting than most horror films I've ever seen."}, {"id": 11, "text": "Waste of time and money. If u dont have story and content, stay quite. Stope fooling people and spending money in nonsense!!! Enough is enough!!!"}, {"id": 12, "text": "I had no idea what to expect from this movie, and it ended up being one of the most unique movies I think I've ever seen. Lots of reviewers are complaining about the plot (?? which was... clear and easy to follow to me?), but the fascinating part to me is that traditional plot structure felt less urgent and important than the devastating mood: the gray, dark tones; the slow realization that none of the adults are reliable, good people there to help; the outstanding acting of the tiny main actress (who was interesting to watch in every single frame); the use of color/ sun/ light in spare moments during the rest of the oppressive darkness and rain; the gorgeous cinematography (that popsicle drop in the well in the 2nd scene!)...As a North American, I loved getting a peek into a unique side of Indian cinema, locations, moods, etc, that we don't usually see. It felt like watching the origin story, the creation of a Hindu goddess in her pain and struggle to do the right thing, as well as desire for revenge and balancing the scales. The intensity of the actors made me think I could've understood it even without the subtitles, and I forgot I was listening to Hindi at times as I read along.Favorite moments were the body horror ghost womb (!!!), everything coming back to the well/ water, the p.o.v. of the girls running around the maze of the small town, and that beautiful/ jarring sequence with the sunlit sheet slapping us back into the cold rainy present.This movie reminded me of the movie mother! by Aronofsky - you don't really know where you're standing at times, and are only given clues through color, sight, sounds, themes and characters' emotions - but more accessible. This is a movie about being a girl in the world, and as a daughter and mother, it moved me and will stick with me!!"}, {"id": 13, "text": "I just had one question after watching this movie. If Sakshi was killed as an infant how did she grow old to become 10-12 year old ghost. And if she could grow even after dying, why didn't she any grow older."}, {"id": 14, "text": "Kaali Khuhi was a surprise. It was recommended by a friend and I didn't expect to like it as much as I did. This is more of a ghost story than it is your classic horror flick, with beautiful long shots and an intelligent script that you would expect from an art house film. The plot deals with insidious practice of female infantcide that is still done in many rural villages across the world.Much like the movie Atlantics, it's a smart ghost story with a message and a non-typical ending that is quite moving. Some of the special effects can get confusing, however what Kaali Khuhi make lacks big budget special effects more than makes up in content."}, {"id": 15, "text": "It rolls over the land like some sort of a silent witness, starting with the opening sequence, which takes place at night to the last shot, which is at dawn, signifying a new beginning perhaps. The fog works strenuously to add a layer of mystery and creepiness to Terrie Samundra's debut feature. The director also relies heavily on other horror tropes - a ghost makes a sudden appearance in a mirror, the soundtrack is purposefully ominous, in one scene, a withered old woman with one eye shows up, it rains incessantly. The story is set in rural Punjab, which is presented as desolate, dark and quietly horrific. The color palette is grey. But as I watched, I found myself wondering: How many fog machines did they haul to location? Or is it now all done digitally? And that is not a good sign.Like Dibakar Banerjee's terrific short in the Ghost Stories anthology and Anvita Dutt's Bulbbul, Kaali Khuhi is a horror film with a message. The idea is to scare you but also to make you think beyond the horror onscreen.Fog plays a leading role in Kaali Khuhi. It rolls over the land like some sort of a silent witness, starting with the opening sequence, which takes place at night to the last shot, which is at dawn, signifying a new beginning perhaps. The fog works strenuously to add a layer of mystery and creepiness to Terrie Samundra's debut feature. The director also relies heavily on other horror tropes - a ghost makes a sudden appearance in a mirror, the soundtrack is purposefully ominous, in one scene, a withered old woman with one eye shows up, it rains incessantly. The story is set in rural Punjab, which is presented as desolate, dark and quietly horrific. The color palette is grey. But as I watched, I found myself wondering: How many fog machines did they haul to location? Or is it now all done digitally? And that is not a good sign.Like Dibakar Banerjee's terrific short in the Ghost Stories anthology and Anvita Dutt's Bulbbul, Kaali Khuhi is a horror film with a message. The idea is to scare you but also to make you think beyond the horror onscreen and consider the horror in life. Incidentally, horror plus sex was dubbed horrex but I couldn't think of a clever name for horror plus message. Kaali Khuhi is about female infanticide in Punjab. The heroine is a 10-year-old girl Shivangi who confronts an awful secret when she is taken by her parents to their ancestral village because her grandmother is ill.When we first meet Shivangi, she is peering into a well as she sucks on a gola. The red flavoring from the gola drips into the water in tight close-up, foreshadowing the blood that will soon be spilled. It's a striking, spooky moment. Shivangi played by Riva Arora is a timid girl, confused by the adults - especially her parents who don't do a good job of shielding her from their problems. But eventually, she is the one with the courage and wisdom to put an end to the terrible events.As an idea, Kaali Khuhi is potent. There is something inherently eerie about wells - the cavernous dark space and the impossibility of escape makes them perfect fodder for horror films. Case in point, the Japanese classic Ringu, in which the murderous spirit Sadako, with her hair covering her face, emerges from a well, walking like a marionette whose strings are being drunkenly yanked by someone above. We learn later that she was drowned in it. It's terrifying. Kaali Khuhi has been edited by Sanyukta Kaza who earlier cut the superb Paatal Lok. It's thrilling to see a team of female artists tell a story that puts women front and center. It's also thrilling that Terrie is attempting here to deliver an urgent message via a genre picture. But for the combination to work, the writing needed to be much sharper"}, {"id": 16, "text": "We loved this movie! The story is melancholy and about secrets of a cursed village, it's done well and directed beautifully! I would watch it again"}, {"id": 17, "text": "Important film doesn't whisper in your ear, it shakes you awake. The sets are beautiful, the acting is amazing, and the story is both chilling and thought provoking. Ambitious and courageous filmmaking from this writer/director. I highly recommend."}, {"id": 18, "text": "Kaali Khuhi draws on legend, myth and the very real atrocity of female infanticide. Director Terrie Samundra wisely and intricately weaves an experimental horror that leaves you spooked for sure, curious and engaged from beginning to end.Riva Arora is a discovery.This film is for the detailed viewer who is satisfied with shades of gray and with going for a lyrical ride."}, {"id": 19, "text": "I was hoping for a good ghost story for Halloween. This film is so much more. It's beautiful to look at, eerie and without giving any spoilers becomes about something truly emotional. I thought the little girl gave a strong performance and the film was well made. Worth a watch for sure!"}, {"id": 20, "text": "No creepy scenes + a weak plot . Really disappointed with cast and storyline."}, {"id": 21, "text": "I don't understand the hate. This is a beautiful cinematic experience with stunning sound and visuals as the plot slowly unfolds. Suitable for horror and film fans alike. Bravo."}, {"id": 22, "text": "Amidst the cliche horror formula, this is one of the few movies from Bollywood that stands out. The amazing atmosphere the movie builds up in every scene retains throughout. It's not scary, in throwing you off your seat way. But it definitely is gonna leave you with lots of afterthoughts. The acting from the supreme cast really helps to pull out the beautiful message in the movie in a creepy haunting way. Kudos to the Team!!"}, {"id": 23, "text": "No story, no actting, total waste. And don't forget the lead is Javed Akhtar's wife who is a member of bollywood kabal we need to boycott."}, {"id": 24, "text": "What has happened to netflix releasing such kind of movies without assertingsuch a ugly direction and prostheses rather than getting scared it was like pukingpls do not waste your time in this ugly creature"}, {"id": 25, "text": "When will bollywood realize they can't make horror movies."}, {"id": 26, "text": "Waste of time! Do not watch :) There's nothing to review."}, {"id": 27, "text": "I sat there for 1 hour 30 minutes wondering when the story would get going. The premise was good but the confusing story, poor execution and zero horror element made this movie a confounding mess!"}, {"id": 28, "text": "The storyline of this movie is too common, nothing new on this but their acting is good."}, {"id": 29, "text": "The social message of female infanticide in India combined with horror is a great idea but this director along with terrible screenplay has managed to make it a complete waste of time."}, {"id": 30, "text": "Apparently it took 3 people to write this 'thing'. Seems more like 300 people came in, took turns in writing 5 lines each without the next one knowing what the previous one wrote. Kuch pata Nahin,zabardasti ki movie.There are movies that are impeded either by poor casting, poor writing, bad cinematography or bad acting.This movie is one of those rare masterpieces that has all of the above.Dialogue delivery is even worse than what you'd get in a nukkad drama company, I mean, even Fardeen khan is an ace actor as compared to these band of chimps.There is a scene where the protagonist has a chunk of her flesh bitten off after a few scenes she's parading around as if nothing happened.Pointless drivel, a movie that goes nowhere. Avoid"}, {"id": 31, "text": "I have been waiting for so long for a good authentic Indian horror movie and this movie ends the wait.Of course, to achieve good production quality, it requires money, but this movie compensates for that with the amazing acting by all actors, eerie visuals and background music. Not the usual ugly monster laden, spooky horror BS, but a very slow, tense, subtle intense thriller that keeps you wondering what the hell is in store! Not the best ending, but the journey is more enjoyable than the destination. A definite watch!!!"}, {"id": 32, "text": "Beautiful and haunting images set the stage for a mysterious and nail bitting story to play out. The film has a tangible quality with grounded real performances from the entire cast while themes and symbolism is rich and layered. It's also refreshing to see a movie in this genre told from a female perspective and in particular a child. The film weaves in and out of spine tingling chills and delivers an entertaining story until the very end."}, {"id": 33, "text": "I came here in IMDB and seen that this movie only got 3.3 rating. This film is way better than that. People are giving 1 rating, I don't know what type of stories they want to hear. I loved the story telling pattern, loved the cinematography. The ambiance &amp; color they have created is something very special for this creepy movie. I loved it. Thank you NETFLIX. Want to see more films like this."}, {"id": 34, "text": "A movie with a very poor direction, acting, execution, simply not a netflix level content.Message was good but the director couldn't convey it properly.👍Riva Arora is a Gem💎 needs to work of her acting skills, has a great potential."}, {"id": 35, "text": "Netflix Stop wasting our time in these type of senseless movies."}, {"id": 36, "text": "In attempting to create horror with a social message, makers forgot about almost all other things that need to come together well to hold attention of the viewers!!"}, {"id": 37, "text": "Netflix is disappointing with their useless and bad directed content again and again. Kaali khuhi is another example of very bad directed film. No horror no story no meaning just fog and funny music. And than they say Indian movies will win oscar one day 😂"}, {"id": 38, "text": "A very bad movie without any story. the actors also are poor..it is a waste of time."}, {"id": 39, "text": "Poor story, scares are less acting is poor. Not a good movie at the most short story. Netflix should put.more money I. Jndian content"}, {"id": 40, "text": "Any movie in which this jihadan shabana aadmi works will be completely boycotted."}, {"id": 41, "text": "One more movie added to the Netflix's worst movies list... very poor content."}, {"id": 42, "text": "What the hell guys .. In which ERA we r living for such a pathetic direction...Shabana mam, how did u accepted such a bomber"}, {"id": 43, "text": "I've never seen an Indian horror movie before and found this movie very refreshing. There were no dance sequences, no major costume changes, no love triangles or romantic misunderstandings... Just a serious, engaging horror film with an underlining message about the imbalance in gender rights and value. I loved it."}, {"id": 44, "text": "Gripping, entertaining work. Comparing it to a standard horror movie with screeching doors would be incorrect. The character of Shivangi , a child can be really scary. The work definitely brings forth the amazing talents of the producer, director and actors......classy, original, interesting and innovative."}, {"id": 45, "text": "Shabana Azmi is a treat to watch.. The movie is depicted on female foeticide in an unusual yet thoughful manner. The movie is a bit scary but keeps you hooked till the end .. Definitely a one time watch."}, {"id": 46, "text": "The movie isn't scary per se or extraordinary. But it still deals with the issue of female infanticide well. The child actor is sweet and reminded me of myself.The film is shot beautifully in the rural areas of Punjab. The shots are spectacular and I think it's better than the rating implies.However, they should've developed the story further. The climax scene was also terrible. Good concept, poor execution."}, {"id": 47, "text": "Utter crab plz don't wast ur time watching this nonsense instead do something else. U will regret for sure if u dont take me seriously. When Netflix came to India I thought they will bring some quality to our industry but they are going worse they are now bringing main stream movies to c grade level .. nonsense movie making shame on Netflix"}, {"id": 48, "text": "Horrific! Waste of time !! No story at all !!!! Don't watch it !!!!!!!"}, {"id": 49, "text": "Please don't watch it's a worst ever story. Please IMDb I would suggest that with out star rating we should be able to submit too. Viewers please don't mislead by giving false high rating"}, {"id": 50, "text": "This is too much of wasting time for the sake of movie making. Whosoever has directed this movie should have mercy on audience and not try another hand at it"}, {"id": 51, "text": "Poor acting Poor story telling ( wait what story?) Almost no character building Felt like everything was allover the place.Only positive is the eerie feeling they have created throughout the movie and location they have picked.Other than that no idea what was going on."}, {"id": 52, "text": "No research nothing Such a poor execution Netflix india is a garbage such a shame that I paid 800rs to see movie like this,"}, {"id": 53, "text": "Only one word for the script, direction, screen play that is whaaacckkk thuuuuuuu"}, {"id": 54, "text": "Do not watch this movie otherwise you will be regret like me because I already wasted my internet data and 2 hours to watch this hopeless movie. No any sense no story nothing. It's just a baseless movie."}, {"id": 55, "text": "I am an Indian with Netflix USA user, when I heard Netflix starting in India with it's own original I was happy and it delivered some good shows initially, but later it started how Bollywood does business in Indian and fool people.Looks like financially not worth in India at this point.Choice is yours!"}, {"id": 56, "text": "This is the worst movie that I have watched. Poor script, poor acting, poor story! I wish I could leave 0 rating here."}, {"id": 57, "text": "This title can easily be skipped on Netflix. It's a slow, dark, boring and rather senseless storytelling. The script is very poorly written and there is frankly no element of horror per se. The ending is left open and abstract along the lines of Hollywood horror movies. But overall, a bad n boring watch.."}, {"id": 58, "text": "With Shabana Azmi, Sanjeeda Sheikh, Riva Arora. A fairly dark supernatural horror/thriller. Untidy finish. Cheaply made for Netflix and below expectations.."}, {"id": 59, "text": "Don't waste your time on this film, save your bandwith and watch something else."}, {"id": 60, "text": "All Indian horror movies suck ..it should tagged as comedy movie instead of horror none of the scenes are frightening..director should they watch some Hollywood horror before making horror movies .. seriously it's heights of disappointment when it comes to horror in Bollywood"}, {"id": 61, "text": "Luckily after watching for half an hour I decided to check the review. I watched only for genre and shabana azmi. Watching for minutes I found it to utter boring I doubted may be I am wrong the film will turn out to be good but after not able to bear it any more I checked the review thank fully now I will not waste my time on this nonsense"}, {"id": 62, "text": "They wanted to talk about the evil of selective killing of baby girls in Punjab, and they end up making a idiotic horror film, trying to encash Shabana Azmi's name for credibility - it does not work, bad film, bad story line, bad acting."}, {"id": 63, "text": "This film is an inventive and suspenseful ghost story and though it is truly scary, it is also touching and brings a depth that is lost in a lot of horror films. The main character Shivangi is really amazing."}, {"id": 64, "text": "Another Netflix film that is technically brilliant (other recent one is Bulbbul (2020)) with a better sound design than most Indian films but which lacks substance. It crafts a suspenseful story at the cost of putting its viewers to sleep, to whom the impeccable production value or crescendoing background score is not enough. It is hard to keep track or make sense of things in Kaali Khuhi (The Black Well) and by the time you do, it goes off with a whimper. At the end, it reduces itself as an atmospheric suspense show sampling and combining folktales and social evil and hardly has any effect on the viewers. It's a wasted attempt (including the talent) at best with a confusing plot and several unanswered questions. These may be solved in a second watch but Kaali Khuhi is not confident enough to demand a first. Only for serious horror fans. Grade D. TN."}, {"id": 65, "text": "Nothing more interesting but you can watch for one time. Shots was taken perfectly thats give you grip. Otherwise story dont have any sense."}, {"id": 66, "text": "The director should enroll herself in a film school."}, {"id": 67, "text": "Please write it in a way that everyone can understand. Dont try to be a director making interstellar. Acha story banao yr."}, {"id": 68, "text": "I was genuinely sad that the death well stopped existing at the end of this movie as I was looking for one to jump into after enduring this nefarious assault on the senses masquerading as a movie."}, {"id": 69, "text": "Netflix, what happened to your content ? No filtering anymore before a movie goes on top Ad. Totally random scenes..No connected storyline. Nk proper story.. sheer waste of time.. seems like some watched various different hindi horror movies and get a 30sec clip from all and put them together.. jo meaning , no scene to scene relation"}, {"id": 70, "text": "The underlying plot was good but the execution was not up to the mark. Shivangi seeing the womb and taking away the baby, just could not digest that"}, {"id": 71, "text": "Such a bad movie.. Worthless. Bogus. Waste of time.."}, {"id": 72, "text": "Why Just why? Nonsense movie..no plot full bakwaas!"}, {"id": 73, "text": "Finally something new and thought-provoking! I have waited all my life for someone to make a feminist horror film that takes place in the village. It's beautifully shot and looks gorgeously dark and haunting. You can feel the sense of dread brilliantly captured by the incredible set design and star cast. Riva Arora's acting is so impressive and convincing in her role as Shivangi. Director Terrie Samundra uses the horror genre to touch on the atrocities of female infanticide, and does it in a way that is original, inventive and smart. This film takes risk and is not your typical Bollywood film and that's a good thing."}, {"id": 74, "text": "Like literally unbelievable. It's like a pointless tale of despair in this sickness infested place which is as unreal as the weak plot. It's supposed to be a village in Punjab but i think the writers have never lived in Punjab or have any idea how to create a believable atmosphere. Everything from the sounds of the village in the morning to the lighting to the generic Aarti in the Mandir to the motivations of the ghost is just unreal. This is a story meant to beguile rather than instruct, and comes across as more ridiculous than scary. I would ask for my money back of this was a theater release. Really wanted to like it but it doesn't deliver."}, {"id": 75, "text": "I keep on trying Netflix indian content hoping they will finally start to live up to the Netflix international standards, but Netlfix keeps on rolling out below par content in India and this movie is no surprise. Right from beginning to the end, this movie has nothing that would make you go wow. The whole story plot is too dragging, and you will end up sleeping right on the couch. The acting is lacking on all fronts."}, {"id": 76, "text": "Its one of worst series I have ever seen. You can make out that actors act well, but when you have disastrous direction and such weak storyline one cannot do much."}, {"id": 77, "text": "Not so far a good movie to watch the slow paced movie of the year the concept is bad the movie is useless in point of direction."}, {"id": 78, "text": "Seriously making such illogical horror movie makes viewer cry.. story writer need treatment before making new movie.. plz"}, {"id": 79, "text": "I wonder why rating has been so low as 3. it deserves better rating."}, {"id": 80, "text": "People writing bad reviews have a vendetta against Akhtar Family. They are blinded by their own personal prejudice. This movie is not perfect but it is important for the message it wants to convey. Could have been better"}, {"id": 81, "text": "I loved this film. I believe that anyone jumping into this film for a cheap horror flick should look elsewhere. However, if you're interested in a well-paced, female driven, horrific (yet needed) history lesson told through a mystery/suspense/horror vehicle, you'll thoroughly enjoy this film.Also, it has one of the most beautiful closings shots I've ever seen."}, {"id": 82, "text": "It Was A Good Movie!!! It Was A Good Movie!!! It Was A Good Movie!!!"}, {"id": 83, "text": "I'm reading the other reviews and I'm wondering who is the author behind these. Is it all men who wanted a generic Indian horror movie and are crying about it? Sorry you didn't get it, but look somewhere else. This is a beautifully shot cinematic art house horror with a strong message about an important topic. I thought the storyline was haunting and beautiful. And the lead actress was captivating to watch. I liked how original it was and it still got me with those classic jump scares. I'll admit I had some wild dreams after!"}, {"id": 84, "text": "Must watch, If you want to regret wasting precious time lost watching this garbage"}, {"id": 85, "text": "We can guess the story even watching the trailer and it was very poor."}, {"id": 86, "text": "There is no story, no plot, no acting. I don't know why it was promoted on a platform like NETFLIX. The only thing I like about is the social message in it."}, {"id": 87, "text": "The story is very dull. The characters are undeveloped. The main girl really can't act at all. In conclusion a waste of time. Only reason didn't give this lower than a 3 is I do like the atmosphere and music a bit."}, {"id": 88, "text": "Pointless, worthless and senseless. Please save your time"}, {"id": 89, "text": "After watching the movie, i still dont know what The whole story of the tradition of that village is? The childactress is pretty good!"}, {"id": 90, "text": "Its an OK OK movie and should not deserve a age rating for 16+ as I watched it with my 11 year old and should deserve an age rating for 13+. I believe that if the movie was a short movie or if the ending was a little bit more better it would have been a great movie."}, {"id": 91, "text": "For most reviews here it is that this feature makes for uncomfortable viewing is what justifies the low rating. Granted it is not exceptional or even very good. But it is good enough and by no means justifies the low rating it now enjoys. This motion picture sans the regular song - and - dance feature takes on the shameful and disgusting topic of female infanticide, and weaves an atmospheric narrative out of it. The story itself is overtly simplistic and devoid of any layers or character development. It is not horror per se but more a story that involves supernatural elements. The production values are high, and direction is competent. There is so much that could have been done with the material available but the movie though underwhelming and slow does a credible job. It is not something that you would in all probability rewatch but as a one time watch it works. The acting is competent and the photography is excellent. For the material that this movie tackles the director works a fine line between a feature that could be called a motion picture and something that is merely a documentary. A decent watch.Good."}, {"id": 92, "text": "What the heck is up with Indian audiences, nowadays??? One would think a 3.4 rated film would suck so bad and be complete trash. But this was a beautifully made film that had a story to tell. Granted, it's not great or a masterpiece, but this was very watchable. The cute little Shivangi, and her innocent choices, were touching. The film is heavy on mood and atmospheric, so don't expect a throwaway jumpscare horror flick. This is an emotional drama about a heinous phenomenon that still exists in parts of India. The cinematography is beautiful, the sound design was moody and scares were effective, at times. Trust me, guys, this is by no means a bad film. But, I don't say it's great either. The film has dialogue issues, which made me wonder 'Do people even say this,' at times, and the characters were pretty shallow and not well-developed. But that isn't to say that this movie was not visually interesting. This was a calming movie for me, and you will feel pleasant by the end. Don't watch expecting some commercial horror, filled with mindless jump-scares. Watch it for a reasonable story, and the brilliant atmospherics. This film, at least, deserves 6 stars. I can't believe people can stoop so low to disregard something that was made with heart and effort. This was a good film. A 10 from me, to balance the ratings."}, {"id": 93, "text": "Terrie Samundra's KAALI KHUHI is an intoxicating blend of artistic visuals, eerie horror and dark atmosphere. A refreshingly new horror, after TUMBBAD, that don't have cheap stolen hollywood content in it. Brilliantly Cinematographed by Sejal Shah, which is simply entrancing. Daniel B. George's background score is remarkable, absolutely pitch perfect and frightening. Well acted, specifically the performance by Shabana Azmi was outstanding showed her class why she is considered to be the all time greatest actress of Bollywood. you will probably listened most of the people saying this that they did not got understand the film and the characters. Well I just want to say to them, if you didn't understand it doesn't mean something is incorrect or inaccurate. you should broaden up your knowledge of Direction before commenting on something.#Do not judge the movie on the basis of critic reviews. They're absolutely wrong. Watch it by yourself then decide, whether it was worthy to watch or not.#At last but not least, this movie is going to be one of the rarest gem of bollywood horror genre that will be remembered for a long time."}, {"id": 94, "text": "A fool and his money soon part ways. If you want to see this adage in live action, just watch the ratings of all exclusive releases from the house of Netflix India in the last 2 years -- one stinking crapola after another. This movie is the mother queen of all the crapolas that Netflix has thrown at its subscribers. Actually, it doesn't really matter if you see this movie or not, because if you are a Netflix subscriber, you've already paid for it. The only saving you're going to do by NOT watching this film is that of your time. So, go ahead and do it.The nincompoops at Netflix are so hellbent on building an Original Content library in local language that they are simply elated in handing out cash to the out-of-work, incompetent Indian movie makers (if you can call them that.. haha!) who are robbing them blind in broad daylight by producing utter rubbish in the name of films. I canceled my Netflix subscription recently and now sleep happy, knowing that I will no longer be funding the creation of any more garbage with Netflix stamped on it. I've taken care of my money, you take care of yours however you see fit. Adios."}, {"id": 95, "text": "Kaali Khuhi as a story never takes off at any stage in its 90 minutes run, the scenes keep repeating itself in a endless loop time and again. Though the intentions of Kaali Khuhi is genuinely good, as its storyline focuses on female infanticide, but releasing the movie on Netflix doesn't make any sense. I don't think anybody who subscribes Netflix, would indulge in infanticide or need awareness on the subject.If horror was USP of Kaali Khuhi I doubt there is absolutely nothing much to write about. A terrible screenplay supported by some poor acting lets the movie down in every possible way. Cinematography and editing does have a few good moments sparingly, but that does not add any value to make the movie more interesting whatsoever. Production design, music, makeup and costumes were just about par. Director Terrie Samundra really needs to get her act together, if at all she wants to make another movie.Overall, the movie doesn't scare you one bit, it is not at all even close to even give you a jump scare. Only positive aspect is that, Kaali Khuhi doesn't have any adult scenes and can be watched with the family. Watch it only when you have absolutely nothing else. It's a 20 minute short, made into a 90 minute feature just to bug the audiences."}, {"id": 96, "text": "Kaali Khuhi though with desirous intent in heart; fails to felicitate a rather exceeding technical prowess. Other than its artsy appearance; Netflix's brand-new original does everything else woefully wrong. Dreadful writing - Checked Inept Screenplay - Checked Meager Performances - Checked Lately, this has been the case, when it comes to Horror! Especially in Bollywood. They do get engrossing scripts to work out with, fair enough funds to help in the process of making but it's always the 'Writing' that let the whole project down! Something similar happened in this case as well!Cinematography is undoubtedly Brilliant. The framing, colors, vibe all being in the top tier! In addition, seemly soundscore with somber tonality; helping to create a certain mood!However, the rest is a pile of trash, in all fairness!Misfit dialogues, sudden outbursts of emotions, recurrent issues with pacing; it all made no sense! Perhaps, the most startling factor being the infirmity of the performers to stand out! With such competent names in the cast list, it's confounding to say the least."}], "reviews_amount": 97}