{"name": "The Quarry", "titleId": "tt10151054", "reviews": [{"id": 0, "text": "Simple storyline Simple plotline Super slow movie."}, {"id": 1, "text": "The Quarry is a slow moving thriller drama about a wanted murderer and arsonist who assumes the identity of a preacher moving to a small and downtrodden town in texas. Complicating things is the fact that the van that he is driving is broken into on the night of his arrival and soon the impostor is involved in a theft and murder investigation by the sheriff's department. Making things even worse is the fact that the sherrif is highly suspicious of the new preacher who doesn't speak a word of Spanish and has come to preach to a largely Spanish speaking community. On top of everything the impostor seems to be feeling more and more guilty for the things he has done and has to deal with that as well.The positive aspects of this movie are the performances by the actors especially Shea Wingham and Michael Shannon as the criminal and the sheriff respectively. The rest of the cast are all good as well. The negative aspects are the fact that the film slows down considerably at times and could have been speeded up. And even with being slow the ending feels somewhat rushed. It's still not a bad watch if one is in the mood for a noir sort of film and because of the good performances throughout."}, {"id": 2, "text": "This movie has two of my all-time favorite and grossly under-rated actors of all time: Michael Shannon and Shea Whigham. These two started off as great character actors and are finally receiving the lead roles they have truly earned. Shannon's first Oscar nod was for REVOLUTIONARY ROAD, and no doubt there will be others. Whigham, whose memorable performances have always impressed, also has obvious Oscar potential. Although this movie isn't what one would consider over the top, it gives these two excellent actors the leading roles they finally deserve."}, {"id": 3, "text": "It looked promising. It got worse. This film had so much improbability to it that I muttered They wouldn't have done that! more than three dozen times. The pastor probably uttered 20 words the whole movie. Michael Shannon..well, he's always good and I wondered how he loaned himself out to this oinker. The same ones who produced Narco (fantastic!) must've been on drugs when they wrote/filmed/edited this one. Don't waste your time. (Oh, the burning house in the very beginning was cool.)"}, {"id": 4, "text": "I really wanted to like this movie, as I'm a big fan of Michael Shannon. Unfortunately it just drifted along, not really knowing what kind of story it wanted to tell. In the end I think the director just gave up on it, probably much like it's audience. I don't know how I got to the end."}, {"id": 5, "text": "Story: Shea Whigham plays a Criminal 'The Man' who - after meeting and killing a Traveling Preacher - assumes his Identity. The Preacher was going from Ohia to a Small Town in Texas close to Mexico. Michael Shannon plays the small town Cop frustrated with his Career and Life. Thrown into the mix are two young Mexican Kids who - by accident - begin to uncover the true Identity of the newly arrived 'Preacher'. After arriving in the small town, the 'Preacher' begins to act his role and even starts to draw more people than usual to the local church while increasingly struggling with his criminal past. Acting: I was especially surprised by Sheas Performance in this. I've only seen him in smaller Roles such as in 'First Snow' and 'Cop Car' among others. His Portrayal in this Movie of a Criminal - hunted by his past and the terrible things he has done - essentially beginning to give up on Life itself - is excellent. By the End of this Movie his Expression and Demeanour portraying Resignation, Frustration and Depression becomes so 'real' it almost gets hard to watch. Overall: It is a Slow, Brooding, Haunting and Suspenseful 'Thriller' / Drama. Michael and Shea both give us great Performances. The Movie has issues like any other and some people might find it too slow overall. The Ending ( for me personally ) was underwhelming. With the stuff that Hollywood is giving us these days this one stands out to me. Suggest you give it a try."}, {"id": 6, "text": "The film begins on an open desert road where a religious guy is driving to somewhere leaving his troubles behind. Along the way, he encounters a man passed out on the side of the road and as a good samaritan decides to give him a lift to the closest diner or sight of establishments to freshen him up. Upon doing so, the gentlemen strike up conversation and head on their way to a nearby border town. Along the way, the two gentlemen approach a quarry for a pit-stop and the now known preacher unknowingly aggravates his passenger who strikes out at him in a fit of uncontrolled rage and kills him.With blood on his hands, the passenger has no where to turn, and has concocted a plan to assume the identity of the preacher, and buries him in a shallow grave in the quarry. He then heads to the border town where the preacher is supposed to take up residence and settle in to his new life.Upon arrival, he sees a wanton boy playing late at night in this Mexican border town, who helps him find the church that he is to settle into. So tired from his trip, the impostor of a preacher just wants rest, and ignores the advice of the caretaker of the house to bring his luggage from the van inside. The following morning his vehicle is broken into, and he takes the advice of the housekeeper to call the local police chief to investigate. This is where the drama begins!Without going further into the plot, to me the standout performance was Michael Shannon as the police chief! It reminded me of a similar role he played in Nocturnal Animals. His portrayal of the character is nothing short of intriguing and dare I say flawless. He exuberates thrill, mystery, the whole package.The other standout performance was that of the passenger who feigns to be a preacher. The development of this character was well paced and very awesome. This character is very relatable as he starts off a sinner, and with this mindset he was able to quickly relate to his following and quickly expanded the following of the church from a handful to a throng of faithful. As his following grew, ironically, his belief in the holy word started to grow, and his conscience as well.In closing, no bad deed goes unpunished, and everyone is salvaged in one form or the other."}, {"id": 7, "text": "I haven't read the other reviews. I guess they're not great. But there's a lot going on in this movie that's probably lost on most.I found it to be a powerful character study where each actor faces a moral dilemma. It moves along the line slowly, thoughtfully, deliberately.The notions of ontology, of faith, of redemption, and of truth are just a few of the concepts pulled into the story.I get it's not for everyone, but there's a lot to find if you look for it."}, {"id": 8, "text": "Michael Shannon and Shea Whigham carry this well paced crime genre based on teh 1995 Damon Galgut novel that dealt with the effects of apartheid in South Africa. For this adaptation, it has been set in a small border town in the Lone Star State, where the racism is still alive but in this case directed at Mexican immigrants. The film directed by Scott Teems and co-written with Andrew Brotzman."}, {"id": 9, "text": "No mystery, no thriller only boring and dull movie without any climax. I had been more irritating to see dumb characters and nothing in the movie. Story of a man who kills a father and takes his place at a small town. Why ? answer only get in last scene of the movie, is this suspense ? And thrill ? There is no thrill at all in whole movie. Waste of time. Never to watch."}, {"id": 10, "text": "No idea why this film has got so many bad reviews! Thoroughly enjoyed this film from beginning to end. As a fan of Michael Shannon I was not disappointed, and Shea Whigham was just as good as co-lead. Nicely shot, well acted film. It is slow paced , but that doesn't mean that there wasn't anything happening. It was a nice slice of life kind of film. Totally baffled at the negative remarks!"}, {"id": 11, "text": "Shea Whigham and Michael Shannon are at their world class best. In particular Whigham playing the conflicted criminal who assumes the identity of the cleric he murders. The story itself is a slow burner with some holes but the performance of the leads are captivating."}, {"id": 12, "text": "Incredibly slow, boring, unbelievable, annoying, obvious, stereotypes, way too much back and forth between english and spanish etc etc.. just plain dumb."}, {"id": 13, "text": "The story is engaging because you see how one person's mistake affects the lives of others. The morality and also the irony in the story are remarkable, making the film thought provoking."}, {"id": 14, "text": "Shea Wigham's best role I think. I saw him first in True Detective and thought he was amazing, nothing short of tour de force! I think he also played a preacher in that one too. He just gets better and better. Michael Shannon is another tour de force type of actor. He's great as the sheriff. He can play any character and he's just a natural, I love his movies. The movie shifts into high gear and when it was over, I kept thinking This style of movie mystery is like an old fashioned killer movie from the old days. It's just plain good and intriguing til the last minute. I absolutely loved the storyline, script, the acting was superb, especially Shea Wigham. His best acting performance I think. It had to have been someone with style and class bcz he took over a preacher's identity and preached to the parishioners. Simply amazing. The ending was intense as well. Do not miss it, take look at Shea Wighams performance. He might deserve an Oscar for this one, I'm not sure. He definitely nailed his character down amazingly."}, {"id": 15, "text": "Start by assembling a bunch of stories/scenarios, cut them into pieces and reassemble in some random fashion. Clergy (background unknown) driving to a new congregation somewhere down south. Spots a body lying on the side of the road in an isolated barren landscape. Next scene that person is sitting in the clergy's van. His background is never really clear. This not too talkative stranger decides to become a preacher (Why? Makes no sense.) By the way talking is a job requirement. Oh, Spanish speaking is required which he doesn't speak. Our writers added an odd sheriff w/romance side show. Finally, more not explained or believable events occur the most absurd being the closing boat scene."}, {"id": 16, "text": "This film start with a building burning, and a man kill a reverend David scene! As turnout, this film is about the man who murder David, disguise as a reverend with the name of his victim to get away with his crime, and a police chief Moore suspect an illegal immigrant Valentin kill the reverend! Entire film super slow, and full of super annoying overuse scene! Such as, overuse of the blackout scene, overuse of the flashback of the building burning scene, and overuse of the main actor dreaming he been lock in the coffin scene! Make the film unwatchable! Not a single action scene show to the audience! At the end, Valentin wounded! He kill the real murderer, after confess by the murderer! Both of them die at the very end! That's it! Wasting time to watch!"}, {"id": 17, "text": "Yes, it started out extremely slow and trust me, it didn't pick up. I almost turned it off about 20 minutes in but there was something about this film that made me stick with it a little longer. It's not a whodunnit by any stretch, they take care of that right away. But I was interested in the characters and the performances of the men. They were so relevant to today and the ongoing struggle in society over good v evil in whose eyes."}, {"id": 18, "text": "On the plus side it's got great actors, it's bilingual and it's moody and well acted. On the down side 'The Man' behaves so oddly that he would have been investigated immediately and it hints at themes such as racism, loneliness, regret, being stuck in a small nowhere town and guilt without every fully exploring any of them. Still it's enjoyable and 6 stars is probably a bit harsh"}, {"id": 19, "text": "The acting are great but the movie is very slow. Who will Belice someone will sent a priest that doesn't speak in the same language?"}, {"id": 20, "text": "The story is not real, many inconsistencies, but it Nicely shot and played! You will come back to it again and again. Recommended!"}, {"id": 21, "text": "It's based on of an Iranian movie named the Lizard 2004 by Kamal Tabrizi. The scenario is very similar. I like it."}, {"id": 22, "text": "I would believe and render into the story, but the 1:43 hour picture is slow and its just not engaging. I did not feel impact in the final scene, because the character doesnt make you feel the weight of his guilty, the burden of killing a man. I kept straight face the whole film... and thats it. Without Michael Shannon i dont think i'd finish it."}, {"id": 23, "text": "This film had a lot of potential especially with 2 top level actors and a film based on a novel starring Shannon and Whigham. But the pace of this low budget indie film is so slow it is like watching paint dry on a wall. Except there is really no depth to any characters. I thought at one point that Whigham fell asleep or forgot his characters name in front of the judge. It is almost comical the minimalist acting to the point of amnesia because there is nothing left in the script for the actors to dig into besides maybe a Sergio Leone look into the camera. And the final scene is completely out of place since... spoiler alert... Whigham somehow not only decides to leave the now secure small town but out of guilt decides to leave by jumping in a row boat... and we never see him move it into the water.. but i guess he fails to notice the extra 200 pounds underneath the cloth at one end of the boat... the editor cut this part out... and we now only see Whigham floating down the river... and wham... suddenly Awakens to find his nemesis almost dead laying under the cloth... and the big finale happens. Actually it is not much of a Finale.. more like Redemption Maybe the story works in the novel but in the film it just is laughable. Great acting so a solid 6 (probably deserves only a 4 but no Oscars in this film)"}, {"id": 24, "text": "A drifter (Shea Whigham) kills David Martin (Bruno Bichir ) an annoying alcoholic preacher on his way to a new job in a small southwest Texas town where Michael Shannon is the sheriff, blame the Hispanics first. He takes on the role of a preacher while Shannon hunts down 2 kids who deal pot. When the body is uncovered, the Mexicans are to blame.I liked the character of the drifter who was not all bad or all good, but a combination like a real person. The movie dragged in too many scenes with conversation moving slow. Watchable.Guide: F-word. No sex or nudity."}, {"id": 25, "text": "This movie isn't the best thing they've done but they're great in it. They have worked together before a couple of times and are amazing. I don't really think the movie overall is a 10, but the rating of 5 is much too low so I puffed mine up a bit. I hope these guys work together more in the future!"}, {"id": 26, "text": "As most reviewers have said, 2 quality actors leading this film but my god is it boring, the scenery is nice but it is very predictable..."}, {"id": 27, "text": "I tried really hard to enjoy this movie and at times I did. It's my kind of film in fact; small town setting with caper. On a parallel with Hell or High water and Into the ashes genrewise. But not nearly as compelling. The acting was good but I was hoping for more substance and depth.I also have a couple of questions about the storyline. 1. How far was the quarry from town exactly? The man left the quarry in a van during daylight hours and arrived in town well after nightfall. Yet the two boys walked to it and from it in what seemed like mere minutes. 2. Why was there even a trial after Valentin confessed? Of course the trial never really got started, but why was it even attempted? 3. Surely a better ending could have been drafted... I mean we're left without even seeing the sheriff's hunches being satisfied. The cuff link in the lavratory, the wanted poster missing from the bulletin board, Is Valentin dead after attacking the man?I could go on but I won't. Maybe someone can figure these out for me."}, {"id": 28, "text": "I spent two free hours on this movie. And you know .... don't follow me.Very long plot. The idea is so original, so the film is not particularly addictive. I think it would be a decent four serial series The acting does not convince, I don't want to believe the characters. The same money could be used to make a much more worthy film.Look only at your own fear and risk."}, {"id": 29, "text": "The movie would have had so much potential with the story line, I think this would be a great show if it were maybe a short 1 season."}, {"id": 30, "text": "'The Quarry' is a prime example of style over substance. This is actually a beautifully shot and wonderfully acted film. Where it lets itself down is the story. The plot is so lacking in depth and creativity that it makes for an extremely long and dull 100 minute runtime. I kept hoping for some kind of twist or unexpected turn in the story that would add some life to the proceedings. Sadly, it never came.The one thing that keeps the film watchable is the acting, and in particular Michael Shannon. The film gets off to a very slow and understated start and to be honest I wasn't sure if I was going to able to stay awake for the entire movie. Then Shannon was introduced to the film and suddenly things picked up a lot and became a lot more watchable. Part of the reason is that his character is the only one in the film that actually has any character, but the other part is just down to some very fine acting on Shannon's part.The big problem with 'The Quarry' is that everything is on the surface, everything is known to the audience. There is no mystery or intrigue. The only thing we can wonder about is how the film will conclude, but the story isn't really interesting enough for us to care much about that either. One compliment I can give the film is that is doesn't outstay its welcome. I've seen films similar to this that like to push the two hour boundary and they become unbearable. Still though, I'm sorry to say 'The Quarry' was a pretty forgettable experience."}, {"id": 31, "text": "A while ago I was real happy to find out that She Whigham will have a leading role, something he truly deserves and rarely gets, and this time in a small town crime neo-noir, no less. And Michael Shannon co-leading? Now that's a recipe I could get excited for. I'm happy to report that the performances are the absolute standout factor of The Quarry. The rest? Certainly effortful, genre-fitting and ambitious, but ultimately confused.The Quarry is a an existentialist tale of guilt, wrapped up in all the known elements of a neo-noir, begging to be a Coen Brothers movie, but lighting a fuse too long for it only fizzle out at the end. However, it goes great before it gets worse. In the first half we meet Shea Whigham's drifter with heavy emotional burden on his shoulders who assumes the identity of a travelling preacher and takes his place at a small town's church. The character is in search of hope while being caught in continuous conflict with himself, full of heartbreak, and is one of the consistently effective elements of The Quarry, showcasing a tremendous, authentic and felt-through performance by Shea Whigham. Michael Shannon plays the town's Chief, suspecting a foul play in the mystery of the town's new reverend, and is also the other most stable foundation of The Quarry. The rest of the cast plays along equally well, in togetherness creating a decent portrait of a small town community. Problem is, the slow-burning story that's seemingly building up an exciting showdown, starts getting more and more tiring around the middle of it &amp; in the end we get led to a much expected albeit decent conclusion, clothed up in all that's underwhelming. In other words, the filmmaker's intentions are not quite clear, and the movie, as elegant as it is, ends up being a pale imitation of many better movies. A commendable aspect of The Quarry is its design - it's photographed quite beautifully and is never really boring visually, while also being accompanied by Heather McIntosh's subtly and silently threatening original score.The Quarry has such terrific performances and good aesthetical design that it's actually such a shame that story wound up as confused and unpolished as it did. I liked it, but it could've been so much better. Unrelated to my complaints, but it's funny how they sell it on the poster - From a write of Narcos: Mexico. Well, he wrote a single episode. Despite all, the summary of this neo-noir, in my opinion, lands a mark above average, and might just contain of the best acting performances of Shea Whigham's career. My rating: 6/10."}, {"id": 32, "text": "This is a masterfully told tale on the level of a Henrich Boll or Carlos Fuentes short story. It is a story of people seeking redemption in a community that is defined by desperation. It is superbly set, acted, filmed, and directed. The pace of the movie is perfect, it helps tell the story. It depicts the power of despair to produce depravity that gradually masks your ability to see truth. In this small town, justice and redemption are sought within the four walls of a church building that serves as both a house of worship and a courthouse. The quarry is a place, like the church, where value was once found, but now only hides sin. The central figure is a man who murdered his wife and, while running from his crime, murders a pastor who is running from his own failures. He hides the body in the quarry, then poses as the pastor in the church seeking anonymity and redemption as someone other than himself. But the power of his internal despair and its impact others cannot be quenched. He is contrasted by a woman who has the strength to love in the midst of the desperation and thereby retains her personal authenticity. In the end, the only one who understands life outside of the façade of religiosity and structured justice is the only one who through whom redemption can be found. I didn't find the ending quirky at all. It illustrates both the power and the unpredictability of despair. This is a noir film that is as much about the substance of internal survival as it is the power of personal of darkness. I hope this movie finds its audience. In a day and age where CGI trumps substance this is truly good storytelling."}, {"id": 33, "text": "This is a surprisingly good film. Found it by accident on the movie lists and watched it on the strength of the two lead actors who are reunited after their great work on Boardwalk Empire.What we have is really a redemption story, and there have been various other films which have already covered similar arcs (including comedies). We have our lead who is on the run who (unintentionally) murders a fallen pastor on his way to be the new church elder in a small Texas town. Our lead steals his identity to become 'David Martin' but the darkness never ends. One crime leads to another and more sins, but our lead is in pain and somehow revitalises faith in his town's congregation, which is the fascinating part of the story. Its actually compelling.It's a film that paces itself, and feels to me like a stage play on screen. It's very dark but has something to say. The redemption is not an easy walk, and you are uncomfortable at feeling empathy with a killer but that's what gives this film a lot of weight. All the characters have shades of grey, and they avoid cliche. The ending was disappointing, but I wasn't bothered. The whole story was still great.I think for one evening, if you want an intelligent watch, then go for this one. It's a surprisingly good watch, and much respect to all for putting this one together."}, {"id": 34, "text": "Great cinematography.Brooding background music that works.Great acting.Michael Shannon. Terrific as always.A good potential screenplay which explores a criminal mind and guilt.Those are the parts.The sum ... the direction and the overall movie.The sum just doesn't do justice to the parts."}], "reviews_amount": 35}