{"name": "Taish", "titleId": "tt10840884", "reviews": [{"id": 0, "text": "STORY- Beautifully Scripted BGM- Keeps you intact throughout...some catchy and some keeps your vain up ACTING- Full marks for all the Characters, specially Harshvardan Rane and Jim Sarbh SONG- All are catchy and the emotional songs tends to keep a touch of pain in you afterwards... Overall, i would rate this movie as a good and unique movie that has somewhere a good vibe of hollywood touch and keeps you intact till the end thanks to the brilliant acting from the characters..."}, {"id": 1, "text": "It's a revenge story but presented in a very sleak,cool and classy way. Every emotion has been expressed in the right amount by characters. Its a slow cooked,properly prepared movie filled with loads of taish."}, {"id": 2, "text": "Harshvardan Rane is back with this fantastic thrilling film of Taish. He looks hot, dangerous and dashing in the movie."}, {"id": 3, "text": "It's fresh, it's unique. We haven't seen anything like TAISH in Bollywood, it's too good. I love the story of Taish."}, {"id": 4, "text": "It's a very good film, with great acting skills. Harshvardhan was a show stealer with his intense look and acting."}, {"id": 5, "text": "The aggression, the temperature was totally set and goes so well with the film Taish. Actors did a fantastic job."}, {"id": 6, "text": "Saurabh Sachdeva was also very good in his screen time. Story was too good and the music is ok in Taish."}, {"id": 7, "text": "The mixture of Bengali, Punjabi, Hindi and English in a single film with a great story worked well with the story and smart actors."}, {"id": 8, "text": "TAISH is a super fantastic film with 6 episodes. I love the action, the casting, music, acting, the performance, the camera, everything."}, {"id": 9, "text": "Film is great but when someone in the film saying something that is not audible at some part we have to up the volume. Action part is okay I would say. One time watchable film."}, {"id": 10, "text": "Watched Taish today and it was a good thriller. Bejoy nambiar as always bought something fresh and it's an entertaining flick for this weekend. The backbone of this movie is the performances given by each and every actor, specially Harshvardhan Rane, the soul of the movie. He gave a brilliant performance as a Punjabi guy and his accent was truly superb. The music of the movie is another plus point coz it's not your daily remakes type of songs, the lyrics and music are wonderful. The movie is some places falls down but it takes paces later. The only minus point of this movie I didn't liked is the final battle between two friends and Pali. Bejoy could have choreographed a good action sequence coz both Pali and Sunny deserved a brutal hand to hand combat. 7.1/10 from my side."}, {"id": 11, "text": "A typical Bejoy Nambiar film it is. Solo, the Theme, Sound, background music, the Black, the motion, action, betrayal and classic about BN fans live the same way."}, {"id": 12, "text": "The film is a thriller. Kriti looks fine; Saloni batra and Zoa Morani have done justice to their role. Harshvardhan rane is also nice"}, {"id": 13, "text": "Abhimanyu Singh has done well in the film, his calmness on his face and his dark eyes, the look was superb. Good story."}, {"id": 14, "text": "All other supporting cast also acted well in this movie of Taish, but at last Harshvardhan steals the Show"}, {"id": 15, "text": "The heat argument in a Gurdwara and trying to deal with peace is something different concept I have seen in this movie Taish."}, {"id": 16, "text": "Harshvardhan , Pulkit ,Jim Sarbh &amp; Director Did a Fabulous job. One of the best directed bollywood movie I have ever seen, Fantastic Story , With a Message."}, {"id": 17, "text": "Big thing is the presentation of this film on Zee5, how Zee5 manages and completes entertainment like this movie Taish is super hit."}, {"id": 18, "text": "Harshvardhan should get such movies to show his great acting skill just like he did in the movie Taish. Loved it"}, {"id": 19, "text": "The direction by Bejoy Nambiar is absolutely Brilliant &amp; beyond Fantastic. There is a reason why he'll always remain amongst my favorite. Bollywood directors of all time."}, {"id": 20, "text": "I watched 'Taish' in the movie format. It starts off with two parallel stories - one about a family of gangsters, difference between two brothers (Harshavardhan and Abhimanyu Singh) and a girl (Sanjida Shaikh) who is the bone of contention. Second story is about a sweet couple (Jim Sarbh and Kriti Kharbanda). And what happens when they go for Jim's brother's wedding. Eventually, how these two stories cross paths.What starts off as a slow drama, gradually turns into a revenge thriller. And culminates into a dramatic climax. It's almost 3 hrs in runtime. And feels lethargic in parts. Probably you may find it more bearable if watched in episodic format.What works - The story is good. Performances, especially, by Jim Sarbh, Pulkit Samrat, Harshavardhan, Sanjida and Kriti are great. To me, Jim's performance really stood out. His character goes through various emotions over the course of the story and he effectively conveys them. The action/thrilling sequences are very well shot and will leave you glued to the screen. Watch out for Pulkit's confrontation with Abhimanyu Singh. Or the climax chase/action sequence. The story does surprise you at different junctures and the twists/turns don't seem forced at all.Negatives - The pace is really uneven. It picks up slow. Is interesting in the middle. Again pace drops until pre-climax/climax. At places, story doesn't move at all. Jim's dad's character and his attitude towards Kriti(her being a Pakistani Muslim) feels forced into the story and sticks out like a sore thumb. It was totally unnecessary and story could have done without it. It just makes me wonder, can't they make one movie/series without political references. Abhimanyu Singh is wasted. He shines in scenes he's in but overall wasted. The dialogues are mostly heavy on Punjabi. Making majority audience try to go back and forth to understand dialogs.Overall watchable. But you won't miss anything if you don't see it"}, {"id": 21, "text": "Nice acting from all the artists but you have to believe harswardhan rane is upcoming big star of the industry...what a film loved it😘😘😘"}, {"id": 22, "text": "Pulkit was so good in the film Taish but Jim Sarbh has his own capabilities. Supporting actors also did so well in Taish."}, {"id": 23, "text": "I think this movie gives you some new adventures and some actor's acting is also impressive. The story is new and perfect for Taish."}, {"id": 24, "text": "Punjabi movie with Hindi as a secondary language. It's not a typical movie where there are twists and thrills and then there's a grand climax, this is a jumbled up messy disaster with bits and pieces of good moments. There are sparks of good acting by Jim Sarbh, Harsh and other cast but not one is worth to remember for a long time, the script itself is SO lose that every single scene and actors performance fizzles off just before it takes off. Sets and actors clothing were great! Average cinematography. Poor editing. Weak, loosely written script. Lazy dialogues. There's NO thriller, NO mystery, and definitely NO climax. It's more of a family drama around few deaths more than anything else. Overall, average. You may skip this one."}, {"id": 25, "text": "Actually the series is in Punjabi language not in Hindi. If you are not good in punjabi then you must have to watch it with english subtitles. Story is same, nothing new, rivalry of two families, one is gangster.Starcast is good, except Jim Sarbh. I don't know how on earth they thought of him for it. Rest, not so special but could be watched."}, {"id": 26, "text": "After so long time, it's so relieved to watch such a fresh (great) content. Every actors have made their 100% effort to make this show fabulous. And talking of music, bgm; great lyrical songs have also made it great. Kudos.."}, {"id": 27, "text": "Sloppy plot, no thrill.. Zero agenda.... Only acting is good"}, {"id": 28, "text": "What a waste of time, talent, and effort this series was. Please skip it.A Hindi proverb for the climax fits in apt - Dimaag ka dahi ho jana."}, {"id": 29, "text": "Haven't seen a cheap series like this. Especially if we notice the performance of Zoa Morani. She is a blot on the performance of other actors. First half was okieesh but later the series is total crap."}, {"id": 30, "text": "Its a must watch movie by Bejoy Nambiar and EasemytripSuperb act by Jim sarbh and pulkit Samrat."}, {"id": 31, "text": "A good opportunity missed. Great casting, unique storyline but lost the opportunity. After halftime story got lost. Didn't get what the writer was wanted to convey."}, {"id": 32, "text": "I usually don't write reviews but this was a ridiculous film. Only reason I have given 4 stars is because of some good acting here and there and one odd decent moment in the film, otherwise this is waste of time! Don't understand how could this be a 7 in rating!"}, {"id": 33, "text": "One of the best movie ever in Indian history.. grt acting by all"}, {"id": 34, "text": "It is must watch movie. Well directed good screenplay awesome acting ,but our bollywoods so called critics didn't liked it cause there's no one from salman khan camp or karan johar camp. Its really good movie"}, {"id": 35, "text": "Taish is an average crime thriller with a good start and overall praiseworthy performances; but it keeps the audience wanting for more at the end."}, {"id": 36, "text": "Dialogues, acting were erratic therefore there was no flow to the plot. I found the actors tried to put up an air of eccentricity which was not required. I gave up on the series after the first few episodes."}, {"id": 37, "text": "A good released today by bejoy and teamA good galaxy of stars will entertain you by their anger friendship affairs revenge brotherhoodVery well directed and edited to 6 episodes in a very stylish way followed by good songs ,background scores ,action and strong scenesHarshvardhan and pulkit are the new hunks they have really build themselves to look hugeYou got to go for this"}, {"id": 38, "text": "As compare with latest web series like scam 1992 .. Poor performance so. My rating 2/10"}, {"id": 39, "text": "Locations, music, characters, and props brilliant used. Contained it beautifully but didn't like the plot so much. More of punjabi and spoiler brats story but has love, friendship and sincerity within the whole, like the costumes of most of the characters until the whole movie/series(earlier) took other track to the story.Mafia favourite would definitely turn it down."}, {"id": 40, "text": "After long time a good action and family drama movie.but the movie was too long it should b 2 hour maximum.otherwise gove it a 10 star."}, {"id": 41, "text": "Plot is good but lags in the emotional quotient. Though a revenge plot the cat and the mouse thrill is missing. Very sluggish at times with very average music. Some good performances but overall a one time watch kinda movie."}, {"id": 42, "text": "Big fan of nambiar, pulkit and harsh. But movie was not that great just okay. Climax also was below average. Could have made it better last 4 episodes are below expectation."}, {"id": 43, "text": "Harshvardhan Rane is brilliant! He simply steals the show everytime on the screen. Women in the series have very little to contribute. Though I expected sanjeedas character to be more than crying. Her first show of power and then reducing to poor girl."}, {"id": 44, "text": "I just want to say EXCELLENT work by the makers. The actors did a brilliant job in this film Totally Loving this movie."}, {"id": 45, "text": "I am speechless. What a film! What a concept! Zee 5 has done some fabulous job here."}, {"id": 46, "text": "All the boys look stunning. They look strong and amazing together. I totally loved their roles."}, {"id": 47, "text": "Zee5 always come up with interesting contents and films to watch. And now I must a masterpiece has arrived."}, {"id": 48, "text": "It wss very interesting.. initially not interested to watch but as you start watching and after 1st episode the thrill and excitement begin. Very different and unique narrative style with flashback and present link, well shoot location of UK and great story of friendship and revenge"}, {"id": 49, "text": "It's an average film .. good work of cinematography but poor sound"}, {"id": 50, "text": "Worst ever watched till now, bad story line, direction, acting. shame on viewers who gave more then 1 star"}, {"id": 51, "text": "Very-10 bad movie, don't waste your time on this one, full of Punjabi instead of Hindi language, full of rubbish."}, {"id": 52, "text": "I love this series they way director has grip to watch this series and has even have good social messages also"}, {"id": 53, "text": "Finally finded the best of 2020, amazing suspense and thriller."}, {"id": 54, "text": "Acting - 10/10 Music - 9/10 Cinematography - 8/10 Screenplay - 10/10Everything is engaing but end disappoints me but acting keep me hooked till end.Jim Sarbh, Pulkit Samrat and Harshwardhan Rane are damn good."}, {"id": 55, "text": "Taish was so well directed. It was a simple story-line but what made it interesting was the characters, background music and the obscurity manged really well Bejoy. Acting wise, everybody was brilliant except Jim Sarbh. He can't act I don't why he is so highly rated. The surprise package were Harshvardhan Rane, Pulkit Samrat and Saloni Batra. They should get more chances in Bollywood. Negatives: The story isn't something which is unique, it is something that you have watched hundreds of times in Bollywood and Hollywood. No huge twists and turns to make the events more interesting. Very very predictable. Good for a one time watch. Don't expect anything extraordinary from it."}, {"id": 56, "text": "This is the first time that I am writing a review of a movie here but I think it was worth it. Taish is fiery and well-brewed. It will keep you hooked until the very end and songs are incorporated just neatly into scenes where they were needed. Harshvardhan was breathtakingly brilliant."}, {"id": 57, "text": "As bijoy Nambiar is as director of movie direction is overall good ...acting of pulkit, harshvarshan and Jim sarbh worked well in this movie ..cinemetography is weak ... overall one time watch....I like saurabh sachdeva as a new talent (acted in sacred games ) ...."}, {"id": 58, "text": "Good potryal of a revenge story. All characters acted well ."}, {"id": 59, "text": "The storyline of this movie is just amazing and also their acting superb. I really like this movie"}, {"id": 60, "text": "This movie (series!) started on a great note but as it progressed, it lost the plot. Same old story but very loose. Now this is a new trick being followed these days that you convert a movie in a series, increase overall length and get viewers in the disguise of series."}, {"id": 61, "text": "After a very long time a movie that grips you. Outstanding performances and direction. Must Watch."}, {"id": 62, "text": "I Saw Every Movie of Harshvardhan Sir... My Best Movie is - Sanam Teri KasamI Saw This series for Harshvardhan Sir..What A Look &amp; What a Anger Of Her Face..love it The Anger Of Face I Will Shocked..GreatDear, Harshvardhan Sir Why U Don't Do Any Movie.. I Saw All Of Ur Movie.. I And We all Need Movie From U.."}, {"id": 63, "text": "Pulkit steal the show harshwardan also done great vibe in series great web series and jim fantabable."}, {"id": 64, "text": "Worth your time. A revenge drama well enacted, good cinematography, good music and cool stunt sequences. Pulkit Samrat can act 😂😂"}, {"id": 65, "text": "The trailer was actually interesting but the whole movie is just crap. The movie even failed to get the attention in its first half hour.Thought the story would develop somewhat in the last half but that too was disappointing. Decent actors who could have given a good performances but the movie was a letdown."}, {"id": 66, "text": "Modern serial with great actors! They tried to do the serial in a different/new manner and succeeded indeed. This serial got it all and will take you by surprise. I would have given it a 10 if it was polished a tiny bit better, otherwise I have no complaints."}, {"id": 67, "text": "Its a full Harshvardhan and Pulkit show They both are did a fantastic job"}, {"id": 68, "text": "Its a crime thriller.. Revenge story.. filled with emotions.. love stories.. amazing acting.. writing.. screenplay.. characters keep you hooked in to the story.. best to binge watch. You can't expect more.. this is one of the best series or movie in this genre in the recent times."}, {"id": 69, "text": "All you need to know is family first, other things latter. Everything is fair in revenge for family..."}, {"id": 70, "text": "It started out with so much of a suspenseful and realistic fight scene which was acted out in a truly charismatic way. Then slowly the story unraveled going back and forth to the past &amp; present day, in a steady pace explaining the turn of events. It isn't quite what you would expect from a Bollywood film.The cast is purely talented giving life to the roles as if they lived the same way in real life. The emotions and the truth was exceptionally portrayed throughout the movie. It had its fun &amp; romantic aspects with a mixture of seriousness &amp; and brutality.It was an amazing experience watching the movie. I hope Bollywood would make use of this new, pure talent more, than just showcasing people for their family backgrounds."}, {"id": 71, "text": "Brilliant movie and crisp direction. Everyone has done brilliant job with the roles given to them but special shoutout to Harshvardhan rane, pulkit samrat and Saurabh sachdeva."}, {"id": 72, "text": "Despite being a very simple and basic, this film rules because of the dialogue presentation of every character."}, {"id": 73, "text": "Cinematography is decent. I liked the execution which is just perfect according to the plot."}, {"id": 74, "text": "Cinematography is decent. I liked the execution which is just perfect according to the plot."}, {"id": 75, "text": "This film gives me so much relaxation. One of the best films I have ever watched."}, {"id": 76, "text": "It is an amazing film with little heart humour and awesome acting. Enjoyed it!"}, {"id": 77, "text": "Such films make you feel personal where writers pick real, everyday topics and cast the actors. Brilliant stuff!"}, {"id": 78, "text": "This film is a great success to Zee 5. Keep making such kind of simple and realistic series."}, {"id": 79, "text": "In this film, we have witnessed how acting skills can overtake the story. This film is amazing and fun to watch."}, {"id": 80, "text": "I just watched the film and I really appreciate it, a very simple story but touches the heart and can relate its characters to real life."}, {"id": 81, "text": "One of the best rural life they have picturized and amazing plot with portraying the struggle of writers."}, {"id": 82, "text": "This is what India loves to watch. The plot is amazing and very well executed. Brilliant concept!"}, {"id": 83, "text": "It is a masterpiece. Great story writing, dialogue delivery and performances by the semble cast."}, {"id": 84, "text": "It is so relatable and on point. I absolutely loved the film. I wish they come up with the second part too."}, {"id": 85, "text": "Such a beautiful story. A good family watch. We need such stories where the entire family can sit and enjoy. The well done entire team."}, {"id": 86, "text": "After watching the film I realised the fact that focus and dedication are so important in life to achieve something. Inspiring!"}, {"id": 87, "text": "I just finished watching the film. It is a lovely piece of art and very well done by the story writers and artists."}, {"id": 88, "text": "One of the finest films so far made on real rural strugglers of India. Every actor feels real."}, {"id": 89, "text": "A perfect film to sit and enjoy with your family and friends. The content makes everyone laugh."}, {"id": 90, "text": "Another masterpiece on Zee5. It is one of the most inspiring ones I must say. Great job!"}, {"id": 91, "text": "One legend with so many. The content makes the movie a blockbuster. Truly loved and enjoyed watching the film."}, {"id": 92, "text": "The whole ideology behind the film is fantastic. Perfect casting, great concept and stellar performances."}, {"id": 93, "text": "The concept is portrayed and conveyed so well that actually many of us would want some more of it. Great concept!"}, {"id": 94, "text": "One of the finest concepts ever. Great execution and the characters performed amazingly well."}, {"id": 95, "text": "Zee 5 never disappoints its audience. What an inspiring film! I would recommend everyone around me to watch this film."}, {"id": 96, "text": "This movie definitely has loved from all over the world. It couldn't be better and funnier than this."}, {"id": 97, "text": "One of the finest films of Zee 5. It is kicking off the hitbox. Awesome!"}, {"id": 98, "text": "I was eagerly waiting to watch this film. I heard a lot about it and now the trailer. Excited enough!"}, {"id": 99, "text": "What a fun movie to watch. I absolutely loved the idea, concept and the visualisation of the film."}, {"id": 100, "text": "It is an epic movie. The concept is very heart touching. I truly enjoyed it."}, {"id": 101, "text": "I am very excited to watch this film. It's a blockbuster already. I watched the trailer and now will definitely watch the film soon."}, {"id": 102, "text": "Along with being a super hit inspirational and a motivational movie, it is emotional too. Superb!"}, {"id": 103, "text": "This is definitely going in my next watchlist. Thankyou Zee5 for saving my quarantine. Keep creating such contents."}, {"id": 104, "text": "A diverse actor performing on a diverse plot makes it worth watching. Great work on this film."}, {"id": 105, "text": "This film is a masterpiece. Very well executed and the concept is very relatable to the people who have struggled in life."}, {"id": 106, "text": "An extraordinary one! Stellar performances and an intense film with such talented actors. Good work!"}, {"id": 107, "text": "The entire team has put some real efforts to impact such a great and inspiring film out there."}, {"id": 108, "text": "This man makes everything so realistic that you can't believe it's a film on the screen going on. Awesome!"}, {"id": 109, "text": "I am speechless. What a film! What a concept! Zee 5 has done some fabulous job here."}, {"id": 110, "text": "I can watch this on repeat. The song is brilliant and I absolutely loved the concept they have executed."}, {"id": 111, "text": "The stylish production is packed with songs and has been slickly shot by Harshvir Oberai."}, {"id": 112, "text": "Shaikh and Batra are among the better performers in a production that unwisely places histrionic demands on far too many cast members."}, {"id": 113, "text": "A surprise guest at one of the pre-wedding functions jolts Rohan so badly that he has a panic attack."}, {"id": 114, "text": "Taish has been released on Zee5 both as a film as well as a six-episode series. Too muvh love!"}, {"id": 115, "text": "The story, by Nambiar, revolves around a bunch of aggressive and angry people."}, {"id": 116, "text": "Taish's writing is well complemented by the spectrum of moods and understated emotions."}, {"id": 117, "text": "Taish the film though starts with a human being whose pain is poignant"}, {"id": 118, "text": "ZEE5 is launching writer-director Bejoy Nambiar's Taish in two versions: a six-part mini-series."}, {"id": 119, "text": "The OTT space is still thirsting for a good creative eye and the cinematography on this one doesn't disappoint."}, {"id": 120, "text": "Pali, unlike others, gets dedicated scenes to convey the cause and effects of his actions."}, {"id": 121, "text": "Watching an action sequence unfold in a washroom, it is hard not to think of Mission Impossible."}, {"id": 122, "text": "'Taish' is visually engaging, but leaves you wanting more."}, {"id": 123, "text": "The content is commendable and I could watch it 100 times more."}, {"id": 124, "text": "Pulkit Samrat's put in some serious efforts to render justice to Sunny's trauma-fuelled anger."}, {"id": 125, "text": "The execution and storytelling technique is amazing with a climax that have taken the viewers by total surprise."}, {"id": 126, "text": "'Taish' is timely, stylish and has an important life lesson to impar. Absolutely loved it."}, {"id": 127, "text": "Harshvir Oberai's cinematography is commendable and so is Gaurav Godkhindi's background music."}, {"id": 128, "text": "Unique story - well paced and incredible performances. Harshavrdhan looked fully prepared to justify his role as a mobster. Overall storyline and characters looked real to life."}, {"id": 129, "text": "Amazing acting ... Amazing acting... Amazing direction... Amazing story"}, {"id": 130, "text": "Just watched it for harshvardhan rane with less expectations.But man the direction ,music &amp; all cast members Jim sarbh, pulkith ,Kriti , Shaheen ,the people whom played Suki , mahi , sonaber have did an exceptional job .It's different kind of attempt which will make you wanting more .I being a South Indian have fallen in love with Pali character , the way harsh delivers punjabi dialogue , his intense eyes ,his character is so good . Don't know why all these members don't get enough work . The music is another strong point of movie , no remakes nothing , just pure class . WISHED IT WOULD HAVE RELEASED IN THEATRES or at least some good ott like Netflix or Disney+ .But nevertheless just don't miss it guys"}, {"id": 131, "text": "Amazingly made, all actors are awesome. Pulkit Samrat and Harshavardhan Rane are superb,"}, {"id": 132, "text": "Proud to be Harshavardhan fan..Superb acting..Good Movie!"}, {"id": 133, "text": "This movie is totally awesome.We have many things to learn from this movie.I personally learned many things in my life &amp; all those things are very clear in this movie. It's a total view of our life. I HAVE JUST cried. Totally awesome .And At last Indian web series are becoming more popular &amp; awesome day by day. Keep it up"}, {"id": 134, "text": "I liked it, must watch. All the characters did justice to their roles, glad we are getting such things on Zee5."}, {"id": 135, "text": "The dialogue was energetic. Plot creation is good. Comedy Couple is an overall full package of love, hate, drama and romance."}, {"id": 136, "text": "Comedy Couple is a must watch film. I love the story. I am already recommending my friends to watch this film now."}, {"id": 137, "text": "Zee5 has again nailed it. What an amazing movie. The story, romance, direction and the concept is brilliant."}, {"id": 138, "text": "The performances of all the actors are so well. Comedy Couple is a must watch film. It has all the romance, drama and fight."}, {"id": 139, "text": "The background music in the emotional scenes worked like magic. The film Comedy film is a super fantastic film, it's a super hit."}, {"id": 140, "text": "This film is a masterpiece. Very well executed and the concept is very relatable to the people"}, {"id": 141, "text": "An extraordinary one! Stellar performances and an intense film with such talented actors. Good work!"}, {"id": 142, "text": "The entire team has put some real efforts to impact such a great and inspiring film out there."}, {"id": 143, "text": "These men make everything so realistic that you can't believe it's a film on the screen going on. Awesome!"}, {"id": 144, "text": "I can watch this on repeat. The song is brilliant and I absolutely loved the concept they have executed."}, {"id": 145, "text": "This film has definitely inspired many of us. The idealogy behind the concept is amazing."}, {"id": 146, "text": "I was very excited to watch this amazing cast to perform their excellence on the screen."}, {"id": 147, "text": "The concept is portrayed and conveyed so well that actually many of us would want some more of it. Great concept!"}, {"id": 148, "text": "One of the finest concepts ever. Great execution and the characters performed amazingly well."}, {"id": 149, "text": "Zee 5 never disappoints its audience. What an inspiring film! I would recommend everyone around me to watch this film."}, {"id": 150, "text": "The trailer is brilliant itself that it gives you a feeling to watch the film. I am excited about the film after watching the trailer."}, {"id": 151, "text": "This movie gives absolute peace to my heart watching these boys giving brilliant and stellar performances."}, {"id": 152, "text": "One of the finest films of Zee 5. It is kicking off the hitbox. Awesome!"}, {"id": 153, "text": "The concept is really beautiful and it was very necessary to speak on. It is also portrayed well."}, {"id": 154, "text": "This is a film which you can watch with your friends and get entertained. Loved it!"}, {"id": 155, "text": "It's a hit. Superhit one. Full packed entertainment, drama, thrill and mysterious film."}, {"id": 156, "text": "The concept is really good and beautiful. The plot is amazing along with its execution of the film."}, {"id": 157, "text": "The content is precise and much needed. The actors performed well. It's a package of a hit."}, {"id": 158, "text": "Outstanding! This film is a good watch for me. The concept seems organic and natural."}, {"id": 159, "text": "I like the fact that how hot and stunning the boys look. The film itself is a powerful one."}, {"id": 160, "text": "Quite intensive I must say. What suspense they have held all the way! Gets more and more interesting."}, {"id": 161, "text": "The film is excellent. The plot is good. The actors are perfect. In short, it's a perfect 2-hour watch."}, {"id": 162, "text": "I could see such hardworking and supremely talented actors performing so well. Loved the film."}, {"id": 163, "text": "OMG! Ever since I watched the trailer I was eagerly waiting for this one and finally, I watched it."}, {"id": 164, "text": "I prefer watching such films as I love drama, action and crime thriller based films. Loved this one."}, {"id": 165, "text": "I think we all should watch this film, share it and support these amazingly talented actors."}, {"id": 166, "text": "You become more matured when you watch such interesting and high level of films. Good job!"}, {"id": 167, "text": "I just watched the film and it was so much fun to watch. Also, I got goosebumps on in the end."}, {"id": 168, "text": "The film turns into an emotional roller coaster ride after a few scenes which seems amazing."}, {"id": 169, "text": "I found the film quite interesting. Its has everything a perfect viewer could expect for. Great one!"}, {"id": 170, "text": "The storyline of the film is on the point. It is not even less or more, it's just perfect. Good job to the team."}, {"id": 171, "text": "I have never been so entertained. The dialogues and punchlines are on point. Enjoyed to the fullest."}, {"id": 172, "text": "The film has captured my attention. I think when I watched this movie I found it quite powerful."}, {"id": 173, "text": "A story that endures love and their love, families and values are put in a test. I loved it."}, {"id": 174, "text": "Amazing one! It's a brilliant film I must say. Great concept and execution. Good job!"}, {"id": 175, "text": "The plot is really good. It entertains you to the core. You can't hold onto your breath as its so mysterious."}, {"id": 176, "text": "You get drama, brutality, suspence, emotions, everything in a pack of film. I genuinely loved it."}, {"id": 177, "text": "The entire team has put some real efforts to impact such a great and inspiring film."}, {"id": 178, "text": "These men make everything so realistic that you can't believe it's a film on the screen going on. Awesome!"}, {"id": 179, "text": "I am speechless. What a film! What a concept! Zee 5 has done some fabulous job here."}, {"id": 180, "text": "I can watch this on repeat. The song is brilliant and I absolutely loved the concept they have executed."}, {"id": 181, "text": "This film has definitely inspired many of us. The idealogy behind the concept is amazing."}, {"id": 182, "text": "I was very excited to watch this amazing cast to perform their excellence on the screen."}, {"id": 183, "text": "The concept is portrayed and conveyed so well that actually many of us would want some more of it. Great concept!"}, {"id": 184, "text": "One of the finest concepts ever. Great execution and the characters performed amazingly well."}, {"id": 185, "text": "Zee 5 never disappoints its audience. What an inspiring film! I would recommend everyone around me to watch this film."}, {"id": 186, "text": "The trailer is brilliant itself that it gives you a feeling to watch the film. I am excited about the film after watching the trailer."}, {"id": 187, "text": "This movie gives absolute peace to my heart watching these guys giving brilliant and stellar performances."}, {"id": 188, "text": "One of the finest films of Zee 5. It is kicking off the hitbox. Awesome!"}, {"id": 189, "text": "The concept is really beautiful and it was very necessary to speak on. It is also portrayed well."}, {"id": 190, "text": "All the boys look stunning. They look strong and amazing together. I totally loved their roles."}, {"id": 191, "text": "Zee5 always come up with interesting contents and films to watch. And now I must a masterpiece has arrived."}, {"id": 192, "text": "This is a film which you can watch with your friends and get entertained. Loved it!"}, {"id": 193, "text": "It's a hit. Superhit one. Full packed entertainment, drama, thrill and mysterious film."}, {"id": 194, "text": "The concept is really good and beautiful. The plot is amazing along with its execution of the film."}, {"id": 195, "text": "The content is precise and much needed. The actors performed well. It's a package of a hit."}, {"id": 196, "text": "Outstanding! This film is a good watch for me. The concept seems organic and natural."}, {"id": 197, "text": "Quite intensive I must say. What suspense they have held all the way! Gets more and more interesting."}, {"id": 198, "text": "The film is excellent. The plot is good. The actors are perfect. In short, it's a perfect 2-hour watch."}, {"id": 199, "text": "I could see such hardworking and supremely talented actors performing so well. Loved the film."}, {"id": 200, "text": "OMG! Ever since I watched the trailer I was eagerly waiting for this one and finally, I watched it."}, {"id": 201, "text": "I prefer watching such films as I love drama, action and crime thriller based films. Loved this one."}, {"id": 202, "text": "I think we all should watch this film, share it and support these amazingly talented actors."}, {"id": 203, "text": "Watching this feels real. I am a writer and I may relate to this film a lot. Great work is done here."}, {"id": 204, "text": "This film has saved my quarantine. I am happy that I decided to watch this film. Totally enjoyed it."}, {"id": 205, "text": "All the characters make you feel that you are a part of it. So natural and real."}, {"id": 206, "text": "I loved the film. I was waiting for the film to get released ever since I watched the trailer."}, {"id": 207, "text": "This film is too motivational. All the characters make you inspire and lets you enjoy the movie."}, {"id": 208, "text": "The delivery of the film is very smooth, natural and realistic. Good concept!"}, {"id": 209, "text": "Amazing one! It's a brilliant film I must say. Great concept and execution. Good job!"}, {"id": 210, "text": "The plot is really good. It inspires you to the core. You can't hold onto your breath as its so inspiring."}, {"id": 211, "text": "You get drama, humour, emotions, everything in a pack of film. I genuinely loved it."}, {"id": 212, "text": "Just watch the trailer. This is definitely my next watch! This is going into my watchlist."}, {"id": 213, "text": "What a fil it was! This film truly deserves to be a hit with tons of appreciation. So real!"}, {"id": 214, "text": "Outstanding! The best thing is it's kept very natural and it connects to someone who wants to achieve something in life."}, {"id": 215, "text": "It's a hit. As far as I can see it is the most loved movie by the audience."}, {"id": 216, "text": "I just watched the trailer. It's a masterpiece! The concept is raw and natural. Quite a worth watch!"}, {"id": 217, "text": "This is something extraordinary. One can never regret to watch the film. I am definitely recommending this film to my friends."}, {"id": 218, "text": "This film motivates especially the youngsters who are struggling towards their dreams."}, {"id": 219, "text": "The other day I and my friends binge-watched this film and we and amazing time together. This film entertained us."}, {"id": 220, "text": "I found it a very heart touching, funny and realistic film. I totally had fun watching this film."}, {"id": 221, "text": "I want to appreciate more the authenticity of the landscape a rightful portrayal of the characters."}, {"id": 222, "text": "I watch the film with my family and it was a great time as the film was so enjoyable to watch."}, {"id": 223, "text": "There is something in this film that's so enduring and lovely. The characters look are brilliant."}, {"id": 224, "text": "I genuinely liked the concept. Its is inspiring and a very light film. Awesome!"}, {"id": 225, "text": "Binge watched the film. Everyone has acted so well. It is warm and nice to spare some time to watch this film."}, {"id": 226, "text": "So raw and real. I am in love with this film. Super entertaining and fun to watch. Good job!"}, {"id": 227, "text": "A must watch. Also, for the first time, I have seen a film where the entire cast members have equal prominence. Well done Zee5!"}, {"id": 228, "text": "This film is quite easy going and is loaded with simple dilemmas. The concept says it all."}, {"id": 229, "text": "This story seems to be rooted in rural India. The character is realistic with great performances."}, {"id": 230, "text": "I just watched the film. I was blown away by a very simple, elegant, natural and authentic film. Great work!"}, {"id": 231, "text": "I loved every bit of simplicity, humour and drama. It is very well written and performed."}, {"id": 232, "text": "This is a very good movie and mostly I liked the fact that it is very relatable to your life."}, {"id": 233, "text": "I literally got goosebumps watching this film. Definitely, a must-watch content."}, {"id": 234, "text": "Despite being a very simple and basic, this film rules because of the dialogue presentation of every character."}, {"id": 235, "text": "One of the most refreshing shows that I've watched in recent times. Wonderful!"}, {"id": 236, "text": "Cinematography is decent. I liked the execution which is just perfect according to the plot."}, {"id": 237, "text": "This film gives me so much relaxation. One of the best films I have ever watched."}, {"id": 238, "text": "It is an amazing film with little heart humour and awesome acting. Enjoyed it!"}, {"id": 239, "text": "Such films make you feel personal where writers pick real, everyday topics and cast the actors. Brilliant stuff!"}, {"id": 240, "text": "This film is a great success to Zee 5. Keep making such kind of simple and realistic series."}, {"id": 241, "text": "In this film, we have witnessed how acting skills can overtake the story. This film is amazing and fun to watch."}, {"id": 242, "text": "I just watched the film and I really appreciate it, a very simple story but touches the heart and can relate its characters to real life."}, {"id": 243, "text": "One of the best rural life they have picturized and amazing plot with portraying the struggle of writers."}, {"id": 244, "text": "What a simple film! It is very simple but it has magic which holds you to watch till the end."}, {"id": 245, "text": "This is what India loves to watch. The plot is amazing and very well executed. Brilliant concept!"}, {"id": 246, "text": "It is a masterpiece. Great story writing, dialogue delivery and performances by the semble cast."}, {"id": 247, "text": "It is so relatable and on point. I absolutely loved the film. I wish they come up with the second part too."}, {"id": 248, "text": "After watching the film I realised the fact that focus and dedication are so important in life to achieve something. Inspiring!"}, {"id": 249, "text": "I just finished watching the film. It is a lovely piece of art and very well done by the story writers and artists."}, {"id": 250, "text": "One of the finest films so far made on real rural strugglers of India. Every actor feels real."}, {"id": 251, "text": "A perfect film to sit and enjoy with your family and friends. The content makes everyone laugh."}, {"id": 252, "text": "This self-motivated movie has raised the bars of expectations now. Awaiting for more such great contents."}, {"id": 253, "text": "Another masterpiece on Zee5. It is one of the most inspiring ones I must say. Great job!"}, {"id": 254, "text": "One legend with so many. The content makes the movie a blockbuster. Truly loved and enjoyed watching the film."}, {"id": 255, "text": "The whole ideology behind the film is fantastic. Perfect casting, great concept and stellar performances."}, {"id": 256, "text": "This film is very appreciable due to the significant conceptualization and directions of the film."}, {"id": 257, "text": "The film is emotional and an inspiring one at the same time. It touches your heart. The concept is breathtaking!"}, {"id": 258, "text": "The concept is portrayed and conveyed so well that actually many of us would want some more of it. Great concept!"}, {"id": 259, "text": "One of the finest concepts ever. Great execution and the characters performed amazingly well."}, {"id": 260, "text": "Zee 5 never disappoints its audience. What an inspiring film! I would recommend everyone around me to watch this film."}, {"id": 261, "text": "This movie definitely has loved from all over the world. It couldn't be better and funnier than this."}, {"id": 262, "text": "One of the finest films of Zee 5. It is kicking off the hitbox. Awesome!"}, {"id": 263, "text": "I was eagerly waiting to watch this film. I heard a lot about it and now the trailer. Excited enough!"}, {"id": 264, "text": "What a fun movie to watch. I absolutely loved the idea, concept and the visualisation of the film."}, {"id": 265, "text": "It is an epic movie. The concept is very heart touching. I truly enjoyed it."}, {"id": 266, "text": "I am very excited to watch this film. It's a blockbuster already. I watched the trailer and now will definitely watch the film soon."}, {"id": 267, "text": "Along with being a super hit inspirational and a motivational movie, it is emotional too. Superb!"}, {"id": 268, "text": "This is definitely going in my next watchlist. Thankyou Zee5 for saving my quarantine. Keep creating such contents."}, {"id": 269, "text": "A diverse actor performing on a diverse plot makes it worth watching. Great work on this film."}, {"id": 270, "text": "This film is a masterpiece. Very well executed and the concept is very relatable to the people who have struggled in life."}, {"id": 271, "text": "An extraordinary one! Stellar performances and an intense film with such talented actors. Good work!"}, {"id": 272, "text": "The entire team has put some real efforts to impact such a great and inspiring film out there."}, {"id": 273, "text": "This man makes everything so realistic that you can't believe it's a film on the screen going on. Awesome!"}, {"id": 274, "text": "I am speechless. What a film! What a concept! Zee 5 has done some fabulous job here."}, {"id": 275, "text": "I can watch this on repeat. The song is brilliant and I absolutely loved the concept they have executed."}, {"id": 276, "text": "TAISH is the story of two families who end up destroying each other."}, {"id": 277, "text": "Interesting! The only memorable is Saurabh Sachdeva as Pali's menacing brother."}, {"id": 278, "text": "The stylish production is packed with songs and has been slickly shot by Harshvir Oberai."}, {"id": 279, "text": "Shaikh and Batra are among the better performers in a production that unwisely places histrionic demands on far too many cast members."}, {"id": 280, "text": "A surprise guest at one of the pre-wedding functions jolts Rohan so badly that he has a panic attack."}, {"id": 281, "text": "Taish has been released on Zee5 both as a film as well as a six-episode series. Too muvh love!"}, {"id": 282, "text": "The story, by Nambiar, revolves around a bunch of aggressive and angry people."}, {"id": 283, "text": "Taish's writing is well complemented by the spectrum of moods and understated emotions."}, {"id": 284, "text": "Taish the film though starts with a human being whose pain is poignant"}, {"id": 285, "text": "ZEE5 is launching writer-director Bejoy Nambiar's Taish in two versions: a six-part mini-series."}, {"id": 286, "text": "The OTT space is still thirsting for a good creative eye and the cinematography on this one doesn't disappoint."}, {"id": 287, "text": "One of Taish's strong points is how stunning it looks. I was in love with it."}, {"id": 288, "text": "Wow! The show opens with Pulkit breaking a man's skull in the toilet with a dislodged washbasin."}, {"id": 289, "text": "Taish is about men, their rage and how it brings about the end of all that is good."}, {"id": 290, "text": "Taish is made for an entertaining watch on the perils of unbridled rage."}, {"id": 291, "text": "Bejoy Nambiar's action-thriller with Harshvardhan Rane, Pulkit Samrat and Jim Sarbh is visually stunning."}, {"id": 292, "text": "Bejoy Nambiar brings thrill and style back to OTT in one of Zee5's better offerings."}, {"id": 293, "text": "The only thing that still shines through is Nambiar's love for the visual medium"}, {"id": 294, "text": "By hinting at themes like anger, revenge, action and consequences, Taish shows great ambition."}, {"id": 295, "text": "Pali, unlike others, gets dedicated scenes to convey the cause and effects of his actions."}, {"id": 296, "text": "The lead characters -Jim Sarbh's Rohan, Pulkit Samrat's Sunny, Harshvardhan Rane's Pali and Ankur Rathee's Krish - all come with their baggage."}, {"id": 297, "text": "Taish's failure lies in its inability to exploit one of the luxuries afforded by the medium."}, {"id": 298, "text": "Watching an action sequence unfold in a washroom, it is hard not to think of Mission Impossible."}, {"id": 299, "text": "'Taish' is visually engaging, but leaves you wanting more."}, {"id": 300, "text": "The content is commendable and I could watch it 100 times more."}, {"id": 301, "text": "The star cast comprises beautiful people and that sexy London weather only adds to the film's charm."}, {"id": 302, "text": "Pulkit Samrat's put in some serious efforts to render justice to Sunny's trauma-fuelled anger."}, {"id": 303, "text": "The execution and storytelling technique is amazing with a climax that have taken the viewers by total surprise."}, {"id": 304, "text": "'Taish' is timely, stylish and has an important life lesson to impar. Absolutely loved it."}, {"id": 305, "text": "Harshvir Oberai's cinematography is commendable and so is Gaurav Godkhindi's background music."}, {"id": 306, "text": "Its is really bad.. First 2 episodes can be thought of as setting the premise but when you see the plot it really is nothing interesting to be stretched over 5 episodes. The parallel story of the gangster family adds no value to the story not even 1 bit. Harshvardhan is playing his quintessential role of an angry male in love with a girl. The actors are good, the story is bad. Save your time skip this one"}, {"id": 307, "text": "A very nice plot plus great actors. They performed their roles nicely. It was really fun from starting. Though ending could have been nice."}, {"id": 308, "text": "Harshvardhan Rane and Sanjeeda Sheikh looked hot together. I like their sizzling chemistry and their love story."}, {"id": 309, "text": "I wish I could enjoy this movie more. I guess six episodes are not enough. Revenge is so powerful in Taish."}, {"id": 310, "text": "Who doesn't enjoy thriller films? Do watch the thriller film Taish. Harshvardhan Rane is super hot and super energetic in the film."}, {"id": 311, "text": "Totally nailed it, the actors, the film, the makers, the location and the background music. It is a BLOCKBUSTER Film."}, {"id": 312, "text": "Taish is full with Lovely songs, intense story and thriller. Taish is really a good film with a unique story."}, {"id": 313, "text": "Taish actors should get an award for their brilliant performance in the film. I really love the background music."}, {"id": 314, "text": "SUPER FANTASTIC FILM. Bejoy Nambiar, you nailed it again. What an amazing direction and story."}, {"id": 315, "text": "I can't even imagine that ZEE5 has really released an intense film like Taish. This film is totally a breath taker."}, {"id": 316, "text": "Taish is super hit film with great action scenes and the lead actors are so real with their acting skills. Great Job Makers"}, {"id": 317, "text": "Taish is directed by Bejoy Nambiar, he did a master work. I like this movie and all the lead actors have worked really hard."}, {"id": 318, "text": "I am already planning to watch Taish again with my friends. We love an action thriller film. Superhit film."}, {"id": 319, "text": "Taish is a super energetic film with all thrillers required. The background music is on point and location is nice."}, {"id": 320, "text": "Jahaan's role is played by Sanjeeda Sheikh and she looked so hot and sizzling. It's a thriller film, one should watch it."}, {"id": 321, "text": "If you love action, thriller, revenge then you must watch this film Taish on ZEE5. Taish has a unique story and a really good one."}, {"id": 322, "text": "Every single actor did amazing in the film. The lead and the supporting actors know their job so well. Wow, perfect film."}, {"id": 323, "text": "A passionate love story and full action, dialogue delivery just perfect. Pali's role was super hit in the film Taish."}, {"id": 324, "text": "Fantastic. I have no words to express my actual feeling for this film. It's like handling the power and revenge together."}, {"id": 325, "text": "Taish is a story of revenge. A unique story concept and the direction is totally unbelievable. I liked this film a lot."}, {"id": 326, "text": "Great Story, Great Song and the Really Great Actors of Taish. The makers of the film should already start making another part."}, {"id": 327, "text": "Pali was the heart of all the episodes. He shows a different type of temper in every episode of Taish. Harshvardhan You Nailed it."}, {"id": 328, "text": "Aarfa Khan, you are so gorgeous and you have done a brilliant acting in the film Taish. You did justice with your role."}, {"id": 329, "text": "ZEE5 subscription is really worth taking. Taish is an incredible movie,Love the concept and the dialogue delivery of the film."}, {"id": 330, "text": "I am happy with the actor's performances and the film Taish. I will really recommend everyone to watch this film."}, {"id": 331, "text": "Bengali and Punjabi language just added a new flavour to the film. I really like the idea of using multiple languages."}, {"id": 332, "text": "Re Bawree is a nice song and I can listen to it again and again? Taish is already a Super hit Film with great actors."}, {"id": 333, "text": "The story line is powerful. The lead actors Harshvardhan Rane, Pulkit Samrat really did a wonderful job in the film."}, {"id": 334, "text": "This film has 6 six episodes and every episode is equally interesting and great. I love the story idea of Taish."}, {"id": 335, "text": "Jim Sarbh is such a nice actor. His acting skill doesn't need an introduction and the same he proved in the film Taish."}, {"id": 336, "text": "Taish is really a wonderful movie. This type of story is usually, I have never seen in Bollywood films. Great Work."}, {"id": 337, "text": "Pulkit Samrat looks like a chocolate boy and in this he looked like a rowdy. He did well and really a good movie."}, {"id": 338, "text": "If you are looking for an action film with little hint of love story and drama, then must watch Taish on ZEE5."}, {"id": 339, "text": "Action, Revenge, love, lust and the actors are so good in this film. I have recommended my friends and family to watch it."}, {"id": 340, "text": "Harshvardhan Rane, you are the new crush of all girls. Your comeback with Taish is really impressive. Love"}, {"id": 341, "text": "Extremely good film. Every episode of this film has some new story to tell. The direction of Taish is amazingly executed."}, {"id": 342, "text": "Lead Actors have really done superior class work. Their acting skills and the story is totally worth watching."}, {"id": 343, "text": "A quality film, totally worth watching. Taish is highly recommended to watch, the locations are too beautiful in the film."}, {"id": 344, "text": "The friendship of Rohan and Sunny is so enjoyable. Great Storyline with perfect background music. Fantastic."}, {"id": 345, "text": "Sanjeeda Sheikh , I love your eyes. You look super hot and sexy in the film Taish. You looked so beautiful and did well."}, {"id": 346, "text": "An extraordinary performance by Harshvardhan Rane, he shows his multiple sides in the film like the anger, the sad lover."}, {"id": 347, "text": "Viewers should demand another part of Taish. I am craving more of it. The film is super energetic and super nice."}, {"id": 348, "text": "Bejoy Nambiar's work is always nice and we can see that by his work with Taish. How well he executed this film is appreciable."}, {"id": 349, "text": "Taish is a powerful film; the name itself explained it all. Tremendous work by the actors and the makers. SUPERHIT"}, {"id": 350, "text": "What a wonderful film. The lead actors just nailed it. Taish should be watched by everyone. Great Movie."}, {"id": 351, "text": "Incredible work by the makers of the Taish. Every single thing of this film is at its pace, the story, the concept just wow."}, {"id": 352, "text": "Taish is super terrific. Harshvardhan Rane and Jim Sarbh added some real value to their characters. Loved it."}, {"id": 353, "text": "The dialogues and dialogue delivery is breathtaking. The film is full of action and the story of Taish is quite nice."}, {"id": 354, "text": "A unique kind of revenge story with tadka of action and a love story. I love all the songs and actors of the film Taish."}, {"id": 355, "text": "Zoa Morani, Neha Sharma and Ankur Rathee all are amazing. Their supporting role in the film just balanced the story."}, {"id": 356, "text": "Bejoy Nambiar, we really like your direction. Taish is really a masterpiece of your all work. Superbly plotted."}, {"id": 357, "text": "TAISH IS ALREADY A HIT FILM. I am sure Taish has won the hearts of millions of viewers. It is a blast."}, {"id": 358, "text": "Passion, Power and Pyar with some action and revenge motive, overall a new concept with a great story."}, {"id": 359, "text": "The trailer of the film was so intense and now the film, OMG. Taish is a super hit film. Amazing Movie."}, {"id": 360, "text": "My colleagues asked me to watch this film and I am glad he did that. I enjoyed all the episodes, every character looked so intense."}, {"id": 361, "text": "I didn't move anywhere; I watched all the episodes of the film all together. The story is so interesting and you cannot leave it in the middle."}, {"id": 362, "text": "I am recommending this film to everyone. No doubt ZEE5 has again done a great job for releasing a film like Taish."}, {"id": 363, "text": "The story shows the passion of men and women both. The direction of this film is superb. Taish is a must watch film."}, {"id": 364, "text": "I enjoyed the role of all the lead actors i.e. Pulkit Samrat, Jim Sarbh, and most specially Harshvardhan Rane."}, {"id": 365, "text": "Taish is an action film; everyone is seeking revenge in the film. An intense film story with great lead actors."}, {"id": 366, "text": "Jim Sarbh is such an excellent actor; he knows how to charm his audience. He looked so cool and he also enjoyed his role in Taish."}, {"id": 367, "text": "I feel so emotional; all the songs are too good. The story is so good. Kriti Kharbanda looked so beautiful and she has decency with her acting skills."}, {"id": 368, "text": "Saurabh Sachdeva did so well as a supporting actor. The movie is fantastic. I love the background music of the film."}, {"id": 369, "text": "Harshvardhan Rane you looked super hot in the film and you actually just nailed your performance through the whole film."}, {"id": 370, "text": "Taish is a super hit film, you will enjoy all the 6 episodes. I really like the action and the story of the film."}, {"id": 371, "text": "The bikes, cars, a high society family goes so well with the story. It has love, romance, anger, lust and power. Liked It."}, {"id": 372, "text": "This film is full of action, revenge and multi kind of emotions. I love this action film Taish, locations are too good."}, {"id": 373, "text": "This movie should be a blockbuster. An epic action film with full action, love, hate and friendship. WOW amazing one."}, {"id": 374, "text": "A passionate and super energetic film. The Taish actor's did fantastic work in their respective roles. Full marks."}, {"id": 375, "text": "ZEE5 again gained my vote. Taish is the perfect action film full of suspense, drama, and thriller. Super hit."}, {"id": 376, "text": "Revenge is always bad. Taish is a story of two families who are running after revenge. The direction of this film is awesome."}, {"id": 377, "text": "A hint of Bengali culture, Punjabi language, Hindi- English dialogues. I felt that it's a mixture of many languages in one film."}, {"id": 378, "text": "The background music and songs are totally good. I love the story concept and location was too good in the film."}, {"id": 379, "text": "Fantastic Film! Every episode has something new to reveal. Suspense and full of action. The lead actors did great."}, {"id": 380, "text": "My best friend recommended this film Taish to watch on priority. I watched it and fell in love with the direction and the acting skills."}, {"id": 381, "text": "Taish is full of different couple's stories. Harshvardhan, Jim, Krish everyone has their own love story. Overall I liked it."}, {"id": 382, "text": "TAISH should be a blockbuster. I love the story and the concept is too good. The director and makers have done excellent work."}, {"id": 383, "text": "I watched this film last weekend and I have already planned to watch all the episodes of Taish this weekend."}, {"id": 384, "text": "I love the concept of the story. Basically It's about revenge but overall it has all emotions of love, care, friendship."}, {"id": 385, "text": "Taish is a super hit film already. It has an Intense from start to finish with terrific music &amp; stylish execution"}, {"id": 386, "text": "Harshvardhan Rane worked so well in the film. His comeback in the film Taish is superb. He nailed it."}, {"id": 387, "text": "Taish is a wonderful action movie. The characters of the film looked so good and their acting was out of the box."}, {"id": 388, "text": "Taish is a super hit energetic film. This movie just made my weekend. Every episode of this film is a total hit. Story is totally updated."}, {"id": 389, "text": "Soundtrack, Cinematography direction, Editing and the story line is just awesome in the film. Taish is a super hit film."}, {"id": 390, "text": "The actions are great. Highly recommended movie and the direction of the film. Harshvardhan has performed so well in the film."}, {"id": 391, "text": "I just completed watching the series TAISH which is a super energetic and emotional ride. I love this film."}, {"id": 392, "text": "Location of this film is beautiful, the fun of Pulkit and Harshvardan on the boat scene was totally enjoyable. The revenge is new in this film."}, {"id": 393, "text": "Harshvardhan Rane did a fantastic performance in the film Taish. Taish is a film of revenge, suspense and full action."}, {"id": 394, "text": "A must watch from Bejoy Nambiar. The movie is very engaging. I watched the film with my roommate. We loved it."}, {"id": 395, "text": "Taish is a great movie; really everyone was superb in the movie. The performance, the direction and the skill is totally worth watching."}, {"id": 396, "text": "Taish is totally worth watching. It is up to expectation, strong acting, emotional &amp; good music makes it perfect."}, {"id": 397, "text": "Taish has all the concepts of Intense, Raw, Violent, and Gory. An edge of the seat thriller keeps you hooked."}, {"id": 398, "text": "TAISH is a Mind-blowing film. The lead actors have done fantastic work in the film. The story line is totally intense."}, {"id": 399, "text": "I really like the film, it has a unique concept. Locations are nice and the background theme of the story suits well."}, {"id": 400, "text": "Fantastic thriller movie. These actors did a great job. Makers should have given all the heart in the film 'Taish.'"}, {"id": 401, "text": "Good movie. Worth watching with strong performances from all. Taish is a super fantastic film. Recommended to watch"}, {"id": 402, "text": "Unique style story lineup. First class acting of Harshvardhan rane, Pulkit Samrat. Taish is a Masterpiece movie."}, {"id": 403, "text": "Taish a revenge story. Most conversations are in Punjabi language. Actors have really performed well. Loved t"}, {"id": 404, "text": "After so long, we have one intense film with mind-blowing acting i.e. Taish. The role of the actors in the film is a great suspense and thriller story."}, {"id": 405, "text": "Taish is an incredible movie. Great cast and great direction. Harshvardhan has nailed the role and performed well in the film."}, {"id": 406, "text": "A must watch film, The actors did a great work in the film of web series. Bejoy Nambiar's direction in this film is beyond imagination."}, {"id": 407, "text": "Comeback of Harshvardhan Rane is totally fantastic. The story and the concept is totally worth watching. Zee5 subscription is worth taking."}, {"id": 408, "text": "All actors have been perfect throughout &amp; specially Surabh Sachdeva in the film Taish. This film is a super hit."}, {"id": 409, "text": "Style, thrill, great music and power packed action with great performances. Harshvardhan's role was superb in the film."}, {"id": 410, "text": "Taish is a full entertainer. My weekend was totally sorted. The actors performed so well in the series. Film was a super hit."}, {"id": 411, "text": "Best work of Bejoy Nambiar till date. The thrilling story has a lot of suspense, the background music is superb with the locations."}, {"id": 412, "text": "I love the performance of all the actors. Already recommending to many friends to watch this film, it has a great concept."}, {"id": 413, "text": "Sanjeeda Sheikh and Kriti Kharbanda looked glamorous in the film Taish. The direction of the film is nice. Loved it"}, {"id": 414, "text": "Sunny is one of the important characters of the film Taish cast. All the actors of the film did so well in it. Super hit"}, {"id": 415, "text": "Harshvardhan Rane and Sanjeeda Sheikh looked so good together. They both have a sizzling chemistry and emotional situation."}, {"id": 416, "text": "Taish has already won the hearts of millions of viewers. It is a super hit film, with great acting and storyline."}, {"id": 417, "text": "An intensive film with solid action. The actors performed so nice and they also looked so good in the whole film."}, {"id": 418, "text": "Acting and direction at its best. Harshvardhan and Kriti are amazing."}, {"id": 419, "text": "It's a great visual treat, almost flawless... Great soundtracks.. Casting is too crisp and perfect... The larger then life kalli is very innocent and you'll love him...I think taish is a great Indian thriller it refined the whole genre for the good... Direction is absolutely perfect... Last but not least I m in love with the locations."}, {"id": 420, "text": "Great casting but not great actors . Cheap dialogue delivery with no emotions. Bad story writing and direction. I don't why this was named under thriller and don't get me started on punjabi accent. Waste of time . Don't know what I was thinking."}, {"id": 421, "text": "Taish is a great film. Do watch this film. Maker's hats off to your work and the actor's performances in the film are totally excellent."}, {"id": 422, "text": "I loved this thriller, suspense and energetic film. Taish is a super hit film. The concept is totally great with a new theme and unique concept."}, {"id": 423, "text": "It's all about taking revenge in the film Taish. The lead actors are too good and their performances are superbly fine."}, {"id": 424, "text": "Movie was fantastic. I watched this movie only because of Harshvardhan Rane. At the end of the movie I became a fan of Pulkit Samrat."}, {"id": 425, "text": "Action is most important but this movie is fully loaded action. Love romance. This movie is the best in months."}, {"id": 426, "text": "The cinematography, music, performance were all exceptional. Hats off to all the cast. Totally loved the film."}, {"id": 427, "text": "Taish has 6 episodes but I want to see 16 episodes of it. I wish the makers could make a longer film. Brilliant job makers."}, {"id": 428, "text": "Locations are good. Story is good too. You can watch its actions and choreography is top notch. Taish is a fantastic film."}, {"id": 429, "text": "Great acting and emotions, all the actors have acted really,well shot in London and the treatment is fantastic for a average storyline with high emotions"}, {"id": 430, "text": "I love the story, the action, the characters and the fantastic performance of all the lead actors. Taish is a total thrill to watch."}, {"id": 431, "text": "Masterpiece created by Bejoy Nambiar made a fiction turn into emotional psych. Taish is highly recommended to watch."}, {"id": 432, "text": "I wish Taish had more episodes. The climax of the film justified the whole story. The background music and locations were too good."}, {"id": 433, "text": "Harshvardhan Rane has got all the swag and spark in the film Taish. The director Bejoy Nambiar has done an excellent job."}, {"id": 434, "text": "Taish is one of the best intense thriller movies of Zee5. Harshvardhan Rane is terrific in his role. Kriti looked so hot in this film too."}, {"id": 435, "text": "Zee5 is totally worth watching. Taish is a superb film with 6 episodes. The story and the background music is super hit."}, {"id": 436, "text": "Everyone did justice to their role. The actors have performed so well in this movie. Taish is already a blockbuster."}, {"id": 437, "text": "The film is next level amazing. I love the story line of Taish. The execution and the direction of the film is totally up to the mark."}, {"id": 438, "text": "The story started in a bathroom fight and then it went 10 days back. The suspense starts in the very bending of the show."}, {"id": 439, "text": "I love Harshvardhan's actions, implosive performance and his incredible acting and his gangster and dashing look is superb, and so much love for Pali."}, {"id": 440, "text": "This film of Taish is a fantastic show. I love the suspense and story. It has glamour, aggression and dialogues are too good."}, {"id": 441, "text": "All the actors did well but Harshvardhan Rane stole the show. Cinematography is on the next level. Locations are fantastic."}, {"id": 442, "text": "All the episodes of Taish are super fantastic. I loved the performance of Pulkit and Jim, their bond was too good in the film."}, {"id": 443, "text": "One of the best thriller films of 2020 so far, high class action scenes, Best storyline, Great acting by the cast in the movie Taish."}, {"id": 444, "text": "I am just thrilled; the amazing combo of Punjabi language and Hindi is too good worth watching. I want to see the next season of this film."}, {"id": 445, "text": "Taish is something out of the box and interesting with great direction, music, cinematography. Must watch the thrilling drama"}, {"id": 446, "text": "First of all, I had to say that Harshvardhan Rane sir, his acting expression its killing. His performance in this movie is outstanding"}, {"id": 447, "text": "It's an amazing choice of cast as the characters have been portrayed and also it's a movie not made in a long time."}, {"id": 448, "text": "This lockdown has created so much of a superb content. Taish is a must watch thriller drama. Highly Recommended"}, {"id": 449, "text": "TAISH is a decent revenge drama where at the end No one wins. I love the performance of Harshvardhan Rane as PALI."}, {"id": 450, "text": "I liked it, must watch. All the characters did justice to their roles, glad we are getting such things on Indian screens too."}, {"id": 451, "text": "Sunny played the main role in Taish. Sunny has been played by Pulkit Samrat. He just nailed it in the film."}, {"id": 452, "text": "Superb acting and screenplay. Nicely directed. I love all the songs and the background music is so perfect in Taish."}, {"id": 453, "text": "Taish will not give u a chance to leave just watch in one go. I love the story and dialogue delivery of the film."}, {"id": 454, "text": "Rohan and Sunny are childhood best friends. Sunny went to London to attend the marriage of Rohan's younger brother Krish."}, {"id": 455, "text": "Taish is the best movie to watch, just so hard rock and an amazing storyline. Already recommended to my close ones to watch it."}, {"id": 456, "text": "Harshvardhan outshine in this film of TAISH like he always does in other movies. His performance was so perfect."}, {"id": 457, "text": "The dialogue was energetic. Plot creation is good. Taish is an overall full package of love, hate, drama and action."}, {"id": 458, "text": "To be really honest it's fresh,it's unique. We haven't seen anything like TAISH in Bollywood. MIND BLOWING!"}, {"id": 459, "text": "Good job the three major lead role actors - Harshvardhan Rane, Jim Sarbh, and Pulkit Samrat. Taish is a real time show."}, {"id": 460, "text": "Rohan Kalra is in deep love with Aarfa Khan. Jim has played a lover role and also a true brother, friend. Jim is the show capture."}, {"id": 461, "text": "Taish is a must watch film. I love the story. I am already recommending my friends to watch this film now."}, {"id": 462, "text": "Zee5 has again nailed it. What an amazing movie. The story, climax, direction and the concept is brilliant."}, {"id": 463, "text": "The performances of all the actors are so well. Taish is a must watch film. It has all the thriller, drama and suspense."}, {"id": 464, "text": "Abhimanyu Singh and Harshvardhan Rane turned on all the heat in Taish. Sanjeeda Sheikh's role went perfectly with them."}, {"id": 465, "text": "Taish is a slick intense drama thriller which has revenge written all over it. I felt so bad for Jahaan in the last scene."}, {"id": 466, "text": "We all friends watched Taish on the weekend. The best movie to chill just made our weekend. Taish is fantastic."}, {"id": 467, "text": "The title suggests a fit of rage and at least two of the principal characters here are driven by it. Taish is the best movie ever watched."}, {"id": 468, "text": "The chilling time of Pulkit and Jim on the boat is so cool. Jim's love confession with his friends and brothers is so fun."}, {"id": 469, "text": "The background music in the emotional scenes worked like magic. Taish is a super fantastic film, it's a super hit."}, {"id": 470, "text": "The emotional scene of Harshvardhan Rane and Sanjeeda Sheikh in the second episode is way too sad and sensitive at the same time."}, {"id": 471, "text": "Taish is a slick intense drama thriller which has revenge written all over it. The actors' performances are superbly fine."}, {"id": 472, "text": "Jahaan was super hot, sizzling in the movie. I love her eyes. The attitude suits her all along with the story. Taish is a must watch movie."}, {"id": 473, "text": "I am in love with Harshvardhan Rane. His acting in the movie Taish is super fantastic. He looked so hot and dashing."}, {"id": 474, "text": "It was the best combination of what is shown in this through all of you. Taish is totally a thriller and suspense film, do watch it."}, {"id": 475, "text": "I just want to say EXCELLENT work by the makers. The actors did a brilliant job in this film Totally Loving this movie."}, {"id": 476, "text": "'TAISH' the name itself shows that it was a fabulous, strong, and definitely powerful film. I like the fun and the anger of the story."}, {"id": 477, "text": "Loved its music and background score. It was engaging. I didn't expect from this movie to come out this good"}, {"id": 478, "text": "I am now a big fan of Zee5. Taish can be compared with Hollywood film. The artist's dialogue delivery and the story execution are superb."}, {"id": 479, "text": "Screenplay and performance of artists are best in Taish. Direction is totally up to the mark. Don't miss the thriller."}, {"id": 480, "text": "Kriti Kharbanda played the role of Aarfa Khan in the film Taish. She is looking so hot in her role; she has given all her heart to the role."}, {"id": 481, "text": "Oh my God! I am already waiting for the next part of Taish. I love the acting skills of all the actors. The story is fantastic."}, {"id": 482, "text": "Jim Sarbh looked funny, hot and a real actor. I loved him in this movie. Doctor with a dude look, worked smoothly with his role in Taish"}, {"id": 483, "text": "I enjoyed the whole film. I just can't leave it in the middle without knowing the climax. All the actors have performed it so well."}, {"id": 484, "text": "Taish should be a super hit film. A unique concept and the background music is so perfect. What a thrill."}, {"id": 485, "text": "The glamour, the aggression and the high temperature of the actors work like butter and cheese with the story and theme in Taish."}, {"id": 486, "text": "I am so thrilled and loved the story line of Taish. Harshvardhan Rane did fantastic work in this amazing film."}, {"id": 487, "text": "Bejoy Nambiar directed a thriller drama on Zee5. We all know his skills of direction and again he directed a super hit movie like Taish."}, {"id": 488, "text": "Wow! An amazing film, I am recommending everyone to watch the film as soon as possible. You can't miss the good story."}, {"id": 489, "text": "All the actors did great in this superb film. The direction of this film is much better than a bollywood film. Loved it."}, {"id": 490, "text": "I love this thrilling film and the climax is too good. It's hard to guess the suspect till the last episode. Must watch the film."}, {"id": 491, "text": "Best Direction and brilliant execution. The film Taish is superbly executed. I love the songs, background music and the story of course."}, {"id": 492, "text": "I have watched Taish, the amazing movie just because of Harshvardhan Rane as he is a brilliant and amazing actor."}, {"id": 493, "text": "This movie is worth the time:- the cinematic approach , direction, cast, intense feelings everything is engaging and made you stick to it"}, {"id": 494, "text": "I personally don't like gangster based films but this film story and cinematic experience is just amazing and it's worth watching"}, {"id": 495, "text": "If you want some fresh content in a film then you have to watch Zee 5 exclusive film Taish. Just Nailed it"}, {"id": 496, "text": "Strong acting from each cast, great music, great visuals. A must watch movie, perfect.. Harshvardhan Rane is now my favorite. Just Wow!"}, {"id": 497, "text": "This film of six episodes is awesome. Mind blowing story of Taish and one of the best in recent cinemas."}, {"id": 498, "text": "Taish is a total suspense movie. You can't guess who gets killed ultimately until the final climax of the episodes."}, {"id": 499, "text": "Performances especially by Harshvardhan are extraordinary. Interestingly it keeps you hooked till the end"}, {"id": 500, "text": "Oh My God! I didn't expect that Taish would be so good. What a story, amazing concept. I just loved this film and the concept."}, {"id": 501, "text": "MUST WATCH, MIND BLOWING!!! EVERYTHING is GREAT ABOUT THIS MOVIE!! Be it the Background MUSIC, LOCATIONS, ACTING, STORY!!"}, {"id": 502, "text": "Sanjeeda Sheikh and Harshvardhan Rane have a hot chemistry in the film Taish. I liked their love story and departure feeling between them."}, {"id": 503, "text": "The song is fun. Taish has all the concepts of fun, marriage, aggression, fight and lust. I liked the funny and aggressive fight in the swimming pool in the second episode."}, {"id": 504, "text": "Great movie. Talk of perfect casting. All did great job in their roles. Star of the show definitely is Harsh. Wish to see him do more work. Music also stands out. Overall, Bejoy is here with a fine movie.Worth the watch."}, {"id": 505, "text": "I haven't seen anything so good in a longtime from bollywood. Keep it up guys. Big big congratulations to Harshvardhan Rane. You are awesome dude. I hope to see your more movies. Pulkit and Jim sarabh they were awesome too. Little disappointed to see Jahan she didn't get much dialogues to say. Otherwise great job. Keep making something worth to see guys"}, {"id": 506, "text": "You changed the time slots of frames after releasing, when i first watched it i felt like i watched a smart n unique piece of art now its just a movie 6 pointer ."}, {"id": 507, "text": "A very well made thriller with small twists and lots of emotions .Engaging from beginning to end don't miss this thrill ride ."}, {"id": 508, "text": "Go watch this movie it's super interesting new concept not like those stupid foolish bollywood films who have the same stories again n again.Every actor has done a spectacular performance must watch"}, {"id": 509, "text": "One side when you end up watching SpecialOPS, Scam-HarshadMehtra, Mirzapur , PataalLok, Asur, The Familyman, or Avrodh or Panchayat like stuff, and when you watch this one, you get only enough lazy to sleep. Based on some high praise across newspapers and media for this web series I tried to watch it. Its such a dull drama that when we slept while watching it we did not know! I don't recommend this useless boring drama. It will waste your time. The director must learn the art of web series making from some of the shows I listed above. Mirzapur, FamilyMan, PaatalLok, Panchayat and Asur have already set the standard too high which even film industry is finding difficult to match. In that high quality scenario, you can't fool public here with nonesense. This show clearly exhibited its naivety towards public mood and interest. Add to that dull acting and screenplay, and punjabi dialogues. What crap you have made man???"}, {"id": 510, "text": "The show is gripping and very entertaining for the girat 3 episodes and gets completely derailed into being slow, predictable and unrealistic in the second half. In the second half the show tries presents multiple threads which were hastily abandoned. Could have been as a movie with a better climax. The best thing about the show is Harsh's role and performance. He had been perfectly casted for the role whereas Jim sarabh is a total mismatch. Many characters were just there but were not defined properly. Overall a good bingeworthy show"}, {"id": 511, "text": "Bejoy Nambiar's Taish is brutal but honest and has a soul. Like Bejoy's previous movies, it has its voice and it's not just a disturbingly violent action thriller drama between good and evil - it's a human study that ends with a whispering melancholy."}, {"id": 512, "text": "I was done in first 1 yours n not a thriller or suspense forsure"}, {"id": 513, "text": "Film making like this should be done starting with this as an example. Really enjoyed the series throughout and never got boredom."}, {"id": 514, "text": "When I saw the trailer I didn't want to watch this film but when I actually saw the film it was really good... The story is good with outstanding direction by Bejoy Nambiar after Wazir. The screenplay is slow which makes some parts boring. Good performances though especially Harshvardhan Rane. Some songs didn't belong and the film could have been good without them. Action scenes were very good and well executed. The voice modulation was bad though and since a lot of the scenes were in Punjabi some people might not understand it.Lastly, a good choice to release it as both a film and a web series. Definitely a must watch."}, {"id": 515, "text": "Seemed good from trailer. But is total trash and waste of time. Boring Story, Cold Action, Lazy Romance, Bad Direction. Story could have been made better it has potential but it was totally destroyed, Al the ratings that are high are biased and paid i can bet on it, Waited for this eagerly since the trailer but Highly disappointed after watching it."}, {"id": 516, "text": "On the whole, TAISH rests on an interesting storyline,Being a Crime/Thriller . But the long length and a weak second half dilutes the impact to a great extent. Overall its a boring movie . If you want to waste your time then please do watch the movie LOL"}, {"id": 517, "text": "Excellent execution Bejoy Nambiar!! Such exhilarating visuals and attention to details, truly a good watch. Power packed performances by Harshvardhan Rane and Saurabh Sachdeva!!! Beautiful renditions like Re Bawree is the cherry on the cake. PS. Mein jee raha hoon boond bhar in the background was just something else"}, {"id": 518, "text": "Nothing much than few angry men showing off their gym body. Absolute trash !!"}, {"id": 519, "text": "I could really not understand who are these people who rated 7 8 9 stars for this pathetic story. I feel like Ramsay released a movie now where characters are just killing easch other with no ifs n buts. Unless you are a pure drama lover and can keep your head in bag, go ahead. No story no funny moments no dialogs"}, {"id": 520, "text": "This is a Good but still somewhat underwhelming Thriller. What could have been great, limits itself to being between above average and good."}, {"id": 521, "text": "Well, I had set low expectations from this series, but I was absolutely stunned witnessing such a beautiful thriller - very crisp and well-made spanning across 6 episodes. Great acting, beautiful visuals, on-point cinematography, and BRILLIANT MUSIC. BGM and all the other songs with such a pleasant surprise. It was one of the best original score I have heard in the recent times. Director Bejoy has such fine sense of music. Take a bow to all the music directors, singers, lyricists who have contributed heavily to the score."}, {"id": 522, "text": "The acting part was done marvelously well by all the actors, even the camera work was fantastic. But the only problem was with the dialogues, the dialogue writer should've done a bit of research before writing dialogues for harshvardhan as the punjabi dialogues had innumerable flaws. Apart from this, the movie was damn good, a really good attempt from Bejoy."}, {"id": 523, "text": "This project would have been started as a movie but ended up as a series for an OTT platform. This resulted in poor editing, originally a 2 hour movie streched in 3 hour long webseries. Acting of Jim, Harsh, Pulkit (surprisingly) is very good others are average. Direction is top notch but there is no meat or content in the story so the whole plot falls flat in execution. I won't say it even one time watch, can be easily passed."}, {"id": 524, "text": "Harshwardhan rane is love...after Sanam Teri Kasam he is back with bang."}, {"id": 525, "text": "Shows the consequences of anger..great acting great story"}, {"id": 526, "text": "This film promises adventures to the viewers. It is a crime thriller and the concept is good."}, {"id": 527, "text": "A super hit film! I loved all the episodes. It's a crime thriller which will hit you straight to your heart."}, {"id": 528, "text": "It deserves to be a hit. All the characters bring magic to their roles in the film Taish. Interesting!"}, {"id": 529, "text": "It's a masterpiece. The entire crew was brilliant. The concept is amazing. Overall, it is worth watching."}, {"id": 530, "text": "This film holds action and drama. It is very intensive and one where you can't take your eyes off."}, {"id": 531, "text": "We need such exceptional performances and mind blowing concepts in the cinema industry."}, {"id": 532, "text": "It is a thriller which shook me off. The episodes get mysterious as you keep watching them."}, {"id": 533, "text": "Everybody knows that Tim Sarbh is a brilliant actor and he has proved it too in the show. Loved him."}, {"id": 534, "text": "Bold and beautiful. The concept looks thrilled to watch. This show inspires you in many ways."}, {"id": 535, "text": "Amazing story! I really liked the fact of how bold and brave the concept they have tried to portray. Brilliant!"}, {"id": 536, "text": "It's a crime thriller. I loved the episodes. Taish is really a super fantastic film; I will recommend this film to everyone."}, {"id": 537, "text": "I liked the intense ideology behind the show. The drama, thrill, action, the mystery is shown beautifully."}, {"id": 538, "text": "Oh WOW! I just finished the film and can't stop myself from giving full rating for the brilliant story of the film."}, {"id": 539, "text": "Taish is totally an extra ordinary film. Please Please Please watch this action film with many unrevealing suspense."}, {"id": 540, "text": "Jim Sarbh has a way of delivering his act with his skills. He just did it so greatly in the film Taish. Loved it."}, {"id": 541, "text": "I enjoyed this film. The action, the twists and the actors are totally joy able. The best part is every episode connects you, so well with the next."}, {"id": 542, "text": "A film with 6 episodes is such a new idea with great direction by Bejoy Nambiar. The film is a must watch."}, {"id": 543, "text": "I recommended my friends to watch this film as soon as they can. They will really love Taish as they always like a good film."}, {"id": 544, "text": "I can't tell you anything without giving you any spoiler. So watch the film now and enjoy the thrills and suspense of Taish."}, {"id": 545, "text": "Pulkit Samrat is a terrible actor. It seems like over-acting and takes away from the actually fun plot. Jim sarabh is amazing but he can't save the film. Could have been much better."}, {"id": 546, "text": "I saw the movie and the series i found the series which had more details some scenes where still chopped asin the killing but overall i loked everyones performanceMust watch"}, {"id": 547, "text": "Never expected Bollywood to present something so awesome. The story is gripping and it keeps you to your seats. The plot makes you wonder that is this really came out of bollywood. The twists and turns are really good and all stars to the acting department. Each and every actor did a wonderful job. Pulkit did an amazing job and I have never seen him in such a serious role. The locations picked are really good."}, {"id": 548, "text": "This is just a fantastic way of presenting a message/social issue in a movie And i so much thrilled while watching it.Bejoy Bejoy ... oohh man, you done a great job as always. Harsha, Jim, Pulkit you all killed it.A Must watch to those who have brain and pls dont judge just after watching violence be patience and catch its last second."}, {"id": 549, "text": "Taish is unique concept and nice amazing story i give 6 star"}, {"id": 550, "text": "Well I don't know where to start... I watched hindi series liked few but somehow most of the good series following the same trend in like UP trend, hindi abusive languages, link with mythology.. so you watch same camera work..same trend...same gaali galoch...sex but yea different plot... But this one is amazing... international level camera work.. good performances. Amazing plot and direction... Harshwardhan rane is treat to watch..loved this talented guy before.. jim sarabh and other cast were amazing also... but pulkit surprised me..i didn't knew that he can act.. watch this if you looking for good plot with great camera work. Screenplay and performances ....8/10 +1 for direction and performances"}, {"id": 551, "text": "I can sense that I am in the movie. the story line is vey different then typical Hindi series. My friends and I watched this together and through to rate so maximum people watch new gen Indian movie contents."}, {"id": 552, "text": "First time I saw any Hindi series without blinking my eyes. Great work done by the actions, Bejoy."}, {"id": 553, "text": "Really nice to see good content after a long time."}, {"id": 554, "text": "Really liked it.. Kudos to the actors, director and producer."}, {"id": 555, "text": "With unique editing And insanely creative cinematography, every single frame looks perfect and glues your eyes to the screen. All the actors have given their career best performance, yes I'm not exaggerating, all of them have given their best acting performance yet. It's very violent At times and doesn't shy away from showing the graphic scenes which is very welcoming. The story maybe a familiar one but the script is the winner here. The narration is very engaging and the dialogues and scenes Are written so so well. Despite being a revenge thriller, this Movie/series feels Very fresh and unique in its style and content.I highly recommend this, please watch this, you will finish all the episodes at once And I guarantee that. It will keep you engaged And thrilled every single second of it and you will be invested in the characters."}, {"id": 556, "text": "The plot of Taish had great potential and looked promising. Even the cast is terrific at least for the main characters.However, it's the uncooked screenplay, poor writing and immature character development which ruined the entire experience.Most of the supporting characters are not properly introduced. In fact, I could not even figure out how some of the to characters were even related to the main characters. They'd just appear and disappear out of the blue with the expectation that the viewer would just accept them.Characters were poorly built. I could not reconcile or justify the actions behind some of the characters. Also everything would be so convenient for them. Half of the situations make no sense at a.A criminal was being transported in an Ambulance without any police car following it? Really? How dumb is the London police?The writing was an even bigger loser here. This movie could have been so much more, but poor writing just decimated everything this movie had to offer. One particular subplot was entirely unnecessary for the movie. I'm still struggling to understand how could the movie have been different if this subplot never existed. I'm talking about Pali-Kulli-Jahaan. I thought it would lead to something, but unfortunately not.Also the climax made no sense at all. Everyone at the end was all over the place. Almost looked like some kind of trial and error. Every subsequent scene was in contradiction to what the characters would do in the prior scene. Like I said, maybe things would've made sense if writing and character development had been better. But without such elements, I really couldn't understand what was happening and why was it happening.Undercooked, Underdeveloped and Uninspiring. This could have been soooo much more."}, {"id": 557, "text": "Taish is a slick intense drama thriller which has revenge written all over it. The title suggests a fit of rage and atleast two of the principal characters here are driven by it. This is the first time a feature film has also been introduced as a mini series consisting of six episodes. I watched the mini series as it seemed like a more detailed version.The series revolves around two families in London. While one is engaged in a grand wedding ceremony the other is grappling with an ongoing feud between two sulking brothers. A shocking disclosure about a haunting past leads to an uncontrollable situation involving both the families. What follows is a series of chaotic events. The story keeps moving back and forth in time rapidly only to slow down during the middle portions but gathers steam again towards the later part.The three main characters of Harshvardhan Rane, Jim Sarbh &amp; Pulkit Samrat get equal opportunity to shine and they all deliver excellent performances. Rane particularly steals the show with an intense brooding performance. Sarbh is not far behind and it was good to see Samrat in an intense action avatar. Amongst the female characters Kriti Kharbanda &amp; Sanjeeda Sheikh stand out. Kriti looks beautiful and does well in a meaty part. Sheikh lets her eyes do all the talking. Rest of the supporting actors are good. The whole cast looks great on screen.The series has been stylishly shot with a terrific background score. The soundtrack is lovely with songs intelligently placed along with the story. Bejoy Nambiar doesnt disappoint both as a writer and director. He shows his class as a story teller with a technical finesse. This fast paced revenge saga has a lot of factors going for it and should be on your watch list this weekend. Streaming now on Zee5."}, {"id": 558, "text": "Taish is primarily a story of two very angry characters, played by Pulkit Samrat and Harshvardhan Rane. The story of this series is scattered in six episodes of about half-an-hour, due to the fact that both these characters are in the air and the result of their collision.It is being called 'film and series' on the film's promotional material. Some things remain unclear in Taish's story. Many reasons have also not been revealed.Some such points do not digest and weaken the swim. Anjali Nair, Karthik R Iyer, and Nicola Luis Taylor have done extensive experiments with screenplays with Bejoy Nambiar.He repeatedly took scenes in the past to explain the reason for what is happening in the present. Such experiments are often seen in web series to create suspense and thrills, but in the case of Taish, the use of the series is slightly affected.The viewer will have to sit with little attention to connect the strings of the story. Harshvir Oberoi's cinematography also gives the film a height.The outdoor locations are filmed extremely beautifully. At the same time, Priyank brings tension in Prem Kumar's editing series.The 6 episode 'ZEE5 Taish Movie' tells a story of about 3 hours, which does not give viewers a chance to get bored.The strong side of the series is its casting. Jim Sarbh, Pulkit Samrat, Harshvardhan Rane, and Sanjida Sheikh have been effective in their roles.However, female characters could be improved a bit more. Kriti Kharbanda has not been given much opportunity by the director on screen.The three main male actors of Taish, Jim Sarbh, Pulkit Samrat, and Harshvardhan Rane have played their roles effectively.Their scenes show an emotional depth. Be it scenes of Harshvardhan and Sanjida or scenes between Pulkit and Jim Sarbh.Bejoy, who has made 'Wazir' with Amitabh Bachchan and Farhan Akhtar, also made 'Karvaan' with Irrfan Khan and Dulquer Salmaan in between. Apart from this, Bejoy has also made acclaimed thrillers like 'Shaitan'.Bejoy's direction has an emotional depth and style, but sometimes the lack of dispatch makes even the best scenes seem ineffective. It feels like this somewhere in Taish.The story of this series or film is scattered over six episodes of about half an hour. In Hindi Cinema, there are many stories of dying for family and relationships but Taish Movie's treatment sets apart from other films."}, {"id": 559, "text": "Taish is an intriguing new experiment in town. ZEE5 is launching writer-director Bejoy Nambiar's Taish in two versions: a six-part mini-series with episodes of around 30 minutes each and a two-and-a-half-hour feature film. The total duration of the series is 34 minutes more than the film. This could have translated either into greater substance or more fluff in the series, or simply, interesting but differing takes on the same storyline, depending on the choices made in the writing and editing process. The story has two intertwined sects and cross eachother to avenge the revenge. Underwhelming at times, seems dark but is lucid and the cast does brilliant performance from Pulkit Samrat to HarshVardhan Rane, Sanjeeda Sheikh, Jim Sarbh, Kirti Kharbanda.The music and songs are jewels. Each song is unique and has a rustic feel. Sona Mohapatra has also done a good job.Nambiar does what he does best. Watch for a intesly beautiful film."}, {"id": 560, "text": "It's a wedding celebration in the Kalra family, young Krish is uniting with his girlfriend Mahi and it's fun galore. Brother Rohan (Jim Sarbh) and his girlfriend Arfa (Kriti Kharbanda) and Rohan's best friend Sunny (Pulkit Samrat) light up the celebration like a house on fire. Suddenly Rohan spots Kuljinder (Abhimanyu Singh) among the guests, and old wounds are flipped open. Hot headed Sunny notices Rohan's reaction and probes for the reason, following which he accosts Kuljinder and in a drunken brawl, almost fatally injures the latter. Kuljinder's is a family of criminals and his brothers, Pali (Harshvardhan Rane), Sukhi (Saurabh Sachdeva) and Jassi (Armaan Khera) seek bloody revenge. Sunny manages to survive by chance, but tragedy strikes the Kalras, leading to Rohan breaking his ties with Sunny and turning reclusive.This is just the beginning. Taish is the story of the chain reaction that follows this incident and how an eye for an eye, and a tooth for a tooth turns the lives of the two families and people associated with them into a blood soaked mayhem.Taish is explosive as the title suggests. An action more than two decades ago spirals into an uncontrollable series of violent events that touches everyone, ending in disastrous consequences especially for the innocent lives who wake up to the unknown reality about the people they love. It's a violent saga of vengeance amid brotherhood and friendship, love and loss. Harshvardhan Rane stands out in his complex role, subdued on the surface but determined and passionate underneath. Pulkit Samrat impresses in his hot headed role, although his role is poorly sketched for being the pivotal character that sets off the fire and being the carrier of the vendetta flag on behalf of his friend who breaks his ties with him. Jim Sarbh gives a stunning performance in the central role, mixing several emotions deftly. The women don't have much to do, yet Saloni Batra and Sanjeeda Sheikh stand tall in their respective roles of Sanober and Jahaan, the two ill fated women of the gangster household. Kriti Kharbanda is appropriate, offering support. Do watch Taish, its 6 episodes keep matters focused, slick, dramatic and boast of some superlative action, breezy pace, beautiful UK countryside locales and some haunting music that stays with you for long. Baawree by Sona Mohapatra is an apt, melancholy shroud over the violent saga in the end that underlines the tragedy of lost love."}], "reviews_amount": 561}