{"name": "12 Hour Shift", "titleId": "tt10309552", "reviews": [{"id": 0, "text": "Very well done and entertaining. Started out like a roller coaster when it starts its climb and then lets it rip."}, {"id": 1, "text": "... and I think therefore I am a mass viewer. Lead actress (drug-ridden nurse trying to make ends meet, working in some god-forgotten hospital, in 1999) was good. But that's pretty much it. Movie was abysmally slow, plot started interesting (ended tragifarcically) but the whole story should've been told in 30 minutes (not 90) - and don't get me started with that irritating soundtrack. Definitely not for me. Avoid."}, {"id": 2, "text": "If you read the synopsis you probably say 'it worth it' but no. All the bad actors involved and the silly resolution made the movie fail. Angels Betts is the only cast member who plays a decent part, the rest of the nurses, patients and organ traffickers are SO LAME! David Arquette's cameo is so cliché (only because he's the producer) ñ. The screenplay also have big holes like the absence of a duty doctor. No hospital in the world is running by nurses much less in a night shift."}, {"id": 3, "text": "You can't trust horror reviews. I swear people come out of the woodwork to watch something they know they're going to hate and clutch their pearls when there's violence in it. And this is not even that violent! Then the other half whines that they weren't scared. Lord help us.This was off the wall, dark, funny, kept me entertained the whole time, and had a moderate amount of blood and violence. All of the actresses were hilarious. It's a cute little indie horror comedy. I would watch this with just about anyone. Definitely worth a watch."}, {"id": 4, "text": "Mandy (Angela Bettis ) is a nurse at the Little Rock hospital in 1999. She is working a double shift tonight. It is not a problem as she snorts a white powder to stay awake. In her spare time she harvests organs and sells them. Her ditzy cousin Regina (Chloe Farnworth) is the transporter. Unfortunately she forgot the product while talking and had to travel back for it. It is missing and they need a kidney ASAP. There is a cop killer handcuffed in one of the rooms. Things get out of control.This was a fun dark comedy. Things become jumbled at the end and a little less enjoyable, but still fun. Great characters.Guide: F-word. Butt nudity. No sex."}, {"id": 5, "text": "Watching this was movie is much fun. Solid soundtrack by matt glass. You won't regret watching it especially with company"}, {"id": 6, "text": "Highlight of the film is Bettis' character and performance as she must endure idiots ruining her day and making it worse as things get comically out of hand. The comical antics are more likely to have you shaking your head than laughing though, unless you still find Scary Movie funny. If you can get past the stupidity, the thriller aspect of trying to illegally trade organs while everything is going wrong is rather enjoyable. Weird music throughout might be jarring to some but I quite like it. Arquette's role is small enough not to ruin it, while sadly Foley's is a cameo with a few lines, so if you're a wrasslin' fan just here for him don't bother."}, {"id": 7, "text": "12 hour shift 2020 first of this film is bloody fantastic and crazy from start to finish i really enjoyed this film so much , this movie has a lot of organs everywhere ,blood everywhere, tired nursers,killers,psychopath,good bad cops gosh everything was top notch Really fun and enjoyable dark comedy that keeps you entertained for the entire thing. This movie doesn't take itself too seriously and for that fact does an amazing job and creating balance between the horror tropes and comedic effect. directing really good , acting all cast they did a great job especially actress @Chloefarnworth she did a outstanding job a bloody beautiful and full crazy chick that she want to just enjoy in hospital 12 Hour Shift is dark humor at its best, with plenty of violence and unexpected moments of levity to tie into a quirky, entertaining knot. Super fun watch and would definitely recommend to any friends here that love those fun and funny horror ."}, {"id": 8, "text": "I really had a good time with this movie, it is funny but not far fetched, it won´t make you ROFL but will certainly put a smile in your face during some parts.Keeps you interested til the end, not boring at all."}, {"id": 9, "text": "Not going to say much, just that is not funny at all, could be a good pace but the ideas are bad. Horror none but a lot of blood, Thriller none. I just liked the end I mean when was over."}, {"id": 10, "text": "This movies doesn't know what it wants to be. Jokes are super cheesy and the acting...well...it's definitely an indie movie. The music is obnoxious, camera angles aren't good, and the camera stability was lacking. Mid into the movie it evolves into a musical...why? It wasn't worth the money to rent. I don't want to give away much of the movie but the story is super predictable. Lastly I don't see why the director would cast their friends into the movie? Why not hire actual actors/actresses."}, {"id": 11, "text": "Certainly worth watching. Kind of hokey but in a good way. Has a decent amount of gore in it, so be aware if you're a bit squeamish."}, {"id": 12, "text": "Absolutely bloody brilliant. Best movie of 2020. Its either a really well thought out masterpiece or a complete fluke. Whatever the case this movie expresses issues relating to, race, class, sex, healthcare, politics, economics, crime and the overall state of western culture and the current western mindset.;- Interestingly put together using original camera work and music creating a fresh pace."}, {"id": 13, "text": "This is the most mentally challenged comedy I've seen in a while."}, {"id": 14, "text": "Some humor and stuff like that, but the Main story is a bit messy. It takes time to mot being confused"}, {"id": 15, "text": "Angela Bettis was once upon a time a cult actress and her presence ment ,that the film will be unusual but worthy of watching.Have no idea what happened,but this movie is just stupid,mediocre and somewhat unpleasant...3 stars just like a kudos to once favorite actress..."}, {"id": 16, "text": "Honestly, this movie starts slow but when the story unwinds...BAM!!! Nonstop nonsensical laughter. Also, the film is quite terrifying and a bit gory...which I like! I recommend this movie if you are into dark black comedy horror."}, {"id": 17, "text": "Twisted, clever and darkly funny; 12 Hour Shift is an edgy female lead romp that flips the genre on its head.In this thriller set in 1999 Arkansas, a drug-using nurse and her cousin try to find a replacement kidney for an organ trafficker.Overall you will either love 12 Hour Shift or hate it. I really enjoyed this B-movie for its dark humour and fun, gory aspect. Angela Bettis is terrific in the lead role and honestly, we can all relate to her and her struggles with people. At times shocking but always entertaining, writer/director Brea Grant is a fascinating filmmaker with a bright future ahead. Running at almost 90-minutes, this thrill ride flies by. Check it out if you can.Follow @snobmedia for more reviews!"}, {"id": 18, "text": "Great acting from the two maim characters. This is an excellent dark humored film where you clearly get when they want you to feel the thriller and when they want you to laugh at the improbable. Took me out quite a few laughs and Bettis acting is superb as always. The plot is somewhat fresh and unexpected. Really liked it! When compared to Netflixish recent productions, this becomes a masterpiece! Looking for something a bit new and different, see it!"}, {"id": 19, "text": "I got a lot of positive emotions of this movie! The time passed quickly , I watched the movie in one breath . I highly recommend this movie to all who loves bloody comedy with the good actors!"}, {"id": 20, "text": "First of all let me say that 12 Hour Shift is watchable. It has an entertaining story and the acting is actually not that bad. But it's also a story with a lot of scenes that don't make any sense and that brings the quality down. It's the reason I only score it a five. To me it could have been much better, but to kill time I guess it's not the worst option you have. There is a decent amount of subtle horror, nothing too violent though. It feels like a missed opportunity to me, I wished I liked it more and with a more plausible story I probably would have."}, {"id": 21, "text": "Mandy's depressed mood all throughout the movie was very convincing. Regina the sleazy transporter played the dum sociopath blonde very well withh all the character's clichés and her 90s look is awesome. No one cared about the hypochondirac guy and he took all the organs from the freezer. The moody black nurse, the fidgety scared, the elderly woman patient with dementia and the guy fom the organ mafia whose eye was poked by mandy all the characters was fun to watch. Ann above all, seeing David Arquette felt good even as a lunatic cop killer. Oh and that soda Spurty!"}, {"id": 22, "text": "Few notorious faces in hereVery well directed considering Nice plot and twists Very energetic and entertaining It keeps you interested in itThat is what movies are about Does the job And it deserves a good six plus"}, {"id": 23, "text": "Not much of a comedy but something still enjoyable."}, {"id": 24, "text": "This is one of those films that defy comparison with other films of the horror genre.It's black humour and simple story make this an enjoyable watch. All of the characters are at least a little off the wall and portrayed brilliantly by the cast.This could happen in your town."}, {"id": 25, "text": "As a husband to a nurse, and someone who spent a few weeks working in hospital I couldn't help but take this film as one big metaphor for what nurses go through daily. The long, thankless, dirty, unglamorous life of a nurse.A witty and bleak film with enough black humour to keep you smiling and enough craziness to keep you entertained."}, {"id": 26, "text": "If you want a movie that can get you up on your toes and let you have your cardio the way you want it, this is NOT the one. Nice plot, set in the weekend of Y2K chaos and beautifully knitted with a shiny and dull yellowish environment. Just the kind that you watch and go to sleep and don't need to remember what it was. Because it kinda breathes in the laziness. Night shift of a probation-based nurse going through edge of her professional carrier start. Some help from the senior and a lot of help by the drug-induced-intelligence. Don't watch it with kids, I'll give you that. Also, don't quit so soon."}, {"id": 27, "text": "Actress Brea Grant doesn't have many notches on her belt for writing and directing, but wow did she make this dark horror comedy awesome!The 86 min runtime was just right with the great pacing. The cinematography and score were excellent. The casting was perfect, especially with Angela Bettis' straight-faced character contrasted next to Chloe Farnworth's dumb blonde persona.Her screenplay was solid - better than some films I've recently seen from seasoned filmmakers. The comedy was on point with many wtf and lol moments. The 80's style horror scenes were just right with great gore, and there were many thrills in the various multiple storylines intertwined perfectly.Mad respect and props to Grant for pulling off this little gem. I'll be watching this one again with friends who haven't seen it. A well deserved 8/10 from me."}, {"id": 28, "text": "Ever since I saw her in May I have become a big fan of her and started following her work. I noticed she isn't quite down with blockbusters and always picks smaller projects, and to be honest those are perfect for her, as she manages to bring some soul into the movie and usually steals every scene.The exact same thing happens in 12 Hour Shift, where her face is everywhere, setting the tone of the movie perfectly and genuinely gets you to enjoy your view. As for the movie per se, it is a great experience, very well build together, a lot of treads that get tied together in a very humorous way, and some unexpected turns every here and there. I am surprised that this one is not more popular, people surely have heard of it by now, so to them I say, go and check it out. You will have a good time watching a different kind of horror comedy - one without gore but with brains.12 Hour Shift is a great example of little cinema, of fresh horror and a good direction.Cheers!"}, {"id": 29, "text": "A dark solid wicked black comedy has been born, with inquests of deep desperation and twist to stay boyant in the water. that combined with a very unusual choice of score, rythmic opera made the madness even deeper like a turmoil of hell.its about organ trafficking at a hospital in usa, the nurse and her in law cousin with connections to the mob , supply them with fresh kidney for a hand of doe. one night suddenly a kidneys goes missing when delivery is done, and the saga tell you the chaotic brawl to get a new one within 2 hours.its a lowbudget film, but extremely well made. just some technical glitches here and there, with the darn daylight. its blood and gore, its witty caracters are so well acted by the small cast, and the production design along with good direction, makes this a charade at level of the british ''faulty towers'' but far more bloody and messy.it aint a horror movie, ita a bloody comedy, and if you like one brain and a lot of brainless caracter in one go, then its a recommend from the grumpy old man"}, {"id": 30, "text": "12 Hour Shift starts off slow and disjointed, but fires on all cylinders about 25 minutes in. The lead characters in the film aren't meant to be likable (heck, they all deal in organ trafficking!) - that's what we come to terms with, in those initial scenes. Along with the plot's overall absurdity. Things do get comically chaotic thereafter, with ample doses of blood-spilling. Bettis (as a nurse with drug addiction) remains a badass throughout, even when her supposed family members get involved in life-threatening situations.It was Chloe Farnworth (as organ trafficker Regina), however, who wholly caught my attention. She is the epitome of sassy, psychotic, and mindless in the film; a little like Harley Quinn with a penchant for gore. Every scene featuring her is quirky, exciting, and comes with a surreal sense of humor. I'd love to see her get more work. The good thing with the humor in 12 Hour Shift is that it pops up when you least expect it to - Kit Williamson and Nikea Gamby-Turner earn some points in that department.The climactic finale gets a little messy, with too many characters and the idiocy exponentially higher. 12 Hour Shift makes for a fun little watch to kick off the first weekend of Halloween month, especially if you'd want to keep things light yet bloody."}, {"id": 31, "text": "Well, I will be the first to admit that 12 Hour Shift from writer and director Brea Grant was something else, for better or worse. Like it or not, then this isn't your average horror comedy, or whatever genre it falls into.Personally, I wasn't overly thrilled about this movie. It was the pacing of the storyline and the absurdity of the events that made me slip in between the grasp of director Brea Grant. I didn't really enjoy the movie, truth be told. Sure, it was watchable, and there were parts of it that were actually good, especially for an absurd dark comedy, but the movie as a whole was just a swing and a miss for me.The storyline was just a bit too far out there, especially towards the last 30 minutes of the movie, then everything just spun out of control and the movie went from being out there to being completely lost beyond the scope of sight. The entire movie was just permeated by a sense of lack of realism, as most of the things transpiring throughout the storyline were just too far fetched to actually have much of any footing in reality.Initially I was thrilled to see Angela Bettis in the movie, and I will admit that her performance definitely helped to keep the movie afloat, as she is well-placed in offbeat horror movies with elements of comedy as well. And it was also interesting that they had David Arquette appear in the movie, just a shame that he wasn't given more screen time, because he could definitely have spruced up the overall feel of the movie.The cast ensemble was good, and people were actually doing good jobs with their given characters and roles, just a shame that the script and storyline was sort of restrictive and limiting for the performers.I managed to sit through the entire ordeal, but honestly I wasn't overly entertained or enjoying the storyline. As such, I am forced to give the movie a less than mediocre four out of ten stars. The movie definitely had a great amount of potential, but it was just steered in a wrong direction."}, {"id": 32, "text": "This was a movie that I saw was being shown at the Gateway Film Center. I missed seeing it in the theater as I had a busy weekend and it was there for that week. It popped up as well on a horror movie challenge I'm doing in October, so I made sure to give this a viewing. I also decided to review as part of a Featured Review on Journey with a Cinephile: A Horror Movie Podcast as well. The synopsis is bodies start to pile up when a drug-user nurse and her cousin try to find a replacement kidney for an organ trafficker.We start this off with Mandy (Angela Bettis) talking with another nurse who is leaving her shift. Mandy is about to work a double and she isn't necessarily looking forward to it. The other nurse is giving her backhanded compliments. I think this a good scene to see that Mandy doesn't really take crap from people. The problem though, is that she is a junkie. We learn that she's on probation for this, but it isn't stopping her from snorting items to get her through the night.The charge nurse is Karen (Nikea Gamby-Turner). Working with her as well that night are Dorothy (Tara Perry), who is quite religious, and Janet (Brooke Seguin) who is bossy. There's something going on in his hospital though. Karen and Mandy are running a scheme where people die and they get the organs removed. Mandy's cousin, Regina (Chloe Farnworth), shows up to collect them. She isn't the brightest and this is apparent when she removes the kidney from the cooler to put a couple of soda pops it in and never puts it back. She gallivants all throughout the night before going to see Nicholas (Mick Foley). He's a local gangster who is running a scheme with organ trafficking. He's not happy to find the cooler empty. She has 1 hour to bring the kidney to him or Nicholas is sending Mikey (Dusty Warren) to get her.Mandy is just trying to get through her shift. There is an Alzheimer's patient there that is in a coma. She sends the daughter away, not expecting her to wake up and this allows Mandy to rummage through her things. She also helps a Mr. Kent (Tom DeTrinis) get set up with his dialysis and there's Jefferson (David Arquette), a local murderer, here from the prison. Mandy's half-brother shows up during the night with another apparent drug overdose.When Regina shows back up to tell Mandy that the kidney she is missing, things take a turn. They blame each other and Regina is adamant that she just get her another one. She creates a lot of problems that cause the police to show up and it might jeopardize this whole operation they have going on. It also becomes a problem when the antics going on allow Jefferson to get free from his guard as well.Now that is where I want to leave my recap for this movie. If I haven't pointed it out yet, this movie is part comedy so some of these things that I'm relaying are done in a comedic fashion. The first thing to go into though, the premise of the movie is really interesting. I didn't state, this takes place in Arkansas back in 1999. That was done strategically since people didn't really have cellphones and where the movie is, we're in a backwater hospital that isn't as busy. Things could be done without necessarily being noticed and I mean, people are dying in hospitals pretty regularly. When things aren't done with as much care, it makes sense the cops would be there.Next I want to delve into the character of Mandy. We learn a lot about her in some interesting ways. She is hick and it appears that her half-brother got her addict to drugs. There is also talk he may have molested her when they were children as well. I bring this up, because Mandy is broken from the start of this. She is on probation for her addiction. We see her a few times taking drugs. Bettis plays this character so well though. There's something about her and the snarky attitude she brings to the role that really worked for me. She also plays a junkie who needs a fix very well.Then on the other side, Regina is dumb. There's a funny line in this movie when someone calls her out on it, she states back, Every teacher I ever had said that. What I get from her is that she has survival instinct. She's in the wrong with this movie. Her mistakes cause all of these events to happen, but she never takes blame. She doesn't think she's dumb. We see her do a multitude of things that just keeps making the events of the night worse and worse. For one, she doesn't know what dialysis is or where you'd find a kidney in the human body. I will give it to Farnworth, she does a great job playing this character and she made me laugh a quite a few times.I might as well just finish off talking about the rest of the cast. Arquette gets high billing for his name recognition. I'd say he is more of a cameo. It is a role I haven't seen him play in awhile. I thought he was fine there. It was fun to see Foley as a bad character here as well. He's such a nice guy normally and I dig seeing that. Kit Williamson is fine as Officer Myers. I really like Gamby-Turner, Perry and Seguin. The former adds comedy and sass. Perry does have a bit where she sings and I thought her voice was good. The rest of the cast does round this out for what was needed.To circle back to the story, there are some things that are bit unbelievable. As comedy, I think that allows me to suspend some disbelief, but I also think that hurts it in building tension. For a movie only running 86 minutes, it did get a bit repetitive to me unfortunately where this only so much of the same thing that you can do over and over. Not that I hated this, I just didn't love it.I will say that the effects were good. They went practical from everything that I could tell and if they use CGI, they hid it well. We get quite a bit of blood and it looks pretty real. There are some organs that we see, those also worked for me. It is strategic there to put them in bags as by smearing blood on the inside, it does hide the effect if need be. The cinematography was well done. I do feel that they use a bit too much of montage sequences though.The last thing to really go over would be the soundtrack. We get quite a bit of operatic music that is remixed to have a more modern feel. This worked for me and adds an interesting feel to the scenes that it is with. Overall this score just worked well with the movie. Not one that I would seek or listen to regularly, but in terms of the movie I think that it fit.Now with that said, this is an interesting horror comedy. I really like the premise of the movie of organ trafficking. It makes me wonder if this is really happening. The performances by our two leads of Bettis and Farnworth are both different, but compliment each other well. The rest of the cast work well around them and I can't really think of a bad performance. Effects are good and the soundtrack/score fit for what was needed. If I have any issues, it is with the over use of montage sequences, some of the comedy and the movie isn't as based in reality as I would expect. Overall though I thought it was solid. I'd rate this as an above average movie for sure. It isn't great by any stretch, but I would recommend giving it a viewing if you like more outrageous snarky comedies with horror aspects.My Rating: 6.5 out of 10"}, {"id": 33, "text": "This is the story of a nurse's night shift in a hospital. The nurse is selling organs, harvested from dying patients but one goes missing during delivery and has to be replaced.I enjoyed this film and I think if you give it a go you will. I think the problem is that it doesn't really know where it wants to be. Its not quite a horror but does have some blood and gore. It is is funny in places but not really a comedy. It's dramatic but that doesn't really seem to be the same theme. It is also is set in 1999 which I didn't realise until the end of the film and missed why that was important.It's really well acted and written. Although there are moments where you have to suspend disbelief that anyone can be really that stupid and not see what is plainly going on in front of them.Just expect a good movie, rather than anything for a specific genre or anything that is trying for glory."}], "reviews_amount": 34}