{"name": "I Am Greta", "titleId": "tt10394738", "reviews": [{"id": 0, "text": "It's disturbing that so much vitriol and hate can be targeted at a young woman whose only wish is for the governments of the world to recognise the overwhelming evidence that supports climate change and for them to do something about it before it's too late (assuming it's not too late already). Conversely, it's refreshing and inspiring to know that a young woman has been able to mobilise such a strong and powerful force to fight against the misinformation pedalled primarily by white middle aged and older men, although this is primarily a documentary about a person and not a movement, somebody who is trying to change the world for the better and, with the help and support of the youth of today (and a few others), let's wish her all the success in her crusade against greed, corruption and ignorance while joining her in the fight for our survival!"}, {"id": 1, "text": "Please do not watch this, its really really really bad"}, {"id": 2, "text": "Please , don't waste your time! !!! Really bad !!!!"}, {"id": 3, "text": "97 min later, I am no more aware of the motivations behind her singular obsession than I was before I started watching this ill conceived biography on Greta Thunberg. The whole thing feels like it's preaching to the converted without any attempt to justify or clarify to those not in her camp. You get no tips on any of her sources or any other references other than her family. If your first exposure to her consists of you watching clips of her speech at last year's UN's Climate Action Summit. You might wonder as to how a 16 year old came to be so angry at the people in attendance. There is no origin story, no mention of any pivotal moments in her life. As you go behind the scenes with the camera, you get up close and personal with her at home while she's with her dogs and horses, and on the road for her public appearances. We see her reacting to other people respond in agreement or retaliate against her, I can't help but feel angered by the vicious nature of attacks by otherwise responsible adults in authority, deplorable under any circumstances. You get to know about her mental disabilities, but you don't get to meet her doctor, or any other person in any authority to talk about her afflictions and how it may affect her. We get to see her breakdown onboard a racing yacht, obviously unprepared for the physical toll of crossing the Atlantic in a 18m boat with no room for basic amenities. The world is a very different place without airplanes."}, {"id": 4, "text": "People who say it was a poor movie are the problem in this world. Amazing movie, the way she discribes the world of rich and powerful people as a weird moviescene. Puppets playing a weird theater. Amazing to see the people wanting a selfie but not understanding what she really is there to speak about. crazy world we live in, hopefully some people will realize things have to change before it is too late"}, {"id": 5, "text": "Saw this at Venice film festival. Was absolutely blown away. Wonderfully created, and Greta is the biggest inspiration we've seen on planet earth in such a young and spritely body.The children will save this world"}, {"id": 6, "text": "Climate Change is so important to us all. Great to be informed and inspired by this remarkable human."}, {"id": 7, "text": "Your rating on imdb should be about if you liked the documentary and not if you believe in what Greta stands for.'I am Greta' is a beautiful portret how one small girl started a movement. The sequence of her public speeches she has written herself shows what an exceptionally gifted person she is. And how the world leaders have no idea how to react to that. The film also zooms in on her vulnerable sides as a result of the immense pressure on her shoulders.I really enjoyed watching it and had a lump in my throat during a big part of it."}, {"id": 8, "text": "Must watch, climate change is a reality. We all should do something about it."}, {"id": 9, "text": "One of the most inspiring people in our time - watch it!"}, {"id": 10, "text": "Greta is authentic and this film is a tonic in a shallow consumerist world. The comments on the low scores are often frivolous. It is sad that people are so threatened by the truth, although of course it is an uncomfortable truth, that they attack Greta, very cowardly. It is great to see behind the scenes as the news was hitting about various moments. Very highly recommended"}, {"id": 11, "text": "The world needs more strong people who believe in change and in a better future. This film is for all those who do not want to close their eyes."}, {"id": 12, "text": "Ok, Greta is unique. There has never been anyone like her. This film follows her and her father on their journey to wake the leaders of the world from the climate coma. Extremely well photographed. Funny, personal, impressive, a bit sad and very touching. This documentary will probably be the most important of our time. A million thanks to director/cinematographer Nathan Grossman for making this film document."}, {"id": 13, "text": "A very touching portret of Greta. The documentary mentions - but does not emphasize - the motivation and events that led Greta to take action. You could almost miss it, as the movie focuses more on Greta's journey from lonely protester to the world wide phenomenon she now is. For me, however, those were the biggest moments of this movie. The way her father talks about her motivations and how he sacrifices himself to support her, the contrast between what is said and how it is said, almost casually. It is a beautiful story of a father and a daughter. The moments where Greta is in distress, or refuses to eat and how her father tries to help her, or when they celebrate early success together are the key moments. Truly inspiring."}, {"id": 14, "text": "This documentary shows you the inside of a person that is so deeply concerned with the world and what will happen with it that she basically abandons here childhood for that.When you see here crying on a boat in the middle of the atlantic, waves crushing against it just because it is against here principle to fly and you hear her crying, saying that this all to much for her you will know how committed she is and that she is real.She repeats that this is not her job but since grown ups fail to it she feels she has to. And all those small-minded people who will criticize her for how she looks or that she has asperger syndrom or that she does that for fame only proof that Greta is right that they have learned nothing yet. There are people actually sending death threats to that child! Climate change was real even before Greta was born and our children will pay for our recklessness if we don't do something. Wake the hell up!"}, {"id": 15, "text": "As a person who believes in climate change due to the use of fossil fuels and the inability of governments around the world to get out from under the sell of big oil to operate our lives. You'll either love it if you're a climate change believer or hate it if your on the other side. He only thing I didn't like was that I couldn't read the subtitles because of their color. She's a ballsy young woman who is spreading the word."}, {"id": 16, "text": "She continues to inspire! A must see, especially if you believe the world needs to change."}, {"id": 17, "text": "Greta is a force to reckon with. Very interesting and inspiring. Loved this!"}, {"id": 18, "text": "A film to watch and watch again. The message is so important, Climate change is real and we are past the tipping point. Believe in science not politicians. An intimate look at what its like to be at the center of such a volatile issue. Beautiful imagery, language, and what a journey.Watch it again and again, because it deserves it."}, {"id": 19, "text": "Forget the naysayers and the trolls, make up your own mind, and watch. A well balanced documentary giving an insight into the intensity, and laser focus with which somebody with Aspergers lives. As a father and grandfather, I am saddened by the world leaders lack of empathy to Gretha, and even more saddened by their lack of action. But you be the judge."}, {"id": 20, "text": "This has been without a doubt the best coverage on Greta and her rebirth from being the invisible girl to this amazing and strong woman she has become. She has awaken millions into the issue of the climate change, she trully became the face of this critical issue. Many were not awake of the whole situation because often the scientific community has been ignored, she breaks that barrier and puts it in the face. She's trully the most powerfull lil human hero we have now and her fight has just begun."}, {"id": 21, "text": "An apt look at a brave and remarkable figure that's been able to galvanise the urgency that her generation faces as a result of climate change and inertia of inaction"}, {"id": 22, "text": "I can't wait for this wonderful film to come to the cinemas! We need her inspiration more then ever!! Fighting against climate change every day! #iamgreta"}, {"id": 23, "text": "This is not the documentary that gives answers to questions about the climate problem. It is a touching portrait of a young girl who wants to do something about the problem that frightens her. But most of all it shows the disappointment and frustration of not being able to change anything. Most of the leaders are showing off with her presence, but don't even think about solutions. I was deeply touched by this portrait."}, {"id": 24, "text": "Here we are on the eve of a choice in the US between a green 'new deal' and what Greta rightfully called the fairytale of continued economic growth. What will we choose? Will it stick? What has changed since the last time people got serious about the environment? Great lens into the difference one voice can make."}, {"id": 25, "text": "Powerful story that shows the struggles and journey of Greta. We must act!"}, {"id": 26, "text": "Thank you, Greta, and the makers of the important documentary. Our world needs more caring people. Please continue! 💚💚💚"}, {"id": 27, "text": "Greta Thunberg is a highly inspirational youth from a generation first to deal with the most disastrous effects of climate change. It is time for everyone to take this as seriously as she does"}, {"id": 28, "text": "Don't believe the composite ratings score here. The results are clearly politicized. This is an excellent production totally undeserving of a mid level score."}, {"id": 29, "text": "In this world where everybody lives in their own bubble, it was to be expected that this documentary would create either haters or lovers and not much in between. I love to see both sides of the arguments around the Climate crisis, and I came to the conclusion that humans are changing this planet beyond sustainability levels. You do not have to be a scientist to understand that a growing human population is creating an increasing impact on the Natural world. Pollution, too much deforestation (see satellite images), land scraping for cattle, mining and intensive agriculture, etc.. It is all logic, but hardly anybody cares. Hence, a 10 star for Greta to bring her honest and direct message to the world. Sure, Scientists have been doing this for 40+ years but apparently nobody is listening or ignores it. Very brave of this girl to stand up against a majority of egocentric short term thinking humans."}, {"id": 30, "text": "It's all about profits and short thinking, except for this girl that wants to stand up for what is right is right.Maybe not a good movie but cheeple, WAKE UP! Is my mike on or not?"}, {"id": 31, "text": "Reading reviews from grown adults who are writing hateful and offensive comments about a young girl are truly pathetic. You are disgusting human beings."}, {"id": 32, "text": "Inspiring. Such passion &amp; commitment. We can all learn something from this documentary. If not about climate change then about dogged determination &amp; standing up and speaking out sternly (and peacefully) though steadfastly in one's belief. Get'em Greta!"}, {"id": 33, "text": "I knew the bad reviews were all fake, ignore them. Do they think we are stupid? This was a great documentary filmed over a year from the early days of her school strike outside the Swedish Parliament to her harrowing two week journey across the Atlantic Ocean to attend a UN Climate Conference in New York City! It was very inspirational especially for children and young adults. See it on the big screen for the full effect!"}, {"id": 34, "text": "It is a beautiful and impressive observational follow the person documentary of a young determined girl who has Asperger and who inspired many kids around the world into action. It shows her message, her struggles and persistence despite the clear personal discomforts that her mission brings her. This is not a political documentary aiming to show pro or cons of climate change. It shows her journey as a young determined kid who probably got more attention then she personally wanted but persevered for the noble mission she has in her mind. And it also shows the powers of people with autism or Asperger and their challenges facing our crazy world. Great inspiring watch with young adults."}, {"id": 35, "text": "She is a determined and incredible personality; while flawed she moves forward as an unstoppable force. The climate deniers are all rating it one star they cannot see past the politics of their own brainwashing."}, {"id": 36, "text": "I have never rated or reviewed a movie officially before. But for this one I will. It's a delight to take part of this young woman's life. Her dedication. Her unselfishness. Her sacrifice of her youth to improve the life of future generations. Science deniers will rate this 1, so don't expect a high average score. They are rating it by ideology and/or lack of understanding the science. I will never ask you again to watch a movie, but I ask you now to just watch this one. It may very well be the single most important movie in your lifetime."}, {"id": 37, "text": "Someone who is actually amplifying her voice and willing to confront the world's leaders and lawmakers. Bold and brave, but she doesn't think so. In modesty, she states that its not about her, it's about us working together to solve what is surely a crisis. A visionary who sees what is coming if we continue status quo. Oh and by the way, she is only 17. What we do now is for her generation, included in the seven generations from this point in time. The children of the world are demanding our help, do not let their pleas go unheard."}, {"id": 38, "text": "How very saddening to see a child, such a vulnerable child put in such position of responsibility. To go from her courageous protest to take on adult world leaders, who allow themselves to lament a 15 year old child with such venom, is more then anyone should endure. Shame on all of them, both the venom idiots and the selfie self-promoting politicians who try to ride her wave. She is beautiful child and her birthright is to study and live a life with her family, not carrying the weight of the world on her shoulders. Yet I thank her for doing so, unfortunately it is needed. Well done Greta."}, {"id": 39, "text": "This movie was so inspiring. Greta's struggle to get her message worldwide and her perseverance brought tears to my eyes throughout the movie. I highly recommend."}, {"id": 40, "text": "Unless pi are a complete climate change denier, this documentary will move you to tears. How a young girl like Greta can change the world is amazing. Somehow they started filming his before she was known and now she is a international phenomenon. The world owes her our thanks for walking us up. I can't tell you how much this moved me. She is my hero"}, {"id": 41, "text": "A documentary showing various aspects of Greta's life. It's nice to see his irony in some cases, his laughter is contagious. A fair film for those who want to know the story of one of the most famous activists in the world and creators of the Fridays For Future movement."}, {"id": 42, "text": "A very good film, making me think more about how I live, what I do to support my personal believes. I knew little about Great before it, but now got completely charmed by her and will follow. Nothing in her words or actions seemed ignorant, childish or that of a 'depressed unhappy girl'. I wish I could be so brave and strong. A very-very worthwhile film! It brings a strong message in an interesting way, but mostly just shows how this girl acted, felt and why she said what she did."}, {"id": 43, "text": "This movie was a beautiful look into what it's like to be thrown into the world stage as a young kid. I loved the emotional look it took on Greta's story, and how it showed the support and backlash she received. An important message about climate change and how the world treats child stars. A fantastic journey."}, {"id": 44, "text": "In a time when there are so many kids in the west developing mental health issues because they are growing up in a time of self imposed cultural breakdown, this documentary is perfectly positioned to teach parents how to use their mentally ill children to gain fame and make money. No longer will your mentally ill children simply be a burden or someone you need to support and protect. Now you can throw them into the public spotlight and expose them to all of the hate and division of the entire world to make a few bucks. Be sure to do this before they reach adulthood though, otherwise they may turn into productive members of society and leave your pitiful loser self in their dust."}, {"id": 45, "text": "An insightful documentary about an inspiring girl who seeks to bring attention to a touchy topic."}, {"id": 46, "text": "Totally biased film about an exploited child who has no real idea what she is doing. If you take the view her parents are 100% right in their radical eco views, then you will love this. If you have some doubts about what they are doing using this child to 'sell' their views to the world, then this flim will make you realise the truth. If you see what the parents are doing, then you will be appalled like me. They remind me of those evangelical preachers who use their children to 'sell' their rubbish - and make no mistake, her parents are making money doing all this."}, {"id": 47, "text": "As a young adult myself I take so much inspiration from Greta speaking up. She never let herself be silenced because people thought she was too young, or shouldn't concern herself with the world, or told her to go back to school, or discredited her voice because she was a young women. The courage to speak is far more important than the people who will tell you to shut up. I can't believe there are people out there really so intent on hating this teenager. Is it because she is a woman? Because she is out spoken? Because she is holding our politicians responsible? I don't know. But I do know that I want to be like Greta when I grow up."}, {"id": 48, "text": "I loved it! Watching someone sacrifice things for what they think is most important was so inspiring. I love that the film didn't sugar coat what it is like to all of a sudden have everyone in the world look at you. I can't imagine how Greta deals with being on the public stage, even having some of the most powerful people in the world say awful things about her. She belongs where she says she belongs. Children's voices are so important, and, we need to listen."}, {"id": 49, "text": "This documentary shows a young Swedish girl who sees the damages of climate change and is trying her best to do something about it. The movie unveils her determination and her courage to voice up the world's biggest existential issue, amid dead threats against herself and her family. Her message carries her sincerity in this fight, it is truly powerful and inspiring. The documentation exposes her true personality and reveals her true-self. After seeing this documentary, I am convinced that no one can manipulate her. Why can't a teenager be smart? Why can't a teenager be a true leader? I am so proud of this Generation Z! This is a remarkable film showing the struggles and the journey of a remarkable person.Thank you Greta for what you are doing to save our planet! You are no more alone!"}, {"id": 50, "text": "As Greta said, we need to start treating the crisis as a crisis so when we are older we can look back and say that we did everything we could. You cannot ignore the science. Wake up and connect the dots already."}, {"id": 51, "text": "I don't know about the people who rated ridiculously low but i think this documentary is saying greta was like many people, living her life but then when she found out no one is actually doing anything about climate crisis she had to stand up &amp; warn the world about the importance of it to DO SOMETHING &amp; as we see, it takes a huge amount of responsibility for a child like her traveling the world to say the same things over and over to wake people up. she takes the responsibility unlike so many people that just use slogans but in their real lives they don't do much about the climate change. she's doing this to inform us about our own future that's at risk not to be a celebrity or anything &amp; the documentary portrays it well. i'm blown away by the people saying she's a puppet &amp; it's all staged &amp; take it as reason to rate it low."}, {"id": 52, "text": "Some are missing the message here and the hateful reviews insulting a young person's appearance, intelligence, and personality are disappointing. This film actually doesn't blindly glorify this young girl. Instead it gives a very important glimpse into the way we have created a fandom dedicated to her, against her own wishes and message. She wants a fandom for our living planet, not for her own image. She wants conversation and change, not attention and selfies. This film highlights that and should make us all consider ways we can truly take action."}, {"id": 53, "text": "Everyone will suffer the consequences of poor environmental management,so have a little respect for what she is fighting for."}, {"id": 54, "text": "The movie really shows how much work and effort we will have to put in in order to change our world for the better and save our children's future. Also gives you the courage and motivation to join your local FridaysForFuture Group! 10/10!"}, {"id": 55, "text": "This is a great documentary that show Greta's rise to stardom as the most inspirational climate activist of our time! We get glimpses of nice moments with her and her family as well as her interactions with adults that unfortunately aren't taking her message very seriously.I am shocked by the number of one star reviews that have less to do with the documentary but the people's dislike of her.Please don't let that deter you from watching the documentary and doing more about climate change!"}, {"id": 56, "text": "It was wonderful to see the love and support from her mother and father. It is definitely worth watching. You can ignore the negative reviews, many of which are coming from right-wing extremists."}, {"id": 57, "text": "There's a lot of trolls that haven't even seen the movie giving it 1 star. Watch the movie and make up your own mind.Greta is truly a remarkable young woman and she's fighting for humanity's biggest issue. Lovely documentary."}, {"id": 58, "text": "I have to admit that I heard a lot about Greta, but after this documentary I finally understand the importance of her actions and what really matters. She is a beacon of true purpose through every single person on this planet, with a very simple request... Please listen to me!!!! And she is right!!!"}, {"id": 59, "text": "I watched this the whole way through to make sure it didn't get interesting...well it didn't and I'll never get those 97 minutes back in my life. Should be able to give 0 stars"}, {"id": 60, "text": "My favourite part of this film is that it reserved judgment one way or another about the subject that they were covering so intimately, which must have been quite a tight-rope to walk, but they succeeding in this perfectly.I don't usually comment on others' reviews, but I have to add that I suspect the vast majority of people giving this a 1/10 (a 1? Those aren't serious votes or Leni Riefenstahl's films would all get 1/10 if the only merit measured is the popularity of the subject matter, come on now) I would bet my left arm never watched this film at all, at most they have read synopses of parts some alt-right website found a hair to split with on Facebook or 8chan or wherever, and are basing their votes purely based on what their particular political cult tells them is bad or good.So don't heed the low rating this gets on IMDb, this really is an emotionally engaging and insight film no matter whether you are someone who even doesn't believe man-made climate change is real. I watched this with one guy, an Engineer, who thinks climate change is actually due to environmental encroachment. the other one a QAnon-believing III%er, and we talked about the film for a good two hours afterward, which I think is a sign of a successful film in my books."}, {"id": 61, "text": "For many it was former U.S. Vice President Al Gore's slide-show presentation of a documentary, An Inconvenient Truth (2006), Greta Thunberg cites a video she saw at school on polar bears endangered by the loss of sea ice from climate change, and for others it's been Thunberg's activism spotlighted in social media and for still others it very well could be I Am Greta that awakens them to the perils of global warming. Motion pictures are powerful that way. Such reflexive musings occasionally made by Thunberg--she also compares her travels and rise to fame to as if she were living in a movie-- aside, I didn't have high expectations for this documentary, as I'm not usually very interested in such cinematic lectures or celebrity profiles. That I Am Greta hasn't received stellar reviews, albeit more positive than not, from the sort of entertainment critics that tend to be predisposed to such material wasn't heartening, either. But, I like the observational approach of the camera here mixed with Thunberg's narration, and director Nathan Grossman got quite the scoop capturing the teenager's initially-solo school strike outside the Swedish parliament and building it up into a saga of the schoolgirl crisscrossing Europe, meeting world leaders and inspiring other children around the world, before ending with a climactic sea voyage across the Atlantic to admonish more politicians to their faces at the United Nations in New York.Thunberg says her activism isn't about her but rather about the issue of anthropogenic climate change, but Grossman is right to keep the focus on the star here, and she's adroit at exploiting--her, not her parents or whomever else, as is made clear in the documentary--her position as a Swedish child, including one with Asperger's, to do what no adult could really get away with--making being curt and passionate in her lecturing come across as inspirational and appealing to the paternal instincts of the supposed adults in the room. I mean, besides the ones who are despots or childish nincompoops, or both--your Bolsonaros, Putins, Trumps and Piers Morgans of the world. It's impressive how she's built a following and movement and has leveraged it to put pressure on leaders and figures who care about governing--the likes of Macron, Merkel, the Pope, even former governator Arnold Schwarzenegger. One of the common laments of I Am Greta seems to be that it won't convert anyone from the other side. Yet, in an age when science is denied for political reasons and others are demonized even when they're a teenager, that was never really a possibility. Thunberg has the right idea focusing on her peers who haven't yet grown into a feedback loop of confirmation bias, conspiracy theories and misinformation. The science here is established, so her role is to push her movement to galvanize the adults capable of accepting responsibility and scoff at the rest of them.The best exchange in the whole movie, though, is the first one. An old woman approaches Thunberg to reprimand her for not being in school, to which Thunberg retorts that there's no need for an education without a future. Two years later, at 17, she's already been more altruistic and influential in her career as a climate-change activist than whomever that old woman was or most of us ever will be. Even those who don't understand the greenhouse effect or comprehend the dangers of humanity's destruction of nature even while a resulting pandemic rages should be able to see the irony there."}, {"id": 62, "text": "Ignore all of the reviews here by the flat earth, climate deniers. Imagine being an adult and having nothing better to do than come on a movie site and LIE about a movie you haven't even seen.The movie follows Greta from her earliest time in front of the Swedish parliament, through all of her events in Europe to her speech at the UN. You are given a front seat at the events but also backstage as she travels to the events, works on her speeches and struggles with the burden put on her as a teenager.And the way I know that the flat earth folks haven't seen the movie ? Greta writes her own speeches with little or no input from anyone. There is NO ONE whispering in her ear or handing her something to read. And when short comments are called for, she delivers them off the cuff like someone who has done it all her life.A great doc about a remarkable person. A shame that so much hate is shown to someone who is a true leader in our very screwed world.Update - 9 of 24 people who read my review liked it. I am going to suggest that the other 15 haven't even seen the film. They are just here trolling anything Greta. Sad wastes of skin."}, {"id": 63, "text": "Last night it was so refreshing to be back at the cinema for the first time in a few months. It was a good cinema experience as well, only a few people went to the movie and none of them thought it was a good idea to text or be annoying in general, I have one complaint though, I hate leather seats so after about an hour my bum was really sweaty and uncomfortable no matter what position I was sitting in. Besides that I don't have any major issues with I am Greta.Greta Thunberg is a really interesting person I wanted to learn more about before going into this documentary. By the end I got everything I wanted out of a documentary like this one and more. I knew she had Aspergers but I didn't know about her struggles with anxiety, depression or selective mutism, I can only applaud her for doing so much public speaking and pushing past all of these things knowing that nobody else is going to stand up for what is right. If you think these disabilities mean that Greta should not be taken seriously then you are an idiot. Often times people with aspergers have very high intelligence, great verbal skills, ability to absorb and retain large amount of information, ability to think in visual images, be very self motivated, ability to think outside the box and generate novel solutions to problems (like climate change) and might show a strong aptitude for a particular topic. The list goes on.The presentation was a bit bland and some of the shot composition made it tough to know what was happening in only a couple of scenes. But I understand that when filming a documentary often you can't get the ideal shots and have to work with what you have. I also thought that the one soundtrack song was really out of place and was very unnecessary, the score was fairly generic but it was effective. I would have liked to see more of her internal struggle before attending the protests and I would have liked to see more of how it was to travel on a boat for 15 straight days as well.My favourite part of the entire experience was exposing many world leaders for being phony and not listening to what Greta and the thousands of protestors from around the world are saying. A lot of the current world leaders simply refuse climate change calling it a hoax and saying that the science is faked, or they just aren't acknowledging that it is a crisis. This is so ridiculously arrogant or just stupid, either way do we want anyone like that in charge of our country?Climate is a colossal issue that absolutely has to be acted on soon or there will be no future. If you refuse climate change or think that because Greta has asperger syndrome, OCD and selective mutism she is uninformed and lying about this issue you don't deserve to be in the position you are in right now, all you are doing is destroying our planet without thinking of anyone but yourself, you are arrogant, uneducated, and selfish."}, {"id": 64, "text": "When I queued this film on Nt**x's I saw their best guess for me was 3 out of 5 stars. Which just goes to show you what crap their algorithms really are. Granted I would have given this film 5 stars just for the subject, because so I admire her for what she's done; the movement she started.. But it was also a very well done film. A short look behind the curtain of public persona. No doubt the fright-wing trolls and MAGAtards will flood the IMDB with bad ratings while never even seeing the film, but it's a wonderful docu abut a wonderful child. And precocious as she can be, Greta is very much a child. She has a few short tantrum moments during the film that prove it But that is not a disparagement of her. It's an indictment to the rest of us; the 'supposed adults' who just want to carry on the compulsive shopping spree while the world burns and drowns, like anti-mask 'Karens' demanding their delusional constitutional rights to poison the rest of us with their disease and stupidity. Support this film. Support climate legislation and regulation of carbon gasses. And support Greta. Because she was right when she said she shouldn't have been the one confronting climate change at the U.N. It should have been one of the adults. But it seems she was the only grown-up in the room."}, {"id": 65, "text": "In a year where so many activists and their causes are being (rightfully) spotlighted, it was practically a foregone conclusion that Greta Thunberg's crusade would be among them. Nathan Grossman's I Am Greta takes a closer look at her mission for climate change awareness, following the extraordinary young woman from her earliest protests in Stockholm to the moment of her impassioned speech at the UC Climate Action Summit in 2019 where she indicted world leaders for their inactivity with perhaps the most important issue of our current moment.As undoubtedly essential as her efforts may be, Grossman's film captures the life of a young woman with much more ambiguity than one might expect, to lesser effect than one might hope. Following Thunberg not only through her speeches and public appearances as her celebrity on the world stage grows, but her family's management of her schedule and health while she deals with Asperger syndrome, I Am Greta reiterates the importance and urgency of climate change awareness voiced with merciless accuracy through her impassioned pleas, even as it hints that her motivations may be as self-serving as they are altruistic.Grossman's film starts when Thunberg was just 15 as she begins her first climate demonstration, sitting alone outside Stockholm's capital with a stack of climate change facts under a rock for passersby. Her school strike slowly attracts the attention of the media, leading to a speaking opportunity at the 2018 United Nations Climate Change Conference, the first in a series of public appearances that makes her a star and a symbol among activists. From there, she and her father must figure out the logistics of traveling via automobile or train to attend these events, after she challenged her family to reduce is consumption and carbon emissions, including by not flying no matter the distance.Grossman doesn't explain exactly when and how he knew what a celebrity she would become - or how he managed to win the family's confidence - but the filmmaker captures what become watershed moments in her fledgling career as an activist; he is present, for example, when a UN representative calls from Germany inviting her to attend the conference. But whether it's as a matter of Thunberg's disposition or possibly her disability, it becomes difficult to determine exactly how she feels about being hoisted up on a world stage to talk about issues that she believes are so vital, especially after we learn how alienated that she is socially from everyone outside of her family.Given their dynamic - the disciplined Thunberg often seems more like a parent to her shambolic father Svante than the other way around - it's similarly hard to get a grasp on exactly how they feel about these opportunities for visibility. (Her father's career as an actor and her mother's as an opera singer are never mentioned.) It's clear that they love her, but is putting her behind some of the world's biggest microphones, and as a result, making her one of its biggest targets, a healthy trade off to compensate for her idiosyncratic emotional needs? Or is it good for the family to center itself around her activism at the expense of her parents' own ambitions?Svante addresses Greta's well-being, but the rest is never explored, and it leaves major questions about the true cost of her activism, and about how important (and even possible) it is to not be a hypocrite when supporting a cause like climate change. Greta refuses to use air travel, but she also uses a microwave, Sony headphones and a Macbook; is the carbon footprint of these devices, not just in their use but in their making, small enough to legitimize them? To be fair, there are few people who more determinedly practice what they preach than Thunberg - culminating in a long boat trip from Sweden to New York for Climate Action Summit. But are there not compromises that can be made, or are being made elsewhere, especially when a young woman's health and comfort, both physically and emotionally, are at stake?Again, what the film does best is showcase her campaign in the context of world leaders, from Emmanuel Macron to Arnold Schwarzenegger, and how her example inspires them, but reveals the differences between a principled teenager and politicians reporting to constituents, the media, and of course moneyed donors. Thunberg receives criticism that she doesn't create concrete solutions to reverse the effects of climate change, and honestly the movie doesn't adequately counter that criticism, instead focusing on her fiery speeches. She has the luxury to think about solutions without contemplating the potential economic realities, and the logistical feasibility, of accomplishing them. But is it truly her job to do otherwise? Meanwhile, addressing climate change through policy has by and large been purely cosmetic, a show of force rather than a real effort. That the movie doesn't indict these leaders or quite validate Thunberg's point of view - except as a sense of urgency that must be met to save her own personal sense of well-being - once again conjures some interesting questions.These juxtapositions between a kid with special needs and one who's predictably stubborn, an activist with unshakeable beliefs and one whose beliefs become a tremendous burden given her age, a family trying to care for their daughter and one trying to hold it together, and between a cause of absolutely vital importance and one for which there are few immediate, easy solutions (at least in the eyes of the powers that be) form a fascinating tapestry that propels the documentary to its final scenes. Greta braves an ocean voyage, the ultimate expression of her commitment, expressing her doubts and desires to relieve herself of this burden, and then speaks in righteous anger in front of the world's leaders before presiding over the biggest climate demonstration in history. As much as it seems like a victory, a caption reminds viewers that five years after signing them, no countries have yet lived up to the requirements of the Paris Climate Agreements, and as many have been inspired by Thunberg, she faces more criticism from media pundits and political leaders than ever before.What becomes clear is that Greta is, unambiguously, a hero. When her disability threatened to derail her life, she turned her fixation on climate change into a solution rather than a symptom. And so what she's experienced since then is nothing less than a hero's journey, fighting opposition, facing adversity, reckoning with the personal demons that would keep her from fulfilling her destiny. That she hasn't yet accomplished this enormous task is not surprising. But I Am Greta spotlights a more universal and important truth, which is that heroes are never perfect and seldom uncomplicated, because what they are fighting for is never easy."}, {"id": 66, "text": "Reading through all the negative and incoherently stupid comments about Greta and this film is bewildering. Why all the hate? Are they being paid to be trolls by large companies with vested interests against what she's saying? Not impossible.Here is the story of how a global movement against the largest threat humanity has ever faced was sparked by the decision of a 15 year old who decided not to go to school one day.The film is deeply personal and is largely follows Greta in the months before giving her UN Climate speech. Her words and her anger resonate, and we see global movements sparked across the globe in seemingly real time, captured beautifully by Nathan Grossman's unintrusive approach.Perhaps the best part of the film was not the speeches or the huge crowds that come together to stand against climate inaction (which were incredibly moving in of themselves) but the quiet moments with Greta and her dad while at home, preparing for long trips, with her dogs and horses, and travelling around the world by train, electric car, and boat.In these scenes we see a young girl - outside of the hysteria of the media and the protests - who simply loves nature and the planet. How anyone can dislike this person so much, even send death threats to her and her family, is beyond me."}, {"id": 67, "text": "Post-Covid cinema return with Gertie.Slickly assembled, politely intrusive and sometimes affecting; I Am Greta fleshes out the eco-warrior and her supportive family. Greta herself quips a very surreal movie because the plot would be so unlikely.Scenes between Greta and her omnipresent father are the most touching, particularly instances when he pleads her to make time in her gruelling schedule to eat (a banana). And of particular interest was Greta's uncomfortableness with the prospect of heightened media interest.It all concludes with the epic, horrendous sailing to New York. I don't want to have to do all this, she tearfully confides as waves crash against the hull. It's too much for me. Greta is visible in her truest and most relatable form: a frightened young girl at the mercy of a natural world she hopes to protect, who simply wants to be at home with her dogs."}, {"id": 68, "text": "As much as it may seem like Greta Thunberg could be a puppet that's been planted to further a cause, that couldn't be further from the truth. Greta started her climate protest completely alone, sitting outside the Swedish parliament with her little placard, just over 2yrs ago, and in many ways, she's still alone. All of the media frenzy and being put on a pedestal were never something that she wanted, but her drive has remained the same right from day one.The film begins with her sitting on a small sailing boat careering across the width of the Atlantic Ocean in treacherous seas to avoid the need for flying. Even at 16, she is prepared to do what she has to, to avoid the venom of her detractors, and there have been many detractors, up to and including several known Presidents.Whats really cringeworthy in the film is how so many politicians want to take a selfie with her, clearly to make it look like they're doing something proactive, but Gretas (quite obvious) refusal to smile in these self centred attempts at righteousness makes the photos speak for themselves.Its a bizarre world where grown men and women will attack a child, even including making fun of her Aspergers, when they feel the silver lined status quo they have been enjoying might be getting threatened. But Greta has never said anything that isn't based on science, but then most people don't read science, they read football scores, watch celebrities on TV, and snack on their McDonald's. How dare a little girl suggest that all is not well on Planet Earth? I mean that's just not right, is it? But hey the Pope says he's behind her, and the entire Catholic world too, so maybe those death threats she gets arent too much to worry about. Not yet anyway.This is not a particularly happy film, the scenes later on in the movie where she's on that small yacht (crossing the Atlantic) crying and wondering what's she's doing, is magnified by the ghostly wail of the wind in the rigging and no land in sight. But here we are, looking at a child bringing more attention to the climate cause than any adult probably ever has. It's enough to make most of us feel inadequate.The conclusion shows what happened in September 2019, just one year after Gretas one girl protest in Sweden, where over 7million people across the world marched to make their voices heard about the lack of action on climate issues. And this will undoubtedly go on, despite the (diminishing number of) detractors that are out there. I guess you just can't ignore what's happening any longer.An interest documentary if you want a little insight into how things started."}, {"id": 69, "text": "I've been following her since this started to snowball and watched this wanting to know more of her.We see her and we learn about her and see her growing through the months but I find the documentary omitted an important bit which happened just after the how dare you moment. She realized she should not be the main figure and instead started asking people to research and, among all, read the IPCC (Intergovernmental Panel on Climate Change) report.I know that part is boring, it is, but is also very important.I cannot strike enough how I didn't even knew what that was until she mentioned it, over and over again. So, thank you Greta, for your job and your movement.The documentary though is kind of meh."}], "reviews_amount": 70}