{"name": "Miami Bici", "titleId": "tt10993566", "reviews": [{"id": 0, "text": "Is very bad where we are in this moment with Romanian cinematography and culture of people that came on movie theaters"}, {"id": 1, "text": "I would have given it a 2 but friends of the cast are giving it 10 and haters give 1 so I am trying to balance the score a bit. It is a sad, failed movie attempt, the scenario is really bad, the acting is horribly embarrassing. You people cannot act, stop torturing us with these shameful performances. 5gang and now this, just stop. The humor is lacking, jokes can maybe seem somewhat funny to a halfwitt, Dima and Maticiuc are imposibile to watch without feeling sorry for them. It's simply a really bad sketch, cause no one can call this a movie. I know Netflix is notorious for broadcasting a bunch of really bad movies but how desperate can one get?"}, {"id": 2, "text": "... and make a movie about nothing with nobodies. Except Florin Piersic Jr. which most likely needed money and also acted as good as a good actor can act in a movie like this."}, {"id": 3, "text": "If you like the Manele, you'll love this movie. The Manele are the foundation of the current romanian culture and this was nothing but a long videoclip of a masterpiece by Dani Mocanu."}, {"id": 4, "text": "If I could have voted minus a star, I would have definitely had it! It is an insult to one's intelligence and generally to Romanian comedy! Unimaginable stars for such a terrible script and horrible performances! Too vad for the scenery!"}, {"id": 5, "text": "The whole movie is a mess, can't really call this comedy, worst kind of humor. Low budget, waste of time."}, {"id": 6, "text": "The first of all the acting was so bad, from some yt and instagram influencers. The sound contain manele, the romanian gypsy songs to make proud all the fans. Better save the money the time and your popcorn. And even the editing was bad, i see some fanboys here with the 10/10 rating. Most of the scenes are there just to have, 1hr and 30 min of the movie."}, {"id": 7, "text": "The worst movie I've ever seen. An extremely stupid text, bad jokes and such a fake script. Some ideas were taken from famous movies, drugs, mafia, police and this s&amp;!t came out.I lost an hour and a half of my life for nothing. Another movie from the 5GANG series."}, {"id": 8, "text": "Can't figure out how this movie has such a big rating."}, {"id": 9, "text": "We've seen it in the cinema and it's a waste if time and money!!!! So lame second hand actors and jokes... Save your time and money!!!"}, {"id": 10, "text": "I have never seen a more cringey and unfunny movie in my life. You can literally use it as a torture material for your enemies. Plain stupid and overused jokes, unrealistic characters (take the example of the grandma or Ion's girlfriend), bad acting, poor and unbelieveable plot (as if anybody could get a Visa, get to America and start smuggling drugs). Totally unwatchable, don't waste your time with it."}, {"id": 11, "text": "I don't know what else to say, the title says it all... It's sad this movie is popular in my country whilst other type of art form is rarely appreciated."}, {"id": 12, "text": "Nu merita... bad acting, bad plot, bad evetything."}, {"id": 13, "text": "This is a disgrace to cinematography industry. The leading actors have nothing to do with the entertaining industry. The whole movie was just bad, the director knows nothing about movie making and the jokes pretty much sucked. I can absolutely say that I lost 1h30 min of my life watching this crap. You can totally skip this movie. The 7 star rating is the only funny joke here."}, {"id": 14, "text": "There are some scenes where you smile, but that's it."}, {"id": 15, "text": "Insanely bad acting, bad jokes, a lot of swearing, some Romanian gypsy music. Don't waiste your time!"}, {"id": 16, "text": "Waste of time. how the hell does note 7 a movie mess"}, {"id": 17, "text": "After 10 minutes I realised it was a complete waste of time: stupid jokes, bad acting. I don't understand the high rating 😳"}, {"id": 18, "text": "Stupid jokes, stupid acting, stupid cursing, basically everything about this movie is lame."}, {"id": 19, "text": "Don t waste your mony and your time.I regret I wached it, it s a shame for RO"}, {"id": 20, "text": "All I can say is that the director did a very poor job: the scene cuts are very badly done, the angles are all over the place. The dialogue is also quite bad. I gave it a 6 because I understand the jokes and some of them are quite funny."}, {"id": 21, "text": "I saw this movie on Netflix and it was a waste of time. I recomand better to watch the romanian series from local tv, they are fun with better actors."}, {"id": 22, "text": "If I would I have paid for it, I'd asked for my money back"}, {"id": 23, "text": "It's a disgrace, an insult at the Romanian cinematographic industry"}, {"id": 24, "text": "A rich idiot from Romania makes a movie. That's all to say. Bad jokes, stupid story.. don't waste your time. Life is too short to watch this movie!"}, {"id": 25, "text": "I think that they put all their relatives to vote the movie.The normal rating should not be higher than 1 star. There is nothing good in this movie.Horrible acting !Please avoid wasting your time !"}, {"id": 26, "text": "People who are saying that this is the best Romanian comedy have clearly not watched any Romanian movies in their lives. This is a disgrace, an insult to the audience's intelligence and a waste of time. Matei Dima is a very funny content creator but as an actor he is rather disappointing. Codin Maticiuc simply can't act and should not make any more movies - please spare us. The scenario is so bad! I wanted to be entertained but I simply could not. The jokes are not funny, they're just recycled and sad. Everything about this movie is a failure. I took one for the team and watched it, so you guys can pass."}, {"id": 27, "text": "There are no words to describe this mess of a movie. A train wreck from start to end. It didn't make even smile."}, {"id": 28, "text": "Low budget movie, pointless script, bad acting... it's a shame that it has such good rating:("}, {"id": 29, "text": "Horrible it was made for idiots and...we have many way too many"}, {"id": 30, "text": "Jesus what of piece of crap. Bad script, bad collage, bad all!"}, {"id": 31, "text": "It's not so good but it's ok compared to other movies that came from Romania. But the jokes are all unfunny and just why? I am not hater it's just my opinion but it's not a good movie and I feel that it's so overrated."}, {"id": 32, "text": "I'm ashamed to be a Romanian while this movie exists!"}, {"id": 33, "text": "Worst movie with bad cast, bad acting. Nothing good about this one"}, {"id": 34, "text": "I am from Romania, and most of the jokes should be funny right ?? Wrong. You can guess the plot in like 5 min and all the setup for the jokes. The lead actors are not actors and you can see that quite clear. I don't understand how this movie has a 7 rating, but trust me, it's clearly not a 7, not even a 4. Don't waste an hour and a half watching this like I did. Really happy I did not go to the cinema like some of my friends did out of curiosity."}, {"id": 35, "text": "I do not recommend. It is a poor and painful scenario. It puts the country and the people from Romania in a bad shadow .... Totally waste of time"}, {"id": 36, "text": "Totally disapointing: poor script, poorer acting..the only joke they rely on is a wrong translation...and they transformed that in the Main thing of the movie, other then this, just a couple of rich kids that tried to prove they could be cinematographers...PS: Mateciuc's other movie Faci sau Taci...far, far, greater (still had a poor acting, but at least the script was great)"}, {"id": 37, "text": "That is a very poor movie, i could not laugh at any of the so called jokes. don't waste your time"}, {"id": 38, "text": "Worst movie ever... Super bad acting, dumb plot... Terrible movie made by amateurs..."}, {"id": 39, "text": "I left the cinema still waiting for something to happen. The build-up to the climax of the movie wasn't cohesive and the acting wasn't too good. I gave the movie two stars because of the plot, which had potential, but was badly executed. The whole movie was only a showcase of money (expensive locations/cars) with poor cinematography. To top it all, a powerful female character is introduced, but she dies within 10 or so minutes after she had been presented. Why would you add a character to your storyline if it has nothing to bring to it?"}, {"id": 40, "text": "Worst romanian comedy ever !!!!!!! This people can.t be named actors !!"}, {"id": 41, "text": "I'm giving this movie two stars because of the grandma's acting that was actually natural, and genuinely made me laugh. Even though she had a couple of minutes of screen time in my opinion she stole the show. Other than that, toilet humour, rehashed jokes,bad acting.... very bad acting. You can see Matei Dima is more familiar with. Being in character but Codin Maticiuc was just painfull to watch. I'm sure they had good intentions when they made this movie,but let this be a lesson to go back to what you know Dima, and that is sketches. And Codin, go back to smoking cigars and being arrogant."}, {"id": 42, "text": "One of the lame movie i ever seen in my life. Only one actor in this movie wich is not acting at all..... This movie is a shame...."}, {"id": 43, "text": "Basic cringy jokes, bad plot, bad acting. 2/10 The jokes are just rip offs, even the poster is a rip off. It's sad because of the hype which was when this movie came out ."}, {"id": 44, "text": "I don't write reviews, but I had to this for this movie. Don't lose your time with this movie."}, {"id": 45, "text": "A bunch of cliches, bad acting, bad story. Doesn't worth the time. :("}, {"id": 46, "text": "The only thing i liked in this movie was the hamster🤣🤣 Very bad plot and stupid jokes .."}, {"id": 47, "text": "There are a lot of good Romanian films out there, this is certainly not one of them! I personally felt embarrassed all the time while watching this movie. The same old trite bad jokes already heard and used in a million other mediocre movies with B list actors not the mention the random homophobic remarks passed as jokes. The acting is horrible with a very few exceptions. Save yourself some time and don't watch this movie."}, {"id": 48, "text": "The best Romanian comedy movie I have seen so far contains jokes as well as judgments so to be honest this makes a funny comedy film but you have to be familiar with the Romanian culture or the Romanian language to understand the movie, anyway. I recommend the film with confidence but let's not forget the main actors who were brilliant, congratulations Bromania and"}, {"id": 49, "text": "Ragaieli mioritice cu iz de shaorma ajunse peste ocean, glume de  Baieti de oras, subtilitati gen ' 78, Borat wanna be, alta mizerie . Succes in continuare!"}, {"id": 50, "text": "What a waste of time. I only watched the first 25 minutes. It is so lame, there is only bad acting and the music is horrible!"}, {"id": 51, "text": "I do not recommend it, very poor directed and played!"}, {"id": 52, "text": "Gave it 5/10 just because they tried something different. I mean the comedy in its essence was decent, I've seen worse comedy titles. But the movie is just bad overall. It feels rushed and I can understand that because of the budget and everything they had to take it out pretty fast. Kind of all the jokes were because they didn't speak good english or just translating from Romanian to English in a wrong but somehow funny way.Anyway, good initiative. Keep it up and next time please just take your time and go for some more quality."}, {"id": 53, "text": "Please don't watch it, it's execrablei,... i lose 40 minutes from my life...."}, {"id": 54, "text": "The movie is a shame for Romanian movie industry! Bad acting, full of swearings and stereotypes, idiotic concept!"}, {"id": 55, "text": "A cliche-ridden film that wants to be a comedy but fails and not even admirably. A movie created by two so-called influencers in Romania that claim they are actors/directors - what can you possibly expect?"}, {"id": 56, "text": "I am Romanian and I hoped this will be a decent comedy, for a Sunday afternoon. But I think I had my hopes up. The movie is bad, acting is bad, script is bad, one of the worst movies I saw in my life. I give it 2 stars just because they have Romanian actors. Actually not even that. Romanian media people who thinks they are actors."}, {"id": 57, "text": "We laughed for how bad it was...I don't know how some people can recommend it."}, {"id": 58, "text": "The best romanian comedy movie! Congrats to Matei Dima and Codin Maticiuc!"}, {"id": 59, "text": "I was so impressed that this comedy is made by romanians. Good work."}, {"id": 60, "text": "Big like! Comedy to the NEXT level. Must see this movie!"}, {"id": 61, "text": "Yes, it's not a Hollywood movie, but it's the best one when we're talking about actual comedy in Romania. It's reflecting very well the Romanians dreams and aspirations about living the American dream."}, {"id": 62, "text": "I feel sorry for the people who payed money at the cinema to watch this garbage. I've seen just 30 minutes and deleted the movie. It's bad în every aspect"}, {"id": 63, "text": "The film displays the reflection of some Romanian typologies, it's a pamphlet"}, {"id": 64, "text": "A really good romanian comedy . I laughed the whole movie"}, {"id": 65, "text": "A  ROMANTIC  COMEDY WHICH I LAUGHED AS I DIDN'T LAUGH AT A ROMANIAN MOVIE. FUNNY FUNNY VERY FUNNY...."}, {"id": 66, "text": "This movie is a parody, and a very funny one.i really laughed at most of the jokes, but if u are foreigner u won t get the jokes. I liked the way it s directed"}, {"id": 67, "text": "Let me call it this way. Movie goes from bad to worse :). But ... there is always a but. Taking in considerations that Mr. Dima is a vloger and not an actor or even director or whatever is called the movie can be called good-ish to bad-ish. I really admire the effort they done but i struggle a lot to finish it (just my personal opinion). I bet the next one, if there will be a next one, it will be better. I will give a 10 out of 10 for Letitia Vladescu and Florin Piersic Jr. if there was a rating category for actors. Keep up the good work guys. Eventually you're getting there."}, {"id": 68, "text": "Best romanian comedy... waiting miami bici2 Yes if you don't know romanian language or you are not familiar with culture you don't understand all the jokes... but still the best comedy"}, {"id": 69, "text": "One of the best Romanian movies. Great job guys!! 🙌🏼👏🏻💪🏻"}, {"id": 70, "text": "It is a comedy that i haven't expected to laugh. It represents some poor people in Romania and making fun of the situation they live in. I started for the first time an account on imdb just to say: Good job guys!PS: First you have to be Romanian to understand this film, and second if there where other movies like this my rating was probably 5 max."}, {"id": 71, "text": "It's kinda cheesy and corny. Too much swearing, bad jokes and gipsy/ latino songs. I barely laughed. I bet you did the same, too."}, {"id": 72, "text": "I made an account on just to be able to give this movie a 10/10 rating. It's a pure comedy, and it gives you such a good vibe. You need to know the romanian culture to be able to fully appreciate this movie. The producers had the courage to do everything that the other big romanian comedy(Suge-o Ramona) was too afraid to do. And yes, I'm talking mostly about the 'Manele' and the classic Romanian insults. Go and watch it!"}, {"id": 73, "text": "A movie filled with all sort of jokes, very good actors. I really enjoyed it. Actually the whole audience was laughing. Mixing Romanian culture with Miami scenery, that was risky - you either fail or triumph. Great movie!"}, {"id": 74, "text": "I fkin loved it; i'll go see it again soon, that much i loved it!O comedie cu de toate!"}, {"id": 75, "text": "Nothing is perfect but I give it a ten! As a minus is the fact that some jokes are expired but some are....mindblowing!!!! It contains romanian and american jokes. I love it so so much!!! Can't wait for part two!!!"}, {"id": 76, "text": "I saw the movie at the cinema and I must say I only went because I like Codin and I support him in this cinematographic journey that he started a few years back. Even though my expectations were not high, the movie was absolutely hilarious. I really loved it. People were laughing all throughout. Bro was really good for a beginner and Florin Piersic Jr was the cherry on the top. Big like Can't wait for the sequel. Lots of love"}, {"id": 77, "text": "Wow, i was reading some of the reviews and i was surprised seeing this much hate and tragedy wrote by the previous people Let s get the things straight: this movie is a comedy, the purpose of a comedy movie is to make people laugh. Aaaand this is what the movie did to me. I laughed. I think it s the first romanian movie which i actually enjoyed and laughed from the biginning to the end and even watched it at the cinema and then during the pandemic on netflix. So yeah, i m one of the pariah that s waiting for the sequel haha"}, {"id": 78, "text": "Congratulations, Codin MAticiuc for this movie! GREAT romanian movie, i saw many americani movie worste than this romanian movie. If you are romanian, you understand every Single romanian joke/word.. Romanian life style.. We Will be waiting for MIAMI bici 2"}, {"id": 79, "text": "I watched the movie on netflix. I was happy to see some humor during the pandemic. Jokes are harder to understand for those who do not know Romanian language, but all in all the film deserves more value."}, {"id": 80, "text": "So this comedy is a true romanian comedy, you can't believe it maybe but it is. Coffin Maticiuc and the other crazy vlogger guy that makes Antonia look smart in Vodafone commercials are playing the roles of their lifes. Haven't laughed so good since Mircea Geoana named Prostanacul lost the presidential election in Romania, over night. Good luck Coffin and other guy. The bald one, can't remember his name."}, {"id": 81, "text": "Must watch this The trailer do not show you nothing. Must go to cinema or watch it on netflix soon . Good job guys 👏"}, {"id": 82, "text": "I saw the movie at cinema, in my opinion the story is great and the actors are good in their role. They explain perfect how it's in Romania, and, I'm living in this country so I can confirm what is happening in movie. The movie gives you a good feeling and you can laugh at some scenes, but, the most important is that they show the real Romanian life in a funny way, and there's some truth in it."}, {"id": 83, "text": "This is the best Romanian comedy especially for 15-30 🙌🙌"}, {"id": 84, "text": "A movie made up with small resources, a movie that opens up new challenges for all the people that invested in this, a movie that raises the bar for the Romanian film industry. But mostly more important a movie away from the cultural french movies that were made in the last decade. Fun, easy to digest, a movie that represents the party nature of the balkans and latin blood of the Romanians. Sure there will be always things to be criticised, but at the end of the day this should be taken as it is. There can be only one ending. MY PEN IS BLUE!"}, {"id": 85, "text": "I liked the movie, it is one of the best romanian movies in recent years."}, {"id": 86, "text": "When you have a bad mood you need to watch this movie. E real comedy and i m waiting for a part 2"}, {"id": 87, "text": "I'll give you 10 good movie i have just downloaded from net ... money is gold my friend"}, {"id": 88, "text": "A comedy that will make anyone who knows the Romanian realty laugh !"}, {"id": 89, "text": "One of the best Romanian movies that uses local humor at a hundred procent. The story is very well constructed and it delivers fun until teardrops. Very nice images shot in Miami and fun cliches all over"}, {"id": 90, "text": "The movie is very good. A real romanian comedy. I don't understand why others are so mad about it. It's very refreshing, without cliches and just a very enjoyalbe watch. You won't regret seeing it. Also it has a real strong grandma 💞"}, {"id": 91, "text": "Best romanian comedy. Can't wait for second part"}, {"id": 92, "text": "It was really enjoyable, hands down the best comedy i ve seen this year. It is a fresh type of comedy with a funny plot."}, {"id": 93, "text": "It's an incredible comedy movie. The Vibe of it it's very unique,you can feel the romanian culture. IT'S FUNNY AF"}, {"id": 94, "text": "Is the best romanian movie from last time. Low buget but good"}, {"id": 95, "text": "10 is a small vote note for this amazing movie! Best comedy, best actors, amazing!!! Good job boys!"}, {"id": 96, "text": "Haven't laughed so hard in a long time. Forget about relaxing vacations or spa, watch this and you get instant happiness and relief . Epic movie."}, {"id": 97, "text": "The best romanian comedy! I never thought i am about to see such a good romanian movie."}, {"id": 98, "text": "Best comedy so far. Lots of laughs during the movie, very good roleplays. Worth the money!! :)))"}, {"id": 99, "text": "It's a movie similar to Dumb &amp; Dumber, but with crazier characters. A lot of laughter, aimed at the Romanian public. A lot of energy, fast-paced, and it looks like they tried worked hard on the scenes, not just to film a scene and take the first cut. So, congrats for this movie! The soundtrack is also spot-on.It's what other comedy movies should be, but most aren't: relaxing, makes you laugh, and it makes you feel good."}, {"id": 100, "text": "The jokes are good, some of them miss, but some of them really hit, the acting isn't that good, but for the most part its acceptable. The best way I can describe this film, is that its a really entertaining film, that you can view multiple times and not get bored"}, {"id": 101, "text": "Lots of jokes, you just laugh all the time. It s worth watching it"}, {"id": 102, "text": "It was really funny. I loved it.It was funny and I loved the humor. I hope it will go well, but the cinema was full the day I saw it."}, {"id": 103, "text": "One of the best Romanian movies! In Romania is a real success, congrats!"}, {"id": 104, "text": "A new favorite movie in my list of movies.This Romanian film managed to get me in the story of the film. A good comedy from the last 20 years. This is the reality . True but comical. Some of the actors are amateurs but they played exactly the right way. And for some amateur actors, they did very well. Smart jokes that cannot be understood by everyone."}, {"id": 105, "text": "Good acting since the actors are just in the beginning of their career. Most of people will not understand the jokes because they sound differently in other language then Romanian. Certainly, the most good movie from a Romanian production in the last 15 years. Good luck guys. Good job !P.S There are plenty of Hollywood movies more bad than this one with more famous actors."}, {"id": 106, "text": "BEST ROMANIAN MOVIE !!!! Also, I like Matei Dima a lot!"}, {"id": 107, "text": "I don't get the hate (mostly from romanians) this movie gets. It's not the an exceptional movie. But it's not that bad. it's ok. After the first half things kinda take an unexpected turn (as in some thing coulds use more explaining) but yet again, it's not that bad. I've seen many movies with worse plot holes. I must say, I not a clasic romanian movie watcher. I cannot compare it to the old but gold. I can only say this movies is decent. And i have had a few laughs while watching it. For me. 7/10 is a decent note.( a bit more that what this movie would deserve, but I try to support the local movie makers )"}, {"id": 108, "text": "If you can suspend your arrogance for 10 seconds (or minutes), you'll find that this is a funny, mature, realistic and accurate movie, both in terms of the humor and of the behavior of Romanian immigrants around the world while of course being a pamphlet of it all.I'm giving a 10 just for sheer optimism and encouragement, is it perfect? Absolutely not, it would probably be a 7-8 if I were to take it seriously but it's a comedy, so I will not."}, {"id": 109, "text": "Some funny dialogue, but the story was lacking. Not completely for a Romanian comedy if you watch it at home without high expectations."}, {"id": 110, "text": "Not great, not terrible. Pretty good movie, lots of laughs. One small problem, just like almost all Romanian movies: the voices are too low, drowned by the ambient sound &amp; music."}, {"id": 111, "text": "There were some really funny scenes. I liked the way it was filmed, the colours, the frames, as well as the music. It was really adequate. I also liked the variety of actors in this movie, really international. Some of the things were absurd and unlikely to happen but it was all right. It depicts the actual society in a funny way. Do not watch this movie from a sensitive point of view but try to enjoy the irony about this reality."}, {"id": 112, "text": "It was funny, the actors were good, and the overall filming was good. I had a great time watching it."}, {"id": 113, "text": "Best comedie movie romanian,for me of corse;)) i do not like movie with people from romania i am not rasist but the peope is not good to do that, but this was wow"}, {"id": 114, "text": "The best Romanian comedy movie. Congratulations! I'm waiting for part 2."}, {"id": 115, "text": "One of the best romanian comedy movie! Considering the last comedy movies that appeared on it, you really laugh and here I don't just mean the ones from Romania, I mean all the comedy movies around the world. good luck and I can't wait for the second part!"}, {"id": 116, "text": "Very good movie, so we're waiting for part 2? good luck"}, {"id": 117, "text": "I like this movie. I saw it three times and I will watch the best Romanian film, the best actors."}, {"id": 118, "text": "You can see the lack of experience in the field of cinema, but some jokes and scenes are funny, if you are Romanian you understand them better. it's kind of a satire that needs to be worked on."}, {"id": 119, "text": "Loved it. Very funny and entertaining. Both actors are really good 👍"}, {"id": 120, "text": "Obviously the best movie I saw this year. Keep going guys because you done an amazing work with this movie and I can't wait to see Miami Beach 2"}, {"id": 121, "text": "It's not easy to impress me but this film is really good and fun. Yeah, its about very poor guys. Yeah, it is about mafia! But is a comedy. PS Never, but never, believe that Romania is a poor country!"}, {"id": 122, "text": "Nice and funny movie! I am very excited about its sequel!"}, {"id": 123, "text": "E un film genial!L-as revedea de 100 de ori,il iubesc!Povestea filmului e absolut impresionanta ,e foarte amuzant!Il recomand😁"}, {"id": 124, "text": "I think it deserves more credits... It's one of the best romanian movie made on the last 5-7 years... It's more comedy based on ...so if you're not a romanian...it's hard to understand all of it xd..."}, {"id": 125, "text": "You have to see this movie, it is very good and you will laugh a lot..."}, {"id": 126, "text": "Nice and funny movie. You will laugh from start to the end of the movie. Nice job boys."}, {"id": 127, "text": "Nu cunosc personal nici un personaj , nu sunt abonata la nici un canal media, dar sincer am râs o noapte întreaga !"}, {"id": 128, "text": "10+ The best movie in the last 20 yers in Romania."}, {"id": 129, "text": "For romanian cinematography is not bad. I've seen lots and lots of bad movies with bigger budgets and worse than this. I see a lot of people who rate this movie with 1 but I think this is not fair. If you are very critic you could give it a 6. I've give it an 8..."}, {"id": 130, "text": "Next one has to be more orignal, bla, bla, bla. My rview is too short :=)"}, {"id": 131, "text": "It was a very good comedy. I laughed almost the entire time of the movie. I liked it very much and I recommend it."}, {"id": 132, "text": "Best romanian movie. Funny jokes and great actors!"}, {"id": 133, "text": "It's one of the best Romanian films and makes me proud to be a Roman... Most ratings are given by people who are not Romanians but for us it is a film showing us that you can create a movie with super hard work"}, {"id": 134, "text": "I've seen so many bad reviews and so many frustrated haters LoL. Reviews like if I could give -1start I would do it. Waste of time,life is too short to watch this movie. Or just a rich Romanian making a stupid movie. I would like to know what the hell have you done all your life apart from writing some bad reviews for this movie, any achievements all these years? Anything you can write down on a paper and say here's what I've done my entire life? NO!! That's what I thought. When it comes to movies, the times are changing but it seems these haters are way behind those times. I'm giving 10 stars, and to tell the truth I'm doing it just to see the comments after this 10 stars review even though I know the movie it's around 8 stars. P.S for the haters, let us know what have you done and where have you been all your life apart from Cuca Macaii . Cheers!"}, {"id": 135, "text": "10+ Stars. Haters going to hate. Can't wait for the next one. Good luck to the team."}, {"id": 136, "text": "The story is funny, but there are elements that are forced to be funny, some of them really are funny. But somehow during the movie i felt like they are forceing themselfs to make the jokes sound good. And that is not ok. The film must have a cursive script, without being pulled by the hair, and without forcing jokes. I consider that the bad guys aka the traffickers, play very poorly ..."}, {"id": 137, "text": "The best movie ever . I'm still waiting for a new movie . Top 10 Romanin production."}, {"id": 138, "text": "A good comedy! We went a group of friends , we laught a lot! Waiting for the 2nd part ! Keep doing the good job ! Someone who is not friend with Codin !! 😉😉😉"}, {"id": 139, "text": "The movie is good for laughing and relaxing, it's a parody, treat it like it is."}, {"id": 140, "text": "It's very funny. takes to the extreme the clichés of the Romanian peasant who went abroad"}, {"id": 141, "text": "The most beautiful film produced by romanians 👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻👍🏻"}, {"id": 142, "text": "Is was a nice surprise to see a GOOD romanian comedy. If you understand romanian language, some scenes are hilarious 🤣. We expect more comedies at least as good as this one."}, {"id": 143, "text": "I enjoy the movie and I love it. I don't understand the bad ratings here 😂but you know..heaters gonna hate no matter what. It was a great movie"}, {"id": 144, "text": "This is one of the best Romanian movie, with fun,action and unexpected scenes. Would really recomend for a chilling evening."}, {"id": 145, "text": "I love it from the start to the end! Great actors and production."}, {"id": 146, "text": "Onest and true is a very beautiful movie. I see 3 times and I can't stop to laugh all the movie. I hope to see the second part and I am sure will be the best!"}, {"id": 147, "text": "It is not a perfect movie, so if you're searching a 10 out of 10 comedy, keep looking. But if you're a Romanian, and you have some sense of humor, don't miss'it. You'll find some old school romanian Jokes. So.... enjoy It !"}, {"id": 148, "text": "I think it is worth watching the movie on a relaxing evening!"}, {"id": 149, "text": "Awesome!!! Recomand it!!! it's worth watching the movie!!! You won't regret it!"}, {"id": 150, "text": "Bromania and Codin makes a great combo! Can't wait for the sequel!"}, {"id": 151, "text": "This movie is for my pen is blue.I like it very much!"}, {"id": 152, "text": "Well done. Very good movie!!! Well done. Very good movie!!!"}, {"id": 153, "text": "N'am vazut un film romanesc mai bun ca acesta. Merita toata stima si aprecierea publicului roman si international acest film."}, {"id": 154, "text": "Part 2 must come! I think part 1 was a success. Congratulations Codin! I'm proud of you!"}, {"id": 155, "text": "Is the best romanian movie ever...and probably it will be for a long long time...nice job Codin and Bro!!!"}, {"id": 156, "text": "A great romanian movie. Not an Oscar winner but a great movie. A little dificult to digest for non-romanians since some of the slang is allmost imposible to translate. But Mujdei rulles"}, {"id": 157, "text": "Very funny...and beautiful in the same time, i watching already maibe 3-4times"}, {"id": 158, "text": "Un film bun , merita vazut! Nota 10 ...10..10,,,10"}, {"id": 159, "text": "Mi-a placut foarte mult subiectul si Codin Maticiuc! Am inteles ca vor face si Miami Bici 2 ! Mult succes!"}, {"id": 160, "text": "The coolest movie ever!! I haven't laughed so much at a movie in a long time!! Good work guys!! I can not wait to see Miami Bici 2!!!😁😁😁😁"}, {"id": 161, "text": "The best Romanian actors. The best romanian comedy ever.😊😊"}, {"id": 162, "text": "Good job boys! We're waiting for part ll. ❤ I enjoyed and laugh every time."}, {"id": 163, "text": "A fost un film haios, cu subinteles . M-am distrat la acest film. Chiar aveam nevoie de o portie de ras. Felicitari Codin si Bro. 🤗"}, {"id": 164, "text": "Very funny, a nice movie ! Loved every minute of it!"}, {"id": 165, "text": "Cel mai tare film ever! L am vazut de 3 ori si nu ma satur sa l vizionez! Felicitarii pentru tot !!"}, {"id": 166, "text": "Hilarious with such a good cast and funny jokes!!!!"}, {"id": 167, "text": "This was a movie that brought me to tears. Laughing :)"}, {"id": 168, "text": "This movie is amazing, very funmy and action till the end. I loved it so much! One of the best movies i've seen."}, {"id": 169, "text": "I don't know why are there so many 1 star reviews. It's a comedy. It's not meant to be taken seriously. I personally really enjoyed the jokes in this movie, but i can see why it isn't everyone's cup of tea. The characters are corny, but funny. If you want to watch a plot heavy, realistic movie this is not the place to be, but if and can understand and get over the fact that this movie is made to be ridiculous you can get a good laughter out of it."}, {"id": 170, "text": "It's not something you watch to discuss by a glass of wine later, it's a simple story of a pair of Romanians working for a US cartel. I'm a Slav, I liked many of the references, it was funnier for me than for most non-slavic people, so if you're like me you can spend a pleasant 1,5h with it.It's certainly not a 2star movie as some here would like to tell you."}, {"id": 171, "text": "I haven't laughed at a comedy movie in a long time, the story is so funny. Well maybe for non speaking romanian,is different...but well done."}, {"id": 172, "text": "As a romanian i have never been a fan of any romanian movies that was made in the recent here,but this had me laught a few times,is not the best but neither the worst. Could have been better but coming from a country that promotes more stupidy then creativity its still something good to watch rather then watch vulpita and viorel,or what turkish telenovelas,romanian telenovelas or basiclly what anything that a romanian with a mediocre job watches this days and calls it enterteining.I can only assume every that gave this movie a 1 star has to be an Abi fan or 5gang or any other non celebrity in our country that yet manages to be on tv this days. Could have been better but gave it a 10 because in the past 10-20 years this has to be romania has to offer."}, {"id": 173, "text": "It is a pretty good movie, it presents the Romanian idiot in a funny way, definitely it is not an intelectual movie and you won't find any deep message in it. The acting is OK, but it is visible that the main actors are not professional actors and there is room for better. Overall I think it is worth seeing."}, {"id": 174, "text": "I liked it :). Its kinda funny. I personally laughed All way long!"}, {"id": 175, "text": "I had seen it in the cinema, with my friends. Did not had any expectations and actually did not know what the movie was about. I just went because my friends wanted to see it.But what a delight it was. I laughed quite often and it made me remember some of the things that do happen in real life in this country (Romania). The actors played well in my opinion. Characters were meant to be like that and together with the jokes they made a funny film.Way to go guys!"}, {"id": 176, "text": "Not the best comedy ever but still some of the jokes were quite good... good enough to make my day..."}, {"id": 177, "text": "Seeing that the movie was made by some people that have no school when it's come to acting , made with they own money , the jocks are funny if you get them . was made for roumains , that way a lot of the jocks will only be get by people that grow up in Romania , it not the grat movie , not the worst , but it's a big + for romanian film industry !"}, {"id": 178, "text": "Mediocre acting and script but they make me laugh, which is good"}, {"id": 179, "text": "An exceptional satirical film. The characters are excellent."}, {"id": 180, "text": "This is a Louis de Funes style comedy movie. If you are in a good mood, you laugh a lot, and if you know Romanian language and curses, you laugh even more. Many of the jokes in the movie are extremeley obvious, while others are at the other extreme, very subtile, which makes the plot even funnier. Too many Romanian haters around here."}, {"id": 181, "text": "This movie can be better understood by Romanian people, taking into account that is contains a lot of inside jokes and usual phrases, along with specific slang :) I am Romanian and I very much enjoyed it."}, {"id": 182, "text": "I loved the movie! Of course it's not the best, but I think this guys did a great job. They are at the beginning, and we shouldn't see only the bad parts of the movie. I am really dissapointed to see all this negative reviews (made by romanians of course). It's really sad to see that instead of supporting somebody from our country we are dragging those persons down. Anyway, as Theodore Roosevelt said It is not the critic who counts, not the man who points out how the strong man stumbles... the credit belongs to the man in the arena. So, keep up the good work Matei Dima, Codin Maticiuc and Alex Cotet!"}, {"id": 183, "text": "I've seen worst movies than this. It's a cheesy comedy, but you might like it while eating a pizza and having a beer."}, {"id": 184, "text": "As a Romanian movie of its kind it punches above its weight, but it's deliver much as many spectators expected"}, {"id": 185, "text": "Maybe the worst movie in my life as a film buff. There are only two professional actors, but they also didn't play good. About amateurs? What should I say next? I'm ashamed of their shame. Amateur actors are fourth-hand, I think ... Embarrassing, painful, annoying ... How much feeling can Bromania and Maticiuc have when they claim to be actors and have made a movie? It's amazing how much it defies the definition of a movie. The scenery is awful and looks like it was made by an 11-year-old in the park while playing in the sand. For a comedy that theoretically should make you laugh most of the time, I only remembered two moments where I had a little fun. I had fun, I repeat. I didn't laugh with my mouth to my ears. Romanian cinematography has 100 times better publicity films than this embarrassing production, which nevertheless has a record of sales in Romania. Do you know why that is? Because Bromania and Maticiuc are well known and have aggressively promoted the product in all possible and impossible environments. I think they heard about their shameful work on Mars as well. In addition, the target audience (the one with no higher education and no film culture) responded presently. If they deserve to be congratulated for something, Bromania and Maticiuc deserve to be congratulated for marketing, not for the movie attempt. Repeat movie attempt. You can't call a movie such a shame for cinematography."}, {"id": 186, "text": "This is honorably good considering the Romanian cinematography, meaning I could watch it from start to the end.The acting is almost good, there is a plot and there is a logic in the movie.The jokes are good and bad, some scenes are really corny and stupid but other are funny. I found myself laughing a few times.Surprisingly there is not so much bad language but there are a lot of language jokes that makes sense only for Romanians.Considering the budget this looks promising and can be considered a success.If you don't expect too much you might quite enjoy it, I can definitely say that I saw comedies worse than this a lot of times."}, {"id": 187, "text": "No, I am not advertising any video channel, I simply feel this is what director Jesús del Cerro should put after the end of what felt like a glorified, overlong internet video done by an above-average content creator. But should I really be surprised at this trainwreck? Matei Dima, despite having studied acting in the US, is best known as internet funny-man Bro. And I am not even going to mention that weasel Codin Maticiuc's performance--he has no acting studies, nor skills. He is simply a businessman who got bored.The aforementioned actors play the two leads in this movie which revolves around them going to Miami to make some cash and attempt to rise themselves from the poor Eastern European life in Romania. Yet despite picking on Dima, he is, in fact, this basic comedy's only redeeming feature. His acting skills do show a bit, indeed. Or maybe is just because everyone around him acted like a bunch of left-over firewood. Fine, he is not the only one. Florin Piersic Jr., Letitia Vladescu and veteran Mirela Nicolau did a pretty decent job too, I guess.But a movie like Miami Bici really should not be written about in such an overworked manner. With a modest 1.5 million Euros budget, its only ambitions were to get as many people into a paid vacation as possible. But there are great things in movies that are not expensive. Like a great story, an introspective plot and smart, witty, timed comedy. Miami Bici has none of those. There is no social commentary--although there is potential for one--no class inequity, and the comedy, the only thing that is actually crucial, rarely hits. And when it does, it's only because Bro is ready to save the day. While Miami Bici attempts some creative albeit formulaic comedy, most of it falls flat.Take this movie for what it is. A glorified internet video, a piece of effortless entertainment, or a teenager's slumber party's choice for a quick flick while doing anything else except actually watching it. And you should do the same."}, {"id": 188, "text": "If you haven't seen the movie, I recommend you not to take into account the reviews of those who gave a low grade or said that it is a very bad movie.Before watching the movie, you need to know and understand that the jokes will be understood and will only make sense if you are Romanian and have lived in Romania, or if you know the life and traditions of Romania. Otherwise you will not understand and it is possible to say that it is not good.In my opinion, a good movie is when I click play and I don't know when the movie ends. I think it seemed like 10-20 minutes had passed.The team behind this film made an exceptional film, especially with the budget they had. Let's not forget that in America with this budget they didn't even make a Short, not to mention a movie and if they did, it was in category E.The film is a new approach to life in Romania and I think that most of those who saw it (I mean Romanians) found ourselves in that situation, dreams and disappointments.I've seen a lot of movies this year and I can say that this is the best I've seen. All my friends saw it and everyone liked it, I even made a mini cinema in a friend's garden where we all saw it.We didn't even have time to finish our beer, because we laughed all the time. I think that means the movie is good.The negative criticisms are again something typical Romanian that as soon as someone comes up with a new approach we hit them in the head.Well done team and you should make more movies like this. Respectfully AlexH"}, {"id": 189, "text": "It's a pleasant soft comedy. Might be hard to understand for foreigners, but for us, Romanians, who know the subtleties in the movie, it's actually quite fun to recognize some things which have been presented in a satirical way and should not be seen as an insult to our people, it's just a funny representation of some realities.Matei Dima has some good ideas and a decent to good acting, but he needs more directing experience.Miami Bici isn't something revolutionary, but, in my opinion, is much better than what we see at the tv, the so-called comedy tv series (will not name them). However, this is just my opinion.L-a Seral was also a decent production. If Matei wants to go further on this road, I hope he will continue. I believe that he can evolve in time, by learning from his mistakes or failures (5Gang: Un altfel de Craciun - The failure might be due to the hate towards 5Gang, not towards the movie itself, since the bad rating on IMDB)."}], "reviews_amount": 190}