{"name": "Alone", "titleId": "tt10192566", "reviews": [{"id": 0, "text": "You might have noticed that this was a copy of the South Korean movie #alive, but if you check credits; they both have the same writer. So I don't think the script was stolen, it was just a replica with few changes to serve the American audience as usual. However; that being said. The Korean version was much better on the storyline take, the acting, the zombie makeup, even the romance was better.It was a good movie, but since I've seen the Korean version, I couldn't put more than 5 to this one."}, {"id": 1, "text": "There's a Korean film that came out a year or two ago with the same story, plot, everything. And it was much better."}, {"id": 2, "text": "I get that this is a an American production but if you are to take a concept from overseas kindly do it justice not, half baked effort"}, {"id": 3, "text": "Can be a bit depressing at times and different spin on zombies. Donald Sutherland plays a great part. An ok watch.This is a remake of the Korean film 'Alive', which is a much better version."}, {"id": 4, "text": "According to wiki this is the original and #Alive, which is the Korean version, was adapted (remake) from this script. #Alive was released first even tho it is the remake.I love Tyler Posey but the script and story line for Alone was horrible. No character arc or any attachment to his character. It felt rushed and the last part of the movie seemed to have the most action.I personally prefer #Alive. Better story line and character arc!"}, {"id": 5, "text": "I enjoyed the concept of someone trying to weather a pandemic solo which also poses the question of if it's possible. Unfortunately things kind of went off the rails a bit. A lot of things don't really make any sense and it all kind of ends with an incomplete happy-but-not-really-happy ending."}, {"id": 6, "text": "The movie is over and I am still trying to make sense of any of it! Total garbage with a horrible plot!"}, {"id": 7, "text": "This movie was an imitation of #ALIVE 2020 movie ... most of the scenes were copied"}, {"id": 8, "text": "If you've seen Alive (which wasn't good in my opinion), this is the same except in English."}, {"id": 9, "text": "The original movie was wonderful. The characters struggles were more believable, there was a strong female character, and their relationship was interesting. This movie is just so terrible. It's poorly written, it's clearly ADR, the female character is written as a helpless princess hiding in a castle waiting for the prince to come get her. I honestly feel like we've gone backwards with this movie."}, {"id": 10, "text": "This movie came out after #Alive, which has the same exact plot. Check out #Alive on Netflix."}, {"id": 11, "text": "The plot is the same as #Alive, a South Korean zombie flick, but it fell short. Actually Matt Naylor has a screenwriting credit on both films, so it's hard to say which movie copied the other. While Alone has a good premise (like #Alive), it takes the wrong turn by offering us humiliating lead (sorry Posey), lazy story, apathetic suspenseful scenes and a love story that is nothing more than a mere fairytale. In the end I think Alone is more action driven, and #Alive has more character development."}, {"id": 12, "text": "This movie is an almost identical ripoff of the South Korean zombie film, #Alive"}, {"id": 13, "text": "The main character is terrible ! A incredible bad acting over there. Don't waste your time."}, {"id": 14, "text": "Stick with #alive far better. this was just a drag."}, {"id": 15, "text": "This is a watchable horror/ zombie apocalytic film. This will be compared to the Korean's Alive as that they both essentially tells the same story adapted from the same book, plus Alive was released before this film. This is further acknowledged/confirmed as the same scenes are filmed/replicated almost shot by shot. There are a few minor changes to the detriment of this film (&amp; arguably makes this inferior to Alive). The cameo role of Donald Sutherland as the type casted older man is ok as we know how good an actor he is.However, I do not like how they have Americanised the female character to the clichéd damsel in distress. Whereas in the Korean version she was a strong character that could fight and defend for herself as capable as the male lead (arguably stronger than him mentally as he gives up far too easily). It beggers belief that the US reverts to that old thinking &amp; I disagree with it. The producer &amp; director ought to have had the courage to make the female character as capable as the male ones (like in Kill Bill, etc)! The male protagonist seems so ott capable as though he was a tone down version of Captain American/Spiderman (jumping down &amp; climbing up balconies as though it is just a walk in a park) I did not sense that he is in any real danger of being hurt throughout this film. There is a throw away character/ neighbour that annoyingly keeps popping up at random times throughout the film. It did not make any sense to me. Furthermore, I much prefer Alive's ending over this one as they incorporate modern technology to aid themselves... Whereas this film abruptly ends with no resolution."}, {"id": 16, "text": "Alone is a film completely outside of what I expected. When a pandemic occurs, a boy finds himself alone and trapped inside his apartment. This virus causes transformations in people making them aggressive and murderous. The film recounts his struggle for survival, alone and cornered in an apartment, until one day he finds a girl in the same situation at the window in front of the building and from there a romance begins between the two even if at a distance, but the struggle for survival continues. . The performance is basic, not being bad, there is nothing extraordinary, the direction could be more elaborate but it is acceptable. A little participation by Donald Sutherland to give a resonant name to the film without stars, he does his job with nothing of relevance, a medium low participation, so that we do not forget him especially at his age. with a surprise for the hero .does not ceases to be a romance without much glory, my advice is watchable but no regrets if you don´t"}, {"id": 17, "text": "Was ok. Could have been much better. Decent for a one time watch though. I wish they would have done so much more with it though. It had so much more potential."}, {"id": 18, "text": "This is a scene by scene remake of the movie #Alive which was so much better."}, {"id": 19, "text": "I figured this would be a carbon copy since it is adapted from a foreign film. Now I'm not a film purist or anything, but usually remakes are not as good as the original, but I knew Tyler Posey's face and I liked the concept of the Korean film (while it did have some issues it was pretty fun)Okay. So a big part of why I liked the Korean film was its use of social media, The character uses social media to video blog about his struggles and that's how rescue finds people - through their posts. I was a bit disappointed that this concept wasn't in this one. I also liked how the zombies in Alive ate smaller zombies which in case I fell asleep (get to that later) I didn't see? Or that they had a semblance of their past life? (the firefighter zombie) I don't know a lot of missed opportunities.The acting was....eh. Not the best but I've definitely seen worse. I think my biggest problem was that I didn't feel any chemistry between the leads or cared about them as a romantic couple. She didn't serve any purpose besides being his neighbor. ISH.My favorite part is in the end SPOILERS when Posey is bit and rips his shirt off like some kind of sexy werewolf to nose dive off his balcony, but then is stopped when its abruptly shown hey....he wasn't bit he's fine.Also was anyone else wanting them to do something with his sister storyline? The parents died yeah, but the sister got out and there was NO attempt to contact her?"}, {"id": 20, "text": "Tyler Posey cannot act.Every scene of this movie is cliche and may result in excessive eye rolling.Flashbacks attempt character development but all they do is give you meaningless shots of people you don't care about.The vlog has been done to death, and just insultingly pointless.Musical score is over the top and a blatant attempt to give the film some scale. It fails and just feels laughably out of place.Disjointed and pointless, Alone is terrible."}, {"id": 21, "text": "This film start with a man Aidan doing his video log, and he try to hang himself scene! As turnout, this film is about Aidan decide to survive in his apartment surrounding by countless of zombies, after he fail to kill himself, and have a crush with his opposite neighbor Eva! Entire film full of boring conversation, and annoying overuse scene! Such as, overuse of the blackout scene, overuse of the doing video log scene, overuse of the eating scene, overuse of the waking up scene, overuse of the jump scare scene, overuse of the searching things scene, and overuse of the voice calling on phone scene! Make the film unwatchable! Barely intense scene is, Aidan randomly pick up a rifle on the ground, and killing the zombies running at him! At the end, Aidan found out he is not infected by the zombie, he back to his apartment blocking the zombies to come in by a fridge with Eva! That's it! Completely wasting time to watch!"}, {"id": 22, "text": "ALONE is a remake of a Korean film, but surprisingly this is so far away from the original version, the whole production was so cheezy and lame, just like a university student's project. In this case, we just know how good the Korean films are. If you find Alone is a ok film, then watch the Korean version, you will find alot more fun. If you havent watched Alone yet, then skip it and watch the Korean version, cos thats much much better."}, {"id": 23, "text": "Acting was alright and several mistakes at the beginning of the outbreak. Aiden left his apartment, walked past his friend in blue t-shirt on the floor, ran down 2 flights of stairs, opened the stairwell door and jumped over his friend in the blue t-shirt. I found it more of a comedy zombie film rather than a horror. He never found out if his sister was dead and the ending had no meaning or conclusion. It just ended when it started to get good."}, {"id": 24, "text": "Alot of zombie movies are alike, but this one was a bit different. I liked how the zombies knew what they were doing but couldn't help it, &amp; they could even talk a little bit &amp; say things like Kill me. Also, it had a realistic feeling to it. It was not boring at all &amp; actually, when the movie ended, I was surprised that it was already over &amp; I wanted more! Don't listen to the bad reviews, those people don't know what they're talking about."}, {"id": 25, "text": "A netflix lançou o filme orient #alive. Esse filme é a cópia americana mal feita. O original foi bastante chato e a cópia consegue ser pior."}, {"id": 26, "text": "The films shows a great level of aesthetic of a pandemic but there was a speed of actions after the opening scene I guess that the script require some enhancements in terms of contributing more to the story timeline. Moreover, the camera, lights, props, location, art, and rest of the teams shows a great level of experience and creativity. The story ending showed a great way of defending the story but still I guess the girl (Eva) did not show a serious act face by the end of the film but the music made the scene more juxtaposed."}, {"id": 27, "text": "So here's the thing. This movie is not something that you should go into expecting a full character arc and plot for miles with world building, lore and the kind of compelling story that big budget hollywood tries to give. It's just not, and I knew this coming into it. However, the performances in intense and emotional scenes given by Posey and the rest of the car are incredible. Though their characters may not be fleshed out in background their emotional appeals are all there and and well acted. When Aidan finds out his parents are dead it is gutting to watch him react. I would love to see these characters expanded in a different format, although it doesn't seem to be likely. Overall, this is a good edition to Posey's acting credits."}, {"id": 28, "text": "My gf and I found this in the redbox and weren't too mad about paying that price, but I don't think you'd want to pay full price. Everyone says it's the American version of #alive which makes since and It's sad that they don't mention or credit that film at all. The acting isn't terrible and honestly neither was the FX. I feel like the entire time we were watching the film we kept saying how Aiden, the lead actor, was doing things wrong in an apocalyptic setting but that's fine. There is a love story thrown in there but I do feel like they do enough with it and the ending was really abrupt and leaves you hanging. Good covid 19 redbox buy, but you won't feel like your missing out if you skip it."}, {"id": 29, "text": "Emotional, intense, and the main character, Aidan, brings you with him on his journey of survival. The Korean original Alive was better, I thought, except Alone had a better, open ending. Nice to not have to read the subtitles, and also not to have the feminist overtones from Alive. However, the female character, Eva, could be more three dimensional. Decent movie overall and worth renting, due to the enthralling nature, even though as a remake it's completely lacking in originality...but that's the problem with most movies today, lack of originality and creativity."}, {"id": 30, "text": "I think some of the efforts provided were a bit generic... while you may think that it's very odd that his bite at the end was magically removed it's the story that really carries this... because miracles and scares do happen and that's what makes life worth living. this movie will take you for a wonderful ride in a zombie apocolypse where the infection will use every last bit of energy to spread itself far and wide! Please make a sequel! I'll keep adding to this review if I can the more I watch it!"}, {"id": 31, "text": "I was super excited for this because of Tyler Posey but this was a very low budget movie right off the bat. Other reviews said it was a copy of another movie but i never saw Alive so I'm not sure. However this movie was so slow for a zombie movie, like you think it would be a different story line for the main character and it's just not. so many missed opportunities. By the last 15 mins it picked up and than it CUT off and just ended! like no good or sad ending just cut off. Not worth what i paid for at all. but at least i didn't have to go into theatre to watch."}, {"id": 32, "text": "I don't understand the bad reviews. It's a good entertaining movie with a good acting and story. I enjoyed the every second of this movie! 10/10"}, {"id": 33, "text": "I enjoyed this movie, it was totally up my street with what is happening at the moment. I really felt for Aidan when he realised he really was alone when he lost his family. I enjoyed that it was realistic horror meets romance and it was really gripping."}, {"id": 34, "text": "In the film, Aidan (Tyler Posey) barricaded, isolated himself in his apartment when the zombie pandemic begins. He lost his family, his internet, phone and power cut off and he saw a young woman named Eva (Summer Spiro), the two bond each other for social distancing and prepares to fight against the zombies named Screamers. I praised for Tyler Posey and Donald Sutherland roles, the film score, makeup and visuals.In COVID-19 pandemic, millions of people have died from COVID-19, people are getting infected with COVID-19, social or physical distancing rules, some supply shortages, schools and businesses have shutdown, events are cancelled, protests around the world (including the United States), stock market crash down, cities lockdown, movies, TV shows, performing arts, video games and sports (including 2020 Tokyo Olympics) postponed, travel restrictions, and the fall of tourism.People have to wash the hands, put on hand sanitizer, wearing face masks or covering, flattening the curve, and researchers getting vaccines at the end of 2020.Thanks to the healthcare workers and first responders for did a great job.This reminds me of an South Korean movie #Alive, which is kinda great movie."}, {"id": 35, "text": "Not going to lie. I cried a couple times. I jumped out of seat a couple times. It was nice to have a mew refreshing movie during this time. Go buy this movie on digital. Worth every penny."}, {"id": 36, "text": "Well, for this movie i've seen so many people saying the korean version is better, well, i havn't seen that movie, but i absoloutly loved this, i simply loved it, and trust it's worth it, go watch it"}, {"id": 37, "text": "Same thing on korean movie #Alive on netflix. Well its still cool"}, {"id": 38, "text": "It's an interesting twist on zombies, definitely worth watching. The original version #alive is better, but the cast does a great job."}, {"id": 39, "text": "It's very the same with the Korean movie Alive based on the scenes"}, {"id": 40, "text": "Everything on #Alive is just the same. Even the peanut butter and walkie talkie from the neighbor. Still scary 👻 but lacks originality"}, {"id": 41, "text": "Of course the zombies in this one looks sloppy but it's better than the korean one."}, {"id": 42, "text": "This is a shot by a shot copy of a European film of the same name. I think it was Spanish. I was surprised by the lack of any originality of this remake."}, {"id": 43, "text": "I like this genre, and i totally liked the story from the beginning, worth a try, you'll not regret it, if you like this genre."}, {"id": 44, "text": "This is AMAZING!! Really good film , Tyler Posey i love it!"}, {"id": 45, "text": "You would think watching someone deal with a zombie apocalypse in their own apartment (as per the synopsis states so not giving away a spoiler) would be like watching paint dry but this little gem had a bit of everything. Suspenseful, a bit of gore, humour - just drudged up alot of the feels. My partner &amp; I loved it &amp; he's hard to please with a movie. Definitely recommend this one."}, {"id": 46, "text": "Knock spots of the original. Better acting. More suspensful. Darker tone. Less comic book more apocolypse."}, {"id": 47, "text": "At first, I was a little uncertain about this movie due to the bad reviews. However, this movie was unexpectedly amazing. I do see that the reviews are stating that the movie, Alive was better but maybe others prefer the English version instead."}, {"id": 48, "text": "Loved this movie, it really showed if being trapped in a place alone can you keep you together as long as you have the strength to stay alive. It was definitely worth watching, I recommend 100% suspense, pop ups, everything was worth it. Love it."}, {"id": 49, "text": "With all the crap that has passed for supposed great movie watching I don't get why this got bad reviews. The suspense was there. It had a cute little love story that didn't require gratuitous sex scenes and their relationship really made you root for them. It wasn't just all about the fear factors from the zombies but you saw how lonely the characters were and it showed ppl's humanity and desire for human contact (and I am guessing ppl can identify with that right now). They directory obviously wanted to show off Tyler Posey's body a little and that got a little cheesy. But, again, sexuality was not over the top in this film."}, {"id": 50, "text": "I Really liked this film, it has two main leads and a very short scene with Donald Sutherland who, although a lot older than at the height of his career still acts well. its good for old actors to keep their toe in the water and his character in this was just right for him and the scene was also long enough.So as i said not starring many at all apart from plenty of extra's playing the Zombie parts. its a good thriller/ horror and did keep me entertained and in one or two places got me to the edge of my seat. it has a good storyline and some solid acting all round.all in all worth the 7 rating and worth a watch.... get the popcorn out."}, {"id": 51, "text": "I went into this with really low expectations since most new releases have been scraping the bottom of the barrel. But it was a smart thoughtful film, Donald Sutherland was great in a limited role as well. I know there's a South Korean version that was shot almost simultaneously that's supposed to be better, but since I haven't seen it I can only judge this."}, {"id": 52, "text": "I liked Teen Wolf and Tyler Posey was good in it but was overshadowed by Dylan O'brien who is much more appealing, a better actor and obviously went on to more success. Maybe Dylan could have saved this movie but instead Alone seems to have been made for Tyler's fans who want to see lots of shots of him shirtless and even a bare rear shot and not expect much else. A few years ago a movie was made in France called The Night Eats the World and since then other countries have been making not quite exact copies of it. It was interesting , this is not. This starts out very slow, so slow that I thought I would give up and while it does pick up It's so poorly written and acted that I just didn't care. Scenes seem to have been written just to get him out of his clothes. He is awful in the lead and by the time Summer Spiro is added to the story as Eva I was sure he had met his match in bad acting. The entire film is filled with holes, seems to have scenes missing that maybe could have added some suspense and is obviously aimed at teens or younger. His fans I'm sure will proclaim him the next Brando but as an adult I found this cringeworthy, stupid, juvenile, forgettable, and completely Hollywood-bad."}, {"id": 53, "text": "2.5 out of 5 stars.Alone is a horror remake of a zombie like apocalypse while a young adult is stuck and barricaded in his apartment while watching everything fall apart through the window. While he meets a girl across the apartment complex. He has something to survive for.Same plot. Same concept. The script is very similar. But the direction is a little dull in the second act when Tyler Poseys character comes across another civilian played by Donald Sutherland. And a long exposition of there views of the apocalypse. Direction is also a little cheesy with the zombie like beings. Which they murmer words. Or still alive human beings. Just there minds are turned cannabalistic. Which makes it a little weird.Tyler Posey. Summer Spiro. And Donald Sutherlands performances are all little questionable. With cheesy acting.The film could have been so much with a faster pacing. Better directions with the cannabalistic beings that spend more time running around in circles and aimlessly. Another issue i have with the film is the ending. It ends abruptly like the writer could not figure out how to wrap up a third act."}, {"id": 54, "text": "Don't waste your life on this piece of schnitt zombie ripoff of #ALIVE.I mean, WTF... since when did putting newspapers over glass protect you against zombies? Those aren't even interior windows for ducks sake! If you're gonna copy a movie then ducking do it right, don't do it dumb!Where did the main actor go to school? He should ask for his money back. Overacting is for soap operas and nobody likes that schnitt, case in point, how many soap operas exist today? None. I rest my case.You're better off using your schitfinity data-capped regionally monopolized bandwidth on streaming live cat cams than on this garbage.If I got to you too late and you need to wash this crap out of your mind, go watch #ALIVE."}, {"id": 55, "text": "Was quite looking forward to this even though I knew it was a copy of the Korean version Alive and expected a lot more than what this gives the viewer.From the very start the atrocious acting by Tyler Posey put me right off (Posey by name and definitely posey by nature it would seem with no discerneable acting talent whatsoever), then we have the poor CGI (what there is of it - helicopter crash and a plane flying over in the first 5 mins and that is about it - unless you can spot any more?) and then the lack of actual zombies/infected and any credible well choreographed action whatsoever it quickly began to go downhill.It has none of the tension , fun or style of the Korean version and falls far short of what it should have been with a bigger budget and actors like the venerable Donald Sutherland in it but i guess he was just poster clickbait like so many these days lending their names to this trash!"}, {"id": 56, "text": "The acting in this is asinine, the main character lack of emotions in reactions to the events that's unraveling is just BAD, his flat emotionless non tone face is unconvincing of emotions, and how for the KICKER, so not only is this movie poorly directed and acted. But the writer, I assume also pitched a version of this story and they made a Korean version of it, which is MUCH MUCH better overall in terms of acting casting and production, released as ALONE in South Korea back in FEBRUARY 2020, renamed to #Alive for netflix release, its a version of the same story just done with better acting and production.SO the Horror, its shock value, with that being said since its only shock value, its now you add the main character who lacks emotions in his response to everything that's happening is just bad. This dude acting makes the very flimsy story line even WORST.The ACTING and as we can see from the popularity of #alive on Netflix, so it comes down to whose at mistake it was, since the Korean version was super successful and popular, and this one falls FLAT. Was it bad directing? or Bad casting and acting?Save yourself some time and money and just watch the Korean version of this movie, its much better done in terms of production value, cinematography, direction and especially the acting."}, {"id": 57, "text": "Well, the very first thing I have to say after having seen the 2020 movie Alone from writer Matt Naylor and director Johnny Martin is this: watch the South Korean movie #Alive instead, as it is a far, far better movie.I wasn't aware that Alone was an American cash-in on #Alive, and if I had known that prior to sitting down to watching it, I probably wouldn't have watched it. I mean, just look at the times where Hollywood cashed in on movies such as Rec, The Ring, The Grudge, etc. and take into consideration the abysmal mutations they ended up being.Sure, I get that some American speaking viewers have an aversion against watching non-English language movies, but the fact that Hollywood make these shameless Americanized remakes is just beyond my comprehension.Well, back to the movie. Alone was almost a frame by frame copy of #Alive, just to make things worse. The lack of originality and creativity in Hollywood is just astounding. And if you were among those in the audience that actually did enjoy Alone, I urge you to sit down and watch #Alive because that movie is far superior and much more intense.For some reason, it was just hard to take the infected as a serious threat, as they were leaping about and repeating the last words that they had uttered before they were killed and turned from infection. Sure, the idea was interesting enough, I suppose, but the transition to the screen and hearing them running around saying stuff like kill me, stop it and such was just a bit too much, and it definitely took away some of the degree of taking the infected seriously.Granted, if you are not familiar with #Alive and you sit down to watch Alone, it will be a good enough and enjoyable movie, for sure. But, if you like me, have watched the South Korean original movie, then chances are very high that you will find director Johnny Martin's Alone to be a subpar movie.Actor Tyler Posey actually managed to carry this movie well enough with his performance. And it was interesting, and actually nice, that they managed to get the likes of Donald Sutherland to appear in a movie such as this.If I hadn't already seen the South Korean movie, then I believe I would have found much more enjoyment in Alone. But since I had watched #Alive, I just struggled with taking Alone seriously. My rating of this 2020 Americanized version of #Alive lands on a generous five out of ten stars. I mean, it is a zombie (infected individual) movie after all, and that does count for something."}, {"id": 58, "text": "I know for a fact that this was made way before #Alive and was supposed to be released sooner but was delayed because of Coronavirus. Just wanted to get that out of the way.I'm a sucker for Zombie/Apocalyptic movies so I wanted to see this even after seeing #Alive. I wasn't very keen on #Alive because the acting was off for me. Sadly, Tyler Posey's acting is way worse.He likes to scrunch his face up whenever he's crying, smiling, scared or sad but it just makes him look like he's in pain. Honestly. The guy cannot act. I can see the appeal though, given the butt shot but even that falls a little flat.If you want to see something that's entertaining thanks to the plot holes, the haphazard editing, bad acting or shoddy ending, this movie is for you.I kind of want a part 2 just to see if the whole travesty will devolve to a full-on Walking Dead knockoff. :P"}], "reviews_amount": 59}