{"name": "Serious Men", "titleId": "tt10230414", "reviews": [{"id": 0, "text": "Serious men is about a father trying to give his son a great life but by taking the shortcut. What's good: 1. The story is good. 2. The performances are great especially Nawazuddin Siddiqui and the child artist Akshat Das. 3. The film criticizes a lot of things that happen in society in a funny way. What's bad: 1. The ending is predictable. 2. Not a family film. Overall, Nawazuddin Siddiqui fans and those who want to see something different will love it."}, {"id": 1, "text": "The story weave in all aspects of society like caste discrimination, education institution policies, political involvement and feelings of a father who want to fight against set hierarchy defined by systems for primitive minds.With the sprinkle of comedy and strong acting by cast has kept this script alive and engaging.Amazing work by Sudhir mishran, it is must watch movie for parents to avoid pressure on their kids due to existing spoiled and inherited system of ruling and preservance of good with our innerself.Everything is best in this movie."}, {"id": 2, "text": "The flim is good but the some things in movies is missing which were expected which were fullfilled. I think there should not be adult scenes in movie. It's doesnot suits the movie. If it was not there then movie was to be good. It's way of expressing message was heartfelt. Nawaz sir acting was as usual."}, {"id": 3, "text": "I was bored while watching this But the film is very good Nawazuddin sir nailed as usual"}, {"id": 4, "text": "There will be a special place in my heart for this film. This film can be considered as one of the finest films of this year. Nawazuddin Siddiqui and others do a fantastic job. Story and screenplay is also good. Definitely recommend 👍."}, {"id": 5, "text": "Amazing story with super talented star cast. Pls watch it and support true talent of Bollywood."}, {"id": 6, "text": "I liked the idea of the movie. The plot was interesting and the movie had its moments. Although, I felt there were certain loopholes in the movie. Nawazuddin Siddiqui's son in the movie is considered a genius and a lot of people believe this to be true. It's shown that the boy merely memorises stuff with the help of his father and pretends to be intelligent. Once it's shown that when the boy was asked by his friend to solve a basic addition problem, he couldn't do so. How's it possible to proprogate that someone is a true genius when he can't even solve basic math stuff? Isn't that easy to catch? How would you escape many situations that arise? It's shown that this is going on from 3-4 years and nobody has caught the boy."}, {"id": 7, "text": "As usual Nawazuddin Siddiqui did really good job and the child's acting was mind blowing. Good Job 👏🏻"}, {"id": 8, "text": "The concept is good, but they didn't do justice to the storyline. This isn't the type of movie that keeps you glued to the screen and entertained throughout. If you watch the first 30 minutes and the last 30 minutes, you'll understand the whole movie. The remaining is just depressing to watch and painfully slow. No doubt that the actors did their roles well, but the storyline is not captivating. They could've executed it better."}, {"id": 9, "text": "Nawazuddin is a gem. Realistic movie. I like Nawazuddin speaking style , his voice and dialogue deliveries, superb expressions"}, {"id": 10, "text": "There is serious problem with Netflix India, Outside India Netflix is good but In india netflix has some kind of agenda, Important thing One thing they should be clear that they choose actor according to character , it should not be like nawazzudin is good actor so every body should give him every type of character,Just like Radhika Apte, And they should choose some good directors"}, {"id": 11, "text": "Boring...Im sure the professional reviewers must have been paid to write good reviews.."}, {"id": 12, "text": "This movie story is very interesting and fresh but execution is totally bad. Basically, Movie Story Around father and son their secret about genius. First half is good but second half is totally boring and lengthy. Screenplay absolutely weak in second half. Nawazuddin Siddiqui as role of father is brilliantly done. Nawaz Bhai once again prove why he is great actor every kind of role he easily catch up. All Star Cast Their character perfectly played, No Doubt. If you watch Something different with no expectation then this movie you never disappointed but you watch with expectation then I'll not guaranteed you'll like it or not. But In my final opinion, Movie is average if you have time then watch movie and decided your own. One Time Watch Movie. My Rating: 7/10"}, {"id": 13, "text": "So a child is genius to the world for some 4 or 6 years...gets all school and media attention...but is actually faking it with the help of his father and nobody notices that, not even his own mother which is more of some uncooked food. Overall story revolves around the same theme. Acting wise no doubt you have the best cast. At times the movie goes too slow and you will feel dragging to reach the end"}, {"id": 14, "text": "I haven't found anything comedy nor thrill,nor any lesson neither any action but don't know why people are rating too much.. Blv me don't waste 2hrs of time.. nothing good in this movie..."}, {"id": 15, "text": "Movie shows as a nun converts a dalit family, which is entirely wrong."}, {"id": 16, "text": "This is another highly hinduphobic title from the factory of druggists . This also goes one step further to justify fraudulent activity."}, {"id": 17, "text": "I do not understand what is in this picture except that there is a Navasudheen Siddiqui .. 'Serious Men' did not burn at all with the creepy presentation and a lot of scenes that had no idea what was going to be said .. The director was not at all serious about this movie ..There is no other Navasudheen Sidhequi movie that has disappointed this much .."}, {"id": 18, "text": "The movie is not good at all, you will feel at times that you wasted your time, Nawaz acts brilliantly of course but the story has no potential. And of course it also has the unnecessary sex included and condom talks which I guess is becoming compulsory in all the movies now a days even if the movie is with Child orientated story. Boring from start to end."}, {"id": 19, "text": "I think if you not have a father's prospection and if you have not that mature mind than you are not allow to write this movie review. Whoever writing the bad review the don't love their father at all. This movie all about of love of a father who has a great thought about his next generation. Extremely talented story and awesome screenplay. Lots of real talented actors. For me this will be the most memorable film for rest of my life."}, {"id": 20, "text": "Shameless Netflix does it again. Shows how Christian school employ Hindu upper castes who asks castes from the parents of children. Only amoeba sized brains will believe this.On one occasion, a politician says that the Universe was created by Brahma as per Vedas. These writers need to study more as Carl Sagan the famous cosmologist even talks about the 'Hymn for Universe creation' in Rigveda. It is very scientific philosophy and nowhere talks about Brahma Ji.On the other hand, there are definitely 2 books who believe that the Universe was created in 7 days. Men came on earth as a punishment for eating forbidden fruit.😅"}, {"id": 21, "text": "Seriously! What is the point of this movie? What is the message? Commit fraud because that's what everyone does? And as long as everyone does it, its right?"}, {"id": 22, "text": "Serious Men - Not at all a usual movie watching experience, it's very much different from other movies. It touches various social issues throughout the film especially the caste system. Cinematography is done brilliantly, every frame speaks itself. There is so much humour throughout the film and it's very good.Now, there is Nawazuddin Siddiqui in the lead role, so it's obvious that there will be no complain about acting. But the show stealer is of course the child actor Aakshath Das. Nassar &amp; Indira Tiwari also support the film very well. Hope to see Indira Tiwari in future again. Finally Sudhir Mishra is back again in his old form."}, {"id": 23, "text": "I can't deal with the primitive minds like u. An absolute satire on the educational system. The points they deal within the film are well spaced. Science, Political, Educational, Middle class life everything that is portrayed is perfect. The turnover by Nasser in the ending scenes is just brillant. Serious Men is the Idiom given by PA's whose bosses are strict as said it the initial sequences. But later on the film we come to know there r new points that raised. The way they mentally challenged the people around u ,the way Nawazuddin blackmailed and many more resembles the title. Even though Nawazuddin Siddiqui backstory is good, I see it as pointless connection. Good but not at its best."}, {"id": 24, "text": "I knew it nawaz sir never fails to entertain with his best acting , we love you Nawaz Sir"}, {"id": 25, "text": "Watch this if you are into a world of real acting and who knows probably a tried approach somewhere before"}, {"id": 26, "text": "Its an alright film :/ Nothing much to say. Don't remember much either."}, {"id": 27, "text": "They tried something different and this mediocre audience couldn't accept this new approach , I know it is a remaked/inspired out of good will hunting but this totally needs attention . This should be encouraged cause nobody dares to make satire movies in countries like India cause people hate the reality and presenting a satire is very hard as it has to be kept realistic . This is not the best movie bit slow at places but all in all whatever this is , it seriously needs everyone's attention . #mustwatch"}, {"id": 28, "text": "Out of all such cases running in our society this movie sheds lights on various topics not just child educational scams but also to the discrimination of lower casts in a way. Dialogues are brilliant. It's a good adaptation. Acting Department is fantastic every actors did great job. Hatsoff to Many Joseph for writing such a brave book and the writers who adapted the novel into this wonderful movie.... Many of u may be uncomfortable for a family watch some cuss words r there . But watch it it's a must watch this yr"}, {"id": 29, "text": "Different kind of story with nice themes on Children Upbringing stress and caste politics. Worth watching fabulous acting by Nawazuddin Siddiqui and child actor Aakshath Das."}, {"id": 30, "text": "Worst movie in Nawazuddin film career. Waste of time."}, {"id": 31, "text": "Although the story is adaption from a book, was taken by surprise as the main premise is exactly the same as one of the episodes in Law and Order- Criminal Intent - Bright Boy. Although the story discusses cast which is pertinent to indian culture, the underlying story which keeps the audience captivated has been copied."}, {"id": 32, "text": "Good movie to watch for the performances of Nawazuddin and also a good satire on society and social issues movie has a serious issue dealing."}, {"id": 33, "text": "I must thank to creaters of this film for their brave efforts of showing how people with money try to convert poor people into their religion in exchange of food and necessities. Nawazuddin Sir was as good as himself. The charater of adi mani was brilliantly performed by little champ. And a great slap to the darkest Part of India. Direction, acting, cast, locations everything was impressive. It is very engaging movie till the end so everyone must watch at least once. Thank you."}, {"id": 34, "text": "Nawazuddin delivers and he proves again why he is such a gem. I liked the realistic style of the movie and its really interesting and on a different storyline. Sudhir Mishra does a good job here but he fails somwehere as screenplay is not that solid. The pace of the movie is also bit slow. Definately it's for select audience but at the end of the day I enjoyed Serious Men."}, {"id": 35, "text": "You are an outstanding actor Nawaz sir, one of the finest acting.... To many ciphers to decode, the struggle of a parent/child with mental atrocities the world brings...."}, {"id": 36, "text": "Good motto.. But you know something is missing. It didn't give the feel of satisfaction. It could be better i think with Nawazuddin sir."}, {"id": 37, "text": "Awesome story, Navaz as always fits into frustrated middle age man. Loved politician role aptly performed by Sanjay Narvkar. This is total entertaining movie."}, {"id": 38, "text": "A unique concept is the USPof the film. It's an off beat film but really good to some point.Nawaz kills his part as always.Casting is good.Overall a good film to watch."}, {"id": 39, "text": "The storyline of this movie is amazing. The acting is also good. I have to tell this is a unique story with super dialogue"}, {"id": 40, "text": "Acting and direction has touch of Netflix. The concept was nice, but the storyline diluted the concept and made it just another story. Can enjoy as one time watch"}, {"id": 41, "text": "Don't be a plain hater... appreciate the art at its finest..."}, {"id": 42, "text": "It is must watch film with varied actors and awesome acting skills. Every emotion is discovered in the film with great exposure to every character."}, {"id": 43, "text": "Acting was good, especially by Adi and Nawazuddin but the narrative was poor. Too many loopholes in the story. Climax was a big disappointment. 5 stars for acting and a zero for the rest."}, {"id": 44, "text": "Must watch I totally loved it. Satire to the society. Must watch"}, {"id": 45, "text": "Definitely worth your time.Nawaz gives another superb performance"}, {"id": 46, "text": "Serious Men is a movie which should be watched by every Indian parents or I should say Indian subcontinent parents ... they pressurise there kids for excellence and then sell there talent. Awesome work by Nawazuddin Siddiqui !"}, {"id": 47, "text": "Hats off Nawazuddin....Nawazuddin is giving new virtues to Indian actors. Watch this for the performance of all the actors. Nothing is over done and the pace of the movie is just right. Not a page turner but will make you think specially if you are a parent....."}, {"id": 48, "text": "First of all, take a bow Nawaz bhai. How does he deliver such an effortless performance everytime he comes on screen. Coming to the movie, I had high expectations from the film as I was a fan of Sudhir Mishra but he has taken a great concept and made a whole mess out of it. He tries to do too many things at the same time which ruins the narrative. Could've been so much better. 5 stars for Nawaz bhai's acting rest the movie has nothing to offer."}, {"id": 49, "text": "Great Acting by Nawazuddin Sir as always. The Storyline is good, It is based on a BOOK . A must watch for parents specially !"}, {"id": 50, "text": "A very slow boring movie. Thought of actors are good so watched it just wasted my time"}, {"id": 51, "text": "An oblivious narrative that holds no water in the current scenario and the usual caste politics by throwing dirt at the upper caste (especially Brahmins as usual) and surprisingly Christians were muddled this time as well. The story is predictive coupled with some great acting by few cast members."}, {"id": 52, "text": "Very good story and brilliant performance by Nawazuddin. You just can't take your eyes off him. He is Perfect in every scene."}, {"id": 53, "text": "Fresh story but failed to execute it. Not a good screenplay. It seems like the store has been stretched."}, {"id": 54, "text": "A very honest attempt to portray desperation of a father of an average child who wants to see his son to grow and supertalented genius. Nawaz has done a brilliant act but dont forget to notice the kid. I am sure you will enjoy quest of an poor father for his son's bright future."}, {"id": 55, "text": "Watch only if you don't have anything else to watch..... Don't expect too much... Predictable and an one time watch !!"}, {"id": 56, "text": "Amazing movie.. again masterpiece by nawaz bhai.. nawaz bhai ne jaan daal di movie me. Story is also awsome.. must watch"}, {"id": 57, "text": "Inspirational movie n very good acting of navajuddin"}, {"id": 58, "text": "Serious Men is boring and lacks the charm of story telling. This movie aims every middle class men whose child is ordinary. I felt it's boring in the first part but then it takes a turn that keeps you hooked. Director Sudhir Mishra should rethink and then aim to create a relevant plot, I felt he was not clear on how to take the story further. Not sure if it qualifies for even one time watch but Nawazuddin did his work!!"}, {"id": 59, "text": "Based on the book by Manu Joseph of the same name, Serious men deals with the problems of insecurity &amp; timidity of a father for his son. Nawaz brings that uncanny charm to his character as an underprivileged-middle aged Dalit. He has angst against everyone in the society, from the peon to the supervisor.Serious men offers very sharp annotation against racism, casteism, politics, media culture &amp; favoritism with its witty as well as satirical sequences. Sudhir Mishra brings his experience. The film is streaming on Netflix."}, {"id": 60, "text": "It is very challenging to play one of the main characters next to a strong actor like Nawazuddin.Aakshath Das passed out with a full 100 percent pass.💯It is a very severe movie.If it was wrapped, the hard feeling would have been less.🙂The all characters are very well made,But if the characters were analyzed more deeply, the quality of the movie would have increased.👍"}, {"id": 61, "text": "Great work by all team. Nice story,superb acting. Mawaz sir is always on fire👌"}, {"id": 62, "text": "This is just a waste of time with no sensible story."}, {"id": 63, "text": "This movie story is ok and unique concept moral of the story don't pressure ur children middle boring I am only watch for nawazudin"}, {"id": 64, "text": "I'm not like this movie very boring movie bt ya kids movie is so nice"}, {"id": 65, "text": "Serious Men - 2020Kids are like flowers, either they bloom or die. but you have to keep watering the seeds Oh! that's kind of a spoiler in the very first line, well! it is what it is. A beautiful story is a message from starting till the end.so its basically adapted from the book Serious Men by Manu Joseph. How a father decides to make his child a genius and take away where it all comes to the charm and glory but, can a child take that pressure? well, you will see how beautifully is that thing presented in the Serious Men by the amazing performance of Nawazuddin Siddiqui and the child artist Akshath Das in the lead roles with an amazing direction by Sudhir Mishra.not just the lead roles, but all the performances are up to the mark and we see a brilliant camera work with amazing camera placement and focus game at several places. Dialogues are pretty good and suit with the characters, but it may create a problem watching a content related to a kid with abusive language in it, although it brings a sense of comic touch in between.Basically, there is already a lot of cinema that has been made on the topic that Serious Men mainly deals with, but it comes with a new touch and with a new environment taking caste, jealousy, and things like that along with it."}, {"id": 66, "text": "Nawazuddin never disappoints and he shines bright once again in this funny and poignant film. His son is just adorable. The film is a great tribute to the book and the director has done it justice. The story is simple: a lower caste man who is mistreated at work every single day, decides he will not allow this ruthless, judgemental and prejudiced world to mistreat his son. He fights to get basic respect in a very prestigious space project office. At his humble abode, he teaches his son to memorize facts to portray himself as a child genius. It's an emotional ending with the little boy having a breakdown which is punishment enough for Nawaz as his father. His son comes first and anyone who suggests that he was in it for the money is wrong. Anyone who also suggests that the message that you should make your way in the world through fraud is also wrong. The message is clear: India's caste system is a disgrace to the nation and despite laws to suggest there should never be discrimination based on caste, it happens even today in every walk of life. The struggles of dalits is real. And it should not even exist. Wake up India"}, {"id": 67, "text": "Its very boring show and have nothing interesting to watch for ..from the very start of the move they show Hindu god then showing these actors doing dirty work then again god ..ridiculous what they want to prove anyhow i started to watch but there was nothing in this movie better watch mithun da old movie much better and entertaining than this Netflix shows going boring day by day 👎🏼"}, {"id": 68, "text": "This movie hits many birds with single stone. It shows Dalits as not only Corrupt but also unintelligent, Indian Scientists as liars, Casteism is everywhere, Dalit Leaders are fooling people. The communist director has cleverly hidden is agendas all over the movie. Watch this movie only for entertainment, thus leave the brain somewhere safe before watching it."}, {"id": 69, "text": "This movie could have been a good movie without putting those unnecessary unrelated derogatory remarks on religions. Just another PROPAGANDA movie ruining a good story and great actors. DON'T WATCH."}, {"id": 70, "text": "Serious Man - Drama Movie Cast - Nawajuddin ShahThis movie seriously corresponds with its title. This is a story about a clerk who wants to make his son a extra ordinary brilliant boy. He wanted to achieve everything that he couldn't get in his life through his boy and plays a serious risky game. A planning from a mastermind with the acting of Nawajuddin is really amazing. The child actor played the role so amazingly as his son that I forgot that it is a movie. A totally new concept with lots of dramas, thrill and twists made the movie so amazing. The only complain for this movie is,it could be longer. I enjoyed so much that I needed more scenes of this movie but to be hinest it was a perfect movie. I recommend strongly this movie.Personal Rating - 7.8/10"}, {"id": 71, "text": "Different story line, strong acting! Somehow i always like Nawazuddin Siddiqui's movies. Incredible acting!!!"}, {"id": 72, "text": "Only Nawaj Bhai His extraordinary acting Make you attachable"}, {"id": 73, "text": "Serious man by Netflix is one of the best Indian movie of this year. A movie which shows many small problems in the society while going through the main plot.... The pressure that the child face of their parents expectations, the need to take their own decisions, pressure of getting compared to someone else with different kind of mind and ability than you, the life of slums in india, the length a father can go to make his child big, pressure of being a prodigy and not improving.... The movie showcase these problems greatly...."}, {"id": 74, "text": "Great performance by all the actors, specially the kid. Only problems I felt are unnecessary foul language and intimate scenes. It could have been a good family movie."}, {"id": 75, "text": "How many times do parents strive for their children to have a better life? This is a Hindu drama based on a book. It tells the story of a father who wants to change his social status and that his son does not suffer from deficiencies and has better opportunities than his, that is why he pushes him to the limit by turning him into a neighborhood celebrity showing the genius boy he is, doing all kinds of adventures. Entertaining Quality. Performances at the level. It shows the cultural struggle of the East and the West, the scam, the way in which parents cheat, want something better, fraudulent and even sell. The petulance of geniuses and how not very humble they are. Explore society in the way you can get carried away by leaders who show up without actually knowing them. The character of the dad is extraordinarily delimited and created, it shows the motivations and frustrations he has."}, {"id": 76, "text": "King of Netflix from India. Only one Nawazuddin Siddiqui 👑"}, {"id": 77, "text": "A great movie with a complicated plot and yet simple with a small life stories. Acting is too good, everyone put effort in there act, Nawaz is somewhat captures the south Indian tone but not fully but still it is better as his character is grew up in Maharashtra... Director put alot effort with Cameraman they certainly used and created everything to enhance the storytell... Editing is moderate.. overall must watch. Movie filled with lots of messages"}, {"id": 78, "text": "Its is very funny in deep and also very true. Acting, story, screenplay, casting everything is superb. If you are a movie addicted then this one for you. Just watch it and i am sure you will love it. The score is a solid EIGHT."}, {"id": 79, "text": "Just loved everyone's acting &amp; every bit of the movie!"}, {"id": 80, "text": "Nawaz is one of my favourite actor in this movie his role is great i personally love this movie its acting and concept is great you definatly should watch this movie"}, {"id": 81, "text": "Movies is good but what is the need of absurd language."}, {"id": 82, "text": "It is very good movie... acting of every stars is very good in this movie... And have nice story"}, {"id": 83, "text": "This movie is soulful, with a very hard hitting message which is important for humans for many generations to come. Top notch performances by each and every character. Nawaz was the best in his character, just lives the role. The kid was adorable and very professional. You can't help but fall in love with this kid. Hats off to the Writer and Director for picking this subject and developing it into a movie material. Just felt amazing watching this masterpiece. Enough said, it's highly recommend and to be watched by anyone who has been a kid or had/have or will have a kid of their own. Finally, Thanks Netflix!"}, {"id": 84, "text": "I really liked the movie. Felt really sad for the poor kid.."}, {"id": 85, "text": "Feel for the characters.. give full credit to all departments .. the view of the world from all strata of the society is different .. it shows that we have to be humble about ourselves and be compassionate about others in society .. and facts have more to it in history and it's not just a point in time event .."}, {"id": 86, "text": "A must watch movie. All areas excel from acting, direction, music.."}, {"id": 87, "text": "Amazing writing and acting..it's a must watch...fantastic loved it"}, {"id": 88, "text": "Nawazuddin Siddiqui outdoes himself in this sharp film."}, {"id": 89, "text": "Movie is very good with new story and realiastic. Must watch for parent whose kids going to school. Acting is top class from nawaj and special talent is kid."}, {"id": 90, "text": "Absolutely loved it Nawazuddin is back after string of mediocre performance. This one deserves a lot of attention."}, {"id": 91, "text": "' I can't deal with the primitive minds like you'😂"}, {"id": 92, "text": "It's one of the few movies which captivates your attention right from the start.. brilliantly directed and acted with a blending background score it's a must watch.."}, {"id": 93, "text": "It's a slow poison .🔥🔥🔥🔥🔥. You can enjoy every bit of this movie ."}, {"id": 94, "text": "Simply amazing. Awesomely crafted and a well deserved movie for our gaitonde bhai. Acting at its best . Infact movie is best in all context."}, {"id": 95, "text": "Direction of Sudhir Mishra and Acting of Nawaz DUO rocks.Story line is very beautiful. Everything goes beyond caste, creed and equality and corruption things.Child should not feel any burden, same way parents bear all burden so their kid can live freely. Father Nawaz and child Aakshath both performance is par level. Like Traffic Signal and Yeh Saali Zindagi this movie too has different level.Verdict - Worth watching"}, {"id": 96, "text": "This is the movie that everyone should watch than that garbage movie khaali peeli this is the best movie done by Nawazuddin Siddiqui the direction story everything was fantastic"}, {"id": 97, "text": "Serious Men is one of the finest films of this year. Director Sudhir Mishra successfully delivers a worth watching and impactful film. The film addresses the caste system prevalent in our society, inequality, corruption, and politics. The dialogues are effective and the screenplay is sharp from start to finish.Nawazuddin Siddiqui effortlessly slips into any characters, once again he delivers a brilliant performance. One more impressive performance in the film came from the child artist Aakshath Das. Indira Tiwari and Nassar got limited but effective roles. Shweta Basu Prasad and Sanjay Narvekar were decent in their supporting roles.Direction 3.5/5 Acting 3.5/5 Dialogues 3.5/5 Story 4/5 Screenplay 3/5"}, {"id": 98, "text": "Osm moive superhit and acting was brilliant this is the best moive of the year"}, {"id": 99, "text": "Just finished watching this. The dialogues are hilarious but I felt the length of the movie could have been cut down by 30 minutes. Short and sweet cast. And good to see Sweta Basu Prasad getting roles.The child was the surprise package of the movie. Wonderful acting by the little one."}, {"id": 100, "text": "It is true that the parents do not want their children to see that lack, suffer the misery they themselves bear, but it is not good for the children to bear the burden of their happiness and sorrows and ambitions.Director Sudhir Mishra's film Serious Man brings these issues to the fore.The interiors of this story are beautiful. The writer-director has created an exit strategy for Ayyan and Adi.But consider that this is not the end of the fight of the fighters for their rights because the status has no connection to the IQ and the talent also has no color (black or blonde).Some of the film's dialogues are quite effective. At the same time, some scenes between Nawazuddin and Akshat touch the heart.The film starts off with satire and then becomes poignant and then poignant.The film based on the book slows down considerably in many parts. The main characters have been given a lot of time to set up, which makes it a bit bored and impacts the storyline.Films on social bias and discrimination have been made for years, but 'Serial Men' makes its characters different.As a father, Nawazuddin Siddiqui appears to be the best, while the strong side of the film has emerged as Akshat Das in the role of his son.He walks shoulder to shoulder with Nawazuddin in every scene.Nasser is perfect in his character.But, the director has given very little space to a good actress like Shweta Basu Prasad.Apart from caste discrimination, 'Serious Men' made under the direction of Sudhir Mishra touches on topics like inequality, lack, corruption, politics. Director Sudhir Mishra has tried to put it in an easy way.The message of Netflix Serious Men is very important for making a serious and social taunt, but it is served that way easily."}, {"id": 101, "text": "Nawazuddin Siddiqui is one of the best actors working in the Hindi film industry. He's done so many interesting films and Serious Men is no different.Serious Men follows Ayyan Mani, an underprivileged man who decides to make his son a genius. However, he'll soon find out that his method is slowly destroying his son.Serious Men is a film that may linger on people's minds for some time. It's a film that a lot of people can relate to. Adapted from the novel by Manu Joseph, Serious Men explores the desperation and want to have a better life and how caste and class plays a factor into your societal status. A great aspect is the writing. The characters interact in a natural way and its commentary on society doesn't come across as preachy. Having four writers on a film can be scary as there may be a clash of ideas but Abhijeet Khuman, Bhavesh Mandalia, Nikhil Nair and Niren Bhatt all collaborated really well with each other and made a script that was thought-provoking and engaging. There are parts of the story which I did question because it seemed a tad unbelievable but otherwise I didn't have much of a problem with it. The cinematography is handled really well and Sudhir Mishra's direction was well done.The performances really shine in this film. Nawazuddin Siddiqui once again does a great job here. Ayyan is a very intriguing character that has many layers to him and Siddiqui plays him to a tee. Nassar, as the intelligent but arrogant Dr. Arvind Acharya, plays his character well. Indira Tiwari also does a good job playing Siddiqui's wife. I've always been sceptical about child performances but Aakshath Das was truly great. He conveyed the smart and confused nature of Adi well and I hope to see more of him in the future.Serious Men is definitely one of the better Hindi films I've seen this year. It has a fascinating premise and an interesting take on society that is sure to make you think."}, {"id": 102, "text": "The kid (Aakshath Das) shines in Serious Men, a social drama that reminded me of Malayalam comedy Salt Mango Tree (2015), and which is more about the stress that children feel at the hands of their ambitious and competitive guardians and less about class divide despite the montages that show otherwise. Here, the kid's father (Nawazuddin SIddiqui), hailing from a backward caste and having an antagonistic view of the world, uses the caste card and his child to aim for the stars, garnering applause and hollow fame on the way. But for what? Serious Men goes on to throw social commentary at you on how the rich and the influential act as parasites on the downtrodden with ample amounts of quirky humour and useless fillers. But, notably, it also gives you a peek into the ill effects of over ambition, giving a spine-tingling climax to an otherwise humdrum proceedings. Siddiqui, Indira Tiwari, and Nasser are all well-directed by Sudhir Mishra, who has finally had a good comeback since Yeh Saali Zindagi (2011). If you are not ready to accept what Serious Men tells, and not preaches, you, this will be a fine afternoon affair. A better watch to parents with young kids. TN"}, {"id": 103, "text": "Serious men is based on the book of same name and tells the story of a over-enthusiastic office assistant, who would go the extra mile to get the respect he deserves along with is son. The movie on one side focuses on a High IQ child prodigy, who seems to blessed with natural intelligence and inquest while the other side parallels the games played by individuals from all the strata of society to get what they want. The whole premise tends to reach a boiling point when the core sub-plot unfolds sometime in the middle.Gradually though, despite the humour in the situations portrayed, especially in the satirical take on corruption that knows no social barriers, and despite the entertaining audacity of abundant strategies, the film reveals its hollow centre, only to pick itself up in the last 20 minutes with a liberal dose of practicality.Nawazuddin Siddiqui is at is usual best in his portrayal of a Ayyan Mani. Indira Tiwari and little Aakshath Das do their parts well. Nassar as Dr. Acharya a shrewd, no nonsense arrogant director of a government-run scientific research institute excels the most. Director Sudhir Mishra tries to put in too many punches but only a handful land on where it is intended. Adapted screenplay may not have done enough justice to a good story. Cinematography, casting, music, costumes and production design were decent. Make up was a little over done.Overall, not a perfect movie but Serious men is funny and poignant in equal parts, it's a mix of complexities that exist around us and the state of affairs that we live in and ignore. Watch it for Nawaz who yet again proves that he has the ability to play wide range of characters convincingly. It is high time that parents in India stop using their children as insurance policy for their future."}, {"id": 104, "text": "Reality TV shows in India figured out their way to an audience and emotional jackpot along the way. Their contestants, when it all began, came from the 'burbs and upper-middle class. Be it a dance or singing competition, or a mega quiz show, the spectrum of participants was limited to our view of plurality: PLU (people like us). But somewhere along the line, some smart TV exec cracked the code: reserve a quota for that cleaved societal lower base whose raison d'être is to struggle to make it through the end of the day to garner sustenance on the family plate and haul their weary bones to begin again the next day. Suddenly our screens - and eyes - were flooded with the vision of what lay beneath our comfy, insulated lives. Sacrifices, shattered dreams, and tragedy, all rolled into before or after a song as judges sniffled, hitting the buzzer to open the gates for these talented, hitherto unseen strugglers into the next round. The TV channels grabbed eyeballs which in turn grabbed hankies, and we sobbed as the channels sprinted their way to the bank.That such reality shows, albeit in an inverted avatar, play out in everyday lives is brought to the fore like a tight, smart, and smarting slap in director Sudhir Mishra's 'Serious Men'. Based on Manu Joseph's novel and written by Abhijeet Khuman, Bhavesh Mandalia, Nikhil Nair, and Niren Bhatt, the movie opens to Ayyan Mani (Nawazuddin Siddiqui) conceiving, with his wife Oja (Indira Tiwari), of the next-gen, even as his voice-over sets the context for what'll be its encompassing arch: the exploitation, discrimination, and deep-rooted systemic structure and politics of caste. Ayyan's a personal assistant to arrogant scientist and director Arvind Acharya at the National Institute of Fundamental Research (NIFR, and a snook at the hierarchies in TIFR and other such hallowed research institutes ?) -Nassar, superb, bringing the upper caste superiority to his act and demeanor, his character's knowledge as deep as his shallow understanding and treatment of his assistant and anyone else who's below him: in rank and caste. For him, that's a spin to his own demarcated caste system.Full of smarts and blink-and-you-miss satire: Ayyan tampering with a quote on reservation attributed to Arivunambi Ghatak - melding a Tamilian name with that of a famous Bengali filmmaker - replacing that fusion noun with a famous economist, it's a sly dig at manipulating the narration. And that's precisely what Ayyan is good at. Controlling the narrative. And it is this street-smart talent that Ayyan brings into play for his own son Adi Mani (Aakshath Das) to beat the system that's jailed him in a slum dwelling all his life, which he wants to break free from for Adi's sake.It is this manipulative streak that's a terrific spotlight on the very nature of our societal system and parenting choices. Aspirational parents create their own reality shows, pushing their children into a circus that's a hamster on the wheel cable TV. Plus, if you're born into a lower caste section - Dalit, in Ayyan and his family's instance - the die's loaded with equipollent and opposite force. There's reservation that'll get you a job as the one Ayyan has, but Ayyan wants more out of life for his family and himself. And helping him achieve that is his half-crust of phrases that he's acquired from being a fly-on-the-wall in NIFR, listening to Acharya's rants and ravings about gravity, space, and alien microbes. In a delicious touch of irony, anything that Ayyan says that's closely related to science is dipped in arrogance and disdain for his listeners - be it his colleagues, wife, son, or us. That's thanks to the pejorative boss he reports to. In another satirical bite that leaves its marks on Ayyan and his family is that in his warped system, chucking away humility and carrying the bag of brashness is the way to survive and beat back the naysayers. And that high-handed tone exactly what Adi picks on.In forwarding his dispersed quotes and knowledge to the unknowing and wanting, Ayyan props Adi as a prodigy that quickly grabs the attention of the local Dalit politician Keshav Dhavre and his educated-abroad daughter Anuja (Sanjay Navrekar and Shweta Basu Prasad, both terrific) who set in spin their own system-within-system game. That Anuja has her own past trauma gives her the strength to wield a stick with brute force is another insight into director Mishra's character spin.As the politics at the NIFR (Acharya's run-in with his bête noire, Namboodari, played by Uday Mahesh, is the tipping point for all), the slum, and between Ayyan and Adi and the politicos begin to get intertwined, Manu Joseph's sparkling clarity that's evident in his columns bubbles like good champagne, rising to meet you and then delivering a swimmingly spritzy experience. That India's brightest and mature minds aren't insulated from deceit and shenanigans (Vidhi Chitalia as Oparna Sengupta the smart, younger shoulder for Nassar's Acharya, playing her role in another discriminatory gender system that runs parallel or superimposed on the caste track - and that's not the only time the movie looks at women's stories; the other one involves money, greed, and exploited women), and that who they inspire awe and hate in equal measure in, follow the same path, points to director Mishra's never-ending mirrors within mirrors structure.'Serious Men' cloaks itself in quick-footed dialogues with doses of cynicism, Karel Antonín's thoughtful score, and Alexander Surkala's quietly framed cinematography; and then, come the tipping point, breaks your heart as its machinations rip asunder tender minds and hearts, and the rot of rote and educational fraud spills out of its guts. Aakshath Das as Adi is top-notch, the actor carrying the burden of his character with all the strength of an overloaded, tearing-at-the-seams schoolbag. And when he breaks, he opens a flood of anxiety and concern inside of you. Indira Tiwari as Oja is beautifully raw and uninhibited in her act, making her character an integral part of the story, even if she isn't part of the mainframe.The cast is superb all around (casting director Mukesh Chhabra gets it pin-point accurate), but Nawazuddin Siddiqui shows why he is, in such projects, the last man standing after Irrfan Khan's untimely exit. Absolutely natural, dry like gunpowder, and exploding when the last straw is lit - his scene confronting Adi's classmate's father in the slum is powerful and moving, his voice breaking and yet trying to retain control - he's the driver and the teacher for this tell-tale of a movie. What he teaches and learns is this: that no matter howsoever much you're in control of a narrative that involves the system, the immutable latter's gotten something extra hidden in its sleeve that covers its upper hand. And that when it comes to funds for survival, your chances are much better as an alien microbe in outer space than as an earthling dweller in a crammed slum."}, {"id": 105, "text": "NETFLIX'S SERIOUS MEN is outrageously splendid. One of the best commentaries on the corrupt notion across religion, caste, politics, and science. That's what cinema should be doing. Bring out thought-provoking real stories to reel. This is Nawaz's award-winning act where his body language, dialogue delivery are able to bring out the pain, agony, suffering, frustration, happiness, ambitions, and above all- love for his son.His son played by Aakshath Das is another gem to watch as he shines like a diamond. He is able to bring out all the emotions that a small kid would feel.The climax is gonna make your heart skip a beat in a subtle way where we have Nawaz explaining his action and also, course correction. I was overwhelmed. Nowadays, I hardly see a movie with an ending that offers a complete closure. 'Serious Men' has that ending.This is one of the finest movies that Bollywood has to offer and would like to recommend it to everyone. A true celebration of movie making that can't be missed. And that I'm saying on a serious note!"}, {"id": 106, "text": "Serious Men is a dark satirical drama based on a book by Manu Joseph. The association of Nawazuddin with Netflix continues to deliver quality cinema. Few weeks ago we had seen in movie Pareeksha how a rickshaw puller goes to every extent to secure his child's future. Now we have Nawaaz playing a backward tamil guy willing to take any step to do the same. This is one of the best works from Sushir Mishra in recent years. The sharp storytelling not only sheds light on the cast and class divide existing in our society but also talks about aspirations of Indian parents. The expectations they have from their children &amp; the pressure it creates on a child killing his childhood forms the crux of the story. Somebody rightly said Nawaaz is our national treasure and you are constantly reminded of this fact while watching the film. He is in top form here supported brilliantly by the child actor Aakshath Das. Its a delight watching both of them as a father son duo. Rest of the cast is good in their respective roles. Serious Men adds to the repertoire of Nawaaz and is a relevant watch which doesn't fail to entertain. Do not miss this one on Netflix."}, {"id": 107, "text": "The film is based on the book of the same name by Manu Joseph. The story is based on a man named Ayyan Mani. Who is assistant to an astronomer. Mani lived with his son and wife in a slum. He wanted to admit his son into the renowned school in the city. But the school authorities rejected Mani.After 6 years of this incidents, Ayyan's son Adi Mani became popular all over the country and called a Genius. Because, that child research on space and ask people or teacher's about cosmic.The story was very intriguing and also interesting. Though it is conceivable but I liked it. The scripting and making was quite good. Nothing new to say about this person, Nawazuddin Siddiqui.He can do any role at any place without any doubts. This movie will not be that kind of watchable if they didn't cast Nawaz. Really Liked it."}, {"id": 108, "text": "Sudhir mishra: I have serious men lined upAnubhav sinha: thanks for the preview. It was okaySM: heard your back was sore?AS: yes. Can do with a back scrubSM: let me give you a back rubAS: serious men was fantastic. 10/10 worthy===Anurag Kashyap: sorry guys. Was dealing with some legal problemsSM: no issues buddy. Serious Men is out on NetflixAK: great! Sorry, haven't found a moment to see it yet but have already tweeted that it's a great movie. HeheSM: naughty chokra chhe tu===Swara Bhaskar: ahahahahahaSM: What happened?SB: I will praise Serious Men too on my timeline but ...SM: But what? What do you want?SB: I need your Netflix subscription. I am a JNU freeloader and refuse to pay for NetflixSM: DoneSB: ahahahahaha===="}, {"id": 109, "text": "Serious Men is yet another attempt by Netflix to create a quality film independent of the traditional production houses, in Hindi for the Indian market as they did with Roma in Mexico. But this film too can be added to the failed attempts list of Netflix. Serious Men centers around Ayyan Mani (Nawazuddin Siddiqui), a smart and intelligent man yet uneducated and by his own accounts unprivileged, and his attempts to make sure his son has all the 'privileges' that he was not fortunate enough to have and make sure his son lives a better life than he did. As simple as the above task seems, Ayyan makes it a little too complicated with a few white lies and rule breaking. The story lacks depth and is a further reminder that, in the modern era of Indian entertainment films only with renowned actors will still fail if the film doesn't have a good story and a strong screenplay. As has been the case for some time now Nawazuddin's acting is unquestionable which brings life to the character. The film almost accurately depicts the lifestyle and living conditions of families that are not well of in challenging and fast paced cities of modern times. But that's about it as far as compliments to the film go. The film starts of well with a good portrayal and peculiarity of Nawazuddin's character and feels like a unique story building up, but it seems too unique for one's liking and the film loses interest &amp; attention of the viewer about halfway through the movie. So all things considered you won't be missing out on a lot if you choose to avoid this movie, with better options on Netflix to spend your spare time. Acting- 7.5 Casting- 6.5 Cinematography- 8 Dialogue- 7.5 Directing- 8.5 Editing &amp; Effects- 6 Sound &amp; Music- 5 Story- 5 Storytelling- 5.5 Rating- 6.5"}, {"id": 110, "text": "Serious Men shrewdly displays deeply engraved issues within our society via thought provoking dialogues &amp; humour. With unadulterated subtlety; it sheds light on Cast Prejudices, Societal Acceptance and the concernment of Responsible Parenthood!Sudhir Mishra's astonishing direction being the backbone here with eminently written dialogues and an evident display in visual mastery apace with a sublime soundscore, that fits accordingly. Disseminating through innate nuances, the director holds a mirror to our society as well as to us; as insatiable &amp; infatuated human beings. About the lengths we would shamelessly go for our everlasting persuasion of betterment.The same conveyed through this individual called, Ayyan Mani; impeccably played by Nawazuddin. A stubborn father so obsessed with his ulterior motives for his offspring, that he forgot the foremost responsibility he had of becoming a supportive, empathetic parent to his only son. A lesser presence by comparison yet Indira Tiwari as Oja; A strong maternal figure impresses. Akshath Das as Adi, simply stunning. The way he handled himself infront of such veterans in the game is quite awe-inspiring.Not only the performances, the effulgent writing communicates deep-seated issues dwelling in our country that everyone is aware of yet we choose to keep reticence. Loopholes in our education system, ever present class differences, few obsessive set of parents who only care about the marks their children are getting. Ignoring the feeble child psychology; inevitably triggering lifelong mental health issues, that starts from a very young age.It would take few more paragraphs to describe what I gathered from this brilliant piece of work. Hence I must conclude. Before I do so, there's unfortunately one negative left to mention. It's the last act and its unforeseen failure to wrap up everything in the end. The climax felt rushed &amp; less concerned with the emotions. Contrary to what I had in my mind."}, {"id": 111, "text": "The movie is incredibly entertaining. From end to end as we explore various scenes, a gripping story, the socio-economic problems a lower caste person has to face in India, to the twists that come about, the movie is an absolute adventure! Made even more awesome by Nawaz's fantastic performance as always who can carry any movie on entirely his shoulders. Salute to him, a forever fan!The movie is spot on by showing that upper caste people deny the problem as they have solved it from their end as most in India have stopped common practices related to caste. Which in itself is a good thing but the denial tends to ignore the systemic challenges still prevailing. And that we all need to at-least first acknowledge the problems.Another part I absolutely loved was how missionary schools and evangelicals prey upon lower caste people so that they can be converted into Christianity. They act charitable but the motive is aggressive proselytization. Another problem lower caste Hindus face in India.The problem I had with the movie was that the lower caste person was shown as someonne doing shady things who takes the negative route. While it's understood that is, but it doesn't help that in pop culture we always show lower caste people doing wrong things which doesn't exactly help with the systemic problem they face. It is insensitive. While I adored the movie, I hope that we focus more towards positive tales related to lower caste people who are able to overcome the problems of society."}, {"id": 112, "text": "An aspirational father gets his school-going son to fake knowledge beyond his age and calibre. This basic setup of the film 'Serious Men' is too far-fetched to be acceptable and thereby the film does not hold. The makers never focus on how the father gets his son to fake as a genius boy and you are supposed to digest it with a couple of convenient scenes where the primary school student shows off his mugged-up smartness. This is one aspect where 'Serious Men' does not take itself seriously!Director Sudhir Mishra might have wanted the audience to focus on the outcome more than the setup. The idea is how a father robs the innocence of his son by making him a child prodigy. The subtext is dignified. But the setup is flawed!The film meanders too long in character setup to come to its point. Literally opening from conceiving the child, to the delivery happening in the opening credits to the child getting admission in school, the film takes too long to arrive to its agenda. For quite some time, the viewer isn't able to figure out where the narrative is going or what the film is trying to say.However once the story comes to its point, it sticks to the father-son conflict. Thereafter the message is quite clear - let your child be himself rather than making him a prototype of your unfulfilled ambitions. Not that the theme is avante garde but still its pretty much relatable, despite being brought up several times in films of recent past.The pacing is slow. The acts are predictable. Nawazuddin is good in his part but seems typecast rather than tailor-made in this role. His monologues as a narrator, his dry wit, his intense face closeups, the victimized act - all of it has a stereotype rather than deja vu effect. Aakshath Das as his son is good. Nasser plays his part well. Others do not get much scope.Serious Men struggles to be different and in doing so, often seems pretentious. This could have been far more entertaining, while still having the moral and subtext in place."}, {"id": 113, "text": "Ayyan Mani (Nawazuddin Siddiqui) is an ordinary man, leading an ordinary life. Professionally, he is the PA to Dr. Acharya (Nasser) the lead scientist at NIFR and is absolutely convinced that his boss is fooling the world with his wacky research on alien microbes but puzzled about how convincing and confident the latter is, in getting away with lies. With the birth of Mani's son Adi, he hatches a grand plot of exhibiting his slow learner kid to the world as a prodigy and a genius in the making, thus achieving the extraordinary aspiration of societal recognition and adulation.Adi grows confident due to Mani's incessant guidance, illegitimate mechanisms for catapulting him to fame and popularity, using which the latter gains the recognition that he otherwise would never have achieved. It's a grand secret between the father and the son, but like all good things, it must come to an end. The repressed childhood of Adi, and his inability to act without assistance slowly starts getting to the child, something that can potentially destroy him mentally. Mani has to find an exit strategy to ensure the safety and wellbeing of Adi, and is ready to pay the price for it.Serious Men, directed by Sudhir Mishra is a tale of a twisted mind that refuses to succumb to the ordinary and will go to any length to realize his dreams, by hook or by crook. Nawazuddin Siddiqui is par excellence as the master manipulator, who is least concerned about the lack of maturity of the young mind, piling on agony on the child with psychological overload. But Serious Men belongs to the child artist Akshath Das, who absolutely captivates with his charm, innocence and complex psychological emotional demonstration, especially when he is unable to handle the burden any longer. Serious Men is a diabolical essay that waltzes on the screen in the garb of a socio-comic drama that gradually returns the young mind to sanity and normalcy, but not without collateral damages. It does leave some important messages for parents who overload their children to rise to the competitive world, without being preachy."}, {"id": 114, "text": "Movie rating- 9/10 NETFLIX'S SERIOUS MEN is outrageously splendid. One of the best commentaries on the corrupt notion across religion, caste, politics, and science. That's what cinema should be doing. Bring out thought-provoking real stories to reel. This is Nawaz's award-winning act where his body language, dialogue delivery are able to bring out the pain, agony, suffering, frustration, happiness, ambitions, and above all- love for his son.His son played by Aakshath Das is another gem to watch as he shines like a diamond. He is able to bring out all the emotions that a small kid would feel.The climax is gonna make your heart skip a beat in a subtle way where we have Nawaz explaining his action and also, course correction. I was overwhelmed. Nowadays, I hardly see a movie with an ending that offers a complete closure. 'Serious Men' has that ending.This is one of the finest movies that Bollywood has to offer and would like to recommend it to everyone. A true celebration of movie making that can not be missed. And that I am saying on a serious note!"}, {"id": 115, "text": "SERIOUS MEN (2020) : Movie Review -Netflix hasn't been favourite choice of quality lovers because mostly or almost every time they came up with average product despite talented cast and promising previews. Serious Men adds another paper foil in the dustbin of Netflix which can be read once if you have too much time and got nothing else to watch. The script offers something outstanding which could have became a nationwide sensation but did not end so.The story follows Ayyan Mani (Nawazuddin Siddiqui) a middle-aged Dalit working as an assistant to a Brahmin astronomer Dr. Acharya (Nassar) who is rude to him at the National Institute of Fundamental Research in Mumbai. He lives in slum with his wife Oja (Indira Tiwari) and a son Adi (Akshath Das). Furious at his situation in life about not getting equal chances due to low cast ignorance from high class people, Ayyan develops an outrageous story that his 10-year-old son is a science genius - a lie which later gets out of control.Nawazuddin Siddiqui as Aaryan is brilliant and there is nothing you can hate about his acting in the film. Indira Tiwari as his wife gives a natural and matured performance and Aakshath's dialogue delivery is incredible. Nassar as Dr. Acharya doesn't impress much which is shocking while Sanjay Narvekar in small role comes out as a big surprise. Shweta Basu Prasad's look is one of the finest work of make up artist recently as she looks like a real thing from the society and more than her beauty they focused more on her presentation as that smart girl with physical damages.The film begins and takes charge on a solid note with massive turning hold dialogues and fun factors. Then it goes on to find intellectual part to blow our minds that at one moment or for an half an hour to be more precise the film looks something outstanding and never seen before stuff. But while moving towards the climax it doesn't find proper answers to it's own intelligent theory and hurries up to the typical dumb ending. Screenplay is engaging, literally no dull moments except for one or two in the 2nd half. Overall narrative is entertaining and interesting even though it failed to make sense in the the climax. Dialogues are fantastic and Nawazuddin's dialogue delivery makes it even more funnier. Vulgarity and abusive Language are definitely 2 big issues here because the film has a child Artist in pivotal role and the Child audience cannot watch this semi adult drama.Sudhir Mishra is a genius director i must say and even in Serious Men he kept the tag alive for most of the runtime. He tried to put up so many things in one narrative such as Middle Class Man's life, his struggle, low caste issues, educational frauds, political conspiracy, a child's mentality and all this so humanly that it seemed impossible to have all these things together. Even after all this so good looking show where did he missed it? It lies in the climax. The film intends to be a sensational and intelligent stuff but it hardly tries to keep it's own words in the end. Its just another undone show by Netflix. In short, Primitive Film, i could't deal with it. They tried to sell a fraud under the cover of Intelligent theory and Cast grade system but didn't get it right.RATING - 5/10*"}, {"id": 116, "text": "After a long time Netflix with Sudhir Mishra came with a strong and really serious content referring the same name bookNawaz is a dynamite in performance only a good director can explode him and that's what Sudhir did by giving him this character of a person who is left behind and makes a hell way out to succeed his dreamsChild aakshath played his role magnificently in line with Nawaz thus creating a new level of father and son chemistryThe movie contents are very strong which shows you the naked truth of society and how a poor person deals with it also it is supported by good humour and climaxSuperb direction ,accurate editing ,art works ,locations ,camera work, takes to a new level of cinemaExperience it you will surely get the real dose of entertainment"}, {"id": 117, "text": "#MovieReview #SeriousMen #NawazuddinSiddiqui #SudhirMishra #Bollywood #Netflix #SpoilerFreeSerious Men is an uneven satirical take on education, the blind faith of Indians on celebrities, caste and class politics.Nawazuddin ably shoulders the lead role of Mani, a cynical government PA from a Dalit family hell-bent on portraying his child as a science prodigy.The premise, based on an award-winning book by Manu Joseph is ingenious and the movie builds it up in a fun first half with several laugh-out-loud moments.Unfortunately, the narrative becomes tedious and boring in the second half despite Siddiqui's best efforts.While there are several genuine cinematic moments that leave you spellbound I felt it was overlong and convoluted in its climax.Watch it for another superb Nawazuddin performance. Much more was expected from the director of Hazaaron Khwaishein Aisi"}], "reviews_amount": 118}