{"name": "A New York Christmas Wedding", "titleId": "tt10768194", "reviews": [{"id": 0, "text": "Yes, firstly, the production quality on this film wasn't amazing, but the storyline, the New York authenticity, the novel twists on the holiday rom-playbook and the diverse talented cast makes this movie a standout amongst the trite and hella white holiday movies of this year (*cough* Holidate*) and the past. It was precisely the type of movie I was looking to watch and I didn't even know to look for it. What a way to inaugurate my Christmas movie watching!"}, {"id": 1, "text": "I came across this in a Netflix search for the typical holiday movie. This is much deeper and more meaningful. I agree with some reviews re the filming quality. But the story is beautiful. And the actor playing Azreal was excellent. Really moving."}, {"id": 2, "text": "I was trawling through Hallmark style christmas/romance flix on Netflix and clicked this expecting the usual, but wow, did we get more than we expected. This is NOT your usual cookie-cutter rom-com. It's a thoroughly unique and beautifully crafted piece that is both wonderful to watch AND thought provoking, without using a sledgehammer. I would say that I want to find more movies like this, except there aren't any. That's a big part of what makes it so good. As long as you have an open mind about love and accept that love-is-love, then I highly recommend taking the time to watch this wonderful movie. You won't be disappointed. I know I wasn't."}, {"id": 3, "text": "Great story that can touch your heart if it's open. I enjoyed the acting. May they continue to make more Christmas movies for the lgbtq community. Jesus loves you! Blessings to all reading this."}, {"id": 4, "text": "It was such an beautiful and emotional story,I really thought that this story was extremely original and so heart felt!"}, {"id": 5, "text": "This movie was an excellent addition for 2020. Love is love, and I am glad they highlighted such a diverse cast."}, {"id": 6, "text": "Let's be clear, Chris Noth is not a draw for me.He's Mr. Big in a show I've NEVER watched an entire episode of. SATC came out when my ability to sit through crappy 'girl power' shows that are more concerned with the clothes and the shoes than the so-called characters.But color me surprised when Executive Producer/Supporting Character Chris Noth was one of the highlights of this movie.The other was a script that acknowledged bisexuality without beating up on heterosexuality.It's pretty obvious that this, like many films, was a lot longer at one point. There are folks who are high up on the credits, but mostly aren't in the film at all.The lead really shines. The subtlety of the principal lead's performance alone was a reason to watch this one again and again. A beautiful, delicate performance.I am really glad to see a movie where you START with a sassy guardian angel and then add a complex story that follows through at multiple levels.We're still waiting for the day when Marvista, Hallmark, and the other Holiday Rom Com makers finally get LGBT leads into their movies.Thank you Chris Noth for using your weight to get this one made. Your performance was full of complexity and depth.I promise to keep your future endeavors in mind."}, {"id": 7, "text": "I think the film could've been much better if the 2 lead actresses had actually had chemistry. It was painful to watch them together. I enjoyed the story though."}, {"id": 8, "text": "The first part of this movie meandered without much quality storytelling. However, shallowness makes way for depth by the end. Some fantasy aspects seemed too farfetched. Suspend reality and go on the journey. Acting seemed to get better throughout but overall fairly average by some cast members. Social commentary aspects pushed my rating higher. I think more of these stories should be told."}, {"id": 9, "text": "I loved this holiday film. It was very heart felt and brought me to tears multiple times. The filming looks a bit low budget, but the store more than made up for it. The main actress, the angel, and the priest were phenomenal 👏 🙌 ✨ 😍 well done!"}, {"id": 10, "text": "What even was this movie? It was engaging and kept my attention but what was the message? Should I be happy or cry? Really not sure how to feel after this one. Would not reccomend watching if you've lost a loved one, as the story would tell you to just ' go back in time to when the people you loved wasn't dead yet' I'm guessing the angel was trying to teach the lesson of ' don't wait to say i love you' or 'don't be angry if you get heartbroken'. Either way the story doesn't follow what would've happened and how happy the main character would've been if she had decided to stay in her present; we only got a scene of her argueing with her fiance's mother. Is this really a reason to be so angry that you give up on someone you love? Just very confused. The morale should've been to give her some backbone"}, {"id": 11, "text": "The plot is sweet, but the acting is painfully bad, and the leads have the romantic chemistry of damp socks."}, {"id": 12, "text": "Great movie ! Final a lesbian Christmas movie without the lifetime bs!"}, {"id": 13, "text": "This movie is great and like the message of the movie. The chemistry between the actress is believable and both of the look stunning. Production quality aint to bad looks great on an oled display."}, {"id": 14, "text": "If they had better actors and a better cameraman, it could have been a pretty good movie. Unfortunately, the acting was terrible and the finish project looked cheap. There was one scene where a woman had a booger in her nose the whole time. How was that not picked up on? The acting was just SO BAD. I couldn't enjoy the movie."}, {"id": 15, "text": "When I clicked on this movie I was not expecting what it was! I was pleasantly surprised!! Finally an LGBT Hallmark-esque Christmas movie! I was moved to both laughter and tears - sometimes at the same time!! I loved the story and could definitely relate. I'm so happy to have found a Christmas movie that I can actually connect with. It is low budget, and the lead actresses didn't have much in the way of romantic chemistry, but it was still a sweet story and it hit home for me. Would definitely recommend giving it a watch when you're in the mood for a sweet low budget Christmas movie."}, {"id": 16, "text": "It sure wasn't what I was expecting..but for a more low budget movie? Very well done! WAY better then all those Hallmark I married the prince' movies! Not sure why it has such a low rating. Thought it was excellent."}, {"id": 17, "text": "This story line could've been so great but the bad acting, lack of empathy towards Gabby, and the glitchy and shaky camera work just made it a mess. I would love a similar concept to be done with a whole lot of improvement."}, {"id": 18, "text": "It was a very sweet movie and the cast was really good. I wish this could happen in real life , to go back and change things. Highly recommend it."}, {"id": 19, "text": "It would be good if the starring women had any chemistry. Or if you felt invested in the leads life. Bad acting except for Azeael the angel who stole the show."}, {"id": 20, "text": "This was a good start but it has too much going on. The acting was bad and went down hill after the first 20 minutes you could tell what would happen."}, {"id": 21, "text": "This is a hot mess movie. The storyline has a lot of holes and the acting was just bad. The actors were acting like robots or at times overacting. The cinematography seems to have been done with a phone and the editing was just poorly done. The script was horrendous. I fast-forwarded most of the middle to find out the end. I wanted to see what the movie was about since it's LGBT+ and I was curious to see how that was going to be shown in the movie. The movie was so bad that it distracts from any positive message it wanted to portray about the LGBT+ community."}, {"id": 22, "text": "I'm writing this on a boring Thursday night and I probably had too much wine, but this movie is really good. I was hesitant at first because a lot of Netflix movies have been disappointing but not this one! I promise. It will make you laugh and cry. I loved the characters. It makes you think what you would change about your life if you had the chance. Therefore, my takeaway was just to make the most of it. I understand there was religious or Catholic connotations to it, as an atheist, I actually didn't mind; because love is love. It's honestly a beautifully written film with good intentions and message."}, {"id": 23, "text": "Sure, it wasn't the most high quality .. but it kept me engaged and the relationships were refreshing for Hallmark style Xmas fare. Yes, the sight of jewelry crosses early in the movie signaled here comes religion but whatever your spiritual persuasion - atheist like me or you name it - we can all get on board with Father Kelly's love is love message.It wasn't until the end of the movie, when I clicked on thumbs up, that I noticed Netflix's LGBTQ tag. What I really want for Xmas is for that LGBTQ to be dropped forever because it becomes an old fashioned, no longer necessary tag. Wouldn't that be something?! :)Let's have movies celebrate love in all its amazing forms!"}, {"id": 24, "text": "Much of the acting was stilted, not very natural. Was distracted by the often uncomfortable acting, confusing sorry line."}, {"id": 25, "text": "If you enjoy feel good cheesy Christmas films- give this a miss."}, {"id": 26, "text": "The story line was too biased. The whole point of the movie was, your life would've been better if you have just been lesbian from the beginning... even the father would've stayed alive. I thought that was weird."}, {"id": 27, "text": "I'm a sucker for a good feel good Christmas movie. This wasn't that. It has a good story line but it looks like it was filmed on an iPhone 11 pro and I couldn't get past that. Also, some of the story line gets jumbled a little. It wasn't terrible, but it wasn't what I was looking for either."}, {"id": 28, "text": "When I clicked on this film I expected it to be a predicable, cheesy Hallmark Christmas movie, but this took me completely by surprise! It was much deeper and more heartfelt. I had several little cries throughout. I highly recommend it!"}, {"id": 29, "text": "I know people think this movie is great because its an LGBTQ+ Christmas movie but we can't put a hat on a dog and call it a unicorn. From the get go the cinematography made me feel like I was watching a very low budget adult film and the acting was pretty on par to boot! The acting in this movie was atrocious (except for maybe two people with very short parts). Also, the only music in this film is some weird suspenseful horror movie-esque nonsense that begins in the last 20 minutes of the film and never ends...even in the cheerful moments. And don't even get me started on Azrael.The premise of the film? Sure, great, just change the actors, writers, producers, and directors and you've got yourself a Hallmark movie."}, {"id": 30, "text": "That was okay, the production wasn't great I think it could've been better. Had a good storyline just not the best I've seen"}, {"id": 31, "text": "The critics tear it apart for reasons most viewers do not even notice, technical things, cinematography and such. The story is fresh and complex enough to warrant watching it over and over. This is the first LGBTQ Christmas movie I've ever seen, and I love it and will recommend it to my friends. Kudos to Netflix for taking a chance on it."}, {"id": 32, "text": "Awful and upseting for christians! Too bad I wasted 30 something mins to watch some of their awful scenes! On top of that, the actors are sooo bad... that's not acting! I'm so dissapointed!"}, {"id": 33, "text": "I totally appreciate the idea of an LGBT answer to It's a Wonderful Life but the script never quite seemed to nail what message it was trying to make - other than Be true to yourself - which is all well and good but the choices the main character is given and then makes are not handled well by the storyline, add to that the dodgy writing and obviously low budget made-for-television production values and you got a film that had some potential but then failed to deliver at the finish line."}, {"id": 34, "text": "The ending song rings peace on Earth... Something the world needs right now... I was in tears by the end. What a beautiful movie. Very moving. As a sister of a brother who is gay, I only want the world to be excepting of all love and not be so judgemental. This movie does a beautiful job of showing how people can grow out of the old fashioned way of thinking, and realize that love is love... Be accepting with open arms. The movie also shows the sadness in hiding your true self and how that closes your door to opportunities that will make you truly happy. The fact that I came across this movie on Netflix gave me satisfaction. I know so many people would scroll right by and not give it a second thought... But you should... It's very touching. Moving. Thank you for representing the gay community in a Christmas movie. This movie touched my soul."}, {"id": 35, "text": "The budget for this movie must have been miniscule. It looks like it was filmed and edited on a tracfone. Many scenes are obviously dragged out to fill time. And the actors have no magic between them. The lead, Nia Fairweather, is incredibly beautiful, but incapable of putting forth any emotions. The costar, Adriano DeMeo does break your heart a couple of times. Mr. Big himself, Chris Noth, is a producer and plays a Catholic priest. I don't want to say anything controversial here, but despite Noth himself being a Catholic, they get a lot of things wrong about the modern day Church."}, {"id": 36, "text": "I loved the story line very beautiful and touching, but if they had a bigger budget for better direction and video quality (you can see the camera shake so much) it would be beautiful and box office blow out."}, {"id": 37, "text": "It was an absolute real film not in terms of the storyline but the environment, no cheesy million dollar home, or rusty Christmas lodge with a million acres. It was believable and I enjoyed the actual story! Not your usual plot of guy meets girl they hate each other and fall in love, contained real struggle and even included inclusivity with the church. I loved it and was moved to tears. Give it a watch."}, {"id": 38, "text": "Loved this movie so much. Definitely worth a watch."}, {"id": 39, "text": "Just what I needed this holiday season. It was quite heartwarming and unique. Makes you believe in the power of love and what might have been."}, {"id": 40, "text": "If you've ever thought you might not be living your best life, this is a charming movie about do-overs. So many ways to view it! It made me more creative about re-thinking what in the past went wrong but could be made right today. I think it should become a must-view for anyone who feels trapped in the wrong relationship."}, {"id": 41, "text": "Worst acting I've seen in a long time. Fast forwarded through most of it. Ohhhh, I missed good stuff??? I. Don't. Care. What a stinker!"}, {"id": 42, "text": "THIS is the lesbian Christmas movie to watch not the KStew movie that copies Lez Bomb at it's worst. This movie has good performances by a good cast with a storyline they can actually get to act out and not be ashamed of. This has just enough twist on the Christmas Carroll storyline it takes it's plot from to make it worthwhile. Don't waste your time on the other movie out for Christmas. This one has everything you wish the other move had."}, {"id": 43, "text": "I think I enjoyed this movie more than I probably should have because it is just so refreshing to see a ridiculous Hallmark-style Christmas movie featuring LGBT characters as the lead. I mean what a shocker it isn't made by Hallmark but it was that type of movie.The plot is just like Christmas nonsense but you expect it from this type of movie.I think if they just got a few better actors this movie could have been a little gem among the thousands of Christmas movies that are released every year.To be fair it does stand out due to its characters but I think it choice have been something really good if they just got people that could act.The filmmaking is a little slapdash and amateur but I think the heart and sentiment behind it all kind of puts a bandage over all that and by the end you find that you really enjoyed it.Definitely watch this movie and show it support. Hopefully studios will see that people appreciate movies like this and appreciate seeing diversity and don't want to just see the same story told over and over again about the exact same demographic."}, {"id": 44, "text": "I expected to scoff and laugh at this film, expecting nothing more than Hallmark cheese and drivel, the same old same old. This film did indeed pleasantly surprise me. So much so, I even recommended it to others. First off, it's lovely to see main characters that are POC and represented well. So onto the other stuff now. Yes, the camera work isn't Hollywood blockbuster, but you probably weren't expecting that anyways. The views of New York are gorgeous and each scene feels lively. The main character seemed unlikable at first, though the characters accurately develop throughout. Plot wise, it's usual Christmas romance cheese, about love and the season, but I enjoyed despite my initial thoughts on starting the film to be negative. Throughout the film you will groan, laugh, smile and I even had a tear to my eye during a certain scene. It's not your usual Christmas cheese! It's easy to watch, thought provoking and strikingly beautiful in a way I have not seen before. (Plus, it's the first positive LGBT Christmas film I have ever seen!). If you're looking for gorgeous visuals and a movie to move your heart, you're in the right place."}, {"id": 45, "text": "The idea has done before, sure you remember Mr. Destiny(1991), and The Family Man(2000). This movie was pretty amusing, not something I would want to sit through again, although the ending which I won't spoil for you, is pretty descent.The cast are pretty good on they got to act with, it avoids being a silly romantic Christmas comedies that we are so used to seeing. but the film could have been better, if it did not try to be preachy, if it stayed in one situation I think it would have been better. But all in all not terrible, but not great either."}, {"id": 46, "text": "Overall I'm an immediate sucker for any LGBTQ+ Holiday movie, and for this genre the sappier the better.The movie has flaws; I am the first to admit it. The couple are adorable together and have really good chemistry onscreen. Some of the other acting, not so much. Chris Noth is the Priest and the one actor I knew from past work, and honestly feels a little miscast. The angel character just did not do it for me at all. And overall I found the semi-religious/semi-sci fi plot device that frames the story a little week.One of the consequences of the plot device doesn't get explored nearly enough, and overall spends more time on the love story than worldbuilding for the audience.Still, I really enjoyed it. And it's easy to get caught up in the love story and get your heart toyed with. Not the best movie I've ever seen, but a"}], "reviews_amount": 47}