{"name": "Spell", "titleId": "tt10736580", "reviews": [{"id": 0, "text": "I liked this movie a lot. It was a mix of misery and skeleton key. It wasn't a big budget movie, but it was decent with good actors that carried it. And people are saying how did he catch on to magic so quick, as seen in flashbacks his father was into whoodoo maybe that's why he left home. Good movie! I'll give it a 9"}, {"id": 1, "text": "Pretty predictable. It's like, a bougie Black people version of Misery + The Skeleton Key. Some parts are gross though. I'll give it a 5 for the cast."}, {"id": 2, "text": "I did enjoy it. the part with the nail in his foot gave me goose bumps, my blood ran cold lol ."}, {"id": 3, "text": "I was looking forward to Spell hoping it was going to be suspenseful horror but unfortunately it is not very exciting or suspenseful. The movie is about Marquis T. Woods (Omari Hardwick) a successful lawyer on his way to a family funeral in a very distant part of Appalachia. When his Cessna crashes in a storm he is separated from his wife and children and in the care of Eloise (Loretta Devine) and her family who practice a form of voodoo.There are some very good shots in the beginning when Marquis and his family are flying to Appalachia as well as a few good scenes with Eloise. The flashbacks however look cheap and character development is mostly non existent for the other characters. The dialogue is not always convincing and gets repetitive at times. What happens is also predictable and the actions of the protagonist don't always make sense. The story does pick up in the last 15 minutes but is is again very predictable and it is barely explained how Marquis picked up the voodoo spells and deals so easily with someone like Eloise who as it is shown near the end of the movie has been practicing those spells for for over a century. In the end this was a watchable but underwhelming film that never really reaches its true potential."}, {"id": 4, "text": "Everything was perfect about this movie except the conclusion. I was entranced the entire way through, it was thoughtful, it retained and entertained. Only reason I said 7/10... I thought it could have capitalized on returning to school for the kids (definitely could have alluded to the bloodline with a new hand or the bullies being dealt with). Still gonna buy it."}, {"id": 5, "text": "It's not horrible, but definitely not the greatest. Too many of the scenes reminded me of Skeleton Key and Misery. However, how much could you really change up with this type of movie. It is what it is. I wouldn't pay to watch it, but free... why not? It's worth watching if you have nothing to do. Cast members get A+."}, {"id": 6, "text": "Loved it, creepy with a bit of gore. Shot beautifully and Omari Hardwick and Loretta Devine were awesome!"}, {"id": 7, "text": "I recently watched a trailer of the movie and it looked good so I decided to waste $10 on this movie, I watched it and was honestly sad, not the fact that I wasted money on a movie like this when I could have watched a actual good movie, but the fact that this movie had so much potential... The movie begins with darkness and you can hear a child crying while a man calls for most likely him, he finds him and whips him multiple times and then shows the boy as a grownup with whip marks, it shows only 5 - 6 minutes for you to get used to the characters, though they only show him lock picking a  $1500  door, arguing with his boss, and his family at the dinner table, you know nothing about the wife or daughter, and the only thing about the son is that he is abused... OK? The movie then moves forward to the boy as a grownup, who is Marq getting a phone call from  someone . They comment that his father is dead, so he sets a trip with his family to go to the mountains, they stop for gas and some hillbilly comes out of nowhere and is almost about to steal the son's phone and even harass the daughter, when the son points where they are headed, he quickly leaves, they get back on the plane and move into a storm, which makes no sense, they decide to go forward with their plane in the middle of a storm? They get struck obviously, and fall... Marq wakes up in a bed where you meet the leader of the town, Eloise, an insane woman who uses voodoo and magic as her advantage, so fasting forward, he gets stuck in the bed because of his foot being injured, he once gets out of the house, starts to parkour, and spots in the farm that Eloise, her husband and guard? I guess? And a bunch of townsfolk, sacrificing a cat and a goat. Almost gets caught, he finds the reason he can't walk is that a  7 foot long nail  is up his foot.... he TAKES IT OUT, and doesn't even pass out, despite the infection and blood loss. He escapes again and makes it outside and finds the plane... and sees a house but gets tackled by Eloise's guard, who was sent to chase him after Marq's escape... we never find out what this house is, he gets put back in the house again. Here, he escapes again, calls the cops, tries to escape, but the cops, plot twist are part of the sacrifice. He escapes gets his family, kills Eloise, her husband and guard. The movie was overall dumb, it has no horror, only suspense. The movie leaves with you with so many unanswered questions, and the acting was pretty bad, the worst thing is, the movie had so much potential to being a good movie, it was obviously rushed, if they spent a little more time on the plot and actors, and maybe even introduced the characters a little more, the movie could have been pretty good. I wish I could give it a 3.5, but I can't so a sad 4 it is..."}, {"id": 8, "text": "The film was just madness.. Nothing scary had a stupid role.. Was an absolute shame for Omari..Forget this film..Just stick to POWER 10/10.."}, {"id": 9, "text": "Find it staggering some of the reviews on here. Can't possibly be verified ! Intriguing stroryline initially &amp; then just faded into complete obscurity &amp; farce What a fall from grace for Omari Hardwick after watching Power. Avoid at all costs &amp; ignore any reviews over 3"}, {"id": 10, "text": "Overall good movie. Suspenseful, intriguing, and the right amount of thrills to keep one engaged. I enjoyed the all star cast and the story line. Great job."}, {"id": 11, "text": "Sorry Mark Tonderai Im from the Gen-X group. Who gladly saw Misery 1990 at the movies proudly 5 times. Perhaps you were paying homage. But it's 1 of my a time favorite movies. I wasn't fooled. It was my first movie after the 1st time I strictly went to see again to witness how others experience the terror of this oscar winner movie.The voodoo parts were frightening. Also I'm a huge fan of Omari Hardwick and Loretta Devine. I really like the movie they co stared with Chapter &amp;Verse 2017."}, {"id": 12, "text": "This film start with a woman Veora been locked in a room, and a man Marquis ask her to marry him scene! As turnout, this film is about Marquis need to defeat an old woman with dark magic Eloise, who using the so called Boogity to manipulate Marquis and his family! Entire film full of boring conversation, and annoying overuse scene! Such as, overuse of Marquis dreaming his father scene, overuse of Marquis dreaming his family scene, overuse of Marquis try to flashbacks the plane crash scene, overuse of the blackout scene, and overuse of the song playing at the background scene! Make the film unwatchable! Barely intense scene is, Marquis stab at a police to kill him! In the film have a really ridiculous scene! After pulling out the long nail stab into his foot, Marquis hammering the nail back inside his foot again! Stupid act! At the end, Marquis using Eloise's Boogity to defeat Eloise and save his family! That's it! Another disappointed film!"}, {"id": 13, "text": "This film entirely reminds me the great suspense of the Skeleton Key. The story outline of the film is superbly executed, there were moments in the film where I was fixed at the screen due to the suspense. It's like Skeleton Key x Misery. Well worth the watch."}, {"id": 14, "text": "This movie is interesting. It starts out with a scarred man (both mentally and physically) made aware of his father's passing. Unfortunately, he goes with his whole family and pilots his own plane into a storm and it crashes. He wakes up in a strange bed in the attic of some old woman and the rest of his family is nowhere to be found. His foot is all messed up and he can't move much and she will nurse him until he gets better. But so many questions for both him and the movie audience makes Spell a toss-up. I was conflicted after watching it and probably will not watch again."}, {"id": 15, "text": "I decided to rent this on a whim. I watched the trailer, and saw that it was going to be corny, but I had a great time watching it. It's got elements of some pretty good horror films like misery, as well as Skeleton Key as some other reviewers have pointed out, but that's not a bad thing. It's actually pretty good and honestly, even if you don't like it you will still find part of it that you enjoyed."}, {"id": 16, "text": "I honestly did like this movie, especially for the base storyline. I don't think African American culture is talked about a lot in films unless they are slave oriented when there is SO much more to that. I love seeing and hearing about ancient voo doo and the spirits and ancestor roots of magic and African and African American culture. I can see that they tried to portray this heavily in this film, but I feel as if they either missed or didn't add so much more to this story. I can't stand when films don't go into more depth about a subject or even the characters. What I would have done differently is, 1. I would have made the character more likeable, I couldn't relate to him in anyway and that made it hard for me to care about his character or what happens to him. 2. Where is the history? If they would have placed more history about his dad and his connection to magic, the main characters random knowledge of magic wouldn't have come as an unbelievably random surprise. And 3, some of the editing was pretty bad and choppy. It made me kind of dizzy, even. I love the actors and I think they are incredible at what they do, but I wish they would had given them more to work with. This film had every potential to receive 10 stars if it would have added those few changes."}, {"id": 17, "text": "This one really got my attention from the moment I started watching it. It isn't a slow burner at all, as you're already in the thick of it after about the first 20 minutes. I saw that another reviewer compared it to Misery, which is actually something that crossed my mind as I was watching it before I even looked at these reviews. Most of the time I found the movie to be pretty unpredictable. There was one thing that I found to be pretty obvious at one point and you'll probably know what I'm talking about when you get there, but it didn't kill the movie. I enjoyed every moment of it!I Usually only put a review on here if a movie was really good or really bad, and in this case it was really good."}, {"id": 18, "text": "This film brilliantly combines wickedness with a brush of humor. There are quite few turns in this movie that you do not see coming. It is also refreshing to see these actors lend their talents to roles they wouldn't typically play. It's such a rush, and well worth the watch."}, {"id": 19, "text": "Thriller movie. Focuses on voodoo and their power. After the plane crash, the protagonist meets in an attic locked alone. Anxiety about his family and not getting the answers he wants. Is he finally a guest or a prisoner? A movie that is watched with interest from the beginning to the end. It also has some twists and turns here and its short duration leaves no room for fatigue and I recommend it."}, {"id": 20, "text": "Suspenseful all the way through, it showed quite a few hoodoo secrets"}, {"id": 21, "text": "While piloting his family to his father's funeral in rural Appalachia, Marquis (Omari Hardwick, Sorry to Bother You) flies through an electrical storm and crashes, waking up alone and injured, a captive in the attic of Ms. Eloise (Loretta Devine, who was one of the original actresses in the stage presentation of Dreamgirls). She claims that for him to be whole again, she must use the Boogity, a Hoodoo figure created from human blood and skin.Trapped in an attic with no idea where his family is, Marquis must escape his past and his future at the very same time.Spell was written by Kurt Wimmer, who wrote and directed one of my favorite odd 2000's action films, Equilibrium, as well as its kind of, sort of follow-up Ultraviolet. He also wrote Salt, Sphere and the remakes of The Thomas Crown Affair, Total Recall and Point Break. He also directed a new Children of the Corn, which came out on October 23 of this year.It was directed by Mark Tonderai, who made House at the End of the Street and has worked on plenty of streaming shows like Castle Rock, Locke and Key and Gotham.This film looks nice, with well-thought-out dream sequences and colorful hues. I just wish it had something new to say. It feels like a backwoods - yet black-acted - version of the post-Deliverance films that brought the supernatural to the table like Rituals while the allusions to Misery simply can't be glossed over.That said, between this and Antebellum, you can really tell that modern black horror suffers without someone like Jordan Peele at the helm. It's an alright film, but like I stated above, I wish it had something more to say.However, Devine is great in her role and really brings it. She's the best thing in this."}, {"id": 22, "text": "I didn't expect too much after reading the reviews, but this movie turned out to be quite good.It is a solid story that is well acted and produced, and you never quite know what's going to happen.It is not mega gory, but it is the story that makes it creepy - and the brilliant ending of course."}, {"id": 23, "text": "It's a great movie. The cast is great, the story plot will keep you watch and holding your breath! LOVE IT!!!!"}, {"id": 24, "text": "Director/production - 5; Story - 4; Cinematography - 6; Acting - 6; Makeup/FX - 5; Sound - 6; Music - 5; Personal motivation - 6; My average 5,375It was a nice horror movie, but the characters are not build quite wel. So you lack care for them. That's something you need for a Horror flick."}, {"id": 25, "text": "The typical crash/breakdown/run out of gas in the backwoods scenario that's been done many times over. Except this time it was an uninspiring cliché filled film that defied logic at every turn. As for those with 5 star reviews, i realize you're paid for those however you are completely delegitimizing the review process. It'll be to the point that reviews will no longer be viewed as useful information. Good job. Way to americanize another industry"}, {"id": 26, "text": "It had the same jump factor as paranormal activity, and I was on the edge of my seat for the most part of the film! Unlike a lot of horror movies it stayed reasonably believable throughout the entire film and didn't not end with some insane half wit ending."}, {"id": 27, "text": "It's a good time waster, there's nothing original about the storyline, but the acting decent."}, {"id": 28, "text": "I recommend watching this movie, the acting was great and it was great to see Omari Hardwick playing in a horror film; a very good actor."}, {"id": 29, "text": "Started out fine. It felt like Stephen King's Misery meets a voodoo film. But then it goes comically dumb by the last quarter of the film. Felt like 90+ minutes wasted."}, {"id": 30, "text": "Trying to tell a story in 90min. with voodoo narratives, Dialogue and Action is very difficult when you have to please Hollywood with added buffoonery! Great storyline but writers also included too many unanswered scenarios."}, {"id": 31, "text": "Enjoyed this alot more than I expected too. Dont get me wrong its not ground breaking and screams Mysery knock off but I'm sure that's what the film makers were going for. It seems like they were trying to pay homage. Not close to Mysery but was a good movie. The Nail scene had me wincing for real. That was brutal."}, {"id": 32, "text": "Maybe one of the best horror movies of the year after The Lodge"}, {"id": 33, "text": "This movie could've been a 7 or 8. This movie was great up until 20mins of the film. They really did a great job. They just rushed it. Take time to enjoy this film. The camera shots are a little off at times. Really good thought process."}, {"id": 34, "text": "The motivation of the main actor really good in this movie and well acted. It was probably very well mixed with psychological elements. I don't want to be a spoiler of this movie but all I can say is that its worth watching."}, {"id": 35, "text": "The premise was a good one. Some things were over the top,such as mute for years, now she can speak. Blind but now can see. All in the same night. I just wanted the story to have a bit more bite to it. But all in all,I enjoyed this one."}, {"id": 36, "text": "I accidentally choose this but I'm thrilled I watched this film. Definitely award winning performance. Excellent storyline. Honestly, I'm usually hard to please but I was quiet and focused the entire film. This was great one."}, {"id": 37, "text": "Starts out a little slow. Once I heard Loretta Divine's voice, I knew it was going to go places. Great acting, especially on Divine's part. Excellent story telling, subtle nudges to a HUGE reveal. Loved it!"}, {"id": 38, "text": "No boring parts. Interesting all the way through. This is one of those movies that you can bite your teeth and enjoy the sweet revenge over forces of dark. It's horror factor is as much as when watching CW's supernatural. This should probably have at least 7.5 rating overall. I gave 9 to increase the overall rating."}, {"id": 39, "text": "I was caught from the beginning. the acting was perfect. Just the way the movie starts made me want to watch it. Eve's Bayou Get Out Misery vibe Good creepy movie. perfect for Halloween.... Happy Halloween."}, {"id": 40, "text": "The Right Actor With The Right MOVIE! He was good in power and great in the spell. Hope To See Him In More MOVIES"}, {"id": 41, "text": "I really enjoyed this film loved every minute of it, some good acting throughout and I would recommend anyone to see it."}, {"id": 42, "text": "Maybe a bit far fetch here and there but what movie like this isn't? Keeps the attention and you love it when the bad guys get theirs (I just wish it had been worse for 'em). Loretta Devine was so excellent and the more that lead actor takes his shirt off the better. Good movie, all in all!"}, {"id": 43, "text": "Omari was in his bag! Oscars I hear you calling. This movie was so intense I was sweat through my shirt. Even had some parts that had ya boy motional. Edge of your seat action and gripping scenes that were scary. It was shot beautifully. The boogedy dolls had me like yoooo this crazy. Special effects on a hunded. Best $10 I spent in a hot min. If you don't see this you not a real horror fan periodt."}, {"id": 44, "text": "They really did a good job with this movie. It didn't bore me at all!"}, {"id": 45, "text": "This movie is SUPERB! The storyline and plot twist are excellent. The ending had me on my feet and cheering for Omari! Great story line, cinematography and acting. The cast did a fantastic job! I definitely recommend this movie! Well done!"}, {"id": 46, "text": "I for one enjoyed this film....i though it was very realistic of voodoo with the animal sacrifices and the dolls and not the white washed skeleton key type voodoo. I would have liked for it to go more in-depth about the blood moon sacrifice and for the foreshadowing to be better when he stopped to the fuel station"}, {"id": 47, "text": "I wonder the true feelings of each actor and actress as they play their parts. This is crazy crazy"}, {"id": 48, "text": "This was a good movie. Better than I expected. I do not regret renting this movie"}, {"id": 49, "text": "The movie Spell was great! The movie had so much voodoo in it. I loved it. I don't want to ruin the movie by saying too much. I liked that the movie was an hour and a half too. So many movies are just long and pointless. It had a great storyline and made sense. Not just killing and you don't know why. It had a meaningful storyline. I love the song they played on the plane. Great for Halloween. Omari Hardwick's acting was fabulous!"}, {"id": 50, "text": "A great funny movie,tiny spooky and slashy. Good fun even for a 45year old. Norwegian. If i was between 10-17 now i would be bedazzeled. Its a Russian movie. They so often start dubbed On Netflix. Irritating Se all on originale."}, {"id": 51, "text": "It was definitely a black version of The Skeleton Key, but with a WAAAYYYYYY better ending. Definitely worth watching."}, {"id": 52, "text": "I give it a 5 only because, some of the part's were gory just how I like it. Other than that this is just an updated version of the cult classic Misery."}, {"id": 53, "text": "I read a review on here describing this movie as a skeleton key crossed with misery, as they are two of my faves i thought id give it a whirl, and im double glad i did!! yes its a tad predictable, and horror fans will have seen similar types of this movie, but for what it is - its a fun horror!! its creepy, its got its share of gore, and a supernatural threat throughout. it is what it is, a fun horror thats easy to watch. great acting, great story, just a great movie!!"}, {"id": 54, "text": "I wanted the father and the kids to die in the first 20 minutes. These privilege black kids act like they never met another black person in their life. The wife was the only person I liked in this movie."}, {"id": 55, "text": "Ms. Devin's performance is, well, Divine! Loved watching her bring this character to life."}, {"id": 56, "text": "Its a real waste of time. i dont even know how i continue watching it smh. never seen a stupid movie as this one"}, {"id": 57, "text": "It's like Misery and Skeleton Key had a baby. I love these actors but this movie didn't do it for me."}, {"id": 58, "text": "First let's start this off with the cast the cast of people was a horrible cast. This movie was horrible. Omari Hardwick was a horrible actor in this movie, Loretta divine being a slave in this movie was ridiculous, the kids acting was horrible and all they were was mostly facial reactions, voodoo is nonsense, the movie was rushed but yet still felt too long. It was a horrible movie ending. And the fact that Omari Hardwick was a non-believer of voodoo but then became a voodoo person was complete contradictory stupidity. I am really tired of black movies always having a religious undertones or overtone to their movies."}, {"id": 59, "text": "A decent movie if they didn't ruin it with their anti-racism-racism garbage, like so many other movies. Don't waste your time is my suggestion. And I won't waste any more of MY time explaining WHY that's the case."}, {"id": 60, "text": "Although it's not a new concept, it was still enjoyable, I wouldn't usually rent s film like this but Omari Hardwick is a talented actor and I think his acting brought this film up a star.I often question characters actions and this film had 1 or 2, which I thought was a little daft but overall I really enjoyed this."}, {"id": 61, "text": "After the plane crash I didn't even last 5 minutes. Just so over the top and ridiculous. It's too bad because it had a lot of potential."}, {"id": 62, "text": "You cannot watch this film without noticing from which Stephen King's Novel it drew its inspiration. However the difference is apparent that I noticed earlier on in this film; Misery is a classic adaptation of its source material whereas this is pale by comparison.It jumped on the bandwagon of Black Panther in that this film only hired Afro-American actors. Again, Black Panther is marvelous as the storyline is compelling and you cannot help but route for the protagonist.This film throws in a bit of Voodoo &amp; there are some suspenseful moments but the ending is so predictable. It is like a lot of films that have a good set up but is let down by its execution."}, {"id": 63, "text": "Corporate lawyer Marquis T. Woods (Omari Hardwick) is flying his family to Kentucky to attend his abusive father's funeral. His small plane crashes in a storm in some backwoods area of Appalachia. He awakens in the attic of Miss Eloise (Loretta Devine) with a bad foot injury. Eloise insists with some muscle help that Marquis stay in bed and get better using her country remedies. The film quickly digresses at this point to something similar to Misery as Marquis discovers his demise as well as his missing family may be arriving soon.The film was pretty good. They established characters quickly and smartly. I think opening with a young Marquis getting lessons from his father rather than the multiple snippet flashbacks may have worked better and made a better tie-in.Guide: F-word. No sex or nudity."}, {"id": 64, "text": "The part Loretta Devine is portraying is so creepy, I can't imagine her ever being like that for real, and those ugly dolls, even more creepy 😳"}, {"id": 65, "text": "I didn't go into this with high expectations, but it was actually better than I thought."}, {"id": 66, "text": "I actually like it!! The movie was pretty predictable and story line had a lot of wholes.. however, it was entertaining and worth the watch. It kept my attention and I believe that the acting from Omari Hardwick and Loretta Divine was great."}, {"id": 67, "text": "First of all I am a Omari Hardwick fan. I found the movie to be exciting to the point I was rooting for Omar all the way. I'm on the fence with the magic of voodoo. It's a scary thought that people could really do voodoo as they showed in the movie. If you like that kind of stuff you should enjoy Spell."}, {"id": 68, "text": "Does this film bring anything new to the horror genre? No. It absolutely doesn't but I still liked it.A lot of people are hating on this because it is nothing new but hey, don't you already know this going into it? I did so, I totally didn't care. I was ready to see the same ol' horror flick with some hoodoo magic and that was what I got.The actors are good and it is an almost entirely African American cast. Our two main characters are played by Omari Hardwick and Loretta Devine. These folks know how to act. If you wanna complain about something they've done fine but don't knock them in this because they carried the entire film.I personally enjoyed this little twist of a Misery-like film. If you don't think you want to see something like it, don't watch it. If you think it sounds interesting, go for it. It's not gonna knock your socks off but it has a few cringe worthy moments with great performances from our two lead characters. in all honesty, these other reviewers just sound a bit jaded rather than being willing to give credit where credit is due."}, {"id": 69, "text": "I don't know what it is about Appalachia that fascinates Hollywood but at this point the people of Appalachia need to sue Hollywood for defamation. This movie, which is Ok enough to pass the time, is one more horror film set in a fantasyland of Appalachia filled with spooky people, voodoo dolls, magic and nonsense. There is not one thing original about this movie at all, at this point Hollywood is just churning out the same old stories with different sets of actors. The African American family in this could just as well be a bunch of teens, college kids, 4 women on vacation , absolutely anyone. There is very little horror here, it's only slightly suspenseful, it isn't well written and at times it doesn't make sense. The only thing that kept me watching, the one saving grace, is Omari Hardwick in the lead who is very appealing and carries the film. Most of the other actors aren't very good, they just come across as actors making a buck. There just isn't much of a movie here, the story is slight, the location reeks of a Hollywood set (The real Appalachian mountains are gorgeous) and in the end this is just another poorly made Hollywood product to get your Halloween dough."}, {"id": 70, "text": "'Spell' is just 90 minutes of pure schlocky b-movie fun. They introduced some basic story elements at the beginning of the film, and I thought that this was going to be a basic occult horror film, probably mixed with psychological elements. But it's not.At some point, they just drop the common sense and start having fun. If you're not new to movies you will catch the ending very fast, since the main lead literally explains the plot talking to the viewer (I was wondering why he wasn't looking at the camera). So you're just expecting more random and bizarre stuff to happen, and they deliver.At times, the film felt more like a cheesy horror game but without jumpscares, the superhuman main character, zero realism, and people were driven not by motivation but by video game rules. Other times it felt like a weird combination of a horror-comedy, revenge film, Rambo sequel, and an 80ties TV-show.I can't say I'd like to recommend this film, but if you love cheesy b-movie fun, gore, and intentional overacting (and you are prepared to switch-off your brain for 90 minutes) - you can give it a try. I can promise you - you will laugh a lot.But if you try to take this seriously as a suspenseful occult horror film this clearly won't end up making your day better."}, {"id": 71, "text": "The story or motivation of the main actor is the old cookie-cutter family-is-in-danger thing. So you know how it will end even before you see it.The worst moments of this movie were about the skin color. I live in a reality where the skin color does not represent education, environment and character of a person. So every time skin color was brought up, I sighed REALLY hard. The problem with it was not the fact that it was there, but the on-the nose way it was brought up.I did not liked the third act. The way he suddenly knows everything and can move despite a incredibly heavy injury ruined the suspension of disbelief. (hardly a spoiler for those kind of moves)Camera work and cinematography were bad.What saves it, is the acting. Omari Hardwick had a great performance. He was believable in his desperation for the most part. Without him, this movie would have been much worse. His relationship with Lorraine Burroughs felt genuine and it seemed they had some chemistry. Not much unfortunately, because character development is barely there, but the few scenes they shared were good.Loretta Devine... oh boy. She is an amazing villain. She was scary and very intimidating.It is not a great movie, but one that had some interesting aspects. I definitely enjoyed the watch."}, {"id": 72, "text": "Ok Spell seemed to be a typical production, a horror movie where a family trip goes terribly wrong and they end up in a bad situation with apparently no way out.And the plot sure acts like so, as it moves quickly to that direction and then...the movie starts. Sure there are some elements you've seen in other horrors, but the execution here felt fresh, not copying others, not repetitive, but developing its own way of telling the story. I was intrigued throughout its entire course, while waiting too see what the third act brings. And I have to say, that one delivers as well, it is a good way to wrap the story up and it provides the needed satisfaction after sitting through some difficult scenes.All in all, Spell is definitely a win, I do recommend it, I think most fans of the genre will appreciate it and enjoy it.Cheers!"}, {"id": 73, "text": "Spell is a quite good voodoo-mystery-horror (haven't seen that in quite some years) that revolves around a small community of black folks in a remote part of the Appalachian Mountains. A typical city-slicker receives a message about the death of a family-member from that area. He, his wife and two teenage kids travel there by small plane to pay respects. During the last part of their trip they are warned not to go there, but do so anyway. They fly into a storm just before arrival, and...The story is drenched with ancient voodoo rituals that look quite eerie, the small community members are avid followers of this pre-religion custom that goes back thousands of years. It traveled along with African slaves to America and hasn't changed much since, among the few that still practice it. His aunt and uncle are voodoo-priests that seem to have plans for him when he wakes up in their house, separated from his family.The movie has just about everything a die-hard horror fan wants: fairly good script, great set, location and props are excellent, just as camerawork and soundtrack.Fun fact: Voodoo rituals look extremely outdated for modern society, but one of those similar ancient (Indo-European) rituals actually survived in modern America. The festivity (calling upon and appeasing the spirits for good fortune and virility) is now called 'Halloween' but lost its original meaning completely.The quarrel between the mother and son at the gasoline station was a somewhat weak and annoying attempt at humor in my opinion, but keep watching and don't let that ruin the rest of the movie."}, {"id": 74, "text": "Well, Spell from writer Kurt Wimmer and director Mark Tonderai actually turned out to be a not so bad movie. Granted, I didn't really have much of any expectations for the movie when I sat down to watch it, so the writer and director had every chance to impress me.And I will say that I found that Spell was entertaining and enjoyable - at least for a single viewing. I am saying that because I don't feel that Spell is a movie that has enough contents to its storyline to actually support more than a single viewing. And why is that? Well, because the movie just wasn't all that original or innovative.The storyline played out well enough and there were some interesting ups and downs along the way. The director managed to keep me in enough suspense to keep the movie afloat and interesting. But alas, once you've seen the movie the first time, there just is nothing to surprise you, and thus the movie is inadequately equipped for a second viewing.As for the acting in Spell, well I will say that they had some good actors and actresses on the cast list, with the likes of Loretta Devine and John Beasley. And lead actor Omari Hardwick actually carried the movie quite well. I was, though, quite impressed with Loretta Devine's performance, because she definitely was well-cast for this movie.Spell is listed as a horror / thriller. To that I would say you should expect more of a thriller than a horror movie when you sit down to watch it.My rating of Spell is a six out of ten stars. The movie is definitely well worth taking the time to sit down and watch. The ending of the movie, though, well that was rather anti-climatic, but I am not going to be spoiling it for you."}, {"id": 75, "text": "I kept waiting for the twist. By the end, I wasn't a huge fan, but, my boyfriend really liked it.I wasn't impressed with the inconsistency of pain for a serious injury. It wasn't believable that someone could sustain the type of injury he had and not be largely incapacitated. He moved around like he stubbed his foot instead. So yeah, that really bothered me. Plus, there were sensible chances for escape he didn't take.And the same voodoo powder,worked completely differently on different people. Again, inconsistency.I did not find any of the characters relatable or even with familiar personalities. I grew up around very country Black people /farmers and people with voodoo experiences. And the script is nothing like what you would hear from people with that background.The characters, for me, were cringy and off-putting, they acted well, except for the parts I mentioned, but the script was terrible in my opinion.I don't find voodoo dolls scary, however, Loretta was creepy acting. As many have said, I got immediate 'Misery' vibes.It was interesting but not something I'd watch again. I'd recommend it to someone bored, but, I'd caution them to tame their expectations.And for the people crying about diversity, cry me a river. If you're not putting that on every single review of majority white casted films (which are far more prolific) then politely shut up! You have NO room to speak!"}, {"id": 76, "text": "Spell isn't unwatchable but there's nothing in the plot, performances, or craft that really grabs you by the collar. Writer Kurt Wimmer often churns out not-bad screenplays for thrillers (Salt, Street Kings). Sadly, this isn't one of them. Spell feels like it took characters straight out of a how to write a screenplay guide and placed them in Appalachian Kentucky.Marquis T. Woods (Omari Hardwick) and his family are flying to Appalachia to attend his father's funeral when their plane crashes due to a crazy storm. He wakes up in Ms. Eloise's (Loretta Devine) attic, with the matriarch claiming that she can nurse him back to health using a hoodoo figure made from his skin and blood. It's a straightforward escape-thriller of sorts thereafter, with minimal surprises.Most boxes seen in thrillers such as these are ticked off: unnerving flashbacks (a little overdone!), a skill (lock-picking) that's displayed by the protagonist early on which comes in handy in the following acts, a few painfully wasted escape attempts, a couple of grotesque scenes involving a foot injury, and a bland twist (regarding a character) that even 4-year-olds can predict.Loretta Devine makes good on her underwritten character, but the film could have benefited if Eloise's vicious intentions had been packaged better. Omari, as Marquis, goes through the motions and even talks to himself in one particularly weird, expository scene. An out-of-place slow-motion moment in the film's fiery finale also bothered me (I asked myself WHY? like 3 times!). Spell is a forgettable affair, with little redeeming qualities."}, {"id": 77, "text": "First off I will say that this is not really what I would classify as a Horror movie (unless it was something actually happening to you). However, it is definitely a Thriller.I believe that it deserves a solid 6 stars just for holding my attention all the way through the movie. At times it reminded me of Get Out just based on style. If you are the type that tends to over-analyse everything you watch, then you probably won't enjoy this movie as much as I did. I have that problem too when it comes to things needing to make sense throughout a movie, and the stupid decisions that the characters in the movie make. Spell, although not perfect, mostly made sense. I didn't find myself constantly thinking how stupid can you be or this makes absolutely no sense; no one would do that. Instead, I found myself just watching to see what happened next.Just go in with moderate expectations, and you should find it enjoyable. I even paid about $10 to rent it on demand, and I don't regret spending the money. I did give it 7 stars just to bring the rating up slightly. Ignore the super high and super low scores. This movie doesn't deserve either. For me, it is a solid 6 star Thriller."}, {"id": 78, "text": "REVIEW - SPELLA family fly to the home where the father escaped from many years previously from his abusive father, on the way crashing their plane in a thunderstorms.The father of the family wakes up in the loft of a southern American family with an injured foot but where is his wife, daughter and son?Things become strange when the woman who took him in makes a voo doo doll of him, realising this simply isn't normal the father investigates by climbing out of a window, climbing across roofs to see the family and neighbours taking part in a voo doo healing ritual.Sounds good yes, it is in places but simply drags along in others which is a shame because up until the parts where the father was just walking around the house collecting various things for the end sequence, I thought if he was a prisoner how could they give him so much space to do as he does for the ending to happen and unfortunately at times the film did remind me of another film called Misery and if you've seen that film you may notice yourself the similarities.Rating 5 out of 10"}, {"id": 79, "text": "The beginning was good, maybe like the first 10-15 minutes'ish. It was on the right path and kept me engaged as I was hooked on the premise of the potential story. I thought I'd be seeing some creepy human/creature hybrid crawling around with hyper extended legs or something, but nope nothing like that at all.I also couldn't help but notice the lack of diversity with the cast. I think it would've been creepier had Eiloise (Loretta Devine) been replaced with an old creepy caucasian lady instead (similar to the one in Legion).The theme of this movie is very similar to Us or Get Out, but lacks in a ton of areas compared to them, consider this a poor man's version of those films.Spell is a watchable flick but that's it, it has it's moments, but it won't keep you on the edge of your seat the entire time."}, {"id": 80, "text": "Good cameras and a few quality performances, give this embarrassing mess a veneer of quality it does not deserve.The opening scene is dire, why anyone would begin their 'masterpiece' with that is troubling, then, not enough care was taken to avoid comparison with Misery. Character motivation is swept to one side, so not only do you not understand why anyone would do this, but you simply don't care.Technical mistakes and poor edits, nauseating wobble shots and excessive closeups add up and before long you start watching the clock hoping for a quick exit.Separately, If this is now movie studio's idea of equality in entertainment, it seems more like a zero sum game to me, 2020 does no one any favours if the new 'equality' is just as one side as before."}], "reviews_amount": 81}