{"name": "The Binding", "titleId": "tt10914452", "reviews": [{"id": 0, "text": "This movie is a little and pretty low budget italian horror movie, with some scary moment and very cool cinematography. Cast is good, Scamarcio is a very underrated actor. The movie is little bit boring in the first part, but dark and scary in second and final part. My rating is 6/10."}, {"id": 1, "text": "Super boring movie but with a ok cinematography, the actors were good, makeup was like the evil dead 1981 movie ... I definitely understand the tradition they are talking about but definitely they could have done it better. If I rate this movie by the times I got sacred or even surprise I will give this movie a 0, just because the acting. The best part is the picture form the credits"}, {"id": 2, "text": "The Binding: An Italian Folk Horror film which doesn't live up to it's potential due to pacing and the way the plot is revealed. Emma is visiting her Fiance's mother's house in Southern Italy when her daughter Sofia is bitten by a tarantula. It soon becomes obvious that Sofia is stricken by something far more sinister. Folk Magic and Folk Remedies are used in a part of Italy which still maintains part of it's Pre-Christian traditions. Trees are healed but so are people. The illnesses are not always physical or mental but can be of the soul. When a ritual is attempted by an amateur there may be dire results. unleashing Demons. Apart from the terror induced by the appearance of the possessed there are some startling scenes which build the ever increasing sense of unease: trees uprooted, on their sides, the roots like tentacles; a crow eating another bird. The old house, creaks there are whispers, strange events occur. Plenty of positive elements which don't quite gel into the great horror movie this could have been. Definitely worth watching though. Directed by Domenico Emanuele de Feudis, screenplay by Daniele Cosci. On Netfix. 6/10."}, {"id": 3, "text": "An Italian terror attempt. It is about a man who takes his girlfriend to his mother's house and his daughter begins to suffer strange situations from his presence. Totally parsimonious, the first hour nothing happens. The last half hour is the one that develops everything. Predictable like all of its kind. Quality. Performances at the level but nothing relevant. The effects are fine, one that another is not fully achieved. Talk about tie downs. The ending is very simple and nothing spectacular. It remains owing. Try to give suspense with hackneyed moments and situations."}, {"id": 4, "text": "Let's me start with the cons: Too dark, sound effects not surprising, acting normal, easy to predictPros: not slow paced, it is a major point. has a twist: I thought Francisco mom is the one who conjure Evil but turned out I was wrong The mom and the help add more creepy elements to the taste. If you expected bloods, dark magic, aggressive evil spirits, spooky ghosts, then you can skip this one. I didn't feel a moment when I wanted to stop because of being bored or feeling cliche about it. However I gotta say the plot is easy to predict but not logical."}, {"id": 5, "text": "And so should you if supernatural horror your thing but no actual thrilled scares or even jump scares more story driven"}, {"id": 6, "text": "The movie is nicely set in rural Italy which lends to a lovely supernatural folky aesthetic. The storyline, while not being particularly original or unique, maintains an air of intrigue and unpredictability. The acting of the older family members is fantastic and a little creepy (good thing!) I wouldn't pay to watch it but is good option for a autumnal night in cuddled on the sofa."}, {"id": 7, "text": "I honestly wasn't expecting much but it had an interesting plot with a good ending, don't listen the bad reviews, if you like horror you should give it a shot"}, {"id": 8, "text": "In my opinion it is a very good option if you want to see a different horror movie. Don't expect screamers or things like that. So you can pay attention to the story without fear. I think one of the bad points is that it doesn't have a bit of comedy so it can feel longer than it is."}, {"id": 9, "text": "As far as horror movies go, not that bad, the scary lady was creepy as hell and good cinematography. Worked well with a low budget, keeping sets and cast small. The storyline was a bit too boring for the majority of the movie, but pulled through in the end."}, {"id": 10, "text": "Snooze fest. Not remotely scary or anything unique or original. This story could have been told in half the time. Just your standard 'horror' flair today with the non ending. Typical Netflix original enough people try to say is good when it is just routine junk."}, {"id": 11, "text": "I'm in doubt if I liked it, it's not bad, but I dispersed a lot, folklore (from southern Italy) is a great theme, the background, the relationship between parents and children, the rustic and poorly maintained location, all of this attracted me , passionate, but the story, I don't know, something more was missing, which didn't know how to identify what it would be, good to regulate..."}, {"id": 12, "text": "Despite the beautiful locations and the promising start, this movies ends up being just a horror like many, many others. The plot is very basic and predictable, and not particularly scary either."}, {"id": 13, "text": "I wanted to like this Italian, supposedly horror flick especially since Halloween 🎃 is right around the corner. There was just one problem. It wasn't scary at ALL! 😟 Pretty much a predictable, slow burner 🕯with a dull twist."}, {"id": 14, "text": "Don't bother watching this 90 minutes. It is so cliche and boring."}, {"id": 15, "text": "It is not a bad movie but it is a low budget movie good to see a indian folklore good concept and beautiful acting makes the movie watchable."}, {"id": 16, "text": "The Binding is a new Italian horror that was realesed in this days and i must say that it wasnt a total disaster,film had some good acting performances and some use of visual aspects and creepy imagery was done in a solid way,but that is where a good staff stops to me,and predictable and lame ones begin.Story was seen in a thousends of similiar films and i havent seen nothing new to impress me,scares were also very uneffective and they didnt have a impact on me,ending was little cliched and it felt like all the same.Honestly i wish that Italia gets another horror maestro like Argento was ,so we can again enjoy good horrors again from their side"}, {"id": 17, "text": "It was important that it ended fairly, but the movie still had its flaws. First of all, he invites the woman to the house and waits for your trust. Then when she rescues her daughter, they stay with that witch woman again and stay in the house where it happened, wrong! The other woman should take her daughter and leave the house, then the witch woman should try to save her son, but she must have succeeded! What I don't like about horror movies; They don't always finish the same topic in order to continue, so they don't destroy bad people so as not to finish! If bad things do not disappear, there is missing justice!"}, {"id": 18, "text": "In a nutshell, the movie is enjoyable, scary and dark. Great acting and nice special effects.Don't listen to any negative reviews and ratings. If you like horror movie give this one a shot."}, {"id": 19, "text": "Italian language movie dubbed to English in the version I watched..-1 Star for a sex scene with no nudity, this is 2020+1 Star for the actual .... Binding ritual? Kind've like its own exorcism.I thought the rest of the movie was pretty bland. Not a lot of UMPH.5/10"}, {"id": 20, "text": "It starts with a promising narrative, a thriller that gets your attention. Then, the main caracter gives away a story that has many flaws, there are no points connecting one another.As the final moments of the movie approach, you don't know anymore what might be the explanation for everything that is happening. The dots just don't connect and you're left out like you missed something, and not in a good way of a well constructed narrative.If you like jump scares (and only that), that might be a good movie for you. If you value the story, don't waste your time."}, {"id": 21, "text": "This film is dark but only from lack of light, IKEA people please take note!It's a good premise but it doesn't run with it, it ambles, nothing new here it's pretty much a channel 5/ hallmark 5pm on a Sunday, I wanted to like it the scenery is luscious and the sense of decaying grandeur is palpable, but it doesn't go anywhere."}, {"id": 22, "text": "You may see many amazing Italian buildings and gardens. Wonderful but I can not tell the same things for a movie."}, {"id": 23, "text": "At first glance it looks great especially as it's starring the versatile comedic actor Riccardo Scamarcio of 'The Ruthless'. However in this movie he forgot how to act. Or he was just as bored with the nonsensical script like the rest of us. Words failed me by 20minutes in when it dawned upon me that the entire cast also didn't know what's going on. Confusion is an understatement and let me not forget the lack of jump scares. Basically I don't know what movie the other reviewers were watching, but it surely can't be the same one.This is my first review, but I signed up especially so you can save your 90minutes that you will never get back and skip this disaster."}, {"id": 24, "text": "This is very dark and yet brilliant, we don't know who is the bad side until it's near the ending. The only thing that minus is the music of the movie."}, {"id": 25, "text": "Great atmosphere and scenery, but the script has so many holes that intensity and horror escape through them. Don't bother, find intrigue and suspense from another movie or the next football game."}, {"id": 26, "text": "Incredibile this italian horror! Congratulations to Domenico de feudis..."}, {"id": 27, "text": "Scary nicely unpredictable good acting. If you like horrors you will love this"}, {"id": 28, "text": "Closest thing to an early 60's Corman/Poe adaptation, but without Corman, without Poe, without Price, and without any of that cycle's unabashed theatricality. The Binding is covered in mothballs. Pulled from the horror closet in an utterly stale, stuffy, lifeless state, and in 2020 -- completely out of fashion. Not only does this film not contain a single moment of suspense or eerie atmospherics, it does not contain a single moment of interest."}, {"id": 29, "text": "This film was hyped up to be a great horror flick. However, the most I got out of it was a film that was nonsensically written. The story makes no sense. The acting is horrible. Half way through the film you start to tire and wish it would get to the point - then finally it gets to the point and you're left with an evil and ghostly antagonizer that can be simply vanquished like any other normal weak individual. In short, don't waste your time."}, {"id": 30, "text": "Same old tropes and zero originally. Sucks pretty hard. The people don't react like they should... ridiculous dumb."}, {"id": 31, "text": "Even though the quality of budget and acting were good, it was oh so played out and predictable."}, {"id": 32, "text": "I'm a bit of a sucker for low budget horror movies ... if they are done and played well. I might have given this a point or two more than some may feel this deserves. Yes we have cliches and yes this is quite predictable. Still it is a horror movie that works (all the bad character choices included) ... very well made and acted.Suspend your disbelief and enjoy the ride. Effects are decent and story is ok too. It will not reinvent the wheel, it will also probably not make your top 10 list, but that does not make this a bad movie. Of course it may not be your taste ... there is no accounting for that."}, {"id": 33, "text": "So if you're looking for a super freaky movie this may not be the one. However, I did find many aspects of the movie unnerving. I watched it in Italian with English subtitles and found it made it creepier. Due to the fact that I'm a bit believer of evil eye I found this movie to be pretty good! The acting is done well, and having the little girl act the way she did definitely added to the scares! I would definitely recommend if you're looking for a B level scary movie!"}, {"id": 34, "text": "Although sometimes it is quite terrifying, it has a slow pace and there are times when it gets boring."}, {"id": 35, "text": "I must admit that I was definitely expecting a lot more from Il Legame (aka The Binding) when I sat down to watch it. Especially because the movie's synopsis sold the movie rather well.First of all, the movie is slow paced, very slow paced. And I must admit that I actually drifted off two or three times along the monotonous paced movie. The storyline was just way too generic to make it an interesting movie. There was nothing here that haven't been seen or done better in previous older movies. Which is kind of astonishing, taking into consideration that the movie had no less than 3 writers working on it.Visually, Il Legame was good, but its atmosphere and special effects could only do so much to lift up the lack of a proper storyline and plot.The acting in the movie was actually good from just about everyone included on the cast list. And this being an Italian movie, then there wasn't a single familiar face on the cast list for me.For a horror movie then Il Legame just didn't cut it. It was way too bland and monotonous, which made for a less than mediocre movie for sure. My rating of Il Legame lands on a mere three out of ten stars."}, {"id": 36, "text": "I love for Netflix because we get to watch other things than American stuff. This is my first time watching a horror film from Italy and I was not disappointed.It really builds up the atmosphere and relationships of the character, but also takes you down the plot in surprising ways.It speaks of past errors, revenge, the bond between parents and their child (even if adopted), but most importantly it showed the true strength of women in the face of evil in a way I did not expect. I don't want to give any spoilers but it was quite refreshing (you'll know near the end of the movie what I mean).I get true concern for the little girl (great acting for such a young one!), and felt the mother's fears. Great performances.It did not let me down.I'm no film critic, I watch to enjoy and I throughly enjoyed it."}], "reviews_amount": 37}