{"name": "Paranormal Attraction", "titleId": "tt10223876", "reviews": [{"id": 0, "text": "After reading the reviews here that praise this movie i decided to give this a go,my mistake. where to start,the acting is awful,the script is utter garbage,fx ..lol.what cheeses me off is the false reviews that were written by (most likely) people that were either involved in this movie or at least connected to it in some way.it does no favors when you lie about how good something is,specially when it is utter rot,if it was prompted or written up as a D grade movie that was done on a budget of $2000 to maybe $5000,people might no get so cheesed off when they watch it.if you like d grade low budget bad acted movies with no real content than this is for you..other wise dont bother."}, {"id": 1, "text": "Anytime I review a film and it is just bad I try to at least give it 2 stars for effort. Some have even failed at that. This one deserves at least that, though barely. All I can say that really hasn't been said in the reviews (unless I missed it) is just watch the trailer on YouTube. That should've been as far as I went with it, but alas, here I am warning you not to follow these footsteps."}, {"id": 2, "text": "I really am having some hard time believing that those actors get paid for doing this sort of job. The only person who knew how to act, was that blonde girl. And director seems like a person how couldn't even effort a slow Mo camera. After watching the title I wasn't expecting to watch the conjuring, but sometimes I like to watch bad movie just to kill time and that's it. But this movie is so annoying."}, {"id": 3, "text": "How can you get funding to be so bad at making a fairly simple movie. It doesnt even hit the b list horror criteria. So bad."}, {"id": 4, "text": "They call it indie, I call it class B low budget, without imagination or art, amateur actors."}, {"id": 5, "text": "There is some production value --even an opening helicopter shot.The acting is horrendous.And let me give you one non-spoiler example at how poor the writing is: Basically after the titles the main woman is in bed with her laptop. The bathroom door slowly opens. She gets freaked and goes to look but takes like 2 minutes to slowly y close her laptop before getting out of bed. Who would do that? Ed Wood.The movie is also real slow. And doesnt make a ton of sense.So with all the production value, it seems they skimped on actors who could act, writers who could write and directors who could direct."}, {"id": 6, "text": "Our hero, Sara Myers, played by Brooklyn Haley, is hired to clean out and clean up an abandoned house. The house will then be put up on the market for sale by a realtor associate of Sara's. Sara is hoping that this job will afford her the opportunity to establish her own moving company.While being shown through the house by the realtor, Sara asks the realtor what happened to the previous tenants. She is told by the realtor that the tenants just up and disappeared, and that the tenant before them died in the house. The realtor also tells Sarah that there has been a problem with vagrants frequenting the abandoned property to use the swimming pool.On Sara's first night alone in the house, she's sitting in bed, working on her laptop computer. While she is doing this, the door to the master bath slowly opens by itself. Sara gets up to investigate, finds nothing, and goes back to bed, promptly falling asleep.The next day, Sara's ditzy best friend and her boyfriend come over to help Sara out.After some odd activity at the house, Sara meets a uniformed police officer, Officer Elaine Bennett. Let the Sapphic sparks begin to fly and smolder, there is an unspoken attraction between Sara and Officer Elaine. Sara, you see, is fresh off of an abusive relationship with a man, and she is open to a little TLC. Officer Elaine is the likely profferer of said TLC.Sara has another frightening experience, and Officer Elaine shows up again. More sparks fly, and Sara and Officer Elaine begin to flirt more aggressively and openly. Officer Elaine takes Sara to lunch, and while they're away, the ditzy, and suddenly psychic bestie, Kelly and her boyfriend, Nick, show up at the house. While there, Kelly has a vision which frightens her.Sara and Officer Elaine return, to find naked Kelly and naked Nick in the pool. Kelly needed a swim to clear her head after receiving the frightening vision, you see. After introducing Kelly and Nick to Officer Elaine, Sara and Officer Elaine agree to a dinner date.That night, Sara has an erotic dream where she is in bed with an unidentified man. The man starts hurting Sara during sex, and she tells him to stop. Then Sara wakes up.The next morning, Nick contacts Officer Elaine and tells her about Jeff, Sara's abusive ex. While this conversation is going on, Jeff happens to show up and aptly displays the fact that he's a belligerent a**hole. Officer Elaine and Jeff verbally whip out their junk to see whose is bigger, and Officer Elaine warns Jeff to watch himself, unless he wants the full weight of the law brought to bear upon him.In the meantime, the realtor, Melanie, stops by to check on Sarah. Sara shows her a picture of a woman that isn't in any of the photos left behind by the people who had abandoned the house. Melanie says that she doesn't know who the woman could be, and she advises Sara to take a bath and have some wine.Sara takes a bath, and is attacked by someone and nearly drowns in the tub. She recovers and Elaine calls. Elaine comes over and picks up Sara for their date. As they drive away, the entity in the house watches them leave.Sara seems distracted on the drive to dinner, and Elaine offers a raincheck, but Sara takes Elaine's hand and tells Elaine that she likes her. Sara says that she dated other women in college, but there was never anything serious. After chatting a bit, they go to dinner, and Elaine brings Sara home. Sara initiates a kiss just before Elaine leaves, and invites her to a barbeque that weekend.Sara goes to bed, and the entity begins to call out to her, telling her that it will always love her. Sara wakes up and begins to look around the bedroom. Kelly shows up unexpectedly, and claims that she has research about the house.Kelly gives Sara an article about a woman who was killed by a stalker in the house, and it is the mystery woman that Sara has asked Melanie about. We then get a flashback/reenactment about the murder of the mystery woman by a male friend who has becomed obsessed with her. He demands that she tell him that she loves him, and when she does, he accuses her of lying, and kills her. Kelly convinces Sara that Melanie had lied to her about not knowing who the mystery woman was, or what really happened to her.Kelly proposes that she and Nick help Sara Purge the house of evil energy by burning sage in the house. While this cleansing is going on, Jeff the A**hole shows up, sneaking around the outside of the house.We then cut to the barbeque, and Officer Elaine shows up. Barbeque fun and hijinks ensue between Sara, Officer Elaine, Kelly, and Nick. After dinner, Kelly proposes a game of Truth or Dare. Sara dares Nick to give Officer Elaine a lap dance. More fun and hijinks ensue. Officer Elaine then asks Kelly if she's psychic, and Kelly says that she is. Nick then dares Sara to kiss Officer Elaine.While this is going on, Nick sees the male entity in the house, and becomes possessed. He tells Sara and Elaine that their attraction repulses them, then he bashes Kelly's head against the table and tosses her into the pool. He then attacks Officer Elaine, but Sara manages to talk him down so that Officer Elaine can subdue him.Nick is knocked out, and Kelly is rescued and revived. She then tells Sara and Officer Elaine that the house is home to an incubus, a male demon who sexually preys upon it's victims. Kelly proposes the idea of coming back to the house the next day, with Nick, to exorcise the incubus from the house. Officer Elaine takes Sara back to her house, where they finally become sexually intimate.The next day, Officer Elaine takes Sara home, and then has to go to work. The house is trashed, as if the incubus had a hissy fit that Sara was gone for the night, but Kelly and Nick are there to help her clean up.Kelly strips down to her undies, and explains that this is essential to the exorcism to draw the incubus out of hiding. She then clips some of Sara's hair, and tells Sara that she needs to strip down, too. While they are preparing to begin, Jeff the A**hole sneaks into the house and begins to sniff Sara's soiled panties.Kelly tells Sara that she needs to be asleep for the ritual, and she puts Sara under. While Kelly begins the incantation, Sara begins to dream about the incubus. She tells it that she isn't afraid of it. While this is going on, the incubus possesses Jeff the A**hole, and kills Nick. The possessed a**hole knocks out Kelly. Somehow, without anyone having called her, Officer Elaine shows up in the nick of time and shoots Jeff the A**hole.After the shooting, Sara confesses that she loves Officer Elaine, and they go in to check on Kelly.Now, Nick had been killed, Jeff the A**hole has been shot, and no authorities asude from Officer Elaine are on the scene. Oh no! The demon has possessed Officer Elaine, who shoots and kills Sara.We then cut to Realtor Melanie showing the house to the new owners, and Officer Elaine shows up. She tells the happy new home owners that she will be by to personally check on them.on a regular basis. Officer Elaine and Melanie chat about Sara, who had mysteriously disappeared. Officer Elaine leaves, and her eyes burn red to show that she is still possessed by the incubus, and there, the movie ends.Sara is dead. Kelly is dead. Nick is dead. Jeff the A**hole is dead, and Officer Elaine is possessed, and has set her sights on the new home owners, particularly the wife. Roll credits.Everything about this movie is stupidly gratuitous, everything. From Sara's bisexuality, to Jeff the A**hole being black, to the scene where Nick is under the sheets going down on Kelly while she's on the phone with Sara, to the couple at the end being interracial. None of it feels or seems genuine. It was like the film makers went out of their way to check as many boxes as necessary to be politically correct, and that's it.This isn't the worst horror movie that I've ever seen, but it isn't anywhere near good, either."}, {"id": 7, "text": "I'm not going to waste precious time writing about this movie. I'll say this though, I'll pay good money to see thugs break Alex Hwang's legs."}, {"id": 8, "text": "Sarah's acting is the absolute worst. Monotoned and lack of emotion. Evelyn, another horrible actress but is not as bad as Sarah's. I am going to say it again, HER ACTING IS SOOOO HORRIBLE."}, {"id": 9, "text": "The best thing about this movie is the heated pool in the backyard of the house being filmed. The leading actress is so mono tone and one note I couldn't figure out if she was scared or bored. I also found it distracting that the best friend couldn't say a line and look at someone's face at the same time. I was always wondering what she was looking at. Clearly it was more entertaining. I didn't expect much from a title called 'Paranormal Attraction' but even with a bad title I do expect actors to at least seem interested."}, {"id": 10, "text": "I watched the first 20min of it. First thing I noticed was the bad acting. Second thing I noticed was that I can see why her moving business is not doing great. She is a bad packer and cleaner. She cleaned the mantle without moving all the objects off it. Which should have been placed in boxes."}, {"id": 11, "text": "Great use of minimal locations help to impact the urgency and reality in this heart stopping indie horror flick. Powerful jump scares kept me on the edge of my seat throughout. All that's missing is a dark room and the popcorn."}, {"id": 12, "text": "A rock solid and entertaining film from director Alex T. Hwang. It is both haunting and sexual in nature as well as one of the few horror films I have ever seen with an open lesbian relationship in it. It blends well the paranormal horror of It's ghost story and the real life horror of anti female physical abuse in a bad relationship. Very Me to movement and current. Tautly directed by Hwang and with a striking visual cinematic flair the film is also buoyed by the acting of the cast. Of note is newcomer Brooklyn Haley, a natural beauty and a rare find. Over all a quality horror film well worth viewing."}, {"id": 13, "text": "This was a fun watch. Single-location horror/romance film with a good premise that keeps you intrigued the whole time. The cinematography is beautiful, the music is effective, and a lot of the acting is great. Some of the highlights were the flashback scene and the first possession. This film presents a cute love story as well as a horror plot, but sometimes struggles to blend the two, typically resulting in the characters acting like they're in a romcom when there is a demon lurking about. Some of the performances were a bit wooden, but overall the direction was great and it was fun experience."}, {"id": 14, "text": "Director Alexander T. Hwang understands the horror genre well, and in this creepy indy delivers some great jump scares and disturbing moments as lead actress Sara Meyers finds that when she moves into a temporary new home, she may not be alone. The story moves along at a great pace and when things start to go bump in the night the tension ratchets up and never lets you off the hook. Evoking strong similarities to the classic Nightmare on Elm St franchise this is highly entertaining."}, {"id": 15, "text": "Good film. Kept me guessing and usually I can predict the normal twists in movies. Acting is good. Suspenseful and worth a watch if you like this genre."}, {"id": 16, "text": "Before I even started watching this movie, I was drawn in by the poster and knew it was going to be awesome. There are great jump scares combined with a great sound track that ties it all together. This is a great movie."}, {"id": 17, "text": "Great location. Nice work from actors and some effective scare moments. Check it out!"}, {"id": 18, "text": "The characters are very likable. Good acting all around. Nice surprises and plot twists. The music is very effective and well done. Some of the bloodier moments are very believable. Well done!"}, {"id": 19, "text": "Trailor and poster were great, so we picked this movie for our date night. Great job on the casting especially the blonde girl who played Kelly. She was so quirky and she stole every scene she was in. The movie keeps you guessing about the backstory and what's going to happen next. The flashbacks were fun and their was a scene where the main character seems to be there in the flashback. That was cool. Fun movie"}, {"id": 20, "text": "I saw the trailer for Paranormal Attraction on JoBlo Horror Trailers and was intrigued, so I decided to check it out. I'm already gearing up for Halloween horror movie watching season! I'm a fan of indie horror films and this movie is a new take on the classic creepy abandoned house subgenre. A young woman named Sara moves into the house and learns of its tragic past while a rookie cop helps her investigate. I definitely enjoyed the movie and I think if you're a fan of indie horror then you will too."}, {"id": 21, "text": "A true sign of a good movie is if you become invested in the well being of the characters involved. After watching this film, I can say I thoroughly enjoyed it as I was invested in each of the characters and I felt bad when any deaths occurred. The scares work. The premise work. And the relationships feel genuine. Overall this chilling horror keeps you going until the end."}, {"id": 22, "text": "This is a true indie film. Made with a low budget but edgy and retro. Watch it for pure entertainment value. This is not your typical movie and that's what I love about it."}, {"id": 23, "text": "There were some really good jump scares, and a twist that I didn't expect at the end. All-in-all a fun time!"}, {"id": 24, "text": "This was so fun to watch. Great job by Alex Hwang and his team. This is a fun ride from beginning to end. It was a really good story coupled with solid acting. The film held my interest from beginning to end. I view watching films was I entertained and I was. So for me, this film gets an easy thumbs up!!"}, {"id": 25, "text": "This was a fun, extremely watchable horror film. Retro and cool in some ways, very modern and inclusive in others (like a lesbian love story.) A really likeable cast as well. Less super-scary and more suspenseful, chilling. I think whether you enjoy this film or not all comes down to mainstream vs. indie expectations. If you're expecting a big-budget, effects laden monstrosity, or a movie swimming in blood, this isn't for you. If however you're into indie horror, low-budget films... and you like movies that are raw, fun, atmospheric and edgy, you'll really enjoy this film. I had a ball with it!"}, {"id": 26, "text": "Starts out to be a typical horror film premise with haunted house and scary music leading up to scary moments but then there are some plot twists. I didnt predict the ending for sure. A good indie film watch."}, {"id": 27, "text": "There is some solid acting from several actors. And I enough of the jump scares to keep interested. I did not like the 80s montages."}, {"id": 28, "text": "This cinematic turn from director Alex T. Hwang is reminiscent of Paranormal Activity, but with it's own unique twist. Newcomer Brooklyn Haley turns in a decent performance as the innocent ingenue who develops a lesbian relationship with a hot lady cop. It's super low budget fare, my kind of movie. Those looking for studio polish need not apply."}, {"id": 29, "text": "A unique vision within the horror genre. Jump scares mixing with sexuality in a uniquely dark approach. Check out this indie flick!"}, {"id": 30, "text": "I'm loving seeing more of the lgbt community represented in horror! The lighting in this movie was moody and nuanced. Bravo on that. The house itself became a role and I loved a riveting pool sequence towards the end of the movie. Buckle up for some twists and turns!"}, {"id": 31, "text": "Sara Meyers (Brooklyn Haley ) is hired to clean up a nice suburban abandoned house with a heated pool. The previous owners have vanished. We know from the opening scene there was a murder in this house. Sara is helped by her ditzy friend Kelly (Eden Shea Beck) and Kelly's boyfriend Nick (Hunter Johnson). Officer Evelyn Bennett (Nicole Cinaglia ) stops by for increased eye candy.Typical house possession film. Go to library and find out what happened which is about an hour into the film, jamming any paranormal thrills into the last half hour. Characters were not bad, they just didn't do anything with them.Guide: F-word. sex. brief butt nudity (Brooklyn Haley)"}, {"id": 32, "text": "-Some flat acting from a few actors/actresses -Scares and tensions are simple yet effective (to me at least) -Mostly single location -Some student film level blocking -A few padding for runtime moments -Blonde girl character was fun to watch with her optimism"}, {"id": 33, "text": "And observing that reviewer corrosie already has stolen my words out of my hands, i just conclude with appraisal that all the reviewer has written are correct and truthfully describedive seen this ensemble making other movies, and their acting hasnt improved anyway, rather worse than ever.directing and production has to be blamed for that, and the use of cheap sound and visual effect aint good enough.what haunts most are the vast number of inconsistecies and abrupt situations that trails away like a snail in death valley, that appears like a normal rather than exception, and with a weak story and plot this make the ridicule feelings weigh like tons of broken steel.i will not recommend this fuzzy homemade junk for what it is, junk, and thats the truth from the grumpy old man"}, {"id": 34, "text": "Alright, well Paranormal Attraction wasn't exactly top of the line entertainment. In fact, the movie had a very overshadowing low budget feel to it. But at the same time, the movie actually fared well enough at certain aspects.The storyline told in Paranormal Attraction was pretty straight forward and easy to follow. Perhaps it was a bit on the generic and mundane side of the spectrum at times. And the movie was definitely suffering from being too predictable.The acting in the movie was actually fair enough, taking into consideration the limitations imposed on the actresses and actors by writers Richard J. Aguirre and Alexander T. Hwang. Personally, I wasn't familiar with a single actor or actress in the movie, so I enjoyed that part of the movie; watching new talents unfold on the screen.Paranormal Attraction was not particularly scary, and I was initially lured in by the movie's cover/poster and the fact that it was labeled as a horror movie. So heads up, the horror elements in Paranormal Attraction are few and far apart. So don't get your hopes up for a grand experience in horror and spooks.Now, I didn't really buy into the whole paranormal aspect of the movie, because it just felt halfhearted and it wasn't really brought to life on the screen in a fulfilling manner to make it believable.While the 2020 movie Paranormal Attraction was watchable, it was hardly a memorable or outstanding movie experience. I managed to sit through the entire movie, but I know that I will never sit down to watch it again.My rating of Paranormal Attraction by director Alexander T. Hwang settles on a three out of ten stars."}, {"id": 35, "text": "Paranormal Attraction is a slow moving low budget horror flick. Sara Meyers (Brooklyn Haley) is apparently trying to start a moving company, and her friend Melanie has hired her to stay at a house and pack it up so she can sell it. Melanie doesn't really explain why the previous owners left so quickly, leaving pretty much their entire belongings, but we have suspicions since the prologue hints of a violent murder taking place there.Sara starts to clean, taping what she's doing so she can use it as an advertisement for her company. She is joined occasionally by her bestie Kelly and Kelly's boyfriend Nick. As a backstory, it turns out that part of the reason Sara has taken this job is that she is running away from a very abusive and scary ex-boyfriend. But as she starts to clean the house, strange things start happening. Sara worries that someone has broken in, so she calls the police, and as is sort of typical, one of the police takes a liking to Sara and they start one of those only in the movies relationships. However, in a sort of nice change of pace, the officer is a woman. But as time goes on, whatever is causing the strange things to happen won't leave Sara alone and finally shows itself ...Paranormal Attraction has some things going for it. The lead actors and actresses are appealing and do a nice job, the fact that the relationship we see is woman/woman makes it far more interesting than these things usually are, and the two actresses involved (Haley and Nicole Cinaglia) actually have a nice, easy-going chemistry that makes us sort of root for them.But it also has things against it. It's way too slow to reveal what's going on, and there is way too much non-horror stuff going on. And there's an old joke that asks why would anyone stay in a house that appears haunted. Well, you'll ask about that in spades when you see what happens to Sara. Not just noises, but shapes, door open and close, rooms get ransacked, clothes literally throw themselves at her... crazy amount of stuff that definitely makes you wonder why she sticks around.So a mixed bag. I've gotta admit I found it a pleasant way to spend 90 minutes, but if you're looking for big scares or extreme horror or found footage you won't find it here."}, {"id": 36, "text": "Director Alex T. Hwang brings us Paranormal Attraction. Sara Myer (Brooklyn Haley), Is offered a deal to clean out a abandoned house by a realtor (Jennifer Nangle) who is friends with her. She is coming off a bad relationship and breakup and feels this will be great to keep her mind off of things.With out wasting anytime we learn this house has evil spirits occupying it. There is more to the story that the previous owners just left it. As Sarah starts cleaning it out she starts uncovering details of the past residents. Strange knocks and happenings begin occurring and nightmares of an unknown man begin haunting her. She enlists the aid of her 2 friends, Kelly (Eden Shae Beck), and her stoner boyfriend Nick (Hunter Johnson). Also a long for the ride is a sexy police officer. Officer Evelyn Bennett (Nicole Cinaglia) is called in to help investigate and Sarah and her begin to click and fall in love.One of the highlights is a game of Truth or Dare that starts off fun but then gets really crazy and nothing that unfolds is what you expect. Terrifying events draws the 4 main characters to the limit.I have said in the past I love movies with minimal characters. I always think it's a challenge to pull that off. But what this has going for it is a great story and great actors. Brooklyn Haley hits another home run with her performance. Her emotions and actions are truly explored to there fullest here. The relationship ship with officer Evelyn is comfortably displayed and unfolds very nicely. You believe they are really attracted and are in love. There is even the bully guy (Darell M. Davie)you want bad things to happen too.My favorites are her 2 friends Nick and Kelly. They have great chemistry with each other and with Sarah. While watching you really feel they are real friends. The time spent was well spent. From there goofy cleanup montage and BBQ everything feels real and not forced.You can have the greatest performances but without a good story it's lost. This is a horror movie and you want to be scared. The jumps and beautiful camerawork creates a scary scenario that should be watched with the lights out. So many times is horror movies dark scenes are so dark you can't see anything. This is lighted perfect and all the action unfolds clearly. Dialogue is crisp and a musical score you on the edge of the seat.Sarah is going through a horrifying experience and perfectly displays it. Brooklyn is now and adult and plays the part well here. Her nightmare scenes as well as a chilling bathtub scene are played with sheer professionalism and you can see this young lady loves acting. This movie just keeps building and building to a satisfying yet unexpected ending.Look for genre favorites Thomas Haley and Charles Chudabala in cameos. Charles always delights in whatever movie he appears. He is one gifted actor who offers boyish charm to his roles that make you like him automatically."}, {"id": 37, "text": "A Ritzy Abandoned House comes up for Sale &amp; Needs to be Cleaned out first before it can be Sold . One of the Finest Actresses Working Today , The Long Haired &amp; Lovely Jennifer Nangle is Real Estate Agent 'Melanie' , who hires her Friend's Daughter 'Sara Myers' , who's coming off of a Bad Relationship involving the Worst Form of Physical &amp; Emotional Abuse . &amp; Beautiful &amp; Shapely Brooklyn Haley fills the bill Fabulously ! There's Problems from the Start &amp; the Feeling that something Evil is Afoot ! Sara's Bestie is the unmitigatedly irresistible Eden Shea Beck as 'Kelly' , who's always accompanied by her loyal boyfriend 'Nick' , played by Veteran Indie Actor Hunter Johnson ! Now Kelly's an Amateur Clairvoyant &amp; Nick's a Low-Key &amp; Trustworthy Guy who's main Hobby appears to be Diving , &amp; Who can Blame Him ? Comely &amp; Beguiling Nicole Cinaglia plays The Dutiful &amp; Compassionate 'Officer Evelyn Bennett , who may also turn out to be a Love Interest ! Robert Downs is the Abusive 'James' , Gorgeous Jackie Falcon is 'Officer Sanchez' , Thomas Haley is 'Officer Monroe' , &amp; Charle Chudabala &amp; Siani Lee as the New Home Owners 'Paul' &amp; 'Lorissa' ! We have none other than that Prodigious Director Alexander T. Hwang to Thank for this Sexy , Exciting , &amp; Frightful Demonically Inspired Horror Film : &amp; a Special Thank You to the Bikini-Clad Ladies &amp; the Awe-Inspiring Jennifer Nangle ! Now Prepare Yourself for a Trip into the ParaNormal-Under-World , with lots of Surprises &amp; Twists &amp; an UnderWear-Exorcism , which I Believe may be a first ! .... Safe Travels !"}], "reviews_amount": 38}