{"name": "Ginny Weds Sunny", "titleId": "tt10543680", "reviews": [{"id": 0, "text": "Clearly there are vested interests in pulling down this movie. It's not a pretty woman but I would say a decent 1 time watch. Dialogues are good, Delhi is captured pretty well. The lead share pretty good chemistry. The support cast could have been better specially the male actors but 30 mins in the movie is a breeze and leaves you with a nice smile and few crackles every few mins."}, {"id": 1, "text": "One extra for supporting cast, yes a regular cliche love story But Vikrant messy is good It's ok to time paas with family Good movie"}, {"id": 2, "text": "Movie with good actor and actress is destroyed by childish writing and nonsense direction. director Punit needs to work an assistant to learn direction, writer duo needs to know difference between writing for film and TV daily soap. both writers are suitable to write Balaji serials, both don't know ABC of film writing. movie is complete traitorous and forces you to flip on any other movie."}, {"id": 3, "text": "What you get is the same old story, a super confident and modern girl with very complicated love life who also wants to do love marriage and a desperate guy willing to marry of his childhood crush with the help of girl's mother. The movie was just desperately trying to make us laugh but the writing wa very weak and it was hard to keep watching.End was rushed and just didn't seem right at all.Watch only of you have nothing in else to watch!!"}, {"id": 4, "text": "Vikrant Massey is a brand when it comes to non commercial movies. It's ok to move to mass movies but this movie was total crap. Same bollywood love story."}, {"id": 5, "text": "Such a waste of time. Would have never watched it in first place if these were normal days. Common story with no new twist, bad execution and direction even acting is not good. Messy should have choosen film wisely"}, {"id": 6, "text": "Bollywood is so stubborn and intransigent when it comes to investing in a good story... I don't understand why in the land of Rabindranath Tagore, rk narayan, Vikram Seth still there's no recognition and monetary compensation to writers and lyricist... Producers seriously need to change this attitude..."}, {"id": 7, "text": "Worst movie ever!! Total time waste. Not even worth one star."}, {"id": 8, "text": "Although story of film was quite predictable, it was well presented with good cast, characters &amp; dialogues. Colourful. Nice songs with catchy tunes. Netflix should grab more movies like this to keep subscribers who love bollywood movies."}, {"id": 9, "text": "Everything about the movie is Cliche. Jokes, situations, relationships, entire plot, even the dialogues are so predictable. Wasted talent of entire cast, and the untalented Yami's best performance."}, {"id": 10, "text": "Great acting by Vikrant you are now the superb emerging star... Yami also played the character well of proper Delhi Girl haha Ending was worst and very very boring.. first half I enjoyed fully, second half was just being dragged."}, {"id": 11, "text": "Nothing good about this movie except vikrant at only some points and the person who plays his father role has a very funny character. But still i would suggest don't waste your time on this one"}, {"id": 12, "text": "I had to make an account just to give one star, just because there is no way to give a negative star. The movie is neither entertaining, nor funny. A good for nothing movie. Don't waste your time,I had to open a bottle of wine to get over wasting my time"}, {"id": 13, "text": "Not worth watching, pure wastage , Yami N Vikrant both did below average job , story was not at all interesting ... over all to be avoided"}, {"id": 14, "text": "Movie is good, you can't move from your device before complete it, good direction, acting is almost good"}, {"id": 15, "text": "Please for the love of God. Bhagwan k liye don't do commerical films Vikram. Choose roles very carefully."}, {"id": 16, "text": "Worst kind of ROMCOM possible. I dnt usually give such harsh reviews, but dis 1 killed neurones of my brain. There is nothing good about this movie. Mediocre storyline executed very poorly. Talented starcast but chosen for wrong script. Irritating situations unnecessarily plotted and dragged to a very boring and predictable end. This 1 is easily passable."}, {"id": 17, "text": "One time watch.. all lead actor had done a good acting."}, {"id": 18, "text": "Story is predictable. Performances from entire cast make the film a one time watch.YAMI GAUTAM looks pleasant and refreshing in her part.Vikrant Massey effortlessly plays his part and is good here too.Overall a one time watch. Enjoy!"}, {"id": 19, "text": "I watched this movie just to see how bad a movie can be and honestly it's not bad it's worse. Don't watch this without an eye mask and earbuds."}, {"id": 20, "text": "Feel good movie nice work from lead pair. Screenplay and firt half is nice"}, {"id": 21, "text": "Just wanted yesterday Romantic and comedy based movie. You can watch this film for fun, nice stor. Every cast is talented. Vikrant is another version of Ayushmann Khurrana. Who can own you by his acting."}, {"id": 22, "text": "This is a story about a spine less guy who does not have any self respect, friend circle or social life . He desperately pursue a girl, who is still with his bf and consider him ex as well. Some how that girl fall in love with this spine less guy. This is a weird love story with horrible writing. How this movie is getting 10 not sure."}, {"id": 23, "text": "If you don't expect too much...you might end up not disappointed with this one. A bit stretched...but overall a decent watch.Not sooo bad as the rating and critics suggest. Very good performances from leads and the supporting cast."}, {"id": 24, "text": "Loved every bit of it.. its a modern day story between Ego and a confused Heart. This felt real..some part of it relatable."}, {"id": 25, "text": "Probably one of the most boring movies I've seen this year. It tries to be funny but it's so not. The humour falls flat. The accents are so bad and crappy. Instead of making you laugh you end up cringing, hard.Forced humour is not the worst about this. The dialogues ! Oh man. So bad. And especially Massey's dad who played a Punjabi character, has one of the cringiest dialogue delivery ever ! And why the 'quirky' stupid background music ? Highlighting every situation ?Argh. Some points given for Yami's performance."}, {"id": 26, "text": "One time watch, nice movie with good plot Yami and vikrant were really good. Vikrant massey is the upcoming star of bollywood"}, {"id": 27, "text": "Good movie.. Plot is kind of old but nice to watch"}, {"id": 28, "text": "Not a movie worth a watch for leading pair at least."}, {"id": 29, "text": "Dont waste ur time here..its too boring...pathetic movie...couldn't watch after 40 mins"}, {"id": 30, "text": "It's a happy, family entertainment . All the actors have done an excellent role. Yani and Vikram have done a good job. Enjoyed the fun filled movie"}, {"id": 31, "text": "The story/plot is not new and storyline is predictable, but good direction, acting makes it a really great watch. A light hearted feel good movie. Once you start, you can't stop.Yami is great and the supporting cast, particular Rajiv Gupta (father of Vikrant/Sunny) is too good. His quips are very funny.The shooting locations are great, particularly Noor Mahal. The language/jargon used is so typical and apt of a Delhi Punjabi family - so relatable.The songs are peppy and hummable.Overall great watch"}, {"id": 32, "text": "The movie is a lighthearted comedy and drama. It shows Ginni as a headstrong woman that is confused between her ex and sunny a shy desperate romantic. It's a love story , with great comedy and the atmosphere is awesome. The cinematography and locations are stunning. I have it a 10 because I think Bollywood is on the decline and doesn't produce many good stories anymore it's repetitive and the songs are whack and most movies have a predictable ending. This may have had some similar elements to Hitch And a Salman Khan Bollywood film Partner mixed into a Punjabi vibe. They did a decent job and honestly I enjoyed watching it would recommend."}, {"id": 33, "text": "It was a time pass kind of feel good movie. Watched it after I got home from work. Its a typical predictable rom com but thats what I love about it."}, {"id": 34, "text": "What a waste of time....so boring and unrealistic I will never get back my wasted two precious hours of my life...."}, {"id": 35, "text": "I think its high time we should bash or criticize all below avg movies, stop being diplomatic n gv 6,7 etc......coz of this directors take audience for granted n instead of aiming for high they serve same old formulas with new actors.Else will never reach hollywood level or get better."}, {"id": 36, "text": "This is a same story repeatedly shown by multiple people I was hoping if something new comes up till the end. Yami gautam with her poor acting skill is just intolerable to watch. Same old Delhi story with showing off and trying to convince a girl. Please people grow up and do something real. Delhi has many many story to uncover show real issues of real people. Only onething as spoilers : don't watch if u love acting skills and excellent story lines. This is not for you."}, {"id": 37, "text": "Atleast it is better then any Khan movies, songs are good, Acting was awesome. Total Entertainment"}, {"id": 38, "text": "Some of the reviews are extremely harsh. This is a nice light hearted movie. Dialogues are really good. If you like Rom Coms, you should watch it. First half is really good!!"}, {"id": 39, "text": "I couldn't finish complete movie even after watching it by skipping songs and scenes in between.. predictable, forced and irritating"}, {"id": 40, "text": "Makers try to Confused the characters in the film but Why confuse us 02 hours 05 min? film is completely fictional, nothing like this happens in the real world. Please Don't try to give any message from such films."}, {"id": 41, "text": "Why did the director choose this old punjab wedding theme movie?There are many movies already on the same theme.Why did the cast was so not in sync I mean Vikrant massey as a punjabi guy with a weird hairstyle really sorry mate you are not there yet and yami gautam please stop overactingWhy did I even waste my 5 minutes on this movie.I couldn't carry on after 5 minutes."}, {"id": 42, "text": "Although the plot is old and you might have seen it many times. But the performance by every character, songs and their timings, comic timing and neat dialogues without abuses makes it a good one time watch. Its a light hearted movie that gives you an overall good feeling."}, {"id": 43, "text": "Story is predictable but just love the performance of Vikrant and Yami. Both are really really underrated. They deserve those good scripts which are snatched by star kids. Vikrant is a powerhouse performance and No words for yami..She is far better than every star kids.."}, {"id": 44, "text": "These kind of breezy romantic movies need some triggers of angst or catharsis or some plot twist to generate sufficient interest. The writing is pedestrian, my favourites Vikrant Massey, Yami Gautam are not upto the mark. Why did they make this movie - I have no idea ? Just watch Chemical Hearts on Amazon prime instead - it's a love story with aching beauty."}, {"id": 45, "text": "Ginny weds Sunny...... Lovely.... Vikrant &amp; Yami looks and acts fantastic..... Must watch."}, {"id": 46, "text": "The story is the same as most films of this nature but thay should not take away from the fact that it's still a very good film and a lovely casual watch.I would recommend it."}, {"id": 47, "text": "I don't know why everyone is bashing on this movie. It's a typical bollywood movie but done right."}, {"id": 48, "text": "This is one of the new types of Indian comedies that uses a lot of silly sound effects in the background that make the movie even sillier than the childish script can do. I guess this type of offering on Netflix is really targeted towards increasing the reaching of its global presence. It's not a movie that I could even finish....it was just too stupid!"}, {"id": 49, "text": "Aisa laga ki, aise movie kahin baar baar dekhi hai but is baar B grade performance k saath.. Don't waste your time, we have lot to see on OTT"}, {"id": 50, "text": "I'm a Punjabi and I hate when people speak loud and distorted Hindi to fake a Punjabi accent. No we're all loud and our enunciation is really not that bad. This being said, the pathetic Punjabi accent which this actor with hair style of TikTok content creators was not the only sad part about this Netflix release. There is absolutely no story, no thought given into writing the characters and really bad music (both background and the force-fit songs)."}, {"id": 51, "text": "Same old boring crap nothing new here. Movie is way too long could easily be 1 hour 30 minutes long instead of 2 hours.Yami while beautiful still can't act. Vikrant just didn't fit in.All in all just avoid it."}, {"id": 52, "text": "Complete nonsense movie plz save ur time don't ever dare to watch this crab"}, {"id": 53, "text": "Worst movie of the lockdown period, cast is good but story is worst i have seen in my life."}, {"id": 54, "text": "Good movie to watch especially for the yami gautam performance the movie is a wedding movie so far but the cast is excellent and remarkable."}, {"id": 55, "text": "Starting with the positives... I think everyone did a fabulous job in the cast especially Vikrant and Yami as the protagonists were really good. The comedy was light and gives you some small laughs here and there. One or two songs were also decent, not charbusters though!Now coming to the averages (since there are no negatives as such)... The storyline, the whole plot seems cliche...nothing new there. And there was something I didn't feel connected to.But still I would say, as compared to some recent garbages that bollywood produced, this movie is still a 'one-time watch'...just something to keep in mind... Instead of freeing some time to watch it..watch it in your free time."}, {"id": 56, "text": "The story presents a different angle on romance. Few reviews written in bad taste are probably looking for a cookie cutter cinema level drama. You need to understand to appreciate such kind of movies. Although the end is predictable, it's a refreshing twist on romance. Both the actors Yami and Vikrant are great. The supporting cast lacked acting skills except for Ginny's mom - Ayesha and Ginny's ex-boyfriend."}, {"id": 57, "text": "Awesome Movie But First Part Is good and comedy but 2 part very bored Overall ratings given by based on movie. First Part 6 Second Part -3"}, {"id": 58, "text": "First half was amazing. Second half could have been funnier and crisper.Ppl who are complaining about it being cliched, are the exactly kind of ppl cuz of whom ROM COM Genre is dead. Which sports movie, super hero movie is not cliched ?Which plagiarized biopic is not cliched ?It's about characters, moments, dialogues, originality &amp; yes.. most importantly ENTERTAINMENT!These stupid people who killed ROM COM Genre, should stick to Hollywood tv series &amp; superhero movies."}, {"id": 59, "text": "It's a good movie and not a waste of time. You won't get bored"}, {"id": 60, "text": "I expected much before watching the movie, but this piece of art failed miserably to my expectations. looks like some 80s movie with even bad script. Vikrant didn't shine out in comic role and sounds a complete nuisance."}, {"id": 61, "text": "Must watch...Vikrant is Star now...FAMILY ENTERTAINER..!! I like this movie..."}, {"id": 62, "text": "Its show that living relationship is not an Indian culture and that is true"}, {"id": 63, "text": "Writing - loved it!!! Story - relatable!! Acting - Amazing and effortless (main leads as well as supporting cast) Even though it may seem predictable at certain points, it sure does leave a smile on how it turned out to be the same but in a different way!!"}, {"id": 64, "text": "Only For vikrant Bablu Pandit Miss You For Mirzapur 2"}, {"id": 65, "text": "Nothing new to offer. Same old template movie of falling in love, misunderstanding and then dragging it till climax to reunite. The first half was decent but it is in the second half that the movie falls flat. You won't even feel like watching the second half or at least last 45 minutes as you already know what's going to happen. It's then only a long wait till the climax which too is unnecessary dragged. Expected more from the movie."}, {"id": 66, "text": "The writing is so bad, it's cringeworthy! It's like a Rebecca Black music video. You watch it because you can't take your eyes off a train wreck.Here's an example of bad dialogs: Her: thank you Him: thank you for thanking meLol, did they write the dialogues the night before the deadline?"}, {"id": 67, "text": "Na aana ise Netflix pe lado...Bahut hi Bakwass aur vahiyat..Not worth time, data and energy. The film is based on Sunny, Satindar Sethi from Tilak Nagar, Delhi and Ginny and their story with no head, no body and no tail. Even though Yami Gautam has done a good job, Vikrant Massey looks over in this movie and personally not likable. Ayesha Raza Mishra is decent. Music sucks and rhetorical songs and BGM is bad.Rather watch a good cat for few hours than to watch this."}, {"id": 68, "text": "Seems bollywood now lack stories and good writer...keep using same old punjabi drama...need something new.. auidance are bored now...this movie is nothing different same story and full of over acting from all characters"}, {"id": 69, "text": "Can watch with family as it captures the essence in a comic way. The only problem was it's typical bollywood ending. Writers should have used some other way to give happy ending, but they relied on old traditional way to do that."}, {"id": 70, "text": "Best Movie to watch with family those who yet watch will miss the fun"}, {"id": 71, "text": "A good well directed fun movie with very fine acting from both leading male and female actors as well as supporting actors. Yami brings out very charming role in this movie, she should do more of this kind of movies. Vikrant exerts commendable performance.Story is very simple and keeps flowing well throughout the movie. Movie has humor filled love story with light drama that can be enjoyed throughout the movie without any dull moment.Don't miss this movie, ignore the naysayers, just watch the movie, it will charm you."}, {"id": 72, "text": "Casting seems good, script is poor and boring after some time..simple movie and coud be better but it is not...main male actor is good in acting and character but Gawtami is poor and poorer acting"}, {"id": 73, "text": "Expectation was high but not really good. They way the drama started was kind of unfinished."}, {"id": 74, "text": "Hilarious. I laughed more often than I have for a while at other so-called 'comedies'. All the cast, leads and supporting roles gave some brilliant moments. It struck me as a clever hybrid of Bollywood musical and Brit-rom-com (á la Richard Curtis) Yes, many, many clichés. But there are three types of cliché: One, where the filmmaker just uses clichés without being aware. Two, where the filmmaker is poking fun at others who have used clichés - which comes across as cynical. Three, where the filmmaker leaps whole-heartedly into a field of clichés and plays with them, laughs with us, and makes fun WITH them not OF them. This movie is definitely of the third kind. Ignore the grumpy, critical, negative reviewers; maybe (as another positive reviewer suspects) there are vested interests among them who want the movie not to succeed. Give it a chance. I did, and I'm glad!"}, {"id": 75, "text": "Story is very predictable and old and borring.so other can't make it up to that.. Some sincerely and good acting performance. Vikrant and Yammy looks cute in couple.nothing more than that"}, {"id": 76, "text": "A wonderful weekend watch with a talented cast and plot. The plot may seem familiar but the treatment was refreshing, especially that it didn't reduce the female protagonist to a sex symbol and the man to a macho mannequin. A sensitive male protagonist, a female protagonist who knows her mind including being confused in love. This is a movie which you can watch with your family and kids - good and clean humor."}, {"id": 77, "text": "Great acting by my man, couldn't believe it was him."}, {"id": 78, "text": "Good movie from bollywood but the end could be better than it is because looks soo simple it should be some kind of interesting."}, {"id": 79, "text": "So over the top that it makes you cringe. Storyline of 1990s repeated in 2020 with HD video, peppy songs and flashy dresses, to an extent that from the very beginning till end, movie has superficial dialogues and unrelatable characters. While so much great content from across the world is coming on OTT platforms, this one leaves yet again a bad taste like all Indian Netflix movies released this year. Extremely boring and forgetful...don't waste a minute on this."}, {"id": 80, "text": "First half was no doubt very interesting as per the story line goes. But it felt like the movie should've just ended after the motto of vikrant fulfilled, but then second half felt like the movie just wanted to extend the time by putting some useless plots. Everything felt like overdone. Director couldn't find the best reason how to finish a movie like this. It was bizarre."}, {"id": 81, "text": "This genre has been used and abused, think of new content. Enough of arranged marriage stupid guy drama!"}, {"id": 82, "text": "Good acting but Don't waste your time, it seems director and writer are not having any sense."}, {"id": 83, "text": "Regular Indian story of two love birds who were trying to get a long in the beginning but eventually end up getting married.the duration of the movie is too long, and the acting is nothing special.3 out 10"}, {"id": 84, "text": "My first ever review on IMDb. I saw polarized reviews for this movie before I watched it. Either 1/10 or 10/10... took my chance based on the trailer &amp; I am glad I did. It's really good time pass movie (rom-com, as its expected to be). To all the nay-sayers giving 1 star: Are you guys hardcore critics who can never give any movie more than 2 stars? What else did you expect from the movie? Unique script, decent acting, good flow &amp; entertainment. Go for it people!"}, {"id": 85, "text": "Totally predictable , nothing new Acting was fine And end was not the way as beginning They could have putted more comedy scenes"}, {"id": 86, "text": "Light hearted. Good watch. Writing could have been better. Actors were all great!"}, {"id": 87, "text": "It was such a disappointed to see such talented actors like Vikrant Massey and Yami Gautam to be working in such weak and meaningless script.Entire movie was such a disappointed beyond words, two people acting without script or roles making any sense.These actors have downplayed themselves by working in such a horrible movie"}, {"id": 88, "text": "I watched the whole movie expecting that maybe it will get better.. but alas..! It got worst.Specially the ending..we knew what was coming obviously but why was the end so random? It was like the worst written piece.. There were some bits and pieces of the movie that were slightly good...but the whole movie in total was a let down, even when the acting was good and as told to actors to do so."}, {"id": 89, "text": "It is predictable rom com but an easy watch.. don't expect too much.. just enjoy 2 hours with popcorn.. simple, light movie !"}, {"id": 90, "text": "A good commercial Bollywood film that is worth a watch for the whole family. Vikrant Massey as sunny is outstanding and Yami Gautam is awesome and beautiful as Ginny."}, {"id": 91, "text": "Shimla Mirchi + Jab we met ~= Ginny weds Sunny. 'Nough said!"}, {"id": 92, "text": "Nothing new in story, same old stereotypes boy and girl family...same show-off of middle class life from Delhi and same usually showing girls attitude.In last 20 years more than 100 movies are made on same story with same SCRIPT."}, {"id": 93, "text": "Yami and Vikrant looks good and it's watchful movie .Great acting from Vikrant and Yami always looks beautiful and her acting skills more then our so called A grade list actress.."}, {"id": 94, "text": "I loved the acting of Vikrant Massey as well as Yami Gautam's but Vikarant did a marvelous work of bringing Life to this movie."}, {"id": 95, "text": "Light hearted Romantic comedy movie , good star cast and good performance by everyone . I just thought of watching some part of it and leave , but once started, had to finish it . Story line is very predictable , so don't look out for anything new , but I guess it's always the starcast, their performances and the way it is presented , that makes it stand out . I liked it overall , this is at least a one time watch for sure . So Just limit ur expectations and njoy it !"}, {"id": 96, "text": "Awsm timepass. Good acting. Comedy. Vikrant Massay and Yami Gautam both did well. Nice supporting Cast too."}, {"id": 97, "text": "Good timepass Fun movie.. One can enjoy with weekend with this fun loving movie.. Love all the characters.."}, {"id": 98, "text": "Awesome movie and awesome songs. The movie is a complete package."}, {"id": 99, "text": "Really vibrant, lively film with very funny scenes. Loved it."}, {"id": 100, "text": "Same usual story... 3 star for expenses they did for shooting"}, {"id": 101, "text": "Totally worth it to watch this movie i promise your 2 hour won't go waste...well the movie doesn't have new to show still it is very interesting... we should support brilliant actors like Vikrant and gave them a chance as they do not belong from nepotism product ..they have reached this destination only on their hardwork.. Vikrant keep it up"}, {"id": 102, "text": "Nice to see Mr Vikrant Massey in a different role with a fresh look. Ms Yami Gautam also doesn't disappoint."}, {"id": 103, "text": "One of the best rom-com movie i have ever seen, Must watch."}, {"id": 104, "text": "Upcoming star of Bollywood... #selfmade actor....."}, {"id": 105, "text": "All expectations comes to end after half time. Nothing movie start with awesome humor and later on comes to end"}, {"id": 106, "text": "If you mass audience Whatever you watch in a movie just for entertainment, you will definitely like this movie. But if you are among those viewers who have a difference with all these things in the direction of the story, then this film may disappoint you somewhere. Vikrant Massey &amp; Yami Gautam Chemistry is good but only main lead actor pair is good so movie not worth to watch. My Rating: 5/10 only for Vikrant &amp; Yami."}, {"id": 107, "text": "First of all vikrant is doing some amazing work in this movie I totally love him as a lead role n the movie is really nice n enjoyable"}, {"id": 108, "text": "Enjoyed the movie thoroughly. Yami's acting was very well. Songs are nice. Vikram's acting was nice."}, {"id": 109, "text": "The acting was OK. For acting I will like to give 6 stars and for Songs I will like to give 4 stars."}, {"id": 110, "text": "It is all okay !øojkojlkmlkmklnmlknlkmnlnknlknlknkl"}, {"id": 111, "text": "Excellent cast ruined by ghisi piti love story. Story is nothing new, very predictable. Vikrant Massey is amazinggggg in his role I hope he didn't take up this project he has so much more potential!"}, {"id": 112, "text": "Not as expected from main star, Average acting not so ploitical. Comedy not as expected as compaired to trailers shown"}, {"id": 113, "text": "Very poor story. No logic. Some comedy scenes are good."}, {"id": 114, "text": "It's 2020 and they can't think beyond cliche concepts.. disgusting cheesy dialogues..pathetic movie."}, {"id": 115, "text": "Yes. The story is bad. So bad that the actors would not be able to save it with brilliant performance. So I guess they chose to be mediocre.2 for the song Rubaru, the only good thing about this movie."}, {"id": 116, "text": "Different actors but the same storyline. Very disappointed by bollywood. They can not come out of these repeated storylines. Waste of time"}, {"id": 117, "text": "Didn't expect that Vikrant massey would go for this pathetic love story. Yami still needs to go acting school. Direction was worst because the story became very predictable from start so there's no thrill and excitement to watch this. Cinematography was good and music was appreciative. Thank you."}, {"id": 118, "text": "Well of course you know who Ginny will choose when the movie is named 'Ginny weds Sunny'. I wasn't expecting any suspense on that but still watched for Vikrant and Yami. Neither of them could give anything to remember. Their characters are as cliche as could be. There is no nuance, no subtlety. The excessive involvement of parents in their children's love story is cringy. The very starting point of the movie- the need for Sunny to get married to open his own restaurant doesn't make any sense. The characters try to redeem themselves by trying to understand and respect the heroine's choices and decisions, but that doesn't come without throwing another girl under the bus. The scriptwriters just mixed all cliches and sprinkled them with tacky songs."}, {"id": 119, "text": "Good movie with full of romance and comedy. You can watch this movie with family.Don't expect too much from the movie but your two hours wont be wasted ."}, {"id": 120, "text": "U can predict the plot of the whole story within the 1st few scenes of the movie.. way too much drama.. and the same old and outdated cliche story line. Vikrants acting is the only thing saving the movie"}, {"id": 121, "text": "Probably one of the worst movie that I have seen in recent times. Did not expect this from a movie which had such decent star cast. The acting and dialogues are just pathetic, completely avoidable."}, {"id": 122, "text": "Fun family movie in a long time. Vikrant massey and yami gautam both have done justice to their characters. Rajeev Gupta has performed well in the comic role as he always does. His slow dialogue delivery makes him unique. Songs could have been better but if we ignore that part, the movie overall is a good entertainer. Good direction, story and cast. A perfect blend. Must watch"}, {"id": 123, "text": "One the few comedy movies that you can watch with family. No cheap jokes but still will make you laugh. Good acting by everyone . Loved the cast as well as supporting cast. Ending could have been better though. Rating high because watched the whole movie in one sitting which is rare for me."}, {"id": 124, "text": "When all kinds of love stories have gone stale and every formula has been tried to death, this is a very in-your-face love story! Worth a watch 💯!"}, {"id": 125, "text": "Director could have used screen space to develop some chemistry. Characters always look in hurry.I mean, how could you do such novice mistakes in 2020?"}, {"id": 126, "text": "A healthy, wholesome movie that you can watch with your entire family. Superb direction has brought out the best in the actors. Best of all, I loved the one-liners of the father: typical in a punjabi household..."}, {"id": 127, "text": "Good Movie to watch. Yami Gautam acting is good. People who have lived in DelhiNCR can easily relate to this movie"}, {"id": 128, "text": "This movie is ok and nice but movie need more masala"}, {"id": 129, "text": "Thoroughly enjoyed this movie. It is relatable in the sense that the parents were supportive of their kids. It is abit cheesy but that's what adds to the romance... The leads acted really well."}, {"id": 130, "text": "Enjoyable movie...one liners are too good... laughable...Yami acting..langg..look.. amazing.. And main lead Vikrant...kya cool acting ki h..."}, {"id": 131, "text": "Vikrant as impressive as a growing tree, which in near future can cover everyone's minds and it will be unfair if we don't encourage the hidden gem. The movie is totally worth watching as you can watch with your family too😜"}, {"id": 132, "text": "This is the Best ever movie I have seen after bareily ki barfi and shaadi main zaroor aaana...must watch ❤❤"}, {"id": 133, "text": "Super cast.... And story is not like too much interesting but actors done their job very well.... Entertaining movie... Comedy too... Overall good movie...."}, {"id": 134, "text": "Very good rom com superb acting by both actors MUST WATCH"}, {"id": 135, "text": "I can not understand why Vikrant Massey did this. May be it is pressure to pay the bills.Cast is good. Plot is normal romantic premise. But horrible execution and character development."}, {"id": 136, "text": "Looking at the trailer, the only thing that was exciting about this one was the leading pair- Yami and Vikrant. Sadly, it failed to deliver where you get just a glimpse of their chemistry. The story and direction are a little dull and frustrating at times and the climax is so disappointing.The supporting cast offers some relief and the middle part has some pace and funny moments. Vikrant and Yami did not get a chance to show their full potential as the story is outdated.They even have prominent product placements for Haldiram and Manyavar and it looked bad. The music is boring and the background score is cheesy. The twists are stupid and the writing is lame.Suggest you do not even think about attending this wedding at all!"}, {"id": 137, "text": "Ginny Weds Sunny review :After Lootcase earlier this year, Ginny Weds Sunny is a rare satisfying OTT release. It is a light hearted rom com with enough punchlines and a gorgeous looking Yami to keep you engaged throughout its two hours plus of run time.Ginny (Yami) wishes for love marriage only and hence, turns down all marriage proposals until Sunny (Vikrant Massey) secretly teams up with Ginny's mom (Ayesha Raza Mishra) to win her hand in marriage.Avoiding sub-plots, debutant director Puneet Khanna keeps the narrative simplistic with minimum characters relying more on humorous dialogues and chemistry between the lead pair. While he does succeed in building humour in his execution, the chemistry between Yami and Vikrant is not up to the mark here.Vikrant Massey, an otherwise first rate actor and indie cinema favourite these days, appears tad uncomfortable as Sunny and one misses the energy of young Ranveer Singh in Band Baaja Baaraat (2014) which was in similar mould. Ahem!!On the other hand, Yami Gautam not only looks yummy but makes Ginny her own by pitching in a fabulous performance. The supporting cast is also reliably effective.To sum up, Ginny Weds Sunny has its share of fun and can make for a decent weekend watch. Give it a try!!Regards, Sumeet Nadkarni."}, {"id": 138, "text": "Ginny Weds Sunny - Romantic Movie Cast - Yami Gautam, Vikrant MasseyAn entertaining movie that tries to show as many twists as possible. I loved the funny scenes. The starting story is like something that is kind of a dream to everyone. It shows the problems of parents with their adult modern aged son and daughter. The acting of everyone in this movie was relevant. I loved how they implemented a newly furnished story with so many entertaining factors.On the contrary, the finishing part of this movie was not up to the mark. Typical Bollywood ending that occurred in many other movies. Without this part, this movie offers the story of a boy who is struggling to get married. His family is also concern about it. And the girl is having a toxic confusing relationship where her boyfriend is not serious about her. Her mother tries to save her from that boy. So the heroine's mother and the boy with his family make a plan to impress the heroine which leads to an interesting storyline. There occur some complications in the latter part of the story. I suggest watching this movie for a time pass.Personal rating - 6.5/10"}, {"id": 139, "text": "Is this a hilarious or love triangle/square???They showed miss Ginny is confused about her wedding but puneet made the viewers confusedLittle humour was there which he could had continued but he brought unnecessary emotions which spoiled the entertainmentThe climax was so pathetic which threw the movie far behindVikrant expressions and acting were good but he can do far better Yami was looking very ordinary and over actedThis movie has released with scam 1992 series which again became a major drawbackIt was difficult to understand what the confusion was"}, {"id": 140, "text": "A routine love story with a half-baked and predictable plot. The rom-com begins on a fine note, the first half is quite watchable because of Vikrant's comic timing and few comedy punches. In the second half, the film drops due to its tedious screenplay and it lacks the humour too.Vikrant Massey and Yami Gautam shares a good chemistry. Vikrant played his character with ease and Yami delivered a decent performance too. Ayesha Raza gave a charming performance and Rajiv Gupta's dialogue delivery is enjoyable. Other supporting cast has nothing much to offer and were average in their roles.Puneet Khanna's direction is just fine and simple. The makers are failed to deliver a compelling family entertainer.Direction 2.5/5 Acting 3/5 Dialogues 2.5/5 Story 2/5 Screenplay 2.5/5Watch it if want a break from a crime thriller genre."}, {"id": 141, "text": "Vikram Massey's first foray into a mainstream romcom lead role is, unfortunately, a damp squib.Despite the instant likeability he brings to each character, the role of Sunny Malhotra, a 'seeda ladka' trope regularly employed by Bollywood is downright appalling to watch.Yami Guatam is mundane as usual as Ginny Gill, a headstrong girl confused between her long-time boyfriend who refuses to commit, and the increasingly irritating Sunny, who wants to marry her after their first date itself.The only silver lining I could find in this overblown romcom dumpster fire is the hilarious Ayesha Raza who is brilliant as Ginny's matchmaker mother Shobha.Not recommended. Painful stuff. VIkrant should stick to his strong suite-movies with substance."}], "reviews_amount": 142}