{"name": "Hard Kill", "titleId": "tt11656172", "reviews": [{"id": 0, "text": "It is one of the lousiest movies in the world. Don't waste time even to read the title. This movie is absolutely a waste of time. the acting is horrible..the movie plot is terrible...in fact there is no plot.. the movie is like a class X student practicing to make a documentary..........If there was a minus rating I would definitely give it minus 10"}, {"id": 1, "text": "Wow.Trees aren't this wooden. Another completely derivative shoot em up that takes place entirely inside the requisite abandoned factory in the middle of nowhere. Every character makes the worst possible choices at every opportunity. Every moment of this movie has appeared before in an endless list of other bad movies. And then there's Bruce, looking embarrassed just to be in this steaming pile... To top it off the movie just stops. There's really no ending. The story goes from life or death to let's forget that all of our buddies died for nothing, but let's get a beer. whad'ya say? Brewskis?You have been warned."}, {"id": 2, "text": "Time's up, send em' in. That's right, send in the paperweight villains who walk like stodgy storm troopers just waiting for the slaughter. Said villains enter an abandon building with lots of ammo and sensors in 2020's Hard Kill (my latest review).Now is Hard Kill full of bullet-ridden shootouts that seem repetitive and kind of presumptuous? You betcha. And is Kill a film in which the hero (Jesse Metcalfe as Derek Miller) offs every goon as if he were 1980's Chuck Norris? Oh without a doubt.Anyway, Hard Kill lacks plot buildup and provides the audience with another veritable, sleepwalking performance from co-star Bruce paycheck Willis. The lines are minimal, the movement on screen is lackadaisical, the bald head is binding, and the cue cards are for the most part, ever-present. The other actors ham it up while the Bruiser just sits there totally comatose.Reminiscent of a neutered Assault on Precinct 13, shot by a helmer who likens Willis as his muse, and driven by an antagonist who won't stop spewing numerous soliloquies (Sergio Rizzuto as The Pardoner), Hard Kill is about a group of soldiers who have to protect a computer program meant to end the world. Kill starts out taut until it drags its game actors down in flask continuum. The flick runs 98 minutes but probably could've concluded in just over an hour.Bottom line: Hard Kill has almost everything you want in a direct-to-video action thriller (I don't know if that's a good thing). There's the techno spy music, the Scorpion TV show-style dialogue, and a director who just feels so enamored to be working with Bruce I use to be awesome in Die Hard Willis. Too bad Hard Kill is such a hard movie to embrace considering that its terrorism interludes pale in comparison to what our world is going through right now. Rating: 2 stars."}, {"id": 3, "text": "To put it simply , the movie wasn't even worth the $1.80 rental at Redbox. As soon as I began fast-forwarding a lot to the scenes of first half of the entire movie, I realized, my $1.80 should have been just Donated to a poor homeless out in the streets."}, {"id": 4, "text": "This movie is pathetic. I have never felt the need to review a movie on IMDB, until now. That is how bad this movie is. NOBODY should watch this film. Poor story, poor acting, poor editing, poor dialog. Bruce Willis is horrible in it. He is just cashing a check and laughing at you the audience for watching this dribble."}, {"id": 5, "text": "Four writers and they still couldn't keep me awake. The struggle was real. It was 98 minutes and slow pacing of back and forth dumb endless gunfire hell, with major plot and technical issues. A Cub Scout could plan a better attack on the factory. The very little story that there was, was so cliched and insignificant, that you'll forget what the endless gun battle was for. Even the dialogue was infantile. Apparently this was filmed in 10 days... what did they do for 8 of those days? Then there's the terrible acting, mainly due to the director failing to direct their cast - as well as the entire film. Lala Kent was the only convincing actor - and she was easier on the eyes than her acting abilities, if that tells you about the rest of the cast. And why is Willis still in these garbage films anyway? It's not for the money, because there's no way he'll be increasing his 250M net worth with these type of films. Bruce, please, stop. The only redeeming qualities was the cinematography and a half-decent score for a b-grade film. It's a very generous 3/10 from me."}, {"id": 6, "text": "This is a below average action movie. It is watchable but nothing special. I've definitely watched better low budget movies and I've also seen far worse.Bruce Willis doesn't do much which I was disappointed with as growing up as a kid, I loved his movies.Overall, it is watchable but just don't expect a blockbuster action movie."}, {"id": 7, "text": "A bad movie. Never should have been released. How did they get Bruce to do this?Seriously. Extremely bad acting, (possibly the worst I have seen in a very long time), and a story line that simply wasn't. Direction basically non existent.A bunch of drunks trying to convince a burned out light bulb to work again would be far more interesting.A shame really, The king of popcorn movies, Bruce can make a good movie great and and a so-so flick into an extra large bucket of popcorn fun. But, this? No way.-Avoid.."}, {"id": 8, "text": "Bruce Willis was the only shining light for this film. It's like it was filmed by high school kids, and managed to find $1m to hire Bruce Willis. Shockingly bad acting."}, {"id": 9, "text": "Silly, improbable plot, ridiculous tactics and action, poor character development, stilted dialog, clumsy and impossible situations. Bruce Willis, how could you take a part in this thing?"}, {"id": 10, "text": "What a shame for Bruce Willis. Making garbage films for money. You can watch only if it's free, not worth any money."}, {"id": 11, "text": "Dealing with the death of a loved one is easier than watching this movie"}, {"id": 12, "text": "When someone did not login IDMB for a loooong time posting a review, you know how bad the movie is.Love Bruce Willis and Jesse Metcalfe, they did what they could to carry the movie. But when the script is so bad, best actors magnified the stupidity level just like that sniper scope on the roof."}, {"id": 13, "text": "The writing and acting is so bad it's almost unwatchable. There are better shows on network television. I am not a picky viewer, I'll watch just about anything but this BAD! Don't waste your money or your time."}, {"id": 14, "text": "Dont waste your time with this crap, Bruce has yet again just decided to help a friend out and star in this rubbish. The acting is terrible and so are the shootouts. The casting is useless, The dialogue is shocking. Go wash your hair instead."}, {"id": 15, "text": "Don't be caught by Bruce Willis on the poster - he's there just to draw your attention. In the movie, he does almost nothing and has very little screen time.The movie itself is like a cheap indie shooter game. The characters are clueless and pointless. Taking into account the locations, extreme close-ups, costumes and number of artificially augmented actresses, it is a very low budget movie.Highly not recommended!"}, {"id": 16, "text": "Bruce used to be a movie star, watching him in a string of bad movies lately, including this one, is sad, he must be quite desperate for money to keep making these overused, mindless movies, where he keeps saying the same thing find my little girl, he looks old and useless, just stands there looking out the window, not seeing anything the plot in this creation is overused, new world order, wow, how original bad acting, predictability, ridiculous lines just a waste of time"}, {"id": 17, "text": "It's not exactly a new plot but for being low budget and shot in a single location its got an old school action charm to it. There's just enough variety to keep you watching till the final mono o mono showdown.6/10 for me"}, {"id": 18, "text": "A repetitive and boring story, bad acting without a deep image... It seems that no creative author to establish an interesting issue"}, {"id": 19, "text": "Plot is very stupid, both good and bad guys keep making stupid decisions. Gun fights are horrible with bad guys' aim worse than storm troopers, while good guys just spray and hit everybody. There is no strategy at all. At one point the bad guys are lost in the dark, keep swimming around randomly and yelling you are surrounded come out lol."}, {"id": 20, "text": "Even a high school drama students would do better, not to be labeled sexist; the females are the worst in this movie, go and have few drama lessons or acting tips before deciding to waste our time"}, {"id": 21, "text": "Metcalfe tries his best to drag Hard Kill beyond B-level status. He handles the physical aspects confidentially enough. It's almost a calling card for him to do a bigger budget action flick in the future. Willis is only in a 20 minutes as expected.Screenwriters Chris LaMont and Joe Russo stick to action movie bingo in crafting the script. The characters are thinly developed and the plot is basically the defend the castle, protect the king variety. It's predictable but fun enough.Worth a stream for a 90 min of mayhem."}, {"id": 22, "text": "Action movie doesn't mean shooting someone (or a group of evil people). A good story is the most important factor for any movie. What if the story of Titanic be like, Jack is a poor boy who bought the ticket of titanic. Then he got there, ate good foods, saw dolphins and a few days later he died? How many people would like that?Plus, let's assume that someone is playing Delta Force or any other action game and found that all enemies are Mr. Bean. Bean can't hurt you. Even can't slap you softly. He just appears and die. Then who would buy that game !!"}, {"id": 23, "text": "The only ones that wll benefit from this are the unknown actors getting to meet Bruce Willis.. Even though he does not do a good part.. Could not finish this torture"}, {"id": 24, "text": "This film start with a gunfight scene, and a girl Eva giving a device to a man scene! As turnout, this film is about Eva mistaken giving the so called Quantum A.I. system device to a villain The Pardoner, and she eventually need to make it right by destroy the system with her father Chalmers! The shooting scene in the film at some point not showing the opponent getting hit, but overall quite intense, and bloody! The martial art fighting scene also quite watchable! The caring of Eva by Chalmers, Harrison by Sasha, and Nick by his teammates, also make the film quite touching to watch! At the end, Chalmers shot The Pardoner several times to kill him! The team lead by Derek celebrating the victory! That's it! This is actually a fairly entertaining movie!"}, {"id": 25, "text": "A mercenary team of ex-soldiers, led by Miller (Jesse Metcalfe), gets a too good to be true fat payday to escort wealthy tech CEO Donovan Chalmers (Bruce Willis) in scoping out a new site.It's all a ruse as they're actually intended as security to help take down a terrorist, The Pardoner (Sergio Rizzuto), from utilizing a vaguely described device that could wipe out everything. The Pardoner has made it personal by kidnapping Chalmers' brilliant daughter."}, {"id": 26, "text": "Why did Bruce Willis do this movie? It's plot makes no sense. The dialogue is made up entirely of cliches. The acting is cartoonish. This is MST3K worthy."}, {"id": 27, "text": "Movie was terrible watched the whole thing hoping Bruce may salvage the Movie at some stage, Never Happened cab only hope this isn't the standard for Bruce now from Blockbusters to Mindless B grades and calling it a B grade is a compliment."}, {"id": 28, "text": "This movie is a JOKE, an not very good or average JOKE.I should have turn off the movie, in the moment that Bruce Willis, drives to the miller home on an EXTRA EXTRA LONG limousine. the kind of limousine that you rent with your friends to go a party.I have never, ever seen a businessman use this extra-extra long limousine for work, this doesn't even make sense.Why Bruce, why make this movie?.. are you broke?.. do you need the money?. are your been blackmail?..don't waste your time... go take an hour long walk and enjoy your life.."}, {"id": 29, "text": "Ok, so there's a bunch of people who run around a single abandoned location, they dump exposition for 5-10 minutes straight (they really talk a lot) and then get into a badly shot action scene for around a minute. They repeat this five to ten times and then the film is over. There is no story or characters, nobody tries with the acting, Willis looks barely awake, but a paycheck is a paycheck. I think that he just wanted to drive in a limo. I can't even call this a film and I have no idea why so many people would get involved in such a waste of time."}, {"id": 30, "text": "No point? Cause what was the paint? To earn a little money for Bruce? Come on! Awful scenario. Bad acting. And of course as always in such a teams in real world there is always woman. Hehehehe! Teap. For sure! GTFO!"}, {"id": 31, "text": "To write this review. Despite the prescence of Bruce Willis, is a sleep inducing crockpot of crap. It has no redeeming qualities. Taking a nap instead of watching this movie is a much better use of your time. Anyway, if you read this and still watched it, you will not be able to say, Oh my, no one told me this is a massive waste of my life."}, {"id": 32, "text": "Bad bad bad movie pleasedon'ttry to watchor download 😠😠😠😠😠"}, {"id": 33, "text": "I'm pretty sure this is just the same general plot as Live Free or Die Hard. Which is arguably a better movie that ironically also has Bruce Willis in it. Go watch that one instead."}, {"id": 34, "text": "Seriously what happened to Bruce Willis? Is he that hard up for cash these days that he would resort to starring in bottom of the barrel direct to dvd trash flicks like this? This movie was horrid. Not even in the guilty pleasure sense. Jesse Metcalfe I mean really? He needs to just stick to Dancing with the Stars and give up his acting day job cause he was downright cringe inducing. You have been warned. This movie is bad and not in a good way!"}, {"id": 35, "text": "This is truly woeful, did any of the actors even read the script? Pathetic storyline with every cliché possible stolen straight from several other pathetic movies, bad acting, ropey sound - there really isn't a single redeeming feature, you have been warned...... to be avoided at all costs.Hang your head in shame Mr Willis!"}, {"id": 36, "text": "It's to bad film, please don't lose ur time watching this movie."}, {"id": 37, "text": "Omg omg what a stupidity of movie. I think there must be some inspiration before they release the movie. Plz stop shoot stupid movies"}, {"id": 38, "text": "Im thankful i paid nothing for this and Bruce willis really needs to fire his agent."}, {"id": 39, "text": "Bad acting Bad scenario Not worth a detailed review."}, {"id": 40, "text": "Flat script, bad supporting actors deserted by non existing director. Unwatchable."}, {"id": 41, "text": "I've seen episodes of Itchy and Scratchy with a better story than this film. Even the title is stupid and makes little sense. An hour and a half of violence on top of more violence. Cartoonishly evil bad guy, macho men and women death squad, and Bruce Willis phoning it in.Yet another cocktail napkin script that seems to have been scribbled out in one hungover morning. Imagine this script as a short story and it wouldn't pass muster in any short story anthology ever published. There are LOTS of great stories out there waiting to be turned in to movies. This one should be recycled back into a cocktail napkin where it has some sort of meaning and purpose."}, {"id": 42, "text": "This is just utter garbage. Try harder next time. Try hard with a vengeance."}, {"id": 43, "text": "Some of the most pathetic acting and worse directing I have ever wasted my time watching. Do not waste your valuable time on this pathetic movie. I am very disappointed that Bruce Willis would even except a film of this low quality with such pathetic directing. Some of the good reviews on this film must be from cast and crew trying to push the ratings higher."}, {"id": 44, "text": "I could not contain how upset I was that I paid for this movie, but at least it was only $8 for the two of us to see it. Who directed this movie? Didn't they see the actors were NOT acting?! It was so dreadful I fell asleep 45 minutes in, and the movie is only 1:38 min long. I pray whatever paycheck Bruce got for this got him through the pandemic ."}, {"id": 45, "text": "This is my first review absolutely awful, so awful I got bored and decided to write this review before the film ended , please people for the love of God just move away from this its embarrassing , shocking"}, {"id": 46, "text": "Poorly written, directed, and acted, this may be one of the worst movies I have ever seen. I love dumb action films, but this one was sooooo dumb that it made it impossible for me to enjoy it even a little. Did Bruce Willis need a payday, or did he owe someone a favor? He should be embarrassed."}, {"id": 47, "text": "I don't know how much they paid Bruce Willis for such a poor quality movie, Bollywood movies are much better to watch or even telemundo novels are better"}, {"id": 48, "text": "Zero knowledge about weapons and gear. Night vision during the middle of day light? This is beyond ridiculous. So many tactical errors in this movie."}, {"id": 49, "text": "A bad movie.A bad movie and A bad movieHow did they get Bruce to do this?"}, {"id": 50, "text": "So bad it's unreal. The acting is shocking, the plot is like something from a programme a 12 year old might watch, just everything about this film is truly horrible. Don't waste your time. Please please please don't waste your time. I love BW but this is merely a shocker living off the fact his name is included in the credits."}, {"id": 51, "text": "Please stop making crap like this... The most horrific acting ever.. Comparable to the room.. Story line is similar to the ramblings of a twelve year old packed full of cliche expectations.. Someone has to be vetting there movies.. There is no excuse for this to exist period.. Only Netflix could do worse."}, {"id": 52, "text": "I like Bruce Willis. He's a very good actor, and does action well. I tried watching this movie and all I can think is either he lost a bet or he owes the IRS a lot of money and was desperate for a payday. For Bruce's sake I hung in there for about thirty minutes. But I just couldn't take it anymore. The plot made no sense. The writing was amateurish. And all the other actors seemed like they were hired from a local drama school and were being paid in sandwiches. The last time I saw a film this embarrassing for a star it was a drunken David Hasselhoff eating a cheese burger off a bathroom floor. And what kind of name is The Pardoner for a villain?"}, {"id": 53, "text": "The movie is just bad.. There is no putting lipstick on this pig.The acting is bad, but I think that's because the writing is so horrible the actors can't help delivering bad acting because of it.The story is just lame, with lots of plot holes and lots of nonsensical stuff in it. Small stupid things like.. They are in front of the computer and need the code, basically nothing can be done before they have it. BUT... when she is done talking to the guy, she turns to the computer and starts typing and typing as the focus leaves her. WTF is she typing? did she get the code all of a sudden? NO.. So why is she typing? ARGhh...The whole movie is just full of annoying stuff. It's a horrible horrible movie. And I can't believe Bruce Willis put his name on this turd."}, {"id": 54, "text": "Horrible dialogue, horrible acting. Keep thinking something good from Jessie would come but no. Thinking Willis would come about as well. No. Horrible. Can i get my $6.99 back please?"}, {"id": 55, "text": "No point of watching this movie. Fast forward a few times to see if the movie would be more interesting, but I ended up forwarding it to the end."}, {"id": 56, "text": "I wish there was a rating point that is below 1 I would choose it. It's just dumb stupid film. I would definitely recommend you stay away from it."}, {"id": 57, "text": "So cliche and boring the last 30 min i was just waiting for it to finish"}, {"id": 58, "text": "This movie is so horrible, we ended watching the old Inspector Gadget cartoons. The acting in Inspector Gadget is better!!!!!"}, {"id": 59, "text": "Worst D level movie ever. Bad acting. Bad music. Bad writing. Just a waste of my time. Don't be fooled by Bruce W being in the cast."}, {"id": 60, "text": "Waste of time. Such a predictable movie. Bruce pls dont accept these sort of movies. Cheapens all that you have built your name for. Even survive the night is a crazy movie.."}, {"id": 61, "text": "Hard Kill (1 out of 5 stars).Hard Kill is a horrible action film. What you can expect from a straight to tv action film. Terrible acting. Bad script with cliche dialogue. Horrible direction. And action sequences that is terribly put together. The shoot out scenes look likes the characters are playing with paintball guns. With the practical effects of gun shots. The plot is horrible. About a bad guy who wants to take control of a device from this engineer lady. But holding her hostage cause her father can take and operate the device. The film is boring."}, {"id": 62, "text": "Unorganized and poorly planned. Worthless bad guys that if deployed properly, this film would have only be 29 min long."}, {"id": 63, "text": "OMG what a bad movie!!! We thought some nice action but even the action was bad. This should never been released!!"}, {"id": 64, "text": "Is Bruce short on cash?! I'll lend him some, just to keep him out of such an epic fail of a movie like this one, but I fear we'll see him doing dish detergent commercials before long.It's about 1 hr 40 min, I made it to one hour in, and had to bail in disgust. Yippi ki yay is dead to me"}, {"id": 65, "text": "Jesus, who should give budget to make this worst-useless-choking-nightmare movie like this, very bery bad cast, wrong script and Bruce is a disaster sleeping in this movie !!! P/S: do not waste time &amp; money for this movie like i had 'cause you gonna be disappointed."}, {"id": 66, "text": "Bruce is a shell of a man lately first I saw survive the night (which was an abomination of a movie) and now this waste of time. Why just why.. Poor acting with characters you don't care if they live or die."}, {"id": 67, "text": "Bruce is desprate taking a role in this flop. After about 20 minutes I had to stop the pain and turn this off."}, {"id": 68, "text": "Hard pass on hard kill some corny unbelievable terrible acting"}, {"id": 69, "text": "Got to 1:17 out of 1:38I do love B-movies, but this takes the biscuit, they wear them green night vision Goggles in daytime, with the sun coming in the windows. The costumes, perfect B-Movie ! they let the extras, them military guys, wear their own shoes, no two wearing the same. And nothing fits. Special effects by amateurs. Its fun to see all the crap, but I've enough. Anyone got past 1:17 let me know.Camera work was ok, which actually took away from the B-Movie vibe.Hope Bruce got a good pay cheque, coz this does nothing for his reputation."}, {"id": 70, "text": "The only thing that bestows these three stars is the surprised-pikachu face on the main character when the villain pulls out a gun in the last scene."}, {"id": 71, "text": "Man, Willis just doesn't star in any good movies anymore. Hard Kill proves this as a fact as Willis delivers more cheesy one-liners (spoken like a true soldier I got your back, soldier, etc.) in this violent Willis flick. These one-liners (obviously) are unoriginal, and feel borrowed from other action movies. Therefore they feel like they aren't new ideas, these are just the same ideas being manufactured into a different movie. The storyline is also the same idea being used. Nothing different, just your typical good-guy-fighting-evil-terrorist-who-wants-to-use-technology-to-create-weapons storyline. More unoriginal concepts are used in this storyline. Don't see Hard Kill, see a better Bruce Willis movie. At least one that isn't just trying to make money and at least trying to be good."}, {"id": 72, "text": "This is so so bad, why sell your reputation Bruce, you look like an idiot being in this rubbish..."}, {"id": 73, "text": "I don't usually write reviews on here, but my god this was just a train wreck. Absolutely nothing in this film was worth it. Yet we have another action film with Bruce Willis that is just as cliché, empty, and dull as any other bad action film. Every actor sounds like they're doing their first rehearsal take, Bruce Willis, the biggest star, looks bored as hell and doesn't get to do anything, and the writing is just atrocious. It takes every single cliché imaginable making this film more and more generic as it goes along. I felt like I was watching a video game seeing how the runtime is just drenched in the dumbest shootout scenes I've watched. Probably what blew my mind the most is that one of the screenwriters is the great Joe Russo...Are you serious?! One half of the directors that made the highest grossing film of all time has been subject to this pile of garbage??? I really hope he was just pushed off to the side during the writing process and let the other garbage screenwriters do all the work because he doesn't deserve this. Avoid this movie at all costs and don't be fooled by seeing Bruce Willis on the poster"}, {"id": 74, "text": "Do not waste your time with this movie. I was expecting another blockbuster by Bruce Willis and I fell asleep 20 minutes into the movie."}, {"id": 75, "text": "This movie was so bad I shut it off. Waste of time don't watch"}, {"id": 76, "text": "Never watch this Really disappointed to watch this movie Wasted my time"}, {"id": 77, "text": "Fun flick, Bruce is cherry on the top. Lots of fast action. I enjoyed it!"}, {"id": 78, "text": "I hate trashing movies but i was laughing at the dialogue of this movie and how lack of character development there is in this movie i like how bruce willis in in it a little more but its what the people say in this flick that drives me crazy i like these action is good not great but could be better i will finish it but not now while im drinking because i only have one beer left"}, {"id": 79, "text": "Terrible movie on a low budget. 90% of the film is in an abandoned warehouse and is two teams shooting at each other then talking, then shooting, more talking and you get the picture. Bruce is going for a record of terrible films with him as the lead."}, {"id": 80, "text": "Love B-Movies, the ones that are so bad you watch them to spot mistakes, goofs, bad continuity, acting.In this one the camera work is ok, which takes away from the B-Movie feel.Some Producer and Director looked at this movie, and said yes ! it will do."}, {"id": 81, "text": "OK if you want a mega budget action film, big names, big affects....well then this is not for you. Its always hard to rate a low budget film as most have a bigger version out there (not always better mind) its hard to see past the poor locals or affects, long story short they look cheap. So we have Hard Kill. The action is good at times, again the low budget keeps it to mainly gun/hand fights, both of which are not bad, its not flashy but it feels a little bit more real to life. The story is what it is, been there seen that, but it moves along well. The look of the film is actually slick for its budget.....but at times it looks very well shot. One thing that stood out for me was the soundtrack, simple and at times memorable, much better than most films of this type. I know I keep saying budget budget budget, but its what you have to think of when you look at these films, for me this is a good solid film for the budget, it makes me wonder just what Matt Eskandari could do if he was to get a bigger....OK last time BUDGET. I hope some studio has faith in Matt and gives him more room to create."}, {"id": 82, "text": "The moment when you are sorry you lost your time is not just a moment. It lasts. The story - not worth it. Acting - lousy. Thanks god i had a chance to fast forward when dialogues became to bad for my stomach to listen."}, {"id": 83, "text": "I will never will see this cause off the bad reviews. Thank you all. Looks like a lot of actors now giving their name and do a five min appearance to for a quick payday. And sadly Willis is doing this for years instead of making movies."}, {"id": 84, "text": "Unrealistic and a total waste of time. Would have to be the worst movie I've seen this year. 99% of the budget would have been to get Bruce Willis into the movie. Director Matt Eskandari please don't do any more movies. Mercenaries hiding from bullets behind a wooden table, bad guys being shot through bullet proof vests, derelict building with power and bad guys relying on running there huge computers. I'm just so disappointed in Bruce Willis for doing this movie....huge letdown."}, {"id": 85, "text": "I wish I'd read the reviews before I paid to rent this film. Its terrible in every way, acting is awful, dialogue is forced and slow, but the plot is by far the worst part. Dont waste your money."}, {"id": 86, "text": "Bruce Willis became Nicolas Cage and started to play in low quality movies."}, {"id": 87, "text": "One word...AWFUL!!!!!!Yikes. Bruce Willis must be desperate...this was just painful to watch. Some of the dialogue reminded me the last Die Hard film."}, {"id": 88, "text": "Is this a comedy film or spoof film. Now a days add Bruce will and make a movie become common and the output is worst. I'm not able to understand what is this film about. I remembered same setup movie Battle Drones which is far far better then this."}, {"id": 89, "text": "I find it really incredible that Bruce continues to get involved in projects like these. Absolutely NOTHING can be rescued from this production. The worst dialogue I have heard in years, a soporific and hackneyed plot, terrible performances, bad special effects, horrible location and a predictable end. Bonus track: the subplot of the daughter of Willis's character is never fully understood. This pirated movie is not even worth watching."}, {"id": 90, "text": "Bruce's movie selections are getting worse by the day. Even Nicolas Cage wouldn't be jealous!"}, {"id": 91, "text": "The cast had potential, but all around it was terrible. I had more fun laughing at these reviews, during this film, then watching it."}, {"id": 92, "text": "Absolute garbage! The trailer gave me high hopes, but they were quickly dashed! Not even Bruce Willis could save this waste of time. His acting was subpar, so we'll never know what could have been had he brought his A game. I've seen better performances from high school plays. In fact, I insult high school drama by mentioning it in the same breath. Whoever wrote this should crawl into a hole and never come out! It felt like a group of twelve-year-old boys wrote it during a sleepover in which they each consumed half a wine cooler because that's all the potency it has behind it!"}, {"id": 93, "text": "Absolutely dire. Only gave 2 stars as it helped pass 90mins of time. Bruce should be ashamed."}, {"id": 94, "text": "Very poor movie with very predictable scenes, stars reactions are very poor cause of the unknown names in it"}, {"id": 95, "text": "This is a very poor film. The budget is obviously very low, it just feels like one long tedious scene with no end. Annoying music playing constantly through conversations in stead of for dramatic effect. Director seems to think add Bruce Willis and the money will pour in. It is spending me to sleep don't think I care to see the end."}, {"id": 96, "text": "No set up, no sympathy developed for the characters, no set up of the cause. Straight to the fight. Tedious."}, {"id": 97, "text": "0/10 for this movie. 1/10 for entertainment factor in looking for continuity errors.StarSwipe Magazine reportedly said that the lead role went to Jessie Metcalf after Joey Tribbiani pulled out due to Mac &amp; Cheese 2 commitments."}, {"id": 98, "text": "Hi lights include: Hero closing his eyes shooting Motivational speeches to people already there fighting Villain giving the bait to the heroes then spending the rest of the film trying to get her back. Villain typing on a keyboard after they just said the power has been cut. Night vision goggles worn on the cheek Night vision to see 3 bad guys standing in front of a massive window in the day. The good guys who are apparently professionals bring pistols, a shotgun with no stock, an uzi- yes an uzi - and exactly 1 assault rifle.Might be the worst film I've ever watched. Wasn't even funny bad, just bad bad."}, {"id": 99, "text": "I'm sorry Bruce that you need the money to make such a poor film. Please, don't do it again, this was truly the worst film I've seen you in. Your a legend, don't lower yourself to clueless films."}, {"id": 100, "text": "Absolutely awful script, and acting. Every sentence is followed by a long pause. Some of the sentences .... even .... have ..... pauses .... in .... them. Painfully slow and boring. Even the action sequences are slow. I love Bruce Willis, but why did he get involved in this B movie ?"}, {"id": 101, "text": "Bruce Willis has sunk to a new low, he should be ashamed to be a part of this train wreck of a movie. There's nothing redeemable here... horrible script, no plot, terrible acting, fights and stunt work are laughable, and the dialogue seems to be written by a kid in junior high. What a waste of time and film. As enjoyable as getting a tooth pulled. I want my 90 minutes back."}, {"id": 102, "text": "Just a bad movie - sub par acting and a lousy script lead a rag tag merc group through another bad Bruce Willis movie. No reason to mention spoilers. The movie spoils itself."}, {"id": 103, "text": "Just awful, apparently Bruce Willis is hard up for cash. Horrible acting, horrible dialogue, horrible stunts - I kept waiting for it to get better and it never does. One of the worst movies of all time."}, {"id": 104, "text": "This is one of the worst movies of all times. Dud someone blackmail Bruce Willis to be in this film. Did someone force him to do this? It was as though the actors in this farce were being fed their lines for the first time through earpieces as the scene was being shot. During one of the shoot outs you can actually hear a lazer gun sound effect like they were on a spaceship. I could go on and on about the story line too.This movie is truly a joke and the author is on us for having watched it."}, {"id": 105, "text": "People have got to relax. This was not meant to be a blockbuster. Why you would go into it thinking it was is beyond me. There's been no hype, no trailers, and no commercials.It's a low budget, single setting action flick. I watched it while running on the treadmill and found myself enjoying it. By now means is it deep. It's just a surface level, basic good guys vs. bad guys.Not every movie has to be made to win an oscar or pull in hundreds of millions of dollars. Throw the movie on, do something else with it on, and be entertained with the bologna that's going on."}, {"id": 106, "text": "Was the budget for this one $3? This was terribly written, casted, directed and acted. How is it #10 on Netflix today? Is this a Deep State conspiracy?"}, {"id": 107, "text": "***Negative 10***He must be in serious financial trouble to be in this movie. Bruce Willis was epic in Tears of the Sun and I am a big fan. We watch Die Hard every Christmas. I have to think they spent the entire budget to pay him because they clearly didn't spend it on anything else. The acting would have been done better by a high school drama team. Twelve-year old boys would've written a better script and maybe next time hire a military consultant who could tell you that any daylight would make night vision googles worthless... yes, even a little sunlight streaming through a window. Wood pallets do not stop bullets, body armor does. Please, for the love of all that's holy, do not watch this movie. It would hurt me to think I let another unsuspecting Willis fan watch this dumpster fire."}, {"id": 108, "text": "There's no point going into detail. I had a completely open mind for this to be a fun action movie. It's not. It's just absolutely terrible. Might be the worst movie I have ever seen. Definitely top ten."}, {"id": 109, "text": "I've seen lots of bad movies in my life. This one is in contention for the worst. Does Bruce Willis really need the money this bad??"}, {"id": 110, "text": "How could Willis have agreed to this? The writer has no clue. Must have been a teenager with Daddy's money who wrote this.The only thing I can think of is Willis thought he might be able to enhance it. Or, they paid him a ton of money.Sad really."}, {"id": 111, "text": "The acting was atrocious and you can't count the firearm errors on two hands. There were soldiers walking around with guns with no optics or iron sights as well as rifles with empty magazines. If you know know the first thing about guns these critical errors break the immersion of the combat. Overall this was a great comedy and I would put it on the same level as Stepbrothers and Due Date."}, {"id": 112, "text": "1. Bruce Willis is barely a part of this movie so don't expect much from him.2. The plot is garbage and they didn't really explain what was going on that well.3. The acting is horrible and the action scenes were worse.Don't waste your time."}, {"id": 113, "text": "Turned it off 4 minutes and 32 seconds in. That's all I have to say"}, {"id": 114, "text": "The acting is terrible, except Bruce and Jesse. I just couldn't get over the two women's extreme lip injections!! They look like daffy ducks! It looked horrible and I couldn't concentrate on the film any longer. I stopped an hour into the movie! I just couldn't finished it!"}, {"id": 115, "text": "Completely lacking in plot. Technical advisors must have a substance abuse problem. Moved with a parking brake on."}, {"id": 116, "text": "Terrible movie Wafer thin storyline Terrible acting and dialogues"}, {"id": 117, "text": "I grew up watching Die Hard and the like, always loving Bruce Willis. Followed him hardcore until about 7 years ago, he started making movies that were not up to his caliber. Paycheck I guess.Not Bruce's fault in any way though. This has to be one of the worst scripts ever produced. Acting is unconvincing, plot, is there one?I can't say anything good so I guess I'll just end here. Saw this for free and feel like I got ripped off."}, {"id": 118, "text": "This movie has the touch of amateur about it, and also Bruce Willis, who probably wandered into this movie by mistake. Considering that all Brucey's good work in the Diehards got eclipsed by poor writing in the sequels it's some consolation it happened here right from the first Take. Hard Kill's got a pretty humdrum plot, a host of extras clad in black, some of whom seem to dive even before getting shot and a team of good guys &amp; girls, hell-bent on taking out guys in black. And then you've got project 745. Wonder who came up with that idea? Probably some dude that bunked English classes in 4th Grade."}, {"id": 119, "text": "Its 2020 bad year with bad movies add Hard Kill to the stack : Bloodshot &amp;The Old Guard"}, {"id": 120, "text": "I enjoyed it so much I had time to write this review while watching it and shopping online for a New Power Recliner to fall asleep in and I did buy one So I figure the Production company owes me $2500.00 for my new Recliner ......lol.Like they will ever pay me back haha"}, {"id": 121, "text": "Yes, it is psycho dad, psycho dad. Just FYI. More fun watching Al Bundy singing Psycho dad. And yes again, it is a hard kill. Bruce just keeps on living. Hope he will feature in a watchable movie very soon. Yippee Ki Yay brother"}, {"id": 122, "text": "Slow, horrible written. The dialogue is stilted and awkward. Not the old Bruce Willis flick for sure. Wish I could get my $6.99 rental fee back."}, {"id": 123, "text": "Don't waste your time watching this movie. Horrible acting and very predictable."}, {"id": 124, "text": "This is the 2nd movie I've seen you in that is totally s***. What a waste of time."}, {"id": 125, "text": "What a cheap actCheap productionAnd cheap scenario3 was given for fake weapons they brought for the act."}, {"id": 126, "text": "The first 1/3 of the movie isn't bad. Then the absurdities begin piling up. Don't fall for the few who rated this above 4 stars or said it was poor man's Die Hard. It ain't! Reading the reviews is more entertaining...easily"}, {"id": 127, "text": "Despite having Bruce Willis the acting is horrible the story line is so basic. It's like watching a high school play the acting is so bad"}, {"id": 128, "text": "The entire budget of this credit card film was clearly spent on gunfire squibs and a single large warehouse.Bruce Willis is present obviously as a favor to someone, because it's clearly not as a paying gig.The plot is so plastic it does not warrant the respect of description Hard pass.."}, {"id": 129, "text": "If this movie can be made, I can be Tarantino. By far the dumbest most cliche and cringe worthy time you will ever spend. Bruce Willis is a joke."}, {"id": 130, "text": "1. Full of cliches 2. More dialogue than drama 3. Slow and boring 4. Not sure if anyone in there is acting enough 5. The low budget is very apparent. 6. Another paycheck movie for Willis"}, {"id": 131, "text": "Literally wasted two hours of my life! Super disappointed in Bruce Willis. Thought hey it has Bruce Willis it can't be bad. It was don't waste your time or money"}, {"id": 132, "text": "The infinite monkey theorem states that a monkey hitting keys at random on a typewriter keyboard for an infinite amount of time will almost surely type any given text, such as the complete works of William Shakespeare. (source:Wikipedia).That is how this movie was made - thing is though, that they decided to use whatever was on paper after 10 minutes of typing.Flat, linear, non-evolving characters : check. Cliché-ridden, cheezy dialogue: check. Props, location - can we do this for, like no money at all? : check.One word of recommendation: AVOID !"}, {"id": 133, "text": "I won't waste too much time on the review. The film is just awful. I don't know how Bruce Willis could participate in something like that."}, {"id": 134, "text": "... so you already know not to bother. I know damn well Bruce wouldn't have bothered either"}, {"id": 135, "text": "It's so bad I had to come up here and warn people not to waste their time. For real. Don't. Waste. Your. Time."}, {"id": 136, "text": "The worst movie have ever seen. Bad history. Worst tactical decisions on both sides. And it's very boring. I was expecting in the end somenthing like: Advertisement. This movie was concepted to example things not to do in a siege situation. Do they want to dumb people down ??"}, {"id": 137, "text": "Let's stand behind a wooden table... a bullet will never travel through that. And they were right. Bulletproof wooden tables. The military have been doing it wrong for years. Story was crap, acting was mediocre, just terrible."}, {"id": 138, "text": "The driest, wooden and terribly hollow action film I have ever seen. I have seen a whole lot of Bruce Willis' direct to video action films he does for quick money, but this is beyond the tolerance limit. Clearly, it's a rip-off of Die Hard and Live Free or Die Hard. The title says it all. Hard Kill. It surely doesn't sound like Die Hard at all. All we have is a bunch of John McClane wannabes stuck in an isolated .... something .... and they need to stop a group of techno terrorists led by Liev Schreiber lite after a something, which they would use to end the world. So, basically the movie has some world ending stakes, but doesn't feel like so at all. And on top of that none of it makes any sense. (A bunch of weird people who can use guns to stop the world ending threat, eh? Suicide Squad anyone?) Bruce Willis is just there to make 10 to 12 fools like me watch the movie, because people like me love Die Hard films (not the last one though) and John McClane is an absolute favourite action hero of us. He is there to sit on a chair for 12 (out of 15) minutes of his screen time doing absolutely nothing. I would've been fine if Willis was the lead. Would've still hated the film, but not to this extent. Through brief flashbacks and ridiculously boring exposition scenes, the characters are set up. And, though they pretend to have some depth in them, there's nothing there. And, all they do is blow up a whole bunch of cardboard and wooden boxes. And not to mention, the performances are much more wooden than the wooden boxes they blow up. They sort of built a supposedly intense conflict between the hero and the villain and their final fight is not even a minute long, and it ends before things even get started. Apart from this, it is full of rotten and overdone cliches of the action films. Former WWE diva Eva Marie doesn't seem to be that great of an actress.It's not worth your time. If you love action films, stay away from it. If not, you'll have a strong reason to justify why you're not a fan. It's really sad to see Bruce Willis, who once played one of the greatest action heroes (John McClane), devolve into a money hungry old man who does films like these to get a little money.Rating ~ Number Scale : complete 0/10; Letter Grade : beyond an F"}, {"id": 139, "text": "Don't waste your time watching this. The script is atrocious. The acting is terrible. This is an exercise in torture. It's not even one of those movies that are so bad they are funny. This is a straight disaster from beginning to end. Even coma patients would wake up just in an effort to get away from this. This really is a great contestant for worst movie of all times."}, {"id": 140, "text": "He was there just for the name sake. His hand were tied but he was acting as if he couldn't get up. If hands are tied cant old person really cant get up ??"}, {"id": 141, "text": "I swear I have seen better plot exposition and character development in a Call of Duty level. This film is abysmal. Hey, I found a deserted factory. Let's use it as a film set. Plot? Can't be bothered. Where is Captain Price when you need him?"}, {"id": 142, "text": "Expected more from Bruce and Jesse but even they couldn't save this disaster.. Really bad script, really bad acting and what is going on with Eva's eyebrows? They're half way down her face! I actually thought they had their own part, I actually expected them to have a few lines..... it probably would have made the film way better if them eyebrows had started talking."}, {"id": 143, "text": "The budget for this film must have come from Bruce Willis's spare change, at best. Shot at a single location with a handful of actors. The script is laughably cliched, it could almost be seen as a comedy, a spoof on the genre. If you can watch it for free you're still paying too much to see it"}, {"id": 144, "text": "The whole thing is shot in an abandoned wear house. It's slow and it's NOT slick. Quite boring for a shoot em up film."}, {"id": 145, "text": "My Wife and I love a good yarn. But when a Producer says Great, a disused factory thing place, some half baked actors; OH and let's sign Bruce Willis up too, throw some bullets at a half-baked storyline we go zzzzzzzzzzzMy goodness me, we have seem some essaitchonetee stuff over the years, but this one really does take the laughable biscuit. Willis didn't even want to be in the movie, that much is more than obvious!If you enjoy this absolute pile of rubbish you really need to get out more or expand on what you consider entertainment.We only stuck with it, hoping for improvement which......(Spoiler Alert) NEVER comes. Phew."}, {"id": 146, "text": "A terrorist called The Pardoner!! What? &amp; not even slightly menacing - gets a bit shouty though &amp; breaks a walk-in talkie....... ooooh! Plenty of cliches - grenade rolls towards bad guys feet, stands still &amp; looks down in shock for a second before it goes off. Bad guys wearing cycle helmets couldn't hit a barn door. Purple hair! Supposed to be edgy but looks like she's off to a 12 yr olds birthday party! &amp; what is the point of the Nick Fox character? Gets shot &amp; squeals like a pig for 10 mins &amp; then later doesn't seem bothered by it at all - must have had some ibuprofen in his pocket. There are so many things wrong with this - same tired plot, invention that could help the world but they'd rather turn it into a weapon, blah blah blah - in fact it's pretty close to the fire sale plot from old Bruce's Die Hard film Live Free or Die Hard but with a fraction of the budget..... hmmmm Seriously, just don't bother."}, {"id": 147, "text": "Just waisted an hour and a half of my life watching this crock, don't think for one minute that because Mr Willis shows his face in this that it ' could' be a reasonable film, top budget on this i would guess at $250...excluding Mr Willis over inflated payout of course?"}, {"id": 148, "text": "I've always loved a good Die Hard film, unbreakable etc with Bruce in, always plenty of good action &amp; storyline. This film is THE worst (apart from The Grinch) film I've ever seen. The plot is virtually non existent, a really badly written storyline. The music to the film is so awful, its so dull, its enough to make you turn it off on its own, it just doesnt go with the film. The actors &amp; actresses are all so dull &amp; lacking any charisma &amp; feel rather lifeless in this tin pot movie. I'm so surprised Bruce agreed to do this film, he's way better than this garbage.....watch Die Hard again instead"}, {"id": 149, "text": "Garbage , dont waste an hour and a half of your life watching this"}, {"id": 150, "text": "Just awful. Don't waste your time watching this unless you're after a masterclass in how not to script and direct a film."}, {"id": 151, "text": "The acting is poor and a very low budget film. Bruce Willis must of been desperate for this role. Not anywhere near his abilities. Since when has, hiding behind a pile of empty boxes, been a strong hold against machine gun or any gun, but she never got hit."}, {"id": 152, "text": "Uses every cliche in book, feel sorry for Bruce Willis don't bother watching it poor acting bad story line no point to it, very disapointing"}, {"id": 153, "text": "Man did I just waste my time and a good pizza, from beginning to end nothing but shoot out after shoot out, you'd think with all the shooting that they'd even pretend to be death. No way anyone can not go death in real life if they were involved in so many shoot outs. This has to be quite possibly the worst movie ever. It's so bad I'm going to tell all my friends to see it.OMG really if you read this before seeing this crap, DO NOT WASTE YOUR TIME!!!!!!Watch a blank screen, that will be more entertaining.Warning you.Crap crap crap"}, {"id": 154, "text": "This is one of the worst movies ive watched in a long long time sharknados plot was mearly better than this.. The story line to the clumsy acting. Its a slow paced movie with no story line. They hold down an abandoned factory with 3 pistols a shotgun and an AR 😂😂😂😂😂😂"}, {"id": 155, "text": "Hopefully someone out there won't waste an hour and a half of their time on this garbage.This is quite possibly the worst movie I've ever seen (and I've seen a lot)."}, {"id": 156, "text": "Watched the complete film, but got bored after 34 minutes, It's full of mistakes, no storyline and bad acting. Only watch it if you have time to spare because of Covid."}, {"id": 157, "text": "Absolute rubbish, slow moving, slow talking, oh dear 😏"}, {"id": 158, "text": "I am still watching this film in disbelief that Bruce Willis put his name to it. I have never written a review for IMDb before but had to put pen to paper to warn others off. Possibly the worst film I have ever seen. Acting, Story, Camera work. All dreadful. Cheese of the highest order !!!"}, {"id": 159, "text": "This is awful... Why would Bruce Willis do this film? Does he owe money to someone? Does his house need work? A new kitchen? It says something with Brice Willis' acting is the best out of the whole cast."}, {"id": 160, "text": "Willis's worst movie by far. Corny lines, pathetic military tactics (hid behind cardboard boxes fir cover),moronic story line, wooden acting. Every element of this film is awful.... it's 0 out of 10"}, {"id": 161, "text": "Terrible story and the acting is below amateur... a must skip film .. shocking ."}, {"id": 162, "text": "I thought that a Bruce Willis movie would have had some more clout! But it was terrible. Acting was awful, story line was mondane - don't watch it"}, {"id": 163, "text": "It's like Bruce Willis left his acting skills at home when going to work. The movie has bad acting in its entirety. Around 5000 rounds fired and they can't hit a single target."}, {"id": 164, "text": "Oh bruce bruce ,what did you do ,this film made exactly 30 mins before i turned it of.why is everyone bloody black ops ,stupid chicks takin down massive guys,it really makes me wanna puke .from the second it starts the out of tune music ,the bad camera sides its b movie at the best .please no more black ops chicks and cheesy scenarios its terrible.and bruce buck up man"}, {"id": 165, "text": "Yes. And this is it. Dreadful, boring unwatchable rubbish. Like Malkovich in Ava, Bruce obviously needs the paycheck. Why else would he waste his, and the viewers' time. Absurd meaningless plot, awful acting - the Pardonner must be one of the most laughably awful bad guys in cinema history. And with their buddies dead they wander laughing into the sunset. Did I mention the script? Nope. There isn't one."}, {"id": 166, "text": "No plot. Wooden and poor acting. Totally unspecial effects. Gun shots hitting a wall and exploding like paintballs then the next minute the wall is pristine. Makes no sense."}, {"id": 167, "text": "This movie was awful. Just awful. Acting, storyline, just terrible. Don't waste your time."}, {"id": 168, "text": "I thought I couldn't go wrong with a Bruce Willis action film. Obviously this isn't the case! Terrible acting. Boring plot. Would've turned it off halfway through but hubby was hopeful it would get better... Nope. An easy day's pay for Bruce but I think I've lost a little respect for him. Don't waste your time with this film."}, {"id": 169, "text": "Seriously, several production companies put money into this. Horrendous acting and continuity issues a plenty. Bulletproof cardboard boxes and doors? The woman with the purple hair uses two completely different guns in the same shootout. Night vision goggles during the day? I'm done"}, {"id": 170, "text": "Its like some student film project with Bruce, how the mighty have fallen, gone are the days when Bruce made a good film. The worst part of film worst that the fckn purple haired lady, worse than the bearded guy, worse than the bad acting was who ever filmed this film. The Blair witch project was where they based their camera training. It was like it was filmed on a smart phone and one without a stabilising software. Maybe they could have got the computer expert to fix the footage as she was so great at it."}, {"id": 171, "text": "No plot to speak off Acting is absolutely pathetic The action sequences are dreadful Their is nothing redeeming about this film I can only think the budget was spent on Bruce's wages This sort of rubbish to me is really tarnishing Bruce's legacy as he's made quite a stinkers over the last 10 years"}, {"id": 172, "text": "I recon I got about 2\\3 rds the way through this film before I summons the strength to hit the stop button. I have rarely watched so much total rubbish. I'm not sure what this film made at the box office but even if paid I do not believe I could watch it to the end without causing substantial damage to my television"}, {"id": 173, "text": "The plot is very slow and the acting is WEAK, I was losing interest in the first 15 minutes... who cast this movie?! Bruce Willis the only slight saviour but even he is out of place - too good for this movie. 😴"}, {"id": 174, "text": "Try as I might, I decided to watch without a review, initially the acting was terrible and we all turned to each other, to say check IMDB, so thank you all for your help in saving us with your reviews!"}, {"id": 175, "text": "How do they get the go ahead for these films? Seriously, the acting is terrible and the story is pathetic"}, {"id": 176, "text": "The phrase 'So bad, it's good' can't even be used for this mind-numbing trash. The acting, script and directing (and everything in between) is so dire it's hard to believe this was ever allowed to see the light of day."}, {"id": 177, "text": "This film is terrible, it just goes on and on! Definitely the worse Bruce Willis film I've ever watched."}, {"id": 178, "text": "1hour 38minutes I will never get back review too short, but nothing to say about this film"}, {"id": 179, "text": "This film is of course utter American garbage. I can only imagine Bruce was in the market for a new shed or something. This is a predictable action flick badly acted and on a low budget.It has all the ingredients of an American gun loving action film for idiots.1 - Numerous bad guys all dressed in the familiar black storm trooper outfits who despite being armed to the teeth struggle to hit their targets while the good guys can fire one bullet and kill loads of bad guys or simply pick them off using a knife or do that breaking the neck thing from behind making it look as easy as turning a thermostat up.2 - Tough female character over doing the I'm as tough as the toughest man however she manages to stay predictably beautiful throughout movie.3 - One of the good guys gets killed to maintain some sort of credibility. He's soon forgotten buy the end.4 - Last men standing namely the chisel faced hero and the bad guy who have a fist fight as the gun probably gets kicked away. I did not care by this point as I was playing with the cat by now.Oh not forgetting the give me the code or I'll kill your daughter and  if you kill my daughter I won't give you the code blah blah blah. This stand off is scenario is nonsensical and over done.Yes I know it's not serious film making but the whole thing is so formulaic. They could have cut and pasted scenes from different action movies and nobody would have know. It's just been done to death and mostly in the 80sIn one of the many shootouts our hero has a conveniently up turned office desk that somehow is totally bullet proof and can withstand a barrage of bullets. If Trump had know that he could have clad his presidential limo is office furniture.It's not even a bit of fun like Die Hard was, having said that the actress who played Bruce's daughter did have incredible eyebrows. I hope Bruce likes the new shed he bought with his wages."}, {"id": 180, "text": "Seriously. Dead plot. Dead acting. Dead everything."}, {"id": 181, "text": "Being a Bruce Willis fan, and to be fair he doesn't make many bad movies, I selected this on the strength of his name in the cast. However, this is the worst film he has ever made. Poor script, poor acting by the unknown cast and very low budget. Looks like Bruce just did it for a pay day."}, {"id": 182, "text": "Simply put, absolute garbage. Paper thin plot with loads of holes in it and a low standard of acting.I'm sure there's some Netflix or Amazon series that Bruce can sign up for rather than tarnish his reputation with this kind of trash"}, {"id": 183, "text": "I can forgive a ropey old plot and poor dialogue, but I refuse to forgive the dreadful wooden acting which is on display throughout the first half hour (gave up after that). Scene after scene of actors standing with impassive expressions while supposedly dangerous/intriguing/tense scenes were unfolding!! I would describe some performances as laughably bad, except that it is actually depressing to think there must be decent unemployed actors out there who could have done a far better job (created this account just to post a review, so the effects of this film can be cathartically purged)."}, {"id": 184, "text": "This is bad on so many levels, I can't believe that a film like this is being funded. Either Bruce's pension is not kicking in or he must have connections with the producers/directors/writers of the film! Shame - sort of ruins his credibility as an actor."}, {"id": 185, "text": "If you like movies, were the action is poor and people just stand around and talk,this is for you. Dire dire movie. Only stars because Bruce Willis is a legend. Though his choice of films is concerning"}, {"id": 186, "text": "Must have been made on a real low budget. Poor acting, story and dialogue, lighting, location and did I say acting. Not one of Bruce Willis' finest hours."}, {"id": 187, "text": "You know sometimes a film is so bad that it becomes good.well this one starts bad and stays that way.can't think of anything good to say about it.avoid."}, {"id": 188, "text": "Yikes, this is all over the place. Usual nonsense about a gazillionaire (Bruce Willis) who hires a group of highly trained mercenaries to protect his assets, A group of hoodlums kidnap his daughter and a trade-off scenario looms... The dialogue is wordy and inane, the performances lack any sort of charisma or conviction especially from Jesse Metcalfe (Derek) and a truly wooden daughter Lala Kent (Eva), and even the usual glint in Bruce's eye is lacking. It has loads of end-to-end action, but the pseudo-intellectual plot peppered with infantile moralistic pomposity renders that pretty ineffectual after about twenty minutes. Another straight to video job, this - sorry."}, {"id": 189, "text": "Well I gave it 5 stars on google so I thought I'd give it a one star on here to cover the bases.I LOVE a bad movie, but it's got to be really bad, like Plan 9 from outer space bad not just meh - that was a waste of time but bad to the point where it almost seems like it was a deliberate parody - this is one of those films.Within the first minute, you know what you're going to get as the opening sequence shows a Bargain Basement Billy Butcher (fans of the boys will know who I mean) Taking cover from machine-gun fire behind what looks like a plywood wallpapering table, but better was to come.About 4 minutes in we are treated to a flashback where BBBB is in a war situation, they clearly didn't have any budget to shoot this so instead decided that a cut scene from a nnock-off Call of Duty type videogame would do the job just as well.Other highlights include a sniper rifle that not only shoots real bullets but inexplicably shoots paintballs at the same time, as you see them splatter on the walls.Bad guys who choose not to enter a massive deserted building through any of the myriad of doors and windows it has but to walk in groups of 3 very slowly in the middle of the path so they can get taken out more easily.The director who realises that the taking cover from machine-gun fire behind a wooden table wasn't bad enough, so doubled down and got the female character to take cover from machine-gun fire behind cardboard boxes - CARDBOARD BOXES!!!!In one scene tribute is paid to 80's pop music videos by having a girl meet the bad guys in an alleyway where steam seems to be emanating from skips and anywhere else they could hide a smoke machine. As a Gen Xer - this was a nice bit of nostalgia for me.The dialogue was absolutely minging, they must have opened the Big Book of Tough Guy Cliches to help them out with the script, my favourite was probably I got shot in the back, and I still have the scar to prove it - Well I'm sure you do mate, what did you expect to happen wit your bullet hole scar, did you think you could rub on some verruca cream and wait for it to fall off?Now on to the acting, it was awful - truly awful, so bad in fact that it made me ponder whether bad acting was contagious because Bruce Willis looked like he'd never been in a film before, almost like he'd been woken from a drunken night out, booted onto the set and had to deliver his lines half-cut and spending most of his brain processing power concentrating on not throwing up.The worst actor was the girl with the purple hair who I wouldn't trust to deliver a pizza let alone a convincing line, closely followed by the bad guy, who to be fair could have been worse but I'll be honest, every time he was on screen I got massively distracted trying to work out how scientists in a lab somewhere managed to create the love child of Liev Schrieber and Bradley Cooper and grow him fast enough so he could be wheeled out onto the movie set.I'll be honest, I could have written a lot more - this review has barely scratched the surface and it wouldn't be fair to spoil the fun for those who bravely follow in my footsteps.I'm actually going to watch this again but this time with my 17-year-old son because looking at his face wrinkled up in astonishment, shock and horror at what he's witnessing will be like watching the reaction videos to people viewing 2 girls one cup Don't watch if you like a film that requires your neurons to be functioning for you to enjoy it for what it is supposed to be.Do watch if you want to get a load of friends together for a watch party and laugh about how stupid it is.Enjoy!"}, {"id": 190, "text": "Please spare yourself and refrain from watching this garbage..even after 1 hour I feel like puking .."}, {"id": 191, "text": "Very flat story. Almost like the writers were some aliens from another world. Zero logic. Full with clishes. As somebody pointed out - it is watchable, but still very bad. At some point (without any obvious reason!!!) the actress said: I cant believe this!And I thought to myself - me too!"}, {"id": 192, "text": "Someone decided to blow the budget on Bruce Willis instead of a plausible script and convincing actors."}, {"id": 193, "text": "If I could give this minus 10 then I would. Dreadful acting and a ridiculous pointless script. This is without a doubt the worst film I've ever seen Bruce Willis in and can't understand why he ever agreed to be in it. Don't bother wasting time watching this, go and watch some paint drying, it would be much more interesting that this rubbish!"}, {"id": 194, "text": "Gobsmacked, a truly awful film, made it to 50'16 but that was in the hope it might just get better. It didn't and it won't."}, {"id": 195, "text": "To be honest I only made it 20 minutes in then gave up. Acting is beyond poor and plot is a series of cliches."}, {"id": 196, "text": "If this is the future of Hollywood movies, then I am afraid its going down for good. Non-existent plot or story, less than average action, a super sad choice of location, I mean there's hardly anything worth enjoying in this movie. Just save yourself some time if this appears in your Netflix or other movie apps, and give it a pass."}, {"id": 197, "text": "Another Bruce Willis movie where his name is used to merely draw an audience. The storyline is weak and film stretched out and could of easily completed from start to finish in 15 minutes. Large speeches and pointless dialogue is used to make up for the lack of action."}, {"id": 198, "text": "Please do not waste your time with this drivel. Really drivel."}, {"id": 199, "text": "Awful acting, awful plot, by far the worst film bruce has ever been involved with. Don't waste your time watching it, i wish i hadn't bothered"}, {"id": 200, "text": "Don't bother, bad acting, even worse special effects."}, {"id": 201, "text": "It would be impossible to list the crass dialogue and ludicrous plotting. Presumably somehow this film made money? Or were the producers simply in search of tax write-offs?"}, {"id": 202, "text": "I panicked in the opening meeting between Jesse and Bruce, when talking about where they had served. Mogadishu, Somalia, Bosnia!!! When the script writer doesn't know that Mogadishu is the capital of Somalia, i get pulled out of the action and think oh dear how bad is this writing going to be?? Glad to see it truly lived up to my expectations, don't waste 90 minutes of your life on this, and if you have 90 minutes to waste stare out a window, bound to be more enjoyable."}, {"id": 203, "text": "Dismal script, implausible scenarios, give it a wide berth."}, {"id": 204, "text": "Rename this film Hard Watch. An hour and some that I'll never get back."}, {"id": 205, "text": "Really really bad lol, like a really bad cutscene from a corny game with the same dumb ai as most enemies, story is laughable. Avoid"}, {"id": 206, "text": "What's going on, I don't know, but they sure as hell don't. Not sure what I expected, but this a doozy beyond all that is imaginable. Is this a lock down joke, did they make it in a day in one location? Because if they did it should have been better! Thank God for fast forward!!"}, {"id": 207, "text": "I made an account just to tell you how bad this movie is. Terrible in every aspect. I would have rather stepped in fresh dog s**t."}, {"id": 208, "text": "The plot is beyond unbelievable, it's just stupid. I wish I could be more eloquent but the true is it's just dumb. The acting is awful, very reminiscent of mighty morphing power rangers on a bad acting day. The main bad guy actually remind me of the bad guys from Three Ninjas way back from my youth. If there was no kills or foul language this would have made a great kids movie.Oh and Bruce Willis, well his performance is pretty good, at points I feel like he's uncomfortable with the lack of acting skill around him during scenes but I suppose he just thinks of the pay check and I don't blame him one bit"}, {"id": 209, "text": "A three year old with a crayon could have written some thing better. This is so bad in every way. No plot, no script, terrible acting. Not one redeeming feature to be found. An hour and 37 minutes too long."}, {"id": 210, "text": "Evidently Wills has become as adept at picking lame scripts as Michael Caine once was, dire, low budget, trite nonsense set it seems in a derelict mill."}, {"id": 211, "text": "This was by far the worst Bruce Willis movie ever. Also this was one of the worst movies I've ever seen.I think the budget for this film was somewhere around 10 - 20K. Honestly they could have hired amateur actors from high school and have done a better job than this.All they did was rent out a big old abandoned factory and filmed the whole movie there. The acting, lines, plot, and delivery was horrible. Do Not waste your time on this. Ignore the 4.2 overall rating. I would rate it a 0 if that was the lowest rating available."}, {"id": 212, "text": "One of the worst movies ever. Some of the worst acting ever. Even Willis was bad... Do not waste your time."}, {"id": 213, "text": "I turned it off around 9 minutes in. It's terrible, bad acting bad lazy plot and bad dialogue. Just don't do it"}, {"id": 214, "text": "Bruce must have needed some quick cash to be involved in this schlock. This movie wasn't even bad enough to sleep thru."}, {"id": 215, "text": "Except less poetic. Remember when a sweaty Butch dropped from the second story window of a boxing arena, and into the waiting cab of a sexy shoeless Frenchwoman? Even as a washed-up never-was, Willis was tough, sexy, and believable. Hard Kill? Not so much... More like hard sell. Willis proved his skills in 12 Monkeys. The guy has it in him to act. He does not have it in him to do action. Not for a while now. Sad. This movie offers Willis fans nothing. This movie offers action fans nothing. If you like to see low-budget choices reflected in unimaginative on-location choices and like lots of abandoned warehouse interiors, this is your movie! Enjoy!"}, {"id": 216, "text": "When I first read the premise and saw the actors I got excited. I figured this would be decent b-movie action flick. Boy was I wrong big time!The movie is very draggy, the acting is beyond subpar, and lastly it feels very clausterphobic. They're in pretty much same area entire movie. The only reason I gave any stars was some of the action scenes were okay but for most part they weren't great by any means.Avoid this one at all costs boys and girls!"}, {"id": 217, "text": "This Bruce Willis movie was so bad that I don't think I can watch Die Hard this Christmas."}, {"id": 218, "text": "Terrible acting Stupid plot Horrible script Everyone involved should be embarrassed. *and I'm a big fan of Bruce Willis* Which is the only reason I even watched it."}, {"id": 219, "text": "The entire movie is the same thing over and over! They pretty much stay in one spot and keep fighting, killing, fighting, killing. I couldn't make it thru it."}, {"id": 220, "text": "Probably one of stupidest movies Ive seen in a long time. Sad to see on Jesse Metcalfe Resume. Past performances were promising. Maybe because supporting actors were bland. But Bruce Willis needs to hang up the hat. I also found it strange that his Movies went from Die Hard... To Hard Kill. Not a very creative title."}, {"id": 221, "text": "This movie does not fit the history of artist Bruce Wells"}, {"id": 222, "text": "This is the worsed action movie this year. Why does Bruce Willis play with zich bad actors and even worse story. Waiste of time."}, {"id": 223, "text": "While the film closely hews to the standard of its genre but lack somewhere in plot."}, {"id": 224, "text": "Every cliche in the book. More time complaining than planning. I think most actors are one their third movie. Bruce Willis mailed this one in for his smallest paycheck ever."}, {"id": 225, "text": "I watched a Die Hard movie a few days before so I guess this showed up as a movie I'd be interested in. Wow, this was bad. Cringe worthy script and a terrible plot, let me say it again A TERRIBLE PLOT. I almost feel bad writing this as never write reviews. Is Bruce Willis broke or why does he do this? Not worth watching."}, {"id": 226, "text": "I can't believe this movie was greenlit and it went through so much production without ANYONE realizing how bad the dialogue was. It's SO BAD. Like laughable. Not a total waste of time for someone with LOTS of time on their hands. If you need to make your movies count, don't bother with this one."}, {"id": 227, "text": "No better or no worse than most of the action flicks."}, {"id": 228, "text": "The payment should be 5 figures at a minimum. I am trying hard to remove the 20 minutes that I suffered through from my memory!"}, {"id": 229, "text": "I honestly don't know where to start. The story is weak, the dialogue is worse, and the acting puts it all to shame (in a bad way). Surprised Bruce Willis signed up for this."}, {"id": 230, "text": "This movie is horrible from start to finish. Bruce will start losing credibility if he keeps putting his name on this kind of garbage. Bruce, you're better then this."}, {"id": 231, "text": "As a die-hard Bruce Willis fan, this movie was terribly a waste of time. It's like those Nick Cage's C movies.PLEASE FIND SOMETHING ELSE TO WATCH!"}, {"id": 232, "text": "If there is a word that is worse than awful I would use it to describe this movie. Rarely, very rarely, are we not able to make it through a movie but this one was truly unwatchable."}, {"id": 233, "text": "Bruce Willis is highest billed and named actor in this movie. That said he is hidden away most of the movie. It's the worst plot. Faux military characters with obvious flaws showcasing the writer of the script doesn't understand armed forces. It's entirely unrealistic and super boring"}, {"id": 234, "text": "This is a very bad movie. Bad acting, dialog, plot, unrealistic tactics. There is nothing good about this."}, {"id": 235, "text": "This movie has plenty of guns and shooting and killing, but really lacks plot and any real substance. I could not make it to the end."}, {"id": 236, "text": "My god in heaven......where to start with this dumpster fire. Hu..as that are marines. Poor weapon play.. and why in the F is Willis even in this film..... Okay. I get that B films aren't so great. At least when Cage takes a B film, he upholds the Cage awsome. Bruce, if you dont want to do the work, just stay home. I have worshiped every film you have ever been a part of... and lately I am wondering WTF???? Jesse is clearly the only actor in this film. I have often thought about being in film... thinking I had no chance.... but looking at this cast, makes me think otherwise. I have seen a group of junior high kid act better then this crew. So.... let's get to the film. Actually, with Metcalf anchoring, he holds the line and makes it bearable. He is the 3 stars. Production value got you one more."}, {"id": 237, "text": "Bruce just why? I mean why? Please help your fans understand why you are making movies like this... Its embarrassing and just awful. This flick was so bad I made it about 40 minutes and just had to tap out. Its that bad folks. Put it this way... Nicolas Cage and John Travolta both passed on staring in this and we all know the caliber of movies they are making these days... Crikey what a turd"}, {"id": 238, "text": "Seriously, I'm trying to think of a good reason you'd do this movie. Did you read the script and then somehow get it mixed up with a different script? Did you owe some sort of debt to one of the other actors or the director? Maybe someone involved has some compromising photos of you? I just don't understand.3/10 because the actors (at least the non-stormtrooper ones) seemed to have some sort of idea how to handle a weapon."}, {"id": 239, "text": "Nominate it for 2 raspberries! Worst Bruce Willis movie ever"}, {"id": 240, "text": "I use to suffer from Insomnia until I discovered this movie. Now all I have to do is, play this movie on Netflix and within 10 minutes am out like a big old Bear. Wow am i getting great sleep now"}, {"id": 241, "text": "Okay so my review is too short. But there's nothing really more to say than it's painful to watch."}, {"id": 242, "text": "Listen, Bruce Willis is one of my favorite action actors and I have watched the vast majority of his movies and this one just kind of left me feeling sorry for him. Maybe not him, but just the over all story and actors.I found my self asking more questions and saying Well that makes no sense? and Huh? as opposed to being lost in the movie and wondering how did 1.5 hrs go by already.The bar has been set by Underground 6...I've watched that 4x already and would have much rather watched it a 5th as opposed to watching Hard Kill one time. Live and learn I guess...."}, {"id": 243, "text": "Netflix got me with this one. It is free, but I didn't finish it. Bruce Willis was the only reason I started watching, but it's just too painful. Had to stop."}, {"id": 244, "text": "This movie hit every cliche in the book, like a work of art everything you think will happen, does in fact happen! It feels like a million dollar college film but don't get your hopes up, the acting isn't college film good. I would recommend this to anyone looking to count how many stolen lines, mirrored scenes and classic action movie lines have been recycled. Other than that it's a great way to kill time.Thankfully Bruce Willis is still handsome and mysterious."}, {"id": 245, "text": "I love Bruce Willis movies but this one......the acting was so bad at 25.41 into the movie I couldn't take anymore!"}, {"id": 246, "text": "Poor acting and silly script. Unbelievable that Bruce Willis is involved in the bad movie...what a way to end a storied career."}, {"id": 247, "text": "Definitely a horrible movie no reason its top 10 Netflix movie I'm sad that Bruce Willis even starred in this very bad acting &amp; poorly written"}, {"id": 248, "text": "Funny how they just happen to kill the only 2 villains with night vision. Need I say more. I heard they shot this movie in ten days. Kinda explains how you can hide behind a cardboard box during a shootout. At least I got my garage cleaned."}, {"id": 249, "text": "Terrible acting and predictable plot line. Watching this crew of 4 take out a small Army will fill automatic weapons and gear is laughable."}, {"id": 250, "text": "Don't waste your time with this movie. It's honestly sad how low Bruce Willis has come and continuing to go with this film. Terrible acting all the way through and very dull storyline."}, {"id": 251, "text": "Sure, this movie is useless, senseless, &amp; hopeless, but it din't have to be humorless , too . Why make one of our great funny-adventure actors into a bland suit? This could've been saved, sort-of, with some Willis clowning."}, {"id": 252, "text": "Oh, the stereotypes... the PTSD vet, (let's use a serious topic as the basis of an action flick), the Gung-Ho guy, the warrior princess, and the cautious whiner, AND the guy who saved my life so I owe him one. It gets worse, they go to the place where they knew they would have to make a stand and immediately lament that they are outgunned... uh, hey billionaire CEO, ever heard of prepositioning? (Military axiom: if you're in a fair fight, you didn't do your planning. In this movie the deliberately step into a weak position... derp.) None of the actors have the slightest clue how special forces look or behave. The point at which I could no longer watch was when the girl comes walking up, and the good guy, seeing the bad guy sniper, does the Hollywood hands up while holding my Glock... as if to say you are a sociopathic murderer, and I am going to step right into your sights, but I have my hands up, so you can't shoot me... nanner nanner! This movie should be fine for teens and idiots who play FPS games, it's not a worthwhile film for grownups though."}, {"id": 253, "text": "This is the worst movie I've ever seen in my entire life. And not even in the way bad movies can be fun. I made an IMDB account just to comment how terrible it is"}, {"id": 254, "text": "Who bankrolls this drivel? No plot, dialogue written for young children, and a bait and switch with Bruce Willis. Other than that, it is an awful waste of time."}, {"id": 255, "text": "The storyline and acting is terrible including Bruce Willis. I laughed out loud multiple times and it isn't a comedy. However, it wasn't a terrible 1.5 hours. It's good action/gunfire-wise. If you like action movies and don't require a good storyline you'll enjoy this movie. It's similar to a Lethal Weapon (with less comedy) or Broken Arrow."}, {"id": 256, "text": "Despite the quality, this was pretty disappointing. Mostly due to the complete lack of character depth and development. The lines were often tacky and stupid. Predictable to say the least. I wish it was better, I just wanted a simple action film, but this was unfortunately not even good for that. I am surprised that Mr. Action himself was so forgettable as he was. Ah, this was just disappointing. If you want a simple, action movie, I'd see what else is there."}, {"id": 257, "text": "The action was unrealistic.In a seen a person would have a pistol - same fight than a rifle. Heavily protected soldiers get shot up by un- protected good guys. The dialogue seemed forces and corny."}, {"id": 258, "text": "What a crap. Bruce Willis did you really needed the money that bad to tarnish your reputation. The acting on this movie is really bad, were did they get this actors. Plot is bad but mainly due to the acting. At least special effects are somewhat mediocre."}, {"id": 259, "text": "It's so cool for a high school to get to do a big budget for a B-grade movie. High school writing. High school acting. High school action."}, {"id": 260, "text": "This is an elite team of military trained warriors? They step out in the open with an automatic firearm at their waists? The bad guys fall at the first shot of a handgun... don't they wear body armor? This looks like a high school production from the 90's. Bruce does a little more than his usual, contractual 10 minutes of screen-time. Sad to see a Willis in this. He has done so many great things. He needs to stick to the RED series of movies."}, {"id": 261, "text": "This was trending on Netflix so I thought why not? It's got Bruce Willis in it. It was just so dumb. The script was laughable. The acting throughout was bad. So many cringy action movie cliches.The warehouse or building they filmed it in was pretty cool though. The aerial shots were neat."}, {"id": 262, "text": "Bruce had to either be related to someone in this and doing it as favor or he lost a bet. Truly wooden acting and a 2 sentence plot that was probably one sentence more than they could handle."}, {"id": 263, "text": "A C- movie with action and actors honing their acting skills. Director and producers are still learning. Bruce is getting older and there's a need to have new action actors. Some here have potential. Watch to give support for a new breed of actors trying to get things right. They have a ways to go. Director needs some help. Story-line is an old one for pitting the gamecocks together to fight. Fresh faces to watch. Don't get too cerebral watching it. Go with the flow."}, {"id": 264, "text": "Nothing to expect from This movie just enjoy seeing Willis on the cast"}, {"id": 265, "text": "Bruce Willis was the only shining light for this film."}, {"id": 266, "text": "I've been a Bruce Willis fan for a long time. From diehard to the last Boy Scout, he has had some good action movies. The last number of films that he's made have been so bad that I can't even use the language I need to describe them. I'm Begging you Bruce, please pick a good script, Producer, Director, and make a good movie or retire. That's the least you can do for all your worldwide fans; we love you Bruce but this has got to stop. Carrying it let me fade. By the way, the movie is really bad. Lol. 😎"}, {"id": 267, "text": "Clearly a little money has been spent on this movie ( just to pay Bruce and Jesse at least, maybe ) but it would have been better on something else.I watched this all the way through so you don't have to. Thank me later :)"}, {"id": 268, "text": "2020 has been hard on a lot of people for a lot of reasons. Even some big name celebrities have had a rough go, but the Toughest Year award goes to Bruce Willis who had the truly unfortunate experience of showing his face in this remake of Assault on Precinct 13 which somehow contains even less plot. Basically it looks like they shot a big shootout, added five minutes of plot, then paid Bruce Willis (not nearly enough) to make a few cameos so somebody (literally anybody) would watch it."}, {"id": 269, "text": "I would estimate that I've probably watched 350 or so movies in my life and I have no hesitation when I say that this is the worst one I've ever seen. Not one of the worst movies, simply the worst one. And yes that includes movies like Sharknado. No story. No logic. Bad acting. Bad special effects. Bad ending. Bad voices, etc. The one point is for Bruce Willis and for the fact that they could have made this goofy farce of a film longer."}, {"id": 270, "text": "Watch it for about 30 minutes then read all the reviews and have a great time laughing your head off."}, {"id": 271, "text": "This movie is not good. The basic plot is that Bruce willis is a tech billioniare that hires some toughs to help him get his daughter back. It's basically 98 minutes of tough guys having an emotional moment, then fighting. The emotional tough guy scenes seem to go on forever and the action scenes make very little sense. The strangest thing is that the good guys knock out power to the building during daylight, then don night vision googles to fight the bad guys, with sunlight still streaming in the windows."}, {"id": 272, "text": "Sounds like all the lines are being read directly off a teleprompter. Horrible Acting. Marines have to be so glad that they are referring to them as Soldiers throughout the movie. Gun fights look like something that the SciFi channel does. Lots and lots of sparks flying everywhere, bad guys standing in the open, good guys behind soft cover (bullets go through wood tables).Bruce Willis, not even really part of the movie. Maybe used just to draw people to watch."}, {"id": 273, "text": "Hard Kill is rife with vapid, unskilled acting, accentuated my Lala Kent's botched lip fillers."}, {"id": 274, "text": "Another quality film produced by Randall.... hence the star LaLa. Terrible action scenes with some pretty horrible gunplay. Did they hire a technical advisor? Bruce must need some $. Not good..... Lala stick to bad reality tv"}, {"id": 275, "text": "Very rarely do I log in to leave a review, but this movie is so bad I had to save someone from making the same mistake I made. The bad guy was horrible. Acting was garbage. It was like a librarian playing a bad guy. Jessie Metcalf wasn't any better. When he fired a weapon it was laughable. Even Bruce was horrible. The only decent actor was the daughter.Eva Marie who I imagine was suppose to be eye candy looked horrible. Make up looked like a 7 year old put it on. Her acting matches the way she looked. Texas Battle, never heard of him and I see why. Garbage.Please please don't make the mistake of watching this movie. You'll regret it. One reviewer said it's watchable, no, no it's not. But if you are stubborn then go ahead."}, {"id": 276, "text": "Hard to Kill need to change the title Hard to Watch. Bruce Willis must of forgot his A game acting at home."}, {"id": 277, "text": "Worst movie I've seen in 30 years. So many elements lacking credibility. An abandoned factory that still emits steam and has full electricity. Who are they kidding? Bruce Willis' sole purpose is to have a name actor. What a boring performance. He looked barely awake. Don't waste your time."}, {"id": 278, "text": "Ridiculous plot, pathetic script, terrible acting. I watched because I've enjoyed Bruce Willis movies. I'm embarrassed for him that he's going out being associated with such horrible movies."}, {"id": 279, "text": "From start to finish, some of the absolute worst acting, filmography and writing I've ever seen. It really was a joke. Jesse Metcalfe was the best of a bad bunch, but still it was like watching a bad high school play. Bruce should bow his head in shame.THEY EVEN GAVE THE BAD GUY A RUBIK'S CUBE!"}, {"id": 280, "text": "Its about time Hollywood give Trans Actresses and Actors the chance to play action roles, but Natalie Eva Marie can not Act. I went into this straight to video movie with low expectations but the unbelievable acting job Natalie Eva Marie portrayed as Sasha made it unbearable. Why wasn't the role offered to Laverne Cox or Jayne Lynch ? Heck a cardboard cutout would have been more believable. My second grip would be that as the American Terrorist. How stoopid and unbelievable is it that a Terrorist is some Joe Schmoe from Manhattan, Kansas or some other Middle American state. I could buy it if he was a descendant from the Middle East or African Country. I could see it as some guy from Minnesota who born in Somalia and came to America as a refugee. But Indiana, Seriously? Even with low expectations you wont be able to stomach the horrible acting of NEM.Another Review From A Woman of Color."}, {"id": 281, "text": "If you want a good laugh, DEFINITELY watch this movie! Its SO bad my wife and I laughed through the whole movie. There is no plot, the writing is terrible, and the acting is beyond horrible, including Bruce Willis. Nothing in this movie makes any sense...but it's a good laugh the whole way through."}, {"id": 282, "text": "Acting wooden. Plot dumb. I am a big Bruce Willis fan and it is sad to see him wasted in such dreck."}, {"id": 283, "text": "I truly hope that Bruce Willis is ashamed of himself for being a part of this heap of trash. Terrible acting across the board."}, {"id": 284, "text": "I kept waiting for it to get better. Spoiler Alert: It doesn't. The acting is wooden the script seems written by a 5th grader. The action scenes are totally unbelievable. Bruce why have you stooped this low? I suffered through 56 minutes of a 98-minute movie. I just couldn't watch anymore. How in the heck is this #4 in the U.S. today on Netflix?"}, {"id": 285, "text": "Cliche, boring, really not worth your time. I'm really sorry because I like Bruce Willis but overall mind numbingly bad."}, {"id": 286, "text": "I spent a large chunk of time creating an account just to tell you what an awful movie this. Terrible acting all around. Horribly awkward dialogue and delivery. Just painful all around."}, {"id": 287, "text": "I saw Bruce Willis, Jesse Metcalfe. Ok, not bad. But everyone else I'm not sure who they are but their poor acting skills makes it so hard to watch. Why Netflix, why? 😭😭"}, {"id": 288, "text": "How can someone produces this in 2020 ? No plot, no story, bad acting, non sense all the way for nearly everything. I am often pleased with not much, but here, that was beyond all I've seen before."}, {"id": 289, "text": "I tried so hard to give this movie a chance but about 30 minutes into the movie, I just couldn't take it anymore. One good thing about movies this bad is that it makes you appreciate the good ones. There wasn't a single good thing about this movie... acting, directing, picture, cinematography, sound, etc. It literally ruined my memories of former Bruce Willis roles that I grew up watching. I'm going to try and preserve what's left of it and encourage all you Bruce Willis fans to do the same. Don't watch any more of these B movies... it's two hours that you just can't get back! I don't leave many reviews but for this movie, I felt an obligation to warn everyone."}, {"id": 290, "text": "I watched this film thinking that as it have Bruce Willis, it can't be THAT bad...I was wrong.This was THAT bad.Half way though I wanted to remove my brain and throw it out the window for having allowed me to watch that much of the film."}, {"id": 291, "text": "This is by the worst movie and definetly the worst movie staring Bruce Willis. A billionare, but no guns and no action and a set that takes place in a boring AF location with no real action. not even action at a sensible time that real military special ops would do...ie...night time...NO night vision...nope just walk in the middle down to a spot to be shot in wide open are....STUPID...didn't even finish it. I'd rather watch powerpuff girls."}, {"id": 292, "text": "This should be called hard to watch. Don't waste your time."}, {"id": 293, "text": "You used to be on the top. Cool like Jean Claude Van Damme, hard like Steven Seagal, a fighter like Dolph Lundgren! Why do you participate in stuff like this? If times are hard, just ask for money on one of the crowd funding sites and I'll give you money for making the epic movies I remember from my youth. Do no embaress yourself with uninspired crap like this. I give this movie a generous 4/10 just because it's you. Please leave Hollywood and make real movies instead. You almoust made me cry this time. :("}, {"id": 294, "text": "I do not know what hurts most, wasting my leisure time in this piece of c....p or seeing Bruce Willis participate in it. Horrible plot, acting and directing. Awful, awful, awful...."}, {"id": 295, "text": "The budget was $11.5 million The Box Office take (so far) 59 million. They even failed on that. This movie is just dreadful. You may be better off going to you tube and watch some car crash videos or a instructional video on a subject you have interest in, you will gain more for having done that."}, {"id": 296, "text": "Bruce Willis is hurting his career with these kinds of trash movies."}, {"id": 297, "text": "The handheld camera shake was just plain awful. It actually hurt to watch. My eyeballs were constantly bouncing around their sockets. Next, it's just a whole lot of talking, talking and much more talking. This is no action movie. This is very much a tell dont show... show. In fact it reminded me of watching a bad TV movie. As for the score I simply didn't care; and I didn't care for any of the characters either. Willis, it feels these days, is more often just cashing in a cheque where i'd like to think he was adding some star power to a potentially good movie. However, that could be wishful thinking. Acting i guess was okay for what it is, a bad script? First shots fired were just after 32 minutes in and they must be on a budget as there's really only one location."}, {"id": 298, "text": "Nice to see some honest reviews, so here's another one. Total garbage from start to finish. I kept nodding off during this (honest) and continued to watch for two reasons. I hoped it would get better (it didn't) and because I'm a fan of Bruce Willis (why Bruce why?) I never thought it possible to zero-rate a movie but this gets 0/10 from me. A movie for the brain-dead only. EDIT: since my own review, the funniest one comes from Mark regarding Joey Tribbiani. You have to be a Friends fan to really appeciate the comedy. My daughter and I were in fits of laughter after reading his review (added here)mark-802-52278014 September 2020 0/10 for this movie. 1/10 for entertainment factor in looking for continuity errors.StarSwipe Magazine reportedly said that the lead role went to Jessie Metcalf after Joey Tribbiani pulled out due to Mac &amp; Cheese 2 commitments."}, {"id": 299, "text": "A perfect blend of modern threat and classic action. The acting is good and the plot moves at a good pace. This movie Hard Kill does keep the essence of die hard alive. Hard Kill is a action classic ! 10/10"}, {"id": 300, "text": "The plot just sort of jumps around for the first half of the movie, with no intrigue or suspense, just incoherence. The small bit of plot that does exist, seems almost like an irrelevant backdrop to the random non-stop gun battle. It's almost like someone wanted to make a movie based on a counter-strike (computer game) match that takes place inside an old Detroit-style abandoned industrial area.Watch once, if it's free and you're bored."}, {"id": 301, "text": "They've kidnapped Bruce Willis and are forcing him to be in terrible low budget zero plot bad script low tier movies! I lasted 40 minutes before fast forwarding to the end, and surprise surprise nothing. Do not watch this garbage film!"}, {"id": 302, "text": "I admit it, I like cheesy B, C, and even D movies every now and then, but this one is filled with every bad line, every computer and military trope ever written!Pointless plot development, unbelievable characters, and ridiculous dialogue, all mixed up with cliché fight and gun scenes.The movie even tries to be cool and edgy with everyone dropping an F-bomb every few minutes!Just don't even bother wasting your time... Even Bruce Willis couldn't save this dogs breakfast..."}, {"id": 303, "text": "Wife and I decided after the first 5 minutes that the next cliche we'd have a bourbon, seconds later, cheers. We were in stitches at how bad it was. No tactics, awareness or common sense, handguns against semiautomatics, walking into open space, walking backwards. The acting was awful needing music to tell us this was a solemn moment etc. I hope Willis got paid a lot but other than that it could have been daytime soap. All in all, we enjoyed the movie for all the wrong reasons."}, {"id": 304, "text": "This movie was not good at all. It was boring and could not hold my attention. Some bad movies you watch and see if they will get better. This one you couldn't even do that. The acting was poor and not believe able."}, {"id": 305, "text": "This movie is so bad I struggle to find any redeeming qualities. The writing is bad, the plot is bad, even the acting and action is bad. I only watched to the end to see if it would get any better. It didn't. I'm a huge Bruce Willis fan so it pains me to give such a bad review. Save your money and time by watching something else. Anything else."}, {"id": 306, "text": "Acting is so bad everything is just bad ........Worst movie that i've Seen il a long time 1 good actor Bruce the rest awful."}, {"id": 307, "text": "Terrible and unrealistic plot and special effects, terrible acting and The worst performance Bruce Willis has ever had. I'm so disappointed I gave this movie the benefit of the doubt because he was in it but what a letdown."}, {"id": 308, "text": "Seriously folks, if time means anything to you, save yourself from losing 98 minutes of your life!! This doesn't even fit in the B-Movie category, it's something else! The acting is so bad, but so bad that it's shameful in every way, even from Mr. Willis, which I believe we all loved back in the day. So many things simply don't make sense and others are way to obvious, that it hurts! Hurts your eyes, your intelligence and your soul... I must say, no matter how bad a movie is, I always force myself to watch the ending and I did the same for this one too, but I have to tell you, it was the hardest one yet! Stay away!"}, {"id": 309, "text": "Made an account just to review this piece of garbage exclusively. Honestly the worst acting I've seen in a movie in yearrssss... And the script.. don't even get me started. It astounds me that people can actually get paid to put in such little effort in a job that's ridiculously effortless in the first place. Prime example of the Hollywood ego being so far up its own bunghole to realize just how bad the project really is, cash grab or not. Whatever happened to having standards, oh how Bruce has fallen."}, {"id": 310, "text": "I only made this account to warn you how bad this movie is, the performances are poor, it is slow, boring and senseless"}, {"id": 311, "text": "If you see Bruce Willis, can you let him know that Hudson Hawk was a better use of his talents than this plodding mess of a movie."}, {"id": 312, "text": "Worst story possible with no plot acting or anything"}, {"id": 313, "text": "A thin story, B actors, obviously no director hired; so in total worse than a B-movie. I couldn't focus on the movie due to all the mistakes and the boring dialog."}, {"id": 314, "text": "Don't let the poster fool you, he's barely in it and barely does anything, they could have shot all his scenes in a day. It feels like the minimum effort to take some investors money based on Bruces name, a thin McGuffin never explained in any satisfying way is the basis of this movie, generic baddies all in identical gear to cover up the fact that they are using the same couple stunt guys over and over again are sent in waves to die for the sake of the plot, and to keep that budget money in their paychecks. The main cast are unconvincing super soldiers. This is a bad generic tv movie with inexplicable star casting, not worth your time."}, {"id": 315, "text": "A rating of 3 was pretty accurate. Although LaLa Kent I thought did a good job. The movies I've seen her in have been good. LaLa needs to leave Vanderpump Rules and dedicate her time to the big screen. Bonne S."}, {"id": 316, "text": "Watching this movie I kept asking myself; what the h... is Bruce Willis thinking appearing in someways awful las this?There are very few redeeming features and I would advice anyone to stead wide of this movie, even though it features Bruce Willis."}, {"id": 317, "text": "Saw the movie and hope to end quickly for the sake of my estes.Bad script and plot... The action scenes very poor. Looks like a movie made from rockies... One star more by bring Bruce Willis in to action movie."}, {"id": 318, "text": "I'm very apathetic towards this is film. It is very low budget but that isn't the worst part of this film. This honour goes to the script which is idiotic at times. For instance, Sasha Zindel's (Natalie Eva Marie) brother dies in the shootout and she is understandably mad in one scene and then in the next, after she has an exchange of dialogue with the leader Derek Miller (Jesse Metcalf), she is talked around and listened to him as though he rung a bell &amp; she is one of Pavlov's (conditioned) dogs! I think seeing Pinocchio turn from a wooden toy into a real boy would have been more believable that this storyline.Plus the antagonist hires a team that fires about a thousand bullets &amp; none of them come close to hitting the protagonists. That's clichéd and it is almost as bad as enemies in any of those Rambo films. I was waiting for the main character to say, before he beats the main antagonist it's miller time &amp; the sad thing is that it wouldn't seem out of place in this film!Poor Bruce Willis is a shadow of the A List star that he used to be... This is another example of his film career sinking further into the black hole of obscurity. It is like watching Mohammed Ali fighting into his 40s when all his fight had left him... This is like a poorer version of the Expendables that looks like a classic film compared to this train wretch of a film."}, {"id": 319, "text": "Yet another movie with Bruce Willis only present to cash a check. He does not care about anything in this movie. It is as if he read the lines tem seconds before shooting (and this might be the actual case as he must be paid by the number of seconds he spends on the set). Film makers just wanted to have him to make money as well, that's why even if his role is insignificant he gets the largest picture on the poster. And every fan of Willis goes to watch this. So for real, this movie is not about Willis, forget any expectation. It is about a group of younger actors trying to defend a project or whatever. There is some action, but it is not consistent. The only good thing in my opinion is the soundtrack. But the rest, acting, direxting, editing, production, location... I give Hard Kill a score of 5. It is watchable, but it is a mess. I would give a higher score if Willis was not in it."}, {"id": 320, "text": "What an awful movie. It makes you wonder why Bruce Willis wants to end his career doing bombs like this. Just about the entire movie set is an abandoned factory or warehouse complex. The bad guys are ridiculously pathetic. The plot is ridiculously thin. The movie is so stupid it's almost comical."}, {"id": 321, "text": "Worst movie I've seen in a long time. Writing was pretty horrible. Action was slow. Acting was cheesy and forced. Followed the blueprint, I guess, but failed in every category. Would never recommend."}, {"id": 322, "text": "Worst movie since Death to Smoochy. Way below everyone's standards. Waste of film, and time"}, {"id": 323, "text": "The shoutouts are horrible! Bullies don't bounce off wood, or create sparks on bricks."}, {"id": 324, "text": "I haven't seen such a mess in a long time. Acting - abysmal Location - low budgetDo not waste your time."}, {"id": 325, "text": "Low budget movie, bad actors, weak story. dont wast your time. This movie will ruin your day."}, {"id": 326, "text": "I have no words for describing my feelings while watching this film. A poor acting in the 90's action movies style😢"}, {"id": 327, "text": "It didn't make any sense from the very beginning. Awful movie. Not even good to have playing in the background."}, {"id": 328, "text": "The performances by everyone including Willis are wooden. It's difficult to keep one's interest even though the plot had a lot of potential."}, {"id": 329, "text": "The worst acting I've seen in a long time. Only thing that saved this movie was doing dishes n laundry. Total bust."}, {"id": 330, "text": "After 10 minutes i felt Bruce Willis owed me money. Worst film in years. Should be called Hard to Watch. No plot, no acting, painful to watch."}, {"id": 331, "text": "Just finished watching The Punisher then I watch this checked box garbage."}, {"id": 332, "text": "Holy cow. The worst movie I have ever seen. 0 stars. I do NOT recommend. Terrible terrible acting. Zero direction."}, {"id": 333, "text": "Most of these actors in the film make it look like the first time they've ever acted. It's atrocious."}, {"id": 334, "text": "With a reality tv soundtrack, the only thing worse than the pathetic acting is the armature directing and writing. Filmed like a reality tv show remake of a b movie rip off of an 80's action movies with out the action, or movie included. Nonsense prevails, we gotta move, this area is hot, they know where we are! ok I have a plan what is it chief? I'll run out by myself, you all close the door and hide here (nods approvingly at the brilliant plan). How the producers and director swindled everyone involved in the making of this pile of garbage is beyond me. This screenplay should have stayed in the grade school notebook it was found in and the director banned from making another film for life."}, {"id": 335, "text": "Garbage script, garbage direction, just garbage. A lot of standing in the middle of a room to fire a weapon. Just terrible and cliche. Very disappointed. The monologues are so droning and overplayed. Very weird camera shots combined with terrible acting."}, {"id": 336, "text": "I'll make this short and sweet. Willis should retire or make kiddie comedies. The acting and plot was far beyond terrible."}, {"id": 337, "text": "It makes me wounder for how long they are going to make such a stupid total cliche movies, with lot of nonsensical words explaining science and illogical plot?"}, {"id": 338, "text": "Boring and a constant repeat of bad acting and script for 90 min"}, {"id": 339, "text": "If you want a low-mental input/output shooter flick, this is probably it. It's predictable, dialogue is corny, and you would assume that the bad guy could afford a better legion of goons. They look the part but are tactically inferior in every way to a merry band of brothers (and sister). The good guys' prowess at 1-shot-kills helps them conserve their ammo although severely outgunned and outmanned, and luckily they are almost invincible. The pray and spray method seems to work well on the one side and not so much on the other side, but hey.This movie leaves a lot to be desired, but it's semi-entertaining."}, {"id": 340, "text": "At first I thought I was watching bad actors. After Bruce Willis made an appearance I realized its everyone in the movie. Bad directing? Bad script? Bad everything? Yes.I tapped out after 20 minutes."}, {"id": 341, "text": "Where do I start?! Boring plot, if it even had a plot. All actors, including Bruce, were terribly dry, as if they had no energy. I've seen better acting in most commercials. Don't waste your time."}, {"id": 342, "text": "Terrible, unbelievable shoot-out scenes. Bad script. Forgettable acting. It's hard to understand why some reviewers have given this loser movie ratings over a 3."}, {"id": 343, "text": "It's a sad day when you see Bruce Willis in a DOG like this ! Barely made it thru the first 20 min"}, {"id": 344, "text": "This movie was quite horrible! I could not finish it. Bad acting, bad story... just bad!"}, {"id": 345, "text": "I should get an award for making it 34 minutes in before turning it off. The camera work, dialogue, acting, casting, and every other facet of this film must have been controlled by either a first time director or a 12 year old that was told he/she had real talent (spoiler alert: they lied)."}, {"id": 346, "text": "Bruce Willis, movies just to epic, not anymore. With all the competition trying to be number one. Movies are becoming clueless."}, {"id": 347, "text": "The only thing good about this move is Jesse Metcalfe"}, {"id": 348, "text": "I will say this, they managed to leave no cliché unturned. Who made Bruce Willes wear that giant gay scarf?"}, {"id": 349, "text": "This is one of the worst movies I've ever watched all the way through. I wanted to bail, but my wife talked me into watching the rest of it. The script was terrible, the directing was horrible, and most of the acting was embarrassing. If the budget was more than $1000, they got ripped off."}, {"id": 350, "text": "I feel like I have a pretty high threshold for bad movies, especially when I'm bored and just watching something in the background off of Netflix. This was soooo bad though that I was ready to give up 2 minutes in. I made it half way through before actually giving up on it.The writing is horrible, the acting is horrible. It's like robots delivering one bad line after another."}, {"id": 351, "text": "Interesting premise, but an absolutely terrible execution. Had to force myself to watch until the end."}, {"id": 352, "text": "Probably the worst movie made in the last decade. Whatever the writers,directors,producers were smoking....I want some of it. Acting was atrocious...and I'm being kind. Bruce Willis was in la la land and must of thought he was auditioning to be the head Zombie in the Night Of The Living Dead...Bruce, please retire already !!"}, {"id": 353, "text": "I know people don't watch these type of movies for the acting but for the action but there was not much action and where there was it seemed to just be thrown in. Bruce Willis seemed to be doing a cameo in the movie. How low is his career to be in this film. It looked like grampa being wheeled from scene to scene. Usually action scenes cover the sins of a Bruce Willis movie but this was nonredeemable.."}, {"id": 354, "text": "I didn't think the movie was all that bad, except for the one huge mistake so many directors make in todays movies. I wonder how many civilians really think the military personnel just stand around screaming at each other. If you were in a hot zone and was screaming like that, one of your own people would cap you. Think how much scarier that bad guy would have been if he had just warned someone, then smiled and shot them."}, {"id": 355, "text": "Where do I even begin?!The first few minutes are not bad till the characters start to speak. Then it goes downhill so fast. Then comes cliches after cliches.This could have been a better movie if they had just shot Bruce Willis in the first 5 minutes. Then they wouldn't need the remaining 90 minutes."}, {"id": 356, "text": "The acting was so bad I couldn't get through 15 minutes especially the actress who played Sasha. Was she reading her lines? Is Bruce Willis this desperate for work? This was just bad."}, {"id": 357, "text": "I am not sure which was worse- the bad dialogue or the bad acting. I usually enjoy Bruce Willis movies (which is why I watched it), but this one was a stinker."}, {"id": 358, "text": "Other than Jesse being a blessing for the eyes and Bruce aging like a fine wine this movie is a waste of time. The script is dreadful and the acting was cringeworthy. Too many dumb parts as well. Like the night goggles. Were they necessary when it wasn't even dark?"}, {"id": 359, "text": "Where to begin. Terrible acting throughout and sharpshooters who never hit anything. Oh, and plotless."}, {"id": 360, "text": "The backstory was non-existent. These 4 mercenaries decide to do this job as a favor to an old friend.This device was a computer program of some sort which can take down planes and destroy financial records? It was protected by a fail safe code that was like 8 characters.The Asian techo girl was all in and then 10 minutes later ran away.I think about 20 of the bad guys were killed and only 2 good guys died. But you never saw any of the bad guys faces (except one) as they all had face shields on.The dude with the Rubiks cube was unsolved and suddenly solved in seconds.No character development. 95% of the movie was shot in a single location. 3 % in a Limo and 2% in a bar. The bar scene was actually not too bad."}, {"id": 361, "text": "Bruce Willis has officially moved into that territory of waning former stars who do 3 days work on a low budget movie and get a star billing.Stallone, Schwartzenegger have gotten there long ago.The only thiing missing is a filming in China or Europe. This one is in Ohio for some godforesaken reason.The plot has been done a million times before. Only this one has horrible writing, amateurish directing and really bad acting. Willis reads his lines as if he was just handed the script seconds before the camera was turned on. That's probably the case. It's THAT bad."}, {"id": 362, "text": "Bruce really went off the deep end. Getting 10 no name actors and then one super star was probably their downfall. My poops have more talent."}, {"id": 363, "text": "Saw Bruce Willis, thought it would be good. Wasn't much else on Netflix at the time so what the hell right? Well, my mistake. Movie started rough, thought it would get better. Nope, it didn't. This film kills brain cells and causes infertility. Not for human consumption."}, {"id": 364, "text": "Stupid story, why meet in an abandoned factory ? And really 5 guys against an army and the army is really bad a shooting :)"}, {"id": 365, "text": "Don't know why I started watching this. I saw the snippet and Bruce Willis' acting was really bad there already. Think it was probably the nostalgia thinking it would be something close to die hard. No way jose. This is as bad as it gets."}, {"id": 366, "text": "31 minutes into the movie and acting is so bad. OMG. also Bruce Willis doesnt do much in the movie. He is just there to promote it i guess and make you watch it thinking he will play a big role. Pathetic acting, dialogue and story"}, {"id": 367, "text": "Bad acting, unrealistic story and very low budget scenery, do yourself a favour and save your money!"}, {"id": 368, "text": "Willis can't break the formulary mold... yawn. Figured out it would be a rehash of a rehash of a rehash... perhaps Bruce ought figure it out... with age actors fall into the trap of acting in a habitual comfort zone."}, {"id": 369, "text": "This show is terrible. The dialogue could have been written by a high school student at his first attempt at writing a screen play. Even Bruce Willis fails to bring anything to the screen. The action scenes are ok but aren't enough to get the movie anywhere near watchable. And this guy Sergio Rizzuto ? Who the he11 is he and where did he come from? He's probably the worst thing about the movie. He's like somebody off the street that has never acted before and given a major role in the movie. Sergio is probably the worst actor I've seen in years. Don't waste your money or your time with this dog. I got the movie off a torrent site and i won't put put it on my media server - it's that bad"}, {"id": 370, "text": "I cannot believe Bruce Willis was actually in this. The acting is not good at all. The gun battle scenes are terrible, why didn't they hire someone who can shoot or at least handle weapons to see how it's done? You cannot shield 10m from automatic weapons behind a 20mm upturned wooden table, From the fake blood to the bullet splats to the ridiculous plot it's all so bad. Sorry I was so disappointed it's terrible."}, {"id": 371, "text": "The script is all cliché with no sort of detail whatsoever. The actors seemingly know it's a bad script, it all seems stiff.I think this is anti-socialist propaganda. Whoever wrote this film clearly doesn't care much for action movies."}, {"id": 372, "text": "One star because Bruce Willis got paid and I like Bruce Willis."}, {"id": 373, "text": "Wow Hard Kill. Nobody pulled a hammy coming up with that title."}, {"id": 374, "text": "Decent movie to see some blood, but not good actor"}, {"id": 375, "text": "Willis phones in his performance and the rest are horrible. Every player wins the Imperial Sormtrooper award for being unable to hit a target at any range and all weapons can apparently hold hundreds of rounds.Would need to improve significantly to be crap"}, {"id": 376, "text": "So it started 4 minutes in. Even the sound effects are d grade thanks to the sound stage for making this movie worse. The intro is terrible and the screen play is very amature and the plot is almost non existant. The acting is terrible especially from Bruce Willis. When did your career go so bad.Probably a good movie for a first or second year film major at college but other than that an all round terrible movie. Dont pay for it. I was gifted it by my streaming service and I still want my money back.Hollywood it ain't. Dont know if I can make it the whole way through. One of the worst movies I have ever seen.On the plus side the lighting and the camera work is quite good thats the only bonus."}, {"id": 377, "text": "This movie has nothing to watch, bored. Stay away..."}, {"id": 378, "text": "Set in one derelict building with no script or flare. So bad I will be asking for a refund. Dreadfull plot that is shallower than a summer puddle. Providers should have more pride in their service than to offer this as pay per view. The only good thing about this film is the fancy cover that makes it look like a real movie."}, {"id": 379, "text": "Trauma Center director Matt Eskandari's formulaic bullet-riddled actioneer Hard Kill, the latest disposable Bruce Willis straight-to-video release, might amuse Escape from L.A. writer &amp; director John Carpenter. This standard-issue thriller with a double-digit body count focuses on a doomsday computer program which can be used as a devastating weapon to reset civilization as we know it to a state of barbarism. Mind you, Snake Plissken (Kurt Russell) succeeded in pulling off this stunt at the end of Escape from L.A. (1996), when he refused save the world from a similar disaster. Indeed, he succeeded in doing what the chief villain in Hard Kill, the dastardly Pardoner (Sergio Rizzuto of Green Rush), has spent two years planning. Willis portrays a billionaire tech mogul whose brainiac daughter, Eva (Lala Kent of 10 Minutes Gone), has concocted a two-quantum computer artificial intelligence program designated as Project 725. Meantime, the depraved Pardoner yearns to activate this proprietary program. Wiping out every computer in the world with it, he wants to level the playing field and incite global anarchy. Interestingly, the filmmakers modeled the villain after the character of The Pardoner in medieval author Geoffrey Chaucer's landmark literary masterpiece The Canterbury Tales. Chaucer penned this collection of satirical stories back in 1392, and they were published in 1400. Surprisingly, Eskandari and scenarists Joe Russo &amp; Chris LaMont, who adapted the story by Clayton Haugen and Nikolai From, have done a contemporary take on Chaucer's The Pardoner.Although Project 725 was designed initially to help society, The Pardoner corrupts its use. He exploits it as a weapon to annihilate all technology, primarily supporting combat, communication, and financing to forge a new world order. No longer will armies thrive on the digital components integral to their sophisticated defense systems. Wars will be waged as they were in the 1800s. Communication satellites will be obsolete. Men will see only as far as the aircraft they fly, the ships they sail, and the mountains they scale. Financial institutions will revert to 19th century banking practices. Nevertheless, bigger nations will enjoy manpower superiority over their smaller rivals. Similarly, those larger nations will still boast more cannon fodder in the form of troops to sacrifice on the battlefield. The Pardoner wants to destroy a society he denounces as sick. Paraphrasing Chaucer's Pardoner, he asserts, Greed is the root of all pain.Wealthy tech mogul Dayton Chalmers (Bruce Willis of Die Hard) hires seasoned ex-soldier Derek Miller (Jesse Metcalfe of Desperate Housewives) and his mercenary team to foil The Pardoner. Historically, Miller and The Pardoner are sworn enemies. During an earlier job, The Pardoner shot Miller in the back and left him for dead. Miraculously, Miller survived. Now, an old African American military chum, Nick Fox (Texas Battle of Coach Carter), who saved Miller's life, introduces him to his boss Chalmers. In the CEO's luxurious stretch limo, Miller seals a deal for his fellow soldiers-of-fortune: Harrison Zindel (Jon Galanis of Aftermath), his purple coiffed sister Sasha (former WWE wrestling sensation Natalie Eva Marie) and Dash Hawkins (Swen Temmel of Backtrace), to safeguard the company magnate when Fox and he inspect a derelict factory Chalmers may renovate for his company. Little does Miller know Chalmers and Fox haven't been entirely honest with him. When they arrive at the factory, a rambling complex of brick buildings with a looming clock tower, Miller and company discover Chalmer's life isn't the only one at stake.Simultaneously, an army of black-clad, heavily armed henchmen accompany The Pardoner to capture Chalmers. Furthermore, Chalmers informs Miller and company that the evil Pardoner has abducted his daughter. Truth is Eva Chalmers aligned herself initially with The Pardoner to test Project 725 in the field. Chalmer's company Chapter House prohibited them from testing it. Sadly, the father and daughter haven't seen eye to eye, but at the end of the day, they change their minds. The Pardoner needs Dayton alive because Project 725 requires his fail-safe access code along with Eva's to trigger this budding technological nightmare. The Pardoner orders his armed henchmen to occupy the factory. Miller and his team whittle them down, scavenge their weapons and hardware as a part of battlefield salvage, and then use them against them. During the fracas, Eva escapes from the Pardoner and rejoins her father, which overjoys him. Earlier, Eva had quarreled with The Pardoner when he abused Project 725 to crash a jetliner. Meanwhile, treachery lurks within Miller's own ranks and divides them. A lone dissident seizes Eva at gunpoint. He tries to use her as a bargaining chip to win over The Pardoner. Naturally, the Pardoner cuts no deals and leaves him sprawled on concrete with a bullet in the belly.In their third collaborative outing as director and star, Eskandari and Willis fare less successful with this potentially provocative potboiler. Their previous film Survive the Night qualified as an above-average thriller, with Willis confined to a supporting role while Chad Michael Murray took care of business. Now, Willis loiters on the periphery of Hard Kill, while Metcalfe takes a stab at playing hero. The scene where he goes on a rampage slashing and gashing several adversaries is as lively as it gets. Unlike Survive the Night, Hard Kill qualifies as mediocre because The Pardoner makes such a lackluster enemy. He neither chews the scenery enough nor infuriates us as the typical egotistical villain should. Any time a movie villain poses a less than genuine threat to either the heroes or the audience, you know the outcome isn't going to be in doubt. Despite the greater number of gunmen at his disposal, The Pardoner learns from his second-in-command that they have underestimated Miller and company. Predictably, the villain's henchmen turn out to be sloppy shooters and spend more time getting shot. At other times, those henchmen are just plain complacent. The heroes do suffer casualties, but the villains are easier to kill. Ultimately, Hard Kill relies on too many clichés to be original."}, {"id": 380, "text": "I created this account just to leave this review. Don't believe anyone who rated this movie over 3 stars. You probably should be mindful of other reviews these people post.. not sure.. wait, do they get paid? Ofc they do! Anyhow... What i was about to say? Ah, the movie deserves 1 star and the star goes to amazing comments everyone is posting here. Seriously had such a laugh reading them just after watching this piece of *art. Comments like: Who pays for this; was this ment to be satirically and many more made my day. Also these are the things that never leave your mind while watching it. Seriously, how can a script be so bad, that ANY child would have made it better with a bit of imagination? You could have made it better, me, my grandmother or an octopus in a fish tank randomly selecting things to put in the movie. And my god why is Bruce there? Is he having a blast? Maybe it is like a joke to him... But couldn't he have suggested couple of things while shooting this movie to the director..? Something like - don't say that - it has been in every single garbage movie! Don't do that - it has been in every single garbage movie! If the script would have been written on a napkin the day after drinking - as someone suggested - it would have been much better than this. I can't imagine anyone who has seen at least one decent action movie in his life - would come up with this crap. It is like these people have never seen an action movie and think that this is so cool what they are doing! Hahah, It is little bit funny now after i watched it how terrible movie is, but man i was angry when watching it. Why?... Why?"}, {"id": 381, "text": "I don't know what made me cringe more, the awful dialog, or the cardboard acting. Even Bruce Willis looked wooden. I was looking for the biggest plank actor in the movie, I think Sergio Rizzuto just marginally beat Natalie Eva Marie to the title.Throughout the movie the dialog was so pathetic it made passenger 57 look professional. Jesse Metcalf tried is best to hold up the rest of the muppet crew, but this is the worst movie I've seen in years, and I watch B-movies. Watching it in 2020 during lockdown just made it a fitting watch for anyone with depression - you're too numb to care.The plot is so thin and dragged out I was skipping minutes just to get to the next stage of the plot. As for the combat scenes an the military bravado with such experts in the field, my 5 year old does better scenes with those mini plastic soldier figurines.All in all, it was dire."}, {"id": 382, "text": "So, a doctorate from MIT in comouter science who write the world's first AI program on a quantum computer that's only as big as a HDD, goes ahead and gives the program to the terrorists to test it in the real world because she was pissed at dad that he wasn't letting her test it in his own company. Also, she had set out with a mind to make the world more equitable, so you can imagine how stupid that decision can be from someone who's so gifted. And this isn't a spoiler, because this is where the movie starts, the first scene.None of the actions seemed to follow any logic. Veteran SEALs are jumping out of cover to pop at bad guys. Leaving the bodies of their friends behind when they are going away at the end, whereas all through the movie they were hell bent on friendship and having each other's six.I don't know if the writers ate some weed cookies and wrote the script or what but, by the half time, the movie had become a chore to finish, coming from me that's something. I let the movie play in the background just to see if it can redeem itself and it only gets worse.The hero is parroting throughout snout getting his revenge and shooting the the villain and he doesn't even get that chance. I mean WTF?They have Bruce Willis in the cast but they might as well have hired Danny deVito for the job, because he doesn't do anything in the movie, no action scenes at all."}, {"id": 383, "text": "This is a poor movie for so many reasons.I knew it was going to be subpar. The only reason I even watched it was because Bruce Willis is in it. Going in I knew it likely insisted on a one day shoot (and a large) check to do maybe 10 min of screen time. But that's par for course with him these days so that was expected.What wasn't expected was how many times they need to reference the project; again, and again, and again - by its full name. That's not how people communicate, especially in the middle of a fire fight.Then there's how everyone needs to go by code name. And again how many times again and again. It's like a cliche 80's movie or something.Why are people using night vision goggles in what's clearly broad daylight?Why are professional soldiers moving around like a 3 year old learning gymnastics.The dialogue in general is bad. Like real bad. And there is so much of it. But with so little action they had full the movie with something.Let's not even talk about how there is only ONE location for this entire movie."}, {"id": 384, "text": "Now I don't mind brainless action or even films that have no substance. I can watch pretty much anything &amp; being an 80s child I have a space in my life for nonsense action films with a nostalgia for Van damn, Arni &amp; co so when the Mrs works nights I use that time to watch the trash action stuff that isn't a shared guilty pleasure.This is the single worst film I have ever seen...... ever. The acting is just atrocious which I can only assume is down to the fact every person working on the film must have known just how bad it was.Everything about it is just bad. Now I can watch these type of things sometimes &amp; just enjoy &amp; laugh at how bad they are &amp; still enjoy it but this is just something else. It's soooo bad you can't even enjoy how bad it is.Seriously just don't bother. Trust me this is just POOR. Everyone who worked on this must be so ashamed."}, {"id": 385, "text": "For starters, just awful. don't waste your time nor your aesthetic sensibilities. I did both of those for you.As I endured this, it took only about ten minutes to arrive at the following conjecture as to the provenance of this film. It may not be correct, but it might as well be, to give you a sense of hose bad this film is.Step 1: A cool old, defunct factory is noticed. Step 2: Someone says, This could be used for an action movie. Step 3: His buddy says, This MUST be used for an action movie. Step 4: A question arises, What kind of action movie is all about a building? Step 5. The answer is obvious, Die Hard movies! Step 6. We can use that name. Step 7. Let's call it 'Kill Hard'....see what I did there? Step 8. Probably can't, but how about 'Hard Kill? Step 9: How about we have junior college kids write the script? Step 10: Yes! Ones who have never even seen a movie gunfight, let alone know anything about realism in that regard. and then, the one brilliant, impossible to comprehend achievement of these Einsteins:Let's [somehow?] get Bruce Willis to be in it!The only way they did that that I can think of is that they kidnapped the actor's daughter just like the script has the character's daughter kidnapped to motivate absurd behavior."}, {"id": 386, "text": "I cannot imagine a worse movie.There is no build up. The lead is asked one minute to help and the next minute they're all in a warehouse under siege.They don't know why they're there and even when they find out, it means nothing to anyone with half a brain. They're protecting a computer that can either save or destroy the world. No explanation of what it's saving the world from though. Apparently it can make the government more efficient.My favourite part is when the bad guy, in the middle of a warehouse based gun battle scene, ties up Bruce Willis whilst doing a Rubix Cube and drops it on the floor, completed. Although in the next scene it's not quite finished. Why did he have a Rubix Cube with him? Anyone?!The entire film is absolute dross. Willis plays virtually no role in it at all. I cannot believe for one minute it took in more money than they paid him to feature.Avoid this film, unless of course you have endless time to kill at the moment, like me!"}, {"id": 387, "text": "The entire first 30 minutes of this movie seem to imply that there was information that we should already be aware of before watching, with character names being introduced with no context and past events being spoken of as though we already knew about them.The dialogue is clunky as though the actors are trying to remember their lines and the conversation between characters is unnatural as if they're not quite sure where their conversation is going.The plot also makes no sense, the bad guy is pointlessly offering time for them to surrender while also saying that he can over run them at any point. I seems that someone is trying to build up the suspense to a large fight scene yet nearly an hour in and that still hasn't happened.The actors all seem capable so I suspect the director is the one who can killed hard kill and Bruce Willis would have been wise to keep his name away from this one."}, {"id": 388, "text": "Bruce has been an entertaining fella over the years. Cheese/action/thrillers. 6/10 for acting skills. He made movies to sit and eat 3 bags of potato chips and a 4 pack of beer to. This movie (only classed as a movie as its a motion picture, and for no other reason) is devoid of any sense to the story (I had to go Google what was supposed to be going on within 10 minutes after and rewinding three times). It lacks any sense of reason, acting ability across the cast (including the main man himself) and is basically a total waste of everyone's time and money. In all, must be a devastating blow for those whose careers might depend on it's success. That includes all those listed in the movie credits. Big Bruce is ok because he has millions to fritter anyway. Sad. The money from paying those actors would be better spent on feeding the poor or something - I bet that video would make $more. ..and we would be blessed without it. A dreadful piece of media which should be avoided, even curiosity is not enough to warrant you wasting more than a minute on it. Its not even suitable to be described as a B-movie - I actually like those a lot."}, {"id": 389, "text": "I don't know where to start but that's ok, because neither did the writer. The set up is hurried and before you have time to think, you are plunged into an 80 minute shoot at a disused factory that just loses all sense and structure. There is nothing good in this film. Nothing. What there IS, is endless poorly timed and misjudged cliches piled on top the last, plot holes all over the place and the most one dimensional characters imaginable. The bad guy was clearly excited by the idea of playing opposite Willis and did his best attempt at being all Alan Rickman, minus the charm, screen presence, sneer or any kind of acting skills to draw upon. The lead guy was clearly excited to be playing alongside Willis and spent most of the film dragging up pastiche takes on McLean from Die Hard...except you just don't care. At some point someone asks, Have finished making your funny little speeches? and you have to wonder if this was actually a comment from a passing screenwriter horrified at what was clearly wasted studio time. Willis himself flitted between tired and bewildered to flattered and ego-massaged that a film could be entirely devoted to attempting to (and failing to) emulate any number of his 80s and 90s films. That the film felt overlong at 90 mins tells you all you need to know."}, {"id": 390, "text": "Disappointing. While watching the almost cringeworthy film I tried to figure what exactly what is causing it to be such a fail. Story line was bad, acting was bad, sound could have been better, but I think the biggest issue was in the directing of the film.The actors just didn't look that comfortable, almost as if they were given their lines on the day of filming. and there seemed to be holes in the story, some badly written lines, and inconsistencies too. Maybe they had a very limited budget and tried to cut costs by missing any preparations.But even if they got these things right, much of film was Bruce hiding away from the bad guys, which just felt completely wrong.This film should not be sold, needs to be deleted! it's going to waste a lot of people's time and just put tarnish on Bruce Willis's name."}, {"id": 391, "text": "If you want to have more fun than watching this movie you could go to your dentist and get your wisdom teeth out,, or you could clean the toilets in your house, or . . .I am an action movie junkie and I have to tell you that even when a critic rates a movie as scoring pretty damn low I still enjoy the movie. I must be a simple man as most action movies get and keep my attention all the way through. And I love so many of Bruce Willis' movies.But, as so many of the reviews here read, DO NOT WASTE YOUR TIME! Go watch Bambi or The Sound of Music. Within 10/15 minutes of starting this movie I stopped it and went to something else. My wife couldn't believe it. She knows what an action moved nut I am. The next day she actually had me switch it back on and finish it because she was certain it couldn't be that bad. IT WAS WORSE THAN JUST BAD!!So next time you want to do something enjoyable go rake leaves or shovel snow or change somebody's flat tire."}, {"id": 392, "text": "For the actors, many of whom it's only their second or third acting job, congrats on getting a movie made. Seriously. It's not easy to do. Keep working on your craft.Unfortunately, the movie completely skipped over the backstory of what makes the characters interesting so the actors were doing the best they could with a terrible script. They go straight to what should have been the tipping point and onto the climax. As a result the acting isn't believable or entertaining.Without looking I could tell you the one girl was a WWE Diva in her first movie and most of the guys straight from Daytime Soaps. Sadly the best acting job was from the Bravo reality star with a handful of lines. I'm still trying to figure out why most of the audio sounds like it was taped in Bruce Willis' bathroom.Only watch this movie when you've run out of other options"}, {"id": 393, "text": "Hard Kill was directed by Matt Eskandari, written by Chris LaMont and Joe Russo, and stars Jesse Metcalfe, Natalie Eva Marie, Bruce Willis, Swen Temmel, Sergio Rizzuto, Texas Battle, Jon Galanis, Lala Kent, and Tyler Jon Olson. It is about a team of mercenaries who are hired to keep a program developed by a billionaire CEO safe from a terrorist sect who want it for nefarious reasons.Plotting is mediocre and never strays far from the generic action handbook. After Project 725 is handed over to a terrorist called the Pardoner (Rizzuto), billionaire CEO Chalmers (Willis) and Fox (Battle) recruit Miller (Metcalfe) to defend Chalmers and activation code to it in an abandoned warehouse. Miller gets his old friends Sasha (Marie), Dash (Temmel), and Harrison (Galanis) to assist. Once the group get to the warehouse they find out that the Pardoner and his men, including Colton (Olson), have Chalmers' daughter and is coming to the warehouse to get the code, using Eva (Kent), Chalmers's daughter as bait. After the mercenaries refuse to surrender Chalmers, the Pardoner launches an assault on the team and they are forced to defend it.Characters are unbelievably bland. Miller, an already mundane last name for a protagonist, has little to offer. He is a sucker for family woes and was previously in the military but after taking a bullet in the back from a prior encounter with the Pardoner he was sent home and became a mercenary. This previous encounter is only mentioned in passing only to establish the Pardoner as a known threat, and it never means anything in the grand scheme. Sasha is even more uninteresting, having no traits to her aside from her blue and purple hair, and that Harrison is her brother; although it never feels like it during interactions between the two. Harrison himself is a blank slate, literally having zero impact on the story or the action. Dash is the cracking member of the group. I refuse to add 'wise' before cracking because he just spits lines that have no place in the script. Fox is merely the segue into the plot. That is it. Chalmers is similar, having little presence in the movie and only serves to allow the action. The Pardoner is a mish-mash of every bad guy cliché in the book: he wants to burn down society, he has no use for money, he offers Miller a spot by his side, blah, blah, blah. Performances are mostly awful, Metcalfe and Marie are trying with flaccid material, and Willis is a coin toss, only putting in some effort in every other scene; and everyone else is just awful.Action is dull, leaving little lasting impact bar a few moments towards the end, literally and figuratively. A low budget forces the blood to be blatant CGI, and the bullets have no punch, with no holes in the material they land on or the people they perforate. Shootouts are poorly shot, with little energy in the movements of the camera and the on-screen participants; and geography is nebulous at best. Characters travel from room to room, but aside from a few overhead shots of the warehouse itself, the audience is left to wonder where things are happening in relation to others. The warehouse location provides little in the way of visually or contextually stimulating action regardless of the camerawork. Since the place has been long abandoned, there is little left to integrate into the action aside from old filing cabinets, long hallways, and cardboard boxes. Humdrum.Technically the movie is weak and clearly shot on the cheap. As mentioned before, nearly all of the impacts of bullets and the blood is shoddy CGI, but what might be worse is the muzzle flashes from the guns as they fire. In some situations the whole edges of the frame become yellow with the firing of the weapons, if this is a design decision it was a bad one, and if it was a rendering issue in post-production it would not be surprising. Direction is uninspired, it is as if Eskandari was told to shoot a bunch of scenes that would be commonplace in an action/thriller and then the producers cut them into a feature length project; and this is coming from someone who enjoys the director's other work, with Survive the Night being a recent favorite of mine.While Hard Kill is never uninteresting enough to turn off, thanks to commitment from Metcalfe and Marie to the material and Willis's occasional effort during scenes involving him; it relies too much on clichés, a bad MacGuffin in Project 725, and weak action barring a few moments to be worth the time.36/100"}, {"id": 394, "text": "Derek Miller (Jesse Metcalfe) is haunted by a video game (I mean battle PTSD). He is hired by tech entrepreneur Donovan Chalmers (Bruce Willis) to retrieve a tech developed by his daughter Eva. Bad guy The Pardoner intends to use it to wipe out the world's financial data.This gets off to a bad start right away. Metcalfe wakes up haunted by his war experiences. His flashback turns out to be CGI which looks like a video game cut scene. It pulls you right out of the movie. The sad thing is that it could be solved easily. I could take a half decent camera and a few soldier extras out to the woods, and come up with something amateurish but functional in that dream sequence. A video game scene is the last option of a lazy filmmaker. That's the problem here. It seems that somebody got an abandoned industrial complex and shoved a leftover script into the place. It's a lot of shoot them up, a generic meaningless script, and a meandering narrative. The action is not particularly good. Neither is the acting. The writing is worst. It's a B-movie without aspiration to be any good."}, {"id": 395, "text": "Garbage doesn't even begin to describe this poorly written, terribly acted, low-budget disaster. We found this movie because it was trending on Netflix and that must have been some sick joke.The only redeeming quality of this movie is how much fun you can have picking apart every atrocious plot twist, cliche line, and nonsensical scene.How is Bruce Willis in this movie? Was the gun pointed at him for the majority of this movie actually loaded the entire time?You could have told me this movie was written by a high school sophomore English class and I might have believed you. But even those scripts exercise more creativity than this tire fire.Gives The Room a run for its money."}, {"id": 396, "text": "This is pretty much what Bruce Willis does these days, he is not even hiding it, he will take a paycheck for anything. So more often than not, he appear in these very low budget action movies for a small supporting role, almost an extended cameo.But by then i am aware of it and don't really care, i don't watch for him per say. This movies had a decent trailer so i was interested, also it star the former WWE wrestler Eva Marie wich is very easy on the eye so well ...Ultimately the movie ended up a disapointement, the plot is minimal, and the setting up on why they end up at the location the movie happen make little sense. The pace is slow, a lot of boring gun fights, not enough hand to hand action to make it interesting. Even The Marine sequels wich were often very low budget and confined to small locations were more dynamic. If you want to see someone do something great with minimal budget watch movies like Avengement (Scott Adkins) or I Am Vengeance (Stu Benneth). Actually thinking about it, I Am Vengeance 2 has a very similar set up in term of location but there is so much more action, the movie is so much fun.That being said Hard Kill is not unwatchable, its just a tad boring and uninspired. I don't recommand it by any means but i don't suggest to avoid it either. Depends on how you enjoy low budget action flicks..."}, {"id": 397, "text": "Sometimes with reviews takes those direct to DVD films to seriously sometimes because I thought to myself when I saw movie it wasn't that bad at all I have seen tons of bad very bad direct to DVD films like this and I have seen worser Bruce Willis films like this believe me worser Bruce Willis films were The Prince, Rock the Kasbah, Precious Cargo, First Kill, Marauders at least I enjoy it for cast and actors but still film sucked, Once Upon a Time in Venice, Glass is not direct to DVD films but at least this film is better then Glass that was related to Unbreakable and Spilt at least his direct to DVD films are better then Glass it sucks to see Bruce Willis career in direct to DVD I would love to see him in bigger budget films but he has like been in theatrical film release Death Wish (2018) my favorite film but then with Glass sadly it's last one then to Motherless Brooklyn I want to see him more in Theatrical films release in theater then his direct to DVD films. I would say I liked this film better then Survive the Night just because it's faster peace and more action is happening witch Survive the night is mix of action more thrilling. story follows Derek Miller (Jesse Metcalfe, Desperate Housewives, Escape Plan 2 Hades) who use to be soldier now he is a mercenary then suddenly a mysterious billionaire who seeks out ex-Special Forces operative turned mercenary Derek Miller The work of billionaire tech CEO Donovan Chalmers (Bruce Willis) he hires Mercenaries toprotect it tech CEO you have other Mercenary's. like Sasha Zindel (Natalie Eva Marie), known for WWE reality series Total Divas, she did not bad as actress I wouldn't say the best but she did fine but because she is hot but she wasn't at least pointless, annoying or anything like that. Harrison (Jon Galanis) and Dash (Swen Temmel), assuring them of a generous payday for an assignment he promises will be strictly VIP protection. they go to for protection while visiting an abandoned factory suddenly hell broke lose a terrorist group kidnaps Donovan daughter Eva Chalmers (Lala Kent) just to get CEO tech that has millions of dollars in it system. and yet again for 90 minutes slaright it's action goes forward I thought acting was good and it wasn't over top Bruce Willis doesn't do much which I was disappointed with as growing up as a kid, I loved his movies he does some damage in film but mostly threw out film it's Jesse Metcalfe and Mercenaries shows them more then Bruce witch I thought I was disappointed but at least I know it's not Bruce Willis film but he is always second cast of film I Wish they could just put him as lead role film not always but they cast him put him as second lead role of film you could had Bruce Willis Helping Mercenaries not just have him in less action then you have him saving his daughter look what about this for action they take his daughter then Bruce Willis teams up his team then he teams up with this team killing bad guys him doing more damage and going to rescuing his brilliant daughter. the tiresome action movie gun battles and other violent mayhem, staged unimaginatively by director Matt Eskandari despite how much practice he gets. It's occasionally punctuated by such lame dialogue scenes as Chalmers and Eva engaging in a heartfelt father-daughter chat or The Pardoner taking the time to explain the reason for his unusual moniker. During the latter, Willis, as if standing in for the viewer, listens with a bored expression on his face clearly Bruce Willis wishing he is interacting with Alan Rickman's Hans Gruber instead. The Pardoner, by comparison, is such a one-note villain that his chief distinguishing characteristic is his manipulations of a Rubik's Cube - although that's somewhat more arresting than Willis' character-defining wearing of a heavy woolen scarf. Clearly, screenwriters at least I like Matt Eskandari as better director not a masterpiece or great director but he is not worst like with Steven C Miller and why? Steven C Miller who worked with Bruce Willis twice in Marauders, First Kill those sucked but at least I really liked Extraction (2016) film that Bruce Willis was in and that was Steven C Miler film I liked that but problem with Steven C Miller he is sucks at action, he sucks at writing, he sucks at camera work and camera just keeps on shaking like if I am watching Bourne movies soo much camera shake in while action is happening and you don't know what's going on in action during either fight scenes. but I liked Matt Eskandari as director I liked Trauma Center, Survive the Night, and I prefer this film then other 2 but those 3 films that Bruce worked with Matt is not worst thing at least that's better direct to DVD films then to Steven C Miller work. now this is a film that you don't take soo seriously about this movie don't expect perfect performance don't expect a big budget action blockbuster it's not if you love Bruce Willis he is not lead role but he is in all movie and fast paced of action to kill time it's not that Hard to watch film if you don't take those type of films like this too seriously I really enjoyed film not because of Bruce Willis I give this an 8.10 for action and it's really fun and at least it's films I would wanna see it again no offence I know everyone hates it just because they hate it and rating oh bad movie doesn't mean you should obey them trust your instincts don't worry about critics oh you you like crap films or crap films don't take so much crap about them think for yourself that's very simple give it a look it's just 90 minutes slaright forward action film what is their to lose?"}, {"id": 398, "text": "This is an example of what aging stars do when they no longer make blockbuster movies...they phone in their performance and collect a paycheck. In a nutshell, HARD KILL is about a former military ops team who gets recruited under false pretenses by Bruce WIllis's company to provide security for WIllis while bargaining for the safe return of WIllis's daughter, who has misguidedly tried to sell Willis's technological invention to a known terrorist. Hmmm. Okay, we can get on board with that storyline for an action movie.It seems like all of the actors in the movie took their cue from WIllis's wooden performance. WIllis's range of emotions was nonexistent, and he looked old and tired at best. In trying to figure out if any of the other actors had any experience that might contribute to a decent performance in this movie, I looked up the work of the two prominent female actors (one character played Willis's kidnapped daughter, one played a special ops soldier). Well, one of them came from reality TV, and the other from women's wrestling. Question asked, question answered. And the male actors weren't much better.I won't waste any time with spoilers or the long list of holes in the plot, because this movie is too stupid to warrant that kind of energy. If you want to watch a mindless low budget action flick, watch something else."}, {"id": 399, "text": "Amigos, we all love Bruce Willis, and this Hard Kill does not contain 1% of the quality of Die Hard.Obviously, producers were using the name-alike title as well as the presence of the awesome Willis to make a buck, with disastrous consequences for viewers.Honestly, i could only watch 32 minutes. And that was it.Reasons: the acting is just HORRENDOUS, except for Willis. I am sure you could act better than those amateurs.In addition, the plot is so predictable and generic, same as the poor script and dialogues. Lines are pathetic.In my mind, Hard Kill gets 3/10 just because Bruce Willis is in there.Its not Willis fault that Hard Kill is so disappointingly awful. We still love him no matter what, right?"}, {"id": 400, "text": "Had it not been for Bruce Willis on the marquee, no one would - or should - watch this movie. This movie has it all - a bad plot, bad acting, bad script, bad directing, and bad editing. I would love to see the outtakes where the actors break into laughing fits as they suffer through cast members reciting canned dialog with no discernible credibility or emotion. With the exception of a few times when the script calls for a character's screaming indignation (where it seems atypically sincere), the universal delivery is wooden and emotionless. I actually expected to see accidental reveals of the teleprompters used by the actors to read their lines. Even Mr. Willis himself seemed to be detached and uninterested in the entire production, and his presence is the only reason to want to watch this movie. Repent, Bruce, and please don't take any more roles like this. The non-speaking performances were even worse. Supposedly highly trained evil bad guys dressed in black tactical gear and armed to the teeth, parading around in groups of three like Imperial stormtroopers, oblivious to the dangers presented by the defenders. If there was a technical adviser hired to help in this production, he must have walked off the job before filming began. This movie is a groaner from start to finish, as predictable and disappointing as ants at a picnic. If you don't watch this movie, it will be like not catching the flu - your life will be better for having missed it."}, {"id": 401, "text": "Beyond Terrible; it's actually much worse than 1 star but I have no one to blame but myself. Once I heard the bad guy's name was the pardoner and I kept watching I lost all ability to complain. The fact that he gave himself that name coupled with the fact the good guys know his actual name and yet everyone refers to him by that was cringe worthy. But moving on past that farce some part of me refuses to believe that Bruce Willis has fallen this far; yet each time I watch one of his straight to video movies it's worse than the one before. This one has to be the worst yet. It must be that 98.5% of this film's budget went to his salary. On second thought maybe 99.2%. Let's just quickly move past the fact that it is impossible to believe that anyone involved in this film ever handled a weapon or had even heard the word tactics before. But that's fine Hollywood gets that stuff wrong all the time. And there's about six hours of mistakes in this 90 minute film. What can't be excused is how horrible the writing, acting and dialogue were. On top of that each plot hole was swallowed by an even bigger one. As I said I only have myself to blame for wasting those precious 90+ minutes of my life that are now gone forever. Please don't make the same mistake."}], "reviews_amount": 402}