{"name": "Solitary", "titleId": "tt11266868", "reviews": [{"id": 0, "text": "The movie is called Solitary, but at no time is the main actor on his own, at all. Do they not know what the word solitary means? The movie was a bad snorefest, need I say more"}, {"id": 1, "text": "Luke Armstrong is a VFX artist for 10+ years and somehow got a shot at writing and directing. I'm going to guess this is going to be a one and done.The future of prisons is here, in space. That's about it. Some flashbacks try to explain the characters but don't really. A little bit of tension but not much. Then one of them makes a decision, and..... the movie ends. No Joke.An extremely horrific ending. On par with the Sopranos Finale. If you're into a sudden stoppage that will leave you wondering that anything is possible then this movie is for you."}, {"id": 2, "text": "Boring but keeps you waiting for a payoff, but then the movie just ends..this could have been so much better. I was hoping this was some sort of rehabilitation prison simulation.."}, {"id": 3, "text": "One of the dumbest movies ever. Whoever wrote this garbage needs to censored for crimes against sci fi and basic screenwriting. Seriously folks. Don't waste your time with this trash."}, {"id": 4, "text": "Yes all i have to say sadly the movie starts good to become very boring over the course of the last 1h 20 minutes with a worthless payoff at the end."}, {"id": 5, "text": "It's boring but seems to be setting up some limitations of being on the craft as being the big payoff. And when this seems to be coming the film ends. A complete waste of time. You only get 10 calls - this could have been used brilliantly, what a waste."}, {"id": 6, "text": "Just a really poor film. It goes nowhere and does nothing with wooden acting and weak dialogue"}, {"id": 7, "text": "Visually this movie is average to OK for a low budget title. However something I can never really get over or forgive in any film is a poor script.Nothing makes sense in this film, the humans don't eat food or take a crap whilst trapped in the space pod. The space parts seem surreal. The opening 5 minutes give nothing to the plot, and the rest of the writing is a mess.The dialogue is some of the worst parts of this film, and ranges from redundant statements to stunted incomplete sentences.3/10 very poor."}, {"id": 8, "text": "If you want to lose 1h:30 of your life, do it. Things that are wrong there are no bathrooms for those in the capsule, there is no food. Movie made with very little budget!"}, {"id": 9, "text": "I dont know what these people thought when working on the premise. It is the worst idea a human ever had. Sending mentally unstable prisoners into space, to fulfill the duty of safing mankind. Tremenodus. Its just great. Its the best premise ever"}, {"id": 10, "text": "This is a boring british attempt of making a sci-fi movie. But it fails. Its poor acting, you can clearly hear the actors reading from a script, its a boring plot, nothing happens, a total waste of time. Avoid this garbage."}, {"id": 11, "text": "Story just didn't grab me. Acting was sloppy and I wasn't convinced that it was 2044 or that the main characters were criminals, that they were in space or the world was suffering. Surpred I lasted an hour."}, {"id": 12, "text": "As others have stated, aside from the visual effects, this movie is total crap, so, the rating I gave it is very generous. What's 'is name is barely adequate as the confused dork, but the female lead wasn't believable as a woman in the slightest because she can't act and she's typical Brit chick fug. Unfortunate. Just keep looking for something good to watch on movie night because you ain't gonna find it here. This gobbledygook will only anger your significant other and provide them with the grounds to begin divorce proceedings they've been looking for."}, {"id": 13, "text": "Two people in a spacecraft most of the movie doing absolutely nothing. Watching paint dry is more interesting than this garbage. I just don't get what was the whole point, it just sucks so hard that I can't believe this has been done intentionally - surely something went horribly wrong somewhere, there has to be some excuse for the lack of any intelligence."}, {"id": 14, "text": "The premise is incredibly flawed in that humans are launched into space to dock with a space station, but the launch vehicle is a box, with two beds, plants, windows, and extremely spacious for a space vehicle (no bathroom?). That's not how a trip of a few hours would work. I'm pretty sure they'd make a passenger type vehicle and pack the humans into it. The pacing was not well done, and so as many state, it is boring. The music is surprisingly good and the visuals are strong which were positive as I've seen big budget films that look back and sound worse."}, {"id": 15, "text": "In the end I don't wanna leave spoiler but the writer and director should know"}, {"id": 16, "text": "In the year 2044, the Earth is a dying planet. Isaac Havelock (Johnny Sachon ) wakes up in a small space capsule with Alana Skill (Lottie Tolhurst). As his memory returns, we discover that he is a criminal and part of a deep space experiment. The mother docking ship has exploded and they are stranded in space. Being criminals, their rescue is less important to ground control than themselves. Outside of a few flashbacks, the film is two people in a small capsule discussing societal values, human values, and how much air do we have left. The film was too low budget to make the concept viewable.Guide: No sex or nudity. Don't recall any swearing."}, {"id": 17, "text": "First 45 minutes of the movie and i still had no idea what the hell was happening. Huge headache to watch."}, {"id": 18, "text": "This movie should very honestly be submitted to the United Nations as evidence of a Crime Against Humanity. It is nothing more than a disgusting abuse of freedom of speech, and in all actuality harms the human race on the most basic and fundamental levels."}, {"id": 19, "text": "I don't have any words to describe this movie. Just don't waste your time with it. Absolutely garbage !"}, {"id": 20, "text": "I watched it to the end with interest. There have been many others I have turned off after 3 mins. Main actors were pretty good, some of the voice acting sounded like 'the guy that calls you with information' on a video game. Good effects, some of the plot twists were predictable."}, {"id": 21, "text": "I don't know why people are bashing this so hard. Acting was believable, VFX were good, music was great. The 1st and the 3rd acts were solid, 2nd act was slow but It's clearly a low budget movie - what did you expect? I thought it was well made for an indie. The ending: she wakes up - she's just threatened to kill him... We're left with the question of whether he's going to make it back after all... What's not to get?"}, {"id": 22, "text": "After quarrels with the US over Suez, Britain played no manned role in the Space Race, making the first Briton in Space a female Cosmonaut. So, no coffee-capsule George Clooney and Sandra Bullock - but two unknown British actors, playing 2040's Space Convicts in their own scaled-down version of Gravity. Accepting the narrowed parameters, including the need for females with no physique to demonstrate exceptional strength (Oh no - not again!) this flick was not too bad. It fostered, suspense, concern about the fate of the 2 crew and disgust at the double-dealing of those back on Earth. Were it a school production it'd merit applause."}, {"id": 23, "text": "First off, this girl beats this dude to a pulp multiple times in one short sequence. Huh? Now that you know this movie is fake as H E double hockey sticks, well, the story too is quite bad with bad voice overs (being ground control). Watch if you got nothing else. More importantly, be proud to be an American."}, {"id": 24, "text": "I found it a thought provoking and cerebral commentary on social justice and societal acceptance of unusual methods of incarceration, as well as the in-depth thought process of those incarcerated. Add a (slight) mystery of how they got to where they are, and this movie was well worth watching. The acting was adequate by the main characters.For those who haven't the depth of mind to grasp subtlety and introspection, while encompassed in a sci-fi back drop, I suppose it would be boring"}, {"id": 25, "text": "The visuals are the particularly outstanding part of this film, especially given it's a low budget film and completed during lockdown. It's a really interesting story idea and something I feel seems a genuine idea of something for our future, with some twists in the story as well. Solid leads playing against a beautiful galactic backdrop, and an outstanding score which really adds to the atmosphere."}, {"id": 26, "text": "Great visual effects and good acting performances by the lead actors. In particular Lottie Tolhurst performs extremely well and gives her character depth and chilling nuances.Some more efforts could have been invested into the script and the voice acting of the off-screen voices.The news scene was of a bizarrely lower quality than the rest of the movie."}, {"id": 27, "text": "I LOVE Solitary !. Had me on the edge of my seat at all times. From one breathtaking moment to the next, this movie just delivers amazement. AMAZING!!! MUST WATCH!! 10/10"}, {"id": 28, "text": "Thought it was alright, cool vfx. Some pretty impressive shots in there"}, {"id": 29, "text": "When I saw the movie it had 5.1 rating which usually indicates at least a watchable movie. School plays have better acting then this, at least we did a better job as utter and complete amateurs. The idea it self is fine, but the execution and acting are not only bad, they are utterly unconvincing (they sound like first script reading) and the plot it self is a mess. Others have also noted a weird issue of people not having to eat or go to toilet."}, {"id": 30, "text": "A great little sci-fi with a great story and visual effects."}, {"id": 31, "text": "This movie really blew me away with how good it was. Two well known amazing actors. I don't know they could pull it off. But they made you believe they was really trapped in the capsule with them. I give this movie ten stars with how much I enjoyed it."}, {"id": 32, "text": "Although money not splashed out on this one, it is worth a watch. Yes no toilets, food, low cost cgi oh AND tiny plants in corner producing oxygen, script is workable. Johnny Sachon and Lottie Tolhurst had a good time on the shoot if you watch the bloopers off the DVD."}, {"id": 33, "text": "Bad acting. Very bad dialogue. Non believable characters. Poor camera work. They sounded and acted like it was their first time on stage. The scene with the two security guards was so poorly executed it was laughable. Okay it's scifi and it's fiction but at least try and put some realism into how humans especially trained personal are supposed to act. It's infuriating. Don't waste your time. You'll be angry."}, {"id": 34, "text": "I would say it's one of the calmness sci fic I ever watched. It's a drama with all the conversation with limited sci fic scene. Feel like im in Broadway. So special."}, {"id": 35, "text": "First off 5 stars for the CGI and acting.Solitary?! There are two characters throughout this movie!I got problems with the scrip though. We are given so little background explanation for our main protagonists (especially Alana). What was her sentence? Busting a drug den? Revenge? Anything? Not a clear answer.There isn't really a payoff at the end of this movie. It tries to make the viewer make his own mind, but I think that too is very poorly executed."}, {"id": 36, "text": "British filmmaker Luke Armstrong is a visual effects pro, and it shows in this film. This is his first full length feature film, with about 12 short films as director and writer, his last being a short film with the same name. I haven't seen it, but he should've stopped there, and left this story as a short.The 89 min runtime felt like +3 hours with the snail pacing and long dragged out and some unnecessary scenes. There were tons of plot and technical issues, and the dialogue was atrocious. I get this was a low budget b-grade film, and considering the small cheap sets, it showed really well. But more effort was needed in the dialogue department in the writing and the voices. What was the point of the main switchboard lady? She may as well have said please hold - at least that would've been funny. And the voice and dialogue from the we're working on it intercom dude was ridiculously infantile. I mean, it wouldn't have taken much effort to make him sound and talk more authentic.Then we have the bad acting of the two leads. Although not amateurs, they were terrible and unconvincing. I'm sure for the most part it was the fault of the director failing to direct his cast properly. And having Alana easily subdue Issac, a military soldier, was a joke - even more so when everything was back to normal ok after doing so.The only other redeeming quality was the score, that was decent and fitting, especially for a b-grade film. That, plus the visuals, is why I'm giving this so-called sci-fi-in-a-box my generous 5/10."}, {"id": 37, "text": "Seriously I tried to like this, I tried to see the diamond ring in the crap tosheroon but alas it was just a ball of crap with not so much as a farthing to validate its waste of time.Most Sci-fi and indeed fiction works on the premise of possibility and the suspension of disbelief, in the begining of this film we are told the World is overpopulated with dwindling finite resources which are fast running out. (Remember this as it is important).Then we have a scene where a man is being followed and then ends up running from a group of unknown armed assailants into a shipping containers yard where they exchange gun shots. A worker from the shipping containers yard comes out to see what is happening and challenges the group of men who then deliberately shoot him and as the running man cradles the dying worker in his arms the armed men surround and then apparently arrest the armed man when they had no qualms in killing an innocent worker??? Seriously I am not making this stuff up!The running man then mysteriously wakes up in some sort of cell and looking around sees a young woman in there who tells him they have been sentenced to life in space for their crimes (This film is called solitary... WHY?).Remember I asked to to bear in mind that the World is running out of resources? Well now imagine they are wasting all those resources in sending criminals into space? Are you starting to wonder who wrote this tripe?Apparently in space you can hear explosions (Or in this film you can) because the two in hahaha Solitary look out the window after hearing an explosion out in the vacuum of space.Also to account for the apparent gravity in this orbitting prison cell we are told the inmates have magnetic implants that are attracted to the magnets in the floor and yet the womans shoulder length hair seems also to be pulled down with magnetic attraction, so how exactly would that work?This all went on in the first 11 minutes of the film, the rest I have not commented on so no spoilers but to Luke Armstrong I applaud you for your attempts, we should after all show some encouragement when people try new things and now he has tried screenwriting and directing maybe he should take a break and try something new, like flipping burgers at his local burger bar?"}], "reviews_amount": 38}