{"name": "The App That Stole Christmas", "titleId": "tt11378154", "reviews": [{"id": 0, "text": "Throughout the whole movie it seemed like they were freestyling their lines and just saying anything. There were even times in the movie where it seemed like the actors didn't know what the other actor was trying to say/do. Some lines didn't even make sense and I was smacked watching this movie so this movie had to be some bs. I felt like the writers didn't pull through or this movie was rushed. Yall couldve done a lot better cause wtf. The only thing funny was the little trailer they had before you watch the movie of the security guard who accidentally knocked out his boss. Thats what actually made me want to watch the movie in the first place and then I actually watched it and was disappointed."}, {"id": 1, "text": "The whole entire movie made no sense at all,it was very boring,not entertaining at all."}, {"id": 2, "text": "At an hour in length, it was 60 minutes too long.You would get more enjoyment counting 3,600 seconds out loud in a pitch black room and have used your time better."}, {"id": 3, "text": "My heavens. This was an absolute waste of fragmented, pointless time. I'm totally at a loss. From bad acting to pointless storyline. I WANTED to like this movie. I wanted to root for it to get better. But sadly that was not the case. The ending was truly a joke. Many missed opportunities to make this worthwhile!"}, {"id": 4, "text": "Horrible acting, super short and didn't make any sense at all. Netflix should do us all a favor and remove it from their service."}, {"id": 5, "text": "I regret watching this movie. It was too fast and nothing was explained. Missing a lot of context makes a movie terrible. Dont recommend."}, {"id": 6, "text": "I didn't like anything about this. Literally nothing. Which made it very funny. Everything about this is bad. Everything. But I laughed the whole way through. Nothing is funny, and that's very funny. Every scene could be cut short and I would've only had to waste 30 minutes on this, but I guess that's a con since I got to laugh nonstop for an hour and three minutes. Maybe it should've been three hours, but it's just the same movie three times in a row."}, {"id": 7, "text": "Wow. This movie was so poorly developed. The camera man did an amazing job, but the acting and writing were HORRIBLE. He fell on the floor, not even hitting his head...I had no idea what was going on 90% of the time because there were too many inner thoughts out loud and transitions. If you have to do that many asides in a movie, you might need to rethink the writing. The transitions made no sense...a lot of that had to do with misplaced music. The delivery guy coming in the house is a good example of confusion. It really seemed like that was his brother or cousin using his house to impress ladies, not some random dude. RayJ did a better acting job in... well, you know. Jaylin Hall (the kid) was the best actor and I feel so bad for him. Hopefully, he can keep going on The CW. They couldn't even pick a Santa with a real beard? Or make elf ears vs wearing hates with felt ones!?! People go to things like Comic Con and make them themselves. Furthermore, Santa basically kidnapped the app dude and FORCED him to help Santa? What the heck!? Those are just a few examples... I highly recommend you don't waste your time, unfortunately."}, {"id": 8, "text": "Felt like something we'd make in high school media class. Bad acting, bad script, good camerawork and quality. Had no idea what was going on half the time. Turned it off in favour of the entire family."}, {"id": 9, "text": "This is almost the worst movie ever. I don't know where to begin, the acting is shocking. Although the story line has a good meaning it just wasn't delivered well at all and even though the lesson is obvious, the movie didn't teach it well. This movie is so bad it made me write this review, which is my 1st ever IMBD review."}, {"id": 10, "text": "Running at just over an hour, this is more a TV special than a movie.It has the right intentions (presence not presents) but it fails in its execution!The acting, writing and story as a whole are very sub-par and with the dominance of the soundtrack feels more like a vehicle to promote/ sell the music.I'd wait until you have seen every other film on your streaming service before you watch this."}, {"id": 11, "text": "Production quality of this short movie was abysmal. The sound was terrible throughout, especially with dialog. Camera angles felt amateur. This movie isn't even bad in a good way. Don't bother."}, {"id": 12, "text": "Seriously, such a funny scene with Jessie B. She has some chops and she iis funny. I love the girls in this movie, but there were mostly guys."}, {"id": 13, "text": "The guy is a trial lawyer. OMG. He as actually really good. He saved my son's life. Lots of love to you and Merry Christmas."}, {"id": 14, "text": "The guy was so amazing in his small part. Why did all the small parts go to the best actors. Should have been the other way around. Gramps had some great moments."}, {"id": 15, "text": "I loved it. Finally a movie for black people for the whole family. Not offensive. Everyone is fun-loving. Love this movie for being about good people."}, {"id": 16, "text": "This should have been a musical. So many singers in this movie. I counted 5. Dreamdoll, Jackie, JayQ The Legend, Ray J, Torae. Next app movie should be all about the music."}, {"id": 17, "text": "Jalyn is so awesome. Best actor. Cute and funny. A vey talented guy."}, {"id": 18, "text": "Put this on in the background, start getting those decorations out. A heart-warming, tongue-in-cheek, feel-good tale about the kind of values we want for ourselves and our communities, especially around the holiday season. We absolutely love the piss-take of G.B (Bombazon 😆)! Enjoy, jingle on and Ho Ho, hope all you have a Merry Christmas!"}, {"id": 19, "text": "Very good look in these times. People spending time together is very important. I think the only people hating this cute campy movie are people who have an agenda or in the industry. The desire to tarnish a good wholesome quality time message is hard to resist if your life is ruled by envy and lack of appreciation for how many people can't spend time with family because of Covid. This Christmas is really about presence. Happy holidays. Happy new year 2021."}, {"id": 20, "text": "#SFTFilmReview #TheAppThatStoleChristmas Rate6/10 📖4/5 🎼📽3/5 😍6/10 🎄10/10 Comedy Drama #RayJ #JackieLong #JayQ #JAnthonyBrown #EliseNeal A ok cast!Story is a company Bomazon, with its powerful Christmas App, has become a Fortune 100 company, and he is the brains behind it. The owner is very proud of what he has created, but gradually discovers that the App is ruining the spirit of Christmas. Music is Pop. Film by #MonicaFloyd is a decent low-budget festive movie. A must see! Available on @netflixuk 📺"}, {"id": 21, "text": "Just sit back and enjoy!!!! Its funny, witty, and just all around fun"}, {"id": 22, "text": "I love Christmas movies but let's be clear! They have always been extremely whitewashed. I was just happy to see a Black Christmas movie, with some Black actors...that I do recognize and can appreciate. Representation Matters."}, {"id": 23, "text": "Rudolph and Black Santa!!!!!! I will be waiting for them on Christmas Eve!!!"}, {"id": 24, "text": "Sereioiusly, I have watched it a million times already. I'm laughing so much that I am peeing"}, {"id": 25, "text": "These guys killed me. Black Santa doesn't work after 9:00pm LOL I liked when Felix got knocked down - the security guard was the best guy character. His lines were so ridiculous."}, {"id": 26, "text": "Go Jamaica! I got his Body Talk on my playlist. No joke. That girl who tried to sing his song, though can't sing on tune. Anyway, the movie is a total classic. Great for everyone."}, {"id": 27, "text": "Ray J was so awesome as an elf. He was such a cool elf, band had some very sentimental moments. J. Anthony Brown - makes me proud to have such a sassy black Santa. Jackie Long was good also. Best were Jalyn and Gramps, hands down."}, {"id": 28, "text": "This movie is great for the whole family. My kids loved it, and my husband couldn't stop laughing. When you find a sweet movie like this, you want to watch it over and over."}, {"id": 29, "text": "This movie had me laughing constantly. The characters, especially gramps was a riot. Jalyn was my favorite character. Love him so much."}, {"id": 30, "text": "Ray J is so cute as an elf. I want to marry him. He is the best"}, {"id": 31, "text": "Thank you guys for making this a light-hearted movie. So fun to watch. Scenery was very colorful and magical. I want to live in Santa's Magical Resort!!!!"}, {"id": 32, "text": "The chemistry between Jackie and his wife on set is crazy. Get a room, you two. Really good acting by everyone Gramps and the security guard had me on the floor laughing"}, {"id": 33, "text": "My kids love this movie. I love this movie. Watching with the grandparents now. It is a movie for everyone because it is not offensive. A movie with a black Santa that is sweet and wholesome"}, {"id": 34, "text": "Finally a holiday movie where black people are portrayed in a great light. All good like it should."}, {"id": 35, "text": "She is a like a little Cardi B, but prettier. They should have had her singing in the movie. I really liked the movie especially the salon scene"}, {"id": 36, "text": "So good. Everyone should see it because it is a black movie that does't have shady characters. Finally."}, {"id": 37, "text": "Yes, I cried like a baby. I want what those two had. I bet you they are together for real. Crazy chemistry"}, {"id": 38, "text": "Why did Elise Neal have such a small part? She is a classic. Love her. Super talent."}, {"id": 39, "text": "Listen Torae is so insanely funny. Didn't know he was such a great actor. Gramps (name?) and Torae were the two best actors - great comedic timing"}, {"id": 40, "text": "I literally cried when Felix left Santa's village? Anyone else? Who expected it to be a tear jerker?? Great movie - you laugh, get pissed, cry, and then sentimental."}, {"id": 41, "text": "JayQ was the best elf because he was so goofy. Ray J was also the best elf, but such a serious elf. The other elves were mischeivous."}, {"id": 42, "text": "Getting off my app after I do this review. Seriously, we spend too much time on our social media. Let's talk."}, {"id": 43, "text": "Jalyn is the best actor in the entire movie. He carried the movie for those old people."}, {"id": 44, "text": "Are those two together? I swear they seem like a real couple to me. She has an amazing body."}, {"id": 45, "text": "It was over too fast. I had to watch again - best part is when Felix is stuck in a phone app."}, {"id": 46, "text": "Great actor and hottie. I think Diane Howard is smitten! Those two have major chemistry. I heard they were an item."}, {"id": 47, "text": "The movie was great - easy to watch. I liked it a lot. I would mix up the races a bit more - more even."}, {"id": 48, "text": "A great family movie. Totally would recommend to anyone with kids or grandparents. A black movie that doesn't offend anyone."}, {"id": 49, "text": "Torae is so great in this movie. He should have had a bigger part. I think he would have killed it as Felix. Jackie Long was good in his part, very believable"}, {"id": 50, "text": "Yup exactly right. Who has cash to get stuff this year. Christmas should be about family time. After watching this movie, not buying anyone anything but giving them my love"}, {"id": 51, "text": "My favorite part is that Santa doesn't have to be white. He is a black guy with a sense of humor. Good going writers!"}, {"id": 52, "text": "When does the sequel come out. The movie was so short - want to see the sequel now."}, {"id": 53, "text": "Wish there was more animation, but it was overall really good. My favorite part Gramps and Ben having dinner."}, {"id": 54, "text": "Ray J is the best dressed elf I have ever seen. What a cutie. He is such a good actor and singer. Jackie was really good, too. They are close friends."}, {"id": 55, "text": "I want more. watched it 7 times and I can't get enough. I want to know what happens next. Sequel please!!"}, {"id": 56, "text": "Love it - all my favorite actors. Miguel Nunez,. Ray J, Jackie Long, J Anthony Brown. Go black Hollywood!"}, {"id": 57, "text": "He is so handsome. Give me some of him!!! Great acting in this movie. It is short and sweet."}, {"id": 58, "text": "Totally awesome point - Christmas is about presence not presents. I love it - it is totally true, especially since I don't have any money to buy stuff this year."}, {"id": 59, "text": "Great movie - it was fast and fun, but the cartoon could have come out more. You could do a whole movie around that Bomazon App character. Put down those phones people! Get off the apps!!! We need to socially interact."}, {"id": 60, "text": "Give the girl some more lines. She is a super talent. Great singer."}, {"id": 61, "text": "Okay that was pretty funny. Didn't he just get divorced."}, {"id": 62, "text": "The movie was fun, but the music was great. A combination of jazz and urban songs, and the some whimsical Santa music. I got the movie soundtrak - music might be better than the movie"}, {"id": 63, "text": "Ellen is dressed like a movie star the whole time. She got some major curves AND she is a great actress"}, {"id": 64, "text": "Your time is precious, don't waste it on this title, unless you want your Christmas spirit sucked out of you.The tagline suggests that what is important is presence, but this movie lacks any kind of presence.The acting isn't great, but that is to be expected for a low budget indie film, the acting could be forgiven if the other elements of a good film were present, but they were not.The first sense to be attacked is your hearing, the audio quality is poor and sets the tone for the rest of the movie.Next it's the dialogue, poorly written and executed. Some forced banter mixed with wildly unneeded lines were cringe worthy and more often than not you will find yourself screaming Get on with the plot!!!!......But that's the thing, there is nothing here to grab you and not let go. No satisfying progression, no character arch, no fun or Christmas cheer. Instead of grabbing me it's clawing at my ankles like an annoying chihuahua.The whole amateurishness of this production is at the forefront and I would expect this kind of quality of film and script if I handed a camera to some students and said Make me a Christmas movie by the end of the dayIt baffles me that anyone working on this film thought it was good enough for public viewing. It's offensive that they think our standards are so low.Somehow I suspect the reviewers giving top marks worked on the film, or are friends of, especially the one that says I've seen this 7 times!... It's akin to self-harm. I would rather watch Battlefield Earth.Please do yourself a favour, and watch something that deserves to be watched where the creators have actually put in the effort"}], "reviews_amount": 65}