{"name": "Uncle Frank", "titleId": "tt11327514", "reviews": [{"id": 0, "text": "The story is a common tale of a man hiding his life from his family until a family crisis brings the truth out in the cruelest manner. Paul Bettany is absolutely incredible. There's not a moment he doesn't ring completely true. The supporting cast create a solid base and their characters are so believable I felt like I was watching a documentary. Alan Ball has once again proved to be a writer of enormous skill, bringing truth and compassion to a story of a man's final realisation of who he is and where he belongs. Frank's fears are finally laid to rest as his family, out from under the shadow of a scared and stuck man, freely accept Frank and Wally each in their own way. It's a story of love and acceptance, what we all aspire to create, need and deserve."}, {"id": 1, "text": "It is an incredibly heartfelt and authentic film. The performances were perfect. The direction was lovely. It was thoroughly engaging. A film that should not be missed."}, {"id": 2, "text": "It's just amazing. The story might seem light and simple but it's way more than that, it's so deep and important with many heavy subjects and life messages. Performances are all so good. Camerawork is nice. Uncle Frank is one of the best movies I saw this year. It's very well made, and It's touching, heartbreaking, funny, entertaining, and important. It's highly recommended because it's a great movie that deserves better recognition and appreciation."}, {"id": 3, "text": "The guy who did the role of Wally nailed it. The film does get very poignant with Frank's past. It is a bit comedic at times. The scene where the aunt gets only 500 $, her facial expression is epic n a big lol. It is much better than Moonlight."}, {"id": 4, "text": "Utterly compelling, faultless story with an Oscar deserving performance from Paul Bettany, the director and the two main supporting actors"}, {"id": 5, "text": "A wonderful enchanting film that really captures struggles that people had gone through just because of their sexuality. Just beautifully filmed with an authentic feel of the 70's with very relatable and well acted characters that will keep you entertained throughout. People giving this a low rating is bewildering but each to their own, I for one loved it with the stellar performances and quirky yet tearful moments that really brought thoroughly enjoyable film that I will watch again very soon"}, {"id": 6, "text": "I usually don't review much but sometimes it saddens me to see such low grades on a beautifully made, heartwarmingly movie. Sophia Lillis and Paul Bettany are 2 of the best.There is a scene, you'll probably know when you'll see it, that completely engaged my empathy and emotions, made everything before and after it inconsequential, that's how powerful it was and I hope no one ever has to go through that, although i know a lot of people still do.Wonderful movie, go see it and grow."}, {"id": 7, "text": "Beautiful film. Perfect cast! I think that was the key to this, likeable main characters that worked well together. These kind of stories are so important to be told, in such a way that nothing distracts from what is important. Frank, being able to who he is."}, {"id": 8, "text": "I'd almost begun to think we'd never see a movie like this again. But just when we need it most Alan Ball delivers a classically structured, beautifully written and delicately directed story that is both timely and timeless, as well as deeply moving. What appears on the surface to be a simple family saga is actually one of the most artfully constructed and thoughtfully realised movies in years. It will most likely be overlooked come award season as Hollywood rushes to honour the dumb superhero movies, pretentious gangster flicks and such - ventures in which hundreds of millions have been invested. They need those movies to succeed so the money keeps flowing, I guess. But Uncle Frank is real movie-making. I'm willing to bet you'll remember it long after you've forgotten most of 2021's Oscar nominees."}, {"id": 9, "text": "This is a film of love, partners, family and mostly self. A beautifully shot, thoughtful take on the challenges of traditional 70's thinking and the challenges of a gay life within a family.A superbly acted film, tense and moving, warmed with love. It's not an easy watch, and shouldn't be. In saying that it has fun and warmth. Recommended."}, {"id": 10, "text": "This movie spoke/speaks volumes to me. Having come out in 1968, I identify immediately with so much of what Frank is struggling with. When Frank shushes Beth, his niece, in the restaurant takes me back years. The fear of queer still haunts me somewhat. I have passed throughout my life. I love all the guy things: hot cars, rugged sports to name two.Frank's father is brutal; hate filled. There is that old God'll get ya for being queer. You'll burn in hell fro sure. The vestiges of a religion which teaches one NOT to judge gives sway to all those who DO judge. I was fortunate in that my father did not like or love me but he never uttered one word about my being queer. He and my mother knew my partner at the time, along with my partner's family. I suspect my dad was a repressed homo. Someone remarked that he feared me because he saw in me all that he had denied through two marriages. Frank's father is a self-righteous ideologue who spouts forth the age old false doctrines against gays/queers-homos.I did get angry at Walid, Frank's partner of 10 years. As a Saudi who fled Saudi Arabia because of his homosexuality, I consider Walid the LAST person to be giving Frank advice on family matters. Frank's mother played by Margo Martindale is one of my favorite actors. A mother always knows she says. At some level I believe fathers do also.The most heart-wrenching moments were Frank's flashbacks to when he and Sam, in their teens, were experimenting. Frank's harsh and cruel dismissal of Sam, declaring they are against God leads to Sam's committing suicide. That love which dare not speak its name rears its ugly voice once again. Despite Frank's struggle to save Sam from drowing, Frank arrives too late. I believe only someone who is gay can grasp the gravity of this moment. There are many, too many gays, even today, who want to commit suicide out of fear, rejection and negation.I recommend this movie to anyone who really wants to connect with what being gay was like in the earlier stages of our sweeping coming out. It was a world consumed with fear, denial and careful use of pronouns he/she. Odd this movie takes place in South Carolina. My experience has been that some of the truly sweetest (not effeminate) lads have come from the South."}, {"id": 11, "text": "P.B was amazing in this movie. The emotions he portrays hit you exactly where they are meant to and all the other cast members are fantastic. Despite not being a relatively simple story it's told perfectly and keeps you gripped throughout."}, {"id": 12, "text": "A very romantic movie, can make you think different, hope many parents watch it."}, {"id": 13, "text": "I haven't been moved by a movie in quite some time, I cried I laughed.. I loved it"}, {"id": 14, "text": "Paul bettany is such an underrated actor.I laughed, I cried.Great Sunday afternoon post roastie 1 glass of wine down watch."}, {"id": 15, "text": "Add this as another new classic to the canon of the dysfunctional fundamentalist South just released on Amazon Prime: Uncle Frank. It is exceptionally well done, and is bare-bones nauseating at the same time. How did any gay person survive being gay in the Fundamentalist South? The cast is spectacular. Sophia Lillis radiates honesty on screen. Paul Bettany personifies stoic repression. The full cast magnifies the realism of the plot.Alan Ball writes his lived truth. How did any of us gays survive growing up in this tragic, fundamentalist South? ..Only through our own strength of character and determination."}, {"id": 16, "text": "I watched this movie on Netflix over the Thanksgiving weekend and it was a good interesting movie. At first, I didn't recognize Paul Bettany. He looks so skinny and different in this movie. I recommend that others who's not homophobic to watch this movie."}, {"id": 17, "text": "Once again, Paul Bettany gives a more than Oscar-worthy performance. It has been amazing, following his career. He is capable of slipping into any skin, and, in the process he never fails to captivate.This particular portrayal made my heart weep and also thrilled me with the breadth and majesty of his talent. Riveting, absolutely riveting.An all-star cast. Terrific writing.A special nod, as well, to Margo Martindale. As soon as I saw her on screen, I knew she and Bettany would take us all on one heck of an unforgettable journey."}, {"id": 18, "text": "This one will stay with me forever. One of the best movies I have seen this year with stellar performance by all and certainly Oscar worthy."}, {"id": 19, "text": "8/10 - touching and deeply moving story is nicely coupled with tremendous acting from Paul Bettany, Sophia Lillis, and Peter Macdissi"}, {"id": 20, "text": "An extremely powerful film with superb acting by all concerned. I found myself both moved to tears nut also felt enormous satisfaction with the ending. This is a wonderful movie.Just a word about one of my favorite actors: Margo Martindale does not have a large part but her role is critical, in my view, in making sense of the story line and she is, as always, superb!"}, {"id": 21, "text": "The characters of Wally , Frank and Beth are outstanding , the portrayal of Wally is one of my fav characters in a long time , Frank is awesome also , all actors in this field are outstanding . Judy Greer was great , she needs to be in more movies . I be do recommend this movie .well made , the backgrounds and the cars in this film are great 10 stars for set and background props even the clothes . Great movie to watch"}, {"id": 22, "text": "I saw Paul Bettany, one of my favorite actors, listed and without having any clue as to what the film was about, I drove in and I'm so glad I did. Such a wondeful film to melt into for a lazy day during Covid pandemic. Such an escape and a warm hug at the end. I loved the entire cast. Alan Ball wrote a magical script. Highly recommend."}, {"id": 23, "text": "This is a deeply moving film about the magic of truth telling, redemption and authenticity. It is well acted - it brought me to tears. It is a story well worth telling."}, {"id": 24, "text": "Ignore the low ratings. Made the account just to rate this movie. Wonderful cast. Wonderful acting. Beautiful all around!"}, {"id": 25, "text": "Amazing film with an incredibly talented cast. Moving and powerful. Highly recommended."}, {"id": 26, "text": "A wonderful movie. Paul Betanny is brilliant as always."}, {"id": 27, "text": "Movie does have a good story and cast but my only issue is about halfway it kinda dragged a bit in some areas it didn't need to while rushing areas of interest. Overall I would recommend watching it and sure bigots will hate it but who cares about them haha"}, {"id": 28, "text": "Every human being is trying to find a place among others in this world. And not always this way is easy and conventionally accepting. Frank, the main character, is not an exception while he is trying to find his own true north. No matter how tough and cruel surroundings might be.You might find this story tremendously compelling. I wish everyone would have such uncle as a person.The movie is absolutely spectacular and recommended undoubtedly."}, {"id": 29, "text": "One of the best just be yourself movies! This movie tugged on my heart strings a few times!"}, {"id": 30, "text": "A flawless execution of a beautiful script, totally loved it.Thank you."}, {"id": 31, "text": "Uncle Frank is a film about uncovering secrets. It is also a film about the burden of the past in choices we make that can never be reversed. The conceit of the film is a coming of age tale about young Beth (Betty) Bledsoe. But the core of the film is the emotional pain of her Uncle Frank.Frank never got over the Lassiter boy, who was Samuel J. Lassiter, a teenager who left this world far too soon and for no good reason. Shamed when he was discovered in an embrace with Sam, Frank said words that he regrets until his present age of 46 in 1973.It was Frank's domineering father, Francis Mackenzie Mac Bledsoe, Sr. who could never face the realities about his son's sexuality. Mac was shamed that his brother Jasper was gay, and he was incapable of tolerance about his eldest son. Frank Jr. reaches his nadir when his father's will is read aloud, which is a gut punch for the ages.Early in the film, Uncle Frank gives the advice to Beth that changes her life. In very simple terms, Frank tells her to be herself and not be affected by what others think. In his life, Frank finds that objective more difficult to achieve for himself.The performances and Allan Ball's scripting were first-rate in this heart-wrenching drama. The most memorable character was the effervescent partner of Frank, Wally, who always brings the joy of life to the moment. One of the characteristic scenes in the film is when Wally is in a phone booth talking in Arabic to her mother in Saudi Arabia. The love and devotion are apparent in Wally's inflections and his smile. The film's themes of family values and tolerance come across perfectly in that expressive scene.It is Wally who best articulates the dynamic of uncovering layers of reality and coming to terms with the truth of the past. In Wally's inimitable manner, he casually asserts that what's hidden is what interests me."}, {"id": 32, "text": "I found the story overall to be quite touching and emotional., and I ended up in tears by the end once certain story elements are revealed. Paul Bettany is amazing in this film and frankly so is everyone else. It may be too heavy-handed at certain parts and even though it's only 95 minutes, sometimes it does feels longer. But, I really enjoyed this film and hope to see more from Allan Ball soon."}, {"id": 33, "text": "Uncle Frank tells the story of a young, rural South Carolinian woman, Beth, (Sophia Lillis) a precocious spirit with a connection to her rarely seen Uncle Frank. Uncle Frank, portrayed by Paul Bettany, is a dashing figure seemingly dismissed at home and who lives and teaches Literature at New York University (NYU). When it comes time for Beth to go to college, she receives a scholarship to attend NYU. While there Beth learns of Uncle Frank's worldly ways including his partner, Walid. When a death in the family occurs, Beth and Uncle Frank embark on a road trip back to South Carolina. Along the way, Beth is exposed to bigotry and homophobia. And, once she and Uncle Frank are back in small-town, rural Creekville, South Carolina, the past reveals itself, and moments for self-reflection and overcoming imposed beliefs come to pass."}, {"id": 34, "text": "I'm one of the biggest fans of Alan ball's work and die hard fan of ''Six Feet Under'' as one of the best series ever made. but this movie was not something special. just another movie about a gay man who is afraid of his family's opinion about his sexuality. I will be fair and say this movie was beautifully shot and the actings were good.the ending was the worst part, ''an all sudden, not at all fitting'' happy ending just to end the movie for the hell of it.Afterall, you earned my respect forever after Six Feet Under and I don't regret watching this movie either. keep writing. sir."}, {"id": 35, "text": "...and it better get multiple nominations! Incredible performances across the board! I laughed. I cried. I LOVED THIS FILM!"}, {"id": 36, "text": "As a 58 year-old Southern, gay man, I can tell you that this is absolute precious idiocy. Cartoonish characters. Alan Ball at his worst. Seriously, this throws everything in the mix.It's really bad. It made me angry.Clichéd performances beyond belief.I am about half-way through, and I will attempt to finish it. But I am guessing that it will be about as awful, as I expect.I just find it gratuitous."}, {"id": 37, "text": "I was giving up on 2020. I was giving up even before that. But this movie brought back some faith that there are people who can make something that is worth watching. You can be straight or gay and you will still enjoy it. I am glad i saw it."}, {"id": 38, "text": "I don't think any movie I've seen this year has hit me in the feels, the way Uncle Frank has. Not only is it visually beautiful to look at, but the score is perfect for this story and Paul Bettany's performance is one of his very best to date. I've got two words for you No Problem . If I wasn't in tears before that moment..... I highly recommend checking this out."}, {"id": 39, "text": "A delightful glimpse of frank's life, showing how society perceive homosexuality and how it affects an individual's persona. It's a very mellow film with full of humanity and love. It shows both the sides of society as mirror. It's true piece of art and a classic drama."}, {"id": 40, "text": "Uncle Frank was a good road trip film that deals with many difficult topics about homosexuality and acceptance of it and in that regard film did a very good job.Bettany as character was very good and he give one of his best performances but his character was also little unlikeable and i wasnt able to connect to him in a ways that i wanted.His partener in other hand was very good and likeable and he was able to bring some humor in a little hard film and joy that leaded it forward.Uncle Frank was a good film with a staff that is important and revelant this days"}, {"id": 41, "text": "Relevant with current time of the democrat vs Republican discussion. Great acting by the leads. sttong characters... Sophie reminds of young Melanie Griffith..."}, {"id": 42, "text": "This might have been better if the story were not told with such childish simplicity. The acting is not really that good and pretty much everything is predictable. The sweet moments are overly cloying. It's an average film, just not a spectacular one!"}, {"id": 43, "text": "Not a bad film but there was a lot of triteness and hackneyed dialogue. I wanted to like this movie but the constant intrusions of stereotyped features were very distracting and detracting."}, {"id": 44, "text": "In the early 70's america. its wellacted , it has a nice pace, but it jumps too easy and too fast to a happy ending. there are many aspects elaborated here, but the most protruding is the north /south view on the topic.i'm a nomo and as in every symphonic orchestra there are them pulling a trombone or blows the walthorn, or just playing the fagot, but who is really homosexual among them is hard to find. they have always hid away from the limelight, and when revealed everything may happen, some of these consequences are deliberated in this film and filled me with lots of sadness and disbelief.im happy that the world has become a warmer and safer place for lgbtq+'ers than 50 years ago, so this film joins the line of proper genderistic movies made lately. its a recommend from the forever grumpy old man."}, {"id": 45, "text": "Would have rated it higher but felt the Southern  stereotypes were overdone a little ala Hillbilly Elegy (which imo this movie far surpasses). It has a sense of realness in an age of vapid Hollywood tripe. I highly recommend. Casting is excellent."}, {"id": 46, "text": "This was such a great movie. I don't mean 10/10 in best film ever, I mean 10/10 it made me so happy and sad and I think that's what a great movie should do. Wally's character, I fell in love with immediately. I think it lets you fall in love with gay culture organically and that's the only way to fall in love, otherwise it's just forced and eventually rejected. Very well written, in how the characters responded to Frank. I like that not everyone was knocking down the door to accept him, because that is they way the world works, for you and against you. I was postponing watching this because I knew it would get me crying but I'm glad I did. It was good watch."}, {"id": 47, "text": "Beth (Lillis) is part of a simple South Carolinian family lead by scary, bitter but adored patriarch (Root). She is particularly fond of her intelligent, worldly wise Uncle Frank and looks him up whilst in college in New York only to find out that he's gay and cannot face either his past or his family. When his father dies, he and Beth drive back to go to the funeral and to face up to his issues.Bettany is fabulous as Frank, neatly moving between humour and heartbreaking drama. He is very well supported by Lillis and Macdissi (very funny), with Lillis the guiding light ensuring everyone's path to redemption is properly considered. Overall a heartfelt, witty and well crafted drama with not a bum performance on show."}, {"id": 48, "text": "Beautiful, touching, funny. So well directed and perfect acting. What a gem!"}, {"id": 49, "text": "This movie is great. The story it tells is told in various other shows and movies. And sure it hit all the cliche-points you would expect. Including the 'happy ending'. But it's the acting that helps this movie up a notch from just good to great. Paul Bettany nails it as titular character Uncle Frank and Sophia Lillis is the heart of the movie as his neice Beth. But the best performance from this movie comes from Peter Macdissi who plays Frank's lover Wally.The only real 'problem' (besides the cliches) I have with the movie is the way it's marketed. Everywhere the road trip and the 'unexpected' joining of Wally is prominent. But that's not what the movie is about. The movie is about Frank's struggle with his secret, his problems with his father and his past. And yes, they are driving. And sure there is some humor. But this is really a drama and not a comedy. I can see why people who go in this movie expecting this would be disappointed."}, {"id": 50, "text": "I watched this movie not knowing anything about it. I'm a Heterosexual Latino Male who has been married for nearly 40 years. I'm also a Christian who believes in the man- woman relationship. Nonetheless, this movie touched me in a very profound way. I felt moved to feel the pain of those who struggle to be someone they are not... because of the pressure placed on them. We all need to accept a person for who they are. We cannot judge anyone or pressure them to be someone they are not. This is what I got for this movie. I'm glad I saw it and believe others will be glad to see it as well. The Actors did an excellent job portraying their roles. I give them all a standing O. Definitely a movie which can be discussed and debated by anyone who cares."}, {"id": 51, "text": "I don't often write reviews and have never given a 10. However, had to recommend this gem of a movie. I adored Wally, his smile &amp; laugh are contagious. Paul Bettany and Sophia Lillis are incredible. A must watch."}, {"id": 52, "text": "It is a heartaking journey to discover yourself and your relationship with your family!"}, {"id": 53, "text": "Alan Ball who wrote the classic American Beauty writes a good script here which while it does not quite measure up to the former, does play well but stops short of finishing. The ending almost feels like it is stopping in the middle of every story line except one. The one is the tragedy that undercuts Uncle Franks life.While I give the entire cast kudos in this one, Sophia Lilli as Beth is very good and sort of a anchor around the story. Her character is sort of the narrator and the story of 1973 is presented mostly through her eyes. This is the kind of role that is not the lead here, but it is the essential one that makes the story of the film come together.She presents Uncle Frank as a hero in her life early in the film and then like an onion being peeled layer by layer, the story of his life unfolds. For a lot of the film, the story then becomes slightly too predictable. The flashbacks that Frank starts having after Beth asks him about his first sexual experience do take on a special importance at this point. This is the poignant part that draws the viewer in.Franks first love turns out to be a tragedy in more ways than one. It seperates him from his father. Then he takes his fathers advice and destroys a very special but taboo relationship. For a while I wondered if there might be more to his lovers suicide than the film goes too. In the end though thankfully it is not. It would have been too easy to have Franks father drowning his sons lover and this story avoids that trap.Instead, the focus is more Frank being condemned by his father who uses the wrath of God speech on him to indirectly cause the tragedy. Meanwhile, as soon as Frank grows up, the eldest son moves to New York City. Because Frank is Beth's hero, when she turns 18 she moves into the city apartment he shares with Walid. This is when she finds out the true story of Uncle Frank and becomes close to him.There is one weakness that is Hollywood here. I am not sure why but whenever there is a gay male couple in any film, it seems they are always presented as being kissy-faced much like any Heterosexual couple. To me this never rings true in any film. I believe it short changes all gay people to present Gay Love as being the same as regular lovers. Films just keep falling into the trap that these relationships are the same. No Human relationships are all kissy face. To me films try to present it this way to make all relationships look the same. This just does not work for me in any film or tv show.This film is an Amazon Studios production, and it looks as good as any movie production on film. It is nice to see a drama based upon characters and not cgi special effects. Thanks to the way Beth narrates the story, and the effectiveness of the narrative it does pull the viewer in. By the time Franks father dies, it is quite predictable how the coming out of Frank to the rest of the family happens. The results go from tragic to great and that is heart warming. Mothers always know with Franks mom is a strength though I am still wondering about that spider in his Aunts hair. Does her hair represent the completion of the web this story weaves?"}, {"id": 54, "text": "Alan Ball you are the reason we started watching this movie initially. However what a BRILLIANTLY written, well acted, heart-felt, tear moving, laughs, and welcoming, overdue story! Moved us in so many ways, we become immediately drawn in from-the very start of the story, and our hearts stayed til the very end! Bravo!!"}, {"id": 55, "text": "An amazing movie about dysfunctional family, love and embracing trueself! Felt really good after watching this, very few movies will leave with that sense of feeling. Fantastic storytelling and amazing cast, Paul Bettany will get too many awards for this and he will be one of the contenders in Oscars for Best Actor! Great job by the whole team and thank you very much for such beautiful movie, Hats Off!!!!"}, {"id": 56, "text": "Alan Ball makes the best cinema in series and movies with the best dialogue and acting! Paul Bettany is so great with Sophia Lillis. The cinematography is so beautiful and soothing the way atmospheric tone; Uncle Frank is such a magnificent film all around! The music couldn't have been any better too. Also the sexuality is so charmingly perfect."}, {"id": 57, "text": "Bettany was very good as the closeted professor hiding his dark secrets from his family. His Arabian boyfriend was very good, if slightly too camp, al la Nathan Lane in birdcage. The fathers acting was very good with his disgust for his sons deviency. I thought the family came around a little too easily at the end to force a happy ending. However, good road movie."}, {"id": 58, "text": "It was a very good movie. Hope people stop this discrimination based on sexuality. After all, God had created everyone and all are equal."}, {"id": 59, "text": "Uncle Frank has tons of pain and agony coupled with love and support. For those that require it the most. I haven't seen a film that made me feel more for a character in a very long, and this film tugged on my cold blooded heart strings."}, {"id": 60, "text": "What a Great movie.. Salute to the Director, Actors and everyone who related to this Movie.. I know that God doesn't Exist but If He is then he Loves all of Us... We the People who created the nonsense and Throw by God's Name"}, {"id": 61, "text": "Great flic built on some serious subject matter. Acting was incredible. Characters that you really truly care about. Some really funny moments thrown in."}, {"id": 62, "text": "This movie is just beautiful. Heart breaking. Heart warming. Please watch. No... must watch."}, {"id": 63, "text": "Beth (Sophia Lillis) is from Creekville, SC. She respects her Uncle Frank (Paul Bettany) because he is intellectual and respects her. At 18, Sophie leaves home to attend NY University where Frank teaches. When Daddy Mac (Stephen Root) dies, they travel back home along with Wally (Peter Macdissi). Frank is gay and other than Beth and his sister, no one in the family know, at least at the moment.It was a very well acted drama with the proper amount of comedy and era realism.Guide: F-word. No sex or nudity."}, {"id": 64, "text": "Wasn't expecting much but this film is great, the acting is so good. Very moving had me in tears. More like this please Amazon."}, {"id": 65, "text": "This movie is excellent. I gave it a ten because it deserves a ten. The script, the acting, the direction and setting are exemplary. The plot could have fallen down a familiar rabbit hole of becoming too heavy or even sappy but it does not do that. It intelligent and emotionally charged throughout. Even the quiet moments are filled with passion. As a teacher, I always said if you earned and A, you get an A. This film is a ten."}, {"id": 66, "text": "I don't usually write reviews, but after watching Uncle Frank I feel compelled to. I had not heard of the movie and because of that I want to help spread the word. This was a beautifully made film, expertly written and executed perfectly by the cast. It moved me and I feel privileged to have watched this. It's funny at times and very poignant and heartfelt. Please take the time to watch and enjoy this film! You won't be disappointed!"}, {"id": 67, "text": "The film works because you can swap the lovers sex, religion, ethnicity...... and it will always work. It's quite sweet"}, {"id": 68, "text": "I never thought someone can show a gay love story with so much cutness and deep meaning at the same time. So beautifully shown and not just that but also how families somewhere deep down know their members how they are."}, {"id": 69, "text": "Why? Because it's a true piece of many lives of men like my father. I had a front row seat to this story in almost it's exact form and matter at almost the same exact time, add one year. So don't be afraid of what you may not understand, don't deny something or attempt to invalidate it with statements that demonstrate a willful ignorance or denigrating righteousness - this only makes you insignificant within the scope of humanity. Instead look into yourself with a desire and hope that you are capable of discovering that you possess compassion and understanding for others. This movie is NOT about religion or politics, it's about real people, all of them, that existed within a place and time."}, {"id": 70, "text": "Love the acting, but the story went nowhere. Not something I'll ever watch again. Actually.... Very Boring"}, {"id": 71, "text": "Touching story. Great acting by all. But the scene near the end of the movie with Jack's clothes by the lake was an unnecessary plot hole. Wally and Betty would not leave the lake and go back to the motel. They would have waited and called the police. Did they just leave the extra car there? If they drove it to the motel, how did Jack get back? Small point I know, but it's either sloppy directing or writing."}, {"id": 72, "text": "This would be have been a higher rating only for two big faux pas.The first was Frank Sr. mentioning the disease that was striking gays as punishment when he comes across Frank Jr having his first sexual experience at 16. This was the year 1944, AIDS wasn't identified until 40 years later.The second was Frank's niece and partner walking away from the scene where Frank disappears into the lake. in a state of grief.Surely they would have called police/search and rescue and not holed back up in the motel wringing their hands.These flaws spoil a potentially good movie for me and I am surprised that Alan Ball, a director and writer I have long admired didn't pick up on them.A great cast, lovely photography.5/5"}, {"id": 73, "text": "I'd watch anything with Paul Bettany or Margo Martindale in it, and here I get them and a number of other terrific actors just acting the hell out of a moving script. The music is also perfect.There's a sad story and a lot of humor and bittersweet moments as well.I pity people whose hearts are so small they can't watch a story about love like this. May the Goddess grant them mercy and a larger heart."}, {"id": 74, "text": "But I enjoyed the story, no matter how predictable, and the acting was mostly Grade A. I think the writers and director and cinematographer were trying to make a Southern goth tale and just missed the mark by a bit but I enjoyed it nevertheless. Good effort AMZN and all."}, {"id": 75, "text": "Wont give any spoilers but a stupid ending to a story so if you're want to waste 2 hours of your life go right ahead. I won't stop you. SMH"}, {"id": 76, "text": "Enough with all the gushing about this being a brilliant masterpiece and all the other overblown adjectives being spewed here. Yes, the film is well-made and memorable and there should be more like it, but it's also an infuriating and disturbing reminder of all the gay people who've had fathers like Frank's as well as how many countless young gay men have taken their lives because of the hatred, abuse, and persecution they were subjected to in their lives, especially back then. It left me wanting to punch the nearest christian homophobe. Wally's character had his moments, but was basically a stereotype -- and what was that on his head? I was too distracted by the niece's mousey demeanor and bad hair to form an opinion about her character."}, {"id": 77, "text": "I love this film!!! It's moving, funny, corky, is just great!!! Paul Bettany is believable; he deserves the best actor nomination! The fantastic thing about this film is that all the Characters played phenomenally by all the actors. The niece, the partner is lovable. The father, brother, sister in law is corky. The legendary actress Lois Smith played Aunt Butch! She is great! His mother, played by Margo Martindale she is always amazing. I love that scene when she is talking to her son. Oh my Gosh, it is that good. The niece, played by Sophia Lillis, and his partner, played by Peter Macdissi, they deserve a supporting actor nomination. This film is a perfection, one of the best of 2020."}, {"id": 78, "text": "Great acting by all. It's touching, funny, entertaining,"}, {"id": 79, "text": "4 out of 5 stars.Uncle Frank is a good drama film about Frank (Paul Bettany) and his niece played by Sophia Lilis. Which he is gay. When his father passes away. He and his niece go on a road trip to visit the family. Which they do not know of Franks secret.It is a strong emotional plot. Frank dealing with his family. Which causes him to drink. After a troubled past. And his father despising him. Sophia Lilis is the only family member that is accepting of who he is.Great performances from Paul Bettany and Sophia Lilis. Strong drama and script. But with a heartwarming ending."}, {"id": 80, "text": "Absolutely outstanding performances by Paul Bettany and Sophia Lillis. A young girl from the south leaves to go to college in New York where her uncle is a professor. When the family suffers a loss and they have to travel home for a funeral she learns just how horrible family and life can be through the eyes of her Uncle Frank."}, {"id": 81, "text": "This movie depicts the real agony of coming out to your family. Has great actors and is directed beautifully. I cried very much throughout the movie. But, at the end I got this sense of hope and happiness with the outcome. Strong scenes and great soundtrack."}, {"id": 82, "text": "Charming coming out tale. You always know where this is heading, but it pushes all the right buttons and Sophia Lillis is one to watch for the future."}, {"id": 83, "text": "This film is beautifully personal and warm with touches of humor and pain that is Alan Ball's signature. A phenomenal cast makes this one of the best films I've seen this year."}, {"id": 84, "text": "What a movie. Perfectly timed at roughly 90 minutes. Excellent acting, the characters are memorable and the story is wholesome while tackling a tough subject of being gay while growing up in the south and the trials and tribulations of being such.I can see how this won't be for everyone. There isn't anything crazy and frankly, save a couple F bombs, could have been a pg-13 movie. I'm glad Hollywood (or at least Amazon ) is making more LGTBQ (forgive me if I didn't get that right) movies especially if they're as high caliber as this one was.I'm a straight male with a family and it upsets me that even 40 years later (from the time of the films setting) that being who you are is a taboo subject, often met with rejection. Be who you are, not who people want you to be."}, {"id": 85, "text": "I read the synopsis and all I could relate it to was Little Miss Sunshine ,maybe it was uncle Frank , but hey this film is far far different.The first part introduces the main characters and contains humour as the story builds. The second half just blew me away ...so powerful, emotional and soul searching. I was reduced to tears and not ashamed to say it took me a while to calm down. It triggers these kinds of emotions. Perfectly acted and beautifully told. Dont pass this one by."}, {"id": 86, "text": "Outstanding cast and performances plus a compelling story. My only complaint is that I wanted another 30 minutes to fill out most of the scenes. Alas, funding did not permit. Paul Bettany was amazing, Sophia Lillis was mesmerizing, and Peter Macdissi brought great heart to the movie. One of the best movies I have seen."}, {"id": 87, "text": "I must admit, when I first heard about this movie I thought, OK, another gay homecoming movie (I am a gay man, by the way), but this movie really touched me deeply. The acting was exquisitely nuanced and very honest, with none of the usual gay person confronts disapproving family cliches that often pop up in movies of this genre. If you enjoy movies that make you realize how very messy but wonderful life can be (as I do), you will be moved as I was."}, {"id": 88, "text": "Really bad movie to be honest I didn't enjoy it however."}, {"id": 89, "text": "Very Nicely told storyline. Does not hold Any punches back. Important part of the f history to deal with"}, {"id": 90, "text": "Or is it Paul Bettany's horrendous southern accent? Bugs me so much I had to turn it off! And the hateful hicks he calls a family. It's almost Deliverance, sheesh! I came out at 19 in1969 and never hid a thing. Part of me hates the character being such a door mat and not standing up for himself. Turns out he's a self-hating homosexual who at 46 still doesn't have the balls to confront his family. And still a little boy yearning for his Daddy's love! Pathetic, not romantic.. Ok, it's th Deep South, but he moved to NYC. At that time NYC was already very liberal, so I don't get the hiding when he's there. 😡"}, {"id": 91, "text": "If you like Green card you probly love this but for me that movie was far superior in everyway. The acting is fine and I think Sophia Ellis will go onto bigger and better things. But il stick with green card over this everytime. Hence the 5 rating because I just think this was tryin to cash in on that great movie."}, {"id": 92, "text": "I was really surprised I was going to like this film. But I really really enjoyed it. There was something just nice about it if that makes sense."}, {"id": 93, "text": "I was cool with the movie, it was interesting, then came the stupid Hollywood representation of Arabic culture. where you could have created an impact if it didn't sound so stupid to an Arabic viewer. The boyfriend is from Saudi Arabai with a Shami accent even when he talks to his mother. Holding stock photos of someone lazy googling Arab... the women looked like she's from Yemen and the kids from modern UAE. But who cares right? It's a small part. Why do accurate representation or research in 2020? Why waste the time? It's all brown to an American audience. Enjoy the movie."}, {"id": 94, "text": "Its a extremely okay film. Good actors tho, and also production is nice. But not sure if I liked it."}, {"id": 95, "text": "I do not understand why Wally is Saudi, not Lebanese since the movie is not based on true events and the guy himself is Lebanese!?!!! His Arabic accent is far from Saudi! Something that the producer did not do a good job at! Good movie but the Arabic character played as Saudi is a limitation!"}, {"id": 96, "text": "Cut to the chase....uncle Frank goes swimming but is assumed drowned/suicide niece and partner don't call for help or inform family, they just take his necklace and car and return to the motel. Also father discovers son making out with boyfriend but never discloses this fact that to his wife or family, but the motel owner knows! Highly unlikely and ruins an otherwise perfect film."}, {"id": 97, "text": "We really enjoyed this. It was a very moving and accurate portrayal of what it was like for gay people in the 1970's. And the actress that played the young niece, Sophia Lillis, was phenomenal. I've never heard of her before, but I think she has a good career ahead of her.The only thing that didn't work for me was Uncle Frank's partner. The whole scenario of him following Frank as he went home for the funeral just seemed unbelievable. And the actor in that role just didn't seem right (I know he's the partner of the director). He was badly miscast.Overall, enjoyable and moving."}, {"id": 98, "text": "Frank's mama talks about going to Food Lion. At that time it was called Food Town. The name was changed to Food Lion in 1983."}, {"id": 99, "text": "Pleasantly surprised, although I shouldn't be considering it's Alan Ball. Great performances. Brings up a several relevant social issues without ramming it down your throat. Recommend."}, {"id": 100, "text": "Well executed in the acting, Believable characters, very heart felt. Time line and story shifts that make the flow seem choppy, makes me think that a-lot ended up on the cutting room floor."}, {"id": 101, "text": "A story of two men who struggle in different scales being homosexuals during seventies! It's mind blowing, it shows the history of homosexuality in two different countries, even if the Saudi part wasn't clear except for 1 line maybe, but the attitude of waly towards Frank and how thirsty he is to meet Frank's family shows how much he struggles with his own situations, far away from his family, Frank's acting is beyond imagination especially when he knew what his father wrote about him, Colors are wonderful, well written, acting is just amazing!"}, {"id": 102, "text": "A good movie overall with a nice chemistry between the actors. Enjoyed it. Except the last 20 minutes or so. Felt a bit forced that Frank, a literature professor in NY, had a melodramatic crisis towards the end because his dad (still) didn't approve of him being gay at the moment of his death. It felt unrealistic that an intelligent man in his 40s would act in such a melodramatic way to the (perpetual) disapproval of his dad and because the death of his father sparked a memory of an event that took place in his youth. Also the scene where he falls down in his mother's lap with his head bent down is just akward. Again, why would a middle aged gay man having lived in liberal NY still want to seek the approval of his mom and/or dad?! Being drunk or not, it just felt bizarre. A Disney ending to an otherwise authentic story."}, {"id": 103, "text": "If the reviewers were without family during the holidays, they would see the beauty of this film."}, {"id": 104, "text": "This movie was heartwarming and sincere and clever. I think the storyline could have had another run through, but I enjoyed the whole thing. At one point I started playing a game on my phone, but the acting was so good that I felt compelled to pay attention. Out of respect or entertainment, I'm not sure."}, {"id": 105, "text": "I was so excited when I saw Amazon had a new movie both written and directed by Alan Ball. I had seen absolutely no promotion or anything for this movie at all which was strange and it really deserves some. It was really great.I didn't know much about the story going in and I think that it was a fresh take on this type of story. It kind of avoid some of the same old trappings and if it didn't avoid then it found away to make them more fresh or just tackle them from a different angle.The script is amazing. I love the dialogue that Alan Ball writes it feels so bombastic and real. There is a flow that takes away the stiltedness of words on a screenplay.I really enjoyed the performances too. They were really heart wrenching at times and done with care. Even the more subtle ones really stand out against the more dramatic ones.I was also surprised what it was pretty funny in the beginning. I found my self laughing more than I thought. This does end abruptly in the middle of the film however.It's a really well made film and I am sad that it didn't get more attention and publicity because it truly deserves it."}, {"id": 106, "text": "So this weekend the London Sundance Film Festival is happening online and I am going to watch three of the films online over the next few days and the first one which I have just finished watching is called Uncle Frank and here is my review for it. The premise of the film is in the 1970's where a man and his 18 year old niece have to travel home where they are joined by the mans secret gay lover.Main Character Paul Bettany of Vision fame in The Marvel Cinematic Universe plays Uncle Frank here and I thought he was superb here. He gives a truly memorable performance and it is really emotional, the film focuses on how living this secret life has affected him and how even though he is intelligent it doesn't change the fact that he is scared about living his life. He is very charismatic and charming and just leads the screen very well here.Supporting Characters Sophia Lillis is in this film as his niece and this girl is having a great 2020 in terms of her star growing. I loved watching her on I am Not Okay With This and she is great here as well. She does kind of feel like a background character towards the end of the film but she does a great job in her role and I thought her and Bettany had really good chemistry here. Peter Macdissi plays his gay lover here and I thought he was a fun addition here, he is very different to everybody else here, he is more vibrant and over the top but I just liked him here and thought he was a very fun part of the film. The rest of the supporting cast also do a really good job in there smaller roles and add something to the film.Story The story deals with many important subjects and themes, it is a film about acceptance and understanding people which is well done. It deals with the characters and there personalities well making the impactful moments hit in a larger way then I expected. Though this film also does fall for some forced emotional story elements, there is one in particular that felt wasted and didn't quite work and felt a little bit forced and like it had an agenda.Script The script here has some good dialogue, it has the drama and emotion and actually some pretty funny moments which helped the flow of the film. But as I mentioned there are some forced moments that pretty much comes by weaker writing, that distrupts the flow of the film at times.Style The style of the film does a good job of making the audience feel the way that you are supposed to. You will be upset when you are supposed to, happy when you are supposed to and laugh when you are supposed to. But this film does have some pacing issues, especially when the road trip aspects of the film take place and this film clocks in at 90 minutes which made it feel a little short for me as I thought there as maybe a bit more story to tell.Overall Overall, I liked this movie. It tells some important messages and with good acting makes it worthy, I would say this is a film for film fans I think most casuals won't be a fan but if you are interested in good stories in film then this might be worth a watch."}, {"id": 107, "text": "I only started to watch this movies because of my love and adoration for Paul Bettany. Ever since A Knight's Tail, I have watched everything that he is in. That said...I was blown away by all of the other amazingly talented actors who came together to make this a tasteful, truthful, honest, and moving piece of artistry. I cannot imagine what it would have been like back then for people who were in love with same sex partners. One of my dearest friends is a homosexual man, and I love him as much as if he was family. My question to people who say it's a choice is......I was never asked what I wanted to be, When did they get to? Everyone just IS...period. And I also say if it is a choice, why would someone chose to be belittled, looked down as if they are not as human as everyone else, and be treated differently? I know it is not the same, but I am a recovering alcoholic so I understand to be something that just is in my chemistry that I would never wish on anyone...I do NOT want to be the same as everyone, but I cannot change the person I am. I just treat people like I want to be treated. It doesn't cost a thing to be kind and accepting of yourself and anyone else who is not the same...life is so much richer and happier that way. I LOVED this movie and HIGHLY recommend it to everyone."}, {"id": 108, "text": "He was the only adult who looked me in the eye. Beth (Sophia Lillis)Beth is a young girl in Creekville, S.C., in the early '70's, facing changes of a high magnitude. She'll be going to NYU and finding out that her beloved Uncle Frank (Paul Bettany) is gay. Such a revelation in The Devil All the Time and Hillbilly Elegy would have resulted in the mayhem those two films this year would be comfortable with.In Alan Ball's more tender drama, Uncle Frank depicts sweet relationships of acceptance countered with ignorance and violence of a different kind: shunning or shaming but not physical abuse. The coming to terms with gayness is most often quietly disturbing or accepting.In the heavy-handed motif of being yourself, niece Beth is lectured by her uncle, and she turns it on him as he resists telling his family he's gay. The most joyous relationship is NYU prof Uncle Frank with his open-hearted niece, who anchors his love when he comes unmoored by his family.In second joyous place is Frank's companion, Wally (Peter Macdissi), whose Jewish-Arabic mix is a signal of hope for acceptance. The polar opposite is Daddy Mack (a terrific Stephen Root), who carries the burden of the South's prejudice towards gays. Countering him is Mammaw (the always-reliable Margo Martindale), from whom you could bet acceptance. Ball keeps the tone soft with the possibility of police interference if the male couple were discovered. Such is the way the South was made 50 years ago, and then again, the North in its own slow-acceptance way not a whole lot different. It's humans we are talking about in the end, and in Uncle Frank humanity comes off not bad at all.Enjoy the depiction of strong family at this holiday time, even with its resistance to progress a tad too slow. Look how long it took us to accept Donald Trump? And some still don't.Love him and let him love you. Do you think anything else under heaven really matters? - James Baldwin"}, {"id": 109, "text": "You wanna know what it's like growing up, in the closet with a homophobic, religious father when gay wasn't widely spoken of? Watch this.Mercifully, my own father wasn't the same as this one, but he still kicked me out for being different than him. Twice. And thankfully, I didn't experience all what this Uncle did, but the setting was the same.Uncle Frank is thoroughly admired by his niece and all-but shunned by everyone else in his family. He's okay with this being hundreds of miles away from them and living his own wonderful life in New York City. When tragedy strikes his family, he's forced to face more than he can handle.Lucky for him, and I mean INCREDIBLY lucky for him, he has support from his closest loved ones. Still, the burden is more than most can bear. And I do empathize, tremendously.It's definitely a tear-jerker, and maybe because I lived a lot of this. Maybe, also, because of the stakes, the story unravelling here. Helps we had all-around great and realistic performances, cinematography and direction. I can see a multiple of Oscar Noms for this. Well, IF there are Oscars for 2020.Highly recommended and I hope the world's becoming more progressive. Hopefully, not too many more have to deal with this.***Final thoughts: Didn't think I had too many more tears in me, but they started towards the end (no spoiler) with the flowers to the mother...that definitely did it."}, {"id": 110, "text": "IN BRIEF: A road movie about a closeted gay man that veers off the road pretty fast.JIM'S REVIEW: (MILDLY RECOMMENDED) It's back to Hee Haw Country as director/ writer Alan Ball gathers all the cliches that one could possibly imagine about a dysfunctional Southern family and puts them to good use in telling his tale about the eldest son being gay during the early 70's. The results are innocuous and interesting, although the plot becomes more contrived the closer we get to the Bledsoe clan on a road trip literally going to hell.As told by his idolizing niece Beth (Sophia Lillis), Uncle Frank is a successful professor who moved up north to get away from his crazed family and live his secret life of sin, where else (?), but in bohemian Greenwich Village circa 1972. He sporadically visits the family until one day he is forced to return. He takes a road trip with modern-thinking Beth who learns about his secret life with Wally (a woefully miscast Peter Macdissi).Paul Bettany play the title character, a man haunted by his past, and he is very good in the role. He is surrounded by a wonderful ensemble that are better than their material: Judy Greer, Stephen Root, Steve Zahn, and two of the finest actresses on screen or stage, Margo Martindale and Lois Smith. These actors' masterful skills are the driving force in this movie.The major flaw is that the relationship between Frank and Wally is never convincing, mostly due to the writing and Mr. Macdissi's charmless performance. Wally's Arab roots would certainly make him more savvy than naive about homophobia, especially with all the violence inflicted on gays in his native country, so his actions going south would have been more guarded as written and portrayed. As the film nears its conclusion, Mr. Ball has piled up far too many trite situations among his stock characters so that all credibility is lost along the way, especially in his casual handling of gayness during the era. (After all, homosexual behavior was a criminal offense punishable by prison in South Carolina and many other states in the South back then, but that issue seems to be just a slap on the limp wrist in this movie.)That said, Mr. Ball's cause is admirable. He wants to make a heartwarming drama and sound a rallying cry for tolerance, but the whole venture rings hollow. Instead, you'll just have to settle for Mr. Bettany's understated performance in this earnest but shallow film. (GRADE: C+)"}, {"id": 111, "text": "Greetings again from the darkness. Alan Ball has been behind such high profile projects as Best Picture Oscar winner AMERICAN BEAUTY (1999), Six Feet Under, and True Blood. This time, he is writer-director-producer for a film that he partially based on his own father. Repressed homosexuality, alcoholism, death, and family dysfunction all play a role in a film that starts out beautifully insightful and then morphs into something totally different.Paul Bettany stars as the titular Uncle Frank Bledsoe. When we first see Frank, he is the calm amidst the chaotic family gathering in their tiny hometown of Creekside, South Carolina. His 14 year old niece Beth (Sophia Lillis, IT) serves as our narrator, and she quickly discloses her admiration for her favorite uncle. He's a college professor at NYU, and the only adult who looked me in the eye. He even wore after shave! The two are oddities in this family since they both love to read, have deep conversations, and can't escape Creekside soon enough.Beth is too sheltered to realize that Frank has kept his homosexuality a secret from the family. She's shocked at how cross the family patriarch Daddy Mac (Stephen Root) acts to his son Frank, which contrasts to his affinity for his other son, and Beth's father, Mike (Steve Zahn). A terrific ensemble cast fills out the family: Margot Martindale as Mammaw Bledsoe (Frank's mother), Judy Greer as Kitty (Mike's wife), Lois Smith as Aunt Butch (Frank's stuck-in-the-past Aunt), and Jane McNeil as Neva (Frank's sister).We flash forward 4 years and Beth is now a freshman at NYU where her favorite uncle is a professor. Of course it doesn't take long before Frank's secret is revealed, and Beth meets his longtime partner Wally (Peter Macdisi, who is director Alan Ball's real life partner) and their pet iguana named Barbara Stanwyck. When the call comes through that Daddy Mac has died, the film shifts to the road trip portion of the show, and the excellent tone set in the first half is shattered.With a shift to Frank's perspective, we experience his flashbacks to childhood and what caused the rift with his father. The memories of his first encounter with another boy turn horrific, and explain much about why Frank and his closed-minded father don't have a relationship, and why Frank has a nasty history with booze. The road trip itself is enlivened thanks to the enthusiastic presence of Wally, a man with a good heart who tries to always be there for Frank. This is a coming of age trip for Beth, but her role goes pretty quiet until the ending.The story has elements of small southern town contrasted to New York City, and the pent up frustrations that accompany a life of closeted homosexuality and lack of honesty with one's family. The bond of family outsiders could have been a full movie unto itself, but filmmaker Ball chose to explore numerous emotional points, rather than one. The unforgivable nature of Frank's dad provides an emotional wallop that embraces the melodrama of the film's second half. It's sure to draw out tears from more than a few viewers, and a film that connects like that, surely has something to say."}, {"id": 112, "text": "I think it's due time to give Paul Bettany his praise as an actor. This is another great performance to add to the list by Paul as Uncle Frank. Peter Macdissi is great as Walid/Wally, definitely Uncle Frank's stone pillar of love and support.As I watch this movie, I find myself thinking that this is not a unique situation that Frank finds himself in. How many individuals still find themselves in this exact same internal tug-of-war between being true to yourself and not rocking the boat? It has been roughly 50 years from the time period this movie is set in.... has much changed?As humans, we just want to be accepted. Accepted for how we think, accepted for what we believe in and most importantly, accepted for who we are! I'll never understand why some people (mostly bible-pounding, fanatical religious people), feel the need to express/shove their beliefs and morals into the faces of others?I wish more of society would operate with the 'Mind your own business' approach to other people's lives, especially if it doesn't have any reflection on your own.In summary, this movie is very well made. You should watch it. At the very least, to gain a better perspective on the mental anguish that follows someone who feels or is made to feel, that they don't fit in or are somehow less than others because of PERSONAL life choices.Mind your business people, everyone deserves to be happy.... whatever that may mean!"}, {"id": 113, "text": "It kept my attention all throughout.Now a constructive gripe or three: The overall cadence and tempo were fine, befitting those who cherish the luxury of patience:) The dialogue, at times, was a bit constipated when certainly a visual could've achieved the same result, perhaps better. The subject matter trite, however the dynamic with his niece was special and it came through wonderfully.Paul Bettany simply crushed it. I dig this man's work. Dare I say underrated? If this exists and there's a list I petition the people he be at the very top of it. Lastly, the director seemed to explore more through the lenses of the Perceived rather than that of the Perceiver?I would recommend it to all audiences who exhibit the quality of well, being human."}, {"id": 114, "text": "There are very few films that discuss the anxiety one feels before coming out. There are even fewer films of this sort that takes place in the Deep South. Uncle Frank portrays the very real fear and apprehension such people have to go through. It's a unique story with a unique perspective that's quite enjoyable.Disclaimer: I wasn't sure what to expect before I watched Uncle Frank. I did not see a trailer, nor did I hear many people discuss it. Yet, I'm glad to have discovered this gem of a movie.As someone who grew up in a small town, this film hits home for me. It captures the toxic homophobia that permeates such communities. It also shows the desire to escape that many people living in these communities have.Uncle Frank is both lighthearted and slow-moving at times and it can be harsh and brutal at others. The film shows the struggle and internal battle one has to come out to a family who doesn't understand homosexuality. It's raw yet has a few comedic moments in spots that help break up the tension.Beth (Sophia Lillis), Frank (Paul Bettany), and Walid (Peter Macdissi) make an amazing team throughout this film. The people who don't understand Frank's struggle, understand the innocent naivete of Beth. The people who do understand emphasize with Frank. And Walid... well, he's freaking Walid and I loved his performance. Their chemistry as a team is very natural and beautiful. The film will hit you right in the feels time and time again.Congrats to Alan Ball for writing and directing this masterpiece. It's one of those rare stories that isn't told too often yet is very real for many people.5/5. The first Amazon Studios movie that I ended up liking. That's saying something."}, {"id": 115, "text": "I had no idea what to expect, but to say that I was pleasantly surprised, would be an understatement. Uncle Frank is a beautiful film, but it's also a difficult one. The way it portrays the difficulties of gay people back in the day is nothing short of heartbreaking. What makes this film even more heartbreaking, though, is the realization that in many cultures and societies, nothing has changed.One of the things that I most loved about Uncle Frank was the way it captured the surprise and amazement of someone moving from a small town to New York in the early 70s. To see that world, and how different it was, must have been astonishing. Through the experiences of Beth, I felt like I got to see a glimpse of that astonishment, and I loved every second of it. Early on, it led to some great comedic moments, as well as moments of understanding and discovery. Indeed, one of the best scenes of the movie takes place early on in Frank's bathroom as a result of this astonishment.That scene brings me onto the main trio. They are simply fantastic together. The relationships between them are great, and each supports the other. They are funny together, but they also go through difficulties together. The bonds that they form are what drive this movie forward and make it as enjoyable as it is. If the bathroom scene is great, so is the whole road trip part. What surprised me, perhaps the most, was how funny this film was. Although it deals with a difficult topic and situation, it manages to stay lighthearted enough to make it more than just heartbreaking.By no means is this a perfect film, I don't think that it's even particularly close. There are a lot of great moments, but there are also a lot of moments that add very little to the story. While Uncle Frank can at times be extremely heartbreaking, it's also filled with hope and moments of happiness. And it's those moments, that make this film what it is. They show that people can change for the better and that people aren't always who you think they are. The ending, which is one of the most beautiful moments of the film, is a strong example of that.Uncle Frank definitely surprised me. Although I suppose that going in with no expectations would've caused me to get surprised no matter what. But, I could've also been surprised negatively, and this film did the opposite. It's an important film that not only depicts the struggles that so many people face, but it also shows that there is hope."}, {"id": 116, "text": "This is a newly released Amazon movie. The significance of the title is the focus on Frank, now 46 in 1974, and the issues that formed him starting in his teen years when he realized he didn't have the so-called normal attraction to females. I already knew Paul Bettany as one of the best actors of his generation and here he is superb in the difficult role of Frank.He is called Uncle Frank because Sophia Lillis is his niece Beth and she has the second most prominent role. As an 18-yr-old starting college in New York, where her Uncle Frank is a professor, she has a very quick coming-of-age regarding sexuality and Frank's lifestyle.Back home in S. Carolina where Frank's family remains are yet unresolved issues which only come to a head when Frank returns, with partner Wally and Beth in a road trip of sorts, for a funeral. A number of issues are introduced in the first 3/4 of the movie and at that point I found myself wondering if the filmmakers could pull them all together in a satisfying resolution. And I am happy to report that they did.This is a really good movie, my wife and I enjoyed it, streaming on Amazon. I remember the 1960s and 1970s well, the issues are authentic for the time."}, {"id": 117, "text": "My Review : Uncle Frank - streaming on Amazon Prime My Rating 8/ 10 Uncle Frank is a good companion movie to Hillbilly Elegy written and directed by Alan Ball who wrote such great scripts for American Beauty, and series like Six Foot Under and True Blood it tells a common story of the rejection and bigotry that many LGBTIQ People who grow up in rural or country towns experience not only in Mid West America but in rural Australia also. Uncle Frank is a 2020 American comedy-drama film written, directed, and co-produced by Alan Ball. Frank (Paul Bettany) and his history is partly based on Alan Ball's father so this was a very personal story. Set in the 1970s, Uncle Frank is a road movie about a gay man who confronts his past and explores his relationships with various family members . Writer-Director-Producer Alan Ball wrote the family as living in South Carolina, while he was born and grew up in Atlanta, Georgia. Sophia Lillis is delightful as Beth beloved niece of Uncle Frank Paul Bettany who gives a great performance full of sensitivity while expressing the internalised homophobia that is part and parcel of parental rejection.Beth tells her Uncles story though the eyes of her family . Beth like her Uncle eventually leaves the family home in Creekville South Carolina to attend College in New York and discovers her Uncle Frank is in a same sex relationship with Wally played by Peter Macdissi. When Franks father dies suddenly Wally suggests Beth and Frank drive back to attend the family funeral in Creekville.This is where the heart of the story takes place as Frank relives his boyhood romance and the reaction of his father Daddy Mac who's ultimate insult and rejection is yet to occur beyond the grave. There are some fine performances in Uncle Frank apart from the three main characters I loved the two delightful actresses Margo Martindale as Mammaw who portrays the acceptance and love that so many mothers of LGBTQI children experience when rejected by their father. The other is Actress Lois Smith as Aunt Butch ,where she got that name I'd love to know ,hers is a small role but she is delightfully vague and wise at the same time."}, {"id": 118, "text": "Incredibly touching, well written and acted; Uncle Frank continues to prove writer/director Alan Ball's capability to tackle family drama unlike anyone else.In this comedy-drama set in the 1970s, a gay man who hasn't come out to his family, takes a a road trip with his niece from Manhattan to South Carolina due to a family tragedy.This is one of those films where everything works and has the power to make you feel different emotions. The performances are top notch; Paul Bettany is brilliant, Sophia Lillies is sensational but Peter Macdissi was the star of Uncle Frank. An award worthy role that embodies empathy and is the stand out character in this film. The soundtrack is really spot on for the era as well. Alan Ball's writing has never been better and his directing continues to improve with each of his films. I absolutely loved this film.Follow @snobmedia for all reviews!"}, {"id": 119, "text": "...Until the reading of the fathers Last Will. At this point you don't know if you should laugh at Franks emotional explosion or just give up on this story.This movie is captivating from the very start! Right up to the Last Will scene then the story just sinks into a melodramatic quagmire for everyone involved. Nothing is believable in this closing scene because Frank (for me) escaped his South Carolina stifling and suffocating upbringing and expanded his true self in NYC. He's a well read college professor and I think the trauma if his youth would be an issue he had long ago dealt with.Alan Ball missed the mark on this story ending. And the ending should have been exposing the poison of religion! It is the religious community that destroyed Franks relationship with his childhood friend. And it is religion that destroyed his friend!It's 'beliefs' that divide us! 'Values' are what unite us."}], "reviews_amount": 120}