{"name": "American Pie Presents: Girls' Rules", "titleId": "tt11771594", "reviews": [{"id": 0, "text": "How can the director have the courage to screw up the franchise name.A silly film, of idiots in loveCade the real Stifler, this woman is nothing at all."}, {"id": 1, "text": "The perfect way to destroy the American Pie saga is this movie. Do yourself a favor and never watch it. I will try really hard to forget that i watch it."}, {"id": 2, "text": "It was incredibly bad. It has nothing to do with previous successful American pie movies."}, {"id": 3, "text": "This female centered American Pie flick is sadly a not very funny, completely sanitized film with lazy writing and directing. The worst offense is a very forced feminist message. But before the pitchforks and fire comes out I am all for equal rights, but crudely forcing the message in every Bit of (once) popular entertainment property doesn't work (Well hello Ghostbusters, Terminator: Dark Fate and Charlie's Angels!). This latest gasp of American Pie will go down in history as: the one that effectively killed the once hit comedy franchise."}, {"id": 4, "text": "The movie Girls Rules directed by Mike Elliot, gives an unimaginative and hastily made a mediocre spin on American Pie. The lead actor played by Madison Pettis gives an uneven performance, but she is not the worst thing in this production. The direction in which this movie tried to go made me want to rip off my ears and eyes and put them inside the washer to clean them. I have wasted 1h 35min of my life, while at the same time lost brain cells by watching this movie."}, {"id": 5, "text": "This Movie is Horrible. Predictable Story. Same Type Teenage Drama Which we have seen in many movies before this. Poor Story Execution, Terrific Screenplay &amp; All Star Cast performance Average not very good. Final Verdict: If you have care your time and money then please stay away this movie. Otherwise, as you wish. My Rating: 4/10"}, {"id": 6, "text": "Why is this an American Pie movie? Sucked. I was expecting an actual comedy which should have an R rating not a ruined tittle rated PG."}, {"id": 7, "text": "It's impossible to make a decent sex comedy in which everyone is horny yet all covered up during their sex scenes... But I guess that's what sex comedies in the US are condemned to... Lots of sex and zero nudity... The jokes are not that original either... But if at least the characters freed themselves from such puritanical treatment, it would be fun to watch."}, {"id": 8, "text": "I actually love the American pie movies, but this movie.. It just wasn't good.. I really wanted too, but it sucked. The acting wasn't great the majority of the time, there were scenes that you could tell it was a set and super fake looking, the story was weak, and overall disappointing."}, {"id": 9, "text": "This was the worst American pie ever they need to delete this movie because the girls messed it up go back to men and better parties and where is the Rated R content that's what made American pie this a Pg 13 movie this movie is for young teens Og American pies was for older teens and adults if I had kids I'll let them watch this movie"}, {"id": 10, "text": "Its a movie geared more twords middle school girls. I only watches the first 10 min had to turn it off. Typical Netflix movie trying to social engineer a generation. Who funs and green lights these movies? They should be fired."}, {"id": 11, "text": "ITS DEFINITELY NOT AMERICAN PIE... WTF.. YOU RUINED IT...😡😡😡😡😡😡😡😡"}, {"id": 12, "text": "This is clearly a ghostbusters 2016 type of movie. A male led franchise hijacked by 3rd wave feminists. They think that just because they use American Pie's name they will trick people in to buying this woke abomination.Not going to happen."}, {"id": 13, "text": "You could pretty much just walk up to any dude be like let's do it and they'd be like right here or over there? All in all it was eh.maybe. Nah it was ew."}, {"id": 14, "text": "All of the movies had the same starts and the same return of Noah levenstein; this just isn't the same. The only reason this is even an american pie sequel is because they use the name stifler and not only that but they put the name to shame. This movie is a shame for the American pie franchise and everyone who loves them like me."}, {"id": 15, "text": "This is nothing like American Pie movies. Just woke propaganda in my opinion and not even funny jokes. They finally killed the franchise."}, {"id": 16, "text": "Forced feminism, but then shows girls treating a guy like meat. Not at all American pie style. It is more like a very cheap romantic movie full of teenagers' drama. Okay to watch if you like that kind of movie. But it is not funny as American Pie movies and the story is actually poor and superficial."}, {"id": 17, "text": "The movie wants to be the first American Pie crossed with road trip. I get that American Pie movies are meant to be trash but this film tarnishes the good name of trash. This coming from a guy who sat through American Pie Book of Love. It's got girls trying to be boys and boys acting like girls. Its A complete mess with no real direction. If you want to watch great teen woke film I recommend Book Smart but avoid this one like the plague."}, {"id": 18, "text": "I feel like I've been conned after watching this movie in the name of American Pie."}, {"id": 19, "text": "It had such a cringe plot and just bad acting I really wanted to like it or hoping it would pick steam but thirty minutes into it and I just wanted to shut it off"}, {"id": 20, "text": "You're still clit-blocked by the patriarchyThis is an actual like from the movie.I love the American Pie movies. And how timely that Schitt's Creek is ending, with such incredible accolades from fans and critics. Eugene Levy was in the original American Pie, which was a wonderful movie.Eugene Levy is not present in person or In essence in this horrible, disgusting, pathetic homage to the original. It's a waste of everything, and these actors are terrible. As is the script. Please do not watch this trash, garbage nonsense."}, {"id": 21, "text": "Not sure how this is rated R, so censored and humour is nothing like the previous movies. Follows a cringe boring generic teen romcom story line, expected so much more from something apart of this franchise"}, {"id": 22, "text": "I have literally watched all the previous episode of this movie series and so far this is a huge step down. American pie is usually 🔞 rated, but this one is for kids. Plus it's way too dramatic and predictable. The movie is a failure for me."}, {"id": 23, "text": "This is the worst 2020 movie so far. It's cringey, predictable , forgettable, weak storyline , weak jokes, weak acting , it's definitely not the american pie we know ."}, {"id": 24, "text": "Worst American Pie movie ever...better to watch an animation without wasting time on this movie"}, {"id": 25, "text": "This movie was absolute garbage, dont waste your time."}, {"id": 26, "text": "I thought the book of love was the weakest of the all the films, but this movie takes the cake on weakest on all the American pie. Eugene Levy isn't even in the movie. This movie was more of a PG13 teen movie."}, {"id": 27, "text": "2020 has been full of unnecessarily unfortunate surprises and when you thought it couldn't get any worse- this movie delivered in full force.-this is not American pie -this is not American pie -this is not American pie"}, {"id": 28, "text": "Not sure why the american pie put there name on this terrible piece of content. It started off cringy and not in the way that the original american pie did where its cringy but you care about the characters. This just tried taking the raunchy tropes of the early 2000's and putting a feminist spin on it as a girl power movie with no real comedy or feasible storyline. If bars were open in this pandemic where I am I would have rather gotten drunk and risked dying of the disease."}, {"id": 29, "text": "We've never been more disappointed by a movie in our lives."}, {"id": 30, "text": "I can't remember a movie that I thought was worse than this. The storyline was predictable and acting was awful. I wouldn't recommend this movie to my worst enemy."}, {"id": 31, "text": "If you liked the previous american pies.. You wont like this"}, {"id": 32, "text": "Just cancel 2020 with stinkers like this. An absolute insult to the American Pie family."}, {"id": 33, "text": "American pie just isn't American Pie without Seann W Scott.. I had a few laughs but nothing wow!.. I guess all of the fans are waiting on another original American pie movie... Can we please have another original one.. Or If you want to try something different give us an American Pie Presents The Stiflers or something But give us an Original with Seann W Scott..."}, {"id": 34, "text": "Yes, there's been a few bad American Pie movies, but this one? It shouldn't even be named American Pie! What a joke!I love the American Pie movies (the four real ones), so I had a little hope for this one. But no. Do yourself a favor and don't waste your time on it. Someone just wanted to earn some cash by selling the name."}, {"id": 35, "text": "Turned off after 30 minutes? Just a bad movie all around. Would actually like to see high-school kids not played by 20 somethings. No nudity at all and they didn't even cover up the tattoos on the Asian girl. Only thing American Pie related was one of the girls was a Stifler and acted like the female version of him."}, {"id": 36, "text": "If you are not gonna make AP Movie with original cast then you don't Need to make it. What the hell is this joke? You made this movies for girls but which girls are watch this sh.t? AP is not like Friends or Gossip Girl type job. How did they allow to this movie happen? Those movies are just giving damage to AP franchise and its legacy !"}, {"id": 37, "text": "Same jokes throughout... dumb characters... horribly written... Stifler (the girl) was nothing like a Stifler... they could have made a worse movie, but not much worse."}, {"id": 38, "text": "Definitely not an American Pie movie, but it wasn't HORRIBLE. I'll never watch it again."}, {"id": 39, "text": "It feels more of a RomCom than a Sex comedy which we all love and expect from an American pie film. Nothing to see much, don't waste your time on this."}, {"id": 40, "text": "It really sucks trying to get the news generation way of thinking, congrats you have ruined the franchise. You are going to waste 2 hours of your life."}, {"id": 41, "text": "I feel like I must take some stuff out of the way, before starting to talk about specifics here. I honestly didn't understand the heat this movie got, when the first trailer dropped. For real, I've seen all 8 movies of the series, and... well, the spin offs suck. They do. There is no way around it. There are some feel qualities here and there, but at the end of the day none of the spin offs is even close to the level of the 4 main movies (even tho The Book of Love is the one spin off I think is fine).Still, my point was why the hell should we worry about them making a female focused one? I truly thought it was a fine idea, it made sense, that almost a decade after the last movie (even more after the last spin off) they would do one, we girls as the focus. Sounded fresh, and like the natural path for the franchise to go. So again, I truly went with no expectations (cause you know, they spin offs suck), but that had nothing to do with the concept of the film itself.However, man, this might be the worst one yet. I will try to explain a bit more. I think this might be the best acted of the spin offs, the girls are truly doing a fine job, with the bad story they have. But it just doesn't feel like an American Pie film (we don't even had nudity! - not that it would make the movie better, but like... isn't it like one of the trademarks of the series?). It feels so clean, idk how to explain, it just doesn't feel like an American Pie movie, and that's probably my main complained, it feels like just another mediocre rom-com, with a bit more of sex in it, that's it.I have one other big complained tho. If you are gonna try break traditions in this one, and renovate the franchise, why keep the most stupid one? I thought Lizze Broadway was good in the movie, but did she really needed to be a Stifler? I've been saying that for a while now, she's not the worst Stifler, the one in The Book of Love is by far the worst one, performance wise, and character wise, but man, if you had to keep one tradition, just give me some Eugene Levy, for real, he's the best thing this franchise has, he is 80% of the good stuff there is in the spin off... that was the tradition you should have kept, I couldn't care less if the girl is named Stifler or not. It does not matter.And it's weird, because she been named Stifler is probably the only consistent stuff on screen that keeps reminding you, that you are in an American Pie film, there is literally nothing else.Into more specifics, the story is so predictable... 30 minutes into the movie is crystal clear which girls is gonna stay with which guy, there are no surprise here, nothing that keeps you wanting to see what happens next. And that's it, the jokes aren't funny, I didn't care for the romance, and, besides one or other sex jokes, and actual sex (with clothes) this feels more like a Disney Channel made high school rom-com, than an American Pie movie. The soundtrack probably is a huge part here too, it's just not good, and it helps the feeling of I'm not in an American Pie movie.Again, I think the acting is fine, the girls are good, they have chemistry together, but they don't stay all together for most of the film, and the story just doesn't hold up. But, as I said, I wasn't expecting much from a spin-off, it just, you know, even tho it isn't a completely incompetent film in all elements, it manages to feel like the least American Pie film, of all the spin-off, and, of course, the main movies.So, yeah, to sum up, the acting is fine, but the story falls flat, just like the jokes, and this just doesn't fit with the rest of the franchise. I'm all for trying to revive the series, and I'll probably watch if there is another one in the future, this just doesn't feel like the right way tho, if that's the formula we are gonna go with now, the franchise is just better staying dead. Let it rest.Some bullet points I couldn't fit in the text:The lacrosse callback is cool (this might be the first one since American Weeding to have that)I know the series has some screwed up scenes... but the dude casually starting jerking off, while his roommate is right behind him is SO WEIRD. It might be the most unsettling scene of all the movies for me. Who does that?!!The dream scene with all the drawings is weird, it just doesn't fit.Who still takes pictures with flashlight?What the hell was that scene with their parents and the hoses...?"}, {"id": 42, "text": "The movie is pretty terrible .. not sure how this fits In with the other American Pie movies, very disappointing although watched it through."}, {"id": 43, "text": "10 minutes into it and I turnt it off. As soon as they said they are making a pack.... I said Nope and turnt it off."}, {"id": 44, "text": "Felt like a Disney Channel movie with some very censored sex scenes and a swear word here and there.In general a good movie but no way an American Pie. And how can you call it American Pie without the legend himself Mr. Noah Levenstein!"}, {"id": 45, "text": "6 minutes how much i lasted watching this. So cringe inducing i can't go on.Already got meta messages for safe sex and sexual harrassment. I get it's an important message but this is american pie"}, {"id": 46, "text": "Not even funny. Doesn't even come close to original American Pie films. Wouldn't waste your time on this one."}, {"id": 47, "text": "The movie by itself is a good movie, a movie that you watch it once and say i watched it. However it most certainly did not feel like an American Pie film. Nothing compared to the previous 8 films. They basically tried to clean everything up. And try to deliver the sex scenes in the most non revieling way. And the worst part is that you cant say that its an American Pie movie without Mr. Levenstien. If he's not in it in some way than its not American Pie.Verdict: a good film but its not American Pie in any way"}, {"id": 48, "text": "Cute movie. Kept me entertained. No tie to the original American Pies but I still enjoyed it."}, {"id": 49, "text": "It has a good cause but a very poor execution . The movie highly boring do not waste your time"}, {"id": 50, "text": "The movie is hardly watchable. I barely made it through. absolute total trash of a movie"}, {"id": 51, "text": "Don't waste your time! Lame attempt to continue the American Pie franchise. Time in my life I can't get back."}, {"id": 52, "text": "The premise of this movie sounded great and fun but the execution was horrible. If this movie did not have American Pie as a title, East Great Falls high and a Stifler, it would be just like any other movie about 17/18 year old high school senior girls.. That entire AP spirit is out the Window. Yes it contains sex, booze, parties, awkward situations but without that AP spirit added to them. Not Even Stifler featured in the movie who is a Female, is like Stifler, Even Eric Stifler was more of a Stifler than her. Its ruined. Imagined it would be like the first ones when it comes to the awkward situations but from girls perspecctives.. Worst of all Noah Levenstein Does not even feature in it. Its a waste of time."}, {"id": 53, "text": "Low budget crap that shouldn't have been made. Whoever owns the American Pie rights has milked the concept (which was old over 15 years ago) to death. Anyone that likes this is lying or has been living under a rock."}, {"id": 54, "text": "One of the most disgusting pieces of garbage I've watched in a very long time. Regardless of how bad a movie is, I always watch it entirely but, this one is so unwatchable I could only watch 16 minutes. Do yourself a favor a run like the plague from this one. There is absolutely nothing left from the original saga on this one but the name Stifler, just that, because I guess is the reason you can call American Pie any garbage like this one."}, {"id": 55, "text": "Terrible movie, really struggled to watch it. I liked most of the previous American Pie and American Pie Presents movies but this one is just different. It's basic nonsensical teenage drama about girls struggling to get laid -- and it's not even funny."}, {"id": 56, "text": "The biggest problem to me is the awful fake stifler. But every one is so watered down and trying too hard for something so simple. And that crazy because these movies never felt like it has a rating.Madison dad was boring and strange,The real Stifler is wild , really entertaining, hyper and picks for up many girls from everywhere and everything. Has connections with almost every one. A Daredevil , doesn't need a wingman unlike the movie lol. Her energy as stifler seem very dull and boring. What's actually funny is Michelle and Kayla has more stifler Tendencies than the actual character Stephanie. Kayla was having sex every where and Michelle did kinda everything with her toys , a real freak like stifler. It felt like a Teenage drama movie in high school"}, {"id": 57, "text": "If Noah Levenstein appeared for even 1 second the film would have been gold. It was a good movie, but definitely not alike the classic American Pies. You simply cannot have an American Pie without Noah Levenstein."}, {"id": 58, "text": "Well i went in to this with an open mind as the first one is a teen classic that cannot be replicated easily.This is like the female ghost buster film but with actual comedic moments. It has a clichéd storyline, that one can guess from the beginning, but it is film that is supposed to be enjoyed as it is."}, {"id": 59, "text": "Agree with many of the negative comments, however it isn't preachy or that boring. It is also American ( as name indicates), therefore more watchable than many of Netflix's overseas choices. No nudity is somewhat disappointing, but acting was serviceable."}, {"id": 60, "text": "Waste of time...this is not an American Pie movie!"}, {"id": 61, "text": "This movie was so dragged out. No plot, not a single nipple. How is this American Pie?"}, {"id": 62, "text": "God awful trash!!! Boring, stupid, unfunny, misleading garbage."}, {"id": 63, "text": "A silly film, of idiots in love And he tells the story from the boy's point of view, not the girl's"}, {"id": 64, "text": "My least favorite one from the franchise . The old ones were pretty good specially the cast . But this one has the least likeable cast . I hope they do a better job next time"}, {"id": 65, "text": "It's a disgrace calling this an amarican pie movie"}, {"id": 66, "text": "A film void of humor or raunchiness. Definitely the worse movie of the franchise. Sad to see."}, {"id": 67, "text": "First, this is not the original American Pie. And so many of the review refer to the original. This is a different movie for a different for a different generation from a different gender view point. That being said, they messed up b the adults in this movie, but hit dead on with the main characters. For the first time since the original movie, that actually have young talent. Unlike all the straight to video versions, this has real characters. But over all the movie seemed rushed to market. They could have made this much better. The concept is good, the young actors are good, but got a little cliche. Too many Disney moments. Worth a watch though."}, {"id": 68, "text": "Don't need to watch it to know it's going to be awful. Who the hell actually singed off on this."}, {"id": 69, "text": "I hate it! It ruined the whole franchise. First off. It looks like one of those Disney movies. It sucks."}, {"id": 70, "text": "This is how you ruin a franchise, nothing to do with previous movies."}, {"id": 71, "text": "Why,why???one of the worst movies i ever watched in my life,dont waste your time...."}, {"id": 72, "text": "This could not be further from an American Pie movie. Almost every aspect of the movie (music, animations, theme) steer away from the franchise. Even if it didn't share the American Pie name, it was still a terrible movie. Very predictable. It attempted to be a female empowering film that ended up depicting women as sex crazed zombies with only one goal and are willing to be petty, jealous, and backstabbing to get what they want. It was also a little gross how much these girls are obsessed with sex, toys, masturbation, etc. I would recommend going back to the originals and skip this movie all together."}, {"id": 73, "text": "I seen this in Netflix and got exited but then I saw it's name and was disappointed I watched it and it's just like every other love movie on Netflix horrible it wasn't funny at all they just ruined millions of og fans of the old American pie it tried so hard to be like the old American pie but it was horrible the girl didn't fit in."}, {"id": 74, "text": "I just finished watching this movie. It's a really cute and funny teen rom-com. So, while I don't agree with the current low rating here, I understand why. This cute story would have served itself better by not trying to tie itself into the American Pie franchise. It could have, and should have, stood on its own. It is a really cute movie, but not a classic like American Pie! So putting America Pie Presents at the front of the title, and making one of the main character's last name Stifler (the only one with a stressed up-front last name) was reaching as well as unnecessary and self-deafeating! If you like teen rom-coms, I do recommend watching the movie for its good story and acting, but divorce it in your mind from American Pie. It's not a fair comparison."}, {"id": 75, "text": "It's nice to see a American pie movie where it's the girls turn to rule. I loved the 4 female leads and of course what's a pie movie without a Stifler. I'd have to say Stephanie was my favorite character. This was very funny and yes at times predictable but I enjoyed it for what it is. Definitely worth a look.Tim Treakle"}, {"id": 76, "text": "This one is probably my least favourite American pie franchise a really just wasn't American pie but I still loved it and I still highly recommended"}, {"id": 77, "text": "Despite the 'AP presents' title, there is nothing AMERICAN PIE abiiuot this other than a character with the surname Stifler. It ends there. There's no gross out humour okay, there's ONE scene that's good) the characters are believable or likeable (one is a crazy woman we're supposed to route for) and THERE'S NO JIM'S DAD CAMEO! (can't say AMERICAN PIE if he's not there, sorry, it became a goldren rule).The original script by David H. Steinberg (written way back in 2010) was re-written by some guy who decided to put himself in the movie as the lead's father. He can act... but not write. Sorry."}, {"id": 78, "text": "As a romantic comedy it was decent but nothing close to American Pie. More like the romantic comedies that come from Netflix every now and then. American Pie without nudity is like fries without ketchup. It just doesn't work! The cast was nice, the music was very nice, had some good moments, over all not a waste of time."}, {"id": 79, "text": "This movie is an above average about girls trying to loose virginity. It's not even make sense. They just tried to make a movie about girls. But it's completely opposite to REAL American Pie. It's not even funny. Nobody laughs these girl jokes. They just ruined a GREAT movie with some FAKE feminism. If you liked the original movies you won't like it. I loved all 8 movies but this... This is not an American Pie movie. I would give maybe 5 points if this was not an American Pie movie."}, {"id": 80, "text": "Generic movie . But worse .wants to copy american pie . Come on . Lame"}, {"id": 81, "text": "Nothing worth watching. The girls aren't even attractive!"}, {"id": 82, "text": "Terrible from the getgo weak man give it a skip poor acting weak storyline and a female version of that one annoying person from the original movies"}, {"id": 83, "text": "Not even 1% of the real American Pie movie. No comedy. Only related thing in the movie is Stifler name. Even this woman stifler doesn't act like one. What a let off."}, {"id": 84, "text": "The beginning of the film is wildly funny. Then, the film has a bit more focus on friendship on high school, which is quite heart warming. I enjoyed watching it."}, {"id": 85, "text": "Worst 10 minutes of my life destroying the whole american pie series"}, {"id": 86, "text": "This movie loosely follows the Amercian Pie format and only has one character related, although not known how, to the original cast of characters. All of the familiar themes and raunchy comedy scenes are there along with several cringe worthy comedy spots. There is some good comedic dialog but on the whole the film is missing it. There are several music montages throughout the film and the ending seemed to take way from the plot as it was too over the top, which feels like sloppy writing. Overall this movie isn't bad or good but maybe it's because they used music to push the bad scenes through."}, {"id": 87, "text": "Ok, im going to start put by saying, yes the movie was funny. HOWEVER, the director or any of the rest of the crew clearly has either not either seen or has forgotten the whole American pie franchise all together. So as far as even baring the name is an insult to those of us that basically grew up with the franchise. So yeah, half ass okay try, but sorry NOT QUITE."}, {"id": 88, "text": "This movie was fun, hilarious and creative. Well acted and written. I was smiling and laughing the whole way through. Just because it isn't just like American pie 1 doesn't mean its not American pie. It was amazing. Don't listen to the downers and just give it a shot!"}, {"id": 89, "text": "Very body positive and expressive. Quite of bit of sexual content. Sends a very strong message to young women looking to explore."}, {"id": 90, "text": "I liked the movie cuz I enjoy those teen romantic movies as I'm an older teen. But those who are a fan of American Pie movies you probably will not enjoy this as much. Some acting parts were a bit cringe, however it's not that bad overall"}, {"id": 91, "text": "Horrible attempt at a progressive feminist reboot of the 90's classic American Pie. If you're going to do an all female cast, that's great, at least cast halfway decent actresses and write a better script. You have a full female cast trying too hard to act like the boys from the original AP film and failing miserably. Don't waste your time. Even the straight to video AP sequels were better than this film."}, {"id": 92, "text": "All the casts are good (no doubt). But I was expecting something real good, exciting and related to American pie series but got nothing. The film's story had no power at all. Very disappointed 😔😔"}, {"id": 93, "text": "From start to finish it's extremely predictable, unfunny and in general, 'cringey'. Each time a character makes a critical decision of something its completely stupid as it doesn't work in the context provided in the film, for example when kayla gets back together with her 'boyfriend' it doesn't make any sense at all, she's emotionally manipulative, invasive and obnoxious throughout the whole film and just because she cries after they hookup in the library she gets the guy cause...he feels bad? Or for some reason he still likes her despite violating his trust by taking his phone and messaging a random girl that he has an STD which ends up being told to his mother?Each character is extremely entitled in believing they deserve love but its never deserved AT ALL. But for me the worse scene was the ending, it was something out of a low-budget 2012 romance film. All of the students in the morp all hold up their phone with a candle on it as they part ways for the main love interest to enter, they kiss and eventually end up in a made-up mini love shack where they eventually have sex. It slowly pans to each character doing the same as the film ends...just like that, it just ends right there. The credits scroll by as it shows people dancing. What kinda ending is that? Very abrupt and stupid. Acting is mediocre,music is passable, story is terrible, characters are horrendous.This film should never have been given the 'American pie' title, its yet another attempt to try and recapture what made the originals so great. The worst American pie film I've ever seen."}, {"id": 94, "text": "Really enjoyed it. Sucks we had to wait 8 years for another American pie movie. Hopefully it doesnt take that long for another"}, {"id": 95, "text": "I really liked it and i thought that the movie was very funny. The cast and the director did a fantastic job as of the comedic storyline. The best character in that movie that really liked was madison pettis because every movie that shes in makes the movie really good. Im glad that this would be her first r rated movie that she acted in since it is a american pie movie"}, {"id": 96, "text": "If you've liked the previous American Pie Presents films (Band Camp, Naked Mile, Beta House &amp; Book Of Love) then you will love this. If you didn't, don't watch this but don't let the fake reviews stop you. This, in my opinion, is the second best Presents film, right behind Beta House. Lizze Broadway as Stephanie Stifler ties with Dwight as my favourite Stifler from the presents films (no one beats Steve). The film takes a lot of the things we love from past American Pie's &amp; adds the modern twist. The chemistry between the 4 girls is the best since Kevin, Oz, Jim, Steve &amp; Finch. The story itself is a little poor at parts but there are some incredible scenes like the opening sequence with Annie (Madison Pettis) which takes some ideas from the opening sequences in American Pie 2 &amp; Naked Mile. The JFK scene with Michelle (Natasha Behnam) The scene after the sex shop again with Annie &amp; Grant (Darren Barnet) walking in/stepping on the control. The library 'what are the odds' with Kayla (Piper Curda) was the heart I love to see. Going back to the roots with a pact before prom &amp; some lacrosse scenes was a nice touch. There was a similar feeling to Finch &amp; Jessica at prom in this but with Stephanie &amp; Emmett, which in some ways feels weird as a Stifler but I have to take each character differently. I just wish there was a surprise cameo from Eugene Levy to keep tradition, that was one let down but overall this film holds its own with the rest of the presents films &amp; I highly recommend it if you love the series! The final scene was really beautifully done."}, {"id": 97, "text": "Rule #1 never watch a American Pie spinoff.Only watch the main 4 movies.I havent seen Band Camp, Naked Mile, Beta House or Book of Love.I wont be watching this trash either."}, {"id": 98, "text": "The movie had an overall good cast however the movie fails due to bad writing and direction. Mike Elliot has made some of the worst sequel's in movie history. The only things tying this to the American Pie franchise are a few names such as Stiffler &amp; East Great Falls. I am unsure how this movie even got a R rating I have seen PG movies that pushed the envelope more. The one big name actor in the movie was only in there a couple of minutes total as the janitor and that's Danny Trejo."}, {"id": 99, "text": "This film start with a man Jason kissing with a female Annie, and Jason's mother talking to him scene! As turnout, this film is about three girls(Stephanie, Michelle, and Kayla) helping Annie to attract a man she like Grant! Entire film full of boring conversation, and super annoying overuse scene! Such as, overuse of the tripping scene, overuse of the playing dumb scene, overuse of the fantasy scene, overuse of the copulate scene, overuse of the song playing at the background scene, overuse of the partying scene, and overuse of the dancing scene! Make the film unwatchable! Barely laughable scene is, Annie stuck at the fence, while try to trespassing Jason's house to meet him! At the end, Annie break up with Jason, and choose Grant! Still have a post credit scene! Janitor Steve watching two people having SM! That's it! Another disappointed film!"}, {"id": 100, "text": "With the title of American Pie I was expecting a movie with some humour and hijinks with a touch of nudity but alas it was missing all three... it would have been much better as a stand-alone film as the only things it had to do with the original franchise was the location an pie that was a bit over used and the name stifflerAs a massive fan of the franchise I don't think I could have been let down more then I have been, if I could give half a star I would have"}, {"id": 101, "text": "Very meh tried giving it a chance but lacks the charm of the other ones. Not connected to the other titles besides one character having a stifler last name and original side characters coming back as a weird adult side extra."}, {"id": 102, "text": "The worst movie in the American Pie series, madison pettis you are much better than playing in such a bad movie you could continue modeling because you are beautiful anyway its so sad you are far more better than that lame movie.. that was A very bad movie and I'm really a big fan of the American Pie series."}, {"id": 103, "text": "This isn't following previous franchise ! Totally different but why? I was much exited about this but I'm disappointed after watching! I liked superbly all previous series of American Pie! But This is not digestible! Hope You'll make better from next time!"}, {"id": 104, "text": "It's funny, most of the reviews are from MEN. I personally enjoyed watching this, the girls are funny"}, {"id": 105, "text": "I don't understand why this got bad reviews? I thought it was funny and I loved seeing a female cast expressing their sexuality."}, {"id": 106, "text": "Very disappointed that I saw this movie! Wasted my time and wish I didn't choose it. I was bored and didn't have nothing else to watch on Netflix. Don't waste your time... Not worth it at all! P. S. To the writers of this movie ( if it happens to be the same one of the originals), YOU FAILED!"}, {"id": 107, "text": "Chicks ruined it. No comedy, boring plot. Calling this movie american pie is the biggest."}, {"id": 108, "text": "I was open to the idea of having women as the central characters (and I still think it's a good idea for future movies) but this didn't really feel like an American Pie movie. Personally my biggest problem was the girl who plays Stiffler doesn't really act like a Stiffler. I thought she was doing an okay job at the beginning but soon after she just becomes a horny girl who wants a boyfriend that cares for her. It didn't really have the same kind of comedy that the other American Pie movies had but I still thought it was a decent high school comedy. For reference, I gave this movie a 6/10 and I'd give the original American Pie maybe a 7 or 8/10."}, {"id": 109, "text": "Little bro Stifler, cousin Stifler, another cousin Stifler, and of course finally female Stifler. God.....Haven't watched this and nevet will. $hit without seen."}, {"id": 110, "text": "This time the movie switches it up by having girls go chase a guy. The group has strong characters, and a lot of funny situations without being overly vulgar. This is not typical american pie humor, and stereotypes are definitely broken, so if you don't enjoy that, be warned not to watch this."}, {"id": 111, "text": "I will be honest i was never fan of this franchise,i dont even know did i ever seen original but i must say that this film was a big waste of space and my big waste of time.Lets start with characters they are so stupidly written that i almost had to turn it off in some scenes,humor and jokes were also very unfunny and they could only work towards 11 years olds ,to everyone else with a bigger brain capicity will hate this project and everything concering filming this.Sex scenes were also very awkward and unfunny or cute at all,they were awkward as hell expecely ending and closing shot,This film was a waste of everyones time and money"}, {"id": 112, "text": "Don't mind the haters, it's funny, Madison Petties is the main attraction. Great actress and as beautiful as ever. The film rocks and it had me laughing. There was a few events that I could relate with. I love watching films with amazing women that tear the house down and these girls tore the house down"}, {"id": 113, "text": "It felt like a core American Pie Not like some of the  presents  So many of those were so corny"}, {"id": 114, "text": "I just finished it. I haaaate american pie its soooo bad. This was actually modern feministic yet actually funny. Everytime its cliche, it cuts itself. Its absolutely worth it. Get drunk and laugh."}, {"id": 115, "text": "This movie is for a very specific group (coming of age teen girls). That being said I thought it was alright, it's a bit of a raunchy chick flick and if that's what you want to watch it's great. For fans of the original American pie movies I think this is a total skip. This film is for a different generation of young adults and is in a high school setting. The story wasn't super original and it's so awkward to think of the diary of a wimpy kid boy and the girl from that Dwayne tooth fairy movie being adults but halfway through the movie you almost forget....."}, {"id": 116, "text": "Thought the movie was going to be a raunchy type continuation of the original guys Pies movies...but, thank g_d, couldn't be farther from the truth.The story was successful in that it didn't play upon the old movies with the exception of the Stiffler connection. The script was well written with good comedy. Something we need more of today. The movie was fun, moved quickly and was really entertaining. I was watching with a group and everyone really liked it. You couldn't help but enjoy Zach Gordon's character in the movie and the ongoing hidden love story between Zach and his co-actor, Lizzie Broadway.A great choice for an enjoyable evening movie for just about anyone..."}, {"id": 117, "text": "First up, I've seen every American Pie movie as well as the whole Eskimo Limon film series (Lemon Popsicle; Eis am Stiel) from the 80s. As one might surmise from the low ratings and bad reviews, fans of conservative apple pie couldn't handle this cherry of a teen sex comedy. There isn't a better movie in its genre and I loved everything about it. I'd even go as far and reserve it a top spot on the list of best romantic comedies."}, {"id": 118, "text": "It was actually really good. So what it wasn't about a group of guys, didn't have the naked women. But it was hilarious, had the same stuff the original just a different way of putting it. I mean come on get over it; it was a solid addition to the American Pie franchise."}, {"id": 119, "text": "So I will be the first to say it. This movie is not as bad as it's been made out to be. I will clear up a few points before I start though: 1. The execution of the story wasn't great 2. The casting was mixed. Good and bad choices all round. 3. It has the American Pie name, but apart from about 5% of it, it's not really American Pie at all. So the story starts off pretty shaky. You don't really get a feel for any of the characters, there's not really any character building other than basically naming some people, which is useless until you get to the Stifler girl. The characters feel pretty empty and you don't feel like you know or care about them at all. There are a couple of boring/annoying characters too and for me that didn't change throughout. For example, Kayla and Tim were probably the most uninteresting and useless characters of the whole film. They didn't feel believable, they weren't likeable and their acting was awful. We move on to Annie, the 'main' character if you will. At first I didn't feel like much was going on with her, but I do think that's partly the execution of story/script. Annie for me became the most likeable character, and actually the most believable in the end. The next girl, Michelle, was pretty boring, and the character's interests were pretty ridiculous ( she masturbates to speeches from John F Kennedy) although there were a few funny(ish) moments from her. Stephanie Stifler is the next girl. She's got high expectations to live up to as she's obviously a Stifler, but I found her to be lacking in the deliverance of the character. I will say though, she was probably the most likeable Stifler of the series after Sean William Scott. Grant was the main guy that all the girls were after, and to be honest, they could have cast him better. I didn't feel like actor really had much going, maybe its the script/story, but I didn't care for him at all. The story was all over the place at first. Like I said with the characters, you didn't feel like anything was going on in the first place, no connection with them, not much to feel etc. However I feel like it redeemed itself like half way through, where they started to develop the characters a bit more. All in all I didn't find myself laughing as much as I thought I would. I feel that the moments that they tried to use to make you laugh were just sex related, or swearing, but it just didn't work for the most part. Overall I think the premise behind the movie was good, but the execution was just not as it could have been. The casting was good for the most part but awful in some areas. They stuck the American Pie label on it, but other than the School, and Stephanie Stifler character (and the mention of band camp) there wasnt anything else really American Pie-esque. There was no nudity, the humour was either a bit forced or not very believable, although better than some of the other american pie spin offs. I think if you go into this with low expectations and don't think of it as an American Pie film, its not an awful film at all. Would have I felt ripped off going to the cinema to see it? probably yes, but as a free viewing on Netflix when I can't be arsed to watch anything else, its a quick watch that isn't awful, so I've given it a generous 6/10"}, {"id": 120, "text": "All the other American Pie (and American Pie presents) are teen movies in what I consider the good way, they explore sexuality in teens with, yes, a bit of teen drama, but I feel like this opus is only teen drama, I mean the obvious Stiffer ending up with the nerd guy who help her getting info on Grant is so obvious and such a cliché. This opus is basically just another teen drama love triangle (or love pentagone)."}, {"id": 121, "text": "That movie is a disgrace for American Pie saga! OMG how did it get out of the studio ?! Do your self a favour and do NOT watch it because it will hurt your feelings about the previous A.P. movies. I dont want to be mean but that is the truth..."}, {"id": 122, "text": "The old American pies are some of my favorites I am all up for woman empowerment and feminism but this is not thatPLEASE DONT WASTE YOUR TIME I AM STILL TRYING TO FORGET IT !"}, {"id": 123, "text": "Hey you all watched it to be curious its not to bad of a film and its not the greatest of a film it was a gap filler eveyones a critic didnt have to go to a cinema to watch it."}, {"id": 124, "text": "Where to begin? First off I will give kudos to the director and writers for trying to make an attempt at an American Pie movie in the eyes of a female instead of the previous male ones. However, with that being said it was a very predictable storyline with a female version of Stifler and how she would act and who she would possibly end up with. This movie was a cross between 'Shes All That' with 'Blockers' (a bet was made to have sex). The other three main female leads I did not recognize the fourth I did being Madison Pettis and for a couple of minutes it was a bit weird to see the little girl from 'The Gameplan' (with Dwyane Johnson) in a movie franchise that is known for sexual innuendos among nudity. There was also predicatability of the other three leads and how their stories intertwined and would end. Overall, it should not have had the American Pie brand attached to it."}, {"id": 125, "text": "It's not even close to american pie!!! you think because you have a girl with last name Stifler is an american pie? it is just a normal girl romance drama movie!!! and most important No Levenstein No american pie!!!"}, {"id": 126, "text": "I really want my money back. This movie is really awful. It's one of the worst movies I've ever seen, and it's definitely the worst American pie. By watching this movie, you are just wasting your time and money. And for those looking for sex scenes: this movie has no real sex scenes."}, {"id": 127, "text": "Other than the girl who plays Siffler in this movie there is really nothing good to say about this film. She is one of the hottest girls to ever be in an American Pie film and seems like a decent actress. Unfortunately other than hot outfits you never get to see her or anyone naked in this movie. I believe it os the only film in the franchise not to have any nudity. There is no jokes that stand out in this movie. It jist seemed to put all its hopes on the hotness of one girl and without nudity she couldn't save it."}, {"id": 128, "text": "It's good to humble yourself with a horrible movie just so you can tell the difference between a great one.Maybe it's funny sober, I smoked a joint and mostly just laughed at how funnily bad the scenes were."}, {"id": 129, "text": "The majority of reviews are based on the notion that women do not do as well in reboots of movies in which the main characters were previously men. They are rooted in sexism, give the movie a chance."}, {"id": 130, "text": "Corny, cheesy, cliche....Whatever you wanna call it. Just be aware that's the type of movie this is. It's like they attempted to combine the comedic tone of Mean Girls with American Pie, with a romantic comedy that ends happily ever after. It's entertaining, but not something I'll watch again. The four main girls played their parts well."}, {"id": 131, "text": "Not american pie but good movie woth to watch this"}, {"id": 132, "text": "I thought it was funny and I like how they featured a sister of the original Stifler. This movie is entertaining."}, {"id": 133, "text": "All American pie movies are weak but what's an American pie movie without nudity?"}, {"id": 134, "text": "Me and my girlfriend are s*ckers for generic Teenage drama movies like Sex education and Atypical etc. So our bar is very low. Story: predictable Scenes: some funny ones, some veeery childish like come on even when I was 14 i wouldn't have laughed Actors: okay Worth the money: meh nah.I miss the times of Blue mountain state and old American pie series and movies. Man we have gone downhill over the years6/10"}, {"id": 135, "text": "Only 10 minutes in and I fell taken back but with so much freshness I cant wait to finish it."}, {"id": 136, "text": "Sadly I would not call this an American Pie movie, as it has nothing resembling the naughtiness of the original American Pie movies. The only naughty was showing some lingerie at the beginning of the movie, and that wasn't even on American Pie level. The women were beautiful though, however a bit young. Still do not get why this was a high school movie and not freshman year of collage."}, {"id": 137, "text": "4/10 - hilariously terrible and incredibly raunchy high school comedy is so bad that you can't help but stay engaged"}, {"id": 138, "text": "In the tradition of the series, raunchy, funny stuff. Dumb but enjoyable"}, {"id": 139, "text": "A group of four High school girls lead by a Stifler (Lizze Broadway) make a pact to fix themselves involving meeting a nice guy and having sex on Morp (Prom spelled backwards) night. When new guy Grant (Darren Barnet) shows up, all bets are off as all the girls want him.This is another teen sex comedy without anyone showing their boobs. The jokes are typically weak and cliche.Guide: F-word. Sex. Brief butt nudity."}, {"id": 140, "text": "/////////////////Best movie ever!!!!!!!!!!!!......................."}, {"id": 141, "text": "Would like to see the 4 main girls in better written movies bcz yeah this one blew.. who didn't know which guys the girls were going to end up with. Unfunny comedies are always just the biggest waste of time"}, {"id": 142, "text": "American pie on pms..slow so Story no true american pie theme or ideas"}, {"id": 143, "text": "It follows the same formula as all of the other American Pie movies so of course it's predictable. It achieves what it set out to do though. It's 90 minutes of sex crazy teenagers trying to get laid. The only thing it didn't have was nudity which is a bummer."}, {"id": 144, "text": "This movie won't appeal to many American Pie fans, and this movie won't appeal to many girl centered romantic comedy fans, or even many college/ high school comedy fans.This movie at times, is still trying to be an American Pie Presents movie with some of the jokes, references, and type of humor, while for the most part it is a very stereotypical girl centered romantic comedy. For one to enjoy this movie, they must enjoy the other American Pie Presents movies (I'd say this is closest to Band Camp), while also not minding the movies straying from their roots, but also enjoy girl centered romantic comedies. I think, this movie appeals to neither of those fan-bases on their own.So, the question is, how many people really fit into both groups? I am one of the few people that do, and so this movie was somewhat of a guilty pleasure and I enjoyed it. Still, I can't help but question, as to who thought that making this movie was a financially wise decision."}, {"id": 145, "text": "I've never watched any American Pie film before in my life. Only seen some clips maybe a few scenes. The genre just wasn't my favorite but I just happened to watch this one of boredom. I'm not impressed at all.Another very generic typical high school I gotta get laid before graduation because my life depends on it film. We don't need movies like this anymore. They're so boring and ridiculous. Honestly I'm not mad just extremely unamused.Gotta love the predictability too. Of course something, or in this case someone, has to get in the way of our strong independent woman clique. Then, of course the other guys they meet along the way turn out to be their matches. Ugh God I fast-forwarded through half the film.I'm all for a sex-positive film for girls but there's nothing learned here. Like there's no message aside from a vague one about finding the right guy, explore your sexuality or something. The whole thing was too painfully heterosexual for me maybe that's why I stopped paying attention.I guess the only okay thing I can say about it is at least the majority of the teens aren't 30 years old (well except the Grant guy) That's it. There's really no good thing about it at all."}, {"id": 146, "text": "As a huge fan of the american pie movies, i can only say that this is a disgrace! This is clearly a very very normal rom com, and it's honestly sort of boring for that even.. But it is NO where NEAR american pie.. not only doesn't it capture anything american pie movies are all about, which means it really SHOULDN'T be called american pie anything.. but it's also truly an insult to the absolute masterpieces that is American pie!I think most people agree with me that the first 1-2-3, original ones are the best for sure, the TRUE ones. But i honestly found all spin offs after that to be quite good, even the lastest book of love was fine. It WAS the weakest one among them i believe, but still viable, and i was okay with that calling itself an american pie spin off, because it sort of had something from it.This movie had a big fat NOTHING... It must be someone else entirely that created this movie. Someone who just doesn't have ANY IDEA what american pie is all about..And i would like to add.. I know many things are hot topics right now with equality and such, but damn how ALL of that equality ruins movies.. just because a girl CAN play any roles just as good as guys, doesn't mean they always should.. Nor should guys play the famous female roles.. It just doesn't FIT..This seems like a clear attempt to show that girls are just as good as guys and blaa blaa, and while they ARE just as good as guys, this just makes them seem worse, because it STEPS on a famous movie name and just ruins it completly.For all the people that respect woman just the same as they respect men, this is having the opposite effect of what it's supposed to.. And i highly doubt the people that think girls are less than men, change their minds over this crap either. So overall this movie has no excuse!YES we all miss American pie, and i personally would LOVE to see an ACTUAL spin off, like the naked mile or beta house and such, with a REAL stifler and all that. But if you can't even make a spin off right, then it's time to quit and just let it go! (Man, how i miss the good old days where i saw the original ones for the first time, what glory days that was, to experience something like that :3)"}, {"id": 147, "text": "First off, let me start off by agreeing with the majority of folks here. This is not an American Pie movie as you would understand it.For generations now, American teens have had the awkward sex comedy film, complete with relatable tropes. Seems that every decade we need something to help young men laugh at the awkwardness of puberty and for people who've been through it to cringe retroactively. A young man is cursed with raging hormones and a gangly awkwardness and lack of social skills that makes approaching someone and saying please allow me to insert part of myself into you extremely difficult.This movie for various reasons follows a Four Horsewomen team of brash Joan Jett-like tough girl Stef Stiffler, Sexually Active In A Relationship Kayla, Debate Team Future President Lovable Chubby Michelle, and Still A Virgin Holding Out For Mr. Right For Her First Time Annie. They end their latest break bemoaning their problems and make a pact. By Homecoming they will meet their sexual goals. If this was a typical sex comedy the goal would be get laid but that's really easy for most women so it's make your first time special with the man you love, find a guy who treats you right and so forth. Right away we're not lookingat a sex comedy, it's a rom com.It's hard to genderflip the sex comedy, because the vast majority of women have the opposite problem, namely that they're constantly bombarded with sexual interest but not necessarily by the top guy they want.Which is why, by definition, this turns into a girl power movie where the girls are not happy with the sexual attention of adults, creeped out by being ogled by the majority of the school's male population, which they deem to be rats, I think part of the invective against it by most reviewers here is that male-oriented ones speak to the problem of starvation and by that metaphor this one is all four of us want the last slice of cake, whatever shall we do?Because eventually all four realize that to satisfy their pact in the way they imagine, it's to get with the just-transferred-in-the-last-semester-of-school-ever Adonis named Grant.The biggest problem with the movie is that movies really thrive on the concept of a character overcoming a problem, and the other three just simply decide to settle. Disturbingly, for all the movie crows about getting rid of patriarchal interference in what's messaged to girls, see if you can guess which player - the rowdy sexually aggressive girl, the relationship-sex-three-times-a-day girl, the chubby awkward one with a literal foot locker full of sex toys, or the sweet, virginal intact good girl is the one who gets the prize of the best guy at the end. This isn't a spoiler, they practically ship the couple from the jump.What would be a better movie is one that speaks to the genuine awkwardness girls face. Except that it would probably involve menstrual gags, period-induced diarrhea, physical mishap and so forth that no censor would allow onto the screen. The suggestion of Judge Reingold's character in Fast Times engaging in self-abuse at the sight of a girl is one thing. A visual gag involving a very real world problem of... how can I put this delicately... will it fit? was scrapped.I am waiting for a film that my female friends scream at the screen going YES YES OH MY GOD YES UGH CRINGE but so far that hasn't happened. Though the director sought out female writers, female assistant directors and so forth and built a soundtrack out of you-go-girl all girl acts, if you're going to do a sex comedy, it needs to be less Bananarama and more Wendy O. Williams. (Not the talk show host, the lead singer of the Plasmatics).I want that film to be made, for the next generation of girls. So far all they've had is someone trying to pound their square peg into a male-troped round hole."}, {"id": 148, "text": "Given the title of American Pie there was some anticipation but after seeing the cast and reading the plot description, we would know that this film would not be on the level of the original American Pie films but more so closer to the spinoffs.Even so as a film there are many cringe and forced comedy moments. While nothing is funny and things are over the top. Everything is utterly predictable, from the beginning to the middle and ending. Also unlike the other American Pie films (originals and spinoffs) there isn't any nudity so there's that.The lead actress was quite solid but apart from her, the other women were at times hard to watch and tried too hard in being funny, where it came off as cringey (especially the character of Stifler- which was a mistake in making her a Sitfler- it felt completely forced). Aside from that and the school having the same name (and some occasional shots of actual dessert pies) nothing was a connection to the American Pie franchise. We see they simply used its name for views.This film reminded somewhat of Blockers (2018 film) but that was far better."}, {"id": 149, "text": "Lets be honest, not everybody that liked American Pie liked the presents line. Lots of peoples hated them. I was one of those that did like them, a LOT. Especially Beta House. Yes its stupid, obnoxious, and irrealist, but who care... its a movie !!This one kinda change the sauce with women as lead. I feared it would go too much into the matriarcal and SJW non sense, but nop, its just American Pie with... women. The raunchyness, the nonsense i love, the trash, all of it is still there. Sure if you want to be realistic all of those women including the chubby one could get laid anytime they want, but the movie is not about it, its clear its about them getting what they WANT, only one of them is a virgin and its because she want to do it with the guy she love.I really had a good time and i do think the movie worked well for what it wanted to do. Its crazy it took that long to have another present, i really enjoyed the 2010s when those movies will comes every 2-3 years. I really wish they do another quick. It does not need to be a masterpiece, i just enjoy raunchy comedies and a good time and those movies are THAT."}, {"id": 150, "text": "Really good watch, would watch again, and can recommend.While traditional American Pie fans might be disappointed, as it has been more of a boy's club movie franchise, this franchise knows how to handle sex-based teen comedy in a healthy-ish way with just the right amount of tact (or lack there of).This clearly parallels the original movie, with 4 high schoolers making a sex pact, but where guys get in there own way about their lack of sexual potential, teen girls tend to have less of an issue so it becomes, not getting sex, but getting the right sex, and in a somewhat predictable fashion, competing over a boy.Because they're searching for something that is clearly going to be evident in much more compatible people that we're first led to believe, but the journey is actually told in a really great way.The cast did a great job on deliveries and embodying their characters. It's not going to be my favorite American Pie, but it certainly has more charm and a more reasonable story line that any of the other movies.Fans of Booksmart and CockBlockers will likely enjoy this. Possibly fans of John Tucker Must Die as well."}, {"id": 151, "text": "Obviously not the best movie anyone has ever seen. Let's get real.. NONE of the American Pie franchise movies are good films.Girls' Rules stays true to the American Pie roots: corny, overdone, unnatural acting with sexual conversation topics. The only changes: there's no nudity and the movie is centered around young women.I applaud the franchise for accentuating that women enjoy sex, it is normal for women to enjoy sex, experimentation with your own body is normal; it's normal to have feelings, it's normal to wear protection, and it's normal to want a relationship. These topics are important for the TEENAGE WOMEN this movie is geared toward.Girls' Rules is obviously not made for late 20's to 30-something-year-old men who enjoy movies that are centered around sexualizing and degrading women. If that is what you want, then you shouldn't watch this movie. You can also do society a favor by continuing to live in your mom's basement and posting your incel anger on Reddit.Made me laugh a couple times, positive message for young women, and Ed Quinn as single daddy next door? 10/10"}, {"id": 152, "text": "Yeah, it sucked. First off, can't believe the Game Plan girl (Madison Pettis) is 22 now, I am old. Hollywood needs to stop with this NO NUDITY BS in movies and shows dealing with sex and crude humor. They made the Stifler character female, not an issue, but she is not Stifler in ANY way (you can make a female Stifler, it's not hard). They also need to stop this DRY HUMPING CLOTHES ON sex scene BS also, just skip it or have it implied. Someone mentioned sexual conversations, there literally were NONE, they literally just made a sex pack, they didn't talk about anything. LBH these girls have no issue getting laid, the issue for women is giving the right guy the chance, but it's all about physical attraction and in here other people tell each one who was the right one for them cause they ignored them, typical. 2 Stars cause it could have been remotely good, a diverse group of young ladies, but you just totally killed every aspect of what made American Pie good. Honestly the American Pie movies have not been the same after the 3rd movie. These are literally CW and FREEFORM movies now. Hollywood is literally stealing money, if you renting these types of movies."}, {"id": 153, "text": "Taking into account that it brought a little bit of the plot of the first American Pie from 99, with all the eccentricities of the current generation. He kept the douchness without sexualizing the girls who are the protagonists and in a way delivered a very interesting and cute plot of teenagers discovering their sexuality and how relationships in the adult world are complicated just like in the original. I sincerely enjoyed this film very much. I watched without any pretense, with fear of being a failure or even an extremely predictable film, with a boring and exaggeratedly obscene story like all American Pies without the original cast, trying to force a female representation down the audience throat, but sexualizing them. I am happy to say that I was wrong, and I found a great contrast with the original, representing well the sexual awakening of teenagers and how they screw up and everything is fine with that. And I say this as someone who likes VERY much the original movie from 99 and everyone involved in the cast of the original and as someone who adores Reunion until today! Has it the potential to become a franchise like the one from 99? I don't know, maybe not. But if it does, I confess that I'll whatch it with the same enthusiasm that I watched American Pie 2 and hoping to see the characters mature as it was in the original franchise :) Very good, highly recommend!"}, {"id": 154, "text": "So, movie night with the buds has led us on a trek through the American Pie saga, which for now, has come to an end. I can't say any of them are necessarily good, but there's been a couple standouts. However, the last three spinoffs are some of the worst movies I've ever seen, and this one follows suit.I don't understand how American Pie, which, let's face it, is a very dated formula for a comedy film nowadays, is still going on. They can be blatantly misogynistic at worst, mildly amusing at best. That's when we're faced with Girls' Rules, which tries (and I mean that in the loosest sense) to subvert the series traditions by resorting to the oft-ridiculed idea of the all-female reboot. That's not where the problem lies. The problem is that beyond being a whole lot of nothing, unfunny garbage and not veering enough away from the series' formula, the characters actively agitated me as much as the ones found in Naked Mile and Beta House-- they're terrible people, but the movie never acknowledges this fact and they still end up getting what they want, despite being parasites. Piper Curda's plot-thread was especially... gross and manipulative-- her boyfriend breaks up with her (he's never presented as some jerk or anything, so it seems valid on his part), so she pressures him into constant casual sex to get him to...change his mind? But, it's all fine because they get back together in the end. Silly me. Then, in a rather cynical move, it tries to go for a Booksmart vibe, by attempting to be thoughtful and charming, but of course it doesn't work. Just watch Booksmart instead.It was clearly written and directed by men who probably have a thing for high-school age girls, and miserably failing at making something even remotely feministic.I've spent maybe 5 minutes writing this, and that's already too much time I've devoted to it."}], "reviews_amount": 155}