{"name": "Halal Love Story", "titleId": "tt11112338", "reviews": [{"id": 0, "text": "Personally...i really liked this movie...watch this movie for some amazing performances by Joju geogre, indrajith, grace antony and Sharafudheen...everyone acted so brilliantly...one of the best malayalam movies in recent times.."}, {"id": 1, "text": "Its something very new. Some people might get irritated. People who are not open minded won't be able to enjoy it. Those who are not secular, this is not something for you. This is local, a malabari version of some views. It's different its good. But could have been better within the limits"}, {"id": 2, "text": "Wasting our time , bad movie . Bad story . Boring full time"}, {"id": 3, "text": "This one from director Zakariya is a feel good comedy movie with a good cast and crew.It efficiently portrays simple human lives beautifully. The movie served as a portrait with realistic human emotions. The best thing about this movie is its short run-time of just 2 hours...and this helped in balancing the absence of a powerful script. Zakariya has done a fine job.Indrajith,Sharafudeen, Grace and Joju George have also done commendable work."}, {"id": 4, "text": "It is a family entertainment comedy film. Film is based on a story of school master from a semi Orthodox community who like to take a movie. The movie presenting the challenges he faced in comedy way."}, {"id": 5, "text": "Great sleeping pill.. Now I'm not trying to throw dirt on any particular community.. I had high expectations but this felt more like they were trying to glorify something. The script should have been better"}, {"id": 6, "text": "Brilliant attempt at telling a simple story with a lot of dimensions. It shows all challenges and complexities of filmmaking. Family Entertainer."}, {"id": 7, "text": "A beautiful story woven around simple people.. creates a refreshing impact. Though it seemed a wafer thin story line but director got the grip tighten post interval. The similarity between Sudani from Nigeria is striking since the directors take on human relationship has been the forte of this movie as well. Special mention of the growth of sharfuddin as an actor is awe inspiring. Rest of performances by the supporting cast is commendable to."}, {"id": 8, "text": "Yawn guaranteed couldn't watch for 15 Min , worst Yawn guaranteed couldn't watch for 15 Min , worst Yawn guaranteed couldn't watch for 15 Min , worst Yawn guaranteed couldn't watch for 15 Min , worst"}, {"id": 9, "text": "Enna maira....Amazoninu vere pani onnum ille... Sathyathil ithu spoof padam ano? Angane thonni.But angane ella savidhayakan udeshichathu ennu thonunnu... Made especially for Republic of Malappuram."}, {"id": 10, "text": "Better to rename the film as halal muslim story.. nice cinemotography... and also we need to appreciate the awsome performance of sharafuddine.. other wise its tottaly a halal muslim story..."}, {"id": 11, "text": "Movie is slow and lacks a good story line. Had high expectations considering the trailer looked promising. But the actual product was poor.."}, {"id": 12, "text": "It's just a simple movie that made me smile and filled my heart with happiness. Nothing more, nothing less. And that smile on my face, that happiness in my heart, means a lot to me."}, {"id": 13, "text": "Totally wasted movies...sussecfuly wasted 2 hrs....."}, {"id": 14, "text": "Halal love story is a movie where a few movie lovers trying to make one , as they are part of muslim community the movie should be halal( permissible according to Islamic law).Grace antony and sharafuddin played their roles very finely, dialogues were also good. But the overall movie is an average ,underwhelming. But comparing with other industries of indian movie malayalam is on right direction."}, {"id": 15, "text": "This film is made by intolerant minds to make intolerance in the society. They are religious fanatics who measures the level of tolerance of others to their intolerant ideas."}, {"id": 16, "text": "Halal love story is a extra ordinary malayalam feel good comedy drama. Very good movie"}, {"id": 17, "text": "With clear statements and clear ideology, this movie would be remembered for a long time. I'm not sure why the term revolution is coming to my mind. I'm sure this is going to be a conversation starter for many topics which we considered divine or taboo. It's an universal movie. Loved every bit 💗. The added green tone and the overload of green props is a heavy statement. Kudos 👌 Hats off. Thank you Zack."}, {"id": 18, "text": "CINEMATOGRAPHY GOOD GRACE ANTHONY AND JOJU GEORGE AND SHARAFUDHEEN WAS EXCELLENT..........ONLY THESE 4 FACTORS WAS GOOD IN THE MOVIE THAT IS WHY IM GIVING A 4 STARS.......MOVIE HAS A VERY WEAK SCRIPT I WAS TOTALLY BORED AFTER 15 MINUTES AND I WATCHED MY WAY THROUGH THE MOVIE BCS IT WAS ONLY 2 HOURS BUT I FELT LIKE IT WAS A DAY.......THIS IS A TOTAL DISSAPOINTMENT FROM ZAKARIYA I BECAME A HUGE FAN OF HIS WORK FROM SUDANI FROM NIGERIA.....BUT THIS WAS A TOTAL DISSAPOINTMENT"}, {"id": 19, "text": "Very poor movie with old gimmick and old storyline."}, {"id": 20, "text": "I thought watching the beginning sequence, the film will be a slow moving, might need to press the fast forward button a little more often but then Joju George entered into the frame and just changed it. Grace Antony, shall be regarded as a gifted woman.The film was simple and pure. I felt the freshness of it very much. Congrats to the team. Aashiq Abu and Zakaria all others."}, {"id": 21, "text": "Watched with high expectation after sudani from Nigeria, and zakariya didn't let down, a beautiful, quirky, well made, comedy entertainer. I thoroughly enjoyed every minute. zakariya valued gem of malayalam cinema"}, {"id": 22, "text": "A simple but thoughtful yet, the theme sparks the idea of 'what if' a buch or orthodox believers of a particular doctrine attempt to make a movie and don't want to portray anything taboo, by submerging strong emotions in a way that does not hurt the religion/beliefs. Good theme, but at times viewers may be turned away due continuous strip of similar light moments and absence of heavy drama or thrill that one may expect in the way. Regardless if one determines to glue themselves watching till the end, they may carry something. After all it's a feel good move: a hard one time watch."}, {"id": 23, "text": "Seriously content of the story is glorifying the term 'Halal' which is outdated in the twentieth century. Unfortunately movie wasn't promising any entertainment except good direction, frames cinematography and acting performance of Joju, Indrajith, sharafudheen and Grance.The contents they taken is completely outdated and unscientific and unacceptable at any point of time.. Hard-core Muslims might be get some satisfaction from this movie..but the reality in very different"}, {"id": 24, "text": "The whole point of the movie is something that you can watch with family. Nowadays you cant watch movies due to item dance and vulgar comedies. In this movie you dont need to worry about all that. Get ypur whole family and watch it."}, {"id": 25, "text": "Sensitively scripted, this film plays with the light within in every frame and still. Dotted with delicate nuances, moments of authentic tenderness and refreshing mapilla humour, this meta-film is full of colourful and realistic characters who have been thoughtfully brought to life. So much of the story is in the frames, the soothing pastel hues, the Sartre on the bookshelf, the folding of a mundu and a knowing glance or two thrown back at the end of the prayer. A world rarely glimpsed on screen."}, {"id": 26, "text": "Good family movie, watchable with kids and family, no sexual words. Natural comedy, Fantastic Movie."}, {"id": 27, "text": "Simple , feel good movie .. 2 hours giving smile in our face ,,."}, {"id": 28, "text": "Thus was not able to reach upto the level of entertainment an average mollywood viewer expects No much fun as expected Also this movie needed some sort of stuff or some suspense or some story atleast The ending can be imagined by any viewer The story just goes the same way we imagined Really boring 👎"}, {"id": 29, "text": "Another pathetic movie during Covid times. I sat down to watch, but didn't last more than 15 minutes. It felt like a poorly made telefilm. Please make better movies next time!"}, {"id": 30, "text": "Scenes were song is required, they just filled it with jingles ..I am sure production team made rubbish for sole OTT release during post productionI was expecting much from the talented director Zakariya, who delivered much appreciated sudani from nigeria, but this movie is terrible , failed and lousy attempt by the directorDon't waste your time watching this under cooked movie"}, {"id": 31, "text": "Expected a lot, since Sudani, being my favourite movie. But this was average. The comedy is amateurish. Soubin just shouting silence and some clumsy scenes for comedy. The issue is there is no emotional connect with the characters or story. No depth and natural flow as there was in Sudani."}, {"id": 32, "text": "It's a simple story that happens in the malabar region with romantic and simple comedy.Its a good movie with lot of relevant things passed through it."}, {"id": 33, "text": "Very boring movie...very slow and literally felt like fast forwarding and watching..this movie is for muslims to show them how dry is their romance in their marriage life filled with religious rules and regulation..."}, {"id": 34, "text": "It's a below average filim. Please dont expect too much.. If you are free and expect nothing from a movie, then this movie is for you."}, {"id": 35, "text": "Below avg flilm. lag too much. poor script and execution."}, {"id": 36, "text": "An overrated, family movie. There was zero humour, at least that would have made it less boring."}, {"id": 37, "text": "Director zakariya has succeeded blendie art and the push which keeps you watching the movie.With its humour,art,politics and outstanding acting this surely is a visual treat.One of the underated feel-good movie Malayalam industry have"}, {"id": 38, "text": "Here is the beef I have with this film. There is an element of artificiality in the film that unfortunately layers on top of the subtlety the makers tried to bring. This is not evident throughout the film but the artificiality creeps its head up here and there and it was distracting for me. At times it felt a bit preachy, indirectly though, trying to convey an agenda that is not very evident.For e.g. Suhra played by Grace Antony's reaction at times felt a bit over the top to elicit a funny reaction especially in the initial chemistry between Suhra's husband and her. It feels not as flowing as how her performance has been in Kumbalangi Nights were she was brilliant.Haseena played by Parvathy Thiruvothu looked at times out of place as a coach and mentor. In recent films especially, in Virus and this, you feel the actor is somehow conscious of the camera in the room. We have seen Parvathy's acting prowess and naturality in her early acting career which seems to be MIA.There is a Soundman in the film, played by Soubin, who helps the film makers within the story direct the short film; his gimmicks were funny but left the viewers wondering why he quit the project early and gave us the feeling that he was forcefully brought in for certain humour creation. When the audience feels this element while watching the film it translates into a forced artificiality of the story.Towards the end several dialogues and scenes felt like an attempt to preach to the audience that the characters' idiosyncratic religious believes are a real aspect of human life and should be accepted by all. That preachiness, came across in the film which I thought was a bit distracting.These are just 4 examples. There are some more spread across the film.The plus of this film is obviously the story which is so different, the acting by most characters, the subtle humorous situations all helped create a feel good film.Overall, this is an above average film and some audience would want to see it more than once which is a definite plus."}, {"id": 39, "text": "I don't understand malayalam .. saw this movie with subtitles on Amazon.. awesome movie.. good acting.. must watch"}, {"id": 40, "text": "A Feel good Family Movie with moral values, Good character casting &amp; casting is good too"}, {"id": 41, "text": "Just now finished watching...💕💕💕 superb movie..."}, {"id": 42, "text": "This was something that our movie industry really needed. The movie depicts the obstacles faced by the malabari muslim community in creating a movie through which it portrays the raw culture of malabar muslims. This could be seen as one of the initial step in cleaning up the image of the malabari muslims or muslims in general which has been unfortunately tarnished by the media. So if any of you outside the malabaric region wants to know how an average muslim family culture looks like, this is the perfect movie.As far as acting goes, Joju George, Sharafudeen and Grave Antony have done a brilliant job. One of the best of their careers arguably.The movie overall is a feel good funny movie. This would be one of those movies that you watch to just chill. Nothing serious."}, {"id": 43, "text": "Sleeping pill. Very bad movie. Don't even know the purpose of doing such worst movies. Santhosh pandit films are better than this."}, {"id": 44, "text": "Not worthy to watch. Very boring film and the progression is pretty slow. Only interesting characters are those played by Indrajith and Grace Antony. All others are usual comedians who failed to make an impact on screen."}, {"id": 45, "text": "The standards set by Zakariya's debut movie 'Sudani from Nigeria' is so high that there's little chance he can achieve it again. Halal Love Story is a good second attempt by him. This movie has problems that his first movie didn't have. The performances is the best aspect of the movie. All actors have outdone themselves. The music and songs are also good and helped with the overall pace and mood of the movie. Overall, this is a cute little movie which has it's moments and is watchable for it. You'll be contend"}, {"id": 46, "text": "Borig movie, though the makers claim it's a sarcastic comedy, those who are familiar with islamic religion only understand the jokes. Very slow throughout and fell asleep in between"}, {"id": 47, "text": "Good film with lots of moral values. Loved the way they were presented. Sharafudheen, Grace, Joju, Indrajith were awesome. The only negative thing I felt was Soubin's part, not that the actor made it bad, but the character itself wasn't appropriately presented in the movie."}, {"id": 48, "text": "It starts out well ... with some well intended script and good humour capturing the local thoughts. But as the movie progresses - with the second half of the movie, the plot fails to keep the viewer interested. Unfortunately gets dull after a moment. Shoubin (malayalam's breakout actor) has been under utilized with his not so significant character."}, {"id": 49, "text": "Halal Love Story - A different perspective film when compared to the typical malayalam films. Fresh Story content and humourous related incidents.Great film from Zakariya and Muhsin Parari."}, {"id": 50, "text": "Different one in the world of Malayalam cinema for ages ....Answer to many questions ... Questions against questions ... New question marks to the audience ...Everything is going like a music ....A family-friendly movie ...Very good movie ...Zakariya is a promising director."}, {"id": 51, "text": "It is a very romantic feel good movie and it gives the more valuables to relationship. And the casting wonderful like the movie in the movie. And the acting of grace antony, joju george ufff."}, {"id": 52, "text": "On the day of the release, in the evening, the movie was rated 7.1. This is one of the reasons other than the presence of Parvathy on screen and Ashiq Abu behind the screen to watch the movie. On the day I wrote the review, the IMDB rating has come down to 6.7 and is expected to drop down further in a week. Obviously, Zakariya tried to create a satire. But I doubt if he was successful in communicating the sarcasms effectively except a few. Everyone performed really well."}, {"id": 53, "text": "It is a family entertainment movie.it portrait the efforts to make a good movie."}, {"id": 54, "text": "This movie is a blissful cinematic experience. Zakariya is proving to become a Wes Anderson like Director and Creator in Malayalam Cinema.. Immensely Realistic and Fresh content. Beautiful visuals just like every malayalam film. Not as convincing as Sudani from Nigeria,the first ever film directed by Zakariya which won him a national award,But still a beautiful watch considering the pandemic situation. Refreshing Content"}, {"id": 55, "text": "I started watching this movie half hearted but later I felt so relaxed and enjoyed each character and the directorial way of narrating a islamic story it was so natural &amp; realistic... Feel good and a meaningful movie. Worth watching. It... At some point I felt myself in the character. THANKS A LOT FOR THE TEAM FOR PRODUCING SUCH MEANINGFULL MOVIE."}, {"id": 56, "text": "It's not the story but the effort of Of everyone in the movie that makes it agreat view"}, {"id": 57, "text": "I thought watching the beginning sequence, the film will be a slow moving, might need to press the fast forward button a little more often but then Joju George entered into the frame and just changed it. Grace Antony, shall be regarded as a gifted woman.The film was simple and pure. I felt the freshness of it very much. Congrats to the team. Aashiq Abu and Zakaria all others."}, {"id": 58, "text": "Halal love story is zakariya's 2nd directorial venture after sudani from Nigeria which is one of my personal favorite films. When, I heard that its releasing in ott, I was a bit sad because i wished it was released in theatres. The plot is based on a bunch of passionate filmmakers from malabar who want to make a telefilm for their community. Rest of the film are the events following the making. The story is very thin, but its the direction which keeps the movie forward which is as realistic as the director's previous film. The next area it shines are the performances. The best performer was grace antony whose potential must be used in future. Indrajith as usual gives a sincere performance, but couldn't perfect the malabar slang. Joju shines in many portions. From all the films i have seen, this is the first time I am seeing sharafudeen in a gentleman kind of role. Parvathy's cameo was okay but soubin's cameo was awesome. The cinematography is another asset. But the storyline is too simple which will disappoint many who are expecting another sudani from Nigeria. And in entertainment level, this one is neither funny nor emotional, it stays somewhere in the middle. On the whole, realistic filmmaking and artist performances save halal love story. I personally liked, but don't watch it with too many expectations."}, {"id": 59, "text": "Great performances by Grace Antony, Joju George, Sharafudeen, Indrajith, and the other character actors as well. Casting has been done well as well.Subtle and original humor all through the movie.Against the backdrop of humor, sudden presentations of problems in the characters' lives has been done naturally and convincingly.While the movie seems to take it's time presenting humor with the process of shooting, it suddenly gets into deeper aspects of actor training, and leverages that to get into the actual life of the characters.Context of the movie has a very specific islamic background, and hence there is a certain lack of universal reach from that perspective as compared to Zakariya's previous movie Sudani from Nigeria which had much more access.The relationship theme choice is unique and impressive. It is mostly a political satire, and hence is not as much heart as Sudani, but definitely a crafty and original venture from Zakariya. Some of the material from the making process of Sudani has most likely made it's way into the theme of Halal."}, {"id": 60, "text": "When the members of a popular Islamic organisation decide to make a telefilm, writer Toufeek played by Sharaf U Dheen along with other members assembles village members to act in the film helmed by Siraj played by Joju George.Halal Love Story is a 'film within a film' . We have come across many movies of the same format including the critically acclaimed Jigarthanda. Here director Zakariya chose to play within his safe zone,the same what we witnessed in KL 10 and Sudani from Nigeria. The film opens up slowly showing landscape beauty of Malabar region and some of you may find it uninteresting that the narrative and dialogues are so rooted to the Malabar Muslim culture. The proceedings get back on track when the shooting episode starts with some genuine hilarious situations revolving around the shooting spot.Among the bunch of acclaimed artists Grace Antony excels. It's good to see the talented actress getting meaty roles. Indrajith as the struggling artist and pompous husband was a real treat. Joju George , Sharaf U Dheen, Parvathy, Soubin and rest of the cast make a decent impact with their act. Zakariya has retained most of the faces from his last outing.Halal love story is more like a satirical approach dealing with some of the conservative, orthodox minds and creates situational comedy out of religious absurdity rather than outright mocking. The bland, lustreless portions were saved by the quirky, subtle humour. Thanks to the breathtaking shots by Ajay Menon, the stupendous, colourful frames lighten up the mood of the film. Songs by Shahabaz Aman, Rex Vijayan, Bijibal, Neha Nair were soothing.Halal Love may not cater to all sections of the audience. This heartwarming, funny tale by Zakariya is par below his former outing yet enjoyable considering its simplistic nature."}, {"id": 61, "text": "A good attempt by Zakariya... Normally people from other communities won't be able to understand it in a right way as those who inside it. I really happy about this movie but if you are trying to make a realistic movie, then it should be a realistic one. Don't try to make it complicated by mixing reality and drama. For example when the police station scene comes, why you people tried to make a drama over there? There is no need for a police man to walk with another guy towards the station, felt like you people were trying to make it in the same as those drama people does. This is only one example. If you people are trying to make a realistic movie then need not to worry about such scenes, we were able to understand it. Don't underestimate viewers. Make it simple, make every scenes in a realistic way. I actually wanted to give 7 out of 10 but some spoilers are trying to decrease the rating. I don't want a good movie to die before it grow, so i am giving 8.NB. Simple, crisp and a realistic one time watch movie. Worth for your time. Good attempt but needed some improvements."}, {"id": 62, "text": "I just finished watching the movie Halal Love Story on Amazon Prime. And I absolutely loved it!One more example that shows how Malayalam movies shine with good performances, unique scripts and flawless direction.Without any doubt, Grace Antony steals the show. Soubin, Indrajith, Joju George and Parvathy are excellent as usual. I was also pleasantly surprised to see the versatile Unnimaya Prasad in a cameo role.My favourite, however, was Sharaf U Deen. From the moment he comes on screen till the very end, the man was 'comedy gold'. I don't know how much of the nuances in his performance would translate to those watching with subtitles. But, with subtle gestures like an awkward nod of the head, crooked smile or movements of his eyes, he artfully conveys the frustrations of an idealist man who is neck-deep in a project that he is utterly clueless about.The desire of communities and minorities to feel seen and understood by the mainstream, without losing their identity or compromising their believes, has been beautifully captured by the movie. Apart from this, the creators of the film have also managed to capture threads like women's role in society and family, political ideologies, the hierarchy within organisations, and everyday life in a typical village in northern Kerala, without being judgemental or preachy.It is definitely not a nailbiter that will keep you on the edge of your seat. So, dont go in expecting a thriller. But there is something to be said about movies without a single negative character.If you haven't watched it yet, do try it out."}, {"id": 63, "text": "Halal Love Story talks about the concept of pure art in the sense of the so-called pure in the conservative Muslim society in the North of Kerala. Their ideologies behind religion and politics are correlated with the conceptions of their specific society. In the sense of the Muslim community, the term Halal refers to pure. That purity is not applicable in the common diaspora because we've to peel out the Islamic representation of many things around our society. Here they want to make a film, a telefilm and that must be encircled on their periphery. So from the subject to the making they deliberately thought about the ideas around their beliefs. The script was written in that mood and even though the characters also. They wandered to hire an original husband and wife to do the role of husband and wife in the cinema. So every progress in the shooting has to be restricted according to their beliefs. From that aspect to the next level the film got its deviation and it centered around the life of Suhra and Shareef, their problems associates with their marriage. The film also opens up the collapsed marriage life of Siraj, the director of the telefilm. The movie discusses some of the misconceptions around the conservative section of society. It's a satire to the people or the section who were always chained into their on peripheries."}, {"id": 64, "text": "I lost interest in Halal Love Story (Love Story Per Muslim Law) sometime around the 30th minute but I soon regained it as the messaging became more apparent and the story began to hit me in my feelings. The message - that cinema is not unidirectional - is food for thought, but I am finding it unable to accept or deny it, especially with the concept of halal in cinema hovering above, which is what the film is all about.Performances are top-notch and I would like to mention Grace Antony (who is top-billed), Sharafudheen, and Joju George for giving some of the best acts seen this year. Music is another area where it excels. But despite all that, this comedy drama reduces itself as a veiled attempt at censoring, which I have a big problem with personally.Halal Love Story ends up as a half-baked feel-good attempt that depends on metaphors to push a divisive messaging concerning Islam. Although it clarifies that the messaging is only to satiate the sentiments of the few, it comes off as unpalatable and indoctrinate. (Grade D+). TN."}, {"id": 65, "text": "Halal Love Story definitely lacks the energy and emotional core of Sudani from Nigeria (Zakariya's brilliant previous film) but the performances keep it afloat. Telling the story of a conservative community trying to make a film that is halal (permissible) enough for their audiences, director Zakariya and co-writer Muhsin Parari bring back much of the cast from Sudani.. in supporting roles (including Soubin in a LOL-worthy cameo). Parvathy Thiruvothu also shows up as an acting trainer and even sets up an emotionally-affecting, difficult-to-discuss situation between the film's lead couple, played by Indrajith and Grace Antony (terrific!).The problem with Halal Love Story is not in its performances. The ensemble does a fine job with their respective characters - Joju George (as Siraj, the film's director), Sharafudheen (Thoufiq, the writer trying to work his best within the confines of the organization he's allied to), Nazar Karutheny (Raheem, who tries to make the film's shoot a smooth-sail), and everyone else. The central conflict in Halal Love Story (as the title suggests) is how the husband and wife slowly drift apart and eventually reunite. The writing in these portions could have been better. Instead, they stick to metaphors on oil and a song to swiftly wind things up.The subplot, involving Siraj's failed marriage could have actually been leveraged to further refine the central plot. However, none of that happens. Halal Love Story sticks to the feel-good template, managing to raise a few situational laughs in the process. It's nowhere near Zakariya's best effort (in terms of messaging), that's for sure. But given the minimal number of films coming out these days, Halal Love Story can be watched with slightly lowered expectations."}, {"id": 66, "text": "I am completely baffled as well as puzzled after watching Halal Love story, wondering who this movie was made for? I am astonished on the fact how the producers (including Aashiq Abu) expected to sell this movie in the cinemas? Though the storyline may have looked strong on paper, I honestly believe it not a Theatrical release material, despite some fine acting performances in the movie. Yes, the movie has some interesting scenes &amp; comedy but that alone doesn't warrant audiences attention for a 113 minutes.The major flaw with Halal love story is, that it is targeted towards a particular community audience and its poor treatment that resembles a B grade movie despite having so many known faces in it. All important aspects of film making, resembled a B movie. Cinematography was good in the dying moments of the movie and apart from that there is nothing worthwhile to write. Surprisingly most of the Known actors did their parts very well like Joju George, Sharafudeen, Indrajit sukumaran and funny cameos from Shobin &amp; Parvathy. Grace Antony was the best of the lot and delivered a fine performance.Overall, the movie is not a total disappointment on the whole. Yes, Lacklustre writing played a spoilsport, and strains the viewer to sit through the entire movie. Hadn't been for the actors and some partially good casting the movie would have been a total disaster. Watch only if you are a fan of any of the casted actors. Four stars for some decent humour &amp; some impressive performances."}, {"id": 67, "text": "There is no doubt that the movie can be categorised as a feel-good movie. It's a visual treat as far as DOP is valued and casting is amazing as the Malayalam film industry is blessed with talents and amateurs who appeared have taken pains to do their best. This is much above the pass mark for an average mallu film quest.If we decipher the script for an evaluation, we cannot stop thinking what's a message in it. It's tough for the above-mentioned average mallu to understand if he does not know the politics of the Malabar region of Kerala 1. Its. A political agenda backed up movie. Jamath Islami group who has been shedding crocodile tears to be an apostle of the deprived is well crafted with it 2. The most used words in the script are Peace be upon you, Praise to God, God is merciful meticulously which is not situation demanding, but purposefully to incorporate the dialect which Malayalam films are not familiar with even after decades 3. The social stigma that movie makers are alcohol dependents and smokers are stressed and how it affects his family life (Character played by Jojo) but at the same time society only approves such people and we can never be a part of it as we are forbidden (The bar scene) 4.The cinema inside the cinema is nothing but the employment of women in the Muslim community how it has changed over the decade in acceptance from within. (The scene that her inlaws talk to each other.)Later the office scene portrays herself as law-abiding as the organization teaches her. The same organisation once forbid to take government jobs is an irony. 5.The most eligible bachelor in the story ( Sharafudheen) where his matrimony ad stresses that he is God-fearing and at the same time inserted into art. This is well accepted by their political group nowadays where art and music was considered to be haram 6.The financial discipline of the organization is well crafted in the budgeting scenes. It draws attention that they are so well polished. 7.The script has taken it much efforts to announce that not only Cuba Mukunda's but also Egypt sahibs are against capitalism and the communist party need not be the grandfather of the protest in Kerala 8.The obedience of their cadres is shown in the telephonic conversation between the lead actress and their party president scene which is not a lie.The daily life of the cadres are controlled by their heads. 9.The scriptwriters also declare to the mallu audience that cinema is not Varma, Menon, Thampuran only but also kaka ikka sahibSo they have been successful in proclaiming those armors All kudos to the scriptwriters that they have wrapped it in candy covers such a strong political agenda"}, {"id": 68, "text": "If Lijo Jose Pellissery is the Tarantino of Malayalam, Zakariya is fast becoming the industry's equivalent of Wes Anderson. He is able to infuse the same amount of quirkiness and soul into his characters and has the same uncanny ability to eke out humour from the most mundane of sequences. Halal Love Story does not rise to the levels of his debut hit Sudani from Nigeria but Indrajith, Grace Antony and co. deliver a charming satire that will keep you entertained. While the two leads are adequate in their respective roles as a sparring married couple acting as the lead pair in a made-for-tv movie, it is Sharaf U Deen and Joju George who deliver eye-catching performances as the ever-suffering scriptwriter and the director respectively. Watch out for a brilliant Soubin Shahir cameo that will leave you in splits. Parvathy Thiruvothu's cameo, however, is not at all memorable. Zakariya has taken two subjects dear to Malayali hearts-first with football in Sudani and now cinema with this film, and has managed to dazzle with both. Can't wait to see what he does next. Recommended"}], "reviews_amount": 69}