{"name": "Reaptown", "titleId": "tt11638714", "reviews": [{"id": 0, "text": "I found this film really interesting because of the creepy small town desolate atmosphere in which the character inhabit.The sound track was really impressive and made me feel immersed.I also enjoyed the strong female protagonist and felt like their actions seemed realistic when being faced with danger, compared to other hollywood over the top horror thrillers out there.Definitely check this out and I feel like there is a lot of replay value here."}, {"id": 1, "text": "Super creepy, slow burn thriller that constantly keeps you on the edge of your seat. Filmed almost entirely in a dark, eerie, claustrophobic setting this film has hints of the 2005 thriller The Cave. Creepy and suspenseful."}, {"id": 2, "text": "Actress Brooke Bradshaw quietly takes you by the hand and leads you through a sinister hell. You are with her all the way as she walks around an abandon train yard and it's buildings at night as a security guard on a work release program from prison. The location is real, Brooke's performance is always genuine and the places you go with her are horrific. It's a lost art for a film to fill you with dread for even a few moments but this movie keeps you there for the majority of it's run time. A very welcome return to true horror."}, {"id": 3, "text": "Great creepy locations and cinematography at the core of this terrific indie thriller. Amazing what low budget indies can pull together with a passionate cast, solid direction and plenty of imagination. Good, serious performances from the young leads too which go a long way to making us believe the strangeness of the situation. Don't pass this one up and perfect for Halloween!"}, {"id": 4, "text": "I wasn't to sure about this movie at first because it seems like the same storyline and it has its moments when it is but not a lot. It starts out creepy and remains that way throughout the entire movie. The scenes are intense my heart was pounding in my chest I had my hand over my eyes but I was peeping through my fingers when you have a movie like this with no heavy special effects and it still gives you a good scare you have a WINNER  and this is it."}, {"id": 5, "text": "A great location, a great production value, well acted, wanted to see more the monster / Killer. over all very fun movie."}, {"id": 6, "text": "Caught this stoned at 1am under new releases. Tagline for this movie really does relate to the main woman. When I read it I thought it was gonna be like a psychological horror. It is not. Str8 up supernatural and builds to a pretty freaky scary moment. Cool exercise in minimalism"}, {"id": 7, "text": "What a waste of time. It's not scary, interesting or worth anyone's time. Just plain bad low budget terrible movie."}, {"id": 8, "text": "I really love low budget horror. What the filmmakers are able to do with little money is amazing. This one had lots of tension, scary moments and kept me guessing. The trainyard was a cool location and I liked the lead actress she did a good job. If you want high budget go elsewhere - but this was innovative, I thought."}, {"id": 9, "text": "What a terrific indie film. Lots of suspense which I love. Great story, wonderful acting (I really liked the lead actress) and really good directing! This one for sure gets a thumbs up from me! Bravo!!"}, {"id": 10, "text": "Reaptown is a creepy new release indie horror film that I found in the new releases on Amazon. The lead character, Carrie, is allowed to leave prison on a work-release program. Carrie wants to find her missing sister and works as the night security guard at an incredibly creepy old rail yard. She is a woman, alone in the middle of the night, in near complete darkness, as people or things could be lurking behind any number of things, and then she starts to experience the supernatural. I have to admit I was pretty nervous and scared while I watched since I feel like I've been in a few somewhat similar situations. Reaptown is definitely a spooky indie film for the many of you out there that love these kinds of films."}, {"id": 11, "text": "This independent film is beautifully shot and the lead actress gives a a terrific performance."}, {"id": 12, "text": "Reaptown kept me on the edge of my seat. Carrie leaves prison on a release program to go look for her sister. She arrives in a haunting small town by the train tracks which made a great setting for the film to take place. Very well shot and directed with a great score."}, {"id": 13, "text": "This movie is kinda scary and it has this unique story. I used to work in a rail yard too and it was greasy and scary and this movie actualy made it obvious. could be low budget but it was a well done job."}, {"id": 14, "text": "Well produced Indy that delivers it's share of creepiness and suspense. It is well done and keeps you guessing until the end. Some very clever drone shots add to the production quality. Musical score is a bonus. Recommend if you want some chills."}, {"id": 15, "text": "Director Dutch Marich crafts a very suspenseful film, set against one of the most memorable backdrops I've seen in recent memory a Nevada Railway station, the magnificent score sets the tone while the cinematography and stunning location complete the sense of unease and dread that builds to a crescendo by the time the film reaches its climax. A terrifying supernatural entity is a fantastic element, while the spooky train yard full of eerie sounds is a character in itself. Time is given to develop the characters unlike most vapid horror films and the film greatly benefits from it. Absolutely stunning drone footage and the absence of light plays a pivotal role in setting the terrifying tone. A great horror with a unique setting, perfect for Halloween."}, {"id": 16, "text": "This is a beautifully shot indie with a unique storyline and fascinating, authentic characters. Definitely recommend. Blood curdling at certain points and overall, just the right amount of tense."}, {"id": 17, "text": "Reaptown is creepy and suspenseful. Such a great movie. The drone shots are incredible. Perfect filming location and attention to detail. The score works perfectly with this movie. The story is great, full of scares and suspense. Beautiful cinematography as well. I highly recommend this one."}, {"id": 18, "text": "I'm not someone who requires a script to spell everything out or walk me through plot points, but you gotta give me SOMETHING to work with. Location and atmosphere are top-notch. Lead actress very authentic. She just didn't have much to do. Most of the action - seriously like 90% - is our lead, Carrie, wandering around a creepy rail yard museum with a flashlight. Unfortunate, because the basic elements were there - location, cool horror premise, good acting, nice cinematography. But at the end of the day, things need to, you know, HAPPEN. And finally when something actually seems to happen, I seriously have no clue what it was. Mood can make or break a horror movie - and this one definitely has mood nailed - but without some sort of structure, the whole thing falls flat. I would actually like to see this re-made with a decent script - same location, same lead, same premise. There was wasted promise here."}, {"id": 19, "text": "Our story opens with Trisha Baldwin (played by Dani Colleen) being dropped off by her employer to work as a security guard at a railway station. She isn't there for very long when she hears what sounds like a baby crying. Trisha goes in search of the mystery infant, and instead finds a dark entity. The scene then cuts away to an aerial view of the building that Trisha was in, and we hear her scream in terror. Then we see the dark entity again.The movie then cuts to local reporter Lauren Weltroth (played by Chrissy Carpenter). Lauren is trying to sell her editor on a series of murders that appear to be related to the railway station that Trisha Baldwin was employed at. Lauren tells her editor that five different women, all hired as security guards to work at the railway station, and all five were either murdered, or disappeared under mysterious circumstances. Lauren's savvy doesn't believe in the credibility of the story, and tells her to drop the story and focus on something more newsworthy.We then cut to Trisha's sister, Carrie, (played by Brooke Bradshaw). Trisha and Carrie are both felons/ex-cons. Carrie manages to be assigned to a supervised work release program, so that she can look into whatever might have happened to her sister. She is dropped off, just as Trisha had been, at Building # 11. After listening to a training message played over a 1940s style radio set, Carrie begins her patrol. She is told that she will be picked up at 6:00 AM the following morning to be returned to prison.Armed only with a flashlight, Carrie begins her patrol. As she is walking, we see her flashlight off in the distance, and there is the sound of heavy, raspy breathing. Ostensibly, she is being watched by the dark figure responsible for Trisha's disappearance. While on patrol, Carrie believes that she catches a glimpse of something, or someone, and goes to investigate. Again, all that she has for protection is a six-inch flashlight.The movie then flashes back to a conversation between Carrie and Trisha, with Carrie doing her best to reassure Trisha about their impending jail sentences. The movie then jumps forward again, to Carrie being picked up the following morning, as scheduled. She places a call to someone, asking about the job, but no one answers, and she has to leave a message. Then Carrie picks up a message from a female caller who states that she knows why Carrie is there, and what she's doing. The caller tells Carrie that she is not safe there, and needs to leave.Carrie's immediate supervisor, Donna, returns Carrie's call, but misses her. Donna leaves Carrie and attaboy-you're-doing-a-great-job message. Carrie then speaks with the motel manager, where Trisha was staying, and asks if Trisha left anything behind. The manager tells Carrie that Trisha did leave a few things behind, and will meet with Carrie to give her Trisha's things.We then cut to Lauren, who is working the missing female security guards/railway station story, despite her editor having told her to drop the story.There is another flashback, narrated by Trish, which details that she and Carrie were busted on drug charges, with the intent to distribute. Trisha had recorded this, and mentions having heard a baby crying while at work. Carrie listens to the recording, and reports for work that night. We get a brief, fuzzy glimpse of the dark figure/entity.Again, Carrie goes on patrol, armed with only a small flashlight. While going through Building # 11, she hears what sounds like someone crying out, and rushes off to investigate. She goes through a red metal door into another section of the railway station, where she hears more mysterious noises. She finds a cat sitting in the middle of the floor in a large room, and briefly flashes back to petting what used to be her dog. She pets the cat for a bit, then goes to a restroom to wash her hands. While in the restroom, she sits in a corner and falls asleep. While she's nodding off, the door to the restroom opens and closes by itself. This wakes Carrie up and she heads out on patrol again. She gets a brief jump scares that turns out to be nothing, then has a cigarette as she waits to be picked up the next morning.Carrie receives another call from the woman who had left her the message with the warning. This time, the caller advises Carrie to find her way into the basement at the railway station, and then to locate a specific box. When she finds the box, she should listen to what she finds inside of it.That night while on patrol, Carrie goes looking for the entrance to the basement. The caller warned her that it would not be easy to find, but that she should try until she does find it. Carrie searches the railway station, and while she does so, she hears mysterious noises and catches brief glimpses of something moving in the shadows. Eventually, Carrie finds the steps leading down into the basement. She finds a lightswitch and turns it on, illuminating most of the basement. She eventually finds a box with an old cassette recorder/player, and a cassette tape.Carrie listens to the tape, which refers to a very specific incident of a young girl having gone missing. A local man named Warren Verne is considered a suspect in her disappearance. The locals tracked Verne down, and found him eating the missing girl. Suddenly on the tape, a woman named Susan begins to choke violently.After listening to the tape, Carrie calls her boss, Donna, and tries to quit. Donna threatens Carrie with greater jail time if she quits, and so she agrees to stay on the job. That night, Carrie goes back into the basement and returns the tape and player. While in the basement, she hears a baby crying. She then inadvertantly runs into the figure of a man covered in soot, whose mouth and chin are slicked with blood.Carrie runs, fleeing the basement and gets back to the ground floor, where she hears the baby crying again. Then she sees Mr. Bloody Face, who locks her in Building # 11. As Carrie searches for another way out, she hears more mysterious noises. She finds a door, but it is padlocked from the inside. She sees Mr. Bloody Face again and flees. While looking for another way out, she finds a long trench cut into the floor, but decides not to risk going into it, and backtracks her way away from the trench. She wanders around the various railroad cars stored in Building # 11, and finds another door. Before she can open it, Mr. Bloody Face shows up. Carrir starts screaming. Then, we see her outside, in the daylight, being picked up.Carrie calls the reporter, Lauren, and tells her that she is going to Las Vegas. Lauren encourages her to go, and says that she'll meet Carrie there. She knows EVERYTHING, and wants to help Carrie out.We then see a new person, a young woman named Cassie, who has been hired by the railroad to work security, as Trisha and Carrie had done. The End.So, for some reason, Mr. Bloody Face didn't kill Carrie, and Lauren knows why. She also knows what happened to Trisha and the women that went missing before her. Lauren knows all of these things, but you, as the viewer, aren't made privvy to any of it. The movie just ends. We don't really know what happened to Trisha and the others. We don't know why Mr. Bloody Face didn't kill Carrie. We don't know how Carrie was able to finagle her way out of the work release program, and her prison sentence, to get to go to Las Vegas, but reporter Lauren knows all. Roll credits.If this means that there will be a sequel, I won't waste my time on it as I had done with this piece of crap."}, {"id": 20, "text": "There are a few basic things about filmmaking I'm sure everyone knows about unless you are Ed Wood. Besides a few good drone shot, Reaptown is an absolute snooze. There is not sequence to it's narrative storytelling, the actors look like they weren't ready to shoot this during a pandemic, repetitive shots for no reason, no sense of color correction, no basic real life common sense applied to the script or character, and when you do get to see the monster you wonder if the people who made this went like, Hey this place looks creepy let's make a horror movie shall we? Who have we got? Great! We have a drone cam, a mic and us. Do we need a permit to shoot? Oh right it's a pandemic so everyone is quarantined at their homes. Can this movie be better? Yes give the job of writing, directing and editing to separate people and maybe if the actress looked hot and could act, Reaptown could have been saved. 1/10 (1 for the drone shots) nothing else."}, {"id": 21, "text": "There really is nothing positive to say about this movie. Everything was just so boring!!! Almost the entire movie consists of dark spaces and loud noises, and when things do happen, it's such a short sequence you aren't really sure what you just saw. The story itself is serviceable, but why make it such a drag? You could have done so much with such an interesting premise, but it just didn't work.Avoid this movie."}, {"id": 22, "text": "Good film for the low budget horror genre. Suspenseful, although I was a bit disappointed by the ending. Effective cinematography and great locations!"}, {"id": 23, "text": "Like so many Horror films these days, this one had potential but fell flat at its conclusion. A real waste of time."}, {"id": 24, "text": "Possibly up there in worst horror movies of all time."}, {"id": 25, "text": "I used to review a lot but got out of the habit, seeing this and another film in past 2 days has forced my hand to write again and mainly to warn others of what dire crap this film was.There is no point to this film, no meaning what so ever, I sat there thinking what is actually going on? I actually thought I had fallen into a coma or deep sleep, maybe my partner had drugged me and tied me down, no purpose to it is being kind.My only regret it watching more that the opening credits...Please do yourself a massive favour don't do it!!"}, {"id": 26, "text": "Nice camerashoots and authentic actresses. its quite depressing to see these women walking around in empty factory halls in cold weather."}, {"id": 27, "text": "This is another depressing dystopian film. It is low budget and criminals in the future are allowed to cut down their sentence served in jail by working in reaptown... Characters are so unlikable that one can not care about their fate. The foreboding feeling elements during this film amounts to a pointless ending."}, {"id": 28, "text": "If you thought you've watched the worst movie ever, you need to watch this one. I would stop after ten minutes or less, but what kept me going was it is only a 77 minute movie.Skip it while you can. Go watch a banana getting peeled, paint getting dry or anything of the sort. Just don't waste your time and don't get fooled by good reviews."}, {"id": 29, "text": "I was the smart one, according to other reviews. and gave up on this stinker right away. the mundane, mediocre and unattractive actresses in this movie, who were poor at acting at best, were enough for me to give up on it. seems like the cinema world is doing its best to fill up a bottomless pit with lousy movies these days."}, {"id": 30, "text": "One of the worst movies ever, no story line, poor dubbing."}, {"id": 31, "text": "I have never witnessed such an awful Horror film in my entire life the story line was not the worst it could have been executed so much better!The actors.. I'm sorry but worst acting I've ever seen even the voice acting ( phone calls in the film) was terrible too I'm shocked!Cannot believe this is actually a film, I'm confused how it was allows to be made this can't be serious!Whoever made this needs to never make another film again or if they do for the love of god pick better actors and actresses (voice included)Ridiculous. Only had 1 star as 0 wasn't available"}, {"id": 32, "text": "This movie was enjoyable. Not great but, I wanted to know what happened next. The ending of this was just a total let down because we the viewers are left totally clueless. Seriously, it's like the left out major scenes at the ending of this. The acting was good and for a low budget indie it could have been one of the better ones but, you can't leave your audience like that."}, {"id": 33, "text": "We are covered head to toe with 1000 horror movies per year that are nearly identical. Frankly if I see one more found footage fake real, real fake, real real or I'm sure everyone has forgotten Blair Witch buy now or it's not paranormal identity, yes it is I'm gonna fill my pockets with rocks and walk off a short pier or I'm going to find a huge bear and start to poke it with a small stick. The more horror movies with a new plot that doesn't have impossibly attractive people with zero talent the better. This seems real and by real I mean actual people, attractive people that have at least some depth some ability to emote. Is this perfect, no. Is this movie perfect, no. Is this movie good, better than good. The atmosphere is excellent the mood is great how this movie looks is exceptional, the setting is unique and the presentation is excellent. The things I listed are what makes a horror movie good. The fact that from the start you have no clue where it's going and the ride is new and unique in its own right makes it good and the setting and how the story is presented make you feel it it. What the story is about is personal loss and how a person deals with the unknown. It's incredibly easy to put yourself in the lead characters shoes and at least for me it brings back the dread that I had going to a darkens basement alone as a kid, not something that bothers you now but the felling that is brought back immediately the second you see it. The is unconventional, the story is simple and easy to follow and most of what occurs has more to do with what it does in your brain then what happens on the screen. You have jump scares and for some that's a problem but that to is an individual thing that says more about the person saying it than a legitimate criticism of the movie personally I think if someone complains about jumps scares it says to me that that person doesn't like horror movies and shouldn't be allowed to review them. I want to feel uncomfortable watching a horror movie, i want to have that childlike feeling of dread and to need KNOW where the remote is at all times so I have that quick escape. That's what I felt watching this and that's a horror movie. I'm not going to talk about the end at all, how the story ends is never less important then a horror movie. Think about how many open ended movies you've seen, movies that had ambiguous endings with huge plot holes, I'm not saying that that happens here, I'm not saying that at all, I'm only saying that because the ending of any movie is usually the biggest problem people have and that even if has that issue it shouldn't matter. It's the ride that counts and as far as I'm concerned this ride was excellent. It's not the greatest horror movie ever but I was never comfortable, what more could you ask."}, {"id": 34, "text": "Impressive on many counts, not the least of which is that director Dutch Marich, on an indie budget, weaves his magic to manifest cinematography, lush scoring, superb casting and dread to match a 10x bigger budget film. While I might quibble with his choice of the film's resolution, I have no quibble with the uniqueness of the story - women who are assigned a work release program after getting out of prison mysteriously disappear - or other exceptional attributes.The casting is quite singular, especially for an indie, which tends to populate films based on good looks to the detriment of character or backstory. There is not an actor in the film who is not interesting to watch, authentic to the role, and charismatic.The cinematography, combined with the scoring, are the first things we notice, with sweeping pans over the town and vista, moving to the railyards where the action is centered. The music evokes the lush scoring of Bernard Herrmann or Elmer Bernstein from Hollywood's golden era, underscoring the lushness of the cinematography.This director has the maturity and instinct to let the story take its time, and build up the suspense and dread, which reaches nail-biting moments as it reaches the apex, near the end.Many idiosyncratic touches also add to the director's taste and confidence in his craft - from the vintage tape recorder to the casting of the newspaper editor and reporter to the use of an intriguing railyard museum in a desolate Nevada town as backdrop.And the expert use of drones to provide the panoramic sweep and enhance the suspense and dread, as well as the subtly of the drone movements, is impressive even on its own terms.Many idiosyncratic touches also add to the director's taste and confidence in his craft - from the vintage tape recorder to the casting of the newspaper editor and reporter to the use of an intriguing railyard music in a desolate Nevada town as backdrop."}], "reviews_amount": 35}