{"name": "Godmothered", "titleId": "tt11681250", "reviews": [{"id": 0, "text": "I'm so sick of critics not liking movies that just plain make you feel good and smile! What's so wrong with that??! I thought this movie was adorable and brought a smile to my face for most of the movie! Watch it, you'll surely leave it feeling better than you did."}, {"id": 1, "text": "Godmothered is a 2020 family comedy starring Isla Fisher and Jillian Bell. Directed by Bridget Jones director Sharon Maguire,the story is about an inexperienced fairy godmother named Eleanor(Bell) who travels to modern day Boston and helps a single mother who works at a Newsroom named Mackenzie Walsh(Fisher) who lost her husband 4 years ago and is rearing her 2 daughters on her own with her sister. But with just a few days left before Eleanor goes back to her realm can she help Mackenzie find her happily ever after.Yes the premise reminds me of Enchanted meets Elf as both films are set in fish out of water worlds but overall I was surprised by this film. The story was great, the actress that played Eleanor was hilarious and Isla was good too. Also keep an eye out for The sound of music.If you are looking for a fairytale that focuses on loving yourself and that you don't need man to complete you then this is for you,if not well pass.B"}, {"id": 2, "text": "This movie is great! It has a certain realism to the family in this movie. Usually, movies make families out to be picture perfect, but Godmothered shows it's okay to have flaws!This truly is a wonderful film to watch with the whole family! It's entertaining, funny, and heartwarming!"}, {"id": 3, "text": "Even though most happily ever after movies are about finding true love, Disney has shown us that it's not always finding a man. Rather, you could focus on the little things and live happily ever after💗"}, {"id": 4, "text": "For the most part, this was a cute movie. I liked the fairy godmother's attempts at trying to bring Isla Fisher's character happiness in one way, without realizing that she was becoming happier in another. It's a good message, though extremely predictable - at this point, trying to encourage the breaking of old tropes is becoming a new trope on its own. I would've preferred something more original, but as long as my intelligence isn't being insulted, it's okay.Then, the movie had to stop in its tracks and explain to us what true love is, while simultaneously claiming that it shouldn't be told but shown. That is lazy writing. I mean, the movie wasn't subtle before, but it didn't just outright preach to us either. I can't believe I'm saying this, but Frozen did the true love with a twist bit better."}, {"id": 5, "text": "I saw this come up on Disney + and thought why not? And I wasn't disappointed either. Bear in mind I'm 41 and I watched this on my own with no kids - I was smiling and laughing and it was a really enjoyable two hours of my life. The character of Eleanor was really lovable. She played a great part. Not too saccharinely-sweet that you got a toothache and she bounced off Isla Fisher.So screw the haters. This film deserves the credit it's due. After such a rubbish year, we all need a bit of Disney magic."}, {"id": 6, "text": "Ignore the people moaning about this being 'woke.' It's nice to have a film that doesn't push the importance of happiness for women revolving around having a 'prince.' And in fact we can all be happy and feel loved in our own ways. Too many people look to movies for the answers and for decades have been told you can't be happy without having someone special but love takes many forms and happiness comes in many more.Generally that people that moan about films being woke are politically correct are the reasons films like this matter."}, {"id": 7, "text": "This film is cheesy and predictable, but that doesn't stop it from being a good and enjoyable watch from start to finish. Overall, a great feel-good B-list movie that comes out just in time for Christmas for you to play in the background. Do give this a watch if you have nothing else to do, or if you just want to keep your nephews entertained."}, {"id": 8, "text": "Cute, fun, wholesome, and heartwarming. Great holiday movie for the kids and the whole family."}, {"id": 9, "text": "This story could have hit harder with the emotions, but they just skate lightly across the dad's death and how it affects them and then its right back to oh quirky me I'm a fairy and I'm not good at magic! In my honest opinion? The last part with the 2d animation was better than the entire movie. Give me more of that and I would have been happy but the animation comes out of nowhere, like it was a last minute thought to throw in. Also, why make it surround Christmas? The plot felt so distracted with the multiple themes going and the adding of Christmas ontop of it felt like Disney was just checking off their seasonal movie quota. All in all, if you have time to waste, watch it. But if you're looking for a Disney movie to enjoy and be enthralled by? Watch something else instead."}, {"id": 10, "text": "I had fairly low expectations of this movie when I sat down to watch it with my tween daughter, but I have to say it turned out to be one of the best Disney movies I've seen in a LONG time. Sweet and funny yes, but with a healthy dose of realism that keeps it from being too saccharine. Great acting, fantastic music, fun plot line. Well-worth the time spent watching and something I can see myself watching again."}, {"id": 11, "text": "Disney is a guarantee... I enjoyed it so much... I hope that many people can be carefree watching this movie, as happened to me"}, {"id": 12, "text": "Disney does it again with a feel good Christmas movie that takes places in Boston. Eleanor (Jillian Bell) who can't carry a tune in a bucket is a Fairy Godmother in training at a school that faces shutdown due to lack of business. As a student she takes it upon herself to help young Mackenzie (Isla Fisher), but to her surprise is all grown up with her own children and works for a news station. Unfamiliar with the world and slang, Eleanor is determined to help.Enjoyable film for everyone."}, {"id": 13, "text": "I really enjoyed this movie! Easy and fun Christmas time watch! Thank you Disney for brightening my day!"}, {"id": 14, "text": "It is exactly what you think it is. A cute little Disney ditty that ends happily. Sweet movie, well acted. Not rocket science just. good time."}, {"id": 15, "text": "If giving up on permanence or the idea of life-long commitments in exchange for choosing to be happy settling for whatever is currently available is the desired theme for your family movie night pick Godmothered.Personally, we were more than disappointed when this movie ended with the humanistic anthem which Disney attempted to pass a Christmas carol."}, {"id": 16, "text": "The CGI was a bit cheesy and cheap, but the story and characters, although predictable, were absolutely heartwarming. The right thing for Christmas time and especially a bleak 2020."}, {"id": 17, "text": "This film should be terrible but it is far from it. Jillian Bell is a sensation in this film and Isla Fisher is great as always. It should come off as a cheesy children's film but it's actually hilarious. I recommend this a thousand times over. I look forward to rewatching it."}, {"id": 18, "text": "Amazing film for any age. It will make you believe in magic again."}, {"id": 19, "text": "Very cute holiday Disney family film! Highly recommend it!"}, {"id": 20, "text": "Shame on all the negative reviews for this movie. Shame! Absolutely needed this movie for the ending to a truly unbelievable year! I loved it! Absolutely loved it! Thank you Disney for such a very fine and memorable movie. I cried for believing and laughed for the sheer feeling of laughing instead of crying. Haven't done that for awhile as started believing this ugly year would take my life away from me. In my opinion, a truly good and wonderful movie comes along once in a great while. This is one of them. Happily Ever After can come in many designs. Count your blessings."}, {"id": 21, "text": "Surprisingly fun movie for the whole family. Well done Disney."}, {"id": 22, "text": "I loved it. We need to remember how to feel happy about or lives and stop being so cynical about everything and this movie made me remember how important this is. We don't need to keep searching outside for something that has always been there for us. Inside of us. Appreciation for what we have will di the trick.Very nice characters, approachable, more human than usual roles on this kind of movies.I was also really surprised by the musical choice during the final credits. Really refreshing."}, {"id": 23, "text": "This was adorable! It was funny enough to keep my interest and clean enough to watch with my kids. I'm so happy we decided to watch it!"}, {"id": 24, "text": "OK, first of all, about a quarter of the time the writing showed just a little bit of edgy cleverness. It doesn't handle the collision of the real world and Disney magic very well, but what movie does? There were some scenes that got close to too saccharine, too much, but it never quite got too far.All that said, if you are willing to numb your brain (as I am all too often) it is a sweet story that also has just a smidgen of entertainment for adults. Kids might like it."}, {"id": 25, "text": "If you're looking for some cheesy laughs, this is the movie for you. Disney refreshingly continues to poke fun at its princess and true love tropes and offers a female led film with modern twists. It balances humor and heart, and if you watch with an open mind, you'll have fun too - which is exactly what this movie's experience is meant to be.This is the first Christmas movie since 2006 that I can honestly say I will be adding to my annual holiday watch list!"}, {"id": 26, "text": "It's a gd movie with a gd message! Worth a watch with the family."}, {"id": 27, "text": "I struggle with movies both my older children will enjoy together with the rest of the family but we all enjoyed this movie it was really cute and funny I recommend watching this especially if you have young girls"}, {"id": 28, "text": "I adored this movie and was pleasantly surprised. I thought this was going to be another over fluffed disney production that looked pretty but lacked a good story but I was wrong! My husband and I watched this and thoroughly enjoyed it. Perfect holiday feel good family movie. It's worth rewatching and we arey the types who love feel good corny Christmas movies. Godmothered has the right amount feel good cheese that you don't hate. It's just so good! Will be rewatching every Christmas. Wish we could have seen it in theaters!"}, {"id": 29, "text": "Comedy was cliche and did not make me laugh once. Waste of comedic talent :-("}, {"id": 30, "text": "Such a good movie. Brought me out of my funk today. A few parts made me tear up. Delightful!!"}, {"id": 31, "text": "I wasn't upset that I watch this movie. However, once was enough for me. It was way too close to Enchanted, only not as funny and not as well executed. The message the whole time was finding a happy ending. It would make sense if they continued that message and showed the audience that there are different kinds of happily ever after 's. But instead, the message at the end was love is love. Why in the world would they change the message? It felt pieced together. It makes me wonder if they had an alternative ending but it wasn't PC enough, so they through together this ending. I don't feel like it was a waste of time, but there are definitely better movies out there."}, {"id": 32, "text": "Good watch, could watch again, and can recommend.This is a weird little gem of a watch. Not only is it a goofy and fun family movie, but it has a fun story in a story style of structure to it.While the main story is Ellinoore trying to help Mackenzie, it is literally a support story to Mackenzie's story, so the B story is the actual main story. It's not that important, just an amusing note.The movie is filled with fun, feel-good moments. While it's not going to be an award winning movie, I think it's almost a guaranteed good movie for almost anyone."}, {"id": 33, "text": "I really like Jillian Bell and Isla Fisher, so this was a no brainer."}, {"id": 34, "text": "Okay so this is a movie i as a guy watched only because i have a crush on the fairy godmother actress but i wound up laughing a good portion of the film and i recommend it to almost anyone perfect for kids and parents as well i can see a little boy enjoying this so its unisex as well i say take time exspesually in these unpredictable times and watch it"}, {"id": 35, "text": "Every year, we are bombarded with so many Christmas themed movies and shows. But this one is not a cliche one with cliche stories. Touching, loving and heartwarming."}, {"id": 36, "text": "Finally an original story, not a reimagined classic or over used story line. Somewhat cheesy but overall a feel good movie that's family friendly. Definitely a new favorite."}, {"id": 37, "text": "Godmothered is an interesting take on the Godmother tripe and a Christmas movie. I actually like the Godmother part, but it was a bad idea to make it a Christmas movie. I liked the Disney Animation movie references. I think the acting was just like I expected and the atmosphere was fine. In the end it was just a Disney Plus take on the Netflix knight movies. Honestly I hoped Elanor got clear redemption for her misstep, but yes it's maybe a too simple movie to do that. Sadly they didn't give us backstory about how the Godmothers forgot their passion for being a Godmother. I think the tone from Raise of the Guardians was better for this movie."}, {"id": 38, "text": "Has its moments of cheese but nothing insufferable, but refreshing to have a female driven movie that speaks to the wonder of finding joy in life, without pandering to old tropes."}, {"id": 39, "text": "Enjoyed watching this movie with the family. It was sweet, funny, and well acted movie. Loved all the characters. A time well spent watching this holiday special movie. Recommend it!"}, {"id": 40, "text": "Well despite all the cheesiness Godmothered is a cute lovely enjoyable movie with a powerful message. The story is nice and interesting with important life lessons. It's also funny with many hilarious moments. And the best thing about it is that it has the spirit of Disney's old movies. Besides it has beautiful Christmas vibes which makes it a perfect choice to see these days. Godmothered is a fun family movie that kids and adults would enjoy, I personally loved it way more than I thought I would."}, {"id": 41, "text": "Such an Amazing movie, it's been a while since I laughed like I did while watching This, Light, Fun, Comedy, with a bit Of Magic, very recommended for a sweet evening with your family."}, {"id": 42, "text": "True to form, this is a genre pick, a true blue fairy tale. Acting, writing, directing &amp; the beautiful costuming completely reflect spot on attention to every detail. Godmothered is hilarious touching, charming &amp; simply a delight."}, {"id": 43, "text": "This movie was exactly the movie I wanted to watch. It made me laugh and feel good and I loved the overall message. I am adding this to my holiday movie list and am excited to revisit it again next year."}, {"id": 44, "text": "I loved every minute of this movie. It was warm and fuzzy and made me laugh out loud many times. Highly recommend!"}, {"id": 45, "text": "It's a good kid movie nothing more. I was thinking it was a little more than that. But no it's not. Of course it's only my opinion."}, {"id": 46, "text": "It is a nice movie, with a little magic and fun moments. It is not the best storyline I've seen but definitely was cute and warm"}, {"id": 47, "text": "Being a godmother myself I was looking forward to this and wasn't disappointed"}, {"id": 48, "text": "I loved it and cried lots of happy tears. And I'm 31"}, {"id": 49, "text": "My family loved this! It will make you smile and probably feel better than when you started it. Just a pleasure to watch."}, {"id": 50, "text": "As a dad of two daughters, I'm really enjoying this recent crop of films that are starting to encourage young children, especially girls, to think outside the Happily Ever After Disney Princess box. Life isn't perfect, but that doesn't mean it can't be good.All of the characters are well cast as you'd expect from a Disney offering, and the chemistry between the main protagonists is excellent. Yes, it's sugary sweet, but not sickly. Yes it's predictable for grown ups, but the different take on the genre is refreshing in spite of the customary happy ending. It just might not be happy in the way you'd expect! ;)"}, {"id": 51, "text": "The premise for the movie was a cute idea. Parts of the movie were fun. However, it was not executed to the fullest potential. If you were living a mediocre life and a fairy Godmother appeared begging to help you, why would you not fully take advantage and treat her like some kind of genie after she just showed you she had the capacity to grant your desires and help you achieve your happy ever after instead of casting her off to hide in a basement? The story could have provided so many more opportunities for use of magic and cool effects, as well as injected many more comedic moments with the god mother's attempts to perform not turning out as expected. I was expecting something more along the lines of Enchanted, but it fell short. It was not horrible though and far from the worst small screen Disney movie I've seen."}, {"id": 52, "text": "This movie reminds me of a classic Disney channel movie. Great message, adorable movie, with diversity and inclusiveness along the way."}, {"id": 53, "text": "It was a really cute movie. My family loved it Definitely fun to watch!"}, {"id": 54, "text": "Loved this movie 🍿 I wasn't sure what to expect but it is a perfect fun family holiday movie 🎄Give it a chance, I think you will be pleasantly surprised!"}, {"id": 55, "text": "I hated the scene were she sips milk of of a Baby's head...It just felt forced. That baby looked like it was having a terrible time. It just didn't belong in da film. I also hated the Scene were she kickflips so hard Tony Hawk dies, that was weird. I still can't get over that baby, though"}, {"id": 56, "text": "I've seen so many magical Disney movies in my lifetime and this was not one of them. I found myself being extremely bored throughout the movie. The CGI is just too much and borders being aweful. CGI effects should look more natural than fake."}, {"id": 57, "text": "I normally don't watch films with IMDB rating under a 6 so was really surprised I enjoyed this movie so much. 5.6 is definitely underscoring here. This should be more of a 7.6"}, {"id": 58, "text": "Not that special. Not consistent. A lot of jokes that don't make seance to actually be funny."}, {"id": 59, "text": "This is a fairytale, so any thoughts it should be more are drivel.The main characters did a good job through the first 90 minutes, and then ... splat.Would have rated much better."}, {"id": 60, "text": "Sorry I never got fun watching this movie, itis not funny, so predictible, nothing new, just the same ideas, you know all that is going to happen here, not good, not funny"}, {"id": 61, "text": "WAYYY too generic and WAYY too predictable, the whole way you go I bet this will happen and does, no twists! A cute message and some moments in the film were enjoyable but for some reason this movie felt more annoying than it did enjoyable"}, {"id": 62, "text": "I don't usually watch movies within that category, but Godmothered is a fairly good movie. It gave me some Enchanted vibes, it was kinda hilarious, but the ending was too cliché."}, {"id": 63, "text": "This was a fun film. All the actors were hilarious and Jillian was great as the godmother, she reminded me of the character Buddy the Elf and how she sees the good in things and will try her best to make people happy.If you want a solid Disney film, this is a great choice."}, {"id": 64, "text": "Let me start by saying I'm a Disney fan, and I was prepared to love Godmothered. It's Disney, after all. Fairy godmother in training, mixup with time, a family in need of love and joy at Christmas. Clearly a recipe for success, right? Wrong. I soon gave up my expectations of loving it and decided it would be one of those likeable enough movies, only to downgrade again to I'll stick it out to the end; surely it won't be a complete waste of time. Sadly, it was such a disappointment that I am spending even more time on it writing a review.Predictable, slow, and boring. Very few characters with any depth. Feeble attempts at humor, most of which fell flat. Sad. Just sad."}, {"id": 65, "text": "This movie is hilarious. I can't say enough about it. Adorable funny family feel good Disney movie."}, {"id": 66, "text": "It's been a while since we had good family movies...I really loved this one. Such a breath of fresh air. It's cheesy but it's perfect in all the right places."}, {"id": 67, "text": "This was cute and unique. Good cast and funny moments. I like that the message wasn't that a woman needs a man to be happy or find happily ever after. It had an Enchanted vibe where it took a cliche fairytale character and threw her into the real world where she was totally clueless. Sound of Music shoutout was fun too."}, {"id": 68, "text": "Such a good movie loved it alot it's cute funny and very magical. If you love the beauty and the beast and cinderella remakes you will love this movie"}, {"id": 69, "text": "Very fun and cute family holiday Disney movie. Really enjoyed this fun ride and adventure ."}, {"id": 70, "text": "It's a good movie to watch it with your family and kids at Christmas"}, {"id": 71, "text": "This is not a oscar-worthy movie. Every twist or obstacle we have seen in hundreds of other movies. But this movie is charming, funny and lighthearted. I reales liked it.Oh but i can only give it 2 Stars because there are 2 guys with a Child in the End. That is so woke and i hate that. My Life is ruined because for 5 seconds I am Not represented and maybe someone else feels happy for a bit. My life is oh so sad. *sarkasm off*Nice Little movie."}, {"id": 72, "text": "This is such a wholly underwhelming, supremely generic movie that would have undoubtedly been a made-for-TV film in years passed and is now relegated to the realm of streaming nonsense. Isla Fisher is a talent and she's fun here because she's always enjoyable but that's pretty much the only positive I have in what is otherwise an incredibly forgettable film that is not worth your time. It's not even good background noise because there's nothing really worth looking at it, there's nothing awful but nothing even remotely redeeming. It strives for nothing and achieves it."}, {"id": 73, "text": "Any negative review of this clearly doesn't understand thinking outside the box from a creative viewpoint. This is a creative twist on a classic holiday story (happily ever after). About time the fairy godmothers get their own story. It's really cute and full of holiday spirit making it the perfect family movie in time for Christmas."}, {"id": 74, "text": "It's very heart warming and enjoyable. There are even a few laughs in here. It's the spirit of Disney and it's also a Christmas movie. Great cast. We loved it!"}, {"id": 75, "text": "Funny from beginning till the end. No deep crisis being dragged out, an overall feel good movie.It's well acted, well written and well executed for a christmas movie. This one is the newest addition to my X-mas classics collection of movies I watch every year!Bad critics, well, they could use a touch of magic ;)"}, {"id": 76, "text": "Feel good Xmas movie. 👍👍 kids will love it ! Good for the whole fam."}, {"id": 77, "text": "This is a fun movie to watch. It has some really funny parts and its a good movie night flick to watch with the family. Nothing fancy, but all around decent."}, {"id": 78, "text": "I'd like to start by saying this is an 8 for a kids 'made for tv movie. The story telling is wonderful. Isla Fisher is forever ageless as a single mother. This story takes a magical turn; and a cameo by Jane Curtain is quite pleasant. The end is worth the watch and I admit my glasses fogged up. If you're looking for magic and inclusivity - this is a wonderful watch with the kids of all ages. There enough adult humor to enjoy as well."}, {"id": 79, "text": "Omg, she is like super funny cute! Lol great family movie."}, {"id": 80, "text": "First thing it's a good family film and it's perfect for Disney plus. The film tries to hard to be like enchanted but it's not and that's the main flaw. The acting is great and they do there best from a weak script."}, {"id": 81, "text": "This movie was so cute and such a fun surprise! The cast couldn't have been more perfect, I've always been a huge Isla Fisher fan. I wasn't sure if I was too much of a Jillian Bell fan but she was adorable in here. Heartwarming story about family and love! Cute holiday movie."}, {"id": 82, "text": "Very fun , cute and nostalgic Disney family adventure! Highly recommend it!"}, {"id": 83, "text": "What a wonderful and lovely film! Love Isla Fisher and Jillian Bell! What a lovely script and story! Love is in all"}, {"id": 84, "text": "Why is a fairy godmother sleeping on a stack of mattresses like the Princess &amp; the Pea? It's questions like this that will routinely pop up while viewing this Disney movie and this is due to the fact that when it comes to fantasy world-building Godmothered is more about easy and quick referential humor than it is about making a lick of sense. When watching this movie we are not expected ask such questions as Why are the fairy godmothers unaware of the advances of technology? or How exactly does one apply to be a fairy godmother? unfortunately, that kind of questioning bombarded me throughout this movie's interminable two-hour running time. Isla Fisher was fine as the jaded woman who never got her Happily Ever After but the writers never really gave her anything more the a bunch of tired working woman cliches."}, {"id": 85, "text": "Lovely film with typical Disney appeal. If you love Enchanted then you will definitely love this one."}, {"id": 86, "text": "Its so fun so amazing new ideas greattttt ending the message from the movie so meaningful"}, {"id": 87, "text": "Thoroughly enjoyed this movie! The movie explores realistic family dynamics in a realistic fairytale."}, {"id": 88, "text": "Godmothered is a delightful family movie and a worthy successor to Enchanted, told from the perspective of the iconic fairy godmother. Like all crossover tales from fairy land to harsh reality, the movie is full of laughs and contrasts. Jillian Bell is amazing as Eleanor, the go get em fairy godmother who doesn't take no for an answer. The lessons of the film are beautiful... Fix your own problems and find your own form of true love. We had tons of fun watching this as a family."}, {"id": 89, "text": "I really enjoyed the movie. I watched it with my wife and grandkids and I think my wife and I enjoyed it more than the kids. It's one of those movies that make you laugh and cry and at the end you feel good inside. I loved the movie and would recommend it to anyone. Add this movie to your yearly Christmas movie list"}, {"id": 90, "text": "Godmothered 2020 PG Director: Sharon Maguire Starring: Jillian Bell, Isla Fisher, June Squibb, Jane Curtin, Olga Merediz, Stephnie Weir, Santiago Cabrera, Utkarsh Ambudkar, Jillian Shea Spaeder, Willa Skye, Mary Elizabeth Ellis etcOverall rating 82/100Godmothered is about a young fairy godmother who sets herself an assignment due to the impending closure of her academy instead training to become tooth fairies. She must find Mackenzie a 10 year old girl to make her dreams come true, but only to find out that she is a 40 year old single mum who has given up on the idea of happiness, She must prove that fairy godmothers are still needed. Despite a few floor I really enjoyed Godmothered and its heart was always in the right place so lets get started.The concept was interesting, the cinematography was fantastic and the set up was a lot of fun. I thought the concept of the movie to be really fun and interesting, how they managed to create a generic concept and flip it to be more personal and link it to day to day life with real families going through a tough time and lost their happiness was just great, and the concept of a fairy godmother was handled well too. The cinematography of the movie was also fantastic, the movie truly had better CGI than what I thought it would have, there was some trully visually stunning moments in the film that just took you out of the movie for a brief moment and was beautiful. I also thought the set up of people not believing in fairy godmothers anymore gave The main character great intentions and stakes for the rest of the movie and instantly made her very likeable.My next few positives would be the humour, self aware tone, comedic performances and chemistry between characters. This movie was absolutely hilarious, this was largely due to Jillian Bell, but the script was fantastic with its comedy, and the concept of a character from another land not having a clue whats happening in the real world was executed in hilarious fashion here and had me laughing out loud on multiple occasions. I also liked how self aware the movie was, The movie knew what kind of movie it was and openly played with that within the script and characters, so it flipped the audience expectations on their head with movies like this which was great. I also thought the comedic performances were fantastic, Jillian Bell played this role fantastically, she executed all of her jokes perfectly and she just had so much comedic charm you couldn't help but smile whenever she was on screen, Isla Fisher was also fantastic. The chemistry between Isla and Jillian was also great, they worked really well together, and the relationship that developed between them both, felt authentic and was really fun to watch, the whole cast worked well together.My few negatives for the movie however, would be the corny script, the movie still being fairly generic with its execution and some pacing issues. The script was fairly weak and corny in places, some of the lines of dialogue between different characters just didn't land very well and felt awkward in places, making the execution of some of the lines and humour not always land. I also still found despite not being predictable and having an interesting idea the movie still felt slightly generic, It felt like the movie went to overly ambitious with its idea that it never executed its full potential with the plot, leading to it still falling into a lot of generic tropes for the genre and character types, it was still enjoyable to watch but still felt very familiar when it could have been something completely different. I also found a few pacing issues especially within the first half of the movie, a lot of the first half felt very repetitive making the pacing seem off and slow for the first 45 minutes or so, it just took a while for the movie to truly get going and be as good as what it was.My final few positives would be the heartwarming moments, the character development, good character conflict and fantastic final act. The movie tackled a lot of deep issues really well, it lead to a lot of heartwarming moments throughout, it really expresses the emotional impact a death can have on a family so well, because of this the character development between Jillian Bell's character and the whole family, she bought the happiness and light back into the families life and encouraged them to go outside of their comfort zones, It was really great to see the whole family develop and get closer as the movie went on. I also thought the movie had really great use of conflict between Jillian Bell and Isla Fishers character, the whole concept of using magic to make everything better was explored really well, showing the positive side to it and the negative as some things just need to happen naturally which was a great development for the main character. The final act was also extremely heartwarming, with the character arcs of the family and to finally see them truly happy was just very sweet and put a smile on my face.Overall Godmothered is a great addition to the Disney catalogue, however it never truly executed its interesting premise to its full potential and took a while to truly find the movies heart and charm, but once it did, Godmothered was a funny and charming movie, with fantastic chemistry from Jillian Bell and Isla Fisher and is a great movie for the whole family to see at Christmas time."}, {"id": 91, "text": "Godmothered was a good family film that can be watched during this Christmas predays and having some fun while watching it with families and i think that even young kids will have fun with this film cause it can teach them some lessons and it even teaches adults that they should still belive in something and not just live in a sad past but to accept a bright future .Story here was of course very cheesy and sweetsy but for this kind of film it worked in a fine and cute way.Godmothered was a fine film to watch during this season"}, {"id": 92, "text": "This movie would have been a lot better if they would have left out the allergy scene. Allergies are no joke. Our culture makes fun of the situation when in reality it made my daughter cry. This could and has really happened to her. There is not always a happy ending. There are so many other things that could have been done."}, {"id": 93, "text": "Godmothered is Disney's latest Christmas film. It tries to be cheesy and predictable in a good way, as these films always do, but it fails miserably. There wasn't a single thing that I actually liked. Everything was either unfunny or felt like it was trying way too hard.Making movies like Godmothered isn't hard. But making them good is. These movies rely on being cheesy and predictable but making us forget about all that because they are heartwarming and make us feel happy. The line where all these things happen is surprisingly thin, and for the film to work, it has to be exactly on that line. Not over or under even by a tiny bit. The movies that manage to stay on the line, while not masterpieces, end up being more enjoyable than they have any right to be. While they are cheesy and predictable, they are so in a good way. And then there are films like Godmothered, that find themselves way over that line. The end result, then, ends up being a near unbearable mess. Instead of being pleasantly cheesy and making us laugh at it, the whole movie ends up being nothing but one cheesy moment after another. And when a film does that, it loses any charm it might have. It becomes a chore rather than a source of enjoyment.The story in Godmothered is exactly what you'd expect. In fact, it's awfully familiar. There is nothing new in it. We get to join Eleanor on her journey to becoming a fairy godmother. But as it turns out, the need for fairy godmothers has vanished, and the academy where they are trained is closing down. Eleanor must find a wish to fulfil, not only to keep the academy open but also to fulfil her own dream. While the story sounds very fitting for a movie like this on paper, the way it's carried out, made me lose all interest. The better movies of this genre, while often predictable, usually offer something new to set themselves apart. This one, however, is the most basic story that you could ever dare to expect. I could've accepted that had there at least been some twist in it, but alas, there isn't. As soon as the film starts, you know exactly what it's going to be like. You also know exactly what is going to happen in it. There isn't a single moment that made me go, 'Oh, wasn't expecting that'. And I get it, these types of movies tend to be like that, which is fine, as long as the film is funny, and makes me feel happy. Godmothered did neither.Whenever I watch movies like this, meaning cheesy holiday comedies, I try to take them less seriously. I acknowledge that they aren't trying to be masterpieces or even particularly good. Their only goal is to make us feel happy and comfortable and warm and safe. It doesn't matter how bad the film might otherwise be. If it manages to do those things, I have no reason not to enjoy it. But it must manage to do them. They are the only thing keeping it afloat. Godmothered is a prime example of what happens when a movie fails to do so. During the near two hour runtime, I didn't laugh once. The scenes that were supposed to be funny were way over the top and overly cheesy, a theme that ended up defining the whole movie. Another thing that Godmothered failed miserably was making me feel Christmasy. If these movies rely on being just the right amount of predictable and cheesy, they rely just as much on creating and sustaining the holiday mood. While Godmothered takes place during Christmas and tries it's hardest to make it feel like it, it never gets there. For some reason, and I'm still unsure as to what that reason is, it doesn't feel Christmasy at all. The certain cosiness and warmth that I associate with good Christmas films, is nowhere to be found. And it certainly doesn't help the films cause.Godmothered was a letdown in every way imaginable. Everything it tried to do, it failed at. It was too predictable for its own good. It was cheesy to the point where it lost all its charm. And it completely missed one of its most important tasks, putting me in the holiday mood. I wish I could say that there was some redeeming factor, but unfortunately, there isn't. And as one would expect, the final result isn't pretty."}, {"id": 94, "text": "Okay, gotta admit I liked the trailer for this and was actually excited for it. But that changed very quickly as I found myself checking my phone before I hit the ten minute mark. And I decided to bare with it. However, I'm honestly curious on who wrote the screenplay, I've seen funnier dialogs on walls covered with graffiti. By the half-way marked I had completely checked out. The jokes fell flat and the story is slugish. The story is about Eleanor an apprentice who's dream is to become a godmother and help someone in need. And honestly the trailers made this out to be a light-hearted film, with little to no humor. Which would been so much better. But this is a comedy(I think). As there is a joke before you even hit the first minute mark. I'm curious on who the demo for this film is aimed at, because I can't imagine a kid enjoying this, it's not entertaining. I'm really disappointed mainly because I love Isla Fisher. Such an underratted actress. And with Disney behind the production I knew it would have a budget. Apparently, money can't buy quality writers, here's the proof.I wish the film didn't rely so much on humor, if it focused on it's story and world building, this could have been a light hearted film, heck I would have taken a cheesy rom-com over this. At least most of those films don't take themselves seriously."}, {"id": 95, "text": "Disney could have done so much more with Godmothered. Unfortunately, it lacked in every department. It wasn't funny, (I didn't laugh once) it wasn't cute, the characters were very unlikeable and the dialogue is very clunky. It's hard to believe the same people who created Bridget Jones were behind this atrocious movie.Every interaction between Mackenzie and Hugh is beyond awkward yet Disney wants us to believe they're flirting with each other. (On what planet, exactly?) On top of that, Hugh's accent (played by hunky Santiago Cabrera, though his handsomeness is nowhere to be found in this movie) is all over the place and just plain awful. Where is he supposed to be from?The best characters in this movie are Gary and the pig, hence the two points. Other than that? Don't bother, watch Enchanted again if you are looking for some good ol' fashioned Disney magic because you won't find it here."}, {"id": 96, "text": "If you haven't heard by now, there's a new Disney film that's sure to become a favorite holiday classic-it's the magical movie called Godmothered. This film is a fun look at the world of Fairy Stepmothers yet also a sad realization that not enough people nowadays believe in magic or that magical things can happen if you wish for them with all your heart.Set at Christmastime, Godmothered is a comedy about Eleanor (Jillian Bell), a young, inexperienced fairy godmother-in-training, who learns that the future of godmothers is coming to an end forever. Feeling that she can save herself and her fellow fairy godmothers from unemployment or from getting new jobs as tooth fairies, she decides to show the world that people still need fairy godmothers, magic, and a chance to live happily ever after, in their lives!Not only does Eleanor help Kate, the single mom who is the focus of her mission, as well as helping Kate's kids along the way, but they all eventually end up helping to boost Eleanor's confidence and belief that she can still make someone's dream come true. Together they help Eleanor believe that maybe she still has a chance at keeping fairy godmothers employed, even in modern times.Like nearly all Disney movies, Godmothered has that look and feel of something magical on and off screen. From the sets decorated for the holidays, the snow on the ground, to the big Christmas parade, visually, this movie keeps you in the holiday mood the whole time. Eleanor's Fairy-Godmother dress will remind you of those worn in past Disney movies, and the holiday music mixed with wand waving special effects all add to the fun. You can tell from the on-camera performances of the actors that not only were they having a lot of fun making this movie, but when the cameras stopped, it feels like the fun continued as well. I love how Eleanor keeps as cheery and sugary sweet as you a storybook fantasy character might and it was fun to see her react to people, places, things and events in the real world that she was not accustomed to experiencing in her own world.The message of this film is to never give up. That believing you can achieve your goals and staying determined to make them a reality is the one true way to make them happen. In Godmothered, Eleanor realizes her original plans weren't going to happen as she anticipated, but she found a way to work around them and still create a happily ever after in the end.I give Godmothered 5 out of 5 stars and recommend it for ages 8 to 18. It's hilarious, heartwarming and a magical holiday film for all ages. Godmothered premieres exclusively on Disney+ on December 4, 2020. Don't miss it. REviewed by Lindalee R., KIDS FIRST!"}, {"id": 97, "text": "As practically everyone that's subscribed to Disney+, I am a Disney freak, I've loved it all my life and it's a very fond part of my childhood. Ever since 2013, when the Love Revolution began in the Disney cannon, things have been a little different; no longer are we seeing the message that true love can only exist between a man and a woman, nope, now true love is ONLY found in family. So forget about your Prince Charming characters, throw away the classic Snow White song: Someday My Prince Will Come, and start embracing the fact that everyone outside of your family is trash and will never love you at all. Great message, huh?????The reason why I bring this up is because it's the main theme in the new Disney+ movie, Godmothered starring Isla Fisher and Jillian Bell. The story centers on an overachieving, nerdy, and clumsy fairy godmother in training named Eleanor (played by Bell) who longs to become a fairy godmother BUT in the modern world of today nobody believes in those anymore and there is no need for fairy godmothers. To prove to her superiors that they're wrong and people still need help from magical beings, she travels to Boston in search of a little girl by the name of Mackenzie. But, oops, Mackenzie (played by Fisher), who wrote to the fairy godmother school way back in the day, is no longer a child and is now a 40-something single mom of two girls, who works tirelessly in a local news station and basically has lost all happiness from her life. So, of course, when Eleanor tries to help Mackenzie things go a bit wrong and shenanigans happen and haha it's cute and fun.The way I see this, it's like taking the story of Enchanted, where a classic Disney character finds herself in the middle of the real world and helps bring light back into another character who doesn't believe in fantasy anymore. However, instead of the charming movie that was Enchanted, we get this... And, of course, instead of the tribute to Disney movies we get in Enchanted, we actually get another lesson about why thinking true love between romantic partners does not and cannot exist because WHY. Don't you just love when the studio behind some of the most beloved characters, songs, stories, love stories, tells you that you're wrong for thinking love even exists between romantic partners?I still don't understand this vendetta Disney holds over romantic love. It worked on Frozen (2013) because it was fresh back then, it was a little too forced in Maleficent (2014) where they literally turned one of the most important characters in the story into a side character who comes back in the end like hi, remember me? and let's not even mention what he does in Maleficent: Mistress of Evil (2019)... Somewhere along the lines of this past decade, Disney tried to completely erase romantic love from their cannon completely. When was the last time you watched a movie where romantic love was a theme?Back to Godmothered, I'd say it was cute and quirky but it missed so many marks. Eleanor was cute and lovable, I loved how she starts with this idea about how things should be and then through the movie is able to change her mind about things. Mackenzie... man they could've done so much more with her. There's an on-going theme between her and her eldest daughter where the daughter lacks self-confidence in a certain subject and needs her mom to show that she supports her daughter and believes in her. In the end, the way this develops is so wrong and so lacking, you'd think Mackenzie actually doesn't care about her daughters. And I hate to sound like such a hater but she's so in her own world that she barely even spends time with her family and then in the end they're squished together as if nothing has happened. And what was the comment about the guy running away with a pilates instructor when, in the end, there was no divorce and her husband died?? What was that about??All in all, if you're looking for a cute movie to watch where you don't have to think too much into things, go ahead and give this a watch. But if you want a movie that makes you see things from a different perspective and is compelling, cute, lovable, joyful, charming, and has excellent music, rewatch Enchanted."}, {"id": 98, "text": "I found this movie funny and a breath of fresh air. Cause I'm so sick of having been filled with all the Prince Charming rescue scenarios and the get married and pop out a few kids and live Happily Ever after in some beautiful castle. Then we grow up and realize we were fed a Ton of LIES!! :( It was funny watching the young, inexperienced fairy Godmother trainee, walking around the real world and sounding like a mental patient. And don't talk to that Genie in the phone. Ha hahahaha I would love to have Barry though. And that police sketch was Hilarious!! :D The message was more empowering to a new generation of girls.I didn't find this depressing, made me feel better and I was able to laugh at all the childhood falsehoods we grew up believing and sadly chasing as young adults. And if you go watch an episode of BRIDEZILLAS , you'll see that there are still plenty of deluded adult women trying to make these bogus fairy-tales real spending a fortune (that most of them can't even afford) for 1 day and driving everyone else around them completely nuts in the process. :o Save all that money and put a down payment on a house instead of wracking up tons of debt for 1 party. You'll probably have a better marriage if your not fighting about money for the rest of your marriage. ;D"}, {"id": 99, "text": "The movie is good! While it isn't very bold in its premise or storytelling (I do feel like I was watching a rehash of Enchanted/Elf), I still thoroughly enjoyed it. I chuckled at some moments! I also like how the Christmas aspect isn't played up, so that the focus is on the movie's more-original elements.Some random complaints: The acting feels forced in some scenes. On that note, some scenes are cut in a way that make it seem as if the actors aren't even in the same room, and you can sense that in the delivery of some lines. For those who have seen the movie, you may know what I'm referring to.The greenscreen and CGI effects stick out a bit *too* much for my liking. I know this isn't a big-budget blockbuster film, but just something that I noticed.Overall, it's a decent movie to watch over the weekend if you have nothing to do."}, {"id": 100, "text": "Fairy godmothers live in the world of Motherland. Eleanor Fay Bloomingbottom (Jillian Bell) is a new recruit and it's been a long time since any godmother has gone on a mission. She decides to steal an assignment. Instead of a 10 year old girl, she finds struggling middle-aged single mother Mackenzie Walsh (Isla Fisher).This movie needs to steer into the premise much harder. She's a fairy trying to remake fairy tales in Mackenzie's life. Do it more. She needs to keep stealing one shoe and giving it to random guys. Hugh is too milk toast. He needs to be more, more idiotic, or more charismatic, or more gay, or more anything. He's too bland. Eleanor should have put Mackenzie in a tower and Rapunzel her hair. That would lead to her going to the salon and doing the makeover. I'm great with her doing her own makeover but it needs to go over the top. It would have been funny if she's struggling to carry her hair around town. The family could live in a small house and Eleanor turns it into a mansion with Mackenzie becoming Cinderella. (BTW how do they afford such a big house in Boston?) Speaking of Cinderella, there is the constant carriage attempts. I really like this comedic bit and even the watermelon bit. It would be funnier if she still fails at the end. I like that when they get in, it doesn't go. That's why they should stuff themselves into an Uber. The point of the movie is that Eleanor keeps trying to magically change Mackenzie's life into a fairy tale. The only time that she succeeds is when she tries something real with her heart like street-performing with Jane. Quite frankly, Jane is the emotional nugget of this movie and the movie needs to also steer more into her story. For one, it needs to show her failed performances. All in all, this has an interesting premise with some limited laughs. It could have excelled if it fully committed to the premise."}, {"id": 101, "text": "I absolutely loved this ''princess/Disney'' movie because of ONE thing. Because of Jillian Bell. I love that this ''princess'' or ''godmother'' that Jillian was playing was not ''perfect''. Usually, when we see these Disney/princess movies, they all look so skinny and polished. They look like robots and like models. They portray a ''fantasy''. I love the fact that they had Jillian Bell in this because Jillian shows a picture of you and me. I think little kids watching this, can relate. This Disney/princess movie is much more relatable than the others. Shows little kids watching, that you don't have to look like a model, look perfect, be skinny, to be a ''princess''. Being your authentic self is enough and you too can be a ''princess''. For young kids watching this. There are so many messages in this movie. A message of hope, love, and friendship. It is a cute, motivational, and entertaining movie. I think Jillian Bell made this movie even better. I absolutely love that Jilian is in this movie. I have to admit, I had no idea who Jillian Bell was until I saw this movie. I hope from now on that we get to see more from her. She is beautiful and an amazing actress. She comes across so real, and relatable. She truly shines in this movie. I also love that they include a lot of things in this movie. They went with an open mind when creating this movie. We live in 2020 now and I think they wanted to portray that. This wasn't a typical Disney/ ''princess'' movie. Anyhow, this is a cute movie, you should watch it with your friends and family."}, {"id": 102, "text": "Another week, another attempt for streaming to pull you into their subscriptions as we get ready for the holiday season. Tonight, I looked into the latest magical installment to Disney+, which from the trailers looked like another cute addition targeting the young and magical hearted. While certainly not my most excited piece to view, you never know how these adventures can end up when you open your mind to surprise. What were the results of my expedition into the Mother Land? Well please read on to find out , as I try to guide you in my thoughts on the latest movie...Film: Godmothered (2020) Disney+ Director: Sharon Maguire Writers: Kari Granlund (screenplay by), Melissa K. Stack (screenplay by) (as Melissa Stack) Stars: June Squibb, Jillian Bell, Sonia Manzano LIKES:Cute, Family, Friendly Environment Some Fun Comedy at Times Cute Pig Heartwarming/Holiday Time Good Theme/Lessons Acting is Not That BadDISLIKES:Very Predictable The Writing is cheesy The Impasse of Head Fairy is Lacking Comedy is Forced CGI shows budget limitations Very rushed moments means lack of full potential The Political Message Starts To Get A Little ThickSummary:The trailers accurately represent the cuteness of this film, and it's truly the family targeted spectacle for the holiday season. Eleanor's journey into the real world feels a bit like Enchanted, that magical hope leaking into the negativity of reality in hopes of inspiring people to greater things. The broken family and friendships are adorable lessons for younger audiences, with little to scare them as the awkward adventure plays out. Little ones and those who like slapstick are going to enjoy the simple comedy silliness that awaits, primarily Jillian Bell being a big goof as she runs into each situation. Some of these moments are well timed antics or jabs, delivered in all the right moments to get a chuckle or laugh from me, but all in the family themed moment. One of those moments introduced a cute pig who became the mascot of the movie, a new twist to the pet that though not used to the best extent was adorable to interject between lessons. The overall theme of the movie is perfect for the holidays, in both setting and good will, lessons that are perfect for this time of the year. Good themes of self-love, reality vs. fantasy, and a few self-belief moments that are important for the target audience to hopefully learn. And all of this heart pulling stories have decent acting if I'm being honest. Bell, who normally annoys me with her over the top, stupid characters, found a good role that was better balanced than her normal. Eleanor's journey to being a godmother involved a sweet side I have not seen in Jillian before, and I must say it was a perfect piece for her despite the usual sass and drug humor she focuses on. June Squibb was amazing, maximizing her limited role to the fullest as her sass and harsh dialogue acts as an unlikely motivator to get Eleanor to do her job better. She's the funniest aspect for me in the film and though it would have been nice to have her more involved, her character was used just right and did not get old. Isla Fisher, the fiery red head, had her bite toned down, but this works as she gets the mom battered down by life with a heart of gold down perfectly, bringing a nice counter to Eleanor's bubbliness and providing plot points for the story to use later. Even the girls do a nice job of adding some dazzle to the movie without going too far down the obnoxious route that kid characters can cross into.However, the movie definitely has a lot of limitations that potentially arose from the change in movie production. No surprise, it's very predictable, and though expected, the formulaic approach only has cuteness going for it, with a little originality in terms of the twist on fairy godmother. Sadly, the execution of the predictable plot is why it is a little weaker of a movie compared to other familiar films. The writing is notoriously cheesy, feeling like a 90's sitcom as well rehearsed lines, filled with mush and in your face dialogue beats you over the head with the theme of the movie and the agenda it has to serve you. Much of the comedy is forced, and though you may say, It's meant for kids so loosen up, I've seen plenty of movies for the younger audience where comedy was much more ingrained and natural. In this film, it's not the case and with the cheesy writing at times it's a bit too much for those that are past the prime target age of this film. In regards to the story, again good motifs, but the cohesiveness of the plot is where the film drops in quality for me. For one thing, the impasse of these kids movies continues to be diluted to weak levels of suspense that Disney movies were once known to hold. The head fairy's threats are laughable as she does little to impede this Enchanted like quest, not only taking the time limit/pacing of the movie down and taking the thrill out of the film. As such, the whole time limit of the film and the punishments were lame for me and could have been done well. The CGI to bring the wonder has some moments that are on point, but other times it shows how limited budgets are starting to demote the quality of movies in this starting point of streaming directly. The decades old design is better than what I can do, but seeing what Disney has pulled off in the past, not going to lie this was a bit disappointing at times. These visuals try to distract you from another weakness for me which is how rushed the movie feels in my opinion. The movie takes the approach of making scenes be super silly and quick and jump from scene to scene. It's devoid of big character development, lacking in terms of the full heart felt spectacle, and without relevance, many of these scenes lost their full potential for me. As such, perhaps slowing the pace down and adding a little more impasse to help make things feel more meaningful would have worked better for expanding the movie to other audience members. And of course being 2020, it would not be a movie without overdoing the movie's agenda pieces as well. At first the movie does a solid job of leading you towards the conclusions of moving towards happily than happily ever after, again the scenes being somewhat natural and hinting as what it sit come. Then suddenly at the end of the movie, the writer's must have felt they had not hit us over the head and suddenly they pour everything into rubbing it in your face about what they want to teach you. The lessons suddenly become the heart of the dialogue and it soon becomes boring and too much for me, and the rest of the spirit starts to fall down with it. Again, I'm all for progressive movies, but pick the timing and the movie to do it instead of just jamming it in everything.The VERDICT:As far as streaming movies are concerned, Godmothered is not the worst to arrive in the recent weeks. It's cute, perfect for a family feel good movie, especially those with little girls. It's got great messages, a fantastic learning point, and has some dazzle to it that is sure to get a lot of people charged up for the holidays while also helping feed the fire of political change as well. Yet, the movie's execution is where I feel the film really fails, trying to stuff so much into 2 hours and not fleshing out the scenes. So many moments are thrown out there to cram the adventure and they seem a bit shallow (quantity vs. quality) at times, as the movies progress. Cheesy writing, limitations in budget for CGI, not to mention a boring threat means that this movie just lacks the character for full impact. Throw in the end game where these morals are beaten into your face, and well the balance Disney was once known for... is lost to the modern trends of social media ranting and politics in everything. Still, the movie overall does belong to at home and as such, those with young families have a perfect addition to the holiday rush this weekend. Factoring everything in my scores for the film are:Comedy/Fantasy: 7.0 Movie overall: 5.5"}], "reviews_amount": 103}