{"name": "The 2nd", "titleId": "tt11697484", "reviews": [{"id": 0, "text": "Utterly dreadful in every respect. Don't waste your time."}, {"id": 1, "text": "How did Ryan Phillipe end up in this project? The execution of each scene, camera work, dialogue and action sequences are just not coming together. You can tell how a film is going to go in the first 5 minutes. Actually 2 minutes. I stopped watching after 5 minutes even with fast forwarding."}, {"id": 2, "text": "Ryan Phillippe and Casper van Dien need to look elsewhere for work than these terrible movie choices. They're both capable and watchable but need better scripts than this. Why not try tv?! Action should never be dull. The 2nd will never finish 1st!"}, {"id": 3, "text": "Interesting premise for a movie but appalling acting and even worse continuity. It just did not work no matter how hard I wanted it to. Save yourself the pain and suffering."}, {"id": 4, "text": "The conversations, characters' actiins, action / fight scenes are lame, unbelievable, laughable. I was fast forwarding when watching became unbearable which is pretty often. If you don't know how to totally waste your time, that's a great choice."}, {"id": 5, "text": "The trailer for this movie was better than the entire movie. Terrible acting, corny and badly written dialogue, plot holes abound. Predictable story? Check! Goofy kill shots? Check! Swordfighting? Check! I expected more from Ryan Phillippe. The only reason I gave it two stars was because of how enjoyable it was to make fun of it."}, {"id": 6, "text": "My title says it up pretty well, the acting is very poor the dialogues/writing is stupid... What they call action scenes are so obvious and very poorly executed... I am very disappointed in Ryan Philippe , he usually is way better than that, What happened to him to play in such a bad movie ?"}, {"id": 7, "text": "Predictable, bad acting, dumb and so, so unrealistic. SPOILER ALERT: For instance, the gun fight scene in the stairwell, I counted Ryan Phillips shooting his gun 34 times without reloading... Then there is the motorcycle/van/car chase scene: bad guys can't seem to shoot in Ryan riding above the roof, and his son after riding like a daredevil on the motorcycle some how manages to fall/wreck on his own, but the worst and most unbelievable scene is the Ryan Phillip son, who after getting shot in the back/shoulder gets in physical fight an acts as if he was never shot. Terrible direction, terrible continuity, just plan terrible movie. If I could give it a negative 0 I would!!!!"}, {"id": 8, "text": "Wow. I'm so sad. Purchased this movie on the day it came out because I love Ryan Phillipe. This has to be his worst movie ever. The dialogue is that of a first semester film student, at best. The action sequences are slow and drawn out, to a painful point. There is a lot of stopping to say something..... stupid.Best part of the movie? All of the subtitles that say uuugghhh Argh and aggressive grunt. HahahahaSkip it. Watch the Lincoln Lawyer again if you are looking for a Phillipe movie."}, {"id": 9, "text": "Momentum Pictures presents a Lucid Film production in association with Fury Film Franchise it looks like a movies from the 50s. Looks and sounds like a low budget film. This isn't an action film. Didn't do a good job at all in any of it. Scenes weren't thought out well. Bad angles bad lighting bad music bad acting bad story line. I was looking forward to this movie with Ryan he was great and the other two well know actors Casper Van Dien and Richard Bergi also great. I'm so sad this was so bad :(("}, {"id": 10, "text": "The script is so terrible that it could have been written by a 12 year old, and the directing is even worse. Some of the main actors try hard but their lines are just plain cringe worthy. I find it difficult to believe that people get paid to make movies this bad."}, {"id": 11, "text": "What a waste of time. Worst acting by every actor and actress."}, {"id": 12, "text": "Opening lines Man Hello? Man 2 Child, is that you? Man Yes, Father. I'm listening.This exchange accurately sums up the quality of the movie ahead. Ryan and others have such terrible lines it's painful. Throw in a few first time actors playing college students along with some poor action scenes and this one is a bomb from start to finish.Ryan is listed as a producer. Brian Skiba listed as a director, it says he directed 22 films since 2009 but none of them are noteworthy. Add this one to the list."}, {"id": 13, "text": "The 2nd doesn't quite make it as a B movie. Poor casting is mostly to blame, but the script and direction are appalling. Casper Van Dien has a vague star quality about him, but is poorly cast as the baddie. The 'climatic' fight sequence is absolutely laughable. The whole film isn't quite 'so bad it's entertaining', as 'so bad it's actually verging on very bad'. Luckily for our damsel in distress, there happens to be a teenager out to rescue her who can defeat a whole squad of ex-special forces soldiers with a few punches. The funniest part of the film is where he teleports out of a building to save Erin at the last moment. Another couple of things worth mentioning is that the Director of the CIA appears to live in a tiny flat like the cheap, scummy flat I lived in when I was out of work and Ryan Phillippe seems to be about ten years older than Jack Griffo who plays his son. The set up at the end for a sequel is embarrassing. Let's hope there isn't a 'The 3rd'."}, {"id": 14, "text": "Written and played by stunts while the director was asleep.."}, {"id": 15, "text": "The movie is ridiculous on all levels. An excuse for fight scenes, gun violence and blow up things. The plot was thin and tiresome!"}, {"id": 16, "text": "I agree with other reviewers, the acting is bad. Ryan Phillips does a fairly decent job despite what he was given. But the story writing was horrendous and no amount of good acting could make this movie good.Cheesy action scenes, one where they're fighting and the guy stops and to say a cheesy line and leaves by vanishing behind the doorway. He eventually comes back. It's dumb... and really bad writing.Worse is the ending, because there isn't one. Not for the judgement on the 2nd amendment and not for Ryan Phillips' character. In the end we're left with who are these guy that just showed up out of no where?There's 2nd amendment under tones in here. It was as if the writers and producers were confused with issues on gun laws. They're bad but in order to make a good movie we need guns and violence. You could clearly see the conflicting messages in it.Dumb movie, dumb writing, and cringe worthy acting."}, {"id": 17, "text": "In one word Terrible , one of the worst films I have seen , could not watch it right through it is that bad , the acting very bad"}, {"id": 18, "text": "Experienced director Brian Skiba seemed like this was his first directing job. Long dragged out scenes, especially the fights and gun battles - to the point of ridiculousness. Were the fights choreographed by the WWE? The writing by the two newb writers was terrible. Too many cliched, sappy and cheesy lines. A 5th grader could've done better. So one of the bad girls just happens to have two swords in her bag? Ya, ok. Way too many dumb plot and technical issues. The 93 min runtime felt way too long with the unnecessary long dragged out and ridiculous scenes. Was this film even edited? The score was ok for a B-grade film, and the acting was decent for the most part, as was the cinematography. That's about it. A generous 4/10 from me."}, {"id": 19, "text": "After Shooter we've seen that Ryan Phillipe can act the role of a soldier. But it needs proper direction and cinematography.The action sequences looks like someone is playing, and then a few muscle flashes has been edited in afterwards.Acting is bad. Effects are bad. Score is bad. It's just a bad movie (which could have been great)"}, {"id": 20, "text": "Cliches, poor acting , even worse story and plot. Horrible , had high hopes due with Phillipe but this was just sad..."}, {"id": 21, "text": "It plays like the old, badly dubbed Kung fu movies but worse. Storyline is scattered and disjointed. The acting bipolar in the best of scenes. Makeup and lighting were horribly inconsistent. The whole thing feels like SOCKS ON A ROOSTER."}, {"id": 22, "text": "Slow, predictable and poor acting. who ever filmed did a poor job. w9rse then B rating."}, {"id": 23, "text": "Wow this is watered down family action film that feels very average at best. I couldn't help but view the main antagonist referred as the Bad Guy in the credits (Philip Nathanael) as a human version of the terminator. He makes Arnold Schwarzenegger seems like he got the acting range of De Niro by comparison. It is unintentionally humorous. It caters for the teen demographic with it having a side story of 2 teenagers that have feelings for each other but scared to make the first approach.The villains are laughable and are clichéd from the muscle, the brains of the operation, the Russian that has the most ott accent, evil British woman etc... The lead character Vic Davis (Ryan Philippe) is supposed to the commander of a delta force but he doesn't have the physique to make that believable. This is noticeable as he is thrown about as though he is crash dummy/mannequin. It is so funny to see those scenes.May be this is the slightly grown up version of spy kids so don't expect alot from this film."}, {"id": 24, "text": "An hour and thirty minutes of my life that I will not get back. Ryan, you should fire your agent."}, {"id": 25, "text": "The 2nd is a bad movie from start to finish. It's supposed to be about the 2nd amendment and the right to bear arms but this is lost in the dumb dialogue, dumber action and the fact that the motivations of most of the characters make no sense.The head of the CIA decides to kidnap the college going daughter of a supreme court judge in order to make him vote in a certain way. This is because the daughter of the CIA chief was killed by a psychotic gunman in a school shooting and this shouldn't happen again. So he has mercenaries besiege a college on the last day of term. They are led by a man called Driver played by Caper Van Dien and they have no problem killing security guards, or college students or anyone else in their way which makes no sense given their end goal. Their plot is foiled by green beret/delta force captain Vic Davies played by Ryan Phillipe who is at the college to pick up his son. There are gun fights and fist fights and explosions and the action moves to the L.A. port. The bad guys are beaten unrealistically but the CIA chief escapes and Driver ends up killing him because their benefactor wasn't happy and because three can keep a secret if the other two are dead...so does this mean that Driver is going to whack their benefactor as well or maybe himself. Also who is this benefactor mentioned in the 83rd minute of the film. The movie ends with Vic Davies being surrounded by another group of mercenaries and starting to fight them.This is a cheap action film most of which was badly acted. The plot was convoluted and unclear and the story was just plain bad and borrowed from many better movies. The actions of the characters make little sense like the college students repeatedly doing the opposite when they are told to stay somewhere and hide. The bad guys are inept and the reasoning behind everything is unclear. Definitely not recommended...watch something coherent instead."}, {"id": 26, "text": "This movie is awesome if you're looking to see how terrible a movie can be. I just couldn't stop watching. Felt the same way as when I'm on the casino losing money and I know I need to leave but I can't. I wanted to change it so bad I just couldn't. Now I'm wondering if Ryan Phillips had a family member kidnapped and was forced to do this movie."}, {"id": 27, "text": "This movie had such poor dialogue, acting and camera work it made is so hard to follow the plot. Don't waste your time watching it. My wife and I like Ryan Phillpee's movies, it was painful to finish this one.I still wonder what the plot of movie was about, maybe to get his son from school or save a young girl his son was head over heels about. Nevertheless, don't waste your time."}, {"id": 28, "text": "A script written on the back of a cereal packet By far the worst this about this film is the acting Never seen heard dialogue with every line delivered in a monosyllabic drawl"}, {"id": 29, "text": "I have never seen a movie where every scene, every moment, fails this badly before. Now I have. There is simply nothing to recommend it and I question whether this could accurately even be called a movie."}, {"id": 30, "text": "Only three actors in the movie that I recognized (Which is not necessarily a bad thing, but in this case it was) , poorly written and executed dialogue, poor acting on the part of many of the cast. Zero connection between the first event of the movie and what came subsequently."}, {"id": 31, "text": "I understand being on a low budget, but atleast get some cheap but good actors/actresses. Not one actor/actress did a decent job. And they were trying too hard to make the movie sound badass. The storyline had some potential, just bad writing and acting. Disappointed because the trailer actually looked good. I couldn't bring myself to finish the movie."}, {"id": 32, "text": "It's amazing how actors think they can carry an action movie when they can't punch a bean bag. Ryan Phillipe has no business doing fight scenes. Frankly he should know better given how obviously painful it is he's not athletic.The rest of the cast felt like they were from low budget soap operas, the storyline had about an inch of depth and together with the moronic stuff like the kid getting shot then five minutes later you'd never know it happened, overall it was a horrifcally bad movie.This movie might be good for 10-year olds who haven't been exposed to much in life, but for any kind of movie buff or mature adult you're better off doing laundry. At least it'll feel production."}, {"id": 33, "text": "Could easily have been an episode of the main characters series Shooter, he pretty much plays the same role but with much lower production value in this."}, {"id": 34, "text": "I tried to watch this one but I could not finish it. After 50 minutes I turned off and went for my series instead. Horrible acting, Fx's and action. Remembered me Power Rangers series. How can be this scored with a 6.4????..."}, {"id": 35, "text": "The moment a film has a Casper in it - it will SUCK!!! Poor Ryan got involved with this film too - and this has now added to his already flunking acting career!The entire movie flunked - like stale and hard smelly cheese.Avoid at all costs! Horrid! Boo!!!0 out for 10 for this revolting waste of time and money!"}, {"id": 36, "text": "In a nutshell:Fire the writers, the director and the actors. They were all awful.Give the guy who edited the trailer an Oscar. He was amazing."}, {"id": 37, "text": "It was a good idea, and I love the premise of the movie but good god the acting ruined it. In the first scene you can tell it will not be good. Watching again with the goal of laughing at the acting is somewhat fun but other than that...."}, {"id": 38, "text": "From the first scene in the movie, I could tell where this was going. Poorly produced, wooden acting. This gives B movies a bad name"}, {"id": 39, "text": "I probably spent more on this movie rental then they used as their budget to make it. Dreadful acting, poor action and continuity and unrealistic scenes How can a trained operative be beaten up by a 16 year old student.!!! A van with a dead driver still manages to travel for what seems like 1/2 mile and not stop or come of the road.!!!!"}, {"id": 40, "text": "This movie is so hard to watch. Ryan must have fallen upon hard times if this is the only movie he could get. I want to watch Cruel Intentions to help redeem him. The worst part of this movie isn't the lack of realism, or horrible dialogue and acting. It's the endless amount of bullets he seems to have without ever changing a magazine. It's worse than the opening scene of fast and the furious with the endless gear changes."}, {"id": 41, "text": ".....this time i have to. Because this is by far the worst movie i've seen in ages. The Plot is a typical Action-1 vs all-vehicle. The acting and the dialogues are that bad, that this trainwreck doesn't even get a b-movie-sticker from me. The action scenes and effects are even worse, i couldn't even laugh about it. For me it is a mystery how such a mess can be produced. I guess the producers, the director, the writer (was there a script?) and the actore said the following sentence before they stated: Let's make this the worst s**tshow ever, then they laughed, saluted with a drink, and started filming."}, {"id": 42, "text": "The script is terrible. The fight scenes are choppy and vague and the plot is far fetched. Gun control advocates use guns so that there aren't anymore guns? Also, the guns could have been cooler."}, {"id": 43, "text": "Well as with everything in 2020 this was awful! Worst acting and cinematography I've seen in a long time. I'd rather eat glass that suffer through that a second time."}, {"id": 44, "text": "I would just like to tell the both of you thank you for this work of art you call film and that you are ready to take your place at the celebrity car wash with Tony Danza MC hammer Scott Keogh and Mr. Belding from saved by the bell. I in the Academy thank you."}, {"id": 45, "text": "As bad a movie that was ever made. Don't bother. Should have never been released."}, {"id": 46, "text": "Trying to find something good to say about it. 2020, corona, its still a waste of time! Really bad acting, no i cant list the things that are bad, its all bad! :("}, {"id": 47, "text": "I like Ryan Philippe, so was excited to watch a new movie with him in it. Jesus, was that the wrong decision. The acting and action was awful. I mean this was probably the worst movie I've seen in the last 20 years and I'm not exaggerating.I guess everyone needs a paycheck, but Philippe is way better than this."}, {"id": 48, "text": "It's so bad that I finished the whole movie in under 10 minutes. I just couldn't watch it without skipping. The acting are so bad. The fight scenes are, mehhh... Not actually bad. The story is just as bad as the acting. Not even a 5 year old would like this."}, {"id": 49, "text": "The opening scene involves an incidental shootout serving only to explain why dad is late to pick up his son at college. The plot is nonsensical, the Supreme Court justice looks like a thug and the violence serves no purpose except to excite the brainless. Absolute waste of time. By contrast I just got through watching Justified, which has a plot AND character development."}, {"id": 50, "text": "I watched 9:38 of it before I shut it off which was after the ambush/ gun fight and begged Comcast for a refund. Up to that point, the dialogue was cheesy, special effects were ridiculous. Didn't even make it to the hot blonde."}, {"id": 51, "text": "I don't often take the time to review films, that said I gladly make an exception for '2nd' as it is so bad. Where do you start, the quality of the film instantly feels cheap, the initial scene with the suicide bomber just wrong. How does a one armed (the other arm is holding bomb switch) man covered in explosive material drag an incapacitated, shot in the leg, armed federal agent several meters to act as a hostage???? it was a dead man's switch being set on fire would be ensure that you take your finger of the switch...and it goes on and on.The whole thing, from Ryan's son looking more like his slightly younger brother rather than his adult son....come on!!! Veralyn Venezioto and Randy Charach looking like they have both walked off a Red Shoes shoot...Caspers ridiculous fight scene with the security guards....he isn't Blade, I mean who's idea was that cane???? It is without doubt the worst film I have part watched for years.Ryan, please Way of the Gun is a funny, class film and acts as a perfect comparison to low budget done well....."}, {"id": 52, "text": "Warning, Spoilers, Der. (Nothing to really spoil here) More a forewarning.Fuel air explosion suicide vest. Really?These guys have set their weapons to unlimited ammo.Shooter (the series) this is not. (As much as Mark Wahlberg produced it) So not the movie either.He yells, Watch it dickhead, whilst driving. Yet, there's no traffic.Typical, black terrorist guy gets the rol of janitor.What's with the big bang sounds when the lights are turned off?Contingency Delta, what happened to the first three?For a green Beret he's very much out of shape. Sweating like a pig after a two minute fist fight.Unimpressed with 54min to go.Can track a cell phone IP from floor to floor. Magical. Not even FindMy can do that.He's seen action all over the world, Bosnia, Somalia &amp; Kosovo. You do the geography. It's definitely not all over the world.Oh, but the walls are paper thin. (The Gym)Even less impressed with 44min to go.As an aside, casting wise, how the hell is the kid his son?The satellite can hover over a target. Hmm, the Lagrange point seems to be very very low.The bin fight was good.Bad acting bloody traitor guy.75 shots and no reload. WTF!Bad acting traitor guy's dead now.Fuel based explosions, yet no fuel.On a Mac, messaging app takes up 95% of the screen. (Looks more like a DOS app). Oh yeh, BTW, Dad's in on it.Never bring a 4x2 to a knife fight.Of course, in going to save the girl he'd leave half of the motor bike's back tire on the bitumen. (Never know when you might need it)Fortunately the van has AutoPilot.After the van is destroyed, laptop still shows a super accurate 3D GPS image.BTW, still waiting for what this has to do with the 2nd amendment.More endless ammo shooting..............................................................................Fuel air explosion yet no reason for it.DialogueEndPlease, a Rolex? WTF?"}, {"id": 53, "text": "From terrible writing. To terrible acting. To horrific dubbed audio that resembles an old Japanese dubbed with English voices. I watched it because Ryan Phillippe was in it. An actor who used to be great. Now, he comes off as someone who's never acted a day in his life in this pathetic excuse for an action flick. The plot is a joke. The opening makes no sense nor does it have any bearing on the movies storyline. Hello, at one point it was broad daylight ... The bad guy orders the lights in the building to be cut and it's still daylight. Then the next camera shot, it's pitch dark out. But the timelines it shouldn't have been more than 5 minutes."}, {"id": 54, "text": "I can't even write the words required to characterize how sucky this excuse for a film really is... I soon wanted every character to die, as they all deserved it. This movie is one unending cliche, and every actor sucked donkey.You have been warned."}, {"id": 55, "text": "Okay so we are spoiled!! Movie making is an art form. We get jaded because there is so much amazing content we take it all for granted! If you want to see a real POS so you can truly appreciate movie making, watch this thing!! It's an amateur attempt at making as action film that makes Chuck Norris look good!! Don't waste your time unless you are a film student and want to see how bad a movie can be!! 😏"}, {"id": 56, "text": "My husband and I stared and laughing at a lot of the scenes. Horrible acting..background music sucked..some scenes were pretty corny. Music sounded like video game music. The action parts were silly. Don't waste your money. Disappointed"}, {"id": 57, "text": "Only reason we rented this was because Ryan P was in it and we wanted an action movie. Didn't make it through. Acting and script is amateur and pathetic. Warning: Avoid at all cost. Look elsewhere. This will leave you feeling empty and in a state of self loathing because I thought I could choose better."}, {"id": 58, "text": "How is this rated 6.5!? Really? I enjoy Ryan Phillipe in a lot of films but this is completely unacceptable. Had no idea his acting career was at rock bottom as one would have to be to contract being the lead in this hot mess. This is so bad it doesn't even merit the rating of a B movie as it's straight up skid row. After 2minutes, I had seen enough, don't bother it ain't worth the bandwidth it's streaming on."}, {"id": 59, "text": "This movie was so bad from the fight scenes that a green beret/ delta force operative got his a** kicked to the points he was able to beat them but wouldn't kill them in a life or death situation let alone taking the guns for his use. It was so bad I specifically made this account just to make this review so you won't have to waste 1 1/2 hour of your life watching this."}, {"id": 60, "text": "Ridiculous waste of time. Little to no plot. Terrible acting. Nothing thrilling about the movie at all. What was the purpose of this nonsense?? If you can find anything exciting or even mildly interesting in this $25 budget movie, you must be living a really dull life. Like watching paint dry."}, {"id": 61, "text": "Who funded this garbage? Very bad acting - I'm surprised at Ryan Philippe."}, {"id": 62, "text": "Turns out it's way even worse, minus the dancing and singing of course"}, {"id": 63, "text": "Low budget movie. Nothing was good. The movie died after 15 minutes."}, {"id": 64, "text": "*spoilers* So, Ryan Phillipe is the worst Delta force solider ever. He goes to pick up his son (who he secretly trained with deadly skills and is bummed out that he is in College studying acting). It just so happens that the sons classmate is a senators daughter (who likes fencing - that might come up later). The senator (played by a guy who played Roldald McDonald for a few years) is making a big decision about the 2nd amendment and the head of the CIA sends a mix bang of comic book assassins to kidnap the daughter. Theres the sniper with the ad fake English accent, the bodybuilder, the girl with knives, the Mexican, and the russian. All of whom wouldn't pass a psychological assessment to work in the CIA. Cue an under siege style shoot out in a College. With magazine clips that appear endless. Brain damaging strikes to the head and immediately jump up and swing out of the way. The dialogue is weak, the story is full of holes, and the VFX is terrible. Most of the film has the worst sound design I've seen for a while. Every footstep has been added in post and it's horrible. Even the costume design is something out of a 1990 episode of Macgyver. All the bad guys (and girls), there is no continuity for who they are either dressed like a undercover secret agent (flannel shirt, cap, and glasses), or a South central crip. Casper Van Dien is dressed as the best man of a wedding, refuses to get involved until the last minute, and all the bad guys end up drinking large amounts of alcohol prior to any fight (keeping them alert). Overall, it feels like a really poorly funded bargain basement movie from the 90s, which blew their budget on a handful of decent stars. I tip my hat to them for selling this movie to Netflix. They should just about break even with that deal."}, {"id": 65, "text": "Worst Portrayal of a Military Veteran or Active Military. Awful movie with C rated action scenes. The movie just drags on and on with fake action scenes taking us through a maze of hallways which in real life would never happen. You think a highly trained team would never find you in a building? Shameful attempt and it just causes my PTSD to flare up, at least make it realistic. I am so angry right no.... this acting just kills my soul and the fake pretend teen which is like 29 years old in real life is a complete idiot running around trying to be a martyr? So unrealistic. Netflix really made me give up on movies today I am going to go play some online videogames or something."}, {"id": 66, "text": "Wow... just like all of the other reviews, I can 100% agree this movie isn't worth the time of day. Beyond horrible acting.I stopped watching during the first action scene. That too was horribly done. It's just so bad. Don't bother with it. Leave it to Netflix to add such pukish trash. I think the little time I watched this movie actually gave me the flu. I feel sick."}, {"id": 67, "text": "Spoiler alerts (!) Bad guys led by the CIA director try to kidnap the semi-attractive daughter of a Supreme Court Justice in order to get him to strike down the Second Amendment. Or something. Phillipe and Van Dien are the Ted McGinleys of straight-to-streaming movies. Green Berret (c'mon, man) MoH winner Phillipe stumbles upon a mind-numbingly stupid kidnapping plot, and between him, his son's prowess with self-defense, and the justice's daughter's fencing skills, they thwart the nefarious plot. Maybe. And Bill Clinton's watch. Dafuq. Not even getting drunk first can save this."}, {"id": 68, "text": ". . . budget is low, and the acting and directing and everything else is ridiculous, too. It's like this is the first film for everybody involved on both sides of the camera. It's not even bad enough to be funny. It's just bad."}, {"id": 69, "text": "Move over The Room this is somehow worse than the infamously awful movie. The assumed low budget is no excuse for cliché writing, lazy direction, and weirdly racist seeming casting of bad guys. I have seen many posts thinking this is a propaganda piece pushed by either party. The movie seems pro gun and rather republican until the end when the protagonist name drops President Clinton twice as the person who gave them the medal of honor?? My only hope is this movie was purposefully terrible to somehow create political division somehow. Or I could be overthinking a simply bad movie."}, {"id": 70, "text": "Forget any semblance of plot. The acting is so horribly contrived, you can't suspend belief enough to even try and watch! Bot a single decent actor, Phillippe included. There is not a single character for the viewer to care about. The bad guys, particularly the sunglassed Agent Smith vis a vis The Matrix wannabe, squirms around, grimaces and annoyed, like he has fire ants biting him. This STINKER gets 2* only because it was, at the absolute horrible least, SOMETHING to watch!"}, {"id": 71, "text": "I like bad movies, but this is bad and not in a good way. Just in the first few minutes you can see the actors saw an easy paycheck."}, {"id": 72, "text": "This movie is so astonishingly bad. It's filled with 2nd rate actors who obviously can't read, 2nd rate writing at its best, and all wrapped up in what must have been a minuscule budget. It's a recipe for disaster that careens into the farcical. I was honestly embarrassed for everyone.It's that bad.Nothing and no one is believable. Wincing as I watched I asked myself: what happened to Ryan Phillippe? And I just laughed at Casper van Dien attempting the tough guy baddie. It doesn't play as the action scenes are so poorly executed, and Dien's get up is so ridiculous it just made me laugh.Don't waste your time."}, {"id": 73, "text": "Really, he is a Green Beret and Delta Force and when he is shooting at the guy in the stair well is missing by at least two feet to the left from about 15 feet away!!!! Wasn't there any technical adviser on the set?"}, {"id": 74, "text": "I liked this movie when I thought Mark Zuckerberg was getting the life beaten out of him by the Dude from Starship Troopers with a cane, then I figured out it was just Jacob Grodnik )-8"}, {"id": 75, "text": "Ryan Phillippe Has fallen so far. What happened? Did he accidentally murder Spielberg's dog? You know any movie with Casper van deten is gonna suck, and everything about this movie sucked. The plot was stupid, the acting was bad, the effects were not very special. This movie made me sad to see how far some once good actors have fallen."}, {"id": 76, "text": "I strongly believe the people who are giving this movie good ratings are friends and family members of the production crew. Absolute garbage."}, {"id": 77, "text": "This is definitely a low budget film. I saw the rating and still wanted to power through and watch. But in watching, I realized that those that were in the movie, obviously must have rated it. The movie has horrible acting. Some sound as if they are reading cue cards (the Mother). The fight scenes are very badly choreographed, the blood looks worst than WWE, and the explosions happen prior to the crashes. The bad guys pop up from everywhere in the open. And trained killers are getting beat up by a heavily bearded college kid. I too fell for the Ryan Phillips hype, but oh, this was hard watch. Abandon hope for a great ending, and pray that there is never a sequel."}, {"id": 78, "text": "Don't know about you, but I can survive bad acting (Dolph Lundgram level bad). I can survive infinite ammo. Terrible special effects (kids, you're supposed to black out the glowing pyro from bullet holes in post!). That's all survivable, the movie still could be entertaining with all of the above. Hey, I can even live with totally predictable plot!What's not survivable is utter stupidity of every single character in the movie. The smartest (by far) person in the whole script has an IQ of gerbil, and I'm sure I've just insulted the entire gerbilhood.You do you, but I quit watching that thing after maybe 40 minutes. It's just unbearably stupid."}, {"id": 79, "text": "I rented this from Red Box for 99 cents. 10 minutes in, I wanted my 99 cents back. Forced myself to watch 10 more minutes, then stopped. I just couldn't anymore. This was as bad as Deep Blue Sea 2. Do not waste your time. Some good actors in this as well."}, {"id": 80, "text": "It's all about perspective here. You can sit through the unconvincing story &amp; dialogue hating every minute of it, wondering why Netflix movies always seem to miss the mark. OR, you can view it through a comedic lens &amp; it makes a pretty good parody. After 30 mins or so, I decided on the latter and it's not nearly has hard to watch."}, {"id": 81, "text": "I could only last for the first 4 minutes. Production, sound, script and acting were total garbage. The movie must have been made on a $200,000 budget. Pitiful."}, {"id": 82, "text": "So The 2nd...a 93 minute waste of your time.First, the technical coordinators for this film should go back to fast food, because film is not their forte. RPGs that just catch a car on fire and make a guy 10 ft away do a tidy little front flip...please. After that, comes the suicide vest...that has a devastating range of 6 feet...and only pees fire in a circle around you. Lastly, and in homage to action movies of the 80s and 90s...NO NEED TO RELOAD...EVER! It may sound like nitpicking, but for someone who has military experience and has seen this stuff first hand...they should at least make an effort to make it somewhat realistic.The screenplay plays out like something out of an angry ten-year old's imagination. Lots of blasting and running from the bad guys without much of a story. I can only imagine what the script actually looked like...The acting would be on par...if it had been done on purpose. But the dialog and individual acting is cringe-worthy at best. I expected a lot more out of Ryan Philippe. It's no gem, but The Shooter was a decent series in which he acted the part...believably.Lighting and sound are way off the mark. It really does sound like they just used a single drop mic in the middle of each scene in which everyone has to speak. The lighting is just annoying, and gave me a headache.Overall, I wouldn't recommend this to anyone, unless you're trying to punish them for something."}, {"id": 83, "text": "I would have rather eaten a rotten tomato than have seen this movie. Bad acting and bad effects through out. Just horrible."}, {"id": 84, "text": "Search for reviews of Rogue, they apply identically here."}, {"id": 85, "text": "I was doing other stuff while this was playing and I STILL feel as though I wasted an hour and a half of my life! I only gave it 2 stars because it least I got a laugh or two out of it! And where the ferg did the swords come from? So sorry for all the folks involved in this mess. I just don't get it!"}, {"id": 86, "text": "What a waste of time and money can't even continue watching, poor acting bad script just bad movie."}, {"id": 87, "text": "This movie is a MUST WATCH!! You'll probably never see another movie this bad. I honestly don't even know how this happens... how does a movie make it out of editing this bad? Poor Ryan."}, {"id": 88, "text": "This movie is so inept at all levels and at every corner - it is a surprise. Actors were claerly uneasy with the cheesy dialog. Logic was apparently on vacation when the script was written, discussed, red, and used to shoot the film. It is like a student production at a high school."}, {"id": 89, "text": "I actually liked Ryan Phillippe in shooter, But this is just rubbish. The action scenes are terrible and the dialogue is shocking. I can only assume that Ryan lost a bet and had no choice but to be in this nonsense. Avoid like the plague."}, {"id": 90, "text": "Nothing believable or even well-executed in this film. Not just a waste of money to pay to see it but a complete waste of time too."}, {"id": 91, "text": "I mean terrible does not describe this mess but guilty pleasure none the less highly not recommended unless its a freebie - Oh also a GOP republican right wing gun ho B S something that could never happen in real life Acting was just terrible especially by the extras"}, {"id": 92, "text": "Absolutely dreadful, unrealistic tripe! Couldn't finish watching. Get out now whilst you can!"}, {"id": 93, "text": "Yes, it's a poor film. No, I would not recommend it to anyone."}, {"id": 94, "text": "Medium budget. story so so. acting and directing so so. action ok but bullet count of one gun fight was ridiculous. Casper not too bad, but i wish one day he get a much better role in a well directed movie ..."}, {"id": 95, "text": "How can a movie be this bad lol it's actually entertaining how very bad it is"}, {"id": 96, "text": "This is a common question and theme of the reviews, but everyone is missing the reason. It's because this is complete anti-gun propaganda. It's not written, directed, or acted well because a good story wasn't the purpose for this film. Ironically, it makes a stronger point for the 2nd amendment than against it as the criminals will have illegal guns even if guns are outlawed and then you will not be able to protect yourself. Unless they are all as stupid as the ones in the film of course."}, {"id": 97, "text": "I gave this 2 star film 4 because it was so close to being really good. A few cast changes, film edits, firearm consulting, and a lot of script changes would have got it done. Low budget films dont have to lack in script and realism. I would consider this film in the Not so bad category. Or a rating of slightly smoldering dumpster fire."}, {"id": 98, "text": "Richard Ayoade wrote a book about View from the top 'starring' Gwyneth Paltrow - a sustained sarcastic diatribe about that truly awful movie using the motif of formal film review. The 2nd fits well with this genre. Impossible to imagine how anyone could think that such a badly conceived storyline and wooden acting appalling editing, shooting, and anything else that adds to the absence of credibility merited production. Amazon tells me that it is Number 2 in its ranking. God help us all, we are sliding down that slippery slope to where those with standards cannot be heard."}, {"id": 99, "text": "Wow. Oops, sorry. WOW, as in that's how freaking bad this is. 'The 2nd' makes movies like Lavalantula Oscar contenders. And then Netflix tries to pump it up like it's Gerard Butler saving D.C. again. It's more like the RotoRooter Man couldn't unclog your toilet."}, {"id": 100, "text": "This movie is so painful to watch. Very, very poor acting. They tried but it is so awful!"}, {"id": 101, "text": "Just a waste of time!!! Everything is bad, from the acting to the plot! Theres nothing good about it! just don't waste your time. Period!!!!! Sucks badly! 👎🏼👎🏼👎🏼"}, {"id": 102, "text": "There must be more pathetic movies, but this one does not deserve anybody's time."}, {"id": 103, "text": "This movie works well as a comedy. The script, acting and action scenes will get you laughing quick and all the way to the end. The climactic action scene was beyond funny. Every bad guy gets shot exactly perfectly on cue on the first shot by an endless-round machine gun wielded by Major Vic. Not to mention his teenager son who polished off any bad guy in the way by hand. Where do they train these bad guys?!? Walmart training academy?!? Hahahaha"}, {"id": 104, "text": "Title says it all. What is Ryan Phillippe thinking?! Complete waste of anyone's time watching this."}, {"id": 105, "text": "This film takes bad acting, bad script, bad fight scenes, bad casting, bad sound effects TO A NEW LEVEL. Just what is the point in making such a movie that is a waste of everyone's time."}, {"id": 106, "text": "I like Ryan Phillippe, he was not bad in Shooter TV series so I thought I would give this a look, bad move. Firstly we have seen it all before and seen it done much better. The script is juvenile and the whole movie seems like an excuse to film fight scenes but not good fight scenes.Everything about this movie is bottom drawer. The plot was nonsense and so the rest of it made little sense.except that is the oppertunity to blast people and cause explosions of one king or another, I do hope Phillippe is more diserning in future projects."}, {"id": 107, "text": "While some acting was fair in places, none did a consistently good job. The directing was awful. Even the timing on sound effects was off several times -- shot, pause, reaction.Lame premise! Supreme Court does not make law; it is supposed to uphold the law.Ironic that the chief bad guy who runs an agency which uses guns and violence, uses guns and violence to end American citizens' ability to use guns for self-protection. If only his daughter had had that protection. Groan! Dumb, dumb, dumb! Poorly thought out motivation and all around waste.Seems like every movie including Casper Van Dien ends up horrible. His poor acting skills at least worked in the over-the-top Starship Troopers."}, {"id": 108, "text": "This movie is so low budget it's embarrassingly bad. I couldn't make it past 20 minutes. Awful. This would receive a D- in someone's 1st year of film school."}, {"id": 109, "text": "Nothing is good about this movie.Horrible!!The producer should fire himself!!!The actors forgot to act!"}, {"id": 110, "text": "This actually could have been a good movie but obviously it's a b rated type because the acting was awful. Just shows you that even if you have a good actor doesn't mean you'll have a good movie."}, {"id": 111, "text": "The story line was lost when the son decides to go inside the building after his father (Ryan) and goes up the stairwell. It is mid afternoon but before he walks to the 4th floor it is dark and about 8 o'.clock. I was waiting for the line, I'll be bad, to be said. The girl acted as though she had a set of balls instead of the son. The story line had thrown in every cliche scene there is. Never really been a Ryan fan especially a action hero."}, {"id": 112, "text": "I can make an endless list of mistakes. It's incredible nowadays to see a Hollywood movie with this kind of mistakes, poor acting and very bad production. The worst I've seen"}, {"id": 113, "text": "I just wonder who gave this film a score of 10 and why."}, {"id": 114, "text": "This is really a horribly, terrible movie. Guns that shoot endless ammo, no one reloaded the entire movie, and fired probably two thousand rounds, there were holes in a wall that magically disappeared. Any movie with Casper van Dien is lower than a class C movie. Don't waste you time.Bad acting don't begin to describe this movie, a bad script, to many clichés, it's like they can't come up with anything new, even killing the black actors while most of the white actors only get knocked out.This movie is another prime example why some people should never be allowed to operate a camera. Tyan Philippe wasted his money in producing this bag of BULL POOP-POOP! As for containing spoilers, this whole movie is its own spoiler."}, {"id": 115, "text": "Stiff acting, poor dialog, guns that never run out of bullets, horrible fight scenes at 120% film speed. There is literally nothing good I can find to day about this movie."}, {"id": 116, "text": "No effort put into this movie. Skip it...or wait 'til it is free. DO NOT pay for it. I called Comcast and they refunded my $ because they saw I only watched 30 minutes of it."}, {"id": 117, "text": "This is by far one of the worst action movies I've ever seen I really regret paying $5.99 to watch this movie. With Ryan Phillippe in this movie I assumed this would be a fairly high production value movie like his other action movies. Boy was I wrong."}, {"id": 118, "text": "This is such a bad movie! The acting is terrible! Screams low budgets"}, {"id": 119, "text": "Wooow, never seen a movie with a low detail care, as an example the car that explodes is an old Mercedes , but the teal car is a Cadillac ..... many details that were not cared. The fights doesent look real , and I just wasted time"}, {"id": 120, "text": "The acting is not great, the effects are not great either. Some bullets are instant hits as should be, but some take a second or two to hit, as if they're lazy bullets. Fight scenes are not at all natural... I stopped properly watching very soon into it, but kept it on in the background as I did some cleaning lol."}, {"id": 121, "text": "Terrible script. Terrible acting. Terrible everything. You'd enjoy licking a 9V battery more."}, {"id": 122, "text": "Been using IMDB for many years and I felt I had to write my first ever review after watching this film. Oh dear! I don't know what the budget was on this film but I'm guessing it was paid with Monopoly money. The acting is really, really bad. The fight scenes are so choreographed, they seem to be taking it in turns to hit each other. The blood looks likes it's strawberry juice (pretty sure the local shops sell more realistic blood at Halloween).I'm sitting here wondering what was the point of that? Kinda wishing I hadn't watched it now because I actually like Ryan Phillippe.I would recommend watching it if you really, really have to"}, {"id": 123, "text": "Not much good to say about this B grade movie.Have not seen special effects of such a low standard for a long time, almost seems as movie was made in the 80's."}, {"id": 124, "text": "Nothing makes sense, including the title of the film and Ryan Phillipe being some kind of special forces bad ass. All the worst clichés are here. The give your life for the cause, multi national henchmen, the jump from the roof onto a moving van, the dumb story about a watch, and the dramatic monologue from the bad guys instead of just doing murdering they were hired to do. What was the point of the botched kidnapping? How is there ice in the bucket at the home bar as soon as you get home? Why turn your back after just hitting a guy? The editing, dialogue, the directing, the acting is among the worst I have ever seen. I like a good bad movie, but this is well beyond any sliver of redeeming factors. Horrible, horrible, horrible."}, {"id": 125, "text": "A very wonderful storyline with the worst edit and directing....... Someone should remind me how Cardilac turns to mercedes upon blasting.... How a man in a building happens to be in the opposite building to attack a snipper...... Worst movie i have ever seen..... This movie just concludes how worst 2020 could be"}, {"id": 126, "text": "Everything is appalling...script, camera, acting, action, make up.... its like some sort of joke!!"}, {"id": 127, "text": "Only managed 5 minutes of this and wished those 5 minutes back. Just about the worst acting I've ever seen and that was coming every character. Do yourself a favour and don't watch this movie, you'll thank me."}, {"id": 128, "text": "I cannot believe anyone rated this with more than one star. This must be the worst movie I have ever seen. Poor acting, thin story, terrible music and miserable clipping. This is definately not worth spending 1,5 hours on. I have never written a review before, but I was actually so shocked over the poor quality in all aspects of this movie, that I had to warn anyone considering watching it."}, {"id": 129, "text": "Rushed, predictable, badly acted, badly directed, badly edited... Really, unless you are a die hard fan of the actors involved then, don't waste your precious time on this film.It seems like a hurried production to rush out a new online film... not good."}, {"id": 130, "text": "Must have had a budget of around $200. Absolutely terrible and unwatchable. Not a single plus point and actually a waste of electricity watching it."}, {"id": 131, "text": "Awful. Boring plot. Wooden acting.This film starts bad and doesn't get any better. I watched it so you don't have to.You're welcome."}, {"id": 132, "text": "Popping a balloon would've been more intense than watching these explosions, not to mention the rest, terrible."}, {"id": 133, "text": "Nothing redeemable here. The script, the acting, directing, stunt sequences, photography... it's all horrible. It's called The 2nd because it's desperately in search of a 2nd star rating."}, {"id": 134, "text": "Ryan how far down the rabbit hole have you fallen with this absolute turkey. I stopped watching after 20 mins it was that bad.I know you need to get paid but this was awful."}, {"id": 135, "text": "I would rather sit through several root canals than watch this movie again. Ryan Phillipe you need to fire your agent. Netflix need to stop pumping out utter drivel films every other day. I miss blockbuster."}, {"id": 136, "text": "Nothing in this movie is credible or interesting. If they would have used even a little humor in the story and characters, it could've been an entertaining B movie to laugh at. But instead it's just a cheap movie with horrible acting, no story, mostly taking place in a basement. Simply painful to watch."}, {"id": 137, "text": "This movie is SO awful! Ryan Phillipe cannot act, not that he ever could and the premise is just ridiculous. All that fire power for a college student, really?"}, {"id": 138, "text": "This is just awful. On all levels one can think of"}, {"id": 139, "text": "Do anyone know if i can sue someone for wasting 93 minutes of my life?The acting, the dialogue and the manuscript is really bad, reminds me of something i could have written in highschool...the room is getting some serious competition on being the worst rated movie."}, {"id": 140, "text": "This movie makes Ed Wood look good. Bad acting and sorry production values. Don't waste your time on this movie."}, {"id": 141, "text": "The premise is interesting enough, but the execution is unbearable. Whoever was in charge of the audio must have been asleep on the job. It seemed like it was dubbed even though it isn't. To be fair, I only suffered though the first 10 minutes, but based on other reviews I sincerly doubt the remaing 80 mins are any better."}, {"id": 142, "text": "Cringeworthy dialogues and stupid storyline full of gaping plot holes and far from reality. Honestly speaking I forgot how many I eye rolled while watching. Writer, screenplay and director were either dreaming or high on drugs together. Give it a miss and don't waste your time on this. The content on Netflix is really getting worse and appalling by the day. And they seem to want more money to add more tripe like this to their library."}, {"id": 143, "text": "It was a cheap, bad foreign satire of a US action movie. The terrible lighting, cheap set pieces and props, and awful firefight scene made it clear the bad acting wasn't gonna save this film. Got through about 9 minutes...best choice I've made all week"}, {"id": 144, "text": "In a world where one can google facts about how the SCOTUS works and is protected I am amazed that the writers have no clue. Most movies one has to suspend their beliefs but with just a little work this movie could have been better. There are some decent actors in this movie. They must have been really hungry to take these roles."}, {"id": 145, "text": "This movie is so bad that I created an account on imdb on my first ever movie rating. Story line sucks... acting sucks, gun fire so fake you can smell it... wasted time"}, {"id": 146, "text": "I'm sorry but this movie is so bad. I like Ryan and thought it would be as good as the shooter series.... But i was wrong."}, {"id": 147, "text": "Honestly the more I watch this movie the worse it gets. I've seen better acting/script in a call of duty video game"}, {"id": 148, "text": "They should use this movie in film school to show what not to do when you're acting or over acting or bad script writing or anything to do with making a movie. Literally the first 3 minutes you cringe at the bad acting and script ."}, {"id": 149, "text": "Too much wrong with this movie to list and I'm sure other reviewers have explained some of the problems. So why does it have even five stars for a rating? Somehow there are 751 10 star reviews out of about 2300 total reviews. Way more than any other category. Always check the review totals before relying on the star rating. The rating scheme can be gamed on movies with fewer ratings."}, {"id": 150, "text": "There's only one way to describe this movie.....TERRIBLE!! I mean, How many rounds did that magazine hold in the Stairwell gunfight scene?!! Like 50! I could go on, bottom line, don't waste your time!"}, {"id": 151, "text": "Is Ryan Phillipe a c lister now? This movie reminded me of late late Cinemax movie without the nudity. Horrible."}, {"id": 152, "text": "I was mostly impressed with how Ryan Phillipe was able to fire 60+ rounds from his semi-auto with a single magazine!!!He took the weapon from a baddie, but didn't take any extra magazines, nor did he pick any up along the way to the 60 round pritracted gun fight where this exceptional Delta Force Team Leader cotinually fired round after round at a wall up a stairwell in 3-4 round volleys.Delta/JSOC?? I think not..."}, {"id": 153, "text": "This was a really poor excuse for a movie. The acting was poor. The script was lacking. The one liners were down right stupid. I like Ryan Phillipe but he needs to pick better movies."}, {"id": 154, "text": "From the opening scene, I could tell this was going to be terrible. The telephone-booth style check point was probably bought on EBay. Acting was horrible. I think the biggest piece of the budget went to empty cardboard boxes and wooden crates."}, {"id": 155, "text": "Nah, actually it is the worse! What a joke. Wasted a lot of money and A WHOLE bunch of fake bullets. Those 'highly' trained people who fought Ryan must have been trained in a nursery school. Don't bother with this."}, {"id": 156, "text": "This movie was a waste of time. Acting was subpar. Nothing else to say."}, {"id": 157, "text": "If it was 94, filmed on film and had Mel Gibson or Wesley Snipes in it, this would have been really fun.The plot is very predictable. No one really seems in danger and every bad guy is as lame as the next one. Ryan Phillips son, looks like he is as old as his dad. During this movie I actually looked in to Ryan Phillips filmography to see when it all went wrong. His Shooter series for Netflix was not that bad either, so come on 😂.The action looks cheap, running through the climax with his rifle and the bad guys shooting like some music video actors. Rico from starship troopers is also here, who never had the biggest role, but don't make him some evil goth bad guy.The over sharpness of the cameras also does not compliment the movie."}, {"id": 158, "text": "Instead of creating one fake identification to allow the driver to pick up the asset from a school with only a handful of people, this movie pulls together a highly trained team of 6 to 7 people (that for some reason resembles a United Colors of Benetton ad - one of whom has an accent that changes from Russian to Polish to who knows to maybe none?) to infiltrate the building (again, with a handful of people in it.) This team has global positioning satellite, telephone tracing and electric utility shutdown capabilities, and come in and kill off 5 people right away for no apparent reason (which creates no alarm anywhere from anyone.)Oh, but lucky us that the one guy in all the world that can defeat them happens to be one of those handful of people (but the highly trained team with super super technology capabilities didn't know this), and everyone has guns with unlimited ammunition and there are bombs available so we can have a lot of loud noise and bright lights.This plan allows the Director of the CIA to go to the Supreme Court Justice's house - not give him a call, no, go to the house - to tell him that he has his daughter and if the Justice doesn't do what the Director wants, something terrible will happen to her. Which leads to that Justice going to where his daughter is, but not until he finishes the draft of the opinion the Director does not want and files it.Usually, I am a fan of setting up early in the movie for the eventual payoff, but using a fencing contest to set up a sword fight - because, yeah, we all have 2 swords in our bags (not fencing foils, but full on swords) does not seem quite right.Boilerplate Die Hard hostage movie tactics fill rest of the movie, not really bringing any fresh breath into the genre, and the acting was called-in at best. Ryan Phillippe, between this and that first episode of Big Sky B.S. you're eating away at the goodwill between Cruel Intentions and Shooter you built up with me. (ok, I'll give you the Will and Grace episode, too, and I'm not sure I'm really mad at Big Sky yet, but tell your manager you need better scripts and directors - absolutely would not seek out anything by these ones.)Rated a 2 to give credit for showing up, putting it out there."}, {"id": 159, "text": "After seeing the show Shooter I was excepting more from this movie good story line but the fighting looked like it was from old batman show, there was shots where you can see one person was ready to be hit before the punch."}, {"id": 160, "text": "The movie is pretty bad it has extremely poor action scenes for a action movie the when people get shot the sound is HORRIBLE it doesn't have much sense that a gun would kill someone with a shot to the arm from being perfect"}, {"id": 161, "text": "I like Ryan Philippe. I think he's got huge potential, I practically liked all his previous movies. Also, the way how he played his character in the TV series Shooter was pretty decent.He must have regretted accepting his role in The 2nd but I can understand him, the script might have looked good on paper. But man, the implementation was so low quality which I blame the director and the DOP for.What was even that cringy end scene in the hospital? OMG.Please Ryan, don't become an actor like Bruce Willis."}, {"id": 162, "text": "I was truly shocked by the acting and script, I've seen these actors in other shows and the scenes came across as believable, this show was like a low budget tv episode, casting was also a big miss."}, {"id": 163, "text": "OMG, what a waste of my time. This movie gets a C rating, if that. Horrible acting, stupid plot and frankly beneath the other movies I have seen Phillippe star in. If this is best, it should be his last."}, {"id": 164, "text": "No secret that terrible movies still get made on the basis of a wafer thin plot but what's strange in the high rating of 6.5 at one point for this film. Good to see Ryan Phillippe back on the screen, but that's about the only good thing over one and a half hour.The film is a ham of many parts of action movies, really bad action sequences and some deplorable acting and dialogues that belongs to the 80's. Avoid best as this film has nothing new to offer"}, {"id": 165, "text": "Holy crap what a drivel. I don't even know where to start.. the unlimited ammo? The professional mercenaries who don't even know how to shoulder a rifle? The terrible acting, direction and script? Skip this crap. It's not worth the media it's on"}, {"id": 166, "text": "This is another political movie by people that don't understand our country. Eventually they will run out of money and quit these idealog virtue craps. They did't put money into the production of this crapfest. The first guy was shot before the gun was fired and honestly I didn't have much patients to watch the rest."}, {"id": 167, "text": "OMG, it's so bad ... it's funny. This movie gives weight to the proposal that you should get the first ten minutes free so that you can bang out without having to pay."}, {"id": 168, "text": "It's better to donate the money instead of made this movie. I don't know what movie crew think about audience's smartness because they change Justice Walton's car before explosion it. it was Cadillac before explosion then its convert to Mercedes after explosion. WoWI DON'T RECOMMEND IT AT ALL."}, {"id": 169, "text": "This movie was bad in so many ways.. lol..But... it did entertain me until the end."}, {"id": 170, "text": "Absolute balderdash. Thee worst movie of 2020. So sad"}, {"id": 171, "text": "It is likely the worst movie with a big star I have EVER seen. Hard to fathom how bad this is. Acting is wooden. Plot has potential until it starts. Action scenes are so stupid they're comical. Towards the end ....are the son and girlfriend (?) really going to take time to make out when ruthless operatives are after them?? Dis they really let the head of the CIA just casually walk away? Who can think up something this hideous. It was a fitting end to 2020......"}, {"id": 172, "text": "Good plot that could be made into hit movie but all actors killed it with their poor acting. Direction is the poorest I've seen so far. Can't believe it's the same actor who nailed it in Shooter series. Guess he got lucky or maybe it's director's fault he couldn't make him act. One way or other. I've wasted my time, don't waste yours 😊"}, {"id": 173, "text": "I suppose some people find these to be entertaining but I find them to be just boring and unwatchable. The few scenes that I stayed for were like violence from a cheap video game. No redeeming qualities and a waste of time."}, {"id": 174, "text": "I actually watch the whole movie. I don't think there is any action movie cliche they didn't use. And not in a good way either. From the first to the last scene it was totally unconvincing, unbelievable and ridiculous. If they had tried to make it a comedy action it might have worked. Now it was only pathetic."}, {"id": 175, "text": "Worst there is... Casting of Casper van Dien speaks for it self. R.Phillips I have seen better..."}, {"id": 176, "text": "An attempt at copying a Bruce Willis movie with the worst actors ever and such a lame story line"}, {"id": 177, "text": "Not much to say, other than this is a joke! You'll have more fun watching bread become toast!"}, {"id": 178, "text": "Ryan Phillipe should have to pay me a monthly stipend for sitting through this time vampire. He must have lost all his money to take a role like this one. Do not waste your time. Learn from my mistakes."}, {"id": 179, "text": "Worst film ive ever watched, the kid (Jack Griffo) at the start calling someone on his phone yet it hasnt even been unlocked and still showing the lock screen. Don't get me started how Ryan Phillippe is on top of a van in a 30mph car chase yet the van isnt even moving on his shots and how the cadillac blows up and somehow turns into a mercedes, must have eaten too far into their $!2,000 film budget. Have no clue who sorts these netflix top 10s out because somehow this was 5th. Half the script was moaning noises, if i wanted to hear moaning for 90 mins id go elsewhere."}, {"id": 180, "text": "I like Ryan from the Shooter and as an actor but this...Delta teamleader and major and everything and gets tossed around by a woman with a knifecarchase with superbad editing going 60kmh and the van can't keep up and run the bike over :)Van drives straight without driver for 30sec and crashes in to another car an the two in the back doesn't fly forward upon the impact but upwards :)))Cadillac in every scene until it gets blown up and turned in to a 15year older mercedes, guess they didn't have the money to blow a caddyAge between father and son just way offSon 16/17 years old and had some combat training at the cabin beats up a bad guy that wheigh 40kg more than him and has a armoured vest all this whilst being shot in the shoulder for the first timeSo So So bad I just want to laugh.. thank god I didn't pay for this movie and watched it just now"}, {"id": 181, "text": "This wasn't a great movie but it wasn't really bad either. I would say it's a B rated movie though. I don't mind B movies though some of them are okay or good and some of them are not. I think Ryan Phillipe did a really good job on his part but both the kids (remember they are college age kids) were terrible both of them but especially the girl. I am a U.S. MARINE and there are female U.S. MARINES so maybe I'm biased or whatever but movies always have the females totally freak out and panic to the extreme and not think at all as did the boy through most of this movie as well and they didn't follow orders and do what they were told.....they just didn't think at all. So I'm 50/50 on this movie but I don't think it was a 1 or 2 at all as far as these ratings and reviews are concerned."}, {"id": 182, "text": "Who allowed this to be published on Netflix? Huge expense no doubt, but terrible acting. All in all it's about 1hr 15 mins too long - thanks to the 10sec advance button, I made it through to the end in around 30 mins."}, {"id": 183, "text": "Ryan's talent is a complete waste in this movie. Did he do it as a favor to someone? I also don't believe the traditionally pretty boy, Casper, as a bad guy.Mostly bad acting throughout.SPOILER ALERT: The ending is complete nonsense and useless."}, {"id": 184, "text": "Bad plot. Bad acting. Terrible camera work. Very predictable story line. Ryan shouldn't have touched this role with a 10 meter pole. Absolute let down in all areas."}, {"id": 185, "text": "Is this supposed to be a comedy? I haven't seen such inept villains since Home Alone. The over acting and poor script don't help either. Seriously, I wouldn't bother."}, {"id": 186, "text": "This is one of the worst movies I have had the misfortune of seeing!! The acting is so terrible and unbelievable. Movie scenes are so predictable. The lamest scene was when his son got shot and continued on like he wasn't shot. The directors literally forgot that he was shot. If you want to waste your time you can see this. It's so bad that even if you forward it you will still cringe."}, {"id": 187, "text": "I hope this is not where our movies are headed Pitiful on so many levels from beginning to end. Weak and unrealistic plot. Horrible music. Fake and illogical action. I would have given it a negative rating if I could have."}, {"id": 188, "text": "The acting was horrendous, the plot was awful, the theme was terrible, the lighting and filming was excruciating, and overall this movie sucked."}, {"id": 189, "text": "Story is ok, but the acting sucks! Don't waste your time..."}, {"id": 190, "text": "It was a beautiful film with only a few flaws. The final scene in the film of the man whose daughter was taken hostage was a Cadillac car How did you not set fire to the Cadillac car? You burned the Mercedes-Benz instead"}, {"id": 191, "text": "The only thing good about this movie was the preview, I want to write more but this movie is really awful and I don't want to waste more time on it."}, {"id": 192, "text": "I feel a 1 star rating is excessive for this absolute yawn fest. Total garbage from start to finish. I literally can't find one positive thing to say about this movie....."}, {"id": 193, "text": "I tried to understand if this was supposed to be a action comedy, but details told me they really tried to make it into real action.But, as someone else wrote, this is perhaps the worst thing I've seen since the 90's! Going back to a 90's action flick that was good back then, but is horrible today, resembles what I experienced during this movie.Ryan Phillipe was good in the first season of Shooter, and I hoped this would be something similar.But this was just the result of a bad script, one-liners, fight choreography, action scenes and direction of actors."}, {"id": 194, "text": "Not often do I make a rating and review part way through a film. It's so painful to watch, terrible directing, acting, special effects. So cheap. The only good thing about it is Ryan Phillipe who is an excellent talent, but even he can't make this tripe look better. I'm genuinely wondering if this film was made as a joke, to see if they can get away with it?"}, {"id": 195, "text": "This is a truly terrible film, not one single actor pulls off a decent performance, the effects are rubber, the script is amdram and the story is all over the place,"}, {"id": 196, "text": "Lots of cliches in this one. Ryan Phillippe should have avoided this one like Ryan Reynolds should have avoided Green Lantern. I feel sorry for the guy being associated with really bad acting from the rest of the cast. Also, how many times do they want us to know....a highly trained group of... It's like they underestimate the audience logic by stating the obvious throughout the movie. The dialogue seems to only serve as something to say. Hollow words without substance combined by terrible acting makes this one for the bin. This should never have been released."}, {"id": 197, "text": "The only thing this film was good for was wasting 90 minutes of my life."}, {"id": 198, "text": "I've got this thing about bad movies: I find them entertaining to watch, for some awkward reason. This one lowered the bar to a new lowest! Just watch it for a laugh! :)"}, {"id": 199, "text": "I secretly enjoy the occasional bad movie every now and then, just for the sake of it. But this one lowered the bar so low that it makes me laugh! Watched it to the end though. Entertaining in that respect."}, {"id": 200, "text": "Absolute stinker of a movie and must have been produced on a shoestring budget."}, {"id": 201, "text": "Watched 5 minutes and gave up. Terrible acting, bad camerawork and awful scenics."}, {"id": 202, "text": "This movie looks like a project done by a high school. Well, that may not be entirely fair as I think they would have done a better job than this crap.The acting is atrocious, the dialogue is horrid and the special effects are even worse. Netflix you can do better than this."}, {"id": 203, "text": "I would have given this zero if I had the option. One of the worst films of all time. The action is appalling. The actors are atrocious. I mean sword fighting on a pier? Absolute shambles!"}, {"id": 204, "text": "Ryan Phillipe must have been really desperate for work doing this movie.... Horrible acting. Cheap Low Budget. Dialogue was just as horrible as the made up fake-sounding accents."}, {"id": 205, "text": "Oddly enough this film makes Shooter, a show also on Netflix with Ryan Phillippe look awesome. Shooter is a good show and when you see this it's a poor version of it. The deaths of the characters are so poorly done it's comical. This is a warning sign that the film is not good. Coupled with the bad acting and lack of interesting story, this is unfortunately a dud,"}, {"id": 206, "text": "I talk a lot I can't stop so take this in-depth review based on that info........ It's bad, it also gets worse as it goes on, that's my review.Such a shame Ryan Philippe!!!!!"}, {"id": 207, "text": "This is an awful movie. The story is okay. Everything else is bad."}, {"id": 208, "text": "This movie is really bad. It's hard to say too much more than that, but I'll try. Brian Skiba (Director) tried to save the movie from bad plot lines and absolutely terrible acting by extending fight sequences to the point where you just say okay, we get it, please stop now. Ryan Phillippe is using some kind of deep voice, trying to sound like Sylvester Stallone or someone like that, and that voice, coming out of a guy who is so short is extremely weird. Casting Jack Griffo in the role as the son was a huge mistake- this guy cannot act at all. Lexi Simonsen gets a pass because she hasn't acted much and probably needed the money. So we have a bunch of highly trained operatives who cannot handle a teenage drama major and a young lady, much less a former Green Beret. Again, the casting is very weak here- the highly trained enemies look like a bunch of meth heads, meat heads, and beauty queens. We see plenty of hand fighting, machine gun fire, bombs, and yes, a sword fight with a teenage girl who is actually talking trash to her adversary. The dialogue is silly- at times I could actually say the next line seconds before an actor would utter it. Anyway, I can't get this part of my life back but I hope to save others. If you must watch it, watch with the sound off and just watch people beat each other up and shoot at each other forever without ever changing clips on their guns. I guess Phillippe got lucky and grabbed a gun with a 200 round clip."}, {"id": 209, "text": "It may not be a feature film, or have the best moments however bare in mind that the film crew have a major impact on how good the movie looks with its camera angles etc. I for one really enjoyed this film, there were some bits which i though 'omg wtf am i watching' but it kept me engaged and I just wanted to keep watching. I enjoyed the plot, I hope they make another one. Ryan Phillippe was brilliant.Considering its not a major cast in terms of Dwayne Johnson or Jason Statham but it is good, so its worth the watch."}, {"id": 210, "text": "I thought I was watching a dubbed film first off but then realised it was crap acting. Would've expected more from Casper but sadly didn't deliver."}, {"id": 211, "text": "I didn't believe the bad reviews and watched this. Starts off reasonably OK - but then gets bad and then even worse. Not even a B movie - seen TV episodes of cop action shows better than this. Incredibly cheesy, corny and cringeworthily embarrassing."}, {"id": 212, "text": "This was the worst movie I've seen in a long time. The plot is stupid and doesn't make any sense at all. The characters are badly portrayed and the villains belongs in a James bond movie from the 80's. Everything about this movie is stupid. Ryan is a good actor but why is he doing this project? His love for guns shined through during his shooter project, but this is just too much. Awkward."}, {"id": 213, "text": "Where do I start from? Bad cast, bad acting and rubbish storyline. Basically...really bad."}, {"id": 214, "text": "About 95 minutes in Vic is shooting at a bad guy and shoots at least 30 shots out of a handgun. That's pretty bad for a new movie."}, {"id": 215, "text": "Do not spend time on this movie - just waste of time watching it"}, {"id": 216, "text": "I kept watching where In places it was so awful it was funny. This is a novelty action film come for the very cheap thrills, poorly coordinated fight scenes and questionable... everything else!"}, {"id": 217, "text": "2020 and this movie is the worst I've ever seen , poor acting ."}, {"id": 218, "text": "Why do I get tempted to watch these films. I know they'll be bad but somehow against all sense I think they might be good but they are always pale imitations of the films they're modelled on."}, {"id": 219, "text": "There is nothing good about this film except that it provided employment for some desperate actors."}, {"id": 220, "text": "Why did Ryan Phillip take this role!? He's a half decent actor and made a pretty good effort at the Shooter series. The script is weak at best and the SFX were on as tight a budget as possible. AVOID! AVOID! AVOID!"}, {"id": 221, "text": "Very very poor acting, really unbelievable. Most of these people should really get another job as acting really isn't their best profession"}, {"id": 222, "text": "Choose the worst review in this listing of reviews and assume it is my feelings exactly."}, {"id": 223, "text": "Would I be right thinking this is a comedy? Quite never ever seen a film that is so bad."}, {"id": 224, "text": "Terrible lines and the story is even worse. Bad actors, don't waste your time!"}, {"id": 225, "text": "This might actually be the worst movie ever. No need to say anything else."}, {"id": 226, "text": "Absolute shocker of a movie ,dont waste 90 mins on this drivel"}, {"id": 227, "text": "Truly one of the worst action movies I've ever seen. Awful dialogue. Wooden delivery. Terrible action sequences. Drunken camerawork."}, {"id": 228, "text": "Why does this movie suck? Could it be the writing? Yes? The acting and the leads phoning it in? Yes. It is irredeemable."}, {"id": 229, "text": "Definitely not the best film for 2020.some bad filming.Hoping for better films in 2021"}, {"id": 230, "text": "It really is amazing that somehow the poor writers that once wrote Steven Segal movies, has somehow survived this long, and is still in business.I get painfull flashback to Delta Force Commando from 1988.This movie hands down, wins worst movie of the year, with lightyears to second place.We are back to the endlessly firing weapons, special operators that cant hit for s**t and carchase scenes devoid of any and all realism.If i could wish anything for Christmas, its for this writer and director to please stop waisting audienses time, and maybe take up needlepoint instead."}, {"id": 231, "text": "36-minutes in and I had to stop. I kept thinking, give it a chance, but there is nothing, absolutely nothing, that even remotely engages you in this film. That's supposed to be a father and college son? Aren't they the same age? This is an elite Delta-force kidnapping team? With diversity requirements? They should've hired a dialogue coach.At least Christian-based films give you likeable characters, this apparent NRA film wants you to chant 2nd Amendment over &amp; over again. If gun owners really believe this kind of cinematic drivel is a wonderful marketing tool, they're crazier than I thought."}, {"id": 232, "text": "Headline says it all. If you feel like taking a 1 hour and 30 minute relaxation for the brain and you like watching an exciting, yet completely cliche-packed action film, and have no trouble accepting a complete lack of realism to the plot and attention to details, this film will fit your needs. I suggest anyone about to watch this film to turn their expectations as low as possible, and only then will they be able to enjoy this film."}, {"id": 233, "text": "Is not the same car that explode, went from a Cadillac to a old mercedes. Ahahah"}, {"id": 234, "text": "Guns have infinite ammo, highly questionable actions by both sides, terrible acting and terrible music or rather therelackof."}, {"id": 235, "text": "This has to be the worst film I have seen in years. I can't remember if I have ever given up on a film mid way through, but I had to turn this off after 2/3 as I just could not watch anymore."}, {"id": 236, "text": "Why did they make this film? Everything about it is below par, the script, the acting! The direction, the cinematography, all bad, bad..There's nothing to add. This film is a stinker, don't watch it. I feel that several Razzle awards will be forthcoming."}, {"id": 237, "text": "The worst film that I've ever seen and that's coming from someone who has seen Independence Day 2!"}, {"id": 238, "text": "What a complete car crash of a movie. Extremely poor script, very poor direction, poor fight scenes, poor characters, stupid bad guy and poor ending. When it finished my wife asked why. It was her turn to choose the flix film."}, {"id": 239, "text": "Quite simply the worst film I've ever seen. It actually looks like an amateur film. Struggling to find any positives."}, {"id": 240, "text": "Incredible bad movie. If I could rate it 0 I would. It's like they did it on purpose."}, {"id": 241, "text": "One of the cheesiest action films to come along in years. Ryan Phillippe, are you that desperate to sign on to act in this drivel and embarrass yourself? The dialog is laughable (Ryan's character is in a building as half a dozen terrorists are searching for this son and him and they saunter down a hall talking about going to their cabin to fish.) The hand guns hold about 30 rounds during the gunfights, and a van careens down the highway for miles as the driver is slumped over, unconscious. I could go on and on, but you get the idea."}, {"id": 242, "text": "When you have seen Ryan in the shooter series and other films and know he can act...one must be amased how badly this film is written..filmed and choreographed. Worst I've seen in 2020 Nice to see Casper though."}, {"id": 243, "text": "This movie is Really bad; acting, fight scenes, character roles = Terrible!!!!"}, {"id": 244, "text": "Was this NRA sponsored BS? I want my 1h33min life back!"}, {"id": 245, "text": "7:55 minutes in and I can't watch a second longer. Like most new movies, it's trash."}, {"id": 246, "text": "Could have been a good movie... it have great actors in it but this production is so bad beyond words! such a disappointment!!!"}, {"id": 247, "text": "I made it through 46 minutes. See if you can go further.I admit to an unfair advantage. I thought it was a series. I can often forgive series not getting anywhere in a hurry. Around 46 minutes in (almost exactly midway) I was wondering when EP1 would conclude. That was when I realized it was a movie, it concluded right there.Two cars in the parking lot. Go wait in the car and lock the doors? Really? You think there are a bunch of baddies running around and you are going to tell your son to wait in what will, well I am not even sure what he was thinking. Was he going to get the girl out and do what with her? He wasn't going back to the car so he must have wanted his son to be the hostage so the baddies can force him to give up the girl. I am getting my son to safety first. Then I will help your kid.I can only assume I missed a horseback or motocross chase, maybe both. My money is on a motocross chase and a nice horseback ride for the future college lovers at the very end. He did promise her after all.Why the daughter of a SCJ? Were all the daughters of Presidents unavailable?"}, {"id": 248, "text": "Bad bad movie it's a joke and waste of time. Nothing positiv to say about this movie. Dont waste your time"}, {"id": 249, "text": "This movie is so bad that I don't think words can describe it.It simply makes no sense. Bad acting, bad effects (blood, people on fire, etc)."}, {"id": 250, "text": "The worst movie I watched. There are enough stakes in the gun, probably hundreds. Hah hah haa."}, {"id": 251, "text": "I have never left a review, only read them. This was one time I didn't check the reviews but just thought a Ryan Phillippe movie and Netflix pushing it a lot meant it would be decent. Boy was I wrong. 70% of the movie didn't make sense or wasn't logical at all. And that is me being kind. It was super irritating to watch. I had to write in this review, to advise anyone to miss this one. Not worth your time."}, {"id": 252, "text": "So sad to see what talented people like Ryan Phillipe end up having to do to pay the bills. Unoriginal plot, banal script, poor continuity and stunts, absurdist casting and appalling acting. Even basics like lighting and focusing have fallen by the wayside to get this tripe to the screen. An object lesson in how not to make a good film."}, {"id": 253, "text": "If u really like cheap movies where the action is as bad as the special effects this is for u ,when actors hire bad agents pick your roles carefully ,look at Nicholas cage he is stuck as a b grade actor"}, {"id": 254, "text": "I an so annoyed with netflix for airing thise pile of excrement"}, {"id": 255, "text": "More cliched than... say a cliche, this is pure tripe and a throwback to when Martial arts films were mass produced. Seagal would be proud. Lacks, well, anything of value but I still watched it right to the last predictable end. Brilliant in its awfulness."}, {"id": 256, "text": "Probably the worst film I've seen in quite a while. This turkey reminds me of the cheap 80's t&amp;a straight to video action films. Since Casper van Diem was in this movie, I should have known better. He probably hasn't been in a decent movie since Starship Troopers. A shame really, since he's not really that bad as an actor. For Ryan Phillipe to be in this...eh...movie, well, that tells us that he's walking down the same path as Casper. Yes, he almost only have one facial expression, but hey!, he did a good job in the tv-series Shooter. Anyways, after 45 minutes me and my wife actually had a fun time finding silly and wrong things in this film. So bad it was actually funny. And hey!!! Who the heck brings swords into a firefight? 😂 Unbelievable!"}, {"id": 257, "text": "And I've seen a lot of adult movies. It is like they grabbed people in off the street and asked them if they fancied giving acting a go."}, {"id": 258, "text": "Sheet sheet sheet, this movie its an absolute sheet"}, {"id": 259, "text": "Poor acting and unbelievable story. Far fetched story with a predictable ending."}, {"id": 260, "text": "What is Ryan Phillipe thinking doing this pile of trash? I thought he was really good in Shooter but this! A poor story, dreadful acting, and effects from Craig's list I'm have no issue with low budget, movies are not about money, if you have a good story well edited and well acted the money is irrelevant, this seems to have none of those Trust me don't waste your time"}, {"id": 261, "text": "This is out of pure altruism. Don't waste your precious time on this absolute incoherent mess. Shaves credibility off all those involved. Awful."}, {"id": 262, "text": "If this is the 2nd then I think we all ought to join together in prayer that there never be a 3rd? Ryan Philippe and Casper van Dien are just terrible as the former tries to stop the latter from kidnapping the daughter of an American Supreme Court justice from her school, so that he can be blackmailed into rendering a favourable judgement on a case close to the heart of the Director of the CIA. There's little point in addressing the plot holes - they are too numerous to mention - but I suppose the alarming timeframe in which Jack Griffo acquires some pretty useful ninja skills is maybe the most notable. There is plenty of action, it really doesn't hang about but the dialogue is awful (if someone shouts Sean one more time!) and there is never any doubt about the ending so after quite a short while it all just glossed over me as I wondered what to have for dinner..."}, {"id": 263, "text": "Not sure what Ryan Phillippe was thinking getting involved in this film. I've worked on indie zero budget productions that were produced better than this film.The acting was generally poor, the special effects were a train wreck. The story line is generally dragged out, almost to say it was just filling time. Time I will never get back.Sorry but this film is a no from me."}, {"id": 264, "text": "Bad in every way. Both the action, acting, dialogue and production was set at a very low bar. Typical American low budget nonsense."}, {"id": 265, "text": "The main actors are obviously talented people in a very bad movie. The second line actors are ..... well, absolutely horrific.The Senator was very badly acted ... but his wife, ha ha ha ha ha! She was sooooooo bad it was hilarious!"}, {"id": 266, "text": "Tire, or Thankskilling had better acting then this. Either they (the actors/actresses) just weren't into the movie at all; the director gave poor acting information, or the director just chose the worst takes. Your time would be better spent doing nothing then watching this movie."}, {"id": 267, "text": "What can I say? Ryan Philippe some how got lost to this terrible and boring movie... the story is really bad and weak in so many different ways that first 30min was enough. I was done with this one. There's no feeling that these actors really would wanna do this action movie. Pls let this be just one mistake in RP's todo list..."}, {"id": 268, "text": "Every cheap action movie cliche'in the book. If I didn't like to watch Ryan Philippe work, it wouldn't have lasted ten minutes."}, {"id": 269, "text": "Who wrote this? How did Ryan think this was a good movie to do? This is so low budget I can't finish watching it. If someone recommends it, don't bother."}, {"id": 270, "text": "So bad. The writing is predictable. The chi used for the weapons fire looks like a bad YouTube video. Strategies are unrealistic. The acting is weak. If I had paid to see this in a theater, I would have walked out."}, {"id": 271, "text": "Okay so it's not an Oscar caliber movie. But I wasn't looking for that. I wanted to see Ryan Phillippe kick some ass and get all sweaty, and that's what I got. The acting wasn't great (except from him) and the story was eh. Honestly not the worst movie I've ever seen, though. And it was fun seeing Jack Griffo in the movie. That's about all I can say."}, {"id": 272, "text": "I'm gonna keep it short. This movie is just plain bad. Pretty sure most youtube channels could make a more interesting movie, with better acting and special effects."}, {"id": 273, "text": "I found the movie terrible and out of taste. The script is as bad as it gets, coupled with very amateurish directing. None of the Hollywood clichés could be reproduced in fair taste,let alone having so many of them in the first place. Storyline would have been better with better writing. There's nothing to salvage about this movie, just a wasted budget that could have financed something to write home about"}, {"id": 274, "text": "Stinker and a clinker. Still a stinker and clinker."}, {"id": 275, "text": "School's out for Christmas break at the university and Ryan Phillipe is picking up his son to go to the cabin. His boy has the hots for a fetching, fencing gal whose daddy is a Supreme Court judge intent on changing the second amendment. The CIA director decides that a kidnapping is in order to persuade the judge not to touch those gun-toting rights. Once we get the gist of what's going on the rest of the movie drops with a thud. The acting is barely passable and at times seemed to be more of a comedy than a drama. Jack Griffo plays the son who's majoring in theater but is more proficient with his fists than he is with his acting skills. I can't handle movies where a half dozen guys with automatic weapons open fire on a car ten feet away but can't seem to hit their target. That pretty much sums up the movie...way off target. The writing was laughable with a hole-filled plot and the usual high body count for a B-grade shoot-em-up. Find something else to do with your time and avoid this disaster."}, {"id": 276, "text": "My theory is most of it was made during or right before the pandemic and it's seems rushed and empty ...Netflix has to be getting close to desperate feeding the content beast. You really don't want to waste your time with this.. it's currently at 4.9 one thing about IMDB is even when I don't understand why some people write the reviews they do the overall rating is usually spot on... unless you are in love with the 80's cheesy action flick genre this one isn't for you..enter at your own risk you have been warned LOL"}, {"id": 277, "text": "Don't pretend to be much of a critic but the story is lame, most of the actors are lame, I had hard time connecting to any character or get engaged by the story that's just not engaging. One of the movies that I wish I could unwatch and get refund of the time."}, {"id": 278, "text": "Amateurishly put together. I wasted some time because of Ryan Phillipe, deeply disappointed."}, {"id": 279, "text": "This was filled with dumb action scenarios and all the black characters got smoked in a flash - so 80s in every way"}, {"id": 280, "text": "It started off Ok. Had a decent build up. Empty School, Pro Kidnappers, Delta Force ce Dad as Rescuer. But once the action started, it all started to go downhill to the point that it couldn't redeem itself. Ryan Phillipe tries hard. But the script is poor and action sequences didn't quite excite you enough. The Girl and the Boy play dumb. Then you also get shots where they are killing the bad guys for fun. Sorry doesn't cut it"}, {"id": 281, "text": "The reason why this is getting this many stars is because its action sequences were actually pretty solid. However, even as I give it three stars, I feel bad. I feel bad because I'm not giving it what it deserves. I fast forwarded through most of it. The acting was horrible. What was the last scene even about? That could have been left out. The last scene makes me want to demote it two stars down back to one."}, {"id": 282, "text": "It was slow and drawn out. It was a propaganda piece pushing false narratives and it made me think I'd be better off allowed to have a gun so I could protect myself. You Keep your second amendment America. The people trying to take it away are the reason to have it."}, {"id": 283, "text": "What can be said? It's a low-budget action flick with an absurd plot. If you want to completely shut your brain off for 90 minutes and watch college kids go toe to toe with trained mercenaries twice their size, shoot at them 50 times with a 6-shot revolver, and their dad who looks like he's just 10 years older than them murk everyone in sight, then it's worth throwing checking out."}, {"id": 284, "text": "Bad script, mostly bad acting, and almost a satire of stunt man moves and grunts near the end. Wooden."}, {"id": 285, "text": "This movie is a piece of Sh** from start to finish. Awful acting, terrible dialogue and very stupid."}, {"id": 286, "text": "I have always liked Ryan Phillippe. He is passionate and yet cool. I guess I was spoiled after watching The Shooter. However, 2ND was disappointing and boring regardless of the action scenes almost the whole time. The plot is weak, the actings are bad, and the fight scenes look fake. I hope Ryan picks a better project next. I still love to watch him on the screen."}, {"id": 287, "text": "Dude...after Way of the Gun (10 stars...easy) and Stop loss (8 stars).....what are you DOING !! This is a horrible movie man...no imagination, no interest, no good. Just a really cheap EVERYTHING."}, {"id": 288, "text": "Pretty okay movie overall but that's probably because of the poorly written script and over-ambition of action with little funding. They need to get more people in dramaturg and continuity, because that gun fight half-way through had like infinite bullets. The acting was alright for the most part. Lexi Simonsen really shined above the rest of the cast though. She had authentic and consistent acting throughout the movie. She clearly knows what she's doing and has worked hard to be where she is. I hope to see her in other movies or tv shows in the future. Wouldn't be surprised if she became a more household name. She's definetly one to keep our eyes on."}, {"id": 289, "text": "Clearly this wasn't a high-budget flick. Casper was in it and they don't find them much cheaper than him.Plus the shooting sequence that started around 57:21, what director would give that a thumbs up? Ryan's never ending bullets was out of control. I stopped counting at 30 shots. Sure, he could've picked up magazines from those he beat up or killed, but that should've been part of the flick.But overall the story line flowed well and the characters that were relatively unknown did a decent job and should be commended.If you like CIA/Special Ops flicks, this isn't 'horrible' and a good springboard back for Ryan who lost his job on the TV show Shooter."}, {"id": 290, "text": "I thought this movie was a great low budget film. I enjoyed the fresh faces and acting of the young college students. I liked the story line and loved seeing Ryan Philippe in an action roll. I laughed, cried and found myself in suspense thought out."}, {"id": 291, "text": "From the moment this movie starts through to the extortionary ending its a roller coaster ride of action.This movie brings all the action of big blockbusters but on a beer budget.To be honest the acting can sometimes be wooden, but the tempo works"}, {"id": 292, "text": "A fun and exciting action movie. Most of the actors did a nice job however Erin's character played by rising actress Lexi Simonsen stole the show with her wit and beauty followed by co-star Sean aka Jack Griffo. Good chemistry"}, {"id": 293, "text": "First of all, it was said that the days of good Hollywood movies with soul are gone. An action spectacle or a self-absorbed drama without story is the best the modern Hollywood has to offer. In the best case scenario - most of the content coming out of there is even worse. Now let's get to the businesses. If you expect politics, forget it. There's no political message. There's a lot of action and a sliver of hyperbolic humor, especially towards the end. Was I entertained? Yes. That's more than 90% of Hollywood production can say these days."}, {"id": 294, "text": "Not a huge budget movie but brilliant non the less"}, {"id": 295, "text": "All the other reviews say it - bad storyline, bad dialogue, laughably inconsistent and unrealistic. The terrible ending (like the last 30s) really caps it off nicely. I feel bad for the actors who will have to hide this on their resume."}, {"id": 296, "text": "I was really hoping it wouldn't be, but wow... it's terrible. Almost humorous how bad it is."}, {"id": 297, "text": "This is one of the worst action films I've seen since the B movies in the 1980's. Fighting is awful, pistols never run out of ammo, acting is very bad, special effects are some of the lowest budget stuff I've seen, again since the 1980's. It's just a waste of time. Ryan must be really hard up for money to have signed on to this film."}, {"id": 298, "text": "...this time I turned off the movie after 7 minutes and I could have turned off earlier. I could go more in detail, but to put it simple... not worth the bucks nor time in all aspects!"}, {"id": 299, "text": "I was hoping for at least some good action. Ryan was elite military? What a joke. The action was bad, the acting is even worse. Just a terrible movie all around."}, {"id": 300, "text": "I've seen worse acting, but the layout of the movie is horrific. I've seen better Van Dam and Seagal movies. My intelligence is insulted."}, {"id": 301, "text": "Jesus, what a ridiculous film. A cartoon movie is more credible than this."}, {"id": 302, "text": "Bad camera low budget b movie Partly bad acting. But for a hungover sunday you could do worse"}, {"id": 303, "text": "Actors were poor at conveying emotion and the script was very bad. Do not recommend watching"}, {"id": 304, "text": "If you want to see bad acting if you want to see overused cliches if you want to see the amazing 50 shot Baretta 92 pistol if you want to see why you always leave your enemies alive so that they can come and kill you if you want to see two people standing next to a boat that they could escape in, but instead go back unarmed into the building... if you want to see two gunfighters go mano a mano for no reason...Nevermind, I know you are going to watch it anyway!"}, {"id": 305, "text": "An absolutely predictable film born of bias. The acting is awful. The character development predictable. The plot awful. The only terrorists in this film are the producers and 5he directors."}, {"id": 306, "text": "This was so terrible I couldn't finish it. About 1/2 through I started making fun of the acting and just mocking the movie overall."}, {"id": 307, "text": "I'll let the other reviews handle the ample bad acting and terrible dialogue in The 2nd, I'm going straight for the premise. Armed terrorists led by the Director of the CIA are kidnapping a SCOTUS' daughter to get him to vote AGAINST the 2nd Amendment?! ARE YOU FN KIDDING ME?! Was an armed mob of catholic nuns trying to legalize abortion just a little too far fetched? How about a bunch of senior citizens try to strong arm the FDA into raising drug prices or do away with social security? GTFOH. This attempt to demonize anti-gun people is not only ridiculously transparent, it's a laughable premise. Obviously if any group were to resort to violence and kidnapping in relation to the 2nd, it would be the armed alt-right militias trying to protect it, not repeal it! Armed terrorists (liberals). Kidnapping. To overturn the 2nd Amendment.... I cannot believe someone let you make this movie. Who paid for it, the NRA? The Koch Bros? Not only are your politics sad, but so is your movie. Why don't you leave the gaslighting to the professionals. Like the president."}, {"id": 308, "text": "This movie is an insult to anyone's intelligence. I mean, who the heck wrote the plot? It's hard to find anything more ridiculous. And on top of this the acting is less than mediocre..."}, {"id": 309, "text": "By far the worst movie I've ever seen!!!! Being from the Special Operations community, I can tell you there's absolutely nothing believable about this movie!!! A complete waste of time and film it was put on!! I think I even killed a few brain cells watching it. I've gotten better acting out of a Segal or Van Damme film!!!! Let's not mention the fact that none of the weaponry have a recoil and the magical bottomless clips!!!!!! Sorry, if I could have given it ZERO stars I would have!!!!!!"}, {"id": 310, "text": "This movie was trending on netflix and i saw it starred ryan and so i watched it. 93 minutes i'll never get back it was horrible writing, the characters had horrible lines and poorly delivered their lines for that matter, the fight scenes were tolerable for maybe the first few but after the first two don't even bother it was pretty much watching paste and copy for every single one. all the scenes were drawn out and the characters reacted in perhaps in the moronic ways possible and supposedly ryan was portraying a green beret!????! i question the googling skills of the writers to create one of the dumbest projections of a someone that is so highly trained. oh god antagonists were horrible they literally could've killed anyone at any time and saved themselves a whole movie yet they just decided to frolic around playing bad guys v. good guys. i also can't comprehend the anatomical possibility for pretty much anyone surviving unless they had an iv on retainer of all amphetamines known to man. pls save yourself the pain and bs of even attempting to survive this movie."}, {"id": 311, "text": "If you thought Christmas Lodge was bad for acting and lack of chemistry (aside from suspending belief that the plot was viable), you're in for a treat with this stinker. This review contains no spoilers. The movie is spoiled enough on its own for that."}, {"id": 312, "text": "I just kept hoping it would get better. Normally I would turn it off, but I really just thought maybe it will get better. The acting is excruciatingly bad, and honestly I think it gets worse throughout. There isn't one good bit of acting in the whole movie. The dialogue is terrible, the facial expressions even seem so exaggerated they are awful. Not getting that hour and a half back for myself, so hopefully I can save someone else some time."}, {"id": 313, "text": "This is a Terrible movie. Just look at the almost 200 customer reviews and almost all of them are 1's and 2's. Yet, this movie has a 5 star rating. Very obviously a large percentage the over 2,000 people that rated this movie are intentionally pumping up the rating for monetary reasons.Just almost impossible to get an accurate star rating on IMBD. You have to read the customer reviews and immediately discount the 10s that are given out to horrible movies like this."}, {"id": 314, "text": "Movie was definitely tolerable, kept me on edge and would watch again. However, many scenes had gunshot fights with the flashes and at one point it went on for about two minutes and i had to turn my phone away due to the constant bright flashes. Be careful if you're prone to seizures etc !"}, {"id": 315, "text": "I was hoping for more from Ryan. If you just want to waste some time with mindless action this is ok. If you want something original, go elsewhere. The acting was average, the plot was often silly. And the writers obviously didn't bother doing even minimal research into actual Secret Service and Supreme Court procedures."}, {"id": 316, "text": "Campy acting. Bad dialogue. Poorly choreographed fights. Lame love story. The best part was the overly dramatic deaths and the Terminator-esque score."}, {"id": 317, "text": "Terrible in every way. The interesting thing about it is Ryan Phillipe is attached to it. How in the world did they get him to buy in? So horrible."}, {"id": 318, "text": "I don't know if the intention was to make a film that was cheesier than any previous B-movie, but mission accomplished. This film is a slow motion car wreak and I do not understand how Ryan Phillippe went from Shooter, to this. Unwatchable."}, {"id": 319, "text": "Save yourself the time, this movie is not good. This is the first movie I've written a review on because of how trash it was. The acting is horrible and CGI is low budget"}, {"id": 320, "text": "This is one of the worst movies I have seen lately. Acting minus 5 Stunts minus 5 Effects ....can't even call that thing effects. Fighting choreography is just horrible. Story is overplayedIn this day and age at least production could be better. The whole movie seems like $10.000 budget"}, {"id": 321, "text": "Wow! Bad acting, bad writing and bad directing. The story just was hard to watch. Such a shame since it was actually a decent plot."}, {"id": 322, "text": "Not a lot to like about this dung fest. Story was corny/generic, the hit squad was a collection of cartoon rejects, the judge's wife looked like she'd been pulled out of the rubber doll reject bin. Disturbingly the son had more stubble than his dad. The sword fight towards the end was a pathetic acoutrement.. It was an all round mess., i actually started laughing when the Russian member of the snatch squad kept reappearing after his numerous beatings. Wait for it to be streamed somewhere then watch it if you have to."}, {"id": 323, "text": "Poor acting, poor dialog, poor special effects and badly choreographed. I like Ryan in almost everything he has done but this is not good just listening with no picture is cringeworthy when you hear the dialog...Just dont."}, {"id": 324, "text": "Amateur acting and very boring...Waste of a watch..."}, {"id": 325, "text": "Great story, terrible terrible acting. I feel bad saying that, I like Ryan Philippe...I feel bad he got stuck with this film. Terrible dialogue and action to go along with the terrible acting."}, {"id": 326, "text": "Very poor everything. Just a really really bad movie."}, {"id": 327, "text": "I have to admit the movie is action packed. But the plot is pretty lame.."}, {"id": 328, "text": "*** CONTAINS SPOILERS *** Some have described this film as a DIE HARD sort of movie, but I saw it more akin to WHITE HOUSE DOWN or OLYMPUS HAS FALLEN. Just replace the U.S. PRESIDENT with a U.S. SUPREME COURT JUSTICE'S DAUGHTER (the target), and replace the SECRET SERVICE AGENT (protector) with a U.S. ARMY GREEN BERET / DELTA FORCE OPERATIVE, played by a *BEAST MODE* Ryan Phillippe. They didn't do the JOHN WICK realism with the gun fights (all firearms in this film have unlimited ammo!), but that can also be said in regard to 99.5% of EVERY action movie that has EVER been made. But the VAST majority (99%) of gunfire and explosions were practical / on-set, not CGI, which is super legit for a low(er) budget indy film. There's good action, good acting and a damsel in distress who is easy on the eyes. I wish that they would have addressed the back-story a bit more; maybe a flashback scene of what happened to the CIA Director's daughter being shot, which was the impetus for the entire arc of the story. And maybe a retro-montage of Phillippe's character, featuring a child-aged version of his son and the wife/mother who got murdered. The ending threw me off a bit; I'm not gonna lie. The whole story wraps up and then all of a sudden, the protagonist is inserted into a dire, life and death, situation. I realize that it leaves it open for a sequel, but it just didn't seem as cogent as it could have been. Maybe a DIRECTOR'S CUT will see the light of day that can address some of these issues? I love Ryan Phillippe and I REALLY want to like this movie more than I actually do. It's worth watching (in my opinion)! Stay conscious my friends."}, {"id": 329, "text": "I really don't get what these other reviews are talking about.. this movie was fantastic. There are clear parallels between what is going on in this movie and today's political landscape. The depiction of the evil Democratic CIA director draws similarities to the scheme of an election these fraudsters thought up.. he acted it perfectly. Maybe some of these basement dwelling commies will watch this movie and realize just how important the 2nd is. Stay blessed.Amen"}, {"id": 330, "text": "This is a B grade action movie. It's not a great movie but it's not that bad either. It has a decent, but simple plot that has been used repeatedly. A politician's daughter, Erin(Lexi Simonsen) is targeted by terrorists to influence a vote. Her friend, who has a crush on her, his father(Ryan Phillippe) is a Delta Force team leader who is there to pick up his son, who is waiting for Erin to get picked up safely. Which leads to some decent action scenes. The acting overall is stiff and sloppy, actors collecting an easy pay check. Lexi Simonsen however gives an excellent performance as Erin. Easily the best, most solid performance of the movie. She plays the role as if it could make her career and I pray that it does because I would love to see her in dozens of movies and shows to come. With her beauty, talent, and passion, I see her going on be a successful name in Hollywood. Gave 3 extra stars for Lexi's performance."}, {"id": 331, "text": "I loved it it was thrilling so captivating i couldn't stop watching for a moment. It was terrific I was on the edge of my seat !! Great movie 10/10."}, {"id": 332, "text": "Not gonna claim it was a masterpiece or anything, but it hits the spot for a good action flick. A plot that's there (better than some other movies I've watched), the action scenes weren't great and the villians were pretty terrible for supposed CIA agents, but the camera shots were quite good. Makes me wanna rewatch that Bourne Tangiers scene at least."}, {"id": 333, "text": "Honestly I don't understand the hate. Anything with Ryan Phillipe and Casper Van Dien is gonna come with a specific level of chessiness. I really liked the movie knowing it wasn't gonna be some amazing movie but just a bit of fun. And that's what I got out of it."}, {"id": 334, "text": "The stunt choreography and special effects were great. I watched this because I'm a huge Ryan Phillippe fan and it was ranked #2 on Netflix. BUT, I feel like they could have cast better actors for Erin and Shawn.The girl who plays Erin could use some more practice being scared and sad. Ryan and the kid who played Shawn need to work on their chemistry. As much as I tried to see a father/son relationship between them, I just didn't see it. I'm totally biased, but Ryan's acting was great and I was impressed with the rest of the cast as well.I love the idea of this movie, but it was very predictable. Overall, decent. Would watch again. Ending leaves room for possible sequel. I'd watch it. Perhaps a sequel without Shawn and Erin....but that's just my opinion."}, {"id": 335, "text": "What is wrong with many of these reviewers? I watched this movie today, expecting the worse from all the previous comments and I was certainly pleasantly surprised! Very good performances from the actors, Casper Van Dien a little underplayed his part, Jack Griffo surprised me and Ryan Phillipe just gets better. Direction was tight and very good action with a great finale."}, {"id": 336, "text": "Had he not thrown a girl down some stairs obviously they wouldnt be hating this bad. The movie wasnt terrible. Only real problem was the kid that was supposed to be his son was annoying and unneeded. If it was just phillipe and the girl they would have better chemistry. Also the kid looked older than ryan so it was kinda weird picturing him as the son and not just some annoying old dude."}, {"id": 337, "text": "This film start with a terrorist calling his team to strike, and the introduction of a senator Bob scene! As turnout this film is about a special forces agent Vic need to team up with his son Shawn to save the daughter Erin of the supreme court judge Walton from the abduction of the Director of CIA Phillips! Entire film full of intense action scene! Such as bloody shooting, martial art fighting, bloody stabbing, and explosion scene! Make the film quite watchable! The martial art fighting scene have things broken, exaggerate by some gas spraying, and explosion scene! The shooting scene portray by sideways at certain point, but overall quite intense! Vic care for Shawn, and Shawn care for Erin! Make the film quite touching to watch! At the end, Vic spare Phillips life! Phillips eventually kill by the driver! Vic fighting with a bunch of criminal who capture his wife at the very end! That's it! A quite entertaining film!"}, {"id": 338, "text": "This movie was great all the 1 star reviews are simply wrong and must not have good taste in movies! I highly recommend, very suspenseful action movie!"}, {"id": 339, "text": "This is undoubtedly one of the fines t,deepest ,best written, and acted movie in the history of filmmaking"}, {"id": 340, "text": "This film has everything that action movies of the nineties were missing. The film has all the action,fight and gun violence + disturbed father-son relations,strong women characters,hero black character,and i have to say great villains. All in all, fun to watch."}, {"id": 341, "text": "A very poor Left Wing attempt to attack those in support of the 2nd Amendment. Lots of action with an unrealistic script plot and poor scene editing. The only thing that would have made it worse is if the antagonists were Left Wing Radicals using guns, kidnapping and murder to further their cause for gun control. Even if the Right Wing psychos were successful, there would be too much collateral damage and evidence to secure their desired results!!! Although we are used to and overlook super human action scenes, both good and bad guys/gals would need to be The Flash to move from one scene location to the other!!! Most notably, when the hero stops the sniper from shooting his son from atop a building across the street from his original location!!!"}, {"id": 342, "text": "Ok here we go again me critiquing the critics... really people? You are literally looking for this film to give you spot on real life what a trained security guard would do? Now that's laughable. Guess what You're watching a B movie, not budgeted for the big screen. It's entertaining at best. I didn't cringe on the acting or the film and it's camera movements boo hoo hoo. I've seen trailers that literally show up bad acting and filming as a warning Lol if you don't get that from this film's trailer then you're just in it for the critique. And it was, an action film... who's literally paying attention to real life comparisons of trained Ex military secret servicemen and skilled hit men and or security. I suggest stop watching B movies altogether if you're thinking this movie is such a cringeworthy film.Overall it delivered on its premises and there was gun play, blood, fight scenes and death and the acting was good And what I generally expect from a B movie. 👍🏾"}, {"id": 343, "text": "A great movie it wasn't but, I still enjoy Ryan Phillipe and Casper Van Dien. It did have a lot of holes in the plot and some of the acting was a bit over the top by others but, it really wasn't that bad. I still enjoyed it but, I'm not one to nitpick."}, {"id": 344, "text": "Best so far, besides romance action should be his role. I loved this movie. He did realy good"}, {"id": 345, "text": "Its a decent movie but I think its budget was like supernaturals first season"}, {"id": 346, "text": "The first minute of the movie has a Trump look-alike talking about the Second Amendment. And how the supreme court wants to repeal it. I just had politics for the last six months of my life, I don't need it in the movies Netflix keep your politics out of your movies you'll thank me later"}, {"id": 347, "text": "I gave it 5 stars because the absurdity made it surreal There is no plot. It is lost in a plothole It is like a parody of action movies. You can't take it seriously. Ryan Philippe is not for one 2nd convincing as a Delta force leader.Come on, a Delta Force leader? The one responsible for the casting either has catarract in the eye or he owed many favours to different people who wanted to see themselves in a movie or he found people willing to star in a movie for free. The Russian who does not look Russian at all and is around 60-65 years old said he ATE someone in a gulag, even though the gulags ended officially in 1960. The mother of the girl is a woman in her 80s The son of Ryan Philippe looks older than him All these elements add a more parody style in the movie. It is actually hillarious The leader of the Delta Force gets beaten up by everyone And the whole movie would not have existed if the guy shoved the girl in the car and shot Ryan and his son (because he was not merciful to begin with) Give it a try, watch it with friends or your partner for a good laugh These movies are essential you know."}, {"id": 348, "text": "All you need to know about this amateur hour is the bad guys are the ones who want to get rid of the 2nd Amendment.... a laughable projection for the NRA disguising itself as a movie and a pretty terrible one at that."}, {"id": 349, "text": "One Good guy just happened to stands between evil and a good cause. Sprinkle some family drama, clumsy action scenes, bad script, but some good actors and you've digested the movie."}, {"id": 350, "text": "Though a nice storyline, the acting was abit poor, fighting scenes were not convincing. Lack of emotions and body language. Terrible directing and continuity especially when the judge had his Cadillac Escalade blown up, only to see a Mercedes-Benz 190 on fire....... Gave a 5 star due to effort and the fact that money was used in the production of the movie."}, {"id": 351, "text": "This is a good action movie, with good actors and good script. Doesn't stand out much except for a couple of scenes (I have never seen I such a dramatic and vivid shoot of a man on fire). Worth a watch if you're in the mood for an action.I can't believe how the first 10 reviews that pop up here have an average below 2. I also can't believe how 700 out of 1400 reviews give it a 10. I can't imagine anyone giving this an honest rating above 8 no matter how positive."}, {"id": 352, "text": "I thought it was pretty good. It is better than I expected, as there is intensity and thrill. I connect with the characters too, so I am pretty pleasantly surprised by this film."}, {"id": 353, "text": "A shadow government lead by the CIA director (Richard Burgi ) is attempting to assassinate a pro-gun candidate. A Supreme Court ruling about the second amendment is underway and this shadow government wants to kidnap the daughter of the justice writing the finding. Casper Van Dien leads a group of bad guys to pick up the daughter (Samaire Armstrong) from college. Sean (Jack Griffo ) who is out of her league crushes on her and waits behind as these are the last two to leave the dorm. Sean's dad (Ryan Phillippe ) comes to pick him up and senses something is wrong. He is a Delta Force leader. Decorated.This is your typical one man against a bunch of bad guys. But he doesn't fight 12 at a time. It is a little more down to earth. Decent film for what it was. Nice to see Eric Roberts not in it. How did they miss him at casting? It is even a better film if you are into Deep Blue State conspiracy theories.Guide: F-word. No sex or nudity."}, {"id": 354, "text": "Ahh man, watched the whole movie in 30 mins or so, the action scenes , acting, direction and production quality is like im watching a VHS movie."}, {"id": 355, "text": "It ticks all the boxes for an action film but it's well worth a look."}, {"id": 356, "text": "Technically there are just too many things wrong with this one unless you are completely mindless. From a security standpoint no-one properly trained in security during the intro would A: Permit a cell phone unless it was in a secure transmission blocking case or bag. B: A bodyguards job is to take the bullet instead of the client. That said if there were bulletproof vests, the client would wear one. C: While in transit blending in is important a vehicle that could outrun, and stand up to impacts is a priority. D: If the client is running for president they get secret service. E: No trained security would be chatting about their day and joking while on task. This is all in the first two minutes of the film. What a joke. Than there is a host of other tactical, and technical errors. What SF operator leaves enemies behind alive? Wow then there is six blocks of C4 going off, and leaving people 100 feet away alive which is virtually impossible. The acting has no emotions appropriate to the scene. The acting is wooden, the characters unbelievable, the direction is almost non existent. The script is a real dog of a script, better put out of its misery. Never mind about the sets, casting, etc., etc. Do yourself a favour, unless you are a fan boy, or girl, give this one a miss."}, {"id": 357, "text": "I created an account on IMDb for the sole purpose of leaving a garbage review for a truly awful movie.I literally cannot convey how bad this movie was. I hate myself for watching it all the way through.The acting was bad - like, they were all playing caricatures of themselves... ohhh look at me! I'm a super bad guy with evil intentions mwahahaaa!! The writing was bad. The special effects were anything but. The decisions that were made by the lead characters were things that no one in their right mind would ever do, think, or say. The plot holes were a mile wide.For the love of god, save your time and watch anything else. Watching the Kardashians wack each other with purses would be a more productive use of your time."}, {"id": 358, "text": "I created an account just to write a review of this terrible movie. Guns in the movie has unlimited ammo and for a green beret Ryan P was shooting at a wall with no aim whatsoever.Cadillac blows up and turns into a Mercedes.Gun fire special effects looked like a cartoon and extremely unrealistic gun battles.Ryan P got tired of holding his machine gun with unlimited ammo to fight B class actor Casper V.Satellite CGI looked cheesy.Car chase scene at 20 MPH was laughable and Ryan P can stick to the roof of a van like he was glued to it.Kid gets shot in the shoulder but fully recovers minutes after.I can go on and on with but it will never end... Please do not waste your time or money on this pathetic so called action movie."}, {"id": 359, "text": "The script was not awfulThe acting of the main characters was OKThe supporting cast were woefulThe budget was SO low that the continuity on the scenes was appalling ... I mean they drive up in a Cadillac but they blow up a. Old Mercedes from the 90s and show us it dramatically for several seconds on screen TWICEThe revolver and 9mm auto pistols with limitless ammunition and no reloads was a jokeFrankly the director on this is to blame for a lot of the problems as he clearly just didn't give a monkeys for the qualityJust don't bother watching it"}, {"id": 360, "text": "I happen to like Ryan Phillippe, even if he is too earnest in his acting. But this film, with the promising premise of a a Supreme Court justice's daughter being used to force a certain 2nd Amendment case outcome, is just terrible...alas.First, most of the acting is very amateurish, with people that should seem menacing acting more cartoonish than anything.And there are the regular foolish actions that get the good guys in trouble. For instance, two young people are told to STAY PUT until further notice. After all, their are killers lurking in the building, prowling the hallway. So what happens? Why, the girl notices the boy is bleeding. It's not particularly bad, but she says, nope, we have to do something right now about this. So do they stay put? Why, OF COURSE NOT! That wouldn't give the bad guys a chance to endanger or entrap them! And so this foolish boy and girl go prancing off down the hallway to get a band-aid (or some such).The fight scenes are not convincing at all.Why go on? I kept skipping ahead, trying to avoid the cringe-worthy parts, but all the parts were cringe-worthy.Again, I hate to see Ryan in this stinker, but, well, what do you do?"}, {"id": 361, "text": "I saw the cast and thought it had potential to be good. Boy was I wrong. Cringy acting, predictable plot, nonsensical scenes, no attention to detail. I was literally laughing to myself at the end of this movie.Maybe I'm a stickler, but when you make a movie and have sloppy scenes where the details dont add up you lose major points. There was a scene where Ryan Phillippe shot about 40 bullets with a hand gun in a stairway and never reloaded. One scene the son is being chased by a van while on his motorcycle. The camera shows the van doing almost 60mph and then it shows him doing only 45 mph on the bike and the van couldnt catch up. Nevermind the dead guy in the driver seat for about 2 minutes staying right on his tail on a twisting road. And there were many more like that. Just completely lazy.I dont blame the actors, I've scene a few in other stuff that was pretty good especially RP. But this was just awful for their resumes."}, {"id": 362, "text": "I only gave it two in case they toss the high and low scores out. Without a doubt one of the top five worst movies I've ever seen, and I've seen thousands..!The only non wooden character was Philippe, the rest must have been reading from cue cards.. Obviously the budget all went to the actors bank accounts and special effects, because none of it went to writing, directing or producing.. The editing was done by someone who doesn't speak English, has never seen a movie before and probably can't control their crack habit.. This is an epic fail in every facet..There are no spoilers because this whole so called movie is spoiled..This is the first review I've ever done.. That's how bad this movie is..In any facet I would be ashamed to have my name attached to this movie it is that bad.. It's so bad in every way possible I can't even offer any intelligent critique.. I'm actually in shock after that experience..If you want a real movie go watch Midnight in Paris.. You won't be sorry.. I only use that because it was the one I watched before this drivel.. I had an inkling when I saw Casper Van Dien attached to this it might be bad, but this is a whole new level of time wasted.. I always sit thru to the end of these movies to find some positive from the experience, but in this case I can positively say don't bother.. All I get is an image of everyone involved in this mess laughing when they see where the check is from.. Clearly this is the bottom of the barrel.."}, {"id": 363, "text": "Earlier this year, Netflix hit pay dirt with 'Extraction,' one of the best pure action movies to come out in 2020. Fast paced, adrenaline pumping chaos, it was a shot in the arm of high body count violence and proved the streaming giant could do homegrown action as well as the big studios.At the opposite end of the spectrum is 'The 2nd.' This one is cheap, bland and worst of all, boring. It's a badly acted rip off of 'Die Hard' that sees Ryan Phillippe playing an elite soldier who gets caught up in a plot to kidnap the daughter of a Judge. It's poorly edited, largely takes place in non-descript corridors and half the cast sound like they're reading their lines for the first time. And it features a scene where a teenager with a gunshot wound manages to take down a mercenary in close quarters combat.Phillippe does his best but this is not a good movie. His relationship with his son is entirely unconvincing and the only other person he has any chemistry with gets killed in the first five minutes. Worst of all, the fight scenes are awful. The climactic warehouse shoot out is passable, but the rest are shockingly subpar. One scene with Phillippe taking on two henchmen at once looks like it was filmed in a large dumpster and another features him magically teleporting across a college campus to take on a sniper. Then there's the van-riding car chase, which manages to make getting shot in the head look painless and seems to be taking place at about 18mph.Not even Casper Van Dien playing against type as his indestructible nemesis can save this unbelievably mediocre film. 'The 2nd' is uninvolving and commits the cardinal sin of action films; it's boring.And that's without getting into the morally dubious side. It's called 'The 2nd' because it revolves around The 2nd Amendment and while it doesn't explicitly state which side of the debate it falls upon, it does hint pretty heavily that the lead-villain has masterminded his scheme because his daughter was killed in a school shooting. And if that was what motivated Hans Gruber, even John McClane would have to admit he kinda had a point.Skip this, watch 'Extraction' again."}, {"id": 364, "text": "I am deeply disappointed. This movie is a perfect example of how to ruin the reputation of otherwise good actors. Sorry guys.Did this movie have a director at all? Did they get paid?The script or lack thereof..I what reality does the hand guns have unlimited amounts of bullets?A highly trained operative discharges his weapon into a wall multiple times? When I did weapons training in the military we were told to save on the ammo and only fire on actual targets, which I have never seen in any TV show or movie - ever.Don't get me started on the fights - in what reality can a single person receive that amount of injuries, and still manage to walk away from it?My best guess is that the writers got their ideas from watching low quality action movies. How anyone can pay good money for this piece of cut and paste script is beyond me.I sincerely hope that the executive producers got at least some of their money back.Sorry - even one star is to much."}, {"id": 365, "text": "Please don't bother with this movie.There is so much ham (acting) you could feed a town lovely sandwiches for a week.Ryan Phillippe has been in some good stuff but as exec producer and lead in this... it just doesn't work.Bad edits throughout... daytime to nighttime happens in seconds... driver wearing a green tee shirt when shot from the back but a black one when shot from the front... loads of bad continuity.Casper Van Dien is responsible for a lot of the ham along with Richard Burgi in his (very) ill fitting suit as the Director of the CIA.Don't waste the 1 hour 33 minutes that this movie takes up. Go and do something interesting instead. Seriously."}, {"id": 366, "text": "What's the worst part of this? Oh so many choices! Acting, casting, writing, directing, production values, sound effects, sound track, stand-ins, dialogue. Too many choices! They're all so bad it hurts.From the over-botoxed steroid-popping 40yo Supreme Court judge and his 60yo boob job whisky chugging wife to the CIA agent in a mandarin collar and vest lol to the carpeted university gym the size of a small accountant's office to the Ritz Carlton hotel room with polyester curtains that don't reach the floor to the dopey college son Shawn who's about 28. Astonishing.But we had a good laugh watching it, excruciating as it was.If you're looking for a movie to rip apart on every conceivable level this is it.Ryan Phillippe deserves better."}, {"id": 367, "text": "I am giving this 2 stars only because I can't give anything Ryan Phillipe is in less than that... but really there is so many awful things in this film that it slides between barely watchable to totally unwatchable most of the way through.Here is what i think happened. Hollywood producers who more often then not are terribly shallow, and unoriginal see that John Wick is a huge success. John Wick's 'formula' in these Hollywood producers's eyes being....* bank-able star, able to pull off action movies * a script that is really 90% about the action, and bad a--ery of the main character * mix in a great 2nd camera/stunt coordinator action director - make him the director to focus on action for 90% of the film. * add in a reason to kill many tough bad-guys - killed his dogThe issue is that the didn't pay Ryan Phillipe to train to be an extreme bad --- for months ahead of time. They clearly don't get that not all stunt coordinates/2nd camera guys are capable of directing. They don't have any idea why John Wick is a good script and this one is completely unoriginal. Ryan Phillpe's can't turn bad dialogue into gold, perhaps if one scene is not great in an otherwise brilliantly written film then a good actor can carry that one scene, or two, but when the entire film is garbage, garbage in and garbage out even with the best actors.Finally the cinematography is like it was shot on an iphone 3. What the heck is with the soap opera effect doubled down.Clearly this is what happens when people with no talent, and no ability to understand the different between good dialogue and terrible dialogue, between good cinematography and one of the worst films for cinematography i have seen in a very long time, and as any good film making knows, your good guy is only as great as his enemy. If the enemy is a wimp it makes the hero seem weak as well. If the antagonist is the most bad --- opponent ever, and the hero beats him up, it is now interesting.Could go on for a long time all the faults in this movie, but clearly i have already wasted to much time on it already. Only watch this movie if you are interested in film studies and are looking at films that are big time failures..."}, {"id": 368, "text": "Firstly reading the negative reviewers here I noticed a lot of repeat language and phrasing. Many at least 75% of the hyper negative reviewers are single use accounts meaning someone has an obsession with negatively reviewing and has created a lot of shill accounts. So let's get to this film. People need to understand it is part of a genre: fight-action film. It is better than average within that genre, which tends to have stretched even outlandish plot, middling quality dialogue, lower end effects, and average at best acting. To whine and cry about that is no different than whining about realism in a marvel comic based film. We ALL suspend disbelief and accept flaws in genres we like. Shakespeare is chock full of anachronisms and unbelievable characters as well. For what people look in that genre, good fighting, ground fighting, etc., this actually above average. If you look around social media on the net there are MMA fighters who rate this film very well and that speaks to the audience this is aimed at. So I suppose people who expected a reprise of Ryan Phillippe's roles in Cruel Intentions or Gosford Park (I enjoyed the later myself) are disappointed. That seems to be the bulk of the bad reviews. Otherwise -- for this genre, a fight vehicle film -- this film is not bad at all, well above average."}, {"id": 369, "text": "DIE HARD was made over 32 years ago and still is one of the best action thrillers ever made. However if you look closely it was a reasonable budget movie; no top stars (Bruce Willis was just starting his movie career) Godunov was famous as a dancer but not as an actor and Rickman was virtually unknown in USA. The secret of the movie was great casting, great writing, outstanding direction and edition. Sadly aside from a decent casting and a couple of interesting ideas, nothing else is present in The 2nd. A DIE HARD wannabe as many others that fails miserably (as many others). Ryan Phillips is good as DELTA FORCE Major Davis trying to save his son and a Supreme Court daughter of a group of killer / kidnappers. He moves very well in his action scenes; but sadly most of the action is so bad filmed and worse edited that his efforts are for nothing. Casper Van Dien does mostly that he always does but he is the bad guy now. He is good but his character's writing does not give him any time to show his charisma and skills. Jack Griffo is surprisingly good as the, not defenseless, Davis 's son. He does a few fights quite good and his comedy skills and sympathy keeps the mood up even when his characters is full of cliches. In terms of action scenes, only some fights are worth. Shooting , car chases and explosions are too cheap made and poorly edited. The few interested ideas are never exploited (young boys romance, political issues, Constitution changing, comedy ); plus an unexpected ending. It is a pity because the movie could have been far far better with a more skilled director."}, {"id": 370, "text": "Sean Davis (Jack Griffo) has a crush on his classmate Erin Walton (Lexi Simonsen). It's the Christmas holidays and everybody is clearing out of the campus. Sean and Erin are the last two students. He is getting picked up by his father Vic Davis (Ryan Phillippe) who is secretly a Delta Force leader. She is the daughter of a Supreme Court Judge and is waiting for her Secret Service driver. Instead, she is met by a replacement driver (Casper Van Dien) who turns out to be a leader of a CIA hit team sent to kidnap her and coerce her father on a 2nd Amendment ruling.The Judge and the CIA chief can be all cut out. I don't know anything about the actor who plays the Judge. He seems to be a producer in his day job. He needs to stick to that because he's a really bad actor. Neither character is truly necessary. The premise is the kidnapping. The minutia of the reasoning is besides the point. As for the other actors, most of them are fine. Phillippe and Van Dien are doing solid work. The girl is a little better than the boy. The crew of bad guys is filled with some less than threatening actors. There are multiple issues with the writing. While I like the general premise, this movie is held back by a countless list of little issues. My best guess about this movie is that they have a halfway decent fight coordinator but not much else. The gun action is functional and the car action is inferior. This thing is a B-movie at best."}], "reviews_amount": 371}