{"name": "Cadaver", "titleId": "tt11284280", "reviews": [{"id": 0, "text": "Acting, cinematography, effects and everything else was pretty good. What absolutely slaughtered this movie was the writing. This movie is so full of plot holes, obviously bad decisions by characters, badly scripted characters and a terribly predictable plot."}, {"id": 1, "text": "Go ahead Alice run along, Alice where are you Alice they tell her to go find the room and when she goes to find the room  they are screaming frantically looking for. Many other scenarios like this in the movie. Horribly written script. Beautiful cinematography and sets. Even some of the acting is OK, the English dubbing was a bit harsh though."}, {"id": 2, "text": "The only good thing was the cool old hotel setting. The plot was predictable, there is no twist to the story. Can guess what's happening from the beginning. The characters are not likeable so who cares if they live or die. The girl Alice needs a smack for wandering off."}, {"id": 3, "text": "It was a cool idea. Not awfully original but cool nonetheless.Do you ever get frustrated watching a movie because the protagonists keep doing irrational and unrealistic things which lead to easily preventable problems? This happens a lot...This couple gets fooled and bamboozled by obvious tricks and ruses at every turn. You'd think a grown man and woman who have survived this long in a post apocalyptic wasteland would have more street smarts.Anyways, turns out the bad guys were eating the people the whole time.This movie is a steaming pile of garbage. Avoid at all costs."}, {"id": 4, "text": "It's impossible to believe that the actors didn't know they were fed the audience's flesh and that they thought the audience were robbed and their money was then used to buy food."}, {"id": 5, "text": "As a fan of post apocalyptic stories this should have been a solid film for me, but when taking in to consideration the overall lackluster delivery i am rather disappointed.A common problem with Norwegian films in my experience and a quite obvious issue with Cadaver, is that the acting was at best average. Apart from Thorbjørn Harr's portrayal of Mathias and Stig Frode Henriksen as Hans the robotically delivered dialogue from the actors gave the impression that they were merely reading the script in stead of actually performing.The story itself is rather solid, but if you have any experience with post apocalyptic films, then you don't have to get far before figuring out what the big secret is. So i wouldn't recommend going in with an expectation of being surprised by any plottwists."}, {"id": 6, "text": "Cadaver: The aftermath of a nuclear disaster in Norway, likely war. Things are bleak food is short, the city looks bombed out, there's a const gloomy fog/mist. A strange man arrives offering people food and entertainment in a local hotel. People are fed and an interactive theatre ensues. That's when reality becomes difficult to separate from the performance. People start to disappear, strange things happen. Some really horrific scenes as what is really going on becomes all too obvious. Not a totally original story but the execution gives it a fresh flavour. Some heavy handed allegories though and the running time could have been pruned. Once again a horror film which might have worked better as an episode of The Twilight Zone. Written and Directed by Jarand Herdal in his feature debut. On Netflix. 6/10."}, {"id": 7, "text": "I think this movie is one you will love or not. This isn't a slasher screaming teen movie - it takes watching and some ability to think a little.The unusual story lends itself to the moody atmosphere of the production, with characters - excellently portrayed by the actors - that really suck you in to their world.Well worth seeing."}, {"id": 8, "text": "Not bad Don't wait to see a horror masterpiece... Such is so hard to find in our days It has an easy going plot, some surprising moment, without making any difference to the over production of only by the name calling horror movies"}, {"id": 9, "text": "What a boring and predictable movie. The main characters are absolute idiots. And beyond the terrible scenario, the actors are just quite bad.Skip this disaster of a movie."}, {"id": 10, "text": "It's a nice timepass, but dont' expect too much. Everything is pretty much predictable. There are a few nice twists and I don't regret watching it, but I expected more. The characters are not very likable and at times even annoying. But I did like the post-apocalyptic scenery and the settings. Overall the plot and the idea behind it was not that bad. Just too predictable."}, {"id": 11, "text": "Im sad beeing Norwegian watching this shait. Dont Waste your time ! Acting is cringeworthy, plot is just predictable and boring."}, {"id": 12, "text": "Cadaver followers a family attending a show at a hotel in a post-apocalyptic world. There is no stage for performances but instead, each actor creates interesting stories enticing audiences to follow them around the hotel. Things change as people begin to go missing and the family find themselves in a horrifying situation in which they must escape. The premise of this movie is really creative and cool but the movie doesn't anything better than alright throughout. As more of the mystery of the theatre is uncovered by the protagonist, the story becomes a whole lot more intriguing with further creative aspects pushing the story beyond the extent it seemed to have to stop the movie from being really great. A very suspenseful horror film with a great story behind it."}, {"id": 13, "text": "Honestly, twenty minutes into the film I had wanted to turn it off.. but I decided to push through as maybe there would be a spark somewhere. I thought that maybe I would be enveloped by the storyline, or that the directing would entice me; I even forgave the characters for such intolerable acting within the first 20 minutes and had monstrous hopes they would prove me different.. how sadly had I been mistaken. Granted, this was a debut so there will be flaws, but flaws does not do this movie justice. The script was so unoriginal and cheesy I could take some crackers, wipe up the excess, and have enough for years to come. The characters were drowning in lack of development, the story was ridden with plot holes and about as barebone as can be. The one decent thing about Cadaver was the set design: the hotel itself had a certain timeless vagueness to it that i would have loved for them to explore further. The antagonist had a single layer of depth, which you do not find out about until towards the end(although, anyone with half a sense can foresee such predictability). And that damn Alice.."}, {"id": 14, "text": "Why does the theatre owner has to do so much to get human bodies as food when they are all freely available on the street? One of the stupidest movie i ever watched . if you watch it, you will waste 1 hr 26 mins in your life like i did"}, {"id": 15, "text": "Terrible, just Terrible dialogue. The consept is interesting, but you find yourself wanting to bash your head through the wall in pure frustration over the stupidity."}, {"id": 16, "text": "The hotel and depiction of the post apocalyptic world drips with great production values, but it stumbles with its story telling.Despite it's short run, the movie drags quite a lot in the first half and ends in an anticlimactic way."}, {"id": 17, "text": "Movie was okay until the scalpel fight in the LARDER room.The woman physically overpowers her captor?? And husband is killed by 1 scalpel stab? Okay.-1 Star for that nonsense...The end was kinda cool but not really enough to turn this sub par movie into an average one.4/10"}, {"id": 18, "text": "As much as Netflix has been pushing this movie,I half expected something entertaining... however that is not the case. Much like its namesake, Cadaver is completely lifeless. The plot of the movie consists of a starving family living in a post apocalyptic world who attend an interactive play with the promise of a meal afterwards. This is a foreign film, so the vocals are portly overdubbed and have horrific vocal expressions. The ending is completely predictable, when you learn the actors are killing the audience to use them for food. This movie is obvious, dull, and totally predictable. You'll likely find yourself reaching for your phone 20 minutes in out of boredom. Another complete miss by Netflix."}, {"id": 19, "text": "This film starts like lots of other movies. Nuclear bomb ruins world, hungry people looking to survive. At least no zombies walking the streets... A former theater actress takes her husband and daughter to a show which is promised to be like nothing they've seen before, with a promise of a hot meal. The guests are told to put on masks to differentiate them from the actors. From then on, it is up to actors to be interesting enough to lure guests aside, so that the clean up people can kill them and turn them to the next guests' dinner. Started out okay but quickly turns into a silly film that is not much of anything - it is not scary enough to be a horror film, not interesting enough to be a psychological thriller, and not gory for those who like that kind of movies. Lots of plot holes, poor acting, predictable ending, and the fact that it is a foreign film does not add bonus points. The grand hotel is a nice location, but that's about it. If it wanted to make a statement on what people are willing to do to live, it''s been done far better in numerous other films. To summarize - a complete no show. There was one scene that reminded me of Coma, the film based on Robin Cook''s book, but I refuse to talk about that classic and this film in the same sentence. The paintings of the lambs (were they supposed to be creepy?) can be an allegory for the guests led to slaughter, and then turned to lamb chops. Or makes you miss the quality of Silence of the Lambs. Whatever. After a long week of work, I just wanted to wind down and kill a few brain cells. Thanks to this movie, that I did. Only watch if you REALLY have nothing better to do."}, {"id": 20, "text": "I found this movie good to watch, no waste of time. I read some negative reviews but i think we need more unique stories like this one. The overall atmosphere is magical, the combination between the two teams (actors and new people) is interesting. A game of brainwashing and who will fight back using the rules that the boss himself imposed."}, {"id": 21, "text": "Kept me on my toes, not overly predictable. Very watchable"}, {"id": 22, "text": "This movie is like Snowpiecer. Set in a post apocalyptic world where people struggle to survive and there are rich people that do bad things.But, Snowpiecer was more elaborate had better world building. This has neither.Highly avoidable."}, {"id": 23, "text": "Boring, predictable and pretentious horror flick with some visual value. Typical netflix product, made to cause mild emotions only. Disposable."}, {"id": 24, "text": "The original concept came from a short film director Herdal made in 2016. After watching the movie it is easy to see that the plot was probably cool for a short film but did not in any way hold up for a feature. The director is also sued by filmmakers from the short film that was supposed to work on the feature. This happens too often but at the end it only reflects bad on the director that has fooled people that believed and worked for free on the original concept.Script: 1 Visual: 4 Acting: 3"}, {"id": 25, "text": "Was this written by a teenager in his bedroom? I mean this is the most basic so-called horror plot you can think of and on top of it the title kinda gives it all away before you even start the movie. That was a whole new level of bad! Nonsensical plot, the characters are unbelievable and the acting leaves much to be desired at times. Photography trying to be arty but is just plain terrible. As usual with hyped movies, much ado about nothing."}, {"id": 26, "text": "Quick summary...the protagonists are so unlikeable the we really do not care if they live or die. That pretty much sums up the movie. Writing, storyline and acting is not up to par. Throw in the 'let's make the worst decision possible for plot device' and you will find yourself fast forwarding to the end.Take a pass on this one."}, {"id": 27, "text": "Kadaver is a little film that has a interesting idea and premise that was used in a solid potential but i felt like it even had potential to become even something bigger but there were some good staff in it.Cast did a good job and even if their characters werent very interesting they were more likeable then it was for me to like them.Story was somewhat original and fresh cause if this isnt first idea to be made in a film like this it was still more original then the rest of jumpscare horror that we are getting this days more then ever.Kadaver was a film good for a one time watch but it has some weaker staff to"}, {"id": 28, "text": "I have no idea why people hated it so much. Probably Americans."}, {"id": 29, "text": "In a desolate, starving post-apocalyptic world, the people of one particularly hard-up town are invited to the grand hotel on the hill for a meal and a submersive show, where they're asked to don masks and follow the actors from room to room. And things slowly start to go very wrong. I had to post here and speak up for this little gem, as I've just finished watching it and loved it. The grim world is stunningly created - dank, impoverished, bodies lying in the street, it's all too real and convincing. Up at the hotel, everything is scarlet and gold, sumptuous food served on silver platters. The excellent cinematography and design create a dark, disorientating atmosphere and as our protagonists get drawn further and further in, the suspense builds. This has a lot going for it, and if it's not the Hostel -like bloodfest people somehow expected, it's something a lot more ambitious. There are faults, naturally, and it could use tightening up a bit, but on the whole it's an immersive experience in itself and well worth a look."}, {"id": 30, "text": "This is what humans has been for a decades, monsters, murderers, attacking, thisrty to blood, Are we animals? Well yes, animals is more humanity than us"}, {"id": 31, "text": "Should have a higher rating. Quite original setting and feel. Several parts creepy in a unique way. No not perfect, but by far not a waste of your time."}, {"id": 32, "text": "The title says it all (as said by a Norwegian).Decent, but entertaining. I didn't regret watching. Imagine what Blumhouse could do with this plot, though."}, {"id": 33, "text": "The story is quite interesting start to finish but it never really gives you that moment you feel you've been waiting for. The plot was predictable but in a way it didn't bother me it was so straight forward, the acting kept it interesting. The cinematography was really great and is probably the main reason I gave it a 6. Don't expect the coolest plot twist ever, but if you ever have some time give it a shot."}, {"id": 34, "text": "Thriller movie from Norway. The film from the beginning creates the atmosphere of poverty, hopelessness, misery, desperation, gray that prevails and like a ray of light comes a theater in the area. A poor family hoping to give their child some joy decides to go to the play. But what really happens? Is there really a theatrical performance? How far can someone go to survive and what will one choose in the end when they know the truth? A special film that while it prepares the viewer for what will follow, a remarkable effort has been made, a very good job as a whole in interpretation, direction, scenery etc., and it is an overall interesting recommendation."}, {"id": 35, "text": "By any means nothing really special,but considering that it is a first feature of the young director,it is done better than majority of the Hollywood horrors churned out daily...I liked the atmosphere ,colors(some Lynch influence))).acting is ok,story id predictable but not too boring...Decent one time watch!"}, {"id": 36, "text": "I loved the idea of the movie, but I couldn't shake how dumb the main character Leo was... every dumb decision she made had disliking the movie more and more. They had so much potential too... I'll just pretend I never watched it."}, {"id": 37, "text": "I can't stand Alice in Wonderland metaphors anymore even if here we are shown a different perspective with Alice's mother. There is a specific scene that I enjoyed and that I'm not going to spoil regarding the mother's solution to bring about the Apocalyptic moment of the movie. That scene only redeems the whole movie according to me !"}, {"id": 38, "text": "After a nuclear war, people are starving. Lucky for them that a play is going on in hotel up on the hill where they will be fed before the play begins. The set up was interesting enough to catch my attention. I had no problems with the acting and I liked how the film was shot (the reason I'm giving it a 6 out of 10 instead of a 5 out of 10.). It is a pretty looking film. Where the film falls flat is the writing. I don't think I'm over exaggerating when I say that the movie consists of a couple yelling their daughter's name for a half hour or more while they look for her. 'Annie?' Walk into another room. 'Annie?' Walk into another room. Annie?' Walk into another room. Sad thing is that this half hour search is the strongest writing in the film. Most of the script feels like a polished rough draft where nothing was cut out nor was anything explored in a meaningful way."}, {"id": 39, "text": "This one is just stupid. I can't believe I watched it. It had potential, but that was squandered 5 minutes into the movie. You know it's bad when you just want it to end."}, {"id": 40, "text": "It's so bad that i want to ask for the time i spent watching this crap show, back! if you are going to invest in making a movie then at least TRY to make it a decent one. I regret the last hour and change of my life!"}, {"id": 41, "text": "This was ssooooo good. I was kinda crushing on Mathias till well yeah its super good."}, {"id": 42, "text": "This is a nearly perfect film, in that its weak points should not matter when it comes to one's enjoyment of the film. Great atmosphere, great parable, and the 'twists' that some might complain the movie lacks in, are as many and as well put as needed to drive the point of this movie home.This is a movie with no filler scenes. It's ~86 minutes of straight driving to the ending. It feels like I've never seen such a straight long film before.This movie gave me a very entertaining but also thought-provoking night, without any fluff. Highly recommend."}, {"id": 43, "text": "Watching this felt so bad that I cannot process how a human would consider it watchable except for some it's so bad it's good moments where MCs stupidity drives the plot . I will leave a possibility in the back of my mind that I missed some crucial symbolism just to keep my sanity after seeing some positive reviews that made me question if my senses still function . If I can credit it for something is that it is the only piece of media that made me write a negative review that I didn't delete immediately after reading it."}, {"id": 44, "text": "Apart from being dull, wooden and not scary if you saw Chitty Chitty Bang Bang, the child catcher scene then as soon as the bloke in the van offering free tickets to a theatre performance in a big hotel with a free meal during a nuclear apocalypse (food? Where from? 🤔) turns up then plot twist over. It hinges, like the trap doors, on stupidity. he just walked through the painting, okay just ignore her and don't even investigate otherwise you may just live. The only plot twists are that as soon as it looks like it's about to get intriguing it doesn't. It does however come to a predictable dull end. Don't bother."}, {"id": 45, "text": "Storyline has been done in many scenarios But this has to be the Worst! Amateur Actors with Bad timing didn't help this Snore Fest!"}, {"id": 46, "text": "The emphasis on cinematography reminded me of the 1970's horror film, Suspiria. Unfortunately the story in this film is more like a dream that evaporates from your memory upon awakening. Nothing at all makes sense. Its just a lot of very pretentious camera work, and set design that wants to look like a Dario Argento production. Not a bad LOOKING film, but so badly written that you'll wonder why you watched it until the end."}, {"id": 47, "text": "Can someone please tell me why Netflix keeps on pumping money into mediocre films? For every 10 new films that Netflix churn out, expect only two of them at most to be of high quality.This film is mediocre, the acting is mediocre."}, {"id": 48, "text": "It's one of those movies which you watch and you don't have opinion about it. I liked the main idea, it was something unusual and unique. The problem was how the main idea was fullfiled. It takes about 40-50minutes of whole movie just walking and seeing literally nothing. There's only 20minutes of action in the film which makes movie very boring. I won't talk about plot jumps, some nonsense scenes(there was a lot of them). I wouldn't recommend to watch it because there are many similar movies that are better than this, like Get out or Us."}, {"id": 49, "text": "Whilst an interesting premise, poor writing and unlikeable characters hinder the movie. You can tell where the plot is heading an hour before the movie ends (apart from some minor twists which I did enjoy) and many of the characters were easy to hate. Alice was so annoying I found myself celebrating when she disappeared. The opening is boring and has little relevance to the rest of the film. Overall, I did enjoy the film when it reached the hotel, and was intrigued by the revelations made in the latter part, however some key holes hinder the film from reaching its full potential."}, {"id": 50, "text": "Premise itself has some potential, but it is completely ruined by horrible writing.All character decisions are incredibly stupid, almost cringe worthy, so is dialogue, you see everything coming a mile away and it is hard to feel anything for any of these characters - it's a complete waste.I only watched it, because Netflix kept recommending it to me. Platform is unfortunately riddled with bad horror movies and this one is no exception."}, {"id": 51, "text": "In a post apocalyptic world, where everyone is starving to death, a guy starts shouting in the street. He is offering a theatre experience and a free hot meal.If you were in those circumstances and every fibre of your body didn't scream, IT'S A TRAP!!!, I'm afraid you deserve everything that happens to you.What the Carney barker was actually offering was a theatre experience which will turn the audience into a hot meal. For the actors.Our protagonists and gullible plonkers, a woman, a man and their 10 year old daughter (I can't remember their names, I doubt you will either,) swallow the bait and make their way to the hotel where the theatrical performance is taking place, with a gaggle of like minded morons, just in time for dinner.Now, just imagine what happens next. I'd say there's a very good chance that you've guessed the rest of the film. Girl goes missing, man goes missing, woman goes frantic and lots of people die off screen, man dies saving woman. Woman gets revenge on evil man, evil man dies, woman finds daughter. The endI gave this film a 5 because, for all it's dull predictability, the cinematography is quite diverting at times. Lots of gold's, deep reds and blues. It does give a sense of real opulence in the hotel. Also, the outside world of the Apocalypse is well realised. It's grey and black, and full of dust and corpses.Still, hardly worth the effort."}, {"id": 52, "text": "Horror movies about society ... you gotta love them. This is quite predictable and not just because of the title. Though as often is the case it isn't for the people involved. They seem oblivios to certain things happening around then ... maybe because they are too busy having fun (in different ways).Visually speaking this really is well done - no pun intended. Story is as I already stated not as tension filled as it could be. Not the best Netflix production then, but I've seen worse too."}, {"id": 53, "text": "If there had been a real story, with actual plot, twists and characters maybe this wouldn't have been so d**n boring. Visually, the young director is not without talents. Photography and editing also pretty much works fine. Try to get an actual manuscript next time."}, {"id": 54, "text": "Couldn't finish it, even though it's only 1h20.Please stop making boring movies."}, {"id": 55, "text": "A mediocre production at the level of a school theater. Predictable and absolutely not intriguing. Neither horror nor thriller came out of this pathetic semblance of a film. From the very beginning to the end of the film, the feeling that the film was filmed by children on a smartphone does not leave. Mediocrity and vulgarity make this film cadaver it self"}, {"id": 56, "text": "Overall not a bad flick, but holes in acting, plot, design, ending make this worth watching only to see how it ends, and it's disappointing to say the least. It is missing so many things..."}, {"id": 57, "text": "The movie feels like an elaborate mashup of scary halloween fun house and Hostel. Scary fun house because as the main characters wonder throughout the large hotel, they come across bizarre scenes in each room. Hostel because of the creepy goons in white butchering people. When they take off the masks they are told to keep on during the show, they become part of the show.Good premise for a psychological thriller and/or for a gory horror film. But the actual execution falls short. The film didn't wow me."}, {"id": 58, "text": "I just finished this having read through some reviews. I rarely trust reviews because they are all subjective.The title Cadaver should give you an idea of some events that may take place in this maze of a movie. I didn't hate it, didn't love it. I did not realize it was a foreign film until watching it, I honestly prefer subtitles over English voice over, for obvious reasons. Saying that, I did not mind the voice over in this.The cinematography is really beautiful. The idea of this movie is really fresh and made me want to watch it fully. The opening was incredibly strong. However, I do think it fell short with the majority of the film trying to find Alice. I would have LOVED to see more of the guests actually being hacked up and killed, because that room with the hanging bodies was really bad ass and I think they could have cut some other scenes to give the audience more of what was happening behind the scenes, rather than wait until the last 20-30 mins.Other reviews mention this being sort of like Alice in Wonderland. I strongly disagree. Alice is not the lead character, but I suppose some details could lead to that thinking.There is SOME gore, some pretty good scenes that keep you on the edge.If you're looking for something new, a movie that has beautiful imagery, blood, I'd give it a go. A lot of it is pretty predictable if you're one to catch things in a script, and some of the choices the lead does is frustrating but you get that from many horror movies.Not a bad film!!!"}, {"id": 59, "text": "I don't know what I say. It looks like something original but it is not, moreover it is boring. I didn't understand the time of the movie, which year etc... I really wondered what will happen at the end and because of that I watched entire movie but I didn't feel satisfied.. Good try but something is missing. Maybe Nordic feelings don't suit on me.."}, {"id": 60, "text": "Storyline is new but lack of support from the background provided. Chaos time and the way a hotel owner search for food source. Idea indeed not bad but I thought it's stated nuclear explosion in the beginning. Contradicted to the man eat man theory. For the progress of the movie, it's good just lack of support."}, {"id": 61, "text": "I gave up on this movie after the first half of it, it just felt like a pointless movie. literally all that happened in the time that i watched it was 2 parents ran around a freaky hotel looking for their daughter, some scary-ish stuff happened but overall it just felt like i was watching 2 people going through a haunted house attraction at an amusement park. there were some creatively composed shots which was pretty impressive but other than that this movie was trash. i kept watching it hoping it would get better but after i hit the halfway point, i knew there was nohing to gain from watching the whole thing"}, {"id": 62, "text": "It presents itself as a psychological thriller with gore but the plot is pretty obvious from the first scene inside the hotel. I enjoyed the tension throughout and the acting was good.Also I watched it in the original language with English subtitles because the dubbed version was jarring and hammy."}, {"id": 63, "text": "I liked the style and atmosphere of the movie, the whole idea wasn't cliche either. However it got really boring and predictable in the second part so I even played some game while watching it."}, {"id": 64, "text": "This movie are not bad at all, but if you want to watch this because you think that's a good movie it really isn't.Incomplete story with many nonsensical"}, {"id": 65, "text": "Absolute waste of time. Even «the room» the movie is better than this!"}, {"id": 66, "text": "You know the premise after the first 20 minutes, so I assumed there must be an unexpected surprise at the end to make watching it somewhat worthwhile. There wasn't - so it wasn't. Just pointless. 2 stars for lighting / set"}, {"id": 67, "text": "I was reccomended this by a friend and I must say I really enjoyed this movie. Sure there are a few plot holes, but it was nice to see something a little different. I can't say I am a masive fan of subtiled films I feel you miss to much by reading. But this is dubbed and although not the best, it did not affect my viewing pleasure. Like I said there are a few plot holes and could have easily been better. But for what it is 7/10 for me Would like to see more from writer/ director Jarand Herdal. Good effort."}, {"id": 68, "text": "It would have been beta if they gave the movie money to charity.... trash"}, {"id": 69, "text": "The worst kind of b horror plot. A family with every dysfunctional problem imaginable, looses their annoying daughter 500 times. So they go searching In slowmotion throughout the evil hotel. Jumping for every little thing that goes Bo! Thats the movie right there. If you don't want to risk seasuring of the characters stupidity i suggest skipping out on this. The good reviews are from the people involved."}, {"id": 70, "text": "Lovely analogy, hunger, despair, fun, social inequality, reminiscent of the excellent O Poço, with touches of bloody terror... A great suspense movie..."}, {"id": 71, "text": "Predictable predictable predictable! Protagonists have very bland personalities. Like hello, you don't want to lose your daughter or husband? How about hold each other's hands while exploring? Being survivors of a post apocalyptic situation, I expected more survival mindset from them. I just kept cursing and begging them to kill all the protagonists already. The setting of the movie wasn't explained either. Was the situation just in their state? If it was, why didn't they migrate? (Not sure if it was because of the language barrier and the failed attempt to translate to English)I watched this movie because I was intrigued by the mask and the colors from posters. So sad they didn't live up to the expectations.Don't waste your time with this movie."}, {"id": 72, "text": "I predicted 90% of that movie and the other 10% are illogical plot holes. I laughed alot during this film because of how obvious and ridiculous the writing was. well I guess it gets 1 point for it's cinematography but it's also 2020 so... Do not watch this train wreck of a movie. Just don't... it's a waste of time."}, {"id": 73, "text": "The whole idea and the concept of the history is good. As a fact, I think it's a really good plot for a good horror movie. The problem was the way the movie is moving, it doesn't have a twist, it never gives a complete idea, there is no background for most of the characters and too dramatic sometimes. A remake could be a good idea."}, {"id": 74, "text": "I liked the concept but it lacked a bit of execution in its portrayal of a post nuclear war world.Not bad. That's all I can say. A welcome break from Hollywood flicks."}, {"id": 75, "text": "It doesn't have that thrilling theme. It felt like the actors didn't even know what they were getting in to.Very disappointed."}, {"id": 76, "text": "The premise is outstanding, as a mysterious billionaire invites a starving village to his castle/hotel for a free meal and performance of a play. Then the creepiness sets in, as the play takes places throughout the entire hotel, and guests interact with actors. After this strong setup, the poor writing comes in. The main couple have a 10-year-old daughter, and every other scene, she has wandered off. The husband gives the kid the cliche movie line Don't wander off in a strange house. Stay with Mommy and daddy. Then the brilliant mother basically says, She's 10. Let her be a kid and play around in this strange, dangerous mansion. huh? The kid runs off again. Later, the mom ingeniously saves her own life by making one of the bad guys appear to be a victim but putting a mask on him. A great scene, but it couldn't save this movie. So disappointing after a strong start. The old I'm better than you attitude of the mom ends up taking down the bad guy, but now mom is back to living in poverty with no food or comfort, when she could have chosen a life of shelter, warmth, and abundant food. She made the wrong choice, but we all knew it was coming."}, {"id": 77, "text": "Norway, post nuclear holocaust, presumably Oslo. Improbable conditions, a number of showpieces that are so impossible that they rob the film's credibility before five minutes have passed.The premise, if you're willing to completely suspend disbelief, is very intriguing at first.Insipid dialogue, incredibly stupid decisions, spouted and made by a cast of entirely loathsome main characters without a single redeeming trait make this unpleasant to watch.The end and the plot are tedious and yawn-inducingly predictable shortly into the movie.Waste of time."}, {"id": 78, "text": "The best movie is that it is produced by Netflix and does not support the idea of homosexuality like most of their films are produced. The film has a new idea about the end of the world and the entry of people into the era of blackness (why is it like most films that talk about the end of the world in a way that has become typical)"}, {"id": 79, "text": "It definitely had potential to be a great movie. I honestly kept waiting for it to get better but then it never did. All you could get out of it was that there was a nuclear war going on, the main characters are terrible parents who can't keep an eye on their kid, and there was a rich psychopath that was secretly forcing everyone to be cannibals. That's the entire plot in a nutshell. Nothing special. I swear, I could go my entire life without hearing the name Alice ever again. The only good thing that would've come out of this was if Thorbjørn Harr had been blood eagled again. But they couldn't even give us a decent death for the villain. This movie should've been expanded into a series and it probably would've been appreciated more. At the end of the day, it's not a good movie."}, {"id": 80, "text": "The movie is awful.. would like to send a message to the people who wasted my time ... Bad acting AS well"}, {"id": 81, "text": "It was a great idea with tons of potential. The movie starts off great, with lighting and camera movement that remind of Cube, but halfway through the plot gets predictable and has a very abrupt ending."}, {"id": 82, "text": "The movie was kind of boring and predictable... but like the end. When the non realized that he was right ! Without him they'll starve to death !"}, {"id": 83, "text": "Just awful everything. Characters/ acting/ plot just painfully awful"}, {"id": 84, "text": "This one was okay but not very realistic. Lots of blood and gore. If you like blood and guts you got to see this!"}, {"id": 85, "text": "I'm no even sure why I finished watching this movie. Thought I was getting another good horror film. What I got was a bad voice over movie. What would have been a good movie was ruined by the bad writing."}, {"id": 86, "text": "As far as foreign films go, this was an excellent concept but I feel like it was diluted for American's sake. Like a lot of American horror films, the bad guy must ultimately die in the end. The good guy, albeit the meek one, must triumph and find a strength inside themselves that they had never had before. What I like about foreign horror films is for the most part, they're honest. The good guy doesn't always win. People watch romcoms and fantasy movies to escape from reality. What makes horror movies truly scary is when it closely resembles our real lives. In true horror, hobe doesn't exist."}, {"id": 87, "text": "So the premise of this film (theater show turns out to be super creepy) is definitely interesting, and the events are certainly intriguing enough to keep you going. However, the movie ultimately does fall flat, as it gets repetitive and leaves you wishing that they did more."}, {"id": 88, "text": "This film is set by in post-apocalyptic Norway and a family of three who are barely getting by are invited to dinner and a show by a creepy gent in a wagon. What could the harm in that be? Hmmm? If you've seen the immersive theater production, Sleep No More in NYC, you will be familiar with the hotel set, the masks and the act of following actors around an elaborately staged, multi-floor set. Once the family gobbles down their dinner and set forth in the hotel to follow the actress, Rakel, everything goes down hill quickly. A few twists and turns are not at all surprising but keep the film moving along. Overall, this film is mildly entertaining, mostly creepy and gross and really only worth watching if you have nothing better to do."}, {"id": 89, "text": "It had a pretty good beginning and middle........ but ending didn't make any senseThe actors all shocked at what they were eating.... How stupid could they possibly be?? The world has pretty much ended... and the one guy yells.... I thought we were just stealing their things...What the hell good is valuables furs, diamonds, and money in a time setting like that?Where the hell did they THINK all that meat was coming from? It wasn't like there was a huge farm around or something.... People were literally dying on the street."}, {"id": 90, "text": "Way too many plot holes and the entire time you're waiting for a twist that never comes."}, {"id": 91, "text": "It waa a great story and showed the reality.!! Often some people do take this decision while there is no alternate left..out of the movie I have watched till now, it was a good movie!!"}, {"id": 92, "text": "Leo (Leonora), her daughter Alice, and her husband Jacob are struggling to survive in a postapocalyptic city, when a man peddling a dream too good to be true cons Leo into buying tickets to a theater performance and a hot meal at a luxury hotel. As a former actress, Leo is drawn to the promise of nourishment for her daughter's body and soul, and Jacob reluctantly plays along.Alice with her big eyes, silky curls and red dress is the epitome of innocence, and Leo admits to a foolish hope for something better for her and for the family - what other choice does she have?As the dinner theater begins, the emcee warns the guests that whatever they see is an act - and only the golden masks the guests are given will distinguish them from the cast members, who are strewn about the hotel. A couple of lovers stage a dramatic quarrel and lead the audience through the stairs and hallways to the many rooms where the story plays out with a few quick glimpses of sex and violence.An intriguing start to the plot quickly fizzles with little to no suspense or character development. There is some air of mystery as characters disappear, but it's a crowd disappearing, not people we know, so it's less like a game of cat and mouse and more like turning on the lights in the bathroom and watching cockroaches flee into the walls.If you're hoping for some good blood and gore, there are a few moments of blades splitting veins, but unfortunately the attempt at getting the viewer to second guess whether it is real or all part of the act leads to special effects so pedestrian that you may ask does it really matter?The film misses the opportunity to leverage the family dynamics of the film - Will their love for each other be strong enough to help them survive?! - by splitting up family members too early, and providing the wrong choices at the wrong times to really give us any empathy or feel torn by their circumstances.If you somehow hadn't figured out what the real purpose of the dinner theater is, the movie wastes no time in confirming your suspicions, but does throw in a little bit of backstory to explain the motivation of the villain. But like most elements in the film, it's shoved in as if it was the first idea to pop into the writer's head and is given no space to grow. You'll probably nod and say to yourself oh.A few tiny glimpses of foreshadowing make their way to the end of the movie - notably Leo's acting background and a moment of comfort she provided to her daughter to ward off scary monsters in the beginning - but it almost seems like an afterthought rather than a critical part of the story, leading more to frustration at how a bit more effort in writing the script would have led to a much more satisfying conclusion.Perhaps in another ten or twenty years someone will produce a remake that knocks this movie's socks off. I hope they do. Sadly, for a plot and setting that had so many easy opportunities at success, the execution of this drops the ball in almost every way."}, {"id": 93, "text": "Much as the central antagonist poses questions to his unhappy assembly during the first act, Cadaver asks us, the audience, what it means to be human. What would we really be prepared to do to survive? And would those actions take away some or all of our humanity?Cadaver plays out the ramifications of these questions through its central premise - in post-apocalyptic Norway a starving family are invited to a mansion that remains oddly untroubled by poverty, where they will be fed and entertained by an unusual theatrical performance. The mansion is queasily reminiscent of such sinister spaces as the Overlook Hotel (The Shining) and the Black Lodge (Twin Peaks), a Grand Guignol nightmare of red walls and masked figures, a trap into which our family wanders through sheer desperation.The scenario plays on fears familiar to all of us in 2020 - do we really want to know what's going on in the world? How the desperate and powerless sustain the comfortable lifestyles of others, whether through direct personal exploitation or by economic means?. In Cadaver, this exploitation is brought to its logical conclusion and invites us to make a judgement about how far we would go to ensure our own survival, and then asks us to consider if we would go even further for something beyond mere survival.Cadaver is an intelligent film (ably directed and performed too, and it looks gorgeous) that deserves an appreciative audience. But are you the audience or a participant?"}, {"id": 94, "text": "There are so many downsides, I just don't know where to begin. The cast and setting are mediocre at its best, ain't the worst but there isn't a wow factor either. The actual idea behind this movie was pretty simple and straight forward, but the execution was poor. The movie's plot is basically reflecting what humans would technically do in order to survive in a post apocalyptic world; kill the weakest and those who's guard isn't up. In a real world, this would most likely not be the case. Anyways, let's move forward, the the movie is severely lacking pace, it's just too slow.The only thing I really enjoyed about the movie is the movie's climax (turning point), it was nicely done, if it wasn't there, I would probably have given a 1/10(SPOILER: The theater type building resembles a slaughterhouse, nothing more, nothing less.)Don't bother with this movie, it is NOT worth the time."}, {"id": 95, "text": "2 stars for cinematography, 1 for everything else.I can honestly say this is a very flaud horrorfilm-attempt. The movie doesn't even have ONE scary scene in it. Just pompous music and bad storytelling. That this is a Netflix-movie is hard to understand. The story is plain and simply boring, and very predictable. Nothing engaging throughout.The actors are also so over the top it reminded me of a Spanish soup opera. I truly believe the director don't know enough about grown-up feelings. The performances from pretty decent actors are horrible! And i believe this isn´t their fault. This is simply just poor directing. Although it has some good cinematography, that is NOT enough for a professional Netflix-movie. This is merely a poorflix-movie.And they made the ending like we, the audience doesn't know the premise from the first minute. Is was clear as day what was happening and what the bad guys was doing. And they didn´t even TRY to make some sort of twist. Poor poor poor...I dont know what to say really, if you should watch it or not. Maybe just to see that this review is dead on with everything.I saw this after i watched Hereditary tonight, so maybe the HUGE quality differnce in story, tone and build made me write this."}, {"id": 96, "text": "I think they kind of ruined this by giving it the title of Cadaver because it gives a big clue as to what might be going on. However, as the showmaster says, 'all is not what it seems' and there are many moments where you don't know whats fantasy or reality. Although it seems easy to guess what the big nasty twist could be, there are many moments which make you wonder whats really going on-is it all some big misunderstanding, is it all in the protagonists head? There are many films where the premise seems obvious, only for there to be a big twist at the end, and there was enough intrigue with this to keep me guessing and doubting my original suspicions, or at the very least, wanting to know the details behind the premise. The film is visually appealing-the grim, grey of the outside world contrasting with the opulent luxury of the hotel so that guests feel as though they have stumbled on an escape from their harsh reality that's too good to be true. Much of the hotels interior is a deep, luxurious red as is characteristic of many theatres, which simultaneously portrays the elegance of the surroundings while symbolising the buildings darker, true purpose. If you like the genre of horror that combines beautiful imagery with terror such as Midsommar, you may enjoy this film."}, {"id": 97, "text": "In the right hands this could be one hell of a movie but unfortunately the decisions and actions of the main characters are so distant from reality and so against common sense that you really do have to pretend to not be bothered by these things over and over again.The world has fallen apart and a carriage turns up inviting everyone to see a show with a free meal! My first thought would be that I was being tempted to my death but this family decide to take their daughter along. They're told to keep their masks on...and they take them off. They have their little daughter in a strange place surrounded by strangers and they let her run off on her own! And it just goes on and on.There is no need to do these things if you have a good script, setting and characters but all those things just pass by and are left with almost no detail. I'm sure younger people will enjoy this but for me you can't expect me to hang around watching a film that just does stuff to make you uncomfortable...Unrational things that most people just wouldn't do...fair enough in a teen horror flick but not this...this wants to be more and could have achieved it if the characters acted realistically...but when they act like fools it's hard to care! Shame...the cinematography was nice!"}], "reviews_amount": 98}