{"name": "Rogue", "titleId": "tt11576124", "reviews": [{"id": 0, "text": "The title pretty much says it all. She is just there for eye candy and never seems to get dirty in any scene. Poor acting throughout. CGI of lions was low budget yet they are the stars of the movie. It tries to be non stop action, but the shaky camera and annoying shootouts are poorly done. And lets have a 200'+ cliff drop into a 20' rolling river like no problem."}, {"id": 1, "text": "In Dr.Evil's voiceYeah right.I deserve a medal for keeping a straight face through out the movie."}, {"id": 2, "text": "I really didn't like it. It's a total cliché and Megan Fox doesn't convince anyone playing a tough ex military. The special effects are really bad, it lose proportionality between the computer animals and the actors. By the way, the overall acting is really bad."}, {"id": 3, "text": "This was awful and really dissapointing. Megan Fox being hot did not even help this movie. Not sure why anyone would make a movie about the most useless mercenaries on a hunt for people in africa... There are som people eaten by lions and thats is fun, but it does not make up for boring story, poor performance, shaky camera etc. Stay away from this. If you manage to watch the whole thing you should get a diploma"}, {"id": 4, "text": "Well.. 3 stars only for the message this movie gave... stop hunting animals lions, tigers, elephants etc and save their habitat.Movie sucks otherwise.."}, {"id": 5, "text": "One of the worst action movies I've ever seen. poor acting, low budget CGI, boring action acts, bad script and using Arabic and Spanish language with African gang makes no sense .. however it made me laugh :)"}, {"id": 6, "text": "The first 20 minutes is very action packed, it made you hate the bad guys and cheer when they are taken out. However, the movie gets very slow after that and never really recovers. Megan was unconvincing and I never felt anything for any of the characters. When they died I felt nothing. The CGI lions are terrible, like a high school final project quality. By the end when a CGI lion would eat someone I cheered, seriously, you wanted them dead that much."}, {"id": 7, "text": "I found it boring and script is just bad. What a waste of my time. B-rated movie that tried too hard to be something and it failed at everything. The best actor out of them all was the badly CGI'd lion..."}, {"id": 8, "text": "Do not pay for this movie, do not expect a big budget movie! Stream it for free and prepare to crap your pants forever! The CGI was botched big time, the acting was over the top terrible! Megan Fox should never act again, specially as some kind of soldier lady! She sucks at this role! How the hell are you that clean when you go through hell and all your friends are dead or badly injured? Piece of hot garbage movie!"}, {"id": 9, "text": "A timid woman leading a bunch of rogues? Most unlikely and it shows in this movie! If you can endure the first half an hour and beyond - which is mostly comprising talk and arguments, it settles down somewhat and becomes an action movie closer to the end. The timid leader seems to have some qualities after all, but this makes the movie completely false and unbelievable."}, {"id": 10, "text": "Rogue (3 out of 5 stars).Rogue is a fair action film. Plot is decent. About a group of mercenaries led by Megan Foxs character. Which she makes a come back with a heroic action star. About them trying to save a couple of girls from trafficking in Africa. Until they get stuck in a compound with a lion hunting them.It does have a few good action sequences that was entertaining. A prolonged car chase. And a shoot out climax. I did find the script to be cheesy with horrible dialogue. And terrible cgi on the lion."}, {"id": 11, "text": "If only the film was more of a creature one n less focused on Fox. The film starts off well on a lion farm with some tension filled scenes but then all that drama, bad camaraderie n stuff ruined it. Now who sings backstreet boys when a rogue lioness n bunch of armed killers r lurking around? The plot - A team of mercenaries travel to the remote n dangerous part of Africa to rescue hostages from a brutal gang, unknown to both the parties that horde of lions jus escaped from a lion farm and one ferocious lioness has gone rogue. It sounded one helluva adventure but they ruined it. Terrible dialogues n terrible screenplay."}, {"id": 12, "text": "The stereotypes on Africa are getting tired. This movie is plain bad on every level. With all the streaming companies today, anyone thinks they can make a movie. Which explains why most of those streaming services original movies are terrible and have low ratings. A lot of these movies would not find distribution in the old Hollywood or would be shown only in second rate theaters in third world countries. Megan Fox's best days as an actress are behind her."}, {"id": 13, "text": "Cringey CGI. Boring story line. Plot holes everywhere. Fox is incredibly unconvincing as a mercenary. The Worst."}, {"id": 14, "text": "This film start with a bunch of men attack by the lion, and a woman Samantha commanding her team scene! As turnout, this film is about Samantha need to protect the governor's daughter Asilia from being abducted, and she also need to prevent her team kill by the lion live in the place they settle in! Entire film full of boring conversation, and annoying overuse scene! Such as, overuse of the walking scene, overuse of the searching things scene, and overuse of the singing Backstreet Boys' song scene! Make the film unwatchable! The shooting and stabbing scene in the film have blood at certain point, but overall not satisfy, not intense, and too short! Majority shooting scene also quite messy, and barely showing opponent getting hit! The explosion scene just occur at the beginning of the film! The lion biting scene depict by very shaky low light camera! Pathetic! The crocodile killing scene just saw the blood in the water! At the end, the lion kill the last bad guy in the film! That's it! Another disappointed action film!"}, {"id": 15, "text": "I hoped this would be something along the line of Prey or even the The Ghost And The Darkness but this was just a terrible and low budget creature feature with mercenaries and a lioness. In fact the lioness was there more as an afterthought and a plot device then a main antagonist.A bunch of mercenaries led by Samantha O Hara played by Megan Fox are rescuing a daughter of a governor in Kenya. They end up rescuing three hostages instead of the one and when the helicopter which is supposed to pick them up is shot down they need to keep on running from the terrorists who are after them and encounter a rogue lioness on a lion breeding farm. It turns out that the lioness is just protecting her cubs and is attacking anyone who endangers them.The acting is ok mostly , the effects go from b to c grade to just terrible and there is the annoying blood mist that disappears into thin air when someone gets shot which makes the movie look cheaper and cheaper. The story and script were a major let down at times as well. You could literally tell which person would be attacked by the rogue lioness by certain sentences that were uttered moments before. This took out all the excitement from the movie and just left mostly jump scares. The movie loses the plot with the lioness only attacking the villains of the film the main terrorists who is British turns out to be just a criminal saying his country never wanted him, one of the dying mercenaries saying how beautiful lions are and so on and so forth. There is even a scene where one protagonist says well that just happened as if acknowledging that something makes no sense in the movie makes it in any way ok for the audience just because you mentioned it in the actual film. While the end message of how the breeding of captive lions need to stop is commendable, the movie does not draw attention to it properly. A 3.5 out of 10."}, {"id": 16, "text": "Fox and the young girls acting made this watchable and it was filmed well. They out-acted the rest of the cast. However, the comic relief one-liners seemed forced and overboard. Some of the lions' CGI scenes could have been better, much better. Some were just bad. Also, I think they used someone who had watched a lot of military movies to advise on the technical aspects and military specifics, but who was never in the armed forces. Some of that didn't seem right. Not an A movie, but not quite a B-movie. Not a terrible idea to combine an animal vs people and a hostage rescue plot."}, {"id": 17, "text": "The IMDB trolls are alive... but I found it entertaining. Megan Fox can not only run through the desert but does it like a professional with a gun. What were all the peons that wrote the silly reviews expecting? Jurassic Park CGI? Stuff blows up and it's gritty and real."}, {"id": 18, "text": "Yes it involves the big name as Megan Fox but there are too many flaws in the movie that could have been avoided and the movie could have been made an EPIC. The cinematography and action are good but at too many places this movie lacked. No solid background foundation of the lead role actor just put the lead in the movie and there it goes off.One time watch and for some it's not going to be easy as you will be disappointed."}, {"id": 19, "text": "This is alright. It isnt the worst movie out there and I liked seeing Philip Winchester in this role again as I love the tv series Strike Back. So it was good to see jim again. Megan Fox is badass and it was good to see her in this role too.The cgi wasn't the best but i enjoyed it. Some of the other actors were bad but thats fine. It was still an alright movie.So if you like army movies then check it out."}, {"id": 20, "text": "Rogue turned out to be a lot better than I expected. Megan Fox is no Scarlett Johansson or Kate Beckinsale, but she wasn't too bad in the action role. The script and characters were well-written, and, overall, the cast and action were excellent, although some of the visual effects could have been a bit more refined.I appreciate the movie being about poaching, a subject I haven't seen yet in other feature films, and it does it without being overly preachy. All in all, I definitely recommend checking out Rogue."}, {"id": 21, "text": "I don't know what's wrong with peoples but this movie definitely don't deserve 3.8. Its between 6-6.5. I have seen so so many movies from classics to latest one and from experience i can say its not a great but a good entertainment movie. CGI tiger was definitely not good but its also not so bad. I mostly watch movies alone so others don't ruin my experience by criticising every aspect which i guess happened to lot of people here. I was holding this movie from a while and today at last i watched it and am not disappointed or felt like it was complete waste of time. I usually don't watch movies lower then 6.5 but trailer gave me feels that it would be a good one and guess i was quit right about that."}, {"id": 22, "text": "I actually enjoyed it. If you weren't expecting trash before you watched this movie than you're dumber than the plot but as far as trash goes, it was actually not too bad !!! The first 20-25mins was a great start and quite engaging. I went in expecting the worst so with my low expectations I was pleasantly surprised how entertaining it was. Look.....its predictable but there were some really cool scenes and this movie has plenty of laugh out loud moments just maybe not for the reasons intended.Give it a go, as long as you've seen the trailer and your expectations arent unrealistically high you might actually find the entertainment in this, I certainly did."}, {"id": 23, "text": "I think people are so anti Megan fox it's tainting the view of the movie. It is in its own right better than 3 stars. Look at this objectively and it's an engaging film in the same vein as the ghost and the darkness which has been ages since a similar film unless you count the meg....and you shouldn't. Look I can't convince you if you're already sure of your mind. But if you're open to giving people the chance to prove themselves I think she does an alright job."}, {"id": 24, "text": "I am not going to write a tedious lengthy review on this film. It is an action packed thriller. It keeps you at the edge of your seat with a few twists and surprises. The characters are well developed for an entertaining action movie. The highlight of the movie is Megan Fox. Indeed, she delivers. She portrays a tough no nonsense leader of a pack of mercenaries. The character is competent, fierce, charismatic with nerves of steel. The graphics of the lioness, however, were poorly done. The setting was in South Africa. This is a refreshing change from most action packed movies set in LA or New York. In summary, it is an entertaining movie that should not be taken too assiduously."}, {"id": 25, "text": "It's not a movie you take seriously. It was fun to watch, and honestly I don't understand all the hate it's getting. There's worse... what I truly don't understand is the Megan Fox hate. She always gets hate just because, and it's really not okay. It's 2020, stop hating just to hate. She does a great job in the film, both acting and the role given. The negativity about her needs to end. Stop putting her down, her acting has improved over the years.If you're looking for some entertainment, give this movie a go. Don't go into it expecting a blockbuster."}, {"id": 26, "text": "I actually quite enjoyed this film... A lot of Action.... Pretty well done.... Enjoyed the lions.... Not as bad as people are making out.... Give it a go.... Enjoy.."}, {"id": 27, "text": "This has been by far one of the worst movies of 2020, and it all started from the crocodile, the whole movie was just pointless I could go on and on... Gaddamn!! I saw Megan Fox and thought this was going to be awesome but little did I know...!!"}, {"id": 28, "text": "It's not as bad as the many of the reviews make it out to be. The whole production is a little dated. Had this been released/produced in the early naughtiest, it would have received a much better welcome. I enjoyed it."}, {"id": 29, "text": "It's actually really good. Megan fox is really good in it and Im not a fan of hers at all. Is it a B movie....yes. is it fun....yes. is it oscar worthy....no. just kick back and enjoy it for what it is....a popcorn and chill movie. People have so many high expectations for movies. All I can say is y'all go out there and make a movie if you think you could make a good movie. Which I can tell you you'll probably have bad reviews."}, {"id": 30, "text": "Besides the lions looking and moving extremely fake I really enjoyed the movie"}, {"id": 31, "text": "It's quite good ignore bad reviews Yes the CGI for the lion could have been better but it's still a good watch"}, {"id": 32, "text": "Direction and script were the weakest part here, it was like a feminist/animal rights activist patching together a bunch of random sequences and calling it a film. As much as the message in the film is grand, the movie did not do it justice.Hostages were extremely annoying but somehow managed to survive in the middle of a gun fight by just standing out there in the open and the lioness, an added afterthought to promote feminism the way I see it, just happen to kill the villains (twice) in order to not end the movie early. What's more, it feels like the characters in the film were just making stupid irrational decisions to again, promote feminism (when the girls decide to run out into the middle of a gunfight and that over exaggerated shout scene towards Pata).The next weakest thing would probably be VFX. Those blood mists made the film look really cheap, so were some of the muzzle flashes. Lioness herself was passable as a CGI however.Megan Fox was always clean and unhurt when her teammates were in tatters. It is however good to see a female lead role that is not used to support a male lead and in my opinion her acting was passable in this film. I believe she does have the potential for niche lead roles if the direction and script were better.All in all 4/10. Nothing against feminism or animal rights activism if done right but there are structures to films to make deliveries impactful. Just because someone had a good message he or she want to deliver behind scenes does not make it good or significant if it was made with such poor thought."}, {"id": 33, "text": "This movie is about a young women who is hired to rescue the daughter of some gouvenor in some African country and does this with a group of the best mercenaries money can buy. While the recue goes sour they have to run for their lifes and hide in an abandoned lion farm, wich is not so abandoned at all. This movie has great potential but fails on to many points. First the rescue, amateur hour at it finest. They try to pull of a distraction and then sneak in the village, but when this does not go according to plan, they dicide to shoot all the bad guys, and where do all the bad guys come from when a dozen or so are already shot dead? Why plot a recue with zero causualties when at some point they shoot everyone they see? Then they have to run from the village with the recued hostages in a couple of jeeps. The bad guys till have to get their things together, get their cars, but for some reason the catch up within the minute and there is some stupid car chase where everyone has forgotten to aim. Then when the vehicles die, they have to jump of a clife into a river. Never ever do you see them accually jump, only out of camera action. Luckely the bad guys dare not to jump, perhaps they can not swim? In the abandoned lion farm they are, off course, attacked by a remaining lion. But the CGI for this is so bad you never, ever, can believe one thing of it, most fake lion ever! The hero girl has been a soldier all of her life and that explains why she can shoot from the hip, she does not even have to aim to hit, and, after hours of chasing she only has one (1) scratch. Sometimes the movie did not even make the effort of creating bulletholes in bodies when they are shot. Meanwhile the bad guys keep comming and comming like an endless stream of lemmings. In the end she has a couple of tête-à-tête's with the bad guys leader, who, for some unknown reason does not shoot her."}, {"id": 34, "text": "Half way through this movie, I realised this was better than Extraction starring Chris Hemsworth. It has a better story, though the acting is not as strong, and it has a better message. Trouble is I gave Extraction 6 Stars, and this doesn't warrant 7 Stars. Ignore some of the prepubescent reviews and give it a try."}, {"id": 35, "text": "I didn't think my day would include writing a review regarding this flick. After reading all the negative reviews and comments about it, I figured I'd watch it to see how bad it really was. Well, I must say it wasn't the best movie I've ever watched and nothing I haven't seen before but to say it was a total waste of time, I'd go with no it wasn't. Does it have it's flaws? Absolutely, there are quite a few but it wasn't near as bad as some make it out to be. In the case of the CGI, brutal. Very bad and the story was all over the place. The so called comedy fell flat but I thought the action decent and she reloaded. That should be worth a star right there. I've seen worse.Overall I'd say if you get a chance, watch it for yourself but don't spend your hard earned money on it. I thought it was a decent time waster and would watch it again. I really can't believe I'm actually defending this movie but a 3.8? It's better than that, hell, the Doorman is rated higher and that sucks way more than his one. Just say'n."}, {"id": 36, "text": "OK... So not the best movie I have seen, and a bit predictable, but it's definitely not the worst. CGI may not be top notch but it's not a huge budget flick so definitely effective, not over played and I don't feel they spoil the movie at all..... Far far better than many others of a similar vane.... Anaconda to name 1. Overall I give it a 6....partially because of its message and partially because it passed the time pleasantly."}, {"id": 37, "text": "I find this movie fun and casual to watch on Saturday night with family"}, {"id": 38, "text": "Awful all the way around- bad acting, bad script, awful dialogue. Megan is such a beautiful woman but she needs to stick to her usual roles. Not everyone can be Charlize Theron. I think she would do well in Romantic comedies like Jennifer Anniston. Just not a lead in this type of movie."}, {"id": 39, "text": "It's non-stop action with little room for character development, but some of the action is comical, even if a bit predictable. Hearing military guys sing Backstreet Boys was pretty funny too. It was satisfying to see a bunch of poachers get blown away.With less action and more character dialog this could have been a better story. It could have been a Jurassic Park type of film, but it was very violent. It was hard to clearly hear the dialog or follow the characters' journey, and the shaky camera work was distracting. Good cinematography and ending though."}, {"id": 40, "text": "At some point is actually becomes funny, Fox is so stupid, she sees a lion kill her best friend, and to the question 'what killed him?' she answers: 'something'. This is the most stupid and useless group of soldiers/mercenaries you ever saw. Tons of ammo and guns and cannot kill a group of African low lives, watch, why not? Enjoy the stupifity"}, {"id": 41, "text": "The conceptual story was actually really good, and the location/sets amazing. The directing was ok, but had great cinematography. The screenplay had major plot and technical issues, with dumb dialogue in most scenes, and the acting was terrible. There was a scene that Fox actually acted really well, but that was overshadowed by her perfect hair and make-up with a single permanent red smudge on her forehead - the only evidence she was involved in any action. I also feel a better female lead should've been cast that would've been more convincing than Fox. Had directing the scenes and cast been better, with better acting and dialogue, this could've been much better. Would I see it again? Nope. Would I recommend it? Only if you're bored and have nothing else to watch. It's a 5/10 from me."}, {"id": 42, "text": "Story is good but the acting was average amd cgi was low budget. But overall movie was ok"}, {"id": 43, "text": "Film just about gets 5 stars until the end when it drops to 1 star. Pathetic ending and a waste of time watching"}, {"id": 44, "text": "Nothing much to watch, just another band of (really, really) incompetent mercenaries - led by Snow White -, being taken out, one after another, by some pathetic clowns. Unfortunatelly Snow White survives! Bonus: a very weird lioness which: a) is suffering from arthritis or b) was hit by a train in its childhood."}, {"id": 45, "text": "Yes Megan Fox in this role is hilarious. Yes the CGI is a joke especially for nowadays the lion looked SO fake n the attacks lol. But I wasn't bored to death. And I love the story line it IS unique it made me think they should make a better movie using the same subject matter."}, {"id": 46, "text": "Megan Fox and Philip Winchester are the perfect couple for this film, so I was eager for the film to come out and left me thrilled. As for the film, it has a beautiful story and one should know that the film was invented just to show the lions to the world the truth of what is happening to them."}, {"id": 47, "text": "We liked it. Yes it had some shortcomings Some good CGI and some that was ... welll ...bad. There were some good action scenes and all in all it was an enjoyable watch"}, {"id": 48, "text": "Stupidity I forgot to check IMDB prior to watching this, bad mistake! Story line is poor and characters very unreal, along with the terrible combat scenes, poor CGI, and animal story aspect. This is one to miss, unless you have absolutely nothing else to do!"}, {"id": 49, "text": "All Visual effects are very obvious..I was expected better movie, looks just better on poster."}, {"id": 50, "text": "No words. I can't even. Seriously! I paid to see this?"}, {"id": 51, "text": "I'm giving this a 6 because Megan Fox made me drool through the entire movie. That's a lot of drool!"}, {"id": 52, "text": "Starting with the bad, Megan Fox doesn't seem to have trained or prepared all too much for this role for whatever reason. Though not an expert myself, I'm specifically criticising her combat portrayal as well as most of her dialogue delivery. What I loved was the survival theme and overall message as well as the intended and possibly unintended comic relief. CGI was clearly low-budget but it serves its purpose. Verdict: necessary message!"}, {"id": 53, "text": "I mean, if you are nitpicking, yeah, there's a lot wrong with this film. But, if you see it for what it is - a combo between a military action film, and a zombie/horror film (there are no zombies in Rogue, but it's *that* kind of a film), it's not terrible. It's just your typical, VHS made-for-tv film that you would have rented at Blockbuster 30 years ago and you would have love it. Today, not so much, but it's still not atrocious. Frankly, i have to say that Megan Fox is the sore spot. It is utterly ridiculous how miscast she is, and not *just* for being a rose lipped, skinny, peach skin model who could not pass for a merc if she was covered in tar, but her delivery is also completely off.But, forget about Megan Fox. There's plenty of competent extras willing do happily die at the hands of smugglers and/or CGI lions while shooting guns, blood splatter, prosthetic wounds, and believable sets to keep you entertained through a jumbo sized bowl of popcorn.Just - don't expect a serious film.6/10 - this film should be less pretentious and more self-aware"}, {"id": 54, "text": "Ignore all the reviews that mentions Megan Fox's acting. It seems like they can't get over the fact that she is in the lead role playing a mercenary. She did fine for what the role requires. Usually the hotter an actor is, the more they have to prove their acting ability for some of these people.This movie had a great action opening sequence and for a low budget B-Movie, was still was able to give you some feature level surprises. I was entertained throughout, this movie gets unfairly criticized as it actually had a good storyline with a good message about whats going on in South Africa. Too many Megan Fox haters in here.It was suspenseful from beginning to end and you actually cared a bit for some of the characters. At least I did."}, {"id": 55, "text": "Action movie. Although not uncommon in the script, it is quite well made, and has some quite decent supporting roles. Megan Fox unfortunately not at all convincing, very apathetic and expressionless even in important scenes. Nevertheless, as a whole, it is quite good with suspense, good direction and plenty of action throughout the film. On the plus side, it raises the issue of breeding, hunting and killing lions, with the result that the king of the jungle has begun to become rare. Maybe with a more experienced actor/actress it would go up a level, but it remains a good overall suggestion to have a good time."}, {"id": 56, "text": "That's about all you should need to confirm your decision to view, or not to view."}, {"id": 57, "text": "I watched only a few minutes of the movie and apparently that was good enough. I started watching it with an OPEN HEART &amp; MIND because I like Megan Fox but I could tell the movie is poorly made... The dialogues were funny and the CGI Lion made me burst into laughter cause of HOW BAD it actually is. UNBELIEVABLE :))))) After the movie was over, I looked it up in Google and apparently everyone want their 1 hour and 45 minutes back. So yeah, I really was lucky."}, {"id": 58, "text": "Don't even know the specific category to put this movie. Why in the first place will a movie like this come out?? Meagan Fox should never play a soldier or an action hero, her screams and dialogues are just not inspiring... She needs to be in a sexy or porn movie don't know why she gets recruited in action movies. This movie, dialogues and acting are just wack!!!"}, {"id": 59, "text": "What a waste of film, had the feeling it would be dire and shortly into it my suspicions were conformed. Megan fox and the cast were more wooden than a lumber yard the effects and everything about this drivel was less than asylum quality; not even laughingly bad."}, {"id": 60, "text": "Wow, what a total garbage of a film. absolutely laughable.. CGI? I think they used MS Paint instead. script is ridiculous, acting is ridiculous, overall: -1\\10"}, {"id": 61, "text": "Silly people doing silly stuff. Unfortunately it just kept getting worse. Gave up after 45 minutes so no idea how it ends and don't want to know"}, {"id": 62, "text": "What an incredible waste of my time. My only consolation is that I did not fork over greenbacks to watch this farce. Fox does not come off as battle-hardened as the role implies. I noticed little prep for this role. Add cheesy(read cheap) special effects and an inconsistent story-line and this was doomed from the start. No amount of post-edit could fix this debacle."}, {"id": 63, "text": "I really really really enjoyed this movie. I don't know why people are hating on it so much the story is good the acting is good is it Oscar winning no is it believable yes. There are a lot of crazy things that happen very unexpected things. I think Megan's acting in this movie was good. The action was good. At times the CGI looked really horrible and other times it looked ok. I think everybody should give this movie a chance it's really not as bad as people are making it out this seem. Overall I really enjoyed this movie"}, {"id": 64, "text": "This movie is not a walk in the park. Nor is it the tried and true fables of Africa, its people, cultures and inhumane treatment of animalsMegan Fox does an excellent job as leader of this rag tag group of hired mercenaries. Who start out with one objective but ends with severalA great, if not sometimes difficult film to watch."}, {"id": 65, "text": "I wanted to like this movie, I really did. Toe Thumbs managed to pull off somewhat of a decent role but there were just too many technical issues which were glaringly obvious. If you're going to make an action movie, ensure that you have enough blank ammunition to make the firefights believable. Even the basic urban commando knows that when you pull the trigger, the rifle is supposed to operate like a rifle. There were entire action sequences where there wasn't one empty shell casing ejected. Heck, most of the firearms appeared to not discharge a round at all, despite their animated muzzle flashes. And I'm guessing the budget for CGI was spent entirely on the firefights as the lion was....well.....just bad. My wife and I sat through the movie, we did, but it was with raised eyebrow most of the time. The only redeeming quality of this movie was SOME of the acting from the few who were trying. It was definitely a low-budget movie COULD have reached a higher potential but they just ran out of money."}, {"id": 66, "text": "I really really really enjoyed this movie. I'm kind of shocked that people are hating on this movie so much the story is good the action is actually pretty good there's a lot of plot twist and the acting is not as bad as people say is it Oscar-winning no is it believable and good yes. Megan actually did a very very good job in this movie very impressed. Really the only bad thing is the CGI at times it looks very bad. Just give this movie a chance it's not as bad as people say to be honest people are just hating on it because Megan is in it but she actually does a pretty good job. I really do recommend."}, {"id": 67, "text": "I don't know where to start I'm not want to bang on about liberal agenda but come on at least remove your makeup before entering a battlefield, At least if they chucked in an old Steven Seagal or someone like that I could have had a laugh when watching this.. There's no point reviewing this because it's rubbish do yourself a favour and just go watch 13 Hours: The Secret Soldiers of Benghazi Again"}, {"id": 68, "text": "Megan Fox not even once got hurt in the movie but all the other hardcore guys. LOLS"}, {"id": 69, "text": "Do need to make a movie only for make it. This really bad production. Stoled 2 hours of my life."}, {"id": 70, "text": "Terrible &amp; senseless acting Wonder what inspired to do this idiocacy"}, {"id": 71, "text": "Rogue is for sure one of worsest films i saw during year from new realeases and even if there were some very bad ones,this one will be unfortunetly in my mind for some time.Everything here was pretty much awful,characters are idiotic and so stupidly written that i was having a headache for most of runtime,script was also very bad and even very laughable at some scenes,Megan fox was again very bad here,she didnt sold her character at all and her combat skills were laughable as well,i mean whos idea was to cast her as a action hero who always looks perfect and without any sign of dirt on her,special effects with lion were also awful and one most ugliest one i seen in a long time.Rogue was a just a very bad film"}, {"id": 72, "text": "What the hell were they thinking? This is complete garbage. CGI was done on a TRS80 and the acting couldn't last a weekend at your local community theater. Great message though... Save the lions. Thanks Hollywood!"}, {"id": 73, "text": "This movie is only good for action but is meant to brain wash the younger audience into thinking the military is bad, many decisions they made in the movie was actually stupid and not how the military roles, Megan's acting was God awful, and this movie became a joke with some good action scenes."}, {"id": 74, "text": "I watch Rogue for Megan Fox. Now, if Michael Bay is involved, and if he will do it in the style of 13 Hours, or Antoine Fuqua with Tears of the Sun, Megan Fox will shine as the next action heroine. Rogue will be better without the lion too."}, {"id": 75, "text": "This was the best movie of 2020. Exciting. Way too good for the advance person with a small brain."}, {"id": 76, "text": "One of the worst movies that I ever watched. Bad acting, bad story, bad effects."}, {"id": 77, "text": "A waste of time , too predictable every scene , very weak acting"}, {"id": 78, "text": "A beautiful, awareness-raising movie about lions, and Megan Fox has mastered the role very much"}, {"id": 79, "text": "It's so bad it's almost funny. Fox is definitely not an actress. Most of the time she is running around holding her gun like a d...o (it is not allowed to use this word äpparently). And the rest of the simpletons calling her Boss? Ridiculous."}, {"id": 80, "text": "Sam (Megan Fox ) leads a group of mercenaries in Africa who are paid to rescue the governor's daughter. The rescue goes awry and they have to do a Butch Cassidy and Sundance Kid escape. They end up at the lion farm we saw in the opening scene. CG mamma lion is on the prowl.The film is intended to bring attention to the issue of lion farms in Africa where people pay to hunt a lion that will be easy to shoot. Megan always knew where the camera was. Lots of shooting.Guide: F-word. No sex or nudity."}, {"id": 81, "text": "So much loopholes and bores you for the first hour. Megan Fox doesn't fit the character of the role. A far worse version of movie Extraction with animal cast."}, {"id": 82, "text": "+ Megan Fox. Don't lie to yourself, you will watch this movie because of Megan. + Wild African nature. + Some nice lion jump scares.Everything else is a random action with a random script. Pointing out lion farms problem don't make the movie itself good."}, {"id": 83, "text": "I can't believe this movie made it onto the screen. Everything between the opening title and credits deserves to end up on the editing floor."}, {"id": 84, "text": "My wife picked this one to watch and then she fell asleep 10 minutes in. I had no choice but to continue watching, as I was immobilised on the sofa due to the a torn hamstring. The relentless pain I endured from my leg throughout was nothing compared to the pain I suffered having to watch this shocker to the end. Now I have a sense of what it is like for people who regain consciousness part way through an operation and cannot do anything about it but suffer to the end."}, {"id": 85, "text": "Overall the movie is just a waste of time and resources. Megan fox's acting was terrible that she had a emotionless face throughout the movie. It felt like she was there as an eye candy or attract audience to watch the movie. But there was a good story. Because the scenarios they had in the movie such as lion hunting, human trafficking, are true in real world. But the cinematography and everything are bad."}, {"id": 86, "text": "Mediocre acting, superficial story, bad vfx and not well paced.Some scenes are very predictable, the use camera angle and suspenseful music all gave away the suspense of the scenes eg when the girl got eaten by a croc, almost all of the lion-attacking scenes etc. The hostage girls are annoying and ungrateful, most of the characters are not developed well so when they got killed or something you barely feel anything for them. The CGI lion could have been better. there's a good message in the story tho."}, {"id": 87, "text": "I enjoyed the movie.The non-stop action, the story but Megan Fox acting was bad. Not sure who wrote her role but the non-stop cussing was so out of place that it made her acting even worse.She is still hot but the age is catching up to her and her look is not enough to compensate for the acting anymore. Would I watch her - sure, do I expect good acting - no!The lions were bad I guess not enough money to make something better or just bad production team.I would still recommend the movie, it's worth the watch."}, {"id": 88, "text": "I had big hopes up for this movie...but everything is poor... storyline, acting, dialogue...all this was hide with meaningless shooting scenes..."}, {"id": 89, "text": "Not sure who wrote the script for this but it's shocking. The crap script, acting, terrible characters and schizophrenic story line is shocking. I should have known it would be poor quality when the headline actress is Megan Fox.."}, {"id": 90, "text": "Good title for a movie but that's about it! Visual effects is next level of poorly done. Same goes for acting, just terrible."}, {"id": 91, "text": "Well, Afew minutes in and you start wondering why everything is not up to spec. So you accept your fate and start looking for the next blunder, cause they are really many and close between and stir laughs.Expect action but lower expectations on the execution."}, {"id": 92, "text": "I watched this movie because I love looking at Megan Fox (she is stunning) and the other movies I have seen her in have been entertaining. This movie however wasn't good. I have never reviewed a movie before and perhaps it is partly because I am so bored watching this film that I am distracting myself and perhaps it is because it is so obvious that one actor is painfully better than the rest but I feel compelled to give my opinion. The only actor who I feel portrayed their character well was Sisanda Henna. He expressed the emotions of his character extremely well and very realistically. I hope to see him in more globally distributed movies as he would be an asset. Great job."}, {"id": 93, "text": "I will be honest, I only managed 15 mins of this movie. After I switched it off, I read some of the reviews on here and had tears of laughter streaming down my face - it says a lot when the reviews are more entertaining than the movie. That brings me back t the movie - it's bad..I mean super bad.There is a ropey CGI lion at the beginning - she is the best actor in it and she would have been more convincing if played by someone in a furry lion suit. Once Megan appeared well I only lasted a few more minutes - she was less convincing than the CGI lion. This movie was truly hideous and can presume if you watched the whole thing it would take you several weeks to recover from the trauma. I wasn't brave enough....."}, {"id": 94, "text": "The title, Rogue is singular. There is only one rogue female lion carrying out the kills. Why anyone would think there is more than one is puzzling. Other than that, this movie had the quality of something found on the SciFi channel."}, {"id": 95, "text": "One of the ways I pick movies to watch is by checking the cast. Megan Fox was a familiar enough name for me to optimistically give this movie a chance.Story is boring Special effects are atrocious Acting is horribleI'm pissed off I wasted a couple hours of my life I will never get back.Megan Fox, you let me down"}, {"id": 96, "text": "Started watching this movie because Im a Fox fan. But man..... This is a bad movie. I watched...watched...20min. And stopped. A lots of non sense."}, {"id": 97, "text": "I really liked the start of Rogue - it reminded me fondly of The Wild Geese (and Megan Fox does well, but maybe I am here not really unbiased), of course, without achieving the quality of that action classic, but after the mercenaries wasted their ammo mostly by shooting holes in the air, Rogue takes the wrong turn - we get some man-killing lions, who are of course a danger to our soldiers, because they wasted their ammo... That move to add some The Ghost and the Darkness (Val Kilmer, Michael Douglas) flavor, destroyed the movie for me. Verdict: more or less totally ruined by an unnecessary creative idea."}, {"id": 98, "text": "This is very-very bad to very tiniest detail but... Megan Fox should have been casted as Lara instead of A.Vikander."}, {"id": 99, "text": "Where do you begin with this mess. Was the cameraman a drunk with parkinson? Who did the CGI job for them some guy from fiver? Did they just blow all their budget on Megan Fox who did a terrible Job?"}, {"id": 100, "text": "Weak bunch of mercenaries trying to save three messy teenagers, CG so lame, I have to stop watch it from19:07, it's the lamest ex-marine tactics if you know what I mean...Better watch the transfomers or TMNT than to watch this movie...."}, {"id": 101, "text": "The run-time is way too long for such a simple film. Megan Fox isn't a good enough actress nor charismatic enough to elevate a movie this bad."}, {"id": 102, "text": "What a stupid movie i just wasted 1:45 minutes of my life"}, {"id": 103, "text": "Worst movie ever seen.it shouldn't been show in cinema 👎👎👎👎👎"}, {"id": 104, "text": "Always been a fan of MF and went to see this flick AFTER seeing a score of 3.8. Can't be that bad I thought. Reviewers are always unfair I said.....I've never actually walked out of a movie, but if I did, this would have been the one. The only good thing out of the movie was the message - to stop the killing of wild animals for our own ridiculous beliefs and desires. Absolutely agree with this. But everything besides that - the script, storyline, acting, filming, CGI, direction - was horrifyingly pathetic. A 3.8 score? Way too generous."}, {"id": 105, "text": "Sorry, but the Nic Cage version of lion gets loose and creates havoc between good and bad guys was better than this. Rogue wasn't good nor was it bad. Just so-so.Backstreets back, alright! Super cringe moment.5/10"}, {"id": 106, "text": "All it takes for the film - is a pistol and a girl. Jean-Luc GodardDecades later, this advice from the great cinematographer has been too often used for the benefit of modern mediocrity. Rogue is merciless to the viewer. A string of meaninglessness and a bad script, coupled with a team of incompetent ones, looks disgusting. Evidence: This is NOT how the military behaves. Animals DON'T behave like that. In situations like this, people DON'T say that. Almost everything that happens on the screen is NOT logical, down to the crocodile. Megan Fox is NOT an actress. Why shoot all this? Why watch all this? Yiwuhh..."}, {"id": 107, "text": "Acting directing story... worthless. I want my money back"}, {"id": 108, "text": "You still need a good script for it to be a good action thriller. Acting was not great. I don't know if that's actors fault or the director. Skip it unless you're absolutely curious."}, {"id": 109, "text": "V: Why did they do all those things in the movie? M: Because............................... V: Fair Enough."}, {"id": 110, "text": "Seriously, I can take a perfect make up and poor weapon handling, it's just a movie right? But the most credible feature is the lion and that's made by what i presume must have been the director's nephew that knows a bit about computers.Just some highlights (spoilers):In the opening scene we have two veteran snipers that leave their overwatch position to distract the enemy close range while Megan Fox raids the compound.Then a moving helicopter gets shot out of the sky with an rpg shot from a truck speeding over rough terrain..Eventually the heroes lose their vehicles and run low on ammo so they decide to ditch their weapons and armor plates and jump off a cliff.They then stumble upon a deserted poacher compound, with working 4x4 vehicles and ample supplies of food and fuel, but they decide to ignore that and spend the night in the house, even after finding out that the previous occupants have all recently been ripped to shreds by something big.What follows is a series of dumb ways to die ending in a firefight where one of the heroes even manages to get mauled by a lion, proceed to kill several enemies and alternately pass out from bloodloss and then just walks it off to kill more bad guys.Apart from that we have battle hardened soldiers complaining about being visible during a full moon and still light up the place with flashlights and even start up the generator so the whole compound gets lit up like like its daylight.We have the same soldiers wading through deep water just meters away from a shallow spot, presumably to set the opportunity for someone to get eaten by a crocodile.And then one of our heroes decides to drop his ak and get out his pocket knife to get his revenge on a bad guy twice his size carrying a machete. Yeah, that doesn't end well.Sprecial thanks to Megan's MUA, since during the movie there seems to be hardly any scene where she isn't perfectly made up while even the female co-stars look like they seem to have been dragged through lion dung and broken glass.The whole movie would have been a lot better if the heroes were just some tourists dealing with a broken down tourbus, so we would at least have some patience with the idiotic ways in which they plunged to their deaths.."}, {"id": 111, "text": "Yes I've seen worse, but only just. The acting was mostly terrible, the CGI was worse. Not even great acting could have saved this film. The worst disappointment for me was seeing Philip Winchester, one of the best action heroes from British TV (Strike Back), playing second fiddle to Megan Fox who should never have been cast in an action film."}, {"id": 112, "text": "Although, this movie has some good actors and action scenes. The story line was rather disappointing. There isn't much back story to it. The CGI of the lion is terrible. I feel if this movie needed more attention to cinematography before it was released.It's an okay watch it you have nothing else."}, {"id": 113, "text": "I am about at the 1 hour mark in the movie and I think I had enough... It's a movie made for this actress alone... someone rich made her a present.From the begining I wondered if they had any consultant for the shooting scenes... They were standing at 15 meters away from each other shooting full auto and nobody got hurt... that did feel dumb and unrealistic... They did'n't use any consultant on lions and wild life for sure... All the lion's movement and behaviour seem just stupid and unrealistic... In fact all of it is just unrealistic and it pisses me off...It's clear to me that this movie is made by young, clueless privileged girls who just made a video for their friend, Meghan whatever is her name... What a waste watching some of the movie and making this review was..."}, {"id": 114, "text": "I could see past the poor animation and thin story-line but what I could not see through was all the foul language. Just horrible."}, {"id": 115, "text": "Story is vague. The film is just filled with shootouts scenes and nothing. Don't waste your time in this."}, {"id": 116, "text": "Couldn't finish it. First of all, Megan Fox is a beautiful woman, she'll still be beautiful without makeup and dirty but nah, let's have a prom queen in the middle of the Sahara. The dialogue is bad, the story had potential but fell short, the CGI among most of the shots were terrible. Could've been good but it's not."}, {"id": 117, "text": "The director MJ Bassett has some decent TV directing credits behind her but it's clear she can't handle the big time and criminally underutilized Megan Fox as the lead. I should never have to say I was totally bored of a film with Megan Fox as the lead, that's just wrong. But this film just drags, it bores, it lingers, it's just a wasted effort even leaning on the FF button. She shared screenwriting with her sister or daughter Isabel Bassett, really?! That didn't work so well."}, {"id": 118, "text": "OMG! Watch an episode of the A-team.... that's gonna be better and will have more credibility. Switched it off after 10 minutes... which was 9 minutes to much! I already wasted to much words on this review. Avoid at all times!"}, {"id": 119, "text": "I've seen some bad movies in my time but this would have to be the worst. The script, the acting and the cgi were all pathetic. It was so bad I was actually mesmerised. If I could have given a zero, I would have."}, {"id": 120, "text": "After watching this movie I realized how hard it is to killed a Lion. Battle-hardened mercenary+assault rifle is not enough to take down a lion. This is why we need nuke. Only a nuke might be able to killed a Lion. Oh! I almost forgot it is amazing how a crocodile teleport into a shallow water, we should put a stop to the idea of animal using technology. It is a fun movie to watch though☺"}, {"id": 121, "text": "The best part is animals killing people. The nature scenery is nice. No acting. Just running around."}, {"id": 122, "text": "I felt compassion for Megan, such a wonderful and sexy actress, but the talent is wasted in this -1 rating movie. I wonder whose funding this terrible movie, what a waste of money............................and I forgot, poor lion and lioness !"}, {"id": 123, "text": "Actions scenes are ok. Fox and Winchester are the best actors in this. Adam Deacon...why?..miscast...lazy acting. Special effects are really poor."}, {"id": 124, "text": "I feel like the only thing that may have saved this film were the action scenes.The acting of some characters felt forced, the witty banter wasn't witty (even wrong timing for some dialogues), the story line makes no sense in my opinion, no character development whatsoever and as far as the dialogue is concerned, I feel like that could have been alot better.I watched this because of Megan, but I expected more of her acting. I feel like she didn't carry the role as well as she could have . I gave it a 5/10 (me still being generous) because there were some parts such as the action scenes that were cool.It kinda felt like a very low budget Expendables movie tbh."}, {"id": 125, "text": "The opening scene of Rogue sets the stage for this poorly crafted thriller perfectly: a bunch of bored-looking mercenaries are just doing their job rescuing a walking payday from sex traffickers. The main protagonist of the team is the always expressionless Megan Fox, who seems to be doing exactly what her character is doing--cashing a paycheck.To be fair to Miss Fox, I don't blame her. I blame the casting director.OBLIGATORY PLOT RECAP: Roar follows a team of mercenaries lead by Boss Megan Fox as they rescue some of the most annoying young women from human trafficking somewhere in Africa. When cornered in an abandoned complex, the team and their pursuers are slowly picked apart by feral lions.I won't even bother talking at length about the awful CGI lions. They were bad in the trailer and they're worse in the movie. Why? you may ask. Because there's so much more of them, which really allows the laziness of the CGI to sink in.Instead of talking about the awful CGI lions at length, lets discuss a few things that are a little less obvious but equally appalling.BAD EDITING: The filmmakers clearly don't know how to tell a story. The first car chase/gun battle sequence has so many wasted shots that do nothing to propel the story forward, and this is a problem the movie suffers from throughout. This may sound like a minor gripe, but it's a symptom of a much larger problem.Things like shot choices, camera angles, character beats, and jokes, are thrown around because they're cool or to fill time or to give the illusion of development, but in actuality this is story-telling at its most shallow. You can tell there's effort to craft interesting characters here, and, to be fair, some of it works, but it's all padded by so much lifelessness, gunfire, and bad editing that the entire movie drowns amidst the wasted potential.BAD EDITING EXAMPLE: After a ridiculously prolonged escape sequence rife with terrible editing, one of the heroes remarks that they need to keep going because they haven't gotten far enough away from their pursuers. The choice of camera angle here is key because we the viewers can clearly see in the background that our characters have, in fact, come a very long way and are in no immediate danger. It equals a wasted line of dialogue, a wasted shot, and more wasted time.Oh, and then an alligator pops up because... something needed to happen? I'm not sure.You can always tell when someone's about to die in Roar because the camera angels are so cliche. The back-and-fourth cutting during numerous gunfights is so ham-fisted and lacking in creativity that you'll be surprised how you can fall asleep amidst so much gunfire.BAD CHOREOGRAPHY: If the characters aren't running and shooting guns, then they're driving cars and shooting guns, or getting shot by guns, or getting eaten by lions, or shooting lions, or getting eaten while shooting lions. No matter what they're doing while they're shooting their guns, they do it in the most boring way possible. A knife fight at the end of the movie has a few seconds of interesting choreography, but apart from that the lack of creativity and the almost endless gunfire makes the movie feel b-grade, like they couldn't afford anything but blank rounds.BAD DIALOGUE: When the characters are in mercenary mode they like to use dialogue lifted from every single detective show on TV. Words like asset and boss are used as though the writers did no research into the actual lifestyle of such characters beyond watching reruns of Criminal Minds. The rest of the dialogue exists to spoon-feed the audience exposition in the most boring and predictable ways possible.BAD DIALOGUE EXAMPLE: When the baddies manage to pin down the heroes in a building, Megan Fox quickly sets some explosives on one side of the room to create an escape hole in the building. It's obvious to the viewer what she's doing, but a side character idiotically screams in fright, You're going to blow up the building?! to which Fox replies with all the boredom she can muster, No, just the wall. Such dialogue is redundant and pointless. How much more badass would it have been for Fox's character to reply with an ACTION, like pressing the detonate button and letting the explosion just be her answer? It's amateurish dialogue and doesn't fit a character who is supposed to be this battle-hardened warrior.And now that I think about it, it's the kind of dialogue that never ends. Everyone in this movie talks almost non-stop so you're never at a loss of what they're thinking, feeling, or planning to do. It sounds stupid. It makes the characters look stupid. It makes you the viewer feel stupid.And it makes for one boring movie.Show don't tell is one of the oldest rules in the writer's handbook, a rule the makers of Rogue clearly know nothing about. Or maybe they just forgot. Or maybe they took that rule and burned it in an effigy of good filmmaking."}, {"id": 126, "text": "Rogue is a 2020 American action film directed by M. J. Bassett, who wrote the screenplay with her daughter, Isabella. The film stars Megan Fox as a battle-hardened mercenary leading a team of soldiers on a daring mission to rescue hostages in remote Africa.Being honest, I only decided to watch this movie because of Megan Fox. I've always loved her in movies like Jennifer's Body and although she's not known for her Oscar-worthy acting chops I thought she played the lead here rather well. She's a strong heroic presence, bringing a bit more emotional depth to her performance than I anticipated. The film itself however slowly crumbles under bad dialogue, bad direction, bad CGI and shrewd characterisation. Beyond all of the key things that make a movie great, the film is sporadically rather entertaining - it's got a few fun fight scenes and car chases here and there and I was never bored throughout the film but the films cookie-cutter plot and cardboard characters weren't enough to warrant a higher rating from me I'm afraid."}, {"id": 127, "text": "Day one: Watched approximately the first 40 minutes of this film before I decided it was trash and gave up on it.Day two: Decided to give it a second chance, watched from around minute 30 to just over the hour mark, and again, gave up on it.There will not be a day three. This film is just horrible, and one of the worst action films I have ever seen.In short a group of mercenaries (who we know nothing about and therefore have no feelings towards or empathy for) rescue a girl (who we know nothing about, nor is it ever explained who she is, why she's important and therefore like the mercenaries we care nothing about her) from some bad guys (who yes, you've guessed it we know nothing about and so don't care about either) and then get chased across AfricaThen it strangely morphs into a cross between a low budget horror, Tiger King and an endangered species awareness film.It's just incredibly badly made. The plot seems to veer from one topic to another and it hasnt even seem to have worked out what story it is trying to relay, the acting is pretty poor, the action scenes laughable (did they even have anyone on set teaching them how to hold weapons?) and the special effects b-grade.Maybe something happened over the final 30 minutes that redeemed this utter botch job. I will live the rest of my life not knowing I guess."}, {"id": 128, "text": "Rogue's biggest shortcoming is it's indecision as to what its supposed to be.Is it a GI Jane military style of film or perhaps a The Ghost and the Darkness deal, about man eating animals? The fact it's not clear about what it wants to be is a big part of the reason, it fails to gel into anything satisfying.Its character development is weak for this reason too. You never get to know who the main characters are in any detail, as the move between genres leave's little room, for character development.That's regrettable too, as the cast hand in solid performances. Certainly i have no criticism, on the acting front.Really, this is what could have been two films, rolled uncomfortably into one. I'll add I'm also a little critical of the way it presents what are increasingly endangered animals, in a less than flattering or for that matter, accurate light.It tries to smooth this over at the end with a conservationist message but I still don't think personally, this was a path that should have been taken to start with.4/10 from me."}, {"id": 129, "text": "It's non-stop action with little room for character development. Some of the action is funny, but I couldn't tell if it's on purpose or not. The best parts of the film: Hearing military guys sing Backstreet Boys was pretty funny, and it was satisfying to see a bunch of poachers get blown away. I also enjoyed the scenic African landscapes and the message of the film.With less action and more dialog and backstory/buildup this could have been a better story. It could have been a Jurassic Park type of film, but it was very violent. It was hard to clearly hear the dialog and follow the characters' personal journeys, and the shaky camera work was distracting.Megan Fox was great in her role, but she didn't have much to work with. Her character was just 'unemotional military leader.' The script didn't give her character much distinction. Overall, this movie was entertaining because it was so ridiculous, but I probably wouldn't watch it a second time."}, {"id": 130, "text": "The first scene feels like an eternity. A good start, followed by a boring chase where everyone forgot how to shoot.The group has some cool guys, and Adam Deacon (Zalaam, the bad guy) does a good job and has a nice introduction to his character. Interestingly, Megan sells her role a bit (more than I expected). Brandon Auret (Elijah) and Philip Winchester (Joey) were definitely my favorites, but there are good personalities and interactions all around, which is REALLY surprising. It's kind of hard to find recent movies were the cast is as good as this, like real people in real situations. That plus a developing/tense and interesting plot I wasn't really expecting made this a good enough watch.Buuuuuuuuuuut.. there is a but. Something in this movie looks bad. And it could move faster.. At a higher speed might be a good movie. Can't really recommend it, I guess. But if you want to watch it in the first place, it could be okay."}, {"id": 131, "text": "Megan Fox - Mercenary leader. Philip Winchester (the guy who was the lead in Strike Back - being Megan's junior lackey. You should know the action and tactics shown in Strike Back got plaudits for their accuracy - the team spent weeks training with actual former SAS to get a more authentic look to their movement and communications ).This film is a riotous laugh-fest. The casting director should get a Razzie. Do not waste your time unless you are drunk. Even then think again. Megan looks crazy hot, as expected, just not in the role as the lead, war-hardened veteran mercenary. Apparently war-hardening doesn't affect make-up or impart any scars or callouses. Neither does sweating in the African heat. The whole set - has a farcical, Monty Python vibe to it. As if any minute Hef's ghost would come on-screen, a bunny on each arm and explain what the hell the skit is about. But it doesn't. You'll just have to make do with a sweaty Megan with no plot wondering what just happened to the 2 hours you wasted that are never coming back and then realized you should have followed this reviewer's advice and watched this crap quite literally on fast-forward."}, {"id": 132, "text": "Well, as I sat down to watch Rogue from director M.J. Bassett, I can't really claim that I had much of any high hopes for the movie, as it was starring Megan Fox after all. But it being a new movie and a movie I hadn't already seen, of course I managed to find the time to sit down and watch it.Turns out that the movie was actually better than I had feared it to be. So that was a positive thing working in favor of the movie. Sure, this was by no means Shakespearian entertainment, but it was a pretty straight forward movie. It was entertaining enough for what it turned out to be, although it was a bit on the simplistic side. However, at the same time there was just something oddly familiar about the plot and storyline, something very reminiscent of something you'd see in movies back in the 1990s or thereabouts.And I must say that Megan Fox actually managed to impress me with her performance in Rogue, proving that she is actually more than just a pretty face. She actually handled herself well enough in a movie such as Rogue. Sure, you might have a hurdle to get over in terms of taking her serious in an action movie such as this, but give her a chance at least.The storyline was straight forward and easy to follow, although it was a bit generic and predictable. But it proved to be entertaining enough at least. The characters in the movie, however, were a bit bland, as most of them were lacking distinctive personalities, motivation and backstories. At times it felt like they were just an androgynous mass of characters milling about, one starting where the previous ended. So a bit more effort on the writing part prior to filming the movie would have been appreciated.The CGI in the movie was adequate, and the lion looked realistic enough in most of the scenes. That was something that the movie needed. Sure, there was room for improvement on the CGI effects, but at least they served their purpose well enough in bringing the lion to life on the screen.All in all, Rogue is a decent enough action thriller, but it is hardly a movie that you will watch more than once, given the simplicity of the storyline. My rating of the 2020 Rogue is a mediocre five out of ten stars. Watchable, but not an outstanding movie."}, {"id": 133, "text": "Hardened former soldier Samantha O'Hara (Megan Fox) leads a group of mercenaries on a mission to rescue a governor's daughter kidnapped by terrorists in remote Africa. It goes badly when their helicopter is shot down. With their escape cut off and low on ammunition, they jump off a cliff, get battered in a river, encounter dangerous wildlife, and stumble upon an abandoned lion farm which had its lions escape two day earlier.At first, I thought Megan Fox would be the toughest hurdle. Let's be clear. It's odd to have her play a hard-edge military type. I try to go with it but the lion farm is the more formidable barrier. It's way too convenient and weirdly bad. I'm guessing somebody wants to make a point about lion farms. It would have been much better to go with a pride of wild lions stalking the group. The crocodile is great. This would be a fun horror adventure if they're being pursued by lions. The CGI lions look bad anyways. Also, there is plenty of room under the car for the lion to squeeze under. Megan should be fighting her off with a big knife because the scene doesn't make sense otherwise. There are other annoying little things. The girls are the annoying standard victims who do little more than screaming and arguing. It's odd that this group is led by a new action woman and yet they have the pathetically weak girl victim characters. Instead of crying about one of their rescuer getting killed, grab his gun and shoot back. It's an odd old style B-action movie with a couple of ill-fitting new concepts."}, {"id": 134, "text": "The writer/director MJ Bassett deserves some credit for dealing with the important issue of animal poaching (and human trafficking??) however everything else in this movie is childish, unprofessional and down-right laughable.Nothing in this movie works, the locations, the photography, the acting, the script, it is all if it was a yearly project of high-school film club. One frame there are 5 soldiers in a Jeep and the next there are 20 on the ground. People jump from a cliff and the next cut they go into the water from what clearly is a 2 meter jump, etc etc. Megan Fox is pretty as a flower but her wearing army boots and leading a bunch of mercenaries just doesn't work. Speaking of mercenaries, maybe to be more believable they should not act like little kids; or maybe, you say, they saved on acting talent so they can invest in good CGI and makeup effect? spoiler alert - not a chance. The CGI is one of the worst I've seen in a while.The media that this movie is recorded on should be erased and reused to create some good movie about animal poaching and mercenaries, hopefully by someone who holds a higher bar than the Bassett family. Exact score: 42 / 100"}, {"id": 135, "text": "Rogue is a new action thriller directed, written and produced in part by M.J. Bassett, the director of Solomon Kane and Silent Hill: Revelation.In the film, a squad of mercenaries led by Captain Samantha O'Hara (Megan Fox) is on a mission in a remote African area to save the governor's daughter from a group of rebels. When their escape plan fails, the team becomes trapped in an unfamiliar area with the rebellious group after them, and later they also discover they are dealing with a hostile lioness.Director M.J. Bassett had withdrawn from directing episodes of TV series since directing Silent Hill: Revelation, as her last film was poorly received. With this film she tries to make a comeback as a film director with the help of her daughter. Unfortunately, this film is disappointing again. This film was also intended as a passion project of mother and daughter to show how bad the husbandry of African wild animals is and that it must stop.The story of the film quickly resembles a simple copy of the story of the Arnold Schwarzenegger film Predator from 1987. In contrast to this film, Rogue has hardly any character build-up, so you as a viewer care little about the characters. M.J. Bassett also filmed the action scenes very movingly, so you do not get clear what is happening and characters sometimes seem to die just like that.The special effects are also poorly done in the movie. The lioness is fully portrayed in the second half of the film, but the bad, unrealistic effects make the animal not really scary. Sometimes the lioness even comes across so unrealistic that you can actually laugh about it more. Most of the fire from the explosions in the movie doesn't come across as believable either, and if someone is hit by a bullet from a distance, you'll only see a simple red spot appear on the character.Thanks to the simple script and lack of character construction, the acting is not very visible either. Megan Fox co-played supporting roles in her other films and later more minor roles. With this movie she also seems to be trying to make a comeback as an actress, but this is not done successfully in this movie either. Among the muscular men with camouflage ink or bloody wounds, she doesn't come across as the leader of the team seriously, as she only gets a small scratch above her eye for much of the film."}, {"id": 136, "text": "M. J. Bassett, a director whose best work was also her first (Deathwatch, Wilderness), adds a new film to her portfolio after 7 years of directing only TV episodes. Rogue is a typical, uninspired and problematic thriller, with an (for such a character) unlikely lead actress and the recently more screen-active Megan Fox. Compiled almost entirely of ever-used blueprints &amp; flawed in the execution of it all, Rogue offers very little with any weight, even though its presenting serious issues like animal abuse and human trafficking.The intro leading up to the title screen already functions well as a sample that gives a pretty clear idea of what the next 95 minutes will be like - mighty cliché script architecture, dull action sequences, iffy cgi and creature design, cheap comedy, stereotypical and hardly likeable characters, but... Cinematography's decent, which puts the half-cooked cgi in even more shameful position, and acting's allright, I suppose, though it's hard to tell with all these cardboard characters. Megan Fox portrays Samantha O'Hara, an experienced and tough leader of the kind of mercenary gang you've seen in many 'guy flicks' before. Megan Fox, being in the outfit that otherwise has always went on a heroic, skillful and muscular guy with some one-liners in the back pocket, is about the only thing that's not typical about Rogue. The team of mercenaries spend the first act realizing their action-packed mission to rescue hostages, after which everything goes wrong, leading us into a draggy second act, featuring loads of predictabilities, exposition and too long night sequences. Rogue really struggles to generate any suspense, and most of action/kills play out in ineffective and highly foreseeable ways. Throughout the movie, the team of heroes is hunted by a ruthless local gang and later by a couple unintimidating cgi lions, eventually resulting in an underwhelming and empy-feeling third act or climax, topped off with an ending that surprises no one. The main message is received loud and clear, it's wholly agreeable and has to be supported. It's just a shame it's given to us via such an oversimplified screenplay.It really feels, looks and plays out like many guy's flicks, the VOD, straight-to-DVD, B kind. Same elements over and over again. Rogue, clocking in at 105 minutes, feels very stretchy, so stretchy that I believe one could go out of the room for 15 minutes, come back, and still fully understand what's going on in the movie. If you are interested in seeing Megan Fox (in a role as multidimensional as a cucumber), or creature features, or adventure flicks set in Africa, check it out, at your own risk. My rating: 3/10."}], "reviews_amount": 137}