{"name": "Leyla Everlasting", "titleId": "tt11792734", "reviews": [{"id": 0, "text": "He is one of most appreciated actor for me, also Demet Akbag... I finished the movie for them... unfortunately i'm so disappointed too much in this movie... Maybe, I excepted too much after haven seen their names... I love them, so, why I've given 2 stars ..."}, {"id": 1, "text": "As an actor and actress Haluk Bilginer and Demet Akbag are the pioneer stars of their genres in Turkey. Ezel Akay unfortunately legated their worst job at the same time both of them. I sensed that he couldn't tie the script up as an all. All the crew in movie probably trusted him. It was a a shame for filmographic past who has a past like Ezel."}, {"id": 2, "text": "I never laughed even though I forced myself over and over. Uncle's fall scene and songs are annoying. It was the most ridiculousTurkish movie I've watched in my life"}, {"id": 3, "text": "This movie is a complete disaster, true dissappointment."}, {"id": 4, "text": "Ben boyle rezil bir senaryo gormedim. Haluk BILGINER disinda tam bir vakit kaybi. Turk yapimlari adina da bir utanc kaynagi.I have never seen such an outrageous script. Except for Haluk BILGINER, it's a complete waste of time. It is also a source of shame for Turkish productions."}, {"id": 5, "text": "A movie that excited the cast but disappointed with its content"}, {"id": 6, "text": "I hadn't had an idea about the people's thoughts and comments on the movie until I finished watching it. When I saw the low rates, I got surprised. What do people expect from an absurd comedy? I liked the acting, the characters, mythological elements. It was good for me to escape from the reality."}, {"id": 7, "text": "Two powerful actors Haluk Bilginer and Demet Akbag are spoiled in this so-called comedy. The film does not fit to any genre but just can be defined as nonsense."}, {"id": 8, "text": "WASTE OF TIME. ONE OF THE WORST FILM EVER. DON'T WASTE YOUR TIME."}, {"id": 9, "text": "I don't consider myself a pro on Turkish cinema although I've seen many. However this was by far the worst thing I've ever watched in my entire life (I am 50 by the way) Neither acting nor casting has least to say. Hence, it was eye-burning! I'd strongly recommend to turn the source off if you coincide with it."}, {"id": 10, "text": "We could complete to watch the movie in 3 different times. It was hard."}, {"id": 11, "text": "The movie was so impressive but unfortunately most of the people couldn't see the subtle messages. It's not a simple comedy but it is a kind of masterpiece. The performances of the cast were pretty good. The ones who didn't like this movie don't understand literature and art at all."}, {"id": 12, "text": "It is not usual but not bad! I liked it specially musical parts👍😀"}, {"id": 13, "text": "It's not as bad as they made it to be. Movie has its' unique style of telling it. It was good nevertheless. I can see how Turkish people might have missed the deeper meanings, the fun in the way the story was told etc... Just keepin it short. I think it's worth watching plus it's at least 7/10. The story is good too. Makes you think and also gives out some strong messages throughout which are especially should be given at this point in Turkey."}, {"id": 14, "text": "Waste of time and disappointing. Haluk Bilginer shouldnt have been in this movie"}, {"id": 15, "text": "This movie is a failed attempt to create a warm and entertaining atmosphere with many shades of orange. The way the scenes follow one another makes you feel exhausted by the time the movie ends. I would gladly watch a two-hour movie in which Haluk Bilginer and Demet Akbag would just sit and talk across a table with a Galata view on the background. Any point for the conversation would do because both of them are so talented and experienced that only recording them with a smart phone camera (even recording vertically) while they are chatting would do fine for most viewers."}, {"id": 16, "text": "A movie that disappoints those who are hoping to watch a Recep Ivedik movie. 9 Kere Leyla is a very entertaining comedy that actually questions the insatiability of the human being. The unique characters created by Ezel Akay using mythological references are presented with magnificent visuality. It turns out to be an extremely enjoyable movie to watch."}, {"id": 17, "text": "So colourful, such fun. One should leave aside the prejudice of expectations from the cast and concentrate on the director: The wonderful Ezel Akay. This film is just him: dancing colours, music, exaggerated characters, picturesque scenes, very intelligent play on words and great respected cast just as in Karagoz Hacivat and Firuze. Loved the work. Every scene can be transferred into a tableau . Just the enjoyment I needed towards the end of a miserable year. Thanks"}, {"id": 18, "text": "This is about a message, watch until the end to understand the movie. New characters roles for the actors and they did really well. Something different. It talks about real issues that the world faces but it Is up to the viewer to understand"}, {"id": 19, "text": "This is a different kind of movie, this cast could make a mediocre standard turkish comedy movie but they wanna try something different and out of the box. There are so many hidden messages. It is an adoption from a play with some musical elements. I know it is an unusual comedy movie for the turkish audience but it had to be done. Turks are great with the drama stuff, we love the pain and we can really show it on the screen but when it comes to comedy we are not that good. Always the same comedy elements, curses, fart jokes,poor scripts... This movie should be a beginning for turkish comedy. We need more of this. Don't get me wrong you don't have to like this movie but you should respect the effort and thought put into it. If you don't like it go watch Recep Ivedik or something, don't come here and hate on it."}, {"id": 20, "text": "I reviewed all the user reviews and found out that they are all written by angry men.. However this is a fine comedy and it must be critisized according to its cinematographic value which i found high."}, {"id": 21, "text": "It seems that some people are commenting on social media with the aim of downvoting the film without any reason, and it is not surprising that all the people who were not satisfied were together! They have given same points and messages! The film was very spectacular and had a deep message that was depicted with beautiful metaphors. plays were great... Thanks to the creators and actors."}, {"id": 22, "text": "It was an unnecessary movie that excited me with its cast but disappointed me with its script and content."}, {"id": 23, "text": "We are faced with the worst movie in Turkish cinema history. I can't imagine how a magnificent actress like Demet Akbag was persuaded to take part in such a bad production."}, {"id": 24, "text": "Watch for a message!!! The quality of the movie and the actors were absolutely great."}, {"id": 25, "text": "I held my expectations high when I saw the cast, but so very disappointed. No plot, no comedy, no quality just exaggerated characters just as you would see in a cheap TV series. Not recommended and very disappointed for Haluk Bilginer after a masterpiece such as Persona."}, {"id": 26, "text": "The auction scene in the start summarizes the purpose of this film: to create a budget for a remarkable cinema.  This can only be the explanation wasting our time..."}, {"id": 27, "text": "Very good movie with powerful messages. Don't pay attention to bad reviews. Maybe they don't understand the movie. It is really really good. And the actors are amazing... Specially Elcin. Very nice job"}, {"id": 28, "text": "I enjoyed the movie. Acting was great! I loved the atmosphere and the world that was created for the movie using paintings, art objects, vibrant-feminine colors...etc. Usually I don't like direct, didactic messages in the movies. This movie has some through the end which may be unnecessary... The music and singing was not great. But, overall it's a fair movie that deserves attention!"}, {"id": 29, "text": "Very interesting and exciting amazing comic the film 2020"}, {"id": 30, "text": "This movie was shoot for theaters but with saloon bans during pandemic copyright acquisition happened by Netflix. Sorry for Ezel Akay because this one is his worst movie without hesitation. Demet Akbag and Haluk Bilginer put a big effort to save the spinning scenario but the conclusion is unsatisfactory. Post Production and Visual Effects are failing as a undeniable fact. Watch only if you have free time and you can skip the songs' scenes where you would be disappointed as well."}, {"id": 31, "text": "I tried to tolerate and finish it but every 10 minutes it is repeating itself. So I quit at the middleNo fun, musical like scenes are so bad at some point you suprised how bad they were.I come here to warn people not to waste time."}, {"id": 32, "text": "Mr. Bilinger gives another great performance. Loved him in Masom (on Netflix) and this movie shows his versatility."}, {"id": 33, "text": "One reviewer described 9 Kere Leyla (Leyla Everlasting) as nonsense! Knowing a little about black comedy would help!"}, {"id": 34, "text": "I'm really surprised. Mrs. Demet and Mr. Haluk, this time you dropped the cheetah a little.I didn't laugh at any point in the movie. I could not connect with any character. What was this movie? Is it comedy? Is it an adventure? Is it mystery? Long minutes that I couldn't understand and stared at the screen pointlessly.The only good thing in the movie (ignoring the names of Haluk and Demet) is definitely the locations and the visuals!"}, {"id": 35, "text": "ABICIM, KOSKOCA HALUK BILGINER, DEMET AKBAG, FIRAT TANIS DIYOSUNUZ. SIZLERI KIM GAZA GETIRIP BU FILMDE OYNATTI ? HERHANGI BIR KONUSU, MANTIGI, AMACI OLMAYAN FILMI NE DIYE KABUL ETTINIZ? GUNLERCE MEDYADA, TVDE, INTERNETTE REKLAMA BOGDUNUZ BIZLERI, BU REZILLIGI IZLETMEYE UTANMADINIZ MI?FILM ELESTIRILIR GECILIR AMA BU REZILLIKTEKI FILMDE BU KALITEDEKI OYUNCULARIN OYNAMASI YILLARCA UNUTULMAZ, BUNDAN SONRA O OYUNCULARA DA ESKI GOZLE BAKILMAZ.YAZIK ETTINIZ KENDINIZE."}, {"id": 36, "text": "Demet akbag and haluk bilginer was perfect as always .."}, {"id": 37, "text": "The reason i gave 1 star is that the movie is really bad there are 9 musical things in total and that is a lot for a movie the players are good but when it comes to movie yolu don't want to watch it yok watch 10-20 minutes and pow a music comes out of nowhere"}, {"id": 38, "text": "Me encantó la película por su mensaje y la forma de tratarlo en clave de humor. Los actores de 10."}, {"id": 39, "text": "Thank you to the creators and actors of this film - farce, mystery, pamphlet - for the originality of the genre, the beauty and ease of presentation of a complex mythological narrative. Man and woman, angel and demon, good and evil have existed as antipodes since the creation of the world. The film is another attempt to get to the heart of this centuries-old confrontation and reflect on the role and position of women in the modern world."}, {"id": 40, "text": "Just started the movie and narration at the beginning is very good Glad someone speaks so openly about violence against women.What I can say before I watch it this is not the movie for shallow people."}, {"id": 41, "text": "Awfull screen play, horrible acting, waste of time...a cheap try of Jean-Pierre Jeunet movies...a bloody nightmare...+ it is time for Demet Akbag to have some rest. She is like in every Turkish movie in recent years with similar characters..."}, {"id": 42, "text": "Music, scenes, colors, and the story... it was an amazing art, and I learned something very new thanks to this movie. For the ones who don't like, go watch Recep Ivedik, Guldur Guldur..."}, {"id": 43, "text": "Turkish people did not understand this movie. The film contains very beautiful metaphors"}, {"id": 44, "text": "This so-called 'movie' is almost an attempt at sabotaging the commercial success and critical praise that high-quality, hard hitting Turkish productions have enjoyed in Netflix. It is really sad to see that an actor of Haluk Bilginer's caliber actually chose to be a part of this utter embarrasment."}, {"id": 45, "text": "It has become an extremely high quality movie with its script, acting and all the messages it gives. My expectation was already high and met. Thank you for everyone who has contributed."}, {"id": 46, "text": "They are very good actors all of them, it's just not funny and looks like they tried really hard to be funny, shame!"}, {"id": 47, "text": "It's not a movie like I expected. Haluk Bilginer and Demet Akbag are the best actor and actrist in turkey. also I never laughed."}, {"id": 48, "text": "Those who think that it was a cheap cinema re totally wrong. Actually I liked it. This was not just a movie. It was a metaphor with its deep philosophy 👍"}, {"id": 49, "text": "We have another great production from Haluk Bilginer, Demet Akbag and Elcin Sangu. A delicately crafted visual feast that demonstrates the falsehood that Lilith is always portrayed as evil, with concrete examples. Everyone should watch. Thanks!"}, {"id": 50, "text": "It is a film which had been lynched in turkish way. It is watched even only performers. When u watch it, you will see that it has been wronged by turkish users."}, {"id": 51, "text": "I don't know what the producer, director and the actors/actresses were thinking"}, {"id": 52, "text": "How a bad film with this amazing cast. Huge disappointment."}, {"id": 53, "text": "Acting, music, colours, songs, message and story telling are first class however the story itself is so poor."}, {"id": 54, "text": "Impossible to watch , i think actors and actresses are kept and performed by force."}, {"id": 55, "text": "A very strong example to show how an actor destroys all his career...Haluk Bilginer should be more selective on scenarios."}, {"id": 56, "text": "It is a mediocre movie with a poor comedy aspect. The cast is very good but cannot reflect the subject. Relationships between men and women, marriage, betrayal, a different perspective on women and the forbidden apple. If you expect, the result is disappointing."}, {"id": 57, "text": "Beautiful movie with a great message . The actors were superb specially Elcin Sangu. Hoping to see other great movies ."}, {"id": 58, "text": "Just watched Ethos. I was very proud of the Turkish cinema. Watched Winter Sleep, Ahlat Agaci, 7 numarali Kogus. Wonderful movies, series with great messages. Watched Yol. Amazing. From Yilmaz Guney to Nuri Bilge Ceylan and many talented directors and actors were impressive. Then decided to watch 9 Kere Leyla because of the very talented actors and actresses. It was a disappointment. 2 hours with no social message, no personality, no script and no directing. Why? Why waste so many talents? Creativity was frozen and forgotten. Cinematography was horrible. Actors had no clue what was going on. Looked like they had fun between themselves. But remember, movies are made for movie lovers. Just watch great movies like The Parasite and learn how to make movies, again. Bottom line: don't waste your time. Just watch one of the good Turkish movies, again."}, {"id": 59, "text": "To understand need sense of humor. Excellent. You must watch what ever all say"}, {"id": 60, "text": "I even don't want to talk about it. I don't want to write something about it.It is not absurd,not fantastic.It is nothing.Don't waste your time."}, {"id": 61, "text": "A movie enjoyed with mythological and philosophical references and cleverly placed details. The film tries to answer the question of why men kill women. Is it because she doesn't love him, because she loves him, because she loves someone else? This is a story that goes back to the creation of man and woman, which is the beginning of everything. what lilith (leyla) says; We were created from the same clay as Adam. It is emphasized that masculinity is not a matter of gender but a matter of mentality, referring to patriarchy. Otherwise, there is no distinction between the human sex as masculinity and femininity, they were created equal. The fact that one of the men who came across Adam after he passed out is a 'man in wife', the sister of Khidr always shows us the indifference between male and female."}, {"id": 62, "text": "Anyone who doesnt understand this movie is probably illiterate."}, {"id": 63, "text": "I wasn't going to talk about this movie because you know there's nothing to talk about:D don't watch and don't make people watch and it's seems like they wanted to make a sitcom show and then they changed their mind and made this movie in a few days:D"}, {"id": 64, "text": "Sadly disappointing, it was one of the worst movies i have ever seen. Haluk Bilginer and Demek Akbag are both very good actor and actress, but I feel sorry for both of them in this movie. When the director is Ezel Akay, unfortunately, such a movie comes out. I am sorry for Haluk Bilginer and Demet Akbag"}, {"id": 65, "text": "I can't believe that I watch this trash for 20 minutes."}, {"id": 66, "text": "We watched the movie with very high expectations seeing Haluk Bilginer and Demet Akbag in the cast. The movie was so lame that even these 2 great stars could not save the movie. I forced myself not to turn it off and finished it. Some comments mentioned that the ones did not like the movie, doesnt understand it. I dont agree those comments. This is not Interstellar. Its a simple scenario with some shallow messages. As a summary: Watching my washing machine would make more sense instead of this movie"}, {"id": 67, "text": "The film is Arthouse, but like all Ezel's films, Akai is colorful and musical like vaudeville. I really liked the message of the film and the final scene. Recommend."}, {"id": 68, "text": "I was excited about the film. For the first few minutes i was waiting to see something worth spending time. For the sake of Haluk Bilginer, Demet Akbag is in and also being a Netflix film waited for a while but i couldn't stand more after 25 minutes. That was totally waste of time. Neither jokes nor the story wasn't worth to watch. Sorry guys i love you but, what was that?"}, {"id": 69, "text": "It was a movie that tried to be extraordinary. We watched it without getting bored and had fun, but still it doesn't appeal to everyone A better movie could come out of this cast."}, {"id": 70, "text": "Watched it solely because the legendary actors, but was a disappointment. Scenario is nonsense and many scenes as well."}, {"id": 71, "text": "The film was soo boring i couldnt stand more than 20 minutes. Despite the casting it is waste of time. Its one of worst film i have ever watched."}, {"id": 72, "text": "If you know and love meaning of Dante and if you ever say 'who i am' 'why i am here' in your life it s time to look hole in the wall. So you have to watch it!! Otherwise you can't understand what they are talking about. It may comes to you ridiculous."}, {"id": 73, "text": "Very good job !!! I enjoyed the movie. The acting was great! Pictures, art objects, vibrant-feminine colors ... etc. I loved the atmosphere and world that was created for the movie. Congratulations Ezra Akay :)"}, {"id": 74, "text": "Lucky that movie theatres are closed, otherwise would've been waste of both time and money..second star is only for the cast , nothing to do with movie itself,"}, {"id": 75, "text": "Why are people so harsh when they see a different style? Absurd storytelling isn't something bad,it's just a different style. Yes,it was sometimes hard to watch,but it was like theather for me.I loved the acting and the colors. I loved the message and the history added. I think people will appreciate it more in thefuture. There are films we watch as we grow old or grow up and think it's nonsense,but then we experience stuff in life and we start to understand those films in a different way. ....spoiler.... . . .I loved the plot twist where they show us who Lilith actually was. In the first scene I thought I heard Demet Akbag's (Leyla's) voice under Elcin Sangu's (Nergis'),as she was speaking."}, {"id": 76, "text": "Advice from me. Don't watch! I watched for Haluk Bilginer and Demet Avgar but It was disappointment. You shouldn't never watch it."}, {"id": 77, "text": "After the release of the film 9 Times Leyla, which attracted great attention with its cast of master actors, the negative comments and the meaninglessness of the subject matter were insistently mentioned. I can say that there are many reasons for this and that the comments are generally criticized as empty or even 'childish' content by not making a connection with the subject, people who are far from mythology and literature (hence the community without interest) cannot establish a connection with the film. As usual, most of the criticisms made in our country were insulting and insulting rather than being constructive, and perhaps even caused the people who might be interested to block their way. I want to make it clear now that I will speak by generalizing, because the small portion that remains does not even need to take over what I am going to say. As a society, we are lazy of thinking, commenting, wondering, and often researching, creating an atmosphere that people can say unnecessary. The movie 9 Times Leyla is a rich aesthetic-visual and auditory film that we can call black-humor based on the mythological character Lilith. While the whole world knows Adam Eve as a whole and the first love, Lilithi, who has always been forgotten among us, has always been denigrated and never made her feelings, no one can empathize with her, and in essence, the first wife of Adam, Lilithi shows us his experiences and how strong character he has shows. Lilith, who developed with her life experiences, has been with us since the existence of the land. He is constantly in search of his inner world and wants to find the faithful, ethics. We can say Lilith's guilty charm, which is why she has the air of causing a lot of trouble and curse on the opposite sex. While the way he advocates love, his way of owning it, has historically called Lilith the evil and evil one, we know Eve in most places as the one who desperately desires for her love and has been with Adam from the beginning. While no one makes Lilith's voice heard anywhere in the world and calls her evil, 9 Times Leyla movie shows us exactly the psychology of Lilith and how she wanted to be crushed, her feelings and the sense of ownership and dedication she needed. At the same time, the soundtrack of the movie, which is far from details and absurd to many of you, and the fact that Adam turns to his inner world with every attempt to kill Leyla, and his musical accompaniment to court with the Adam in his head, shows us how incoherent Adam is and how foolish he is. It almost does not have its own self-determination, it is dragged from right to left like a blind chicken in constant search. In addition to these, the decor details we see in the movie should not be overlooked. In most scenes, the forbidden apples, which are not separated from us, are highly suppressed, especially in the sex scenes. When Adam, who is called the original sin, eats the forbidden apple as a result of his disobedience to God causes him to be removed from the Garden of Eden. In the movie, Adam's infidelity to Leyla ultimately leaves him to die and moves away from his wonderful home, which is the Garden of Eden, and his new home is now hell. Unlike the apple object, the paintings in Adam's house also attract attention. For example; The Lilith painting made by John Collier in 1887 is one of the most known. Maybe we can come across detailed comparisons and personality traits about other characters that can be interpreted more if watched carefully. For now, I wanted to make a brief evaluation about what I first felt and know about the movie. Considering all these evaluations, I want to say health to everyone who has contributed and devoted to this work. In my opinion, it was a magnificently prepared movie and even the small details were told without missing. Turkey also increased to such films, and we wish more likely to become art."}, {"id": 78, "text": "The message is not directly given in the movie. That's why today's audience is not able to reveal the idea/thoughts at first glance which let them to be annoyed with the movie."}, {"id": 79, "text": "An absurd comedy? If sso .. failed heavily. Watch it if you again want to see how good Haluk Bilginer acts anyway.. The rest is a real fuss -"}, {"id": 80, "text": "A really bad movie, despite amazing actors and actresses it is still too bad to watch"}, {"id": 81, "text": "Keep away yourself, your friends, your childs, your nephews, and all your families from this movie. Totaly TRASH"}, {"id": 82, "text": "It is a gift to make such a bad movie with so powerful players.The entire movie is disturbing and the way of social message at the end of the movie is weird"}, {"id": 83, "text": "A total waste of time and a complete disappointment.. do not mislead with the famous cast; as both the movie and the acting are ahorrible!!"}, {"id": 84, "text": "It is ... unfortunately. Haluk Bilginer is one of the most competent actors of the Turkish cinema, having achieved the first and only Emmy reward. He was awesome in the mini series Persona. He used to be terrific in all genres, but I really do not understand howcome he accepted to have a leading role in such a ridiculous scenario. I can say almost the same for Demet Akbag, so it is a pity to see these outstanding names in such a movie, which I can describe as less than mediocre. I am simply disappointed."}, {"id": 85, "text": "In normal conditions, I never leave my living room during a movie screening. But this time, due to the disgrace that the movie made me feel I think, I desperately needed to leave my own living room. Most probably, if it had ben shown in a theatre, I would have left the theatre also but even I wasn't expecting to revolt against a movie so much from my self."}, {"id": 86, "text": "I felt attacked by this quote in the movie if man can not find a women to kill,they kill themselves or each other. It is disgusting that some crazy men slaughter or hurt women but there are also other men protecting women. We are all not the same. I'm very disappointed. Amazing actors but devastating script."}, {"id": 87, "text": "The actors are good, good at director. this story could be written better"}, {"id": 88, "text": "Ezel Akay is a talented director. It is difficult to understand that why he chose this script? You can watch this film if you are a fan of Haluk Bilginer. Otherwise it is boring."}, {"id": 89, "text": "It's so bad, im sorry :( This movie look like simple magic movie."}, {"id": 90, "text": "There are only two talented directors in Turkey who can make a good comedy. These are Ezel Akai - Ezop and Cem Yilmaz. Leyla Everlasting is a comedy of the absurd, with a mystical flavor and a social connotation - no matter how good a wife is, a man is always looking for another woman, justifying himself with childhood trauma. Exceptional acting presence - Haluk Bilginer, Firat Tanush, Demet Akbag, Elchin Sangu. Very good songs. Haluk Bilginer is the first Turkish actor to receive the EMMI Award in the United States for Best Actor 2019. It is good that this comedy is broadcast by Netflix so that moviegoers from all over the world can enjoy talented actors."}, {"id": 91, "text": "I had high hopes because Haluk Bilginer was the star in the movie. However, the film was so terrible that I just only conclude the movie because I want to see how ridicuolus it could get. But on the bright side, I really like the camera shoots, the colors and the background pictures were amazing. Overall, it is a waste of time to watch and there are many great movies that Ezel Akay directed. I suggest watch his other movies rather than this one."}, {"id": 92, "text": "Although its only purpose was to give a message, it was a film full of nonsense under the name of comedy, which made it nauseating and stupid effect of a carousel which kept too long as if explaining to an idiot in the finale."}, {"id": 93, "text": "This is worst movie i ever watched. Waste of time. I watched for Haluk Bilginer and Demet Akbag."}, {"id": 94, "text": "I was not able to finish. Can i sue them for my wasted time?"}, {"id": 95, "text": "The trailer was everywhere before the movie came out and as I saw Demet Akbag and Haluk Bilginer, I said Alright, it's a must-watch although trailer was screaming NO. Now, in the 36th second of the movie and I paused; couldn't take it anymore. It's hard to find a reason why an Emmy-winner-greatest-of-the-great-actor Haluk Bilginer accepted this movie. Creating a Netflix atmosphere won't make a good movie. There is no need to talk about storyline, acting, etc etc.. It is beyond boring. It is what is that i am watching right now?! boring. Don't even think about watching it. Now just a waste of your time, but also a waste of anger and disappointment."}, {"id": 96, "text": "This movie follows the footsteps of infamously boring and non-sensical Turkish comedies of yesteryear such as Hirsiz Var! (2005) and Mumya firarda (2002). Another miss for Netflix. Avoid at all costs."}, {"id": 97, "text": "I've never watched so boring movie like this. don't watch and read a book i think its it the best for your."}, {"id": 98, "text": "112 min's of disappointment. Beautiful cast , horrible story telling. Demet and Haluk yall just way better than this movie. Sorry for the bad credit but I just watched the entire movie like ' When this movie going to finish so I watch something else'"}, {"id": 99, "text": "I am really sorry to give this point. And I am so sorry to see Haluk Bilginer in this movie. They choose a good mythology topic, than screw up."}, {"id": 100, "text": "I watched this movie as a result of my respect to Haluk Bilginer. Everything from scenario to acting sucks. Huge disappointment"}, {"id": 101, "text": "Since one of the characters is so obssessed with 2s, I guess it's the score this unfunny cringefest deserves."}, {"id": 102, "text": "I forced myself to watch until the end but most of my friends could not.. maybe worth 3/10 but I gave 1 to reduce the rating.."}, {"id": 103, "text": "Hayatimda gordugum en kotu film olabilir. Omrumden 1 saat 52 dakika caldi.It may be worst movie I have ever seen. It stole 1 hour and 52 minutes form my life."}, {"id": 104, "text": "A little too much for the Turkish audience. Unfortunately, I think it's one of those movies that we can't always call domestic productions and watch."}, {"id": 105, "text": "The name Ezel Akay (Ezop), places on the top lines of creative cinema lists thanks to his muchly peculiar cinematic langue. Most of his movies have been mentioned within golden works of Turkey Cinema. But unfortunately this last movie is too far away from responding to any audience expectation based on Ezel Akay cinematography.Although the movie evokes the cinematic grammar of Neredesin Firuze (one of Akay's previous successfull works) it fails to catch enough dynamic mood which Neredesin Firuze significantly presented and 9 Kere Leyla tries to perform.-. Inadequate links between mythological significations and political discourse and-. failing repetitive jokes which dominate and vanish sub-contentscould be encounted as main major problems."}, {"id": 106, "text": "It is probably not the best movie you've ever seen but it is a story you've already read. Apart from its social message poorly imposed, the movie contains lots of elements one can find very interesting unless the audience gets bored with old-school storytelling. If you enjoy finding elements of different fine arts in one form, you should definitely see the movie.Take a look at other reviews, they will tell you that it was disappointing. This is not a silly comment but missing the fact that works created in the Middle East, unfortunately, have huge responsibilities besides their artistic value. In my humble opinion, Ezop would be more free and watchable in his art if he doesn't have to imply deep social messages in 2020.So please watch and enjoy the movie, and try to catch the humor without getting annoyed with the sketchiness of its social message. But remember, you can always appreciate an idea even hated the expression of it."}], "reviews_amount": 107}