{"name": "The Babysitter: Killer Queen", "titleId": "tt11024272", "reviews": [{"id": 0, "text": "This is a great follow up, this film like the first is full of great one liners, and the murders are just as amusing. The characters/cast are fun and enjoyable. You really get the feeling everyone is having a great time on set. Would recommend people to check it out if your looking for a bit of fun and nothing serious."}, {"id": 1, "text": "This movie was just straight up hilarious. It never got like it was getting boring or going to fast. If you liked the first one you're definitely gonna enjoy this one, maybe even more. The characters were hilarious to watch even if they had little screen time but overall one of the few Netflix movies that feels like it's done well even for a sequel."}, {"id": 2, "text": "Not as good as the first one, but fun enough and enjoyable. The ending saved the movie from being a disappointing sequel. I was surprised about the cast. But I don't want to spoil yet."}, {"id": 3, "text": "Why does this feel so different from the first? It's like they did a Scary Movie version... It's just full on nonsense."}, {"id": 4, "text": "Terminator was not the only film whose sequel was better, I loved Killer Queen more than the previous film.So, McG is back with his satanic cult gang, with a bang. The pure sequel, good storyline, entertaining, crazier, stupid, and Jenna Ortega is so pretty that I'm in love with her.Are you guys missing Samara Weaving right? Go watch this film asap."}, {"id": 5, "text": "The Babysitter was an underrated and guilty watch. This is the one you turn off after 15 minutes or never finish. It's cartoony, forced jokes, editing is horrible.. There's no reason this should've been made, since the first one was such a standalone. if you need a movie to fall asleep on, this is the one."}, {"id": 6, "text": "Its hilarious, gruesome, and fun as its predecessor with a bit of tweak. Cole Johnson is same as last time and casting is great for this genre of horror comedy.. A campy coming of age slasher horror that is entertaining and campy. The story is about the blood cult and this movie is deserved an instant cult following. It seems McG is direction is perfect for this kind of film. I believe this have double twist ending that you look out for..This deserved another sequel."}, {"id": 7, "text": "Cole becomes strong and independent by the end of the first movie but weak and scared by this movie. Melanie who was kind, spiritual, and in love with cole; Melanie is a killer and leading the new blood cult. The whole spin is outlandish."}, {"id": 8, "text": "This sequel's a vacuous disservice to the original. Unfunny drivel.The premise is nothing more than copycat, ripoff, stealing of superior, actually fun 1980's-90's movies &amp; then-network USA Up All Night movies. With a dash of mid-late 1990's Joss Whedon efforts. Ya know, when he still cared?DK, Tangerine Dream &amp; The Cramps selling out &amp; giving this flick permission to play their music is equally sinful."}, {"id": 9, "text": "Nobody asked for this movie. And what a mess! It has nothing to do with the original, it looks like a mix of Quentin Tarantino and Tim Burton, and not in a good way. It is unbelievable to see that the director of the two films is the same. Because the first is a good film, well shot and fun. This film, however, is one of the worst things I've ever seen. Well, I say I saw it, but the truth is that I skipped several parts, watched halfway and then I couldn't take it: I skipped to the finale to end my torment. I will simply pretend that this film does not exist from now on. Because the first one was really good."}, {"id": 10, "text": "The twist is such a spit in the face to fans of the first one, stay away from this movie if you like the first one, it is so bad, not only to people who critique movies, but also the average joe, who watched the first one and figured the second would be as good. WHO WROTE THIS MOVIE AND THOUGHT IT WAS GOOD?!?! WHO EVEN REVIEWED THE STORY AND TOLD THEM IT WAS GOOD?!?"}, {"id": 11, "text": "They have tainted the reputation of the first movie by this stupid,nonsense, and forced plot.Also, Samara Weaving is the real gem of the first one, but the mysterious, dark and interesting character is utterly betrayed and destroyed in this garbage.Melanie's transformation to the demon is like out of nowhere and stupid. Maybe, they did it to add the low effort plot twist and making an excuse to add the new girl. The whole plot is like a cheap copy of the original with everything happening the same again minus the good things which make the first one great."}, {"id": 12, "text": "I liked The Babysitter (2017) but this sequel I even could not finish - it is not funny, it is not creepy, and all in all the humor (just those scenes in the school. feel like the copy of a copy of a copy and than some copy more...) felt very shallow, stale and forced - but maybe I am not the right audience for The Babysitter: Killer Queen, and all those kids born after 2k will like it more. Anyway, more and more Netflix is for me a synonym or label for mass-products and bad entertainment."}, {"id": 13, "text": "This was totally disappointing. Instead of taking the good sides of the first movie, you got all the absurdities and bad things. What a pity."}, {"id": 14, "text": "I will pretend that this was never made. Two stars only because I got to see the characters again."}, {"id": 15, "text": "Netflix's best film in my opinion has dropped an incredible sequel that might just be better than the original. It keeps all the things you love about the first &amp; goes even crazier in this one! The addition of Jenna to the cast was a great casting choice. Her chemistry with Judah was perfect. I am so happy they utilised Andrew Bachelor more in this one because his comedic timing &amp; delivery is incredible. Giving Cole's dad (Ken Marino) more scenes was a nice touch too, brilliant comedy with Chris Wylde. Hana Mae Lee didn't get as much as I would've liked but still was great in what she had. Bella Thorne is so funny in this role, I loved her news reporting back story &amp; freak out! The deaths were so over the top it was just exactly what you want from this film! &amp; most importantly, Samara Weaving returns with a cameo at the end that truly pushed this film from an 8 to a 9. It was great to see her again &amp; a well kept secret of her return."}, {"id": 16, "text": "The first movie I loved, this second carry on was absolutely abysmal. I actually turned off towards the end as I treasure my time more than seeing this train wreck finish."}, {"id": 17, "text": "Loved it, the deaths were even more bloodier and killer in this sequel which made the movie even more entertaining. Samara Weaving does return in the movie, which made me very happy to see. Overall, I was very pleased by this movie, Shout out to the director and the one who made the soundtrack, music was just awesome. Recommend to anybody who is a horror movie fan and a fan of the first babysitter film. 10/10."}, {"id": 18, "text": "Such a good film! I absolutely loved it as much as I loved the first one. It's so funny, the characters are hilarious and the gore in this is intense but I loved it. The ending was amazing and definitely made so much more sense to me. Amazing movie. Definitely made for a nice distraction in today's crazy world."}, {"id": 19, "text": "I was a big fan of the original, so I was quite pleased and also a little apprehensive when I saw this sequel drop on Netflix. Turns out there was no need to worry.Very much in the same vein as the first; this film is good, gory fun that never takes itself seriously.The characters all have memorable personalities that add to the film...although Robbie Amell nearly steals the entire show as the shirtless king of 'Bro'.Perfect for a night in with a takeout and brain set in neutral."}, {"id": 20, "text": "Wow I feel like I should be compensated for watching this it is almost too bad to imagine. Not scary, not funny, not exciting ... not worth anyone's time. If I was on a plane, I'd rather watch the map with the plane moving over it. The first movie was a real treat, this is a punishment."}, {"id": 21, "text": "The Babysitter: Killer Queen - B- (Fair but not Better)The first one worked because the stakes were higher, a young kid followed by adults and then he takes them out HomeAlone style. This one was just Meh, eventhough I really like Samara Weaving and Judah Lewis. All deads are back, just to die again with more gore is not thinking out of the box. Also no stakes here, zombie or vampire or whatever they were didn't work.I thought, I was watching an episode of The Chilling Adventures of Sabrina. Bit of a let down from original but will pass the time."}, {"id": 22, "text": "Put a bunch of fanfic ideas on post-its, and just start shooting. This would be about what you get. Nonsense. Also several members of the cast seemed to struggle with forming coherent sentences."}, {"id": 23, "text": "Ok so this was #4 trending movie in India on Netflix. The pace is good but is purely made pf adolescents as some scenes are meh! The slasher parts are really good, cinematography is awesome but the movie has no plot. Its one of those movies you can just binge watch! Just remember : Dont use your brain :D"}, {"id": 24, "text": "A Netflix movie is never anything to be excited about, but sometimes you can be pleasantly surprised. The Babysitter was one of those sneaky surprise hits. Admittedly not a great movie by a long shot, but entertaining. Now this was just trying to hard to be 'relevant' and millennial friendly. FAILED on so many levels. Way to much CGI blood and gore and no real substance at all. Seriously what were they thinking. McG really needs to grow up, he is not as in touch with his audience as he thinks if this is what he considers to be entertainment."}, {"id": 25, "text": "I've watched the first Babysitter film maybe four times since it's release. Just great. I had high hopes for this, but it was just as bad a horror film as I've ever seen. Ludicrous. The first film had some really funny moments and there wasn't a wasted scene in the entire film. This one took FOREVER to get moving, and once it did, I couldn't have cared less. Not clever, not funny, just gruesome and stupid."}, {"id": 26, "text": "This film start with the flashbacks of the previous film, and the character of previous film Cole having therapy session scene! As turnout, this film is about Bee has a deal with the devil by using Cole's blood to eliminate all the blood cult member to save a female Phoebe! Entire film full of boring conversation, and annoying overuse scene! Such as, overuse of the quoting Terminator film scene, overuse of the tripping scene, overuse of the song playing at the background scene, overuse of the hallucinate scene, overuse of the character flashbacks scene, and overuse of the slow motion scene! Make the film unwatchable! Barely laughable scene is, Cole saving Allison by pull off her head! At the end, all the blood cult member including Bee been eliminated after drinking Cole's blood! Still have a post credit scene! The Book Of Devil found cover with sand! That's it! Another disappointed film!"}, {"id": 27, "text": "Was nothing compared to the first one but just like disney, netflix will push articles and reviews that tell basic people that they like it so it will trend for awhile and die off and nobody will ever talk about it again. I havent talked to a real person who really enjoyed it."}, {"id": 28, "text": "Fun in an old school kinda way lol. Don't look for an Oscar, just enjoy."}, {"id": 29, "text": "To be honest, I didn't liked The Babysitter very much as well, and this sequel goes far more miles ahead in dumbness.The Babysitter: Killer Queen feels like a fun movie but it isn't and it tries to make a stand like its predecessor, but it fails miserable. Try as it might, this second go will make you realize that some sequels are meant to suck.My Rating : 1.5/5"}, {"id": 30, "text": "Please do not watch it for your sake. Worst script and acting ever in Hollywood"}, {"id": 31, "text": "This movie is fun until the very end. I don't like the way they ended it. But anyway, this movie doesn't work on logic but it's a popcorn flick which doesn't take itself seriously and is self aware. It became a bit repetitive in the middel if you've watched the first part, but overall it's just a guilty pleasure to watch."}, {"id": 32, "text": "I kind of liked the first one. This one however is terrible. Super cheesy, lame jokes, awful writing, super predictable. I gave up after 15 mins which is 15 too long."}, {"id": 33, "text": "Just like its predecessor, The Babysitter: Killer Queen is a not so subtle and over the top horror/comedy. From absurd death scenes, an overabundance of fake blood and comical overacting, it has all the ingredients for a parody. The movie features all sorts of clichés as well, including a group of horny teenagers and even a secluded cabin at the end, and at times it is done well.The plot is quite generic, with our leading man, Cole (Judah Lewis), again finding himself hunted by a teenage killer cult. Horror movie sequels often thread on familiar ground, but seldom is a follow-up so similar to its predecessor. Again Cole flees, hooks up with a down-to-earth girl, and manages to take his adversaries out in grisly / ridiculous ways. A few problems I had were mainly related to some of the plot developments. One of these was that Melanie (played by a not so convincingly sadistic Emily Alyn Lind) was suddenly the bad guy without any character development leading up to that. Besides that, we did see the return of the previous movie's bad guys (Bella Thorne, Robbie Amell, Hana Mae Lee and Andrew Bachelor). They all died gruesome deaths in the previous movie, and yet have somehow been allowed to return. The explanation for this was given in a throwaway line. Now, I won't lie and say that these characters aren't probably the most amusing parts of the movie. All four are ridiculously over the top, which can either be amusing or annoying depending on one's taste. A special nod to Amell, who kept his weird but funny bromance with Cole going and even applauded him at several points. One last problem was the return of the previous main baddy, Bee (Samara Weaving), who was instead suddenly turned into a literal guardian angel. Her plan, which is absolutely ridiculous, had some major holes in it which everyone just glosses over. Also, Cole seems to have totally forgotten by the end how Bee had spent the previous movie trying to literally blow his brains out.For me, the best part about the movie were the interactions between leads Cole and Phoebe (played by a delightfully charming Jenna Ortega). These two had legitimate chemistry, and gave the otherwise totally insane movie some more grounded moments.All in all, it's a solid sequel which I enjoyed more than the original. The plot is the main problem, due to it being generic and nonsensical at times. The actors did a solid job, with Lewis, Ortega and Amell being the standouts in my opinion. Horror comedies are rarely cinematic gold, and should just be watched to amuse oneself. Now, this movie is definitely amusing, but I wouldn't go as far as to call it good."}, {"id": 34, "text": "It's 2017's The Babysitter with the overall brainlessness amped up and Samara Weaving's presence reduced to a mere cameo at the end. Most of McG's films are like extended music videos; this one seems no different. There's a lot of eye-candy, a plot that can never make sense, cliched character sketches, some silly twists, and a few bucketfuls of gore. The humor is patchy; you'll get a laugh or two out of the blue but for more than 75% of the film, you'll be desperately looking for some. I didn't quite enjoy the 2017 film and hence, I only found this to be a passable sequel."}, {"id": 35, "text": "There are some familiar faces and some new ones, Cole once again battles members of a Devil cult.I was unsure of the first film, but on second watch I enjoyed it, no second viewing was needed for this one, I loved it on first watch.This is very funny, it's full of shocks and surprises, it's entertaining from start to finish. The characters are once again utterly outrageous, and once again the guy with the muscles has his shirt off throughout.One of the best films I've seen on Netflix for a while, 8/10."}, {"id": 36, "text": "Not worth watching. Movie is really bad, comedy is pointless also writing just dont waste your time."}, {"id": 37, "text": "First was is a classic and fun horror teen comedy. This is just so bad in every aspect. Even the cast was honestly so mediocre in this sequel and they were all fantastic in the first. The script is lazy and takes itself too seriously to try and be funny. An interesting idea....and it got all mixed up within 20 mins."}, {"id": 38, "text": "Such a disappointment compared to the first one. The humor is lame. The story is lame. Everything about this movie is lame. The sequel just takes a huge dump on the greatness of the first one."}, {"id": 39, "text": "Loved the original ... but The Sequel is full of overacting - bad story - some parts are really very dumb - I think they ruined it ! The thrill is gone ! Could have been so much better !"}, {"id": 40, "text": "Woke, Pointless, Don't wast your time Life's to short."}, {"id": 41, "text": "This feels like a completely different franchise than the first. It's not clever, funny, or surprising like the first. It was cheesy and predictable.I didn't mind the ending so much. But the fact bee was hardly in the movie and then shows up a brand new person bothered me. We get one line of explanation you changed me that night or whatever the line was. A cheap copout to subvert expectations, although they really didn't because you could see that coming a mile away.He didn't really change her though, did he? She gave up her soul in the first place just to save Pheobe. Maybe it could've been that he reminded her of who she really was? Okay I know, I'm knit picking now. A better backstory to what made her give up her evil ways would've been appreciated.A lot bothered me about this movie. And even more made me cringe. I watched it all because I hate leaving a movie unfinished, but I didn't enjoy it. I felt the need to fast forward through certain parts. I'd say the first was a 7, and this one's right around a 3 for me"}, {"id": 42, "text": "There are no words for how truly despicable this garbage is. It's all mediocre. At one point I wanted to be killed off just like the characters. What utter failure of a movie."}, {"id": 43, "text": "If you liked the first one then definitely stay away from this one it ruins original. Even though the first was still a comedy the dark humour really worked I loved it. The 2nd they made it into a supernatural back from the dead that stupid you can barely watch. In fact it was that bad I had to skip most of it to the end couldn't bare to sit through it."}, {"id": 44, "text": "What do films suffer from this year? Terrible rewrites. Terrible sequences. Terrible acting. Everything had to be wrapped up so soon and it shows. This kind of reminds me of the sequel to Mortal Kombat. I was so stoked and yet here we are. Looks like I'll be watching the original for a while and pretending this never existed."}, {"id": 45, "text": "This movie tried too hard. It's got its moments and the gore, but ultimately tried to be so edgy. Sad."}, {"id": 46, "text": "This is one of the worse movies I have ever seen. All the actors are bad and the main character(s) are forgettable. The movie has no sense of pacing and plot and just goes for lol random moment. I made an account just to post this. DO NOT WATCH"}, {"id": 47, "text": "Loved the first one. This one is garbage. WTF?!? Did the studio give McG too much power?"}, {"id": 48, "text": "This movie is an utter piece of crap! Don't waste your time."}, {"id": 49, "text": "First movie was awesome. And this one started off pretty good..Even though nothing made any sense, it was still fun up until the end...Which is complete garbage. I mean ugh, yuck, gross. the big bad becomes nice for no reason and with no motivation to do so? What a steaming pile of..."}, {"id": 50, "text": "I mean, if you are watching this then you know what to expect with this film. It's a silly, slasher flick.Did I enjoy the first one? Meh, I found it alright. So the question is did I enjoy this one? Also it's a huge meh. The last one I was slightly taken back because I didn't expect it to be a silly kind of film, so watching this I knew (which helped) what to expect. To sum it up, I think it's a worthy sequel. It gave me a few giggles here and there, plot is ok and characters are likeable enough. To be honest there's nothing that the film excels in, it's just an easy brainless watch.What I will say is that you need to watch the first instalment, because you won't have a clue about what's going on in this one. But just don't expect a serious film, make sure you are watching this expecting a silly movie. And you will be fine. 6/10"}, {"id": 51, "text": "First off Amell is so funny. The script is better than I thought and for a horror film it was pretty good. But what made the movie great was the soundtrack."}, {"id": 52, "text": "Where the first one succeeded, the sequel failed. Babysitter 1 had paid genuine homage to pop culture and 80s movie nostalgia and fandom, and a intelligent script; Killer Queen leaned way too heavily on recycled jokes, references to 80s horror/movie references, cross-generational rivalry between zoomers and millenials, and using of the word bitch as often as your uncle steps outside for a smoke break at the family Christmas party. Judah Lewis stood out as a young actor with great potential in Babysitter 1, but in this one he seemed outperformed by both his awkward laugh over the delivery of his lines and busy cast list. Jenna Ortega's character seems injected for no reason other than to drive the sequal's plot, and cannot justify its existence, and not much more than a back door to connect Samara Weaving to the sequel. Pair this with her breathy speaking and melodramatic acting, and it becomes angsty and tired. Practical effects are used sparingly, but when they are they make the visuals look great...until the CGI ruins it. Overall, it's a true-to-the-first sequel, but does the first a disservice."}, {"id": 53, "text": "I liked the first one, it was comical in a way that it was bad but good if you understand..McG has done some very good movies in the past but this one, it's been rushed because the first one was so popular, so the script writing is poor this time around and doesn't have that grab effect to continue watching like the first one did..I would of given it at least 5 stars but the one thing that completely ruins it, is Bella Thorne, she is complete trash in this movie, her acting is borderline nauseating, how has she has got away with an acting career astonishes me, she tries so hard to be funny it's painful and embarrassing to watch because to put it bluntly, she can't act and she's not funny, not at all"}, {"id": 54, "text": "I have found this film really good constructed. The acting is good, and the direction is superb. For the common public, 9/10 rate is deserved, because the film represents very well the horror comedy genre (teenagers will like it), with a bit of slasher (there is also little suspence). Regarding the plot, the public will find a lot of surprises related to the first film, but also some teachings. Probably the story is a bit repetitive, but this is the target, that makes the film enjoyable, for a wide public. The director really hit the mark."}, {"id": 55, "text": "Better storyline in this sequel. Better than 2 years ago. The movie is a comedy- horror. I love the mixture of genres. It's more lovable. And Cole has now grown up. Bee is braver now. Love it!"}, {"id": 56, "text": "That's the blood cult comedy I always want. And now it's a double-shot! Men the black humour, the gore, the twists and a bit of sexy moments. The movie plot is totally unexpected.That's made 2 hours of my life wonderful.First things first, u gotta watch the Babysitter 1 first. Not just becoz u need'a know how the story begins, but also becoz, well, Babysitter 1 rocks!!!"}, {"id": 57, "text": "If you're going to make a sequel to this movie, DO YOURSELF A FAVOR AND DONT CAST BELLA THORNE. I can assure you will get MUCH better ratings. And more views."}, {"id": 58, "text": "I thought the first one was pretty decent but this one is just pointless. Dont bother."}, {"id": 59, "text": "Wish I could give this is zero. Bella Thorne ruined the whole movie. She should stick to playing victim online because that's the only place she can actually act, behind a computer screen."}, {"id": 60, "text": "It was like watching a very bad weird not funny gore skit,i thought cole was going to be finally a hero...we he turned out to be even weaker and more boring than before...or maybe than everyone else in this universe Melanie was a cute innocent girl in love with cole..now its a crazy killer...like wtf! Are you serious?! They still sell those crappy movies ..but when i see people giving it 10..i say to myself well humans are not equal"}, {"id": 61, "text": "Not scary, not funny, not worth your time. Avoid it. If you think this movie funny then your standar of humour are very low dude."}, {"id": 62, "text": "Trashy. Filled with stereotypes and a rip off of comedies from the 1990's."}, {"id": 63, "text": "I know it will get a lot of negative reviews but very few sequels capture the essence of the original. That being said, this is a fun movie. I laughed and smiled alot as well as jumped a few times. Just kick back, relax and enjoy a fun movie."}, {"id": 64, "text": "Wow sooo boring movie, almost slept, very very hard to make it through for an INTJ."}, {"id": 65, "text": "Looks like the rating is high due to a bunch of people rating this as '10'. Part 1 had some sense, this one is the opposite !"}, {"id": 66, "text": "I loved the original movie and this one is just as good. May have leaned into the comedy a little harder but that was not a bad thing. There were a lot of characters so not everyone got their time to shine but I think they knew who we wanted to see and they carried the show. If the series ends here its on a great high note otherwise I would jump at the chance to see a sequel this is a great series."}, {"id": 67, "text": "Damnnn.... This movie got a lot of improvement than the first one. The ending was so unexpected, but i want that bee is still alive eventhough she's an evil"}, {"id": 68, "text": "No Spoiler, the title reflects only the end of this franchise. It could have been a fun franchise with multiple movie and even different casts but Hollywood did what it does best, butcher good storylines. Look, if you are a fan of the first movie and want to see the characters again then watch this movie definitely. But that's all this movie is good for. For our main boy to get some action and kind of end his story in a more consistent way. Other than that this is one of the most forgettable movies I have seen in a long time. Just let it play in the background while you do something else like maybe watch actual P*rn. A 5/10 for me just cause I love the characters, otherwise would have been a 3/10."}, {"id": 69, "text": "Definitely the best movie to watch if you want to waste 1 hour and 41 minutes of your life! Incredible performances. Superb script. Realistic and impressive effects! I didn't liked the first movie, but I should say, this one, destroyed all my interest in Netflix movies made for teenagers. Even a 10 years old boy could make a better work. Waste of money! If I were a huge Netflix shareholder, I would definitely ask a huge WHY? at shareholders meetings, because, ethnically, what Netflix is doing is extremely dangerous. I've said once, and now twice: stop trying to make money with teenagers by producing dumb movies."}, {"id": 70, "text": "09/13/2020 This movie was made for youth, dopers, the vulgar and the severely diminished. NOT Scary - NOT Funny - NOT for any intelligent being. A poor substitute for the original Babysitter movie. Bon Appetit'"}, {"id": 71, "text": "you look like you just saw a gorgeous, black ghost, says the black guy..Replace the words black with white, said to a black girl and this review section would be lit up like a city nightscape with POC tears of systemic white supremacy.....If the Left keeps claiming to not want race to always be an issue, then stop crowbarring race in every chance you get. 👎🏾👎🏾"}, {"id": 72, "text": "Love it, you need to WATCH IT, NOW, NOW. I love it soooooooo soooooo much"}, {"id": 73, "text": "The first film is an amazing dark humor horror film full of blood, this sequel is weak about the script, there is some good scenes and funny pop culture references but the dark humor is really stupid. The acting is good, especially Judah Lewis, Samara Weaving and Bella Thorne performances. The music score is fine but the cinematography is not wonderful. A weak sequel."}, {"id": 74, "text": "The movie was trash. Bella Thorne is TRASH. Don't waste your time. You could name a million better movies with actors who aren't scamming people online!"}, {"id": 75, "text": "This isn't a slasher with a sense of dark humor, a thriller with a charming cast, or even a satirical but respectful homage to a sort of horror. It's a spoof movie with one-note gags, a boring sense of humor, and very little tension, choosing to play almost nothing straight. Some gratification may be found if you still have some teenager mentality and identify with the young and misunderstood protagonists surrounded by dim-witted peers and adults, but that's about it."}, {"id": 76, "text": "This is gore filled, and way out there. Don't watch it in hope of a good scare. Watch it if you like morbid gory humour. For this genre it's pretty cool."}, {"id": 77, "text": "Despite having the same likeable characters, this movie was trying way too hard to copy the original, but fails miserably. Way too much CGI, slow pace, an interesting twist but little else."}, {"id": 78, "text": "Firstly, I quite enjoyed the first Babysitter movie as many of the other reviewers here stated as well; but, I don't understand any negative reviews about this sequel. I think they did a great job with a continuation to a story that one would not expect a sequel to.There obviously is a hard time beating the first of any series as proven time and time again; but this was just as funny and ludicrous as the first. Predictable ? Maybe, for sure. But any less fun to watch? Not. At. All.This sequel brings a welcomed bit of entertainment to any night in / lockdown life with the pandemic times we are living in. Watching it back to back with the first film was a great movie night."}, {"id": 79, "text": "Like the original film, 'The Babysitter: Killer Queen' is a horror-comedy that knows exactly when to dial up the gore and deliver an over-the-top spectacle. It is pretty alright throughout but there's not quite as much shock value this time around. McG seems perfectly comfortable just remixing all of the first film's greatest hits. Still can't exceed the stupid fun from the first time though."}, {"id": 80, "text": "What I saw from the movie was really good comedy, a original plot. with really good plot twists. I think this movie has a good comedy but the plot can be slightly worse than the original one, it depends of who saw it. i recommend this movie for everyone that watched the original one."}, {"id": 81, "text": "I really enjoyed the first movie, which was a great black comedy, with a strong core relationship in Bee and Cole. When I found out Netflix had made a sequel I was very excited. However I was disappointed, almost everything I loved about the original was missing. The jokes fell flat and the relationship between both Melanie and Cole, and Cole and Phoebe seemed forced. I find it hard to believe a guy like Cole would have slept with someone so soon, and shortly after sharing their first kiss. Plus isn't Cole meant to be 14?"}, {"id": 82, "text": "Not sure what people are complaining about. Too much humor? Not enough horror? Sure the first picture was more on the horror side and this one more on the comedy side but it was well done fun.It also has the best rock soundtrack I have heard in a while. Hocus Pocus by Focus! Jenny (867-5329) by Tommy TuTone! Jefferson Airplane and more!Recommended!!"}, {"id": 83, "text": "I absolutely loved the first one and gave it a rating of 8/10. this sequel is fantastic. I loved how they brought the cast back and loved the twists through the movie. I 100% recommend this to anyone who saw the first one ."}, {"id": 84, "text": "This one is not as cool or awesome as the first one but it has its moments. The humor is good , kills are good and fun to watch, story is decent enough to hold your attention. But , it's spoiled by some mediocre scenes in between a good screenplay. If you're a fan of the first one ,you'll surely enjoy this one. Definitely not as bad as some people are making it to be."}, {"id": 85, "text": "Even though it is a fun, but certainly could be much better with some extra creative deaths, killings and chasing. They really bring whole cast back from first movie and thats great. But not as good as the first one."}, {"id": 86, "text": "8/10 for me it was a fun and bloody movie but I didn't feel the suspense the thrill on the first one! The twist was good and the ending was fine I was expecting an epic final battle but what we got is ok, The Post Credit Scene means a potential sequel! But probably not the same lead cast anymore but I will be looking forward to it!The movie has so much potential and it could have been much better if the writting was great and amazing just like on the first one! I can watch it again if I want too so it's a pretty good sequel"}, {"id": 87, "text": "I looooved the first movie and I had no idea that a sequel was coming out, and when I watched the trailer I wasn't super hyped, but this is a really good sequel.A lot more gore and a lot of fun! Wouldn't mind if they made another one..."}, {"id": 88, "text": "Good gore and very funny. I loved it. If you liked the first one youre gonna love this."}, {"id": 89, "text": "The movie was Very good and fun but it turned amazing at the last 20 minutes when samara came back as Bea IT WAS THE BEST PART !!! I WAS SCREAMING - and the movie was better than the first"}, {"id": 90, "text": "Yes, it's a low budget teenager horror movie but honestly this movie is pretty awesome. Throw this on late in the evening and I guarantee you and your friends will have a great time. You'll be laughing and screaming."}, {"id": 91, "text": "I knew full well going into this movie that it was going to be corny and dumb, and I was ready for that. I thought the first one was actually entertaining, and was expecting something similar. But this one was just plain bad. I didn't even crack a smile- not one of those jokes were funny, and I'm someone who enjoys dumb humor. It was just plain cringe. I honestly wish I could get that time back. Even if you liked the original, I would advise against this one, this is something I think I actively regret watching. I mean, read the title of this review for god's sake..."}, {"id": 92, "text": "The first was so bad it was great and I didn't expect the sequel could be better but it was. Laughed, cringed, and scared the cats yelling OMG with a laugh."}, {"id": 93, "text": "You don't have to have seen the first movie to enjoy this one, but it does make sense. Also you will know if this is for you. The second one adds even more humor, at least at first. In the beginning this feels like another American Pie ... the humor would fit, including a father walking in on you ... or is he? And are you? Sometimes just having a certain predicament is funny, even if the truth is not that important but the perception.And that is true for the horror that kicks off after a while. And when that happens all hell breaks loose! Pun intended I reckon. If you are squeamish, do not watch this. If you don't like gore mixed with humor, you might also take offense to the movie itself. I thought it was more than entertaining enough. Some flaws are there, but the movie is too much fun to think about them (at least I feel that way)"}, {"id": 94, "text": "The first film, was actually silly and fun to watch. Low expectations and was easy to follow and appreciated the corniness.This sequel, has none of that. Nothing to do about babysitting, which is a very misleading. This, fell very far away from the apple tree it originally came from. This was the worst movie since Plan 9 from Outer Space!"}, {"id": 95, "text": "This film knows exactly what it is, and hits all the right beats so fantastically well. I love the comedy. It really committed to the horror. The pacing is pretty good. Overall, a fun way to spend a Friday night."}, {"id": 96, "text": "You knew what you were getting into after the first one. The first one is so bad that its actually decent, but the second part is just meh. If you like popcorn flicks that dont even take themselves serious you will enjoy it, at least a little bit, but if you dont, just skip this movie."}, {"id": 97, "text": "I loved the first one but this movie copies the first one and doesn't even try to be original."}, {"id": 98, "text": "I guess its good amongst the teen audience.. and is not meant for gramps like me."}, {"id": 99, "text": "I didn't mind the first babysitter film but something about this film I just really hated about. I guess there was some fun moments but the horrible looking CGI blood looked dumb as hell. I will give credit for the story direction, I was actually impressed but then the ending ruined it. Overall not surprised but average like any other Netflix film."}, {"id": 100, "text": "This is basically just like a sitcom accept all the joke attempts fail. Only the girl's dad was funny but he had very little screen time. I wish theyd kill cole and each other and just switched to a whole different movie in the middle of it."}, {"id": 101, "text": "Watch without expectation, Its fun. Good to watch if you are bored. Not as good as the part I, Still i liked everything it delivered."}, {"id": 102, "text": "Just as good as the first one, stop being haters, you know it's good"}, {"id": 103, "text": "Ok. If you liked the first one. This is an exaggerated version. But I will say this. Looking back on it, I had a lot of fun. Almost along the lines of 'Kung Fury'. It's just mindless, pointless, and fun.The ending however was the best. Having those two main characters back together was something special. Absolutely made the movie, as dumb and exaggerated as it is, a great time."}, {"id": 104, "text": "Not as good as 1 but it had some decent special effects story was a little weak but I'm not so critical as most. Wish it had more Samara Weaving but I get it shes a big star now. Shes the reason the babysitter worked, its her genre!! I liked the story, acting,ending of the original so much more i gave that a 10 as it's going to be a classic with a cult following like the evil dead. It was worth it to stay till the end the 1st half was terrible and going in the wrong direction but the corrected it and came out with a decent sequel."}, {"id": 105, "text": "I loved seeing the OG cast back in for this second flick. The movie had funny parts, but it wasn't as good as the first one. If you are a fan of the original one- you should enjoy this. It has a few good twists and laughs and gore. Don't watch this movie without seeing the first one."}, {"id": 106, "text": "A lot of people will have written this off already for one major reason but I implore you to watch The Babysitter: Killer Queen anyway because it is just as much fun as the first film. It's insanely over-the-top, gory and even contains a dance number that isn't very subtle in it's imagery. That's McG though for you as a director I suppose. You can feel the cast are having a ball playing their exaggerated characters, Robbie Amell in particular highly entertaining with his douchebag act. Will this film win any awards? Not a chance. Will it entertain you for 90 minutes on a Friday or Saturday night? Most certainly."}, {"id": 107, "text": "I liked this film better than the first. Great humor. Lots of gory scenes. Big plot twists. Definitely a must watch"}, {"id": 108, "text": "It has that 80s/90s vibe to it. It's funny, stupid, and has good music. It's definitely worth the watch!"}, {"id": 109, "text": "So glad to see another great new franchise that takes chances.. of course it as good as the first but the director knows how to make a fun bloody movie!!"}, {"id": 110, "text": "The movie was enjoyable but even though it didn't have the same style as the first one. I still enjoyed it since there were a lot more laughs and gore which I loved but I wished the gore was treated more seriously and not a joke like oh look he's dead let's move on but I really liked this franchise so far. I also was confused why they over sexualized Melanie to be honest I was just confused on why they did that. Also loved they carried out the question why is max shirtless. All in all a really good movie that had lots of laughs and gore definitely recommend."}, {"id": 111, "text": "Today's ranks of producers, writers and other creative workers must be filled with braindead zombies, there is no other explanation for this kind of stale and boring crap. Terrible."}, {"id": 112, "text": "Started out alright but the endless hip millennial references and overly flashy graphic designs kept piling up. Not sure why obviously much older actors were supposed to be only 2 years later, but it was probably part of the half-baked writing needed to bring back old characters to rehash with a few new throwaways. The ending made no damn sense in the context. Hard pass on this one unless you need something to play in the background."}, {"id": 113, "text": "The first movie I thought was clever and I enjoyed it. It wasn't great, but I enjoyed it. This movie is just the pits. The story was written horribly and many parts didn't make sense. It was like a bunch of ideas thrown into a hat and pieced together to try to make it work. Too many implausible and cringeworthy situations, too many forced jokes. Phoebe's introduction in class for instance, just silly. Or her taking off on a jet ski in the middle of the day and then she just so happens to show up on the boat in the middle of the night looking for gas? I had to check the run time a couple times because I was looking forward for it to just end. The whole thing is just so poorly done."}, {"id": 114, "text": "The writers of this nonsense should never be able to write again. Hollywood is a cesspool of idiots. I felt like Joe Biden watching this garbage."}, {"id": 115, "text": "Should've stopped at season 1, same I'm a Dork and I'm still in love with the girl next door. Even though a few scenarios switch up they still seek his blood out of millions of virgins in the world!"}, {"id": 116, "text": "It is over the top and enjoyable for the most part but it's nothing special the first movie was a bit better but they are quite the same in quality. Nothing terrible just okay."}, {"id": 117, "text": "2017's The Babysitter remains one of the most unexpectedly entertaining Netflix Originals ever, given that it was co-written and directed by none other than hack-for-hire McG.And while this recently-released sequel doesn't match the original's inspired level of gory insanity, it is nevertheless a follow-up unafraid to go balls-to-the-wall in the pursuit of knowingly trashy thrills.As much as it's a totally unnecessary sequel, it arguably justifies its existence through its self-aware, goofy tone, and commitment to splashing the screen with as much ridiculous gore as possible."}, {"id": 118, "text": "...loved the 1st one, but really enjoyed this one! All characters were great and the plot was fairly original. Just cause I am showing my age...I seen the ending before, but still enjoyed this one way more.TBH...the best part for me...the soundtrack...it rocked:)!"}, {"id": 119, "text": "I was never a fan of comedy/slasher genre I usually find these lame and boring...But this one got me really entertained. I had fun watching every minute of it. The characters make it so easy to enjoy it no matter what the plot will eventually turn out to be."}, {"id": 120, "text": "Let me preface this review by pointing out that this movie has tons of flaws. Some of the performances are awful (*cough* Bella Thorne *cough*), some of the special effects are seriously iMovie level, and the dialogue is some of the cheesiest I have heard in a while. Despite all of these flaws, I could not stop myself from loving this movie. Judah Lewis, Jenna Ortega, and Emily Alyn Lind are spectacular as Cole, Phoebe, and Melanie, respectively. Their performances take this whole movie to a whole new level. What I really loved about this movie is the romantic subplot. I honestly wish that we could get an entire movie about Judah Lewis and Jenna Ortega falling in love, because their relationship felt so genuine. The movie loves to be very real, and I loved how McG handled their relationship. The music is phenomenal, which is to be expected from this director. I thought that the ending was beautiful, and seeing B sacrifice herself for Cole and Phoebe was a uniquely satisfying ending. I didn't watch the first film, but I watched the Kill Count video which went in-depth about it. From what I can tell, this is an improvement on all fronts. I guess I just have to accept some times that a film with a lower quality in terms of production can get higher ratings on my list, as long as it has a lot of heart. The movie tries a lot, and it is very funny at times. It does a decent job with the horror-comedy genre, using an extremely dark tone, with tons of gore, while also being light and playful at the same time. I think that this tone went great with developing the relationship between Cole and Phoebe, because it mirrors, at times, a real high school relationship. A third movie was teased at the end of the credits, and if the next movie doesn't take itself too seriously, just like this film, then I will be extremely happy with the product. This movie is just too much damn fun to pass up, and is one of my favorite horror-comedies to date."}, {"id": 121, "text": "Man, nowadays the movies are like factory made, they are not fun but really boring. This movie is like some teenage stuff but is well put together, the cast is perfect, nice guys and everybody knows them. Perfect movie for some fun! Spoiler!!! Its not for adult people or people that really get into things."}, {"id": 122, "text": "The first one is better, but this one is a lot of fun too!!!It's funny, gory and enjoyable!"}, {"id": 123, "text": "Whilst I love this film and really enjoy the fast pacing, gory kills and hilarious jokes. Whilst not all jokes land most do and it's a good sequel but....whilst the film is great, it doesn't compare to the first film. We're the film fails is the fact that they spoil all clever twists and jokes in the trailer.Spoilers from this point on:In the first film they set up Cole's crush being a big part of the sequel and whilst she is she's actually the killer. A shot in the trailer reveals this and to any one excited for the sequel who noticed this the big twist of how the killers come back is ruined.Because of this I do rate it slightly lower."}, {"id": 124, "text": "I think it was an okay movie, some of the jokes made me feel a little uncomfortable, I think they just grabbed a token black guy to make race related jokes tbh.... that didn't sit well with me. I don't really like that influencers are in the movie it's just weird to see them outside of their usual bubble. Some of the jokes will be outdated in a few years which kind of seems like a bad thing but i kind of like that, due to that only a certain amount of people will understand it, I find that quite funny. I think the soundtrack was the most exciting for me I liked listening to Police Truck by the Dead Kennedy's in the film it was awesome. Also I've low key had a crush on Judah Lewis for two years now so i'm kind of biased into liking this movie!"}, {"id": 125, "text": "Definitely a more comedic follow up compared to the first but still just as entertaining.If they make a third one, I would try to put the leads in a scarier situation again.Otherwise, decently entertaining film."}, {"id": 126, "text": "It was pretty entertaining not as creative as the original with it's kills but fun. It just sad that that they had to have this superhappy ending which was pretty lame, it really hurt the film."}, {"id": 127, "text": "Like most people who enjoyed the fun, fast paced, funny and nostalgic first film 'the Babysitter...' you probably thought this might be OK... You'd be wrong...!!! OMG, it's like they forgot what made the first film so good... The the neighbourhood house setting, the fun supernatural theme with a bit of home alone style scripting. For those of us who grew up in the 80s and 90s that first film brought back all those first time cinema experiences, but this sequel chose to do the opposite of all that. It has a moving location which doesn't work, poor characters that you never care about, weak action sequences and pathetic production design... I am lost for words... Even the night times scenes, which is most of them, are lit up by obvious giant set lights... Are you kidding me... No time or effort was put into this script, and we all know a good film starts and ends with the story, and this was truely horrible, I can barely remember the ending... Stay clear of this one...!"}, {"id": 128, "text": "What was that nonsense? The first one was entertaining. This was so stupid I couldn't even make it halfway through."}, {"id": 129, "text": "The first film was so good. This one completely lacks the style, rhythm and aesthetics of the original. The high school scenes were so forced and inauthentic, and the rest of the film was in just plain cringe. It's like they tried to make a sequel but were hungover and running errands while they wrote the screenplay."}, {"id": 130, "text": "It's full of fun lines and a cast that legit tries to bring back the magic, but the film falls into the exact-copy sequel trap that sooo many films fall into. It doesn't have the best character from the first, the title character, yet tries to fill her missing here with a similar villain that's less interesting and ruins the love storyline from the first. It loses the charm of the first film, the simplicity, which could have worked had the location been more interesting (why not the classic mall... haha). The film cruises along with no particular pace and just sort of rides smoothly to the end with few major surprises (beyond the first surprise). I think it missed majorly, probably due to the rush they must have been in to make it."}, {"id": 131, "text": "It is better than the first one you'll definitely love it. Please bring back bee aka amara weaving for the 3rd part"}, {"id": 132, "text": "I NEVER write a review but I had to take this one. I mean the story was total bullcrap but man was it entertaining. This movie escalated so quickly and just keeps on going. Definitely better than the first one."}, {"id": 133, "text": "This movie was so cringe and just really bad. The acting was on a kindergarten level and some of the scenes were so bad I kept thinking that those were only in the imagination of a character and we were going to see what really happened. The love story is very forced and seems fake. The ending was decent, not mind-blowing but okay-ish. Could work for a night with a few close friends at home, do not play this movie when you want to see some art because it' not going to happen."}, {"id": 134, "text": "I was surprised to see so many low scoring reviews from people that say they liked the first one. I found it to be right on par with the first. Enjoy the ride of the movie cause it's a lot of fun. Everybody came back and we're equally as funny as the first one and the kill scenes were great. People wrecking it are just looking to complain about something. It is a fun movie!"}, {"id": 135, "text": "A very good movie with lots of twists and turns, more so than the original. The biggest of course was finding out Melanie was part of the cult. Was she part of it in the first film or did something happen between the first and second films? This was a plot twist that seemed to just get thrown in."}, {"id": 136, "text": "The original Babysitter was McQ's best work. A fun horror/comedy with a great cast that got it right. The sequel is a muddled mess that gets it right only half of the time. Mostly, it doesn't make much sense. Ignoring key plot points from the first movie and trying in vain to get enough of a coherent storyline so that Netflix can eek out a third installment. The good parts are really good, and the bad parts are just head scratchingly dumb. I still enjoyed it, but what a missed opportunity."}, {"id": 137, "text": "The biggest problem was the fact that Bee didn't play a big role in this movie. What made the babysitter one better was that bee was an antagonist and we constantly saw her. In this one she is seen in tiny clips and a boring ending. The new characters were boring and unnecessary. I was honestly glad to see the old characters."}, {"id": 138, "text": "After surviving in the tremendous night, the life of a 12-year-old boy became hell. Nobody believed what happened to him that night. After exactly 2 years in his teenage, he emotionally attached to one of his female friends. One weekend they flew with three of their friends to have a great night. But his night became dark again after experiencing the same thing that happened 2 years ago. But this time he fell on a massive problem than before. Will he survive again? Or Whole of thing is just his illusion?You have to watch this sequel film to know about these answers. This is much better than the first one."}, {"id": 139, "text": "When you're in the mood for something, but you sit there, scrolling through Netflix's options, unable to decide - don't scroll past this movie.Yes - it's stupid Yes - it's mindless Yes - it doesn't hold back from the gore Yes - it's funny as hell Yes - there's eye candy for the ladies Yes - there's also eye candy for the men! (#equality)But all these points make it a damn good movie when you want to forget reality for a while and laugh at the camp one-liners and classic horror references. And then if you're a sucker for sappiness- there's even love"}, {"id": 140, "text": "Funny, gory, silly fun.The characters are all back and as funny and disfunctional as ever.I almost gave this nine stars if it wasn't what they did to Melanie. Didn't seem any reason to turn her evil. She was a sweet, sympathetic, kind and in love with Cole in the first one. To turn her evil made no sense."}, {"id": 141, "text": "If you enjoyed the first one then I have a feeling you will enjoy this. It does enough things the same to keep they style and vibe that I love about the first one, and it brings enough new elements too keep it fresh and not just a complete rehash of the first. Cole has grown up but he has the same quirky loner issues at high school as he did in middle school. And he's still got that tasty innocent blood that attracts all kinds of trouble. The cast is great once again, the score is rocking and plays a role in events of the film. The gore is back, maybe a little less than last time but still a few buckets of blood are thrown around. All in all its a great movie to have with a pizza and a beer and some laughs."}, {"id": 142, "text": "The combination of simple comedy and ultra violent and bloody deaths works again, less original for sure, but it works. Two years after surviving the satanic-bloody cult (three since the previous production), Cole (an older Judah Lewis) while being treated like a madman by the events that happened but that he cannot prove, faces the deadly cult again, with new and surprising members and the return of the original four, the sexy Bella Thorne and naked torso for no reason Robbie Amell from Upload (and Arrow's brother) among them. What is missed is Samara Weaving, who appears but little, the little friend (also older) Emily Alyn Lind from Doctor Sleep plays her replacement and Jenna Ortega (from the 2nd of YOU Netflix) joins, as a companion of misadventures . Returns to direct McG and manages to entertain with funny and humorous moments typical of pastist comedy, a class b horror movie tone and tons of blood (even in impossible moments like a hemoglobin splash from under the water!) of the gore cinema."}, {"id": 143, "text": "I liked first movie and I didn't expect second part, still funny and nice :)) especially head explode scenes :))) you can watch it just for fun."}, {"id": 144, "text": "Fun as hell!. I watched to the end and never boring me. Sexy girls, lots of blood, laughts, brutal killings...A very good and fun sequel."}, {"id": 145, "text": "Just sit back, relax, enjoy this Funtastic movies.."}, {"id": 146, "text": "The movie is good entertainer and comic horror with full on timepass. Just don't use any logic brains and enjoy it completely as it happens. A nice comic silly but Entertaining movie."}, {"id": 147, "text": "The first one was surprisingly good. It combined comedy and gore pretty well. This one has that too but it felt a bit flat in some areas, especialy towards the ending. Also there are certain twists that kinda felt cheap. It's still fun and well directed though."}, {"id": 148, "text": "It's fun, it knows itself is an average movie and never tries to be taken seriously. The horrible CGI and mediocre interpretations end up contributing to the comic and campy tone of this sequel. The biggest negative element was the final twist that opens the door to an unforgivable chronological error. For the rest, I liked it, but obviously I don't recommend it to everybody.I advice you to watch it with low expectations as I did, I'm sure you will enjoy a lot."}, {"id": 149, "text": "Uuughh, this movie lives on memberberries and social media references"}, {"id": 150, "text": "This might be a bit biased but I have been watching a lot of great movies recently including Inglourious Basterds and Parasite. Even then, it was thid movie and its prequel that took me by surprise. Thinking that I'd be watching a low quality film, the fact that the cinematography, writing and overall enjoyment was so good surprised me even more. Most fun I've had with movies in a while."}, {"id": 151, "text": "It was good but Melanie was trying wayyyyy too hard to act just like Bee in the original"}, {"id": 152, "text": "Enjoyed The Babysitter. Loved the sequel. Oscar winner this is not, but it is pretty fantastic entertainment if you get the joke. Silly, gory, with plenty of stupid twists to keep you hooked. Ignore the plot holes and enjoy the ride. Add this one to the list of sequels that are better than the original. Looking forward to #3."}, {"id": 153, "text": "It was a great movie! I loved the first one which is probably why I loved this one. The same style comedy. We get more of a backstory which is good.The references to other movies were great my personal favourite was 'The Outsiders' and it somehow worked.It was cheesy but the good kind of cheesy."}, {"id": 154, "text": "This was definitely a worthy follow-up to the last movie. There were a lot of good jokes, great kills, fun characters, and also good relationships. You won't regret watching this movie."}, {"id": 155, "text": "Yay yay yay yay!!!I was so happy that there was a sequel! The first was one of my all time horror comedies. I loved the irony and self awareness jokes. The second one is a great! Really made for people who loved the first. (FIRST IS STILL BETTER). A bit over the top (exaggerated at times), but having Weaving (Bee) back was great. She is becoming real Horror Queen! Thorne (not too shabby in horrors either!) was also great! Soooooo cheesy! So cliche! Brilliant. Giving 10 stars coz it deserves a 7 star love, lift that score!"}, {"id": 156, "text": "A lot of shameless, cringe culture appropriation from the new girls hairstyles (Bantu knots &amp; cornrows really?) &amp; a ton of hip hop music with an almost all white cast lol. So unoriginal and typical."}, {"id": 157, "text": "In the first movie cole was 12. The start of the second movie it says 2 years later. That should make Cole 14. But the movie states that he's a junior in high school which would put him at ablut 16, 17."}, {"id": 158, "text": "I would say the sequel better than the original movie cause like oh my gosh !!.And I like both of the movies."}, {"id": 159, "text": "If you liked the first one buckle up! It was a fun ride that I would happily take again and again. Not everything has to be Scorsese. Can't wait for part 3!!!"}, {"id": 160, "text": "The movie is funny. If you come looking for some profound cinema experience you will be disappointed. I love how max is even shirtless when he worked fast food."}, {"id": 161, "text": "The BabySitter Killer Queen is better than the first. Plenty of surprises around every corner. Great story and character continuation, coming off the first film. It also manages to out do the kills of the first film. Just WOW 😱😱"}, {"id": 162, "text": "I really loved the first film from 2017, watched it several times. Overall I enjoyed this sequel, a film that was totally unexpected.The main problems are with the editing. Unnecessary cheesy effects like VHS look and retro gaming, which are applied to flashback scenes but poorly done. It was still a fun watch though. Good to see the original cast return and a decent twist near the start.Recommend 8/10"}, {"id": 163, "text": "This review contains spoilers.Babysitter Killer Queen is the long awaited sequal to the horror comedy film The Babysitter way back from 2017, this one is a little bit more focused on the comedy side than the horror side. It tells the story of Cole a couple years later being labeled as a crazy kid because police did not find evidence about the incident 2 years ago, the only person that talks to him normally is Melanie but she denies all the killings and kinda just wants to forget about them, when his parents decide to take him to a psychological highschool he takes up Melanie's offer of going away to the lake for a week with her and her friends only to find out that the cult that he killed back then are back for his blood. Now I don't think this sequal is as good as the original, but I don't think the film is bad in its own right, it does have a lot more comedy than horror tho, the kills are still gory, the references, funny humor and the elements that made the first movie great are still here. I didn't really like the Melanie twist, it was just so out of place for me that she suddenly is a part of the cult and it kinda threw me off, and the ending I still don't know if I like it, we get Bee back and she apparently set up everything so Phoebe can be safe, and everything looks good, now I think there might be a sequal, but I personally think that this a good enough place to wrap up this franchise, if they make a sequal it has to be really creative since they killed off the favorite characters from the previous movies, they might even go for satan is going after Cole, even tho that kinda feels too extreme, but hell this entire franchise is crazy. The pacing felt a little bit rushed to me, since the plot conveniences just progressed the story really fast, it felt like everything that needed to happen just happened, like I don't actually think grooming Cole to get cornered again is that easy, but hey they made it happen I guess. Pros: -Still funny, gory and a lot of great pop culture references -Returning characters made the movie great -We get to see what happens if the ritual is completed and that was kinda epic if only they had the blood of the innocent -Samara Weaving returns at the end as Bee -Very self aware -Its influence is in full swing -Very entertaining Cons: -Too much plot convenience -The ending and the Melanie twist are still meh for me -Pacing wasn't great -First part of the movie was lame as hell Overall Babysitter Killer Queen is a pretty decent sequal, I still think it relies way too much on plot convenience, since without it doesn't get going, but it does maintain the humor and the other elements that made the first one great, while being inferior to it unfortunately. This film was also really enjoyable and funny to watch, and I would recommend it to horror fans out there. Imma give Babysitter Killer Queen a 7/10 for its overall movie rating."}, {"id": 164, "text": "MAJOR SPOILERS (possibly, I might do this spoiler free but be warned anyway) AHEAD BECAUSE I NEED TO TALK ABOUT THIS MOVIE!!I rated the original Babysitter movie a 7/10 because I love the look and feel that director McG was going for. Stylized sequences, crazy gore and hilarious comedy. The Babysitter is one of Netflix's best movies and it's a highly enjoyable dark comedy that when I first watched it, the twist early on had my jaw on the floor. The kills were great, and the movie had a good overall message, and a unique execution to it.When I saw the trailer for this sequel I was immediately excited, but there was no news of Samara Weaving's return so I was worried it wouldn't be as good without her charismatic personality. Boy was I wrong. This movie is twice what the original was, in the best way!The Babysitter: Killer Queen was better than the first. With twice the gore and kills, twice the hilarious comedy, and about 3x more McG stylization.NEGATIVES: The bits with Cole and Melanie's dads were easily the most annoying. But even those after a while weren't so bad and were pretty enjoyable and kinda heartwarming. All the things I thought were going to be annoying here ended up making me laugh even harder than they did the first time, the movie is a little slow and awkward to start and I got worried it was just gonna repeat itself and feel like the same movie.POSITIVES: this movie doubles down on all the things that made the original so damn enjoyable for me. The kills were more creative and much more graphic and shocking, some of which leaving my jaw dropped. The practical gore in this movie is insane, and when there IS some CGI it's not horribly done.With the characters from the first film returning, we get even more cringy hilarious dialogue between them, but I just love how they all experience the same stuff as before. This movie is self aware in the perfect way, retrospectively. The new character played by Jenny Ortega was the best part in my opinion. A complex but really sweet new love interest for Cole. The bond the two had was a really good emotional backbone for the second half of the film, and it lead to a hilarious climax twist at the end. The whole cast absolutely kills it in this movie, I was laughing, cheering, and smiling wide for most of the movie's runtime.Those who only wanted Samara Weaving back won't be entirely disappointed, as she serves quite a huge part in this movie too, she's just in it less. But spending time with Andrew Bachelor and Bella Thorne is NOT a bad time. They may be a little annoying and obnoxious, but it's written in such a tongue in cheek way, it's so hard not to enjoy this movie's style.And speaking of style, McG directs the hell out of this movie. A great location, great camerawork, great pacing, and of course, a whole heap of on screen stylized sequences that are nothing but tons of fun to watch. This movie literally becomes a video game at one point, also the addition of short little skits on how they came to be part of Bee's cult are pretty hysterical and clever.This movie is way more clever than the more average and predictable predecessor. I literally had no idea what would come next, and it ended up surprising me repeatedly. I had an absolute blast with this movie, and while I feel a 3rd chapter is unnecessary, I am NOT opposed to McG continuing the great work he has going here.Also the soundtrack is killer as well.This is an honest 7.5-8/10 for me, I was really worried going into this movie but I was far from disappointed. I know not everyone will be on board with the changes here, but if you're like me and enjoyed the original for what it was and love when directors experiment, you'll love this movie!"}, {"id": 165, "text": "Yo yo, this movie was fricken bomb. Highly recommend homie! :()"}, {"id": 166, "text": "It's brilliant and like terminator 2 is better or on level with the first. All the haters on here obvs have an ickle pickle is all I can say. It's all men hating it. Enough said...."}, {"id": 167, "text": "I was happy to see a sequel to a film I really enjoyed that is until I watched it. Bad bad bad , would rather be kicked in the shins for two hours straight than sit through it again."}, {"id": 168, "text": "This movie is excellent I watch it when it dropped at midnight. This movie has a very stylistic theme which the first one didnt have which i enjoyed. Don't want to spoil but there was one cheesy street fighter based fight seen if it wast in there and the design 10/10. It was super fun and I had no expectations but it was worth the wait. Way more story then the last time that fits the story. Jenna Ortega did a exceptional job and it had lots of twists and turns. It had humor and it was a great sequel hope theres a 3rd. Overall a great comedy produced by Netflix."}, {"id": 169, "text": "Wow I didn't expect it to like it that much . It was a CRAZY , FUNNY AND BLOODY ride . The acting was great , the jokes were funny and the deaths were bloody ( even though they were ultimately unreal ) . Sometimes it could be very cheesy and cringy but it's ok . The last bad thing was the lack of budget . The visuals weren't that good . But overall a great sequel that I have to say it's better than the original . And after that post credits scene I want another sequel"}, {"id": 170, "text": "If you enjoyed the first one, odds are you'll enjoy this one. As seen in the cast list, everyone returns for one more laugh and scream. A betrayal sets off a chain of events that bring Cole and a new companion together in a fight for their lives and a heartwarming conclusion that perfectly ends this duology."}, {"id": 171, "text": "Not a great movie by any means but it had a few good laughs some good kills, and some good character relationships. Very entertaining. I think it's better than the first but that's just my take. Fun movie. I hope they do a 3rd"}, {"id": 172, "text": "I love this movie. When can I find the Blu Ray?!!! Definitely DVD library material. Mcg is the man!!!"}, {"id": 173, "text": "Cheesy, dumb, gorey, fun comedy slasher. Fantastic sequel to an already good movie. It's not supposed to be thought provoking, it's entertainment. Just watch and enjoy."}, {"id": 174, "text": "Just as fun as the first one! great! just so much fun!!"}, {"id": 175, "text": "Really enjoyed the first film so was really Hoping that this one would not let Down and I have to say I loved it even if a little gutted about some of the cast dying"}, {"id": 176, "text": "The first one was a surprising dark comedy horror. It had just enough comedy to laugh at, but not so much that took away from it being a death movie. It was a nice surprise and a recommendation.This one was almost like a spoof, think Batman &amp; Robin or Sharknado sequels level of stupidity. It is never funny, dialogue is all over the place and while the first one managed a 'dark comedy' this is Tom &amp; Jerry level of slapstick....just really really bad.Save 102 minutes of your life.....skip"}, {"id": 177, "text": "The Babysitter Killer Queen. A great continuation of the first film that keeps the same style and tone of the original movie but has alot of great twists along the way that adds to the original and makes for a great sequel to this Franchise and honestly I enjoy it slightly more than the first.The characters in this are great and love the twists it adds to the people we see in the original. I really like the way they handle Cole in this movie and how people don't believe him about the events in the original. They also do a really interesting twist with Bee at the end of the movie and it's a fantastic way to add to that character and end her story.The kills are a great like the original and the gore is awesome like the original. I also really like what they add to the cult in this one it has a more supernatural feel to it in this movie and I like that a sequel should always add more to the original and this does that really well.My only negative with this movie would be again like the first sometimes the pop culture reference do go a little to far sometimes. For example there's a fight scene that's in the style of Street Fighter and its an odd scene in my opinion that dosent really work. There also isn't enough of Bee in the movie which is a little annoying but what they do with her is fantastic.I also really how they show the little backstories of how the people joined the group its a nice little detail we never saw in the first and adds alot to the people's characters and you understand them more because of it.It's a brilliant story that's got an awesome tone and is a great continuation of the first movie. Some great fantastic twists along the way and honestly I enjoy it slightly more than the original it's just a fun movie and honestly I can't wait to see more of the franchise.Verdict 8.5/10 a fantastic sequel to an already great movie. Got some fantastic twists with characters old and new and a fantastic twist with Bee that ends that character in a great way and shows more of her backstory. A great addition to this Franchise and I can't wait to see more. I enjoy this slightly more than the original."}, {"id": 178, "text": "I love this movie there's so many genres. I watched it with other and they can't stop talking about it! I really hope there's a part 3 and if there is I will be really happy and excited."}, {"id": 179, "text": "A far too convoluted plot. The simplicity of the first film streamlined the laughs, whereas this one tried to cram jokes into an unnecessarily jolting storyline.Shoehorning Samara Weaving into it instead of either keeping her out or having her all in really took something away from it.All that aside, it was still pretty fun."}, {"id": 180, "text": "Dead serious. Don't waste your time unless you are with your pals and drinking every time something stupid happens. Hell of a drinking game."}, {"id": 181, "text": "The movie's still fun to watch, however it's not as good as the first one. What bother me the most is the twist on its ending, it seems forced and just too sudden."}, {"id": 182, "text": "Maybe I was just high. But I haven't laughed that hard at a movie since white chick's in 04."}, {"id": 183, "text": "Such a good sequel to the first and I hope they make a 3rd one!"}, {"id": 184, "text": "As said in header, this sequel is made to look like a video game. I didn't dislike it, but was for sure showing so budget wise. The blood every time looked like kindergarten paint smudging all over. The backdrops for a lot was cheap. driving with vehicle boat, jet ski, mountain in front or behind was apparent would be seeing as such. I enjoyed the cast, newcomer Jenny especially. I thought the backstory on each villain throughout was cute, How was presented. I would put in on a Halloween view list but mid point or lower depending on your lists each year.Juda Jenny, He looks like Barry Watson from 7th Heaven. Jenny looks and even scarily so sounds like 0.C. Rachel Bilson. So yah I liked that, Was proud of self putting together. 7/10"}, {"id": 185, "text": "I laughed so many times. This was really fun. Great special effect. Way better then the first one really enjoyed big time. So go and have hopefully as much fun as I did."}, {"id": 186, "text": "This movie is just hilarious. I mean I'm seeing people's head exploding but it's funny, horror, teen romance, everything you need. I recommend this movie to anyone for a good laugh, twist and turns. A Must watch!"}, {"id": 187, "text": "This is a sequel that has no business being as good as it is! The Babysitter: Killer Queen takes all of the over the top comedy and gore that made the original so great and cranks it up to eleven! With the enjoyable cast of the original all returning to reprise their roles with even more craziness than before, Killer Queen blew my mid to low expectations out of the water and is actually a worthy followup to the original film. There are some pacing issues, and comedy can fail to land at times but overall The Babysitter: Killer Queen is a very enjoyable ride."}, {"id": 188, "text": "This is a great splatter movie, full of cliches and Super funny"}, {"id": 189, "text": "This is a gory teen slasher film. Some scenes are over the top bloody, but it manages to maintain a fun vibe."}, {"id": 190, "text": "Cinematic classic? No.. Entertaining and fun watch? Yes"}, {"id": 191, "text": "I enjoyed the movie and i love the ending , they should make an another sequal and cast me in it. by the way all the actors and actress are hot."}, {"id": 192, "text": "I would advise watching the Babysitter 1 first, but you don't have to. I thought both movies were good, but I thought this one was much better. There are some unexpected twists, and I love that."}, {"id": 193, "text": "This move is funny, but it's kind of fells like if Tarantino made a bad horror movie."}, {"id": 194, "text": "If you're in for some crazy wtf comedy moments then this movie is for you . But it is nowhere near it's predecessor only thing they ripped is the gore but it just gives you few laughs otherwise. As the movie went on it was kinda boring but out of respect for the first flick I rate it 6/10 .."}, {"id": 195, "text": "Was this as good as the original? No. But it wasn't far off. And considering how bland horror movie sequels get, this was surprisingly good.What I really *got* from this movie was the sense that everyone making it had as much fun in this movie as they did in the first one. And that is a rare and wonderful thing."}, {"id": 196, "text": "I actually enjoyed the second one a little bit more than the first and I also thought that both films did a pretty good job of mixing both the scary teen horror and the spoof horror genres and that's something that I haven't really seen done well since scream.. I also thought the jock stole every scene he was in with the Friday the 13th theme song he did and the shoutouts he gave the main character Cole throughout both films.."}, {"id": 197, "text": "Absolutely loved it just as good if not better than the first. Can we please have babysitter 3 netflix ASAP love it"}, {"id": 198, "text": "Not even worth the 2 stars. And people really thought that mulan was bad, have they seen this? The first was was bad enough that it really didn't need a second movie. Seems like Netflix wants to just throw money at stupid projects"}, {"id": 199, "text": "The most convoluted, confusing story I've ever seen. The first one wasn't good by any means, but it was fun. However, the utter nonsense ending sucks any fun out of the first hour of the film."}, {"id": 200, "text": "This movie was awesome, sure it was kinda dumb and just plain gory comedy, but thats what made it so great. it was amazing, sick effects, soooo funny!!!"}, {"id": 201, "text": "Everything that made the first film Awesome has just been lost here. It's like this has just been filmed purely for nostalgia reasons. I was excited by the news of a sequel but ultimately I feel deflated by it. Bringing back the original cast had so much potential but there was zero effort put into using them. It felt like boxes were just being ticked. Such a shame. This could've been so much more."}, {"id": 202, "text": "I won't spoil anything but Bee's return is at the bottom of this movie's awesome list of craziness. Seriously. Go see it if you have Netflix"}, {"id": 203, "text": "The movie has an amazing plot twist. It is fun to watch. The chemistry between characters is wonderful. It is better than the first one."}, {"id": 204, "text": "This movie really shines when you look at it as a comedy or satire flic instead of a horror, if you can't tell that this movie isn't meant to be watched as a horror you need to rewatch in a new light. I've watched it 4 times now and I understand how this movie is supposed to be watch.A great flic to watch with friends or alone will give you many laughs"}, {"id": 205, "text": "Amateur Review, but still one that matters!Even in its first moments it had given me a few smirks and nose exhales, with a smile on my face, but then it happened, a revelation after a scene with a hilarious police officer, comedy evolved. Comedy at its finest, genuine happiness for this film"}, {"id": 206, "text": "The babysitter (2017) was one of the most fun movies out of 2017 so i was really exicted for the sequel luckly this one deliveres. MCG directs this movie well the movie also has alot of twists most of them i saw coming but it didn't really bother my beacuse i just was having to much fun watching this movie. Unfortenetly some of the special efects don't look that good but i did like some of the music choises in the movie like killer queen obvoisly. All of the acting is done well and over all this might be better then the first movie."}, {"id": 207, "text": "This movie tries very hard to be cool and funny but is neither."}, {"id": 208, "text": "I made it about 45mins before turning it off. It seemed to lack any substance of a plot and just throws you in the deep leaving the viewer wondering what is going on and why. I enjoyed the first one but for me this sequel was just a big letdown!"}, {"id": 209, "text": "Absolutely gonna be a cult classic. Funny, weird and satanic. 10/10"}, {"id": 210, "text": "Excellent plot and twists during the course simply well very well Cole and Phoebe simply create a great chemistry fulfills its objective of keeping you glued to the screen and not detaching from it so as not to miss anything that will happen every second, you must see it because it has a person unexpected and also a bittersweet ending, and that leaves you with a hint of third part ..."}, {"id": 211, "text": "I think that second bring something to the table something new like no one thought that Melanie is gonna be the bad guy and all the other Will gonna be killed first I thought that Boom Boom and Diego Jenny Melanie and Cole are gonna fight against Bee and Sonya and all of them then boom the story is completely different for me Phoebe is a good addition to the plot and personal I think that Phoebe and Cole are cutter then Cole and Melanie I am happy that the parents got more screen time to know them better +Melanie's Dad is hilarious And Jenna Ortega is a great actrice that got a bright future and I really wish all the best for her and not ending up like Miley Cyrus or other actrice Overall is a great movie that I am glad that I watched it and a good movie to rewatch also"}, {"id": 212, "text": "Only those people who gonna hate this movie who still love watching Hannah Montana...or any other cute predicted movie... THIS IS FOR HARD.CORE"}, {"id": 213, "text": "If the first and original wasn't enough and now this"}, {"id": 214, "text": "Good sequel to babysitter movie the movie's story is good and watchable plots some gore and blood seen in the movie."}, {"id": 215, "text": "It doesn't has sense even, poor and boring plot. I regret to see it."}, {"id": 216, "text": "I loved the first one so much, I watched this without view the trailer, so I was able to enjoy every moment of it. It was so well done! I'm glad they added a supernatural element to it!! If you APPRECIATED the first, you'll definitely enjoy this! Brings a whole new meaning to Cult Classic."}, {"id": 217, "text": "This movie ended the story on a positive note and I am satisfied with how things turned out. It left off a bit open ended and some questions are left unanswered. For instance, how the blood cult was formed, why did Melanie make a deal with the devil, what was the ultimate goal of the cult, and more.I enjoyed watching the development of Cole from being a cowardly middle school student to a confident high school student. The introduction of a new character, Phoebe intrigued me the moment she stepped into the classroom. I think she complemented Cole's character very well as their past is somewhat similar. As in, they both had killed people.What is different with the sequel from the prequel is that there is more gore and you get to know the characters a little more. What is the same is that, the comedy is still strong on this one and maybe I cracked more laughs at the remarks and antics."}, {"id": 218, "text": "With the first film being a surprisingly good comedy horror film, I had reservation about this film.I'm very impressed with Emily Alyn Lind aka Melanie in this film where she plays 2 different roles well within the film. She will have a bright future if she continues to pick the right roles.Spoiler talk: I miss Bee (Samara Weaving) being one of the main antagonists as she made this film for me. She occupies a more cameo role in this film due to what I expect to be work commitments... Her stock is on the rise.It is great to see that the old cast returns &amp; love how they play caricatures of themselves from the buff shirtless guy (Robbie Smell), the overly cautious African American (Andrew Bachelor ( &amp; the bimbo role (Bella Thorne) &amp; ott Asian girl (Hana Mae Lee).It is full of witty references to classic films especially Terminator 2 &amp; one may argue it is a modern version of the original Scream film."}, {"id": 219, "text": "Some of the worst dialogue I've seen in a long time... but also some genuinely funny moments too... I don't regret watching it. There are worse ways to spend 2 hours.Similar to the first one except they leaned heavier into the absurdity."}, {"id": 220, "text": "Why they thought that movie had to have a sequel, I'll never understand. Maybe this is my old ass talking, maybe this movie is just dumb."}, {"id": 221, "text": "A completely unnecessary sequel. Starts where the previous movie ends. It is about a boy who is now a teenager and lives with the memories of what happened previously with his nanny, everyone calls him crazy and one night his only friend invites him out and they raise the dead to sacrifice him. Low quality, it is entirely for television. Bad effects. The exaggerated blood and totally caricatured moments. The dead rise from nothing and totally lose the sense of what was the first. Incongruous. Avoidable."}, {"id": 222, "text": "So I know the main actor is grown up and all, but they literally acted like they never talked about their concerns until onscreen and they picked back up from the last movie except everyone is years older... can't relate..."}, {"id": 223, "text": "This sequel would've been cool if it wasn't literally just like the first one except they added like 2-3 new characters to try to not make it like it predecessor.I honestly wish this film went a different route, especially with Cole and Melanie. Like why didn't they end up together after the first movie? Wouldn't it have been better for them to be together in the beginning and then later he finds out she was only with him to use his blood for the ritual? That definitely would've been more interesting and a better plot twist in my opinion, but instead they gave us this rehash of the first movie. I hope there isn't a third movie..."}, {"id": 224, "text": "This sequel pleasantly surprised me. They upped the story elements and made the plot a lot more interesting."}, {"id": 225, "text": "I had no idea this film had even began or finished filming the making of this was very quiet one of the actors revealed that it was coming out this September and we got one trailer now here it, let me just say I really enjoyed the first one it was funny, violent and really enjoyableThis film has some enjoyment sprinkled throughout but it is such a mess of a film that tries so hard to make it work without Samara weaving for literally the entire film she shows up 20 minutes before the end and is only on screen for about 10 minutes, with a twist that honestly if I explained everything I'd be here all day it just ridiculous how much of her plan was solely based on absolute luck, like literally there's no way what she planned would ever go down in the exact way it did.As a sequel it really does make the first film feel kinda pointless at the end, Bella Thorne is annoying as hell in this one, the rest of the cast did good with what they were given but honestly given how long it's been since the first I was hoping for a lot more but it seems as though they didn't have a clue what to do with this so now we have killer queen it's really disappointing I gave it chance especially considering negative things about it but yeah I should have listened to the critics despite laughing at a few things there's not much in this that's memorable, here's hoping Netflix puts their money into something better next time or spend more time actually focusing on an idea that works not just throw anything you can at the screen until you have a movie that feels rushed but kinda boring at the same time"}, {"id": 226, "text": "Entertaining, great music (Cramps, Queen, Focus). Neat simple story with enough gore and good looking people to keep engaged."}, {"id": 227, "text": "This is the cheesiest blood soaked, teen killer movie I've seen and I loved it hahaha! I mean it's an over the top fake blood, teenage virgin nerd, and all the Tagalongs, predictable slasher film. It was funny, made me laugh at the funny parts and at the blood spurting killings. I am not mad at it, no way! It's exactly what it wanted to be! Maybe even turn into a cult classic. It's primed and ready for that! Anyway, if you like my review, then watch it. I tell you all you need to know, so just sit back, chill for an hour and a half, and watch some teen slashing"}, {"id": 228, "text": "I love this it's 1 of my fav Netflix movies and is even up ther with stranger things and spoilers but I cried wen bee died at least Cole and Phoebe are happy I guess if you haven't watched the original then watch that 2 their both really this 1 more comedy but original more like horror"}, {"id": 229, "text": "When you liked the first movie, with the over the top killings and weird situations, you will like this one as well.I enjoyed it for sure. Not to be taken serious these 2 movies, but great fun.On a side note: the girlfiend character is now working on Scream 5.Somehow I think this will not end with part 2.Great fun."}, {"id": 230, "text": "I loved the first 20 minutes of the film approximately. It was in keeping with the original style and there was some great comedic moments with an interesting set-up. When the horror and action started at the island it became very repetitive and boring in parts. The end was quite good I loved the last scene. Judah Lewis and the cast were fantastic and the soundtrack was great aswell. Unfortunately Act 2 of the film was quite a poor, repetitive showing. Even a road trip would have made the movie much stronger the one island location in the dark was just pretty dull and boring no interesting scenery or locations once that begun. Would love to see another installment with better story and less forced comedy scenes."}, {"id": 231, "text": "I was looking forward to this as the first movie was a pleasant surprise but by the time it finished I felt like it wasnt really worth my time. It's kind of a strange movie and a lot of scenes gave me Scott Pilgrim vibes but they just felt out of place and didn't fit into the world that was created with the first movie. I wouldn't be surprised if people enjoy this movie but It has been 10 minutes since watching it and I cant think of a single thing I personally enjoyed about it. The first movie I will gladly rewatch and have done so multple times already but this one I'm just going to forget ever happened."}, {"id": 232, "text": "Wow Awesome Movie 10/10 just wow I loved every second of this movie."}, {"id": 233, "text": "Like most sequels, it did not stay on the same level as the first one. This movie didn't need a second one tbh, but it was still fun to watch if you look past the disorientated plot. Great acting though."}, {"id": 234, "text": "The first sequel was great but this one is so bad for that. I wish this second sequel never made. The story destroyed the movie."}, {"id": 235, "text": "Definitely a far cry from the original, the storyline was weak, the new cast members added nothing, and overall lacked charm."}, {"id": 236, "text": "Way to take a 10/10 classic and make a nonsensical sequel out of it. None of the character's motivations make sense, the feeling of danger from the first is gone and the jokes never land. Just an insanely bad movie but like I said, made all the worse because the first was so good. Props to the leads and the dads though. This script is SOOOOO dumb. Note: this was not written by the guy who wrote the first one."}, {"id": 237, "text": "Not sure why this has such a low score. It isnt the best horror movie but it's pretty great compared to other recent horrors. This is not a thriller and I recall no jump-scares but it was a fun, laid back movie that didn't take itself too seriously. The jokes are funny and the music is great. The ending becomes predictable along the way but thats OK, still a solid movie to watch around Halloween. I didnt care for Jenny Ortega in the role of Phoebe. She and Judah Lewis and zero chemistry. Aside from that, the film could not have been more perfectly cast. Definitely Recommend."}, {"id": 238, "text": "Movie with sequel usually bad and this proof it. First one is quite entertaining and funny but this one just empty and lame storyline."}, {"id": 239, "text": "I thought Samara weaving and Judah Lewis excellent in this comedy horror film upon a babysitter. I highly recommend this one for those who like horror comedies."}, {"id": 240, "text": "The good...a few funny one-liners, some memorable deaths.The bad...Predictable twists, pointless new characters, zero plot, and some very cringy moments. At times felt like they were trying way to hard to appeal to a younger audience."}, {"id": 241, "text": "Poor Cole, every girl he crushes on turns out to be a cult queen. It's a relatively silly romp that brings back the ghoulish gang including Bee-in-her-cutoffs (Samara Weaving). Not one of McG's better efforts."}, {"id": 242, "text": "I'm already loving it, seeing our dear characters again, and reliving them, in their broadest, most delicious sense, as much as the first, but without that insurmountable surprise effect that only the originals cause, a lot of love for this playfully bloody franchise ... passionate and fun, especially for teen horror fans ..."}, {"id": 243, "text": "Not as goog as the first part, but I liked it. Kind of different from all contemporary minority-pride-all-the-same movies. CGI is awful and the plot quite similar to the previous Babysiter but anyway, there is nothing better on Netflix nowadays."}, {"id": 244, "text": "So I give 8/10 to this movie because in my sight of view, this film brings pretty much everything as expected, it's a Horror comedy with great actors, there's also the great elements used in the scenes, such as pictures, visual elements and soundtrack. And as I said, the awesome acting by the cast! Like the first film, the movie make us create expectations off what is going to happen, but in this one with see the same thing that we already saw in the first movie, but even with that, is a great movie and has a great plot twist."}, {"id": 245, "text": "The first film was great and this film didn't miss a beat. Same comedy to horror ratio with tons of laughs. The way they bring back the original dead cast was brilliant. Fans will not be disappointed."}, {"id": 246, "text": "It doesn't have the shock and awe or the thrill of the first one but its still pretty decent. A good choice for a silly little comedy-horror to watch while getting high or drunk. Hope they don't make any more sequels though."}, {"id": 247, "text": "Have a laugh, watch a few grewsome deaths, listen to a lot of cheezzy oneliners and enjoy. It is no Cabin in the Woods, but it is pretty funny😊. Look for reverse roles in Better watch out."}, {"id": 248, "text": "If you liked the first one you'll like the second. It's the same silliness like Max not having a shirt on for no reason and over the top death scenes. This isn't going to win any Oscars and it's not supposed to. It's for people that want to watch a movie that makes you chuckle and forget about reality for 100 minutes. It's also on Netflix so it's basically free. What is there not to like?"}, {"id": 249, "text": "To summarize in short, this movie unfortunately tosses a lot of the character development of the first movie away to have some of the same shtick as in the first one. Some ideas about the supporting characters are mostly underdeveloped. The story in itself isn't as naturally progressing, coherent and well paced as in the original or even good. However, the movie has more laugh out loud moments than the first one. The one liners and situational comedy are actually better. The ending is satisfying in its own merit. At least I feel that way but also can see contrary opinions. On a final note, I'd say it's a good follow up even though I still prefer the original for the emotional journey."}, {"id": 250, "text": "The first part was funny and somewhat new, but this one is a on a new level. They really worked on shortcomings of the first one. Bigger budget, bigger scenes, still funny jokes. It's just fun and entertaining. The movie really delivers on what it's supposed to"}, {"id": 251, "text": "Comedy with gore sprinkled. Most of it made me cringe. Few good jokes but far few between. Sucks cause i loved the first movie humor.Acting is alright, Blonde best friend not a fan. The new punk chick is such a not like other girls cliché. Black clothes wears a choker obsess over alice in wonderland tom boyish lol.The kills are funny like the original over the top blood and guts. Soundtrack is pretty fun too. Gets better after 45 minutes. the first 30 minutes are boring almost made me turn off the movie.First one is so much better but it can make a cool double feature movie night."}, {"id": 252, "text": "Action, gore, good plot, romance, humour parody -thoroughly enjoyed it"}, {"id": 253, "text": "The babysitter 1 was quite good for 90 minutes running. This babysitter killer queen continues with the characters and storylines introduced before. The part 2 started well but, didn't continue its plot like its previous one. Not the best though but, not boring too. Watchable"}, {"id": 254, "text": "We have a more unnecessary sequel, when I saw that this movie would have a sequel, I was excited because the first one was really good, and it brought us something fresh, a good combination of horror and comedy, but this movie fails. That, I thought they had changed the director, but I see that it is the same, I think I really did not want to make this film, the humor is poor, the performances are exaggerated and it does not manage to convey the suspense of the first, the big surprises of the film They are ridiculous and without any explanation, in the lake scene when it is discovered that his friend betrayed him there, they were able to rebuild the path and bring us that suspense and action from the first one, but they decide to go for the comedy, really the only character and arc that ok is Jenna Ortega's, but the rest is very bad"}, {"id": 255, "text": "Loved the first movie. And this is just as good. It's a must watch for horror/comedy fans!"}, {"id": 256, "text": "SO MANY GREAT TWISTS AND THRNS I NEVER SAW COMING!!!"}, {"id": 257, "text": "A sequel to the largely average film that nobody asked for, KILLER QUEEN sees the geeky hero from THE BABYSITTER once more subjected to the machinations of the members of a Satanic cult with bloodshed and murder in mind. It's an action-oriented narrative with tongue firmly in cheek, packed full of pop culture references and jokes and very little more besides. The characters are bland and one-dimensional, the jokes scatological, and the OTT death sequences surprisingly repetitive and tiresome, with every cast member seemingly getting a bucket of blood chucked in their face at some point in the movie."}, {"id": 258, "text": "Absolutely loved the original film, and when I found out a sequel was landing on Netflix I was crossing off the days. Just finished watching it, and was not disappointed. Not as much gore as the first film, and the deaths were mostly predictable which made it much more fun. I could see what was going to happen and was Oh they wouldn't, oh they are, oh hell yes!. Definitely more camp than the first, and just as enjoyable. Definitely one I'll rewatch, just like the original. Please PLEASE make the trilogy complete, please make the third film. Then release a collector's box set, the gag reel and outtakes would be hilarious. And please stop putting Robbie Amell on screen all the time shirtless, he's way too overdressed."}, {"id": 259, "text": "I loved how this movie didnt take itself seriously at all,and embraced it campiness. Was it the best movie ever? Hell no,but I did have alot of fun watching it"}, {"id": 260, "text": "Lost it's touch I understand the hate regardless I love the movie! Glad it's by the same director McG is wonderful at his craft, I enjoy almost his films. The Babysitter:Killer Queen is more violent than the first one which I appreciate quite a bit being a huge horror fan! Beautiful cinematography and characters unfortunate that it has several flaws/ under appreciated. The soundtrack is incredible too. Also Emily Alan Lind is gorgeous eye candy which is nice."}, {"id": 261, "text": "The lead antagonist for the most of the movie was beyond painful, yikes. There was little sparks of humour and fun campy horror but always so fleeting. The gratuitous use of blood was fun though."}, {"id": 262, "text": "Not as good as original one story line is unmoving it doesn't keep you engaged till end ..Could have been better although good effort for making it"}, {"id": 263, "text": "This movie it's really weird, funny but not funny. I don't think this movie needs any sequel, But ya this movie is ok"}, {"id": 264, "text": "The movie tried SOOO hard to be so bad it was funny but no it was just bad!!!! The only good things about this movie were Jenna Ortega and of course the fact that it ended!!! Bach had a few slightly smileable lines but besides that it's garbage, and I do plan on suing for the cause of depression anxiety and suicidal thoughts."}, {"id": 265, "text": "For once I'm gonna be brief, because not much needs to be said here.The writers, or the directors, or both, had no idea why the first movie succeeded. It was clearly a fluke, and in their attempt to recreate the magic, they failed absolutely.They bring back dead characters from the first movie, and even redo jokes from the first movie. It's honestly very trashy. There are very few redeeming qualities about this movie in anyway. They took the superficial charms that HELPED make the magic from the first movie go from good to amazing. But that's like taking the rims and flashy lights off of a tricked out car and putting them onto a garbage car from the junkyard and calling it good. It isn't good. I shouldn't have to say that, but then again, I do, because here we are, and this is the movie they created as a sequel.But that's me being nice about it all."}, {"id": 266, "text": "You must watch the 1st Babysitter movie prior to this one for the 2nd to make sense. Yes, there are still logic lapses, but the overall tension &amp; fun created make you forget the lapses.Otherwise, get ready for some good laughs in this over-the-top gore filled supernatural sequel that is indeed better than the original; but in reality completes &amp; complements the first Babysitter movie."}, {"id": 267, "text": "Yes, I know a lot of people aren't fans of this movie. I am not one of those people. I liked this movie as much as the original. However, there is a reason for it. There is a nice twist that I didn't see coming that I LOVED. I also liked how Cole's parents were in this more and there were actually some emotional scenes... However, the dialogue is some of the weirdest and unnatural. Hell, sometimes even cringy. I'm also not a big fan on the ending... it feels out of place and out of character for some. If you liked the original, watch the sequel."}, {"id": 268, "text": "I really liked the first one, I was on track to like this movie that brought back a lot of the old cast. Robbie Amel was by far the best outta the old cast but they all still has the camaraderie that was so much fun in the first one. But damn this movie was really missing a strong relationship like Cole had with Bee. The biggest trouble with this movie is the twist in finding out that Melanie is the leader of the new blood cult and she's this cold blooded psycho killer, it made absolutely no sense and the throw away explanation was complete trash. I hope they make another movie cuz I think this franchise is still a lot of fun to watch."}, {"id": 269, "text": "Don't believe the hate. This is different from the first film but filled with humour, great kills and fun pop culture references. Tongue firmly in cheek through out. Check it out."}, {"id": 270, "text": "This movie is bad cuz its very unrealistic like how does a deer explode by just one bullet, but when a bullet from the same gun hits her in the heart she doesnt die!? The movie isnt even funny at all! I recommend not watching it"}, {"id": 271, "text": "I loved the first movie and was so exited when I heard that a sequel and it doesn't disappoint. Does everything a B horror movie should it's deaths are gory and over the top. There's some comedy in there (some bad on purpose which just adds to the charm) and the story is easy enough to follow. If I have one complaint one characters reasoning from going from bad to good seems non existent and it just happens and the timeline confused me slightly but those are nitpicks to a fun, violent horror movie."}, {"id": 272, "text": "It was good and funny, both dad's cracked me up every time on screen especially Ken Marino."}, {"id": 273, "text": "I was pretty disappointed in this film because I LOVED the first one. I enjoy horror comedies and thought the first Babysitter film was seriously underrated. To me, this sequel was trying too hard and become a little too ridiculous at times. It didn't flow as well as the first one and had some truly cringe worthy moments. It was still entertaining and worth the watch. There were a few good twists along the way. I was honestly REALLY upset that they made his neighbor that was so sweet in the first movie end up evil in this one though.....I could have done without that. It just didn't seem believable that she would have changed that much in such a short amount of time without any reasonable explanation."}, {"id": 274, "text": "All the elements that make the first movie good are used again, overdone, and there is some simply ridiculously bad character backstory thrown in for added confusion."}, {"id": 275, "text": "To summarize: this movie was so awful, it was actually entertaining and funny."}, {"id": 276, "text": "I enjoyed both movies. Did not watch any trailer or expect the movie it just popped in my Netflix feed. I was surprised and shock on the plot twist. It was fun, and entertaining. I laugh a lot, it gets crazier and crazier and sometimes pretty stupid. I enjoyed this second part it so much. Both movies are a guilty pleasure."}, {"id": 277, "text": "Babysitter killer Queen is a sequel to a very surprising first film that had a lot of fun moments and very cute and likeable cast and characters,this one isnt on its level unfortunetly,it had some laughs but it lacked originality and bigger fun aspect that original had..Cast was good here but i found mixing old and new crew of cult to be very lame and it wasnt so interesting in a such a way.Gore and deaths were fun but sometimes they didnt have that comedic way in them and they didnt have a big impact on me,Babysitter killer Queen was a fine film but it lacked some staff to be as good as original"}, {"id": 278, "text": "Absolutely loved it, was easy fun from the get go. Enjoy!"}, {"id": 279, "text": "Even in the flashbackThis movie is pretty bad fr tho"}, {"id": 280, "text": "The sequel picks up 2 years after cole survived and no one at school believes his story. Even though this movie only came out 3 years later the actors for melanie and cole look like they have aged 10 years or something.Anyone that's a video game fan and has played tony hawk pro skater will get a kick out of one scene like i did when one of the classic songs from the original game starts playing.I thought this movie was better than the original but after rewatching them back to back i'm not too sure which i like better. First has more funny moments but the sequel has the better killings. Just like the first there is a mid credits scene that hints at another movie to come."}, {"id": 281, "text": "I like this movie,is comedy and horror.I love this film,great film"}, {"id": 282, "text": "A great sequence to a great movie.It has voilence and a essence of comedy."}, {"id": 283, "text": "These are fun and gory so please continue the story and more Bee in the future!"}, {"id": 284, "text": "The Babysitter was such a great out of the box thinking comedy horror movie. When the sequel was announced I cringed. Most don't compare to the original, how lucky we are this one is it's own Terminator 2!With a returning cast, writer and director there wasn't an odd turn from the chemistry that made the first movie such a fun watch.Seeing our main character, Cole, grown up a bit, and a couple years down the road from the Devils night is really great. Judah Lewis Cole remains loveable, awkward and heroic. Jenna Ortega plays Phoebe a new character that is a wonderful addition and key component to the film. Storyline is excellent, the gore, the laughs and fun moments are plentiful. Anyone that's given this a poor rating is simply angry with life. lol"}, {"id": 285, "text": "This is epic, just know. I recommend all of u to watch it."}, {"id": 286, "text": "Basically, it was watchable but just barely. Samara Weaving owned the first movie. She was barely in this one and they tried to replace what she brought to the table and failed. It was the equivalent of watching sharknado. Kinda fun, mostly stupid, but as far a sequels go. They tried too hard."}, {"id": 287, "text": "Very disappointing Sequel. I loved the first film! It's more gory than the first one. It has some good parts init. Cole's parents was annoying as hell. It was very predictable at times. It's worth a watch at least. I had high hopes for the sequel but it never delivered. I thought Cole's new love interest was good init.I can't wait to see her in scream 5! Bella Thorne was hilarious yet again! 5/10"}, {"id": 288, "text": "I enjoyed the first movie. It was a clever, though not as clever as it thought it was, horror comedy with good performances and some inventive storytelling. This sequel was less so, with some pretty off logical leaps, poor pacing, and over the top character moments. Despite all that, I was still enjoying it overall as a mindless movie, until the ending. That straight up ruined this movie. Would not recommend. Giving 3 stars because it still had a few redeeming qualities... But not many."}, {"id": 289, "text": "Yeah movie was ok ok but last part was way better than this time pass movie it's"}, {"id": 290, "text": "Honestly, when I discovered that they had decided to make a sequal, and that it had only just been released, I thought 'what the hell', and decided to watch it. Honestly, that is time that I am really not going to get back again, namely because it ended up completely butchering the original film. Like, this film that ended up creating so many plot holes that it made me squirm with disgust. Then again, I probably shouldn't be all that surprised since one probably should expect that sequals have a habit of completely butchering an original, to the point that you basically want to pretend that it doesn't exist, but unfortunately it is just way too hard to unsee it.Like, what really got me was that they decided to make our protagonist's best friend as the big bad, which I just thought was really, really annoying, and certainly made no sense whatsoever. In fact, it just completely destroyed the film. Okay, I can sort of see why they decided to do it, and there are a couple of hints that this is the case, but honestly, it was basically a wasted effort.The other thing that was annoying was that they decided that there was no evidence that the events on the previous film happened. Yeah, come on, pull the other one. We have two missing cops, five missing teenagers, and a fireman that was stabbed while he was in the house, and all of a sudden people think that it was all the figment of his imagination. Yeah, that really didn't work, but I was sort of able to roll with that one, it was just when they decided to make Mel bad that it really put me off.Actually, Mel's Dad was a bit odd as well, though when I checked it out it is actually the same actor playing him, it is just that in the first film he came across as this suave ladies' man, and in this film he is suddenly a video-game playing pot head. Yeah, that really did confuse me, and once again it really didn't make any sense as all. Okay, I guess the whole let's make Mel evil sort of worked to open up some room for our protagonist to have another girlfriend, but yeah, in the end it was just annoying.Oh, and the ritual changed as well. In the first movie it was just a sacrifice, and you poured the blood on the book (and wasn't the book destroyed as well?), but now you need a sacrifice, and a virgin, and you drink the blood and get, well, I don't really know what you get, though since the kids from the first film were brought back, apparently it was just so that they could come back to life. Also, we get a bit of a back story on them as well, but once again, it seemed to just completely undermine everything we understood about the characters from the original film.Yeah, if you liked the first one, I'd pretty much recommending avoiding this one like the plague. It's pretty unoriginal, and completely destroys what had been set up in the first film."}, {"id": 291, "text": "The sequel was enjoyable at times, but didn't make a lot of sense. It was mostly a redemption arc for the babysitter from the first film, but it ruined the innocence of his only friend in that film... That's my main complaint."}, {"id": 292, "text": "This movie was definitely not as good as the first one. I don't know if it's just because of Samara's great acting in the first movie but I really disliked that she was BARELY in the second movie until the very end. I guess that it makes sense in a way, but I just feel like they really missed out on leaving her out for most of it. BUT I get that she was probably busy with other movie projects so I guess that's why but overall I'm still disappointed."}, {"id": 293, "text": "What was that ? Why did they think that the first movie needed a sequel ?"}, {"id": 294, "text": "Spoiler: watch something else!Again... This movie is complete and total garbage part 2. And again,, I didn't even bother watching this thing. Instead I watched found flix explain this boring torture."}, {"id": 295, "text": "A little slow here and there and big time cheesy. Acting, sound and video were all well done. It will not win any awards but it was a fine followup. I did not see the trailers so I was not expecting the previous killers to show up. The cheese comes in when they do flashbacks on why the original characters sold their souls. Massive cheese on that, especially the black guy wanting a singing career.It has a surprise in there that you may or may not have expected from one of the original characters. The girl that he had a crush on in first movie turned out to be one of the bad guys. Maybe I was looking away when they did the flask back but I don't remember why Melanie sold her soul. And of course the innocent Cole sneaked in a little quickie so that he was no longer innocent and it messed up the sacrifice."}, {"id": 296, "text": "To be honest, this sequal is not bad. In fact, I love it more than the 2017 movie. They had better storyline, good soundtrack (most of them are classic rock ... Cool), a great reference to massive pop culture. The only negative thing is that Sam Weaving is not as hot as the 2017 movie .. hehe."}, {"id": 297, "text": "8 bad guys instead of 4 means some death had to be rushed, King Bach and the bimbo are annoying but the Shirtless dude is still hilarious.It's alright but don't expect too much."}, {"id": 298, "text": "Film is hilarious. It's not supposed to be taken so seriously and that's the greatest part. Love that Mac is still randomly shirtless without any explanation as to why, and he continued to hype up Cole. Cool that they sort of came full circle and answered a few questioned from the first film. I enjoyed watching this you just cannot go into it without expecting cringe cause it's meant to be there. If you saw the first I recommend seeing this one too!"}, {"id": 299, "text": "The movie has a lot of fails, the plot is weak and a bit generic, there's not character development and has tones of plot holes. BUT, if you don't expect a good movie, you'll definitely enjoy it and have a really fun time"}, {"id": 300, "text": "The babysitter: killer queen is fun and funny. It's a worthy sequel to the original, which I also liked. I especially appreciated the detail that went into the scene building; I felt the background had as many jokes as what was happening in the foreground. Is it sophisticated? No. But what did you expect? I'd compare it to tucker &amp; dale vs evil: it might not be particularly high brow, but it plays with loads references, and I was entertained from beginning to end. If you like gory horror that doesn't take it itself too seriously, I'm sure you'll enjoy it. I'd give it 7/10, but it gets a +1 because the current rating is so low."}, {"id": 301, "text": "Great watch, would watch again, and can recommend.This is every bit as good as the first movie with even more good bits piled on.It's a little graphic at points, and while he was just accidentally killing the people after him in the original, he's much more active in the circumstances this time.I do feel like it's a better (and more informative) story than the first, but the premise of the original movie being covered up is suspect to me.It's well worth the watch, but be sure to watch the original first as you won't get the same value out of this one if you don't."}, {"id": 302, "text": "I watched the 1st again before watching this one cos I'd kinda forgotten stuff. Some jokes are rehashed but to good use. When you watch this 2nd you will see what I mean. Plenty of gore (like the 1st), some great one liners and a fun story. You get what you pay for with a movie like this, fun, blood, humour and a good time. Well recommended. Zero nudity though. Dammit."}, {"id": 303, "text": "I like campy horror movies. When they are done right they are usually pretty fun to watch. This (and its original) brings on the comedy and camp in all the right places. Its fun and gory and often times somewhat meta when it talks about movies like the Terminator Franchise. The movie knows itself and knows what it wants to be and doesn't pretend to be anything deeper then that. If you liked the first movie you will like this one as well. The low rating coming mostly from people who think this kind of horror is stupid."}, {"id": 304, "text": "Before you watch this movie, remember to clear your mind from gore slashers or strong drama-horror movies. its a silly , bloody and funny movie which makes you keep watching and for sure it worth watching for once.ENJOY"}, {"id": 305, "text": "First movie was better, this one has too much forced comedy and acting but it was fun to watch"}, {"id": 306, "text": "I was really Excited to watch the sequal but the product was not what I expected from the director and ofcourse the ending saved this movie from being worst....."}, {"id": 307, "text": "Two years after the events of the first film, the satanic cult return to finish what they started and try to kill Cole again.Although not the heights of his Terminator Salvation outing Mc G returns to form with sequel to The Babysitter, Killer Queen after the ill conceived toned Rim of the World.Likeable lead Judah Lewis and many of the cast return for more gross out gore shenanigans. MC G The Babysitter: Killer Queen offers more blood, comedy and mayhem, more importantly more world building satanic twists. It moves along in a brisk pace, echoing an outlandish 80s slasher cash-in sequel.The supporting demon cast return and are are on same fine form as the first outing, delivering a backbone of humour, especially one liners. Despite actress Samara Weaving giving off a vibe she's been dragged back for this with a fleeting follow up appearance, her Bee role is pivotal. Hopefully she'll turn up for a third. That said, Emily Alyn Lind returning as Melanie more than fills the gap throughout and along with Lewis shoulders the film. Jenna Ortega's Phoebe is a welcomed addition to this fun horror adventure.Overall, Killer Queen does what it says on the tin, one of the better Netflix productions, if you like the genre."}, {"id": 308, "text": "The series went from campy to cheesy, but it was still pretty good."}, {"id": 309, "text": "Even though it was significantly better than the first film I was a little bit cringe and some could say that the portrayal of black characters is a bit offensive and stereotypical. Other than that it was a decent movie to watch on a boring Friday night."}, {"id": 310, "text": "Had all the same jokes but the surprise was taken away. The intros were the highlight for me for this movie."}, {"id": 311, "text": "This movie is trying to go for the esthetic of a b-list horror movie, but isn't funny and satirical enough to be a parody, but also too poorly acted and written to be just a homage. It has direction that seems is trying to be stylized, but it doesn't pan out. Specifically one scene looks like a knock of scott pilgrim vs the word. all in all not a great film."}, {"id": 312, "text": "It's good story &amp; good catch up to previous part just not realistic anymore everything is so much overacting in some scenes which make that scene complete Cringe so if you can accept little cringe every 4 min of film - go ahead watch it"}, {"id": 313, "text": "The Babysitter: Killer Queen might be fun to watch, but it's one big hide and seek show (where you're trying to see through all the hidden layered thrash that's put into this movie, to be able to see how bad it is). The movie is filled with unnecessary edits/effects, useless conversations, way too much songs, and dumb jokes (and not even funny ones). All of these just function as a layer to hide how bad most of the scenes are. If you'd remove everything I just mentioned from the scenes they appear in, you'd end up with bollocks (because the acting is just as bad). I mean OK it might be 'fine' for the genre this movie belongs to but man i've seen way better."}, {"id": 314, "text": "When I saw the trailer I think: this film will be horrible but jenna ortega's work will be incredible. I was right. The film is awful. Its like a parody. The good thing: Jenna Ortega. She's incredible. Her work is really good. Dont watch it, the film is awful. PD: 3 of the 4 point are from jenna ortega."}, {"id": 315, "text": "The actors are all seemingly enjoying themselves and the new love interest is just as good in this as she is in 'You'. Bella Thorne and Robbie Amell are particularly good fun although surely the latter should be getting more opportunities to play an adult by now. Like others have said, the twist of having the main characters best friend from the first film be the big bad kind of spits in the face of the original and it feels like there is a lot of plot filler. Also the fact that the main boy (can't remember his name) has lost all the courage he built in the first film feels like a back step.Certainly not terrible but inferior to the first one which I found to be a lot of fun."}, {"id": 316, "text": "A poor attempt at cashing in on a popularish film. SUCH a good idea but it's like drinking wer through your own sock while and alone and just becsue you're bored. You weirdo!!Too much forced comedy. It just doesn't work.I have no idea if I'm correct here but this feels as though a white guy from Finland saw 'Friday' for the first time recently and tried to work off that idea... But just not good.This film is Logan Paul."}, {"id": 317, "text": "Bad writing. Bad production. It isn't a horror movie, it's not a comedy. It's like a 4 year old rewrote A Scary Movie. Acting isn't terrible but pretty cheesy sometimes because the writing is so bad."}, {"id": 318, "text": "I enjoyed the first movie well enough. I saw the trailer for this sequel and thought it looked terrible so there was no excitement. Well it was indeed terrible. They decided to go the route of making everything more outlandish than the original. It is to the point that it just felt like they were trying to hard. The dialogue is absolutely obnoxious which comes from script writers trying to force crappy jokes for the sake of jokes. I laughed maybe twice the whole movie.The cgi is awful, the acting is hammy and the plot is nonsensical. In typical Hollywood fashion they had to force in a love story between characters who know each other for a few hours.The twist at the end is absolutely pathetic and lame. Stay away from this if you liked the first movie."}, {"id": 319, "text": "I didn't mind the film, a really easy watch, with not much depth but not boring. But why is a 14 year old encouraged to have sex and why is a scene heavily implying sex between two underaged teenagers included in the film.....Cole was 12 years old in the first film. This film is two years later...making him 14, 15 max. I am no way a prude but I just think it is a bit wierd that someone who is possibly 14 is pushed to have sex? Then congratulated by everyone when he does and is no way as seen as a problem....."}, {"id": 320, "text": "3 movie pls its really good i enjoy it maybe new characters for the i go for robbie Amell is a good actor"}, {"id": 321, "text": "It is a really bad movie, like, I wouldn't pay money to go see this...but it is great if you just wanna get a group of friends and watch a horrible movie together. it was hilarious on its own and witty friends made it even better."}, {"id": 322, "text": "An unnecessary sequel if the cast is taken into account, even so, The Babysitter: Killer Queen is saved with just enough by the good mix of horror and comedy."}, {"id": 323, "text": "I loved the first one and was ecstatic to see the sequel. Unfortunately, this movie lost nearly all the charm that made the first one so good; was riddled with plot holes; and most of all, suffered from a severe lack of Samara Weaving.LACK OF CHARM The first film was filled with cute, gimmicky scenes (think video game style scenes). As a grown man in his late 20s, I would think it would be nearly impossible to be intrigued by a movie starring a little boy. But the charm made it happen. There was a slight sense of humor in many of the scenes and it kept the viewer interested.In this movie, however, nearly all charm was gone. Some scenes tried too hard to be charming, specifically the fight scene between the two love interests (boring). I also cringed at Phoebe's introduction scene as it felt overly forced. I can only imagine how awkward it was rehearsing that scene over and over. The entire movie was just too one-dimensional and didn't feel special like the first.PLOT HOLES First off, the entire premise of the movie is that nobody believes Cole that the events of the first movie happened, since Bee did such a stupendous job cleaning up everything. Was everyone there ignoring the fact that Bee just disappeared? Did that not raise any flags? What about the fact that four other teenagers were gone as well as two cops? I could go on about this but it was immediately apparent that the viewer just had to accept this major flaw in order to get the sequel, I guess.Secondly, Mel going evil made no sense. Literally zero. I understand that it was supposed to be a dramatic twist, but come on. She says that she joined the cult because she wants to be an influencer. Wow, how creative. We are soon after shown a scene where Bee is egging on Mel to want more and more followers, which suggests that Bee is the mastermind behind all of the cast's resurgences. Okay, that make sense. But later, it is revealed that Bee cleverly set all those people up in order to protect Cole and Phoebe. So, Bee turned Mel evil in order to save Cole and Phoebe from Mel? Makes no sense. The same applies for all the other evil characters. Bee was the instigator and also their undoing.SAMARA WEAVING Okay, here it is. Nearly all of the reasons that the first movie was great was based on Samara Weaving playing Bee. She was this cool, slick, sexy in-charge chick. She made the first movie what it was. But in this one, she didn't really make an appearance until the final fifteen minutes and even then it was only a shell of her former self. She seemed emotionless, timid, and downright uncomfortable. It was incredibly disappointing to see such wasted potential. Perhaps most curious was how Bee was Mel's babysitter. On the one hand, it was neat how there was some explanation toward how Bee became the evil person she was, but it also felt like a giant cop out of a storyline.There are several other things wrong with this movie that I didn't get to, but the disappointment is currently overtaking me from writing anymore. Overall, there are so many other directions a sequel could have taken based on the first's ending. This movie was a C+ at best and I'd caution fans of the first to take heed when watching this, and perhaps avoid it altogether in order to maintain the integrity of the first movie."}, {"id": 324, "text": "I enjoyed The Babysitter, however, The Babysitter: Killer Queen had very little in common with the first film. The issues come down to Brian Duffield not being retained as the screenwriter. The team of McG (also Director of both films), Dan Lagana, Jimmy Warden, and Brad Morris cobbled together a film full of unrelated film references and teenage sex jokes.The Babysitter wasn't a masterpiece when it came to dialogue, yet in comparison to its sequel, it looks Oscar worthy. The Babysitter: Killer Queen doesn't have anything clever, wastes money on needless graphics, and fails to deliver on narratives in the original.It's shocking the script used for the film wasn't a rough draft for a potential plot sequence. The Babysitter: Killer Queen took the worst possible narrative and turned it into a barely coherent sequel.If you are going to produce a sequel, at least keep it true to the source material. It may also be helpful to retain the individual who drafted the first screenplay.Real Score: 3.6"}, {"id": 325, "text": "This instead of running away from cultist psychopaths in his house and yard, Cole will have to survive on mountains and boats. You know what that means, bigger budget!First of all, trailer gives too much away, they shouldn't have shown return of a specific character, which was supposed to be suspensful in movie to have any kind of emotional impact. But I saw it coming from miles away, so it fell flat.Other than that, it's a fun supernatural comedy like the last one. Little bit too much flashbacks to original movie for a 100 minute movie but it shouldn't have been longer than this with this script. If you don't like seeing movies where parents are stupid, kids running around with guns &amp; knives and supernatural elements which you just got to believe, then you might not like the movie.Overall, a fun one time watch for fans of original."}, {"id": 326, "text": "Don't get me wrong, the babysitter is one of my favorite movies of all time. but this was... incredibly hard to watch. it just sucked so bad. from the incessant 2019-2020 pop culture throwaway lines to the horrendous expansion in world, i truly disliked this film. about 20 minutes in, i knew that a tiger king reference was bound to happen at some point. still, my soul was incredibly crushed when it happened. all of the first movie's wit is replaced with cheap and honestly confusing lines like he's the channing tatum of killing people. wtf does that mean? everything that made the babysitter great is now done in excess, making a sad parody of what was a really great film. funny bits from the original are played out and the overall reliance on such callbacks is tiring and cringeworthy to watch. all of the new characters are uninteresting and under-developed and all of the original interesting side characters (cole's parents, melanie's dad, etc) have an unwarranted amount of screen-time in which they fail to become more likeable or funny. the unnessesary amount of new characters is alienating to fans and the decision to move cole outside of his life/microcosm and into the real world is unnerving. it's so clear that without bee, the story falls apart. her charm is completely absent and the lack of a complex and lovable central relationship (bee and cole) is painstakingly apparent. even the font change (a very bold choice), is completely wrong for the film. the 80s slasher aesthetic of the first movie is symbolically reduced to that of a cheap 2000s remake. i honestly really wish i hadn't watched this movie. if you like the original babysitter, please BEWARE!!! truly disappointing. +1 star for cool deaths"}, {"id": 327, "text": "A mostly pointless, forced, and incredibly formulaic sequel- The Babysitter: Killer Queen is not only a horror installment that didn't need to happen, but a very odd film, that bears the question all throughout, why? Besides the films many frustrating and cliche moments, it does keep a consistent enough pace to keep you entertained. For horror fans, who don't mind the content as long as it is entertaining, the film is a rather average sequel with the same flaws as the first film. Unfortunately for me, being entertaining, was simply not enough. This film is absolutely braindead, with the script having the intelligence level of a very violent 7 year old. There is nothing new about this film, nothing exciting, nothing memorable, and absolutely nothing special. It's just incredibly bland. The acting is as mediocre as the first film, and though the film does seem to finally give us a somewhat interesting character (Phobe), Jenna Ortega's performance just doesn't seem to fit the character on screen, and it ends up making her performance look a bit forced. However, there is very little about this film that isn't forced, whether it is its outlandish plot, plot twists, or incredibly lack of originality- the film doesn't feel like it should have been made, let alone attempted. In the end, The Babysitter: Killer Queen is an unneeded sequel on all fronts, and I would be completely fine with the franchise dying here before this franchise can somehow get even worse out of hand. My Rating: 4.5/10"}, {"id": 328, "text": "Babysitters. Quick cutaways. Exploding heads. The required makings of a new loving relationship. Parents that simply refuse to understand that there's a satanic cult running amuck in their community promising members all their earthly desires - if they could only get that one crucial ingredient. All the ingredients measured out and added per the recipe But Wait! There's More!How long has it been since you saw a flick from this sub-genre? 'The Babysitter: Killer Queen,' is truly a guilty pleasure that mixes the recipe up just enough to make it fun. I won't bore you with the esoteric nonsense. The plot is familiar. The director directed; actor's acted; blood pumpers spurted; pyros went boom; and CGI FX were as good as could be expected, given the budget.The only wiggle room was to have a bit of fun while making the film. Brief cutaways to familiar song &amp; dance routines were kinda' cool. Occasional irreverent cartoon-like captions pit a unique spin on those we'd expect to see in the Adam West TV version of Batman.It's a true No apologies asked for; none given, film that looked fun to make. I say go for it - It's' fun with enough blood for everyone!"}, {"id": 329, "text": "As far as sequels go, they don't get much better than this. If you liked the first instalment, you're going to consider this to be a great treat. Critics hate the film (as they do most films of its style and genre) for the same reasons fans love it. It's packed with crude and vulgar comedy, unfiltered gore, racial and sexist stereotypes and does a great job of following up on the storyline while leaving an open book to a third instalment. Don't let critics and the occasional scathing user review deter you. This type of comedy has a job which is to establish the line of what is acceptable humour, get right up to the line, walk it and barely teeter of the edge. To a critic who prefers the oscar nominated material and to a sensitive viewer, the comedy and themes will be to much and downright offensive. To the rest of us (who are the majority) this is about as satisfying as a sequel could possibly be.I'll be eagerly awaiting more from the whole production crew and crossing my fingers that they make this into a trilogy!"}, {"id": 330, "text": "So, right out the gate, I admit: I'm a total mark for this movie. The first one was one of the most pleasant surprises in the comedy-horror sub genre of all time, in my opinion. It caught me totally off guard, was released with next-to-no fanfare, and when I first watched it, I knew I was seeing something special: a movie that sneaks up out of nowhere and knocks my horror-loving-socks-off. It was BRILLIANTLY scripted, cast, paced, and executed (no pun intended. Ok, slightly intended.)When I found out about a sequel? I was pretty much sold from the word go. BUT, that's not to say I don't have my qualms. I'll try to avoid outright spoilers, but here are a few nit-picky problems I had with the underlying premise for the sequel:So our tale begins with hapless Cole being viewed as a cuckoo bird because everybody believes the entire ordeal from the first movie was a delusion.Now, look: I know the movie isn't meant to be Citizen Kane, and suspension of disbelief is important when watching brain-candy movies like this (even though, as brain candy goes, both Babysitter films have WAY smarter dialogue and humor than they have any right to, but I digress,) my problem, from a plot standpoint, is a relatively glaring one:Why does no one find it strange that Cole's babysitter, on whom Cole correctly blamed the entire massacre, is nowhere to be found afterward? What about the nerd they sacrificed at the beginning of the ritual? What about the other cult members? What about the POLICE OFFICERS WHO GOT MURDERED? I literally just went back and checked: after they kill the cops, Bee makes Cole give the dispatchers the code for all clear. The dispatcher initially says what's the status of that 187 (homicide) call on Bigby Drive?I mean, c'mon. Those officers were *documented*, *dispatched* to Cole's house to investigate a murder, were then summarily executed, never to be seen nor heard from again. Cole later recounts the entire story to the authorities with Bee, the entire cult, two police officers, and a nerdy high school/college student ALL missing without a trace- but everybody is stone cold certain that Cole is nuts? His parents included? Even though they've MET Bee? Like dozens of times? Did they not think it was weird that she abandoned their son while she was supposed to be babysitting him? lolAnyway. End rant. That's just the one thing I had a hard time getting over. It was almost distracting how much of a plot hole it was. And for such an otherwise well-written movie, it seems like it wouldn't have been that hard to write this sequel more or less the same way, with a few minor adjustments, without having us believe Cole would be viewed as a loony-tune.REGARDLESS lol, I swear, I actually did love this movie. It's just plain fun, getting to see all these wonderful characters up to their old devil-worshiping shenanigans again. And they really doubled down on the gore. Which any true fans of the genre (Evil Dead, Cabin in the Woods, et al...) can appreciate. Did NOT see the twist coming, admittedly. But once it arrived, I was like alright. I can co-sign on this. It required a *LITTLE* bit of retconning, but it works. And I was happy with the ending.Yeah. Alright, I'm done. If you liked the first one, you'll probably have fun with this follow-up, too. If you DIDN'T like the first one? First of all, what's wrong with you? Second of all, you probably won't like this one either, in that case.Final thought: Max having his shirt off in the fast food flashback is brilliant lol."}, {"id": 331, "text": "Yes, Queen was killer. Unfortunately, this movie was not.Wow...what an original sequel that felt... eh. I LOOOVED the first Babysitter, mostly because of Bee and her chemistry with the hilarious Cole. Here, they were trying so hard to capture that lightning again, but mostly failed.In a unique spin, no one believes Cole of the deadly events of the first movie and in the two years since, his life seems to be going downhill. Whelp, nothing but a good ole boat trip with teens overnight with no parents, no rules and plenty of bloooood to brighten his demeanor.It's definitely original, and still funny, though about 50% less humor than the first one and boy, they tried some of the same gags, or even reversing them to very little effect. The actual new humor was pretty good and the kid (Cole - played by Judah Lewis) still has some of his charm.What was mostly missing was the title character. This wasn't her movie; this was Cole's and his aftermath of that horrible night 2 years prior. So, gone was the chemistry and her absolute charm that made the original film so loveable.I'd say, stick with only watching the original. If you are remotely curious, this isn't *that* bad, it's definitely entertaining but in the end, it'll just leave that famous question in your head: How Did This Get Made?***Final thoughts: Only saw the first one once, nearly three years ago on November 6th, 2017, so I thought I'd revisit it tonight before seeing the sequel. 90% just as good as the first time. What hurt it this time was all the surprises were gone and I knew when the humor and best gags were coming. Still, it was 10x the movie this 2nd and hopefully last Babysitter sequel was."}, {"id": 332, "text": "Decent slasher kills/gore mixed with 20% of the humor landing and the other 80% is awkward, forced and sometimes cringe. The story continues two years after the first Babysitter and Cole is still an outcast. Things get out of hand pretty quickly as expected. Some of the performances are great. Judah Lewis and Jenna Ortega in particular have enough chemistry and give the film a little heart when the movie takes a break from gore. There is one scene that stands out in particular with Cole and Phoebe taking a cruise on a boat at night. In this scene the cinematography, music, dialogue and performances are perfect and I wish there was more like it. The returning cast of killers all seem like they're having fun but most of them are there to be picked off in gory ways and the script does them no favors with some cringe-inducing jokes. Also most of the gore is CGI this time around so that was a little disappointing considering the original mostly avoided this. Overall, I was reasonably entertained throughout the movie but the movie is mainly let down by the script. Imagine the script being that friend that is always trying to be funny but is really only funny 15-20% of the time and the rest you roll your eyes at."}, {"id": 333, "text": "The Babysitter was such a fun and unexpected pleasure that you will want to like it's sequel. In fact, I was eagerly awaiting it. It's a shame it doesn't offer the same guilty pleasures. There are a few shining lights among the disappointing film: Judah Lewis as the beleaguered lead does his best with a script that is pitifully weak. Robbie Amell brings energy to his character once again and Samara Weaving still lights up the screen in her cameo performance. While the cast has expanded to almost double - it isn't double the pleasure.It's still full of pop references as was the first, but they must have determined that the audience for the original had skewed much older than intended because the references are aimed at Baby Boomers not younger people. In one scene a boat named Jenny requires a code to start it. Immediately I knew it would be 867-5309 and I was correct. That's the thing about this film; there are no surprises. The script is predictable and you can anticipate the location of a joke AND even what the joke will be.Now to be clear the acting throughout is competent given the phoned in direction and script. But the quirky characters that appeared in the first film are relegated to the background as a set of new and completely uninteresting generic characters are given a bit of screen time. Their existence were completely unnecessary and I can think of a couple of ways to have written the same script without them.Shame. I really like the first film and the characters. This is an insult to them and the actors who play them."}, {"id": 334, "text": "* There is 1 post-credit scene *The director McG and crew brought an unnecessary sequel. The first film was magnificent, I didn't expect another one and when it was announced I was kind of excited. I thought it was going to be as good but it wasn't. One of the reasons it didn't work was because they tried to do the same thing all over again and by being repetitive it felt annoying. Such a shame, I expected something different but they brought back the same level of awkwardness and the same horror clichés. It worked brilliantly the first time however the second-round felt flat. There are movies that don't need a sequel and when it gets a lot of attention they love to keep squeezing it also by doing so it damaged the original story. Even though I didn't like it, I was still entertained by a few scenes and the gore was fantastic but all I wanted was to rewatch the first film again to try to forget this one.The composer Bear McCreary brought fitting music for this movie. The kind of music that is not good nor bad it just fits well with the atmosphere.I can't say much about the cast performances due to the poor script and there were so many annoying scenes but it wasn't their fault. The one who kept it interesting was the female actor Samara Weaving and it was a shame she had a small role. Her scenes were phenomenal as ever and I would have loved if they explored more her storyline because she is the spark."}, {"id": 335, "text": "I liked the first Babysitter movie a lot. It was a great horror-comedy with a fun premise, great performances and crowd-pleasing thrills, and I'm delighted to say that its sequel follows in the same wake. Impressively building on the story established last time out, Killer Queen is a surprise hit throughout, with the same fun factor as its predecessor, but a story that arguably outdoes the first movie.On the whole, the first and second movies are largely similar, but the few differences that separate them do have an impact. On the one hand, it's fair to say that this sequel doesn't use its setting to a strong effect like the first movie, getting lost in a fairly soulless desert setting compared to the terrifying hellscape of Cole's house being destroyed over one night.What's more, the film is missing Samara Weaving's excellent performance, with Emily Alyn Lind brought into replace her, yet doing little to endear or entertain in quite the same devilishly exciting way.However, although Killer Queen misses out on some of the strengths of its predecessor, it also builds on the first film in some very surprising ways. For one, the film takes place in the context of Cole struggling at high school, and broadens its scope to include other characters as well as a cleverly-plotted metaphor about losing your virginity.The movie starts off like a fairly underwhelming high school comedy, but once we see its true nature come out in the second act, that first act starts to hit home differently, playing a part in what proves to be a hugely entertaining ride to the finish.Also, this is one of the few sequels that wants to tell a story with a little bit of fantasy mumbo-jumbo, yet doesn't expect you to take it entirely seriously. For instance, director McG knows that you don't remember all the specifics from the first movie, and so inserts brief reminders in impressively effective fashion that really help you to enjoy the story this time around.Meanwhile, the film's final act is a particular treat, as it brings together all the weird fantasy lore that these two movies have unexpectedly built up and puts a clever and surprisingly touching twist on it. It's not a work of genius, but it is a really satisfying ending to two thoroughly enjoyable movies, capping off the pair with a good sense of humour and imagination.Overall, I really liked The Babysitter: Killer Queen. Once again, it's a fun horror-comedy with entertaining action throughout and a good sense of humour. It's not meant to be taken seriously, but it also manages to engage you in its story, lore and metaphors in a way that shows it's much more than just a throwaway Netflix movie."}, {"id": 336, "text": "Right, well I didn't even know that they were making a sequel to the 2017 movie The Babysitter. I happened to sit down and find the movie on Netflix by sheer luck. And I did enjoy the 2017 movie, so of course I found the time to sit down and watch the 2020 The Babysitter: Killer Queen.Okay, well I will say that The Babysitter: Killer Queen was actually as enjoyable as the 2017 predecessor movie. But at the same time, The Babysitter: Killer Queen deviated oddly from the first movie at some points, for better or worse, like it or not. The 2020 The Babysitter: Killer Queen had a bit more supernatural elements to it - some might enjoy that, others may not.The storyline in The Babysitter: Killer Queen was good and enjoyable. I think that writers Dan Lagana, McG, Brad Morris and Jimmy Warden actually managed to put together something interesting and entertaining.The acting in the movie was good, and it was actually fun to see returning characters from the first movie make appearances in this movie as well.I will say that The Babysitter: Killer Queen was pretty straight forward and streamlined, however. There weren't really any grand surprises or plot twists to the movie, which was a shame, because that would have elevated the overall enjoyment of the movie.The Babysitter: Killer Queen is definitely a movie that will hit home and please those that enjoyed the 2017 The Babysitter movie. I am rating it a six out of ten stars."}, {"id": 337, "text": "Sequel to The Babysitter from 2017. Again it's full of gore and funny situations. But it takes a while before it all starts.Positive is the fact that everybody who played in the original one is here to see again, all aged of course so some you might think, can't be but it is. Starts as a pure teen flick with high school and bully's and unsatisfied love sitiuations it took exactly half an hour of that, a bit too long for my opinion. But then things go over the top with bloody and extreme gory scenes.In between there are awkward situations and funny situations and sadly moments you think, really, way too long. But still it's worth a watch. Score and editing is top notch.Being gory the gorehounds out there will have a lot f issues because you can' take it all too serious.The same as the original one, so you know what you can expect from it. Gore 4/5 Nudity 0/5 Effects 3/5 Story 2,5/5 Comedy 1/5"}, {"id": 338, "text": "What I've learned from this is McG is a good director but he's only as good as his script. Which is why The Babysitter was a surprising, refreshing edition to the horror / comedy genre, and the sequel is kind of a let down. It has some funny moments, and McG's signature, flashy, music video style, but ultimately the plot is paper thin and all over the place, and essentially, a redo of the first movie. It's the same plot, most of the same characters, saying a lot of the same things, so, not particularly original. And the ending is cheesy and contrived. Basically, one person could write a better script in the original Babysitter, than 4 could write together in the sequel. Probably why Love &amp; Monsters looks great, and Underwater was one of the most fun films of last year.If I was 12, maybe this would go down for me as a cult classic, but, I'm not, so, it's just kind of meh. Judah Lewis is still very likable, and the new girl, his love interest is also likable. Not as good an actress as he is, but passable, and probably early in her career. That's another thing, Samara Weaving is a good part of the first film, and she has an endearing quality, like Lewis, so, you're pulled along for the ride. Essentially, you've got Judah and a bunch of side characters to carry the film, which makes it more like occasional fun vignettes, instead of an emotional ride. It's more like Dexter Morgan, sterile, fake emotion, so, audience is left not really caring whether Judah makes it out of this film alive. But I do need to mention that John and Juan get more screen time in the sequel, and they're pretty funny.I did appreciate their Waxworks ambition, of a low budget that they make work. Like, the compositing matte scenes are pretty good for low budget. They would be garbage if this was Lord of the Rings or a big budget film, but probably most viewers wouldn't notice where scenery ends and a matte begins. The music is good...I think Bear McCreary, which did sound straight out of Halt and Catch Fire, but, hey, Paul Hasslinger doesn't get his due for a great show, so, I'm not mad at McCreary for ripping him a bit.Overall, kinda fun, just don't set your bar as high as original, and maybe don't see them close together."}, {"id": 339, "text": "I was not expecting to like this movie AT ALL but I have to say they really hit the mark with this one. The gore, cartoonish style and self-awareness of the first are back and turned up to 11.While there are a few lapses in logic (i.e. how old is Cole supposed to be? He says he's a junior but was 12 in the first film and it's been two years since that?) the infectious energy of this flick reels you in and the violence and plot become so outrageously cartoonish that you can't help but turn the brain off and lean into the fun. This flick is like a live action road runner cartoon at points and that is not a knock against the movie whatsoever.The returning cast is as good as they were the first go-round, and McG's flair for over-the-top style for styles sake keeps the film chugging along at a steady pace.At the end of the day, if you liked the first, you'll probably dig this follow up. Bonus points for a killer soundtrack!"}, {"id": 340, "text": "You probably won't watch 'Killer queen' unless you've already seen its predecessor, so you know what to expect.Indeed, the formula hasn't changed: It still tries to sell viewers on its blend of campy-Satanic cult-slasher-coming off age-teen comedy tropes, and it still doesn't work. The production remains noticeably slick, too much so for its own good, and it wouldn't be a 'Babysitter' movie without obnoxious inserts a la 'Scott Pilgrim' and pop culture references that substantially weigh down what it could otherwise be.Despite all those flaws, 'The Babysitter: Killer queen' actually is a better movie. Even apart from the narrative growth beyond the first film, there are enough differences here to make it distinct, in a good way.There's more of an actual plot--and character development!--with real exposition for all the characters. The latter is mostly seen in flashbacks, especially for the antagonists, but that bit of background is welcome even if it disrupts the flow a bit. While the cast returns from the first movie, the new cast members do even more to carry the picture; again, characters seem fleshed out much more than before. I think I'd rather enjoy seeing these actors in other things.One small paragraph to describe the positives may not seem like much, but it really does count for a lot. There was a demonstrable effort to make this more of a solid movie, and it pays off. 'Killer queen' gets 2 more stars from my rating than its predecessor because of the improvements it has made.Unfortunately, the growth from one film to the next doesn't mean the flaws have vanished.That blend of tropes and genres is much the same here, with the difference of the teen comedy angle being played up considerably. Imagine listening to a mix of your favorite record where very specific notes in each song were emphasized so much that they overwhelm the rest of the music. Teen comedies are lame, with very juvenile humor, and that aspect has also been elevated in 'Killer queen' compared to 'The babysitter.'The flashes on screen of graphics and other overlaid effects is turned down a lot by comparison. Yet when 'Killer queen' does go for that unfortunate choice of flair, it's even more prevalent on screen. It's the difference between only part of a shot being filled with post-production visuals, and entire scenes being devoted to the same disruptions. It's embarrassingly bad.I want to like 'The babysitter: Killer queen' more than I do, but like the first movie, it's not as clever as it thinks it is. If the film-makers did away with the stylistic choices of those graphics and visuals, and focused on just telling a story, this would be so much better.I gather there's a possibility of a third film. While I don't think it's especially likely, despite myself I'd probably watch it--I've already committed to two 'Babysitter' movies, after all. Anyway, if McG gives the concept another go, maybe he'll further refine the formula and excise the unnecessary bits. We can hope."}, {"id": 341, "text": "This is a 2020 movie, intended for 2020 audience. There going to be things included in this film that might be relevant now, but might get irrelevant as it grows older. So watch out people of the future, it's not time proof and frankly it doesn't even try to be.Still, The Babysitter: Killer Queen manages to even top the first film, which was one of my favorite films of all times.All of your favorite characters come back alongside new ones. The new characters are not given that much screen time but it's fine. I didn't care about them much in the first place, and I wanted to see more from the original cast.This movie is so unimaginably campy, to a ridiculous level sometime, might I add, but still has it's scary and gruesome moments.It's also pretty unpredictable. I was pretty engaged and was thinking oh I hope they do this and that regarding some plot points.Judah Lewis as Cole did an incredible job, he's very talented and his acting was great. He carried this film the same way he carried the first. I loved the direction they went with his character. Despite this film being so unbelievably over the top, what they decided to do with the character was a pretty realistic choice and I think it paid off.I also enjoyed Jenna Ortega as Phoebe, I think that she too did a fantastic job and I found her very likable.Robbie Amell as Max. Lets just say, I don't ever want to see Max with a shirt on. Okay?Samara Weaving as Bee... I mean, she's just perfect. A whole another level. I loved her so incredibly much in the first film, and her arc in this sequel is so incredibly satisfying.I don't want to spoil anything, but the movie does have a theme going on and I think the theme matches the film perfectly.If you watched the first movie, and loved Bee and Cole as much as I do, I don't care what anyone else is telling you. This movie is a must!"}, {"id": 342, "text": "While this film is inferior to the first, it does have its moments of fun. Much like the first film, one of the things that this movie does really well is comedy. There are some really funny jokes and scenes. However, the new bad guys that are introduced in this film do take away from the humor by being terribly unfunny. Luckily they are killed off fairly quick, so they don't end up being too much of a problem. Another thing that is pretty good, much like the first film, is the CGI and practical effects. Much of the gore and bloodshed in the movie is done through practical effects, and looks realistic for the most part. There is one scene however, where a character has their head ripped off, and it looks painfully fake, and sort of ruins what would have otherwise been a pretty good scene. There are a few glaring flaws with the film too, one of which is the overall plot and its execution. It basically recycles the exact same plot from the first film, and the only real difference is that there are more bad guys this time around. It really shows a lack of creativity, and it can also be really sloppy at times. The film is also directed by McG, who is notoriously known for taking interesting concepts and ideas, and making subpar films out of them."}, {"id": 343, "text": "What a wack movie. If I'm supposed to rate this based on the quality and film work, it is not good. But for a good time, maybe with a few drinks, having a good laugh with friends, yeah it wasn't bad. I watched the first one way back when, and that one wasn't bad at all, I actually liked it. This sequel was very wack, the plot was really vague and horrible, serious points would come out of nowhere and it was just all over the place. They basically just assumed you'd understand everything... which I didn't. If you didn't watch the first one you will know nothing throughout this movie. Good comedy though throughout, as long as you're like 18, you might get a few laughs. The acting surprising wasn't terrible, I've seen worse, but the good acting only came from like a few characters. Don't know if I'd watch again though, I'd watch the first one again, this one... not so much. However, some funny scenes mixed in with funny actors made this one not too bad as long as you are not sober. Try to ditch the fact that the plot is vague and that people are dying left and right for no reason. Just enjoy, try to have a few laughs, and have a good time."}, {"id": 344, "text": "The Babysitter: Killer Queen was a very pleasant surprise in that it might be better than the first one. Two years have passed from the events of the first film and Cole is now an outcast who no one believes about the events of that night. Cole takes up an invitation from his friend Melanie for a weekend party at the lake but once there he finds himself revisiting the nightmare from which he thought he'd escaped.The first The Babysitter was a flawed but entertaining comedy slasher that I thought was enjoyable for the most part, but never thought it balanced its horror elements and comedic elements as well as it could've. With Killer Queen any pretense at horror is pretty much abandoned from the outset and this time around the movie the movie is a dark comedy that while it does contain the gore and violence of the original never makes any attempt to be scary. That said, the humor is still very much on point and has actually been refined since the previous outing flowing more smoothly and creating a better sense of comic rhythm with proper setups and payoffs some of which had me laughing to the point of tears in my eyes.While the comedy is very well done, the heart that was in place in the first one is still very much a part of the movie as we see Cole trying to cope with the fact that no one believes his story. This time around Cole(Judah Lewis) is joined by Phoebe(Jane the Virgin's Jenna Ortega) who also runs afoul of Cole's satanic cultists and makes a nice pairing with enjoyable banter and character moments that make them a pleasure to be around. Both Lewis and Ortega are still just amazing actors and they show amazing chemistry in their scenes together.The Babysitter: Killer Queen may not be a strictly necessary sequel, but it is a lot of fun that doesn't take itself too seriously. The movie does hint at the possibility of another installment(though given the ending I'm not sure how it would look like) and while that one will be just as unnecessary as long as it's on par with this one make as many of these as they did Elm Street movies."}, {"id": 345, "text": "There is just so much in this film I can't get into it all in this review. The babysitter: killer queen one of the most dense, poyant and beautifully crafted films I have ever seen. I will be extremely disappointed if this doesn't at least get nominated for best picture at the oscars this year. Oh... Bella Thorne is in this, never mind then it sucks.When I say there is just so much in this film I can't get into it, I'm referring to the sheer amount of absolute bs. Everything makes zero sense and everything is very lazy. This movie is undeniably a cash grab. It has been realised at the perfect time though, the only way people will ever watch this is if they're stuck at home in quarantine.I'm my review of the first babysitter I wrote earlier today I mentioned how they somehow rubies queen. In the sequel they ruin them even more. Why did they need to put killer queen.Anyway here's some filmmaking and story complaints and stuff. How did Cole get away with driving Jaun's car into his house if nobody believes him about the blood cult stuff. No jail time, not even a fine, no nothing. Every single actor was awful and none of them had any chemistry. I'm an anxious, self-conscious person and I could have done a better job than everyone in this truly disgusting movie. The writing is awful, nothing makes sense, the romance is forced and most of all it's not funny in the slightest. I don't have a main issue or anything because everything is just bad, there is nothing to appreciate, even the gore was bad and that was the only saving grace of the first babysitter.Never ever watch this movie, it made me wanna slit my wrists but it also gave me hope that I could make a successful movie in about 20 minutes so that's good I guess."}, {"id": 346, "text": "Killer Queen is the sort of sequel that exists to just have fun with the formula established by the original. Unfortunately, while the cast are eager to get crazy once more, the writing and direction let them down. Also, rather unfortunately, Netflix's trailer clearly gives away the twists that are to come.Cole is now an awkward teen and not a single person believes his story of that night with Bee. Not even Melanie, his first kiss and now sexpot best friend will admit to the things she saw that night. Facing a stint in a mental asylum by his worried parents (Ken Marino and Leslie Bibb, hilariously returning), Cole runs off with Melanie and her friends to a lake side party. Sadly, someone has brought back the dead and signed their name in the book of the Devil, and now Cole must fight to save himself and his friends before the sun rises.The older kids all return to reprise their roles. Each clearly having fun before being bloodily killed. There's also absolutely no denying the star power of Samara Weaving; her blue eyes, blonde hair and gaunt features in the starlight both menacing and to die for. The young cast (especially newcomers Jenna Ortega and Juliocesar Chavez) do a good job balancing horror and slapstick comedy and have the same manic energy as the originals.Sadly, the movie just can not justify itself beyond brutally murdering teens. That's all fun for a minute but when characters have the teleporting skills of Walking Dead's zombies and hearing as bad as Helen Keller, it kills the tension - each dead teen just being lined up like a lemming to be killed again. Fun montages of the original five meeting Bee for the first time pump some energy into the proceedings but it doesn't save the messy script or direction. Cole is really the weaklink. He's just not interesting enough in his trauma, and the direction offered confuses his character with being either a cold blooded killer or hapless cuckold depending on how close the villains need to get to killing him.Not a bad shout for a party horror and fun if you've nothing else to do on a Friday night,but overall falls short on a lot of fronts."}, {"id": 347, "text": "The Babysitter was a fun teen-oriented horror film that actually made me feel vindicated for having defended McG in the past (I'm not ashamed to say that I like Charlie's Angels). Killer Queen makes me feel sorry that I ever said good things about the man.Set two years after the first film, this sorry-ass sequel sees Judah Lewis returning as Cole, who is now in high school, considered a weirdo for his outlandish tales of killer babysitters and blood cults (and for the fact that he wears a brown, three-piece corduroy suit with pin badges on the lapel). History repeats itself when his best friend Melanie (Emily Alyn Lind) also turns out to be evil, having made a pact from beyond the grave with the deceased psychos from the first film to complete their Satanic ritual using Cole's blood.If McG's music video style has rankled in the past, this film is guaranteed to annoy, the director going into overdrive with trendy stylisms that make Edgar Wright look positively reserved. As if the puerile script wasn't bad enough (lame humour and numerous pop culture references), the use of computer graphics, grainy VHS style flashbacks, and various other random nonsense is atrocious. A sex scene plays out through the use of obvious visual metaphors; a fight scene is done in the style of a beat-'em-up computer game; there's a pointless dance routine. None of this makes any sense within the context of the film; it's just there for the sake of it.To be honest, the only good thing about this whole dreadful mess is the excessive gore, which is cartoonish but fun.To add a final insult to injury, Samara Weaving (a BA_Harrison pet peeve) returns at the very end as babysitter Bee, who turns out to be good, saving Cole and his love interest Phoebe (Jenna Ortega) from the bad guys. At least she doesn't get to do one of her horrible warbling screams: I guess we should be thankful for small mercies."}, {"id": 348, "text": "Again, the same issues I have with the first film are the same issues I have with this one:Bella Thorne's horrendous, wooden and joke of an actingThe constant harmful dark comedy. This one was ableist as hell among some other jokes and it really took away some from the film.Excluding those, this film is just as funny, campy and feel good as the first one. The Babysitter films aren't afraid to make a mockery of themselves and mock horror tropes that are consistently seen and it's a good time. I really enjoyed a lot of this and, just like the first, this could have easily been a 5/5 for it's carefree nature and watching with friends for a good time. I just wish McG could quit with the harmful jokes; we've learned more than enough this - and previous - year(s) that these can be used harmfully and it just cuts a chunk of fun out of the film"}, {"id": 349, "text": "I'm not really a fan of this kind of film but the first one was alright and I was bored, so I took a look.As per usual these days male figures are either inadequate, irresponsible or stupid. Female characters strong and empowered or mysterious and empowered.You get the idea. The pink background on the poster should have been enough to warn me off but well, silly me.On the upside acting is reasonable, setting and cinematography fine, basic slasher story is alright.In short, if you can look past the woke horse manure, its almost passable. Personally I found it a little insulting and irritating but hey, I'm just a man, what do I know.4/10."}, {"id": 350, "text": "I am absolutely shocked to see the reviews of this film. I can only believe that people watched an entirely different movie, or took the first movie as anything more than a campy comedy satire.You can tell the script writers are absolute lovers of the Evil Dead series. In many ways, Babysitter: Killer Queen is the Evil Dead 2 of the franchise. Those that liked the horror aspect of the Evil Dead series more will always prefer the original and find the second to be a near identical comedy which is far inferior in every way. If you loved Evil Dead 2 more than you loved Evil Dead, it is my guess that you will actually like The Babysitter: Killer Queen better than the original.If you are a fan of Evil Dead 2, go into it knowing that it has shed its horror elements completely to go full on camp.I felt the exact same way about The Babysitter: Killer Queen as I did the Babysitter, for its first 20 minutes. I thought: This movie is going to suck. However, neither of those things are detriments to the movie. It makes the kick start of the film that much more random and absolutely hilarious. I got a pretty good chuckle when The Babysitter kicked off with its first death. This film outdoes that by 100,000. The single first death scene alone is worth watching this film. It is by all accounts the Ash bobbing with the lamp and laughing with the deer head scene from Evil Dead 2. And the laughs just keep on coming.It is almost essential to watch the first movie and then watch this, within a short time frame. If you barely remember the first movie, many of the jokes will fly over your head. It is an absolute laugh fest of the lowest brow.I rarely make reviews for films, usually when I feel the people have gotten it completely wrong. I have seen plenty of half baked praise attempts. There are lots of critiques written by individuals who do not understand the camp genre. This movie will be hated and then loved. This is a Cult Classic in the making. I will only say this: Give the film a chance, and watch both movies back to back.Forgive what feels like plot holes, too. Because, I dont think they actually are plot holes at all. This is the part where I will get into the sad truth of the world. Many do not believe that nobody would believe what happened to him happened to him. However, during the Satanic Panic in Europe, there were instances where there was so much evidence of something occurring, and yet people still did not believe it occurred. When people refer to satanic occultic stuff, it is absolutely dismissed, regardless of evidence. Not to mention, in this world, Satan is real, and if Satan is real, he controls the realm, thus cops werent found dead and stuff makes sense within the context. It is absolutely setting up for its Army of Darkness finale, and I absolutely hope that comes to fruition.A single point off for the cringeworthy cutaways. They are all but 10 seconds and there might be four of them, but when i own the film im definitely gonna personally cut those out for home views. Great film, perfect shlock camp, absolutely hilarious, 9/10"}, {"id": 351, "text": "This is a fun movie that is full of small LOL moments and gore aplenty. I stopped trying to make sense of the plot after 15 minutes, and to the film's credit, it didn't try to be something its not. The dialogue between the characters is the best part of this movie. I did also enjoy the female protagonist (starred in 2nd season of You) and the Dad (the always great Ken Marino). Besides that, there is not much else worth mentioning.The first movie was better for sure, and I thought it was funny that one of the characters mentioned that of all movies, there are only four sequels that are better than their original (this isn't one of them!).If you just want to experience a few laughs and light scares, then this is the movie for you.[5/10]"}, {"id": 352, "text": "It's been years since I saw the first film, but when I heard they were making a sequel, I knew I wanted to watch it. I even defended the trailer, saying it might not be that bad. I was wrong.Cons: The dialogue itself is awkward, mostly unnecessary, and simply unfunny. There was a scene or two with Robbie Amell's character that I can think of that were mildly funny for me.For some reason, the kills were almost all similar in nature (you'll get what I mean once you watch the movie). They were cool, but felt uninspired as well.The editing in a particular scene didn't make sense to me, and took away from the progression of the story. There was a voiceover of a previous scene taking place during an action sequence. That was, in my opinion, a big low point in the movie.Once Samara Weaving made a brief appearance, I had already mostly lost interest. I agree with other reviewers that said her character had basically become a hull of what she was, and that her role in the story really didn't make sense. Once she's there, it didn't really matter that much anyways to me.I didn't care for so many pop culture references. It took away from the humor for me.Pros: The acting wasn't bad. There was nothing exceptional about it, but it wasn't awful either.I think my favorite part about the film was the location. That's really the biggest redeeming quality for me.I can't think of anything else off the top of my head.Maybe I expected too much, but I ended up being disappointed in the end."}, {"id": 353, "text": "The Babysitter: Killer Queen: Two years after his clash with the Satanic Cult, Cole (Judah Lewis) is in High School. No one believes his tales of that night, Melanie (Emily Alyn Lind), wisely keeps quiet about the whole thing. Cole has to see the school therapist/nurse and his parents want to send him to a special school. His complicated relationship with Melanie continues, she now has a boyfriend, Jimmy (Maximilian Acevedo), but still invites Cole along to a lake party on Jimmy's uncles's boat. A new Satanic Cult emerges and along with the resurrected old team sacrifice a victim. Cole escapes from their clutches with the help of Pheobe (Jenny Ortega), a new bad ass girl in his class who has an Alice In Wonderland fixation. You get death by decapitation,real flamethrower, homemade flamethrower, boat hook, machete. There are some good in references to Cape Fear, Deliverance etc. Very much a slapstick comedy horror but there are some dark moments. Not up to the standard of the original (maybe too many wacky characters) but we get the origin stories of the original Cult and it's certainly worth watching. Directed and Co-Written by McG. On Netflix. 6/10."}, {"id": 354, "text": "Was a million times better. I would definitely watch this again. I loved it for the ending, the interaction between the characters like Cole and the old minions of B which were always funny moments, I had to keep rewinding and watching parts over because they were so beautifully acted. I also liked that Cole's main storyline was a lot like Harry Potter from the OOTP -that no one believed him- and I enjoyed the twists that happened throughout the story.I will say I think the new minions were unnecessary overall, but then again they needed to be there to bring the old ones back at first and there wasn't much of them in the movie to take away from it, so it wasn't anything bad. Also the part where the old minions and new ones are arguing was funny so it was worth it.Phoebe was a great addition and really love-able.Cole and the original minions had really great chemistry. They played really well off each other. Their interactions felt really genuine. Amazing acting from all of them.I would definitely recommend. 10/10"}, {"id": 355, "text": "I only recently watched the first film, The Babysitter, and I was pleasantly surprised by how much I enjoyed it. There wasn't any spectacular filmmaking on show, but I thought it was thoroughly entertaining for what it was going for and I gave it a fairly high score.With that in mind, I was looking forward to the sequel, but it managed to set all a lot of records for me. It's the worst sequel ever made, it has one of the worst scripts ever written, and it's the second lowest score I have ever given out to a film. I hated The Babysitter: Killer Queen with a passion.I was never bored because of how laughably bad the film was, so I'm giving it some points for that and I did like the idea of someone living with a past trauma that no one believes. This brings a sense of isolation, but they didn't explore this element anywhere near enough as they should have.The film started and it immediately establishes that it takes place two years after the original film, but the characters were talking as if it only happened a couple of weeks ago and that made it feel off from the very beginning.It wasn't long until I saw how completely appalling the script for the film was. I had some issues with the screenplay in the first film, but they were nowhere near as bad as in The Babysitter: Killer Queen. The dialogue is completely terrible in every sense of the word, and the acting across the board was almost as bad.The narrative itself doesn't make any sense, with a twist part way through that came completely out of left field and I hated what they did. 'Hate' is a very strong word and I very rarely use it whilst describing a film, but I'm going to use it a lot here. I hated this film.Everything that goes in to making a film was very poor, including the cinematography, the editing, the effects, and especially the acting and the screenplay which I have already mentioned. I don't really like any films that McG has made, which is why I was amazed that the first film worked so well for me.If you can't tell, stay away from this film. I'm only giving it some points for one story element that I liked and the fact that I wasn't bored because I was laughing at it too much. Apart from that, it's abysmal. Oh, but there was a small appearance from someone at the end that made it a little better, even though it wasn't hard to see that she didn't want to be there.They left the film open for a sequel, and all I can say is that it can't be any worse than this steaming pile of manure.SCORE: 20%"}], "reviews_amount": 356}