{"name": "NSR: The Jade - IMDb", "titleId": "tt11734702", "reviews": [{"id": 0, "text": "Love the action especially the chase scenes. I think the story is good and the actors and actress did a good job."}, {"id": 1, "text": "Magnificent sea scenes, just the right amount of romance, brilliant script, fantastic acting, this, for me, hit all the right spots."}, {"id": 2, "text": "I love this movie. Lots of action that never stops. Great acting, great moral, great story. Suspenseful too!"}, {"id": 3, "text": "Its really a good movie .. i feel excited in every scene .. i do like it much especially my Nad."}, {"id": 4, "text": "A movie full of Action, Drama, Sweet Romance and Happy Ending. Marvellous!"}, {"id": 5, "text": "Amazing movie, never watched like this before... Easy to understand and well planned. Love this movie and it's character."}, {"id": 6, "text": "Amazing movie, never watched like this before... Easy to understand and well planned. Love this movie and it's character."}, {"id": 7, "text": "I recommend this movie greatly. The action is great and the characters are well done. This is a must watch movie."}, {"id": 8, "text": "A brilliant movie. Beautiful cinematography, beautiful story. It's a very simple movie and I think that's what makes it unique."}, {"id": 9, "text": "Incredible plot, high speed action movie fully enjoyable with brilliant performance by all cast."}, {"id": 10, "text": "Don't stress out much on your brains, just sit back and enjoy! One of the finest films I have seen in years."}, {"id": 11, "text": "The story is amazing the action was mind blowing. It is fresh and got lots of great Locations"}, {"id": 12, "text": "The plot is good, the acting is good. The partnership between Nad and agent Yuan is awesome!"}, {"id": 13, "text": "I really enjoyed this movie. The action is superb, and both Nad and Raul were amazing in their roles."}, {"id": 14, "text": "A very good and entertaining movie. New star casts but still appreciate the actions."}, {"id": 15, "text": "So raw and realistic experience! Love this movie. You will see something that is easy to believe it is a reality. Without any hollywood posh. Recommend!"}, {"id": 16, "text": "One of the major turns in the story was predictable but other than that it was a nice action film."}, {"id": 17, "text": "I love this movie nothing to add nothing to subtract it's just pure class"}, {"id": 18, "text": "Nice action packs. No flaw movements.. All professional killer"}, {"id": 19, "text": "This is the second time I watch and this is not kind of story that fades away after you watch. Extremely Good!"}, {"id": 20, "text": "Awesome from start to finish actors were all brilliant. Best film i have seen for ages."}, {"id": 21, "text": "I liked it ,very entertaining and enjoyable movie . Has good action and keeps your attention"}, {"id": 22, "text": "I am not a fan of action films but watched this because of my boyfriend. It didnt disappoint. Just the right amount of action and surprise twists and turns. Acting superb by all."}, {"id": 23, "text": "The movie was splendid. A lot better than I was expecting. Mostly entertaining."}, {"id": 24, "text": "Excellent film. Seriously, I can't ignore the story and emotions while watching this film."}, {"id": 25, "text": "It isn't a classic, but it is entertaining enough to have kept my usually fickle interest going. Great acting, great action."}, {"id": 26, "text": "A really solid movie. Had sad, serious, surprising and action packed moments. Enjoyed the acting and the plot."}, {"id": 27, "text": "Wow what a fantastic utterly superb film absolutely loved it!!! Amazing storytelling great film."}, {"id": 28, "text": "This movie was one of the best I haven't seen in awhile."}, {"id": 29, "text": "Outstanding movie with so much precision and skilful strength of endurance. Its difficult to believe its a movie. Looks so real and just awesome."}, {"id": 30, "text": "Movie was really good and I will happily watch it again."}, {"id": 31, "text": "Really did love this movie! It was something different that other action movies."}, {"id": 32, "text": "A very good film that accomplishes all its goals. It's an action film of the revenge variety, with a good script, good acting, excellent fight choreography, and decent directing and production."}, {"id": 33, "text": "Lovely, that's the only thing I want to say about this movie."}, {"id": 34, "text": "Cinematography was decent and the plot was good. Awesome Film."}, {"id": 35, "text": "Very good movie. Action packed and definitely kept me on the edge of my seat. The movie has a great story line."}, {"id": 36, "text": "Fantastic!!! What a movie!! Incredible action, scenery and emotion. Stunning."}, {"id": 37, "text": "Wow Excellent work, I really enjoyed this movie. It was amazing."}, {"id": 38, "text": "Pretty good. Recommend to Action fans. It's better than most movies I've seen."}, {"id": 39, "text": "I loved it, very compelling. I'm very impressed with this movie."}, {"id": 40, "text": "I loved it, very compelling. I'm very impressed with this movie."}, {"id": 41, "text": "Everyone involved has done an Excellent Job. Watch it."}, {"id": 42, "text": "In one word remarkable. To summarise: Brilliant casting, great script, really good dialogue and fab locations."}, {"id": 43, "text": "This movie was extremely intense i love it.. I hope they make a 2nd movie!!"}, {"id": 44, "text": "Its a good movie if you simply watch and don´t compare it with the big-budget movie from the hollywood."}, {"id": 45, "text": "Story line could have been stronger but I enjoyed it. Love these kinds of movies."}, {"id": 46, "text": "If you're a fan of Action Movies, Don't miss this!"}, {"id": 47, "text": "I found this movie sooooo good. It made me a big fan of Nad as well. It is a must-watch for the people who are into spy/action//thriller."}, {"id": 48, "text": "...simply extraordinary, extremely well acted by the entire cast"}, {"id": 49, "text": "Great movie. Fight scenes were realistic and amazing. James Bond style plot."}, {"id": 50, "text": "The movie was intense and not boring at all. A must see."}, {"id": 51, "text": "The movie was intense and not boring at all. A must see."}, {"id": 52, "text": "I just watched the movie and it was more than awesome."}, {"id": 53, "text": "It is good! It contains all the action-packed fighting that I wanted while still portraying it realistically"}, {"id": 54, "text": "This movie met all expectations. Really enjoyed it!"}, {"id": 55, "text": "This was astonishing. Great story, well acted, beautiful effects. This is exactly the kind of movie I love."}, {"id": 56, "text": "I was hooked, beautiful camera work and great story. I gave it a 10!"}, {"id": 57, "text": "Absolutely loved it! Hopefully they make a part 2!"}, {"id": 58, "text": "I think to a degree this movie has the right to make it to the best favourite movies to watch in a gathering with friends and family. Some of the acting could be excused but I will recommend this to anyone."}, {"id": 59, "text": "This is actually good entertainer!! At one point you will believe this movie is more worth than most of the other over hyped movies!!"}, {"id": 60, "text": "Awesome and Kick ass. I highly recommend to watch this movie"}, {"id": 61, "text": "One of the good action thriller movie. Everyone has done their character nicely that i felt it is a true story . Bravo"}, {"id": 62, "text": "Suspenseful and good action movie- some pretty cool chase scenes and shootouts"}, {"id": 63, "text": "Its a damn good movie, very well made and drags you to keep watching for the story. i liked the acting too."}, {"id": 64, "text": "This film is awesome. What a thrilling movie and cast is also nice."}, {"id": 65, "text": "Well written, could understand the placement of the cast in the movie. Great acting. Enjoyed the entire movie."}, {"id": 66, "text": "Lighthearted movie with some fun moments. Great movie if you're looking for something that isn't quite a comedy or drama. Just a nice story and true at that."}, {"id": 67, "text": "Witty, the characters are charming, and the plot isn't so bad. Makes me miss films like this."}, {"id": 68, "text": "I wish I'd seen this at The Cinema. Great film. Exactly what I want from a film. Excellent production."}, {"id": 69, "text": "I didn't knew this movie existed until it was available on prime! It was a very good movie! Loved it!"}, {"id": 70, "text": "I loved the movie! The plot was amazing. All the leads are perfectly cast and considering they are all doing foreign accents they all do a great job."}, {"id": 71, "text": "Thoroughly enjoyed the movie. A perfect balance of action, suspense, fun and good acting. Really hope there's a second movie sometime."}, {"id": 72, "text": "This falls into my favorite action movie list and one I can watch with my 8-year-old son as it didn't have any gruesome violence."}, {"id": 73, "text": "Really enjoyed it. The chemistry between Nad and Yuan was obvious and the surprises were very unexpected."}, {"id": 74, "text": "It's one of my fav movies!! its easy to watch and ive seen it three times now."}, {"id": 75, "text": "The movie was great! Different from normal heist movies. Worth Watching!"}, {"id": 76, "text": "The characters are good and the film flows well with the added bonus of a good action."}, {"id": 77, "text": "If you're even considering watching it then I'd definitely recommend you do."}, {"id": 78, "text": "The characters are good and the film flows well with the added bonus of a good action."}, {"id": 79, "text": "A very well written and executed movie as well as some great action scenes that were very thrilling and exciting. As far as the characters they are all very well acted and the protagonist in the movie worked brilliantly."}, {"id": 80, "text": "I wasn't very interested in watching it because I thought that this was also gonna be a silly violent action movie. But thanks to Covid 19 that I am here to watch and yeah, it turned out that the movie wasn't that bad. I liked it."}, {"id": 81, "text": "What a treat! Bringing this type of action with Mauritius. I'll never be able to visit there. I did enjoy seeing it on screen.😉 If only for a brief moment. LOL The actors are very talented. Movie is beautifully executed! Well Done! Go see it!"}, {"id": 82, "text": "A worthy one time watch. Not an out and out action movie. Yet a good amount of action with family emotions make it a good movie."}, {"id": 83, "text": "It's a thrilling movie full of action.. nothing boring.. worthy to be watched for the people who in true sense have taste of action n suspense.."}, {"id": 84, "text": "The action sequences are truly a visual delight. There's a buildup to most of the action sequences and they don't happen without a reason. The car chases and fight sequences are brilliantly done, and the visuals across Mauritius are beautifully filmed."}, {"id": 85, "text": "It's a high-octane action movie that's simple and pure at heart, and can be enjoyed by anyone who likes feel-good action movies."}, {"id": 86, "text": "This movie is really good as it has good action, good suspense and has likeable characters."}, {"id": 87, "text": "Nice movie! action and tense good story. Overall I just loved this movie! Wonderfully crafted."}, {"id": 88, "text": "Highly Enjoyable and Entertaining, particularly compared to more highly-lauded, more fashionable Hollywood offerings."}, {"id": 89, "text": "I really liked this movie. Great action and nice on screen chemistry. Vivien Monory is smoking hot, and the nonstop action makes it a fun film to watch."}, {"id": 90, "text": "This movie overall was really, really good, had a predictable story in it but the action made me ignore it, certain sections of this movie had charm and made me smile, other sections I feel like were not needed, but overall I did enjoy watching the movie, always love a good action movie."}, {"id": 91, "text": "I think the movie was great because it all about family and that's something a lot of movies don't have. Awesome movie, love the action. The car chase and helicopter stunt is the best part."}, {"id": 92, "text": "It is a brilliant thrill to watch. Filled with lots of intense action scenes, this movie has a suspense to it. Some questions in the film are left unanswered at the end But the action and adventure is really good."}, {"id": 93, "text": "Now! This is a movie which is lovely and awesome! even though the beginning is slow, the 80% of that movie brings thrill and fun and also have humour packed with good going in the heist starting from the plan till the end! Must watch!"}, {"id": 94, "text": "It's an easy movie to watch that's fast paced and has lots of action. You've got a decent supporting cast too. It's a no brainer fun ride that's enjoyable enough without using much computer effects."}, {"id": 95, "text": "I really enjoyed watching this movie because the action is absolutely fantastic and the story was very simple to understand I became fan of Nad, he is amazing, the casting was really good. I also like the actor who played Raul Character."}, {"id": 96, "text": "I think this is the best movie. I enjoyed this movie a lot.I also recommend this movie to my friends. Amazing action, thriller story. Mauritius was well portrayed in this movie."}, {"id": 97, "text": "I don't know from where to start but this is one of the best Actioin/ thriller movies I have ever watched. You know there are some movies that blow your mind and want to watch more movies of same kind, this is one of those movies. This movie is so good that everyone end up liking it."}, {"id": 98, "text": "While the film closely hews to the standard of its genre, it presents a divergent plot line transforming it into a watchable opus."}, {"id": 99, "text": "The cast is good and the direction is smooth and keeps the story flowing. Then, there are the car chases, boat chases. suspense, lots of action and they are genuinely awesome."}, {"id": 100, "text": "This is the first time i'm writing a review because i was so happy after watching it. The movie has it all. Good actors, good script, good action and mesmerising locations."}, {"id": 101, "text": "It was extremely entertaining for me to watch it, because there is always something happening, not much dialogue, you don't get to connect with the character, but the movie is just epic for it's pure fun"}, {"id": 102, "text": "The whole movie, from the cast to the location, the action to the suspense, was spot on. Great movie and it should be watched by all."}, {"id": 103, "text": "The action and chases scene are some of the best in the movie. Positive I have is the new cast, who are all great and have fantastic chemistry. if you like action movies, I recommend go for it.."}, {"id": 104, "text": "The story is simply amazing and the performances given are breathtaking and full of honest emotion. After watching, I thought movie was excellent."}, {"id": 105, "text": "Watching this movie was a great experience and I was surprised that I could enjoy an action movie this much. My tip: sit down, enjoy the ride and don't moan about imperfections."}, {"id": 106, "text": "In fact the whole film has a more realistic feel to it with the relentlessness of the action being not over the top, but still enjoyable for fans of the genre."}, {"id": 107, "text": "I watched this movie with my girlfriend. I expected a medium action movie with good special affects. But i was surprised, it was really superb. It had soul, and some scenes looked amazing."}, {"id": 108, "text": "An action movie that doesn't try to add strange characteristics to the characters to make them more powerful but just straightforward high speed action."}, {"id": 109, "text": "If you're looking for an extremely entertaining movie with good action scenes, then this is your movie. Don't think too much. Watch this movie and enjoy it for what it is."}, {"id": 110, "text": "The set pieces were extremely enjoyable and proved to be some of the greatest action scenes of the year."}, {"id": 111, "text": "It really is interesting to read the above reviews. I've just come back from seeing it and thoroughly enjoyed it."}, {"id": 112, "text": "This martial arts movie was action packed. The fight scenes are awesome and it has a great story to it. I recommend that people should see this movie if you haven't yet. You'll enjoy it."}, {"id": 113, "text": "This is a great movie. The story, acting, pacing, editing, etc. was just fantastic. Direction was solid, and the suspense will keep you entertained right through to the last seconds. I loved it."}, {"id": 114, "text": "I loved the action, the heart pounding chase scenes, the great story line of theft, chase, suspense and thrill. After finishing this film I couldn't wait to review it."}, {"id": 115, "text": "Really nice movie for us who love action movies. Enjoyed every minute of it, from the very first scene, to the last! There are few flaws in this movie, and on the whole it is a delightful movie."}, {"id": 116, "text": "Believe it or not I haven't seen such movies. This held my attention from beginning to end! Completely action-packed and exciting! I felt like we definitely got our money's worth. This movie will not disappoint!!"}, {"id": 117, "text": "The basic story is good but plot holes let down. The acting was actually quite good especially for Nad, Raul and Vincent. The action sequences, locations and fast story were riveting. Camera work, immersion and angles were excellent, especially since most of the shots had minimal CGI. I have to admit that the plot holes did not bothered me as much because it is fast pace movie."}, {"id": 118, "text": "Splendid locations, really a must-watch just for the locations. It was apparently filmed in several countries which include mauritius, india and uk. well edited and top photography!"}, {"id": 119, "text": "I got the meaning of NSR from the movie. It actually means National Security and Research. I hear there's going to be a sequel, can't wait. Hope it'll be very soon."}, {"id": 120, "text": "I guess I am biased because I am a big fan of horses and loved the horses scenes. Overall it is a very good action movie and it seems to be on launch offer if I'm not mistaken, I recommend it for a night movie."}, {"id": 121, "text": "NSR The Jade really impressed me. The story is very interesting and the movie is not heavy on vfx. I was really bored of studio movies having lots of visual effects and it was nice to watch this movie which has more live action."}, {"id": 122, "text": "I was slightly confused with the story at the beginning but after the first half, it all started to make sense. However, I did not really like the twist on the NSR chief, I hoped he would be on the good side."}, {"id": 123, "text": "This film is really fast-paced after the first-half. Glad I watched till the end, once the car chase starts, it's go! My favourites: the helicopter scene, boat chase and in general every scene where Agent Nad and Agent Yuan display raw humour."}, {"id": 124, "text": "I really want to go to the places shown in this movie, and its so well filmed. Excellent creativity. I also really like the scene with the horses :) Wish the movie had more of them..."}, {"id": 125, "text": "You need to watch this for the gorgeous lead actor, beautiful locations, and the action! You'll love it! The driving style, and the super cool fight moves, just WOW!!!"}, {"id": 126, "text": "Looks like a mix of jackie chan and jason statham style. Aggressiveness with calmness and acrobatics! My favourite parts are when Nad hangs from the balcony rail and kicks the villain."}, {"id": 127, "text": "All the cast are very good actors and what I liked the most is how the story develops and changes. several twists and the director of photography did an excellent job for the aerial and sea chase."}, {"id": 128, "text": "I was very proud to see an Action movie starring a fellow mauritian lead actor on prime video. It is really the biggest achievement for a mauritian in history. keep making us proud. New fan here!"}, {"id": 129, "text": "Seeing a fresh new movie after a while! I love the boat chase and those locations, truly amazing and the color of the sea over there is so visually pleasing, can't wait for more movies like this."}, {"id": 130, "text": "Not a fan of action film unless it is Jackie chan or tom cruise. But I truly enjoyed this one, NSR The Jade is full of raw action and the stunts are so cool. I guess we have a new actor joining the ranks of those doing their own stunts. Watch if you like jackie chan style movies."}, {"id": 131, "text": "This story is so full of suspense, it turned to be very different to what i thought. Very interesting!"}, {"id": 132, "text": "The leads and main cast are really natural, makes the movie quite realistic. The plot is quite ununusual also, it will a clever decision to have multiple angles including the japanese angle."}, {"id": 133, "text": "This movie makes me want to travel and live in a tropical island! I hear the boat stunts were all real, impressive! The sea makes me happy"}, {"id": 134, "text": "Everything seems to be there: car chase, helicopter, boats, horses. I support indie movies which manage to put all these ingredients instead of just giving us drama"}, {"id": 135, "text": "Action, Adventure, Thrills - this movie does justice to its genres!"}, {"id": 136, "text": "I like the raw aggressivity of the characters especially the cute leads and the villain. Also a fan of the nsr chief, steven, looks nice in the hat!"}, {"id": 137, "text": "I do not normally write reviews but felt compelled to for this movie. Great Job 10/10."}, {"id": 138, "text": "Think of some. The Cars and Bikes were amazing. Chase scenes were the best part to watch."}, {"id": 139, "text": " I can say the set-pieces were beautifully designed and executed that too in natural environment and on location. Here is a really well-made action film"}, {"id": 140, "text": "It's refreshing nowadays to see a movie with real stunts and practical action!"}, {"id": 141, "text": "Lots of very impressive action, a very handsome male lead actor and I love the accent, fabulous film!"}, {"id": 142, "text": "This movie has some really high production value, well done!"}, {"id": 143, "text": "I think almost everyone can find something in this movie that they would appreciate and enjoy. The chase scenes feel realistic and intense unlike many of the car focused movies eg. Fast and Furious. The action is wonderful, the acting is believable, a couple of women are pretty."}, {"id": 144, "text": "I wasn't that interested in seeing this, for some reason, but did....and, wow! This is a fine movie. what impressed me was the restraint not to overdo the action."}, {"id": 145, "text": "I love the stunts which seem to be on land, sea and air like the synopsis says. I was very impressed by the trailer and I am glad I watched the movie. Acting was very good and the fight moves of the stars, excellent!"}, {"id": 146, "text": "A must-watch if you like action and locations. it's mesmerising to see the turquoise and the serene blue waters of Mauritius through this film."}, {"id": 147, "text": "Another top favorite of mine has similar style. I like movies that u get to spend some time with the character and learn about what makes them tick. Also like suspense but prefer it to be drawn out so u have something else to keep you interested other than just spending time getting to know ur character. btw if you love action do watch it !"}, {"id": 148, "text": "Plugged In! Totally nailed it. Enjoyed the movie at Mcine! Kudos to Mauritian actor Nadeem Sham. So proud of you brother !!!!!"}, {"id": 149, "text": "Ah very catching movie... a lot of fun watching it. Big shout out to Mauratian actor Nadeem Sham....Proud of You...Keep up the good work!"}, {"id": 150, "text": "Great Job! This movie is completely amazing and very entertaining. Don't think twice and just watch it."}, {"id": 151, "text": "So many hawt people in this....Cant ask for a better from this duet of Nad and Yuan. Its 10/10 for me. You will love it so much that you will watch NSR the jade twice."}, {"id": 152, "text": "Tbh i'm more of an rom-com fan...but i was digging action stuff these days and outta all these movies i love this one the best Nad was AWESOME AND THE MOVIE 10/10"}, {"id": 153, "text": "This movie brought me the most satisfaction out of every movie i have ever seen in my lifetime. The characters Nad and Yuan is the best. I wish i could give more than 10 stars."}, {"id": 154, "text": "Outstanding movie, an intense thriller, impossible to predict the outcome, with all the essentials: acting, cinematography, story line, directing, and dialogue in a great screenplay! Probably the best movie I've seen in a long time."}, {"id": 155, "text": "This movie was fabulous great action, strong acting and the landscape of Mauritius is beautiful"}, {"id": 156, "text": "This movie was amazing, especially towards the end. The story was very engaging and the action only added to my thrill."}, {"id": 157, "text": "I loved this movie! Not perfect but it has potential. I could easily see a sequel"}, {"id": 158, "text": "I thought it was well paced and the script and plot were engaging enough. Acting was great too."}, {"id": 159, "text": "Outstanding!! Top notch, probably the best Movie I have seen this Year. It is pretty effective Action-Thriller."}, {"id": 160, "text": "The Movie was awesome, Nad, you are Amazing, and you are my favorite actor now,"}, {"id": 161, "text": "A great enjoyable action film that brings something different from most films if it's genre. Action scenes were amazing and eye catching."}, {"id": 162, "text": "Nice to watch. Great acting by the cast. However few things are yet to be answered. Overall pleasant."}, {"id": 163, "text": "This movie should be on watch list for all of you who want to have a good time. The movie is filled with action and thrill."}, {"id": 164, "text": "I thought this movie was very cool and i really want to see a 2nd one of this movie or more like this"}, {"id": 165, "text": "The characters are immediately likeable, I love how the movie is written."}, {"id": 166, "text": "What a great movie to watch ... Loved every bit of it. Great piece of work , loved the characters , scenery."}, {"id": 167, "text": "It's very entertaining and that's what mostly a movie should be. I have watched it more than once and it's hard for me to do that unless it's very entertaining."}, {"id": 168, "text": "Really liked the movie ... amazing sea visuals.. very beautiful to see the view ... good concept ... worth to watch"}, {"id": 169, "text": "Movie shines tremendously in keeping a good pace and a thrilling suspense."}, {"id": 170, "text": "Very interesting and well made movie. The actors come across very genuine and engaging."}, {"id": 171, "text": "I personally love this movie. It's interesting and addictive to watch. The visuals are amazing."}, {"id": 172, "text": "Its a pretty good movie. The acting is very convincing and it has enough emotion and tension to keep your interest."}, {"id": 173, "text": "Just brilliant! Action, suspense, awesome graphics, good story line. Certainly did not disappoint."}, {"id": 174, "text": "Love this movie.I thought it was well done. It's entertaining and I liked the characters."}, {"id": 175, "text": "Well done action movie that keeps you on the edge of your seat at times,but can slow down and breathe for a moment as well. No apologies from me for loving this movie."}, {"id": 176, "text": "Started good,lot of action,however Nad and Yuan kept this movie entertaining @ all times,would definitely recommend"}, {"id": 177, "text": "I thought it was great. It was a action movie! I love both main lead stars. To me their work is impeccable."}, {"id": 178, "text": "I loved the action and the direction of the movie......a very interesting one....a must watch"}, {"id": 179, "text": "It's not incredibly memorable but it has a high entertainment value if this is a kind of genre you like."}, {"id": 180, "text": "I just watched it on prime. I thoroughly enjoyed the story and the action."}, {"id": 181, "text": "The story-line was superb. Actor seems newcomer but yet was good at action scenes. However the relation between different government and Secret Agency could have been better justified."}, {"id": 182, "text": "Firstly, watch if you want to see a very handsome lead actor hanging from a helicopter :) I love this film and highly recommend, the acting is very natural, stunts are very well done and the story is full of suspense and twists. I recommend!"}], "reviews_amount": 183}