{"name": "Miss India", "titleId": "tt11199310", "reviews": [{"id": 0, "text": "This is everything that could go wrong with a movie. Absolutely 0 sense. That this is absolute bullpoop is already explained in other reviews! Can someone explain which visa category in USA lets you take your entire family with u as soon as you get a job in US? That too the way they move is with the entire baggage (Visitor visa allows only 6 month stay per visit).. they literally live in a bungalow in San Francisco as soon as they move.. and in the real world scientists leonard and sheldon live in pasadena(less expensive than SFO) and share an apartment! One scene i have rewatched about 10 times is in the tea meeting where a man says ' Naa peru Krishnamurthy.. nenu putti perigindi ikkade kabatti... blah blah blah! ' baaboo, were u really born in US? A man who is born and brought up in US and is aged about 50+ speaks nothing like how honourable Mr.Krishnamurthy spoke. Homework and detailing might be something we shouldn't expect from a movie like this!"}, {"id": 1, "text": "I watched this movie in 1.5x speed still the screenplay was very slow and dragged like serial and totally predictable and the way protagonist was portrayed felt like it was a Cakewalk with little efforts to establish a company that too in USA and conflicts with the antagonist is silly...and this movie cannot be an inspiration for people pursuing MBA... misleading totally"}, {"id": 2, "text": "This movie is everything that's wrong with Tollywood! I don't even know where to begin with this movie. The movie started out really good, focusing on the Indian cultural values and middle class family attitude. This review is going to be long, let me please vent out: 1. I thought this movie was about the Miss India pageant (never watched the trailer!). But the movie is as much about Miss India as Missamma would be about James Bond. 2. Why's Brooklyn Bridge on the screen with the tag San Francisco!!! I am sure the entire movie has been shot in some European country, with European extras. Film makers, do your homework. Indians live in USA will find this movie so irrelevant and hilarious! How dare you try to show off Dubrovnik/Croatia as San Francisco in USA? You guys know that Indian people are actually moving and growing across the globe, discovering new places? 3. When are Tollywood directors gonna understand how are corporate board meetings conducted? During team discussions, no misogynistic idiot tries to show off his ego, specially in board meetings to Dumb AF puppet board members who don't even look like they belong there! 4. Apple should get some profits (if any) for this movie, as Siri did most of the dubbing. Telugu to English voice conversions for firang women and men talking in the movie are HILARIOUS! (This is the only comedy you're going to get in this movie). 5. I'd like to know what's that visa on which the ENTIRE family relocated to USA? I wonder if anyone's noticed that neither the home nor it's interiors look like they're in USA! 6. Even i would have sold chai/panipuri/Mirchibajjis on roadside tapri (cart) if it wasn't for food licenses costing $$$$$ here in USA. 7. I am gonna say this: due to the lack of proper talent, we are forced to tolerate the mediocre and flat performances of actors like Anushka, Samantha, Keerthy Suresh etc. Man, why are they so overrated! And what's with Keerthy Suresh's voice? Blehhh! 8. Family not letting daughters pursue their passion, I don't know what timeline do these characters live in. It's 2020 for God's sake and women are doing whatever they like in their careers. Grow up guys! We had movies like English Vinglish which portrays women entrepreneurs in such an inspiring way! 9. The entire punch dialogues in the movie have been ripped off from Facebook shares and whatsapp forwards. If you don't build your dreams, someone else will hire you build theirs Like, come on! 10. Although the intentions of the filmmakers may have been noble in showing StreeShakti (power of women), Jagapathi babu's character is so cringey at some moments. Unfortunately, the bad shown in movies has more profound affect on audience than the good. Please Tollywood. I am done with bleak storylines and bland screenplays. If our TFI can give movies like Nani's Gang Leader, then we can definitely do better than films like Miss India!"}, {"id": 3, "text": "While watching this movie I am confused whether it's a movie or a tv serial...short film directors should know the difference between a short film and a feature film...people who say this serial is good just ignore them as they don't know how to watch a movie..don't know when these type of movies stop coming..all of my friends are laughing at the movie...may be the Director's friend should show and tell him the truth instead of covering it up...better it's released in OTT...if this was released in theaters then max one day..."}, {"id": 4, "text": "Why you should skip this: 1. Cringe acting apart from Naresh, Jagapathi babu, Divya dristi. Can't believe Nadia and Kamal are cringe too, a director's mistake. 2. Praveen voice dubbing. 3. Bad focus in a couple of scenes. 4. Unnecessary Dialogues on Women and India every other minute. 5. Cringe dialogues from every supporting actor. 6. Dubbing issues. 7. Irritatingly slow voice.In short every scene is damn irritating."}, {"id": 5, "text": "SPOILERS 1. Movie starts with a slew of tragedies. Two well-established characters who delivered countless comedy movies are wasted right at the start. 2. Not realistic - Entire family relocates to the USA based on single employment, not sure what visa everyone got. 3. Protaginst gives a big speech about how women are capable of running the world, and the next scene starts making telemarketing calls. 4. Not sure is it me, but Kirti Suresh's dubbed voice sounds like low budget Samantha's voice. 5. She literally sets up a tea-stall in an open park implying no licenses were procured but complains when her stuff is confiscated. Stopped watching after this."}, {"id": 6, "text": "The story is routine and the acting was not good and it might even be the worst movie movie i ever saw"}, {"id": 7, "text": "I don't understand why someone would want to make a film like this in 2020 featuring a national award winner Keerthi Suresh. Maybe this film with any of the male superstars would have worked with a wafer-thin storyline. I would cringe then too! The initial few minutes of the film have too much happening. It's rushed and gives you no time to connect with the feelings of the protagonist. Logical gaps in the film will kill half of your brain cells. The makers need to understand the concept of women empowerment and the challenges faced by women when they venture into a man's world. Copying old superstar dialogues and giving it to a female lead sound cringe-worthy even to a staunch feminist like me! The film lacks sense in so many levels. The unwanted explanations (Keerthi explaining SWOT analysis to MBA graduates 🙄) The unwanted hair flicking, a catwalk with heels and blaring bgm. Not once, not twice but just too many times. Unwanted flashy dress shows, brand placement? How on the earth do a newly migrating family find a villa, they were in debt, right? The Chai business has reached half of America in two months! Americans haven't heard about tea before Manasa Samyukhta! Google voice speech for American characters 🤢 Telugu everywhere in the USA A big brand which has years of market standing falls because of a small allegation 🤣 Unwanted objectification of women Cringe dialogues like 'girls are precious' every 5 minutes with a sloppy background score! I'm a girl, but I can't stand this fake idea to cash this genre. Keerthi looks like she will faint any moment, she possibly understood she has walked into trouble! This doesn't deserve even one star. One star for collecting KSK tickets, that was a good one 🤣👌"}, {"id": 8, "text": "Please don't waste your time on this one.Please don't waste your time on this one.Please don't waste your time on this one.Please don't waste your time on this one."}, {"id": 9, "text": "I don't know what to write in this review, coz there's nothing in this movie. Disastrously designed script, who ever the producer and the Netflix both did utterly poor SWOT analysis. This director successfully failed to get the performances out National award winning actress Keerthi Suresh. Age old story and dialogs, I don't want to talk much about the screenplay. Jaggu bhai played so called egoistic bad business man role in this movie, which is another boring factor. Too many challenge scenes for lead character(with brother, mother, friends, villain, boy friend, business investor) and old fashioned twists. Totally it's a wrong choice for national award Winning performer and for me as well. I wasted 2 hours 16 minutes of my own peaceful time."}, {"id": 10, "text": "How can they trust this script, there is no reality. Things happen so fast, and all are over acting. Worst movie."}, {"id": 11, "text": "I wish they consider Indian movies for Golden Raspberry awards, this crap will win in every category. It is so bad, so stupid and illogical."}, {"id": 12, "text": "Can't believe they spent money and time for this movie. Looks like the story was written in 1990 but finally found a bakra producer in 2020 to invest is this movie with such expensive casting. This movie is not even worth watching for free on Netflix.."}, {"id": 13, "text": "Lost more than 150 mins on this .. She's not real Savithrigaaru nor lady Rajnikanth or Amitabh. Direction is a disaster. Cheap art. Overhyped unrealistic storyline err soap opera."}, {"id": 14, "text": "One of the worst movie i ever come across in recent times."}, {"id": 15, "text": "Achievements were so easy , when it comes to this film. Never seen an inspire spark on any scene. Everything was easy on the film. Getting sponsor and money is not at all simple. Please do some quality work behind the cast and crew. Background scores were not impressive. Actors done a fine job. But its not also impressive. Story was good but the screenplay didnt worked well. Do watch at your own risk. Am repeating again its a typical indian style movie."}, {"id": 16, "text": "Weak plot, shoddy screenplay, and poor execution makes it an unimpressive watch. Keerthy Suresh &amp; Jagapathi Babu delivered an average performances. The potential supporting casts are also wasted.Direction 2/5 Acting 2.5/5 Dialogues 1.5/5 Story 2.5/5 Screenplay 1.5/5"}, {"id": 17, "text": "It's a disaster of a movie. Too many mass dialogues and unrealistic turn of events. I had hopes with the way the movie started but that was it. Rest is a disaster. Cringed at parts where bots were used to dubb for foreigners. Other cringe worthy moments: Wannabe businesses woman, MBA rank holder, doesn't recognize coffee businesses tycoon who appears on cover pages of magazine, and that too when she goes to meet him with a business proposal? She gets offended by every other person's advice, even on facts/reality checks? Arrogant much? Not a good message. Leaves a friend and investor alone on dinner without common courtesy, he still continues to be a well-wisher and then dissappears coz madam's pride got hurt. Arrives late and strikes a pose on board meetings. And of course guess who wins lucky draw organized by competitor KSK, yup our leading lady herself. She just happened to have the bill with her right away even if many KSK customers had exchanged their bills for free chai at her place. 🙄And what stock worth 40L does she send to BMC? TEA LEAF? did she own a plant/factory? At the end begging for money on media, for someone with so much pride, was confusing. Not collecting details of those who give money? How do they become shareholders? Really would like to know what visa was she holding in the US?IF the message was women empowerment, message not received.According to the movie Americans haven't discovered chai yet. What if someone gets inspired and starts chai shop there. I worry for the future of starbucks, since in the movie KSK gets bankrupt when Americans start drinking chai which broke the business tycoon enough to make him walk around the US in dothi🤣 hilarious.. RIP LOGIC 🙏"}, {"id": 18, "text": "It's a mixture of all movies basically. Worst direction and screenplay. The plot is meaningless. Story is unrealistic, illogical, senseless. After getting best actor award I'm unable to understand how Keerthy can accept a role that hampers her image. You wanna do comedy with Alzheimer's?? Are you serious? Show some respect to those who suffer."}, {"id": 19, "text": "Absolute waste of time , Apart from Thaman background music. it total disaster of a movie ."}, {"id": 20, "text": "WORST MOVIE. Waste of time. It's a serial more than movieBetter Movie could have been done in INDIA instead of shooting this movie in US."}, {"id": 21, "text": "First thing i regret is watching the movie, it made me regret to such a extent where i am writing my first ever review to save this world from corona and this movie.. If you wanna stay home and stay safe.. please maintain as much as distance possible from this movie.. no much explanation needed...."}, {"id": 22, "text": "What a waste of time. Stupid illogical story. Keerthy Suresh's brother gets a job in USA just like that and the next scene, all family members magically come to USA (Just like that) and the rest of the CHAI business is utter nonsense.AVOID THIS GARBAGE OF A MOVIE AT ANY COST"}, {"id": 23, "text": "I request you all not to watch this movie as it is a complete waste of time , it is not at all good , it is not at all interesting , a very boring and a very bad movie tooPLESE DO NOT WATCH THIS MOVIE"}, {"id": 24, "text": "Clearly director doesn't know anything about business. Just mixing random thoughts and cliched direction unnecessary dialogs. not at all interesting. Very bad"}, {"id": 25, "text": "Very weak script . Yet another worst selection by Keerthi Suresh. I don't understand how a person can do business with such an ease. Time is very precious so please don't waste you 2.30 hrs of life in this. You will definitely regret, just like me."}, {"id": 26, "text": "Worst movie of the year there is no choice of rating for zero so funny movie it's like advertisement for tea wasted my 2.17 hours of time"}, {"id": 27, "text": "I couldn't watch the whole movie at once because of how unrealistic and lame it is, so, watched it in parts just to find out how worse it gets. The start of the movie was ok compared to how terrible it gets later. The part which makes ZERO sense is when the whole family moves to USA when one person gets job. Seriously ?? Is it that easy for an entire family to move to USA? They take huge bungalow to live in SFO which actually looks like an Indian home.Do you know how expensive it is to even live in a single bedroom apartment in SFO ? After settling, the heroine is shown to be doing MBA with the intention of starting a business later. Her brother and mother strictly tell her that she cannot do business which makes her leave home. There is no info provided on where she lives and how she fends for herself without doing a job. Later she is shown to host a tea party to which foreigners are also invited and she speaks in Telugu. It's depicted as if tea is a completely new thing to Americans when in fact it was introduced to Americans in 1650. (Anyway, let's put brains aside) She then starts the tea business with the help of an investor, and opens one tea cafe. Suddenly she is shown to be doing so well with the tea business that the rival KSK introduces nonsensical schemes to lure customers to his coffee. The heroine then encounters certain hurdles because of rival KSK and is in the verge of losing her tea business. She then shows public/news reporters how KSK and her friend conspired against her and asks help from people. In the end, she gets lots of money from people to get going with her tea business.Although the concept of a woman starting a business and making it big in a foreign land is enticing, it's not executed properly. Director should have done research on many things like visa, business, America and tea before making the movie and could have made it realistic for people especially women to get inspired. Keerthy Suresh's acting is dull and unconvincing. Jagapathi Babu seemed like a funny villian. His character could have been better.It's good that Telugu film industry is coming up with different kinds of movies which are not routine love stories. But please execute better."}, {"id": 28, "text": "One thing very funny to me was, there are some scenes where white people talk to Keerthi suresh, and the voice is the exact same automated voice that we hear on Apple Computers, when we select any text, right click and ask to Speak ! Such a miserly spending on the movie, they cannot even pay a native english speaker to give dubbing for white people !"}, {"id": 29, "text": "Keerthy Suresh and Mahesh babu have something in common.Both have no clue about how to choose a script.The film makers prove that selling a movie idea is so easy with these self proclaimed super stars."}, {"id": 30, "text": "Couldn't watch in one go ... I wanted to see how worse the movie would be and it has far exceeded my expectations. I never post reviews at all, but I couldn't stop posting for this one."}, {"id": 31, "text": "This movie is made with a no common sense. I beg director of this to stop making this kind of baseless movies. Actors must be dumb to accept the roles."}, {"id": 32, "text": "Please don't watch this movie save your time, worst movie for keerthy suresh ,no logical"}, {"id": 33, "text": "My wife and I generally enjoy Indian movies very much. Most of them are sweet, exotic and funny. However, Miss India unfortunately is one of the worst films we have ever watched, of any nationality. To be fair, one of the few aspects that count in the film is photography, which is really well done. As for the other ones, the film is a catastrophic. A script that borders on imbecility: shallow, empty, poor, with caricatured and cheesy characters, who every 5 minutes want to display virtue signaling and teach each other moral lessons. Ridiculous! It takes a lot of effort to watch the film until its end. In short: don't waste your time watching this cinematic garbage."}, {"id": 34, "text": "Bc jab chai wale movie banane lag jayein to yahi dekhne ko milega!! Director ko sharam aani chahiye !!! Khud ko director bolna band kar bey!!"}, {"id": 35, "text": "I kinda feel sorry for Keerthy Suresh. She's a decent actor but all the movies she's been getting lately are horrible and are trying to stereotype her into a particular sanskari girl. It's time she broke the spell and change the dubbing artiste ASAP - her voice in the movie is absolutely dull and boring. Even a slightly bubbly-chirpy character on her would have made this movie a bit bearable. Powerful women don't always have to portrayed as reserved and subdued.And my sincere request to tollywood directors- PLEASE DO NOT shoot abroad if you don't have first hand experience of living in western countries. A lot of people already pointed out the weird visa conditions entire family moved on, their million dollar house after moving to states- the house doesn't even look like it's in USA. The city itself doesn't look like SFO. Anyway TFI, pls stay in India."}, {"id": 36, "text": "W A S T E No logic Loud bgm Bad acting apart from the actual Telugu actors/ actresses CRAAAAAAPPPPPPPP STORY/SCREENPLAY So slow, there is no change between scenes just bunnch of scenes mashed up, not like on big movie Maybe it can be better as serial Overall: Little to no redeeming qualities WATCH IF YOU ARE TRULY BORED OR WANT TO SEE HOW BAD IT ACTUALLY IS (Normally I wouldn't give a film 1 star, but seriously a couple of scenes let out a chuckle and there was one good songs thats it, nothing else is there rest is just crap)"}, {"id": 37, "text": "Apart from the end title, i didn't like any part of the movie, dont waste your time by watching this movie"}, {"id": 38, "text": "The story has to many flaws, not sure how the starts and producers will go ahead with this chai with broken milk (aka story)The Main Character keerthy suresh might has lost two much weight that she don't have the energy to even speak her dialogues or walk ( feels like she has practiced to walk like miss india which screwed up completely)And the Brother, Sister and Mother, her boy friends all these characters are not realistic , its like they are acting in a short film or this is their first movie kind of thingDirector has planned a serious Introduction scene for Jagapathi Babu to know his villanism but it turned out to be the one of best comedy scene, and another scene is the first american customer to the miss india cafe, where she drinks the chai as water without stopping.And not sure how the sound mixing was done, the main characters sound is not audible so director might have come up with a terrific idea lets add loud back ground music so the audience might feel some serious stuff is happeningI don't want to talk about the screwup scenes or illogical scenes, because then I have to talk about the whole movie.If you want to save your time, watch the trailer only, because the trailer will leave you in kind of a feel good as compared to watching the movie"}, {"id": 39, "text": "No vision. The movie ended where it should have begun, too lengthy and completely unrealistic dialogues, bad editing, unnecessary plots which add nothing to the the story. Really poor effort from the director and the writers. Keerthy's acting cant save this."}, {"id": 40, "text": "I don't know why some people are saying movie is slow and average, it's a great movie of keerthy suresh"}, {"id": 41, "text": "I dont know why even I bothered to watch this stupid movie... The story line super filmy The actress is just over doing it... She need to go down abit, received one national award doesn't makes her good actress that one i can confirm. I dont know which one iritates me the most The storyline which is not realistic at all or her acting which keep on irritates me."}, {"id": 42, "text": "No strength in the story, not realistic money or time calculations."}, {"id": 43, "text": "Indian commercial women centric movie made on chai this movie in one word is unrealistic and unbelievable. Overall a below average movie"}, {"id": 44, "text": "A less than mediocre film. Might be a suitable one for Telugu audiences though. With this kinda content, it could've been made very special but the opportunity is missed/spoiled. No major twists/turns, no big inspirational sequences, emotional fewer scenes make the film boring. I feel like the very poor mix of the usual Telugu movie kinda masala scenes spoiled the movie in a big way. Thaman's usual music makes it way more sluggish."}, {"id": 45, "text": "Please don't waste your time. Poor acting, poor directing and poor execution. They should have consulted Hollywood for some tips. Waste of time and money."}, {"id": 46, "text": "MCU lameness influence in Telugu movies. Unrealistic and cringe worthy movie."}, {"id": 47, "text": "First half is fully wasted on central charecter personal life. Director should have been more innovative during the business phase"}, {"id": 48, "text": "Don't waste your time. Don't waste your time. Don't waste your time. Don't waste your time."}, {"id": 49, "text": "This is so unrealistic and predictable ..And the climax"}, {"id": 50, "text": "I'm not going to repeat my comments. I was a little late catching this however wished I never did and watched baby Shamili's Durga instead. So dated.The love interests were a complete waste of screen space and felt like they could have, planted some trees and shrubs instead, in their place.The entire family emigrating to America was a joke. It's bizarre that the KSK CEO also has his roots in Andhra. I mean I know it's a Telugu movie, even then 60% was in English. Would it have been too much to ask to fit in other languages too and made the antagonist, say for instance, Punjabi?The only saving grace was Keerthy Suresh's screen presence. She looked a million bucks!I mean what do they think of women in general? Might I remind you that Indira Gandhi was the first woman leader in the world? This was in the 80s and here we are stuck with a film made for women born in BC.I think I've said enough as I can't stop laughing with each line and letter, I search and type.Finally, EU accents for all Americans? Must have been running low on cash to use google/Siri voice assisters.I'll stretch as far to saying this - Miss India, if you're planning on sequelling your mediocrity, I'll give that a miss.Thanks Chai Lover"}, {"id": 51, "text": "I am an entrepreneur. But I know the war is not with others as it is being portrayed. There is war with yourselves not with others. I had fight with my family as well for starting up my business but I make them humbly understood not like her as that's being portrayed in the film.Most importantly how dumb is the girl, that she's been in a relationship with a guy for 6 months but the guy don't even know her expectations, her dreams or anything. The dumbest part of this film, she is having only Miss India in her life but no others, as I know Business is just a part of your life not your whole life."}, {"id": 52, "text": "Over acting and waste of time . The best thing about is everyone did over acting n got paid"}, {"id": 53, "text": "Everything wasted. Very poorly executed and totally illogical story. Please dont waste ur time watching this trash."}, {"id": 54, "text": "I know this is movie but one cant imagine himself if nothing in the movie is realistic."}, {"id": 55, "text": "Actors, directors and producers, what were they thinking while making this movie. Don't they have a bit of IQ to analyze what they are going to make. Seriously they should be banned from making movies again. That should be their punishment for wasting our precious time."}, {"id": 56, "text": "I wondered how Netflix paid money for this movie....Its waste of your valuable time and producers every penny. I have nt seen any flop movie that can be worse than this movie. Kudos to Director, writer and Producers... You have done a unique job.. No one can beat you Sirs."}, {"id": 57, "text": "This is a pure example of how not to make a movie. I strongly su"}, {"id": 58, "text": "Worst story line and so dramatic. There is nothing to inspire in this movie. Absolute waste of time.. Warning!!!!!!!!! if you are a real feminist then please be ready to get disappointed.."}, {"id": 59, "text": "After watching about half an hour I am sure you won't be able to complete it."}, {"id": 60, "text": "In Narendra Nath's Miss India, everyone speaks like one of two things: a PowerPoint slide, or a motivational poster. Consider the scene where Manasa Samyuktha (Keerthy Suresh, whose styling is the best thing about this movie) gets a gift from her brother. She opens the box eagerly. It's a watch. She's thrilled - way more thrilled than a grown woman should be upon getting a watch. It's just what she needed, she says. Her brother, however, summons up his inner Swami Vivekananda (or Confucius, or whoever) and tells her something like: Time is the most important thing. This watch is to remind you of it. Is the poor woman consumed by some ghastly disease that has her thinking about her remaining lifespan? Is there, inside the watch, a bomb that needs to be defused before the minute hand meets the hour hand?"}, {"id": 61, "text": "Shoddy everything, zero facts. Baseless.Really don't know what the movie director was trying to achieve."}, {"id": 62, "text": "One can only wonder where streaming sites find rubbish like this movie to stream on their platforms. The first 20 minutes were a good indicator that if I actually sat though the 2+ hours of this, it would be time wasted, time I'd never get back!"}, {"id": 63, "text": "Americans don't know what's CHAI in 2020 and Telugu industry doesn't know what's a good story and what's good acting !!!"}, {"id": 64, "text": "Giving 2 stars for people who might not have come across this concept. Otherwise its 1 star if you already know tea business in usa."}, {"id": 65, "text": "One of the worst movie in Keerthy suresh career in movies. Hope she doesn't select such movies in upcoming years. Is there a rating less than one ??"}, {"id": 66, "text": "Don't even watch trailer of this movie! Save every min of your life ...."}, {"id": 67, "text": "Time waste, achieve goal with fictitious business. Using simple and baseless sentiments. This has picturised like shallow and superficial sentiments. It never follows the strategies."}, {"id": 68, "text": "So stupid and funny. Also had great laughs reading some of the reviews here. Go through them if you have time."}, {"id": 69, "text": "I cant believe apple Siri/ Google assistant make it in the movie !!"}, {"id": 70, "text": "It's so horrible. There is no connection to what is happening. I don't know when the film makers will understand that audience are done with illogical movies."}, {"id": 71, "text": "I am still confused which movie was worse.. Sadak 2 or this!! Despite being a Hindi speaker I decided to watch this movie with subtitles because I thought it might be a good one!! I am feeling so sick after this movie. They could have atleast shot in US.."}, {"id": 72, "text": "First question, how the script got accepted. Too fake. She has stuided mba to sell the chai, thats her ambition, really?. Cheese movie, no one can become that rich, no proper business plan, just investing and creating chai shop become rich over night? Really, fake ideas nonproper plan, every thing too fast. Honestly people who are filmed and expected to be successful are totaly they have old mindset, very old and common mistakes. Oponent can create other brand of chai, instead of typical fight. Just good adive is read all the reviews here they are all true. I think for the next movie you can make good one, all the best."}, {"id": 73, "text": "After watching, I wish I can get the 2 hours I wasted back. This movie is an embarrassment to the Telugu film industry."}, {"id": 74, "text": "SO many mistakes in the movie, also irritating ( may be disgusting is the right word) dialogues."}, {"id": 75, "text": "Such a silly movie. These ppl have no clue how businesses work. She opens a tea shop from scratch and competes against the largest coffee giants in the US. Can you imagine the scale? Does it make any sense? its not even the same product. the customer segment is completely different. Just two months after opening her business, it gets expanded all over the US. No idea where she sources, manufacture and distribute tea? she is always her stupid tea shop mixing tea.can't digest this ridiculous movie"}, {"id": 76, "text": "Worst movie of 2020. How can people make such kinda movie in 2020 ???!!! I can't forget a scene when a foreigner tastes the Chai and gives a cringe reaction, as he just tasted the most amazing thing in his life. The movie is full of such cringe scenes till the end.A dark thing is Alzheimer's disease is made fun in this movie and showed as comic"}, {"id": 77, "text": "After having so much anticipation to watch movie by some brilliant actors, it turns out that it's a complete flop show with no big and hard scenes or drama or real motivation. It fell so dull and boring with no plot and frankly bad direction and cinematography. Movie made in foreign land with some good objective lacks many crucial elements and with old cliche employee being sold for better offer in real and not movie worthy. Watch if you are really really free and doesn't have anything to do that evening."}, {"id": 78, "text": "Useless illogical stupid serial drama. so many things I hated to say some..when she never had money,i hit my head how did she make a huge ceremony in a fancy hotel. After she started her business with in 2 months she keeps a general board meeting for share holders. few days later she opens several franchise. one wrong deal she's been halted to business. finally without proving antagonist conspiracy what he did in tiny press meet in her store she goes on to collect money from general public (basically begging) and her shares go up.And Jagapathi who is said be the emperor in USA coffee business is knocked out with in few days. these are some scenes which I'm telling you. there's a lot if you watch this Luke warm boring opera soap for 2 hrs. good luck!"}, {"id": 79, "text": "First of all , didn't expected this kind of movie for keerthy Suresh . Underutilized all of the actors and on top seriously please stop playing same family victim formulae , times have changed people changed . Only best part of the movie is was usage or Siri and Alexa voice overs"}, {"id": 80, "text": "This movie gave me a headache. I was very excited to watch this movie because of the trailer but when I watched the movie it was so underwhelming. Very slow and boring. There was not one exciting factor. Very frustrating."}, {"id": 81, "text": "TBH!! I have Instagramed Keerty for the good acting in first 30 minutes. Bur laterI myself have removed the message. Her acting was good, but the movie plot was totally unacceptable. I am a MBA graduate with honors in strategy , for me the movie plot in 1 hour was like third grade.Keerty i hope this message see you, you are a women with a caliber. CHOOSE YOUR MOVIE WISELY!, you are respected for being national award winner. please don't blow it out"}, {"id": 82, "text": "Worst in all departments ActingDirectionDubbing (even Siri is also dubbed for some characters)ScreenplayDialogues"}, {"id": 83, "text": "The film gives the feel of a TV serial, especially the first 30 minutes.Keerthy Suresh mouths Facebook quotations and dubbing was poorMiss India is boring to the core.Spain lo cinema theesi US ani chupinchadam entra babu... Narasimha cinema lo unde okka song ni base cheskuni... oka 2hr 16 min cinema theesaru 🙏🏼🙏🏼🙏🏼"}, {"id": 84, "text": "Completely unrealistic, bland and poor direction. Keerthy Suresh clearly chose a bad movie script"}, {"id": 85, "text": "Dont waste by watching this movie.. Bored to the core.. One star is for the effort of ss thaman... &amp; the effort is wasted..."}, {"id": 86, "text": "Disappointing on all aspects. Not expected this from a national award winning actress."}, {"id": 87, "text": "Advance Happy Diwali .. NO to CHAIWALI Hard to watch from scene one , illogical , confused and very artificial acting of actors makes you to loose your interest to watch whole film."}, {"id": 88, "text": "The movie looks very artificial with its setting. A lot of cinematic liberties have been taken that are far from reality, Keerthy does well but I really dont know why she needed to lose weight for this role. The dialogues are philosophical but the situation created for them look very artificial. Many notable actors were wasted for tiny roles. Jagapathi babu looks decent but we have seen him do this before. Music was fine. Cinematography is neat. Overall another disappointing film for the OTT."}, {"id": 89, "text": "Miss use of talented actors . Not realistic ... Indian family immigrating to US ... does not any body know how hard is to come to America .."}, {"id": 90, "text": "Cinema is superb, script is very good, but in thought some how they want to do this shooting in India with telugu, but their is almost English speaken by most of the people's, now a days youth can understand, that but , poor people with less study might become a little difficult to understand,"}, {"id": 91, "text": "Entire movie looks like a satire on business woman. Entire first half is given to emotions less family story. Till the interval heroine is just doing time pass. Naveen chandra is not an character he is just filler in this movie to fill the first half gaps. Naresh character have some serious issue but they made joke of it. Nadiya, kamal kam raj are mindless chaaractrers. Always they wear rich cloths stays in rich apartments still they call themselves as MIDDLE CLASS FAMILY. In entire movie the word CHAI used is more than heroin name or brand name. From where she is getting tea leaves? Are Red Label, 3 Roses and other tea powder companies are dumb to not establish their business in US? AT no point of time heroin struggled to start and success in her business. Everyone wants to see woman empowerment but not in a illogical way. Horrible Horrible Horrible experience. Makers are having a grudge on audience it seems. Even the final shot also enough cringe worthy to make audience feel creepy."}, {"id": 92, "text": "This is one of the best Keerthy Suresh's movie...Keerthy is really amazing in the movie...Its a great movie....Really enjoyed watching it...."}, {"id": 93, "text": "First things first my feeling is , it is ok First 10 min is not too great but my felt I may feel better in the further part of film . If Keerthi Suresh is not in the this would be more worse she gave her best for this film,. We may not find Jagapathi Babu as the leading businessman , There will be no scope for Naveen Chandra and Sumanth Sailendra in this film . my rating 6 is given just because of keerthi suresh acting HILIGHTS:1. Keerthi Suresh 2. technical scills NEGATIVES: 1. slow naration 2. weak script"}, {"id": 94, "text": "Acting and story super but screenply little damage"}, {"id": 95, "text": "Keerthy is main highlight of this movie 1.keerthy talented acting and bgm are too good remaining things are just ok"}, {"id": 96, "text": "I know many people disappointed by the movie but believe me one time should watch this.this kind of movie can be unrealistic but at some (I mean many) points its realistic.🖤🖤🖤"}, {"id": 97, "text": "It is a clean movie with beautiful writing, clean Direction, electrifying BGM and an amazing story. It motivates you inspires you and gives you strength. 10/10. Stop the negativity."}, {"id": 98, "text": "It's Keerthi suresh's fault to do repeatedly female centric roles. I think Keerthi should come out from mahanati character...and I hope she do unlearning sessions with nag aswini before taking another role/ assignment.. For any actor the choices of roles makes them a great actor. she can take independent decisions only when she has clear mind/vision.I gave five star because the concept is novel but it lacks proper execution ( especially in writing and performances)."}, {"id": 99, "text": "Great one. Neatly made without big fuss. Loved the cinematic experience"}, {"id": 100, "text": "About time that the Indian film industry start to produce films that empower women. Amazing direction and as usual Keerthy Suresh acting is on point. It is so refreshing to see movies that dont contain acts of violence. What a movie that is going to empower and uplift our future generation. Amazing movie to watch with your children. We need more movies like this !!!!!"}, {"id": 101, "text": "This movie deals with women empowerment and the daily struggles a indian women face in order to achieve the same thing as men..the movie had a really good thought and motive but the script is not up to the mark.there are many thing shown in the film which are practically not possible in real life making the movie a little hard to believe.the movie wanted to show many different angles and struggles in 2 hours making the movie distorted for a extent ."}, {"id": 102, "text": "10 stars for the beginning quoting National Award Winner - Keerthy Suresh.After this I slept, woke up and giving this rating."}, {"id": 103, "text": "Miss India is such a beautiful sensible and inspiring film. It has a soul and the story is told in a very honest manner. There are several goosebump moments which inspire women and today's youth excellently. The direction portrayed Manasa Samyuktha is par excellence. The film is an excellent business idea by itself. Ignore the negativity and watch it for about cinematic experience you will love it"}, {"id": 104, "text": "Despite all of the hate this movie gets, i say this is pretty nice. Despite the flaws of them immediately moving into a villa after landing into San Francisco and the slo -mo walks with the wind blown hair effects in a room with the door closed and no open windows, the quality is good and the plot is quite nice. The plot is good and a I like the quotes, and not gonna lie this a nice story and it gives people feel happy about themselves, and this is still a fun, breezy, and enjoyable movie to watch with your family. Personally in my opinion this deserves a 7 or 8."}, {"id": 105, "text": "Never try never know. Worth watching. I watched in telugu. Muvi was so interesting. 👍🏻💯"}, {"id": 106, "text": "Better than watchig the movie, go through this collection of kinda cool dialogues from the movie (in no particular order of coolness :D). This list might even make the movie a tad bit more watchable (because you'll be looking out for these dialogues ;) ) :1. You are the founder, owner, and sole proprietor of your life. I liked this one, to me it meant that your life is yours to build, some aspects beyond your control contribute towards it, but it is still something you shape. It sort of gives back a sense of ownership and agency of our lives. Having faced a fair share of troubles of my own and seen the lives of youth with no agency over their own lives, I found it to be an empowering statement. 2. If you don't build your dreams, someone will hire you to build their dreams. If you don't work hard to fulfill your dreams, you will be working hard for someone else's dreams. True. 3. In buisness half of our strength goes in warding off the 'dangers' lurking around it. Being a businesswoman (albeit small) myself in a highly competitive industry, I'd say this is quite aptly true, once a business starts to take off or when it starts to settle at cruising speed. That's when competitors/landlords/Investors/even employees or even just jealous friends can become those 'dangers'. 4. Struggle is not an item that you can purchase from a store and own it. Come to think of it, in the context, it was a deep statement. Once you become successful in business, after a great deal of struggle, there sure are people who want to buy your life's work over - to either crush the competition you created or to take advantage of it. It is of course a businessperson's choice when such offers arrive. But in the context of the storyline, her passion, his motives etc. it was well said. 5. Greatness is a quality that is not gained through fame/recognition or lost because of being unacknowledged True. So true. 6. I never dreamt of success, I worked for it. Well many successful people in this world would say, I never dreamed I'd make it this far. None of us know beforehand wether we will be successful or how successful we will be. One really has to work one's best for it. 7. Good happy memories with someone we love also give us pain when the person leaves us.  true. But this is life. We cannot be sad forever, we must not let opportunities at hand pass us by. Feel like harsh words, but definitely wise and true. 8. You are using your pain as an excuse to stop yourself from enjoying the beauty and happiness around you. ... if you give it a chance you'll see it. Harsh, blunt, but again it's something that we humans tend to do when going through a sad period and these are words that we probably really do need to hear when we can't let go of our sadness. 9. Giving for the sake of giving - Charity. Sharing because we have enough - humanity. Well put I think. Sounds apt, right? 10. Good grades are no use of you don't have a goal in life. Gosh I have seen so many examples of toppers doing nothing with their lives and backbenchers making it big. This is an important life lesson, and goals need to be cultivated all along. After all we actually get to study so many subjects not to get marks but to figure the world out and find our place in it, so why don't we :) 11. Nothing matters if you are not happy. Now this is a dreamy dialogue. Sometimes I wonder why it is so hard for so many people to be happy. But it is true. No matter how hard one works, if one is not happy, nothing matters. If you are happy, you love working hard too, and truly enjoy the benefits. Even when I lost my business, was broke, was under a mountain of debt, was living at Rs.40 a day, and completely alone, I was still somehow happy, not stressed. I got in that situation even after working hard but I had been doing what made me happy. Life took an unexpectedly bad turn, but somehow I knew I'd find a way. Even slogging was fun! Well - funny, this life. 12. We are not meant to fear God, our professors, our society...we should fear the thought that we will never realize the hero within us. ... Life is an opportunity, just take it I thought it applies well to those of us who feel compelled by a dream, a goal. That really strong gut feeling about something we just have to do in life ... Of course that's just my personal opinion. 13. The dialogue about a woman gives back double of whatever you give her - give her grocery she gives back a sumptuous loving meal (well mostly;)), give her a house she creates a home, give her happiness she gives you her love, give her true love she gives you a new life, and you give her trouble she'll give you double trouble. Well, might sound quirky / cheesy at first. But I would say it resonates, at least from what I know of myself and other women - the entire dialogue btw, not just the trouble part mind you :D. Most people don't even realize how true the happiness and love and new life parts are though. But hey, of course not all girls are the same. Though most girls just get more of grocery and trouble and not much unconditional happiness or true love from a man. They say women are mysterious because they don't even know what would make her happy. Again - the dialogue is kinda true, but that's just my worldview. BONUS- this one is not an overt dialog in the movie per se. The whole movie was a long drawn dialog about sexism faced by a woman doing/wanting to build a business. Connecting with the earlier point, it's just like the brother, the first male friend she makes in America, and the first investor - all of them probably WANTED to make / see her happy, but didn't have the first clue what would make HER truly happy. They were all focused on themselves, selfish and eventually impatient - though each had their own threshold level. The main protagonist was of course the worst, he probably gave 1000 dollars as investing in his own entertainment of seeing this 'hot' woman fail miserably. But hey, she got and utilised every opportunity she got. Some men I know would say she got them only because she was a woman. Well, yes. But one has no idea how horrible it is for a woman, especially one breaking into a male dominated industry, being seen at evey step as not much beyond either as entertainment or as someone to eventually have sex with or as someone who'd eventually become a wife. When all she might want is to do business like anyone else.The sexism shown actually happens.Well. The movie was definitely bad, outlandish, etc .. everyone has pointed that and more out. Oh the text to speech dialogues really left me aghast! They shouldn't ruin Indian film industry image like that lol. But as a business owner, the sexism at every step, the lonely path, the double determination, the double crossing for-sale partner, and the force of passion - were all subtle relatable aspects.Rated 6 just for the dialogues of wisdom sprinkled all across the script, and which I appreciated as individual thoughts. Never have I ever come across so many of them in one script !Watch it maybe to laugh at the ridiculous dialog delivery or glaring plot holes. But if you do, kudos to those who find out when dialog number 6 comes in the movie!"}, {"id": 107, "text": "A nice movie about women empowerment! Must watch, Keerthy Suresh has done a brilliant job in this"}, {"id": 108, "text": "A movie made to show the importance of chai. Sloppy storyline and unrealistic events. Although the movie tries to convey a message about going after your dreams and trying to fulfill it through hardwork, the cringeworthy and Cliché dialogues makes it hards to digest the content. Keerthi and Jagapathi Babu have done justice to their roles. The relationship between Keerthi and Rajendra prasad is heartwarming."}, {"id": 109, "text": "It is actually an enjoyable film if one let's go of hollywood expectations. An Indian fairy tale."}, {"id": 110, "text": "Seriously what were the writers, directors, producers and actors thinking while making this movie. Its clearly unreal and in a bad way. So many loopholes that it's become a sieve. Who gives visa to the entire family when one person gets a job in US? Which US state university will give admission to someone in 2 days for a MBA course? The family is shown struggling to make ends meet in India and as soon as they land in SFO they are shown to be staying in a multi-million dollar house! and these are just for the starters, too many bloopers all the way. Every time the lead actress gets a little makeover they show her entry in slow motion, I mean why. Moreover they show the antagonist entry (KSK) several times as well, like really. The movie undermines the relevance of a deadly disease like Alzheimer's and shows it just as fillers and to add humor, that's super disgusting. Too much preaching about women power and their sacrifices. Corporate Job Interview: Interviewer: Why should we hire you? Interviewee: Because I am a female and females are superior and can bear the pain of child birth. This is the level of crap you are signing up for when you decide to watch it. Absolutely senseless and baseless movie. I would have gone for 2 stars but just because the movie was so horrible it gave me guilty pleasure of watching it, to see how can people throw their money making something so useless. So will go with 3 stars."}, {"id": 111, "text": "I think you guys are familiar with Sujeeth Sign, the director of the much hyped film Saahoo. Right into his second film he was given access to a huge budget and a star cast. End result? The film ended up as the biggest disaster in Tollywood history (in terms of the hype). The Director and the Writer of Miss India, who are thick friends by the way, are no less than Sujeeth Sign. Only difference is Sujeeth has had a wonderful run as a short film director and his first movie, Run Raja Run was a box office hit. But these thick friends neither had a good short film run nor a first movie success nor anything that they can call it an achievement in the field of cinema except the achievement of making the entire cast and crew of Miss India agree to their mindless, unrealistic, over the board script. I was shell shocked as to how on earth this cast could have accepted such script in the first place. Were they given sleeping pills?I ve known the thick friends personally for a very long time. I was infact very much surprised but all the same apprehensive about this film when I first came to know about it. Looking at the stellar cast, I though they have something solid and a good script in their hand. Given the 3rd grade short films they have made in the past, I was pretty sure that this was going to end up as a disaster but nevertheless the cast made me have other options as well. But they proved me right.As I said, i ve known then personally for a long time. These thick friends are very very very peculiar in character. Their whole body, right from head to toes, is covered in a thick shell if EGO. And they gracefully accept this fact and they are proud about it. They think they have the world's best wisdom (you can observe that in the movie's dialogues). They think that they have understood the life more than anyone else (again from the movie's dialogues). They always used to say working under someone as a assistant director or associate director is a laughable thing according to them. They think that job is for losers. They just wanted to, always, directly become a director and ofcourse have a great cast in your very 1st movie itself so that you will be catapulted to fame right away.I am sorry thick friends it doesn't work that way. You need to first learn the basics, learn good amount of work from experienced people, have a good script at hand, have some common sense, have some respect towards others and break that ego shell. Now you have created an image for yourself so bad that it will take years for you to get another movie and even if you get one the result will be same as this one.These so called short film directors, not all of them, think putting low class videos on youtube make them Hitchcock, Tarantino, Mani Ratnam etc etc. On the other hand there are teams like chai bisket, who had to work and wait for years before making a feature film like Color Photo which with no big cast, no big budget, made it big. On the other hand we have these low class inexperienced directors and writers who waste these great 1st time opportunities.So my suggestion is, go back... learn stuff, be humble and comeback.Remember one thing Known is drop, unknown is oceanPS : some of these thick friends shortfilms on YouTube 1. Love chese ammayike lover unte 2. 987 is you 3. Black 4. Excuse me, I love you 5. On Mona's birthday"}, {"id": 112, "text": "Can I Even Call It Act? My mind is completely boggled after watching this steamy pile of cow dung. I don't even know what I saw, but it was so bad. Keerthy Suresh's acting is completely mind numbing and irritating in this film. Working with an illogical plot set in America, the proceedings go on and on, so conveniently for our Miss, Manasa Samyuktha (forgot that name, even), that is so boring and headache inducing that you will keep wondering How come so much money was poured in to this story-less story? Everything looks so beautiful, but nothing makes sense. The producer must've been very fooled by the complete nonsense script. The scenes are over-melodramatic, with endless philosophical speeches that go on and on, and with, bloody, background music that keeps playing every second. Headache stuff. Keerthy's drowsy and sleepy performance made me feel completely distant with her character, although I deeply admired her beauty. The production values look high, and the locations too, but how can one still feel so much of headache all at once? The lack of a meaningful story. Without a story to tell, there is no purpose for any extravagant show off. Story is the essence of true art. Here, the story is illogical.Ha! Chai cafe (or only chai booth?) chains in America, anta... Coffee versus Chai battle, anta... Multimillionaire owner of coffee chains loses all money in some days and comes down to the roads, anta... Even for ambition, there should be a limit."}, {"id": 113, "text": "I saw the movie and thought it an was an excellent film and thoroughly enjoyed it. Keerthy Suresh gives an excellent performance. I went to IMDB and saw that the movie had a very low overall rating. So there's a good chance that the average movie goer will not like the movie - especially if they read the negative reviews. A lot of reviews with the lowest ratings gave no details, but just gave their opinion that it was terrblie. Other low ratingss picked on the details of getting visas and houses. First, this totally misses the point of this or most any movie except for a slice-of-life or historical autobiography. In addition, through not fault of those reviewers, while their nitpicking would be accurate for most situations, the story took care of this by making the brother not just a robotics engineer, but one who was thinking originally and on target as he had greatly impressed his professor who passed along that assessment to his contacts in the US. To confirm my knowledge of this special situation, I asked my friend who owns a robotics company and who recruits robotics graduates from all over the world including India and the film's depiction is accurate in this very special and very important niche in the US and he gets full cooperation from the government including Immigration. Of course, such reviewers have no way of knowing this. A similar complaint was that Samyukta's rise to a successful business owner was unrealistically easy. And, again in general, that's true, but the reviewers missed the forest by focusing on one tree and, in addition, this issue was beautifully and insightfully handled by the story. Possibly, the best way to tell if you will or will not like this film is to read the review entitled 13 most interesting dialogues (Rating the movie as a 6). If those dialogues resonate with you, then give the movie a try, if not, then skip it."}], "reviews_amount": 114}