{"name": "Durgamati: The Myth", "titleId": "tt11229134", "reviews": [{"id": 0, "text": "Remakes have become a new normal today in the Hindi film industry. Just shows how incapable are the film-makers of today, just can't get something original out of their experience that they hold of many years .. Senior citizens occupying the actors seat &amp; new talent mistreated for satisfying their bloated egos .. it's time these so called oldies make way for new actors .. !!! Performances are equally bad, not at all entertaining."}, {"id": 1, "text": "Worst remake. Waste of time. Could have done better. Not at all entertaining."}, {"id": 2, "text": "This film has nothing new to offer,Bollywood has officially lost all of its creativity.They just want to copy South movies and make money.Bhagmati is already a very hit and popular movie, almost everybody has seen it then why remake it and bhumi failed to copy the charm of anushka.. Looks like Bollywood not giving us any original movies soon"}, {"id": 3, "text": "Bollywood is copy-cat. Original is far better.. actually THE BEST. Don't let your hard-earned money be used in dark and illegal activities of B-Town. Take care!"}, {"id": 4, "text": "Sad bollywood can't create anything new and has to copy. While Anushka is stunning in Bhaagmathie, they had to make a remake and copy the content. Watch Bhaagmathie again than this trash...!!!"}, {"id": 5, "text": "Ruined it by remake. Arshad acting is good. But bhumi is not even close to 1% of anushka acting and that after interval transformation scene. U cant beat the queen anushka acting. After all queen is queen. U can copy script but not the acting level which is soul of movie."}, {"id": 6, "text": "Watching this movie is like eating an uncooked food. Horrors and thrillers should only made by understanding the capability. I think Bhoomi should have practiced few times walking on those stairs looks funny in the movie when she is possessed Even the comedy scenes are painfull to watch...yuck!!!Well you have nothing else to do then you can waste your time watching this movie."}, {"id": 7, "text": "It's very disappointing. It's totally ruined the original one. Not even match the 1% level of the original. Very slow &amp; not even 1 time watchable. You can easily skip this if you have already watched the Bhaagamathie. The 1 star is only for Jishu Sengupta &amp; Arshad Warsi."}, {"id": 8, "text": "Worst movie full of remake.I request not to waste your precious time in this movie. No use. Use your time genuinely."}, {"id": 9, "text": "Dont waste your time watching such useless movie. If you want to watch then watch the original version with hindi dubbed. This movie is a crap and total waste. I was just curious cus i had watched the dubbed original version and just wanted to compare it. It is like comparing Sholay to RGV ke Sholay."}, {"id": 10, "text": "So this year has had the worst movies .. first Laxmi bomb .. and this has to be the worst movie I saw .."}, {"id": 11, "text": "PATHETIC acting by Bhumi Pednekar and others Arshad Warsi is ok Background music sucks (which is a very important aspect of horror movie)I got bored after watching 30 mins and wanted to stop, but somehow finished watching.Nothing is refreshing in this movie, all the old methods have been used to create horror, and it has failed badly."}, {"id": 12, "text": "Anushka Shetty is best and natural actress . compare to bagamathi bhumi dialogue delivery voice base is very dull and very comedy I laughed a lot while she's saying dialogue"}, {"id": 13, "text": "Durgamati is a tepid, low on energy and many a times unintentionally funny remake of Bhagamathie. It lacks all the trappings and worthy moments that the original was high on.The movie is, for the most part, a scene by scene copy of original. However the screenplay lacks the tension. Direction is lazy, to put it subtly. The performances are really below par. You will have to really endure some hamming and over the top acting by a most of the supporting cast.Some scenes/characters which are modified from the original, probably to scare you more end up being silly and funny. For instance the watchman of the mansion, crippled with no hands. The idea was probably to create an impact that the constable felt someone touching his hands but when he asked the watchman to open the gates, he showed his helplessness saying he had no hands. It was meant to be shocking. But did the writers even think how did the watchman go inside the mansion and close the gates, if he had no hands. First and foremost why on earth would someone even employ him for guarding a mansion.The weakest link of Durgamati is its leading lady. Who neither gives a feisty performance nor has the screen presence and elegance that Anushka Shetty so effortlessly infused into the original. You would struggle not to break into a guffaw when Bhumi Pednekar transforms into Durgamati and tries to deliver roaring dialogues. They end up being funny.Jishu Sengupta is good but wasted in an underwritten role. Mahie Gill fails in leaving a mark. Her inconsistent Bengali accent and intonation is irritating. Arshad warsi is good in the beginning. However towards the end, his character starts to look caricaturish. Karan Kapadia is good and leaves a mark. He needs to work on his dialog delivery, though. Others are just about okay.Skip this one. Watch Bhagamathie, instead, which is also available on Amazon Prime with subtitles."}, {"id": 14, "text": "Is there a lack of stories in bollywood. . Acting is so so, mostly overacted, advise is dont watch if u want to screw urself. ."}, {"id": 15, "text": "Bollywood is a sinking ship. No creativity, just copy paste from South Indian movies, Hollywood and Korean movies.. time waste movie.. we need to charge bullywoodia to watch their sick movies"}, {"id": 16, "text": "A illogical Acting and performance by starcast and producer is Akshay Kumar what a illogical script and bad choice of production. This shows your creativity skills and why you guys cannot stand with Sushant Singh Rajput. Because you don't have knowledge &amp; no courage to get into shoes of a good aspiring Fellow"}, {"id": 17, "text": "When you remake a movie which set a benchmark you have to be careful, ashok just ruined his own film by not sticking to the story and the bgm whoever it is they just ruined the by film with their dj sound and cast is just ok but when you compare with anushka mam they are no where near to her"}, {"id": 18, "text": "Waste of watching this movie. instead watch the original one. Anushka would have been cast in this movie. Best option."}, {"id": 19, "text": "It is pure copy of Bhagmati...nobody can beat acting of Anushka sheety...bollywood only copying south indian films"}, {"id": 20, "text": "Everything can't be copy. Some remake are good but most of them are super worst. This is super ultra worst in acting,direction and dialogue timing. Instead watch Bhaagamathie which is available directly on youtube with hindi dubbed."}, {"id": 21, "text": "Durgamati, remake of Bhaagamathie, though predictable, has its moments. The atmospherics of the horror genre plays from the forefront making the genre-blending film watchable. Even though it was not even close to the original, it was just stable enough to mark itself as a good attempt for a successful remake.Bhumi lacked the intensity which Anushka Shetty had and that's what Durgamati lacked to a certain extent. The length of the remake was 20 minutes longer and I felt it was stretched as well. It could have been wrapped up in 130 minutes. Nonetheless, it was a brave attempt for Bollywood to remake this South Indian hit, and to some extent it did well.My Rating : 3/5"}, {"id": 22, "text": "Bhumi's acting is not realistic it's look like unrealistic like sugar on sure curd. But arasad is doing well"}, {"id": 23, "text": "Really not even a timepass movie. Below avg. Dont waste your time watching this."}, {"id": 24, "text": "This movie is a big nonsense. Casting, direction of the movie is substandard. Not good for entertainment Showing stupidity."}, {"id": 25, "text": "Don't want to copy paste script of south Indian movies."}, {"id": 26, "text": "OMG, The standards of Bollywood have fallen drastically !! No Original story, nothing. Just Nepotism promotion and stealing stories from South industry. I saw the original hindi dub version of Bhagmati on YouTube - It is brilliant. Thought of giving this copy paste version also chance lol, I immediately stopped after 15 minutes. I wish the Indian Film board bans Bollywood from making movies. We very much happy with South movies - we don't need Bollywood 🙏. P.S #JusticeForSushantSinghRajput #BoycottBollywood."}, {"id": 27, "text": "Bhumi Pednekar acts like a zombie in this movie! Mr Sengupta acts well! Rest all cast acted like they will not get any payment after filming their scenes!"}, {"id": 28, "text": "I would recommend , don't watch the movie if you want your day to go well."}, {"id": 29, "text": "Bollywood is taking the audience for granted and creating absolute pieces of garbage. Please watch the original Telegu 2018 Bhaagamathie movie (with subtitles/dubbing) if you want to watch. We should not watch stupid remakes made by Bollywood and save our time and money."}, {"id": 30, "text": "Don't appreciate copying others work n spoiling it. Originality lacking. Anyways not interested in Bollywood as i believe drugs fund Terrorism. Need a spine to stand up against injustice but bollywood lacks it. We need true heroes not these fake heroes who earn money mkng patriotic films n dont think about martyrs n widows b4 indulging in drug parties n anti national activities."}, {"id": 31, "text": "Waste of time. Original was far better. Even the graphics look so wake, kollywood is far better in film making."}, {"id": 32, "text": "Nothing new and predictable story because it's Already watch south original movie"}, {"id": 33, "text": "While trying to make a horror movie, it has turned out to be a comedy one, specially due to the hilarious horror scenes. Climax twist will leave audience empty-headed. Scene by scene copy of a film which was mainly for Telegu audience to create one for Hindi movie audience should have been avoided. Bhumi struggles to emote in various scenes, tries to copy Anushka but fails badly"}, {"id": 34, "text": "Pathatic casting , pathetic acting , worst dubbed movie"}, {"id": 35, "text": "Stupid acting, stupid screenplay, stupid remake. Bhumi Pednekar's worst acting ever. she was given a chance to actually prove her talent with this challenging role but she failed miserably. What's with the unnecessary screaming. Worst film."}, {"id": 36, "text": "Org is better bollywood has always copied movies do some org movies use ur brain nd don't copy others it has became a habit of them to remake the old movies old songs org containing shuld be there"}, {"id": 37, "text": "It look like akki production house has only pathetic stuff to delivered they take audience granted"}, {"id": 38, "text": "Non sense film. Overacting. Unnecessary direction."}, {"id": 39, "text": "Full-time Waste don't watch. Please watch original movie Bhagmati"}, {"id": 40, "text": "There is nothing new in the concept in Bollywood. Total a time waste"}, {"id": 41, "text": "If you really value your time then please don't watch it . This movie is 10th class copy of a south film."}, {"id": 42, "text": "With thirds class casting to third class acting. Seems like Mahi Gill has gone through some operation due to which she is not able to deliver the dialogues properly. Worst acting by bhumi. Before copying please do see earlier versions and don't ever copy each and every frame of previous movie. Try to change the ending also do work on dialogues as well."}, {"id": 43, "text": "Bollywood is waste of time. It's a remake industry, actually a very pathetic Xerox industry. It should be known as #Copywood, #Pudiyawood, etc Avoid watching this waste of time. Bollywood is gutter. #Justice #BollywoodWillCollapse #Justice"}, {"id": 44, "text": "Very bad movie. Even tamil version Baramati is better. Don't watch it."}, {"id": 45, "text": "A simple advice -  just avoid  . Complete waste of time ."}, {"id": 46, "text": "Bhumi Pedenkar should be appreciated for trying something different but she has failed utterly. This is because Anushka Shetty was much much better for the role. Some roles can't be remade again. Also the voice syncing was very bad. Arshad Warsi, please do web series as they will get to know your true potential."}, {"id": 47, "text": "The roles of actors are only not chosen right their acting is only worse and mainly the actress bhumi acting was still worse in this movie copy cats hiding the fact that this movie is remake. I suggest every one to watch only bhagmatie than wasting ur time in this backwas movie. It requires 0/ 10 rating"}, {"id": 48, "text": "No originality left in Bollywood anymore. This is another example of a poor remake of a classic movie. Please leave the South movies alone!"}, {"id": 49, "text": "As always bollywood is spreading its leftist propaganda in this movie too."}, {"id": 50, "text": "Acting skills should be better tollywood version was ,is and will be the best"}, {"id": 51, "text": "Don't waste ur time in bullywood.. All are 👎bad.. Faltu movie.."}, {"id": 52, "text": "If u have seen South's Bhagmathie then u can easily understand wht blunder has been made in d name of durgamati..watching this movie u wish to laugh rather thn to being afraid...worst acting writing nd direction.sucks."}, {"id": 53, "text": "Worst acting of Bhumi Pednekar, even movie is remake after that Bhumi not reach level of Anushka Shetty.Bhagmati is already a very hit and popular movie, almost everybody has seen much of time. Bollywood need lesson from South Indian industry. Copy Cat Bollywood."}, {"id": 54, "text": "A cheap rip off of Bhool Bhulaiya. Story is absolute senseless, a cheap horror movie which has non funny comedy."}, {"id": 55, "text": "Bhaagamathie is better then this. My whole family member enjoy that movie. We can't even compare it with durgamati. Make original movie remake of movie people expection also double and it couldn't touch our expectations."}, {"id": 56, "text": "Yes, it is the official remake of 2018 Telugu Blockbuster 'Bhaagamathie' starring Anushka Shetty and Jayaram in lead roles.I would not say that it is a perfect remake.....but YES this movie has something to offer for audience. Bhumi Pednekar gave very strong performance. Arshad Warsi delivers standout performance in his character. Supporting actors like Mahie Gill, Karan Kapadia, Jisshu Sengupta also gave decent performance. Talking about the story, it is a bit slow. The original movie was around 2hrs 18mins but this is around 2hrs 30mins.The Background score is superb (it will give you goosebumps sometimes). Dialogues, acting, screenplay, editing, VFX everything is superb.Please don't go by negative reviews. Please watch it."}, {"id": 57, "text": "Durgamati is such a great superhit movie although it's a remake but the mastermind plan was so amazing......Thank you T-Series and Akshay Sir for making such a greatful movie.......It makes my day full of exitement🔥🔥🔥😳😳😳😳😎🤘🤘"}, {"id": 58, "text": "ARSHAD WARSI &amp; Dhanraj (THE CAST FROM THE ORIGINAL ONE STAR FOR THEM) THEY BOTH ARE GOOD BUT THE REST ARE VERY VERY BAD COMPARE TO THE ORIGINAL...THERE ARE TIME I THINK THE ACTRESS WAS LAUGHING WHILE PERFORMING"}, {"id": 59, "text": "The acting is so bad. The story is so bad. Insult of two genres - Horror and suspense thriller. Abrupt scenes. Horrible and forceful comedy. Unnecessary scenes just for the sake of humour (that too cringy)"}, {"id": 60, "text": "The most disgusting content I have seen in ages. Hindu phobia at its best."}, {"id": 61, "text": "Pathetic is the word. Boycott Bollywood makes complete sense for the sheer nonsense they show."}, {"id": 62, "text": "This movie is unlikely to not the box office. I really feel Indian Bollywood is just trying to give least rated films for OTT platform just to let others movies not box office one theatres are open to public.Concept, well played to showcase the actual face of politicians. Appreciate the efforts. On the other side Bhumi's acting well it was pretty nice as compared. Arshad took away the glam. I didn't felt it has any such comedy though they have tried to show a bit. Really feel sorry for people who put in time to watch this movie.Bollywood news wake up and make some better content. Quality couldn't match that of Bhaagimati. The intensity of Bhaagimati was way more than of this movie."}, {"id": 63, "text": "All in one after a long time Suspense, comedy, Drama, Horror,Romance Music, thrill overall excellent movie...Bhumi thrilled"}, {"id": 64, "text": "Me and my kids liked the movie, its a good family entertainer...full of suspense...Arshad varshi and bhumi acted very well in the movie... it would have bben great if the movie would have been released in theatres..."}, {"id": 65, "text": "I have seen the movie on prime video last night,....Great performance by Bhumi in this film, Otherwise also I like her performance"}, {"id": 66, "text": "Bhumi Pednekar is a very good actor and done a lot of good movies, I like this movie, saw it with my whole family.."}, {"id": 67, "text": "I liked it, not watched the south indian one so I like it.. Bhumi did great acting"}, {"id": 68, "text": "Not a horror movie specifically but more like thriller. Thriller wise it was a fun ride"}, {"id": 69, "text": "I found the plot to be lame. Editing was also not upto the mark. Lot of loop holes. The supporting actors failed to do their part specially the comic part. However, it's still an entertainer. Giving it 6. FYI, didn't see the original movie. So no point of comparison."}, {"id": 70, "text": "Horrible, horrendous, waste of time and money. I wonder if the actors , director and Amazon saw the movie themselves before releasing"}, {"id": 71, "text": "Dont know why they even think of remaking bhagmati that too with bhumi she look pale in trailer itself and harsad warsi cant even match jayaraman entire movie is so flat Dont watch BOYCOTT BOLLYWOOD"}, {"id": 72, "text": "Don't watch movie if you value time. It's the most baseless overacted movie."}, {"id": 73, "text": "The story was interesting but when its comes to bhumi acting as durgamati it was worse than u can expect,she needs to watch arundati (Telugu) to learn how to act as a ghost...."}, {"id": 74, "text": "Worst movie. Couldn't give a - be rating.. Acting could have been better.. Bhumi failed to impress.. Harshad was good.. There are better things to watch..."}, {"id": 75, "text": "Very poor Acting, . . . . . Need to boycott Bollywood. Justice for SSR"}, {"id": 76, "text": "This movie completely copied of south movie arundhati Disgusting west of time"}, {"id": 77, "text": "I can't even begin to describe the amount of stupidity that this movie has pulled off. I don't know whats worse about the movie, the editing, the acting or the story.It is full of loopholes , and a complete waste of time. I want a refund although I didn't buy any tickets."}, {"id": 78, "text": "Please dont waste your time because i already did. For some movies there are positives like screenplay, story, direction, actors performances but in this case there is none."}, {"id": 79, "text": "I haven't watched the original so I have nothing to compare it to, but man, the acting is bad. Un-possessed Bhumi looks like she is on drugs. And if she is so jumpy on each and every tiny sound and movement, why does she keep on exploring the haunted house alone like a freaking tourist? The CGI effects are hilarious. Jump-scares are funny. And let's not talk about the characters who are trying to look scared but look like they are acting in a school play. Mahie Gill is a good actress, I have no idea what happened to her in this movie. She was such a waste. Overall, a very badly made remake with good names but torturous acting."}, {"id": 80, "text": "Bhumi Pednekar can't act, not going to lie, I have seen better acting in adult movies, the scenes she did as Durgamati were so expressionless she is like the female version of Fardeen Khan. My advice is to avoid this garbage and watch something else."}, {"id": 81, "text": "This is another blunder by bollywood and tells us why bollywood miserably fails in adapting/remaking a classic south indian movie."}, {"id": 82, "text": "10000s loops hole in story. Don't waste your time to watch this movie."}, {"id": 83, "text": "Though as Chanchal she showed the same colors as in her previous movies, even the dialogue delivery were same but as Durgamati it was completely out of sync. An avoidable remake overall. Arshad and Mahie definately shine in the movie while Sengupta has to little to do."}, {"id": 84, "text": "It is a good movie ... 100 times better than Laxmi Bomb . A good acting by Bhumi .. One of the beat movie of Bhumi"}, {"id": 85, "text": "When Director and Producer Mati gets Bhrasht such outcome is experienced.Thumbs down for the Bhumi pednekar performance. Not sure if she comparing her acting skill with Anushka Shetty...Total Waste and not recommend anyone to even watch its trailer."}, {"id": 86, "text": "2 Star because of Arshad Warsi sir Acting &amp; other actors 0/10. Story was so boring"}, {"id": 87, "text": "Durgamati Is The Remake Of 2018's Superhit Movie Bhaagmatie. Bhumi And Arshad Nailed Their Roles Completely And the Twist Of The Movie Is Also Very Very Interesting.So Those Who have not Watched Bhaagmatie They Will Enjoy This Movie Seriously."}, {"id": 88, "text": "Tatti movie 💩💩 Bollywood is in engame now. Bollywood is getting worse day by day."}, {"id": 89, "text": "Jis Joy - #AsifAli again joining for a new movie after the success of #VijaySuperumPournamiyum... Script - Sanjay Bobby... Shoot from - 2021 Jan Last Release Plans - July 2021 theatre release... Distribution - Central Pictures...Jis Joy - #AsifAli again joining for a new movie after the success of #VijaySuperumPournamiyum... Script - Sanjay Bobby... Shoot from - 2021 Jan Last Release Plans - July 2021 theatre release... Distribution - Central Pictures..."}, {"id": 90, "text": "This movie is an example, that it doesn't matter how much talented actors are there in your film. It is the screenplay and the story which makes or breaks the movie. The writer &amp; director seems to be confuse with this one. Neither horror nor thriller"}, {"id": 91, "text": "Worst Movie as Insulting Maa Durga name. Why from Drugswood industry insulting Maa Laxmi , Maa Durga and many Hindu Gods. Maximum person are on Target of NCB"}, {"id": 92, "text": "Cr@ppy movie from charsigang Cr@ppy movie from charsigang Boycott bolly"}, {"id": 93, "text": "This movie had 3 Star rating when I started watching. So watched it with very low expectations. The movie is not too bad. Decent one time watch. Most of the reviewers who rated this movie 1/10 are comparing it with the original movie which I haven't watched, so it was a nice time pass for me. Did not like Mahi Gill's acting in this movie."}, {"id": 94, "text": "This movie with a powerful woman lead, IF YOU DON'T COMPARE IT WITH THE SOUTH INDIAN VERSION, portrays the social issues very well."}, {"id": 95, "text": "My big takeaway from Durgamati was Kakorrhaphiophobia, which means the fear of failure. I had never heard the word before. In the film, it's used by a psychiatrist who solemnly declares that this might be the issue with Chanchal, an IAS officer who seems to be possessed by the ghost of a long-dead queen. Chanchal is attacking people around her - including the psychiatrist who she raises off the ground by holding his throat. She is also speaking in Arabic, a language that Chanchal doesn't know, and being yanked by an unseen force in all directions. A few minutes after the first diagnosis, the psychiatrist says that Chanchal should be moved out of the old haveli that she is stationed in because, he says, this place is no good for schizophrenics. The good doctor seems confused and clueless, which seems just about right for this film.READ THE FULL ARTICLE ON FILM COMPANION"}, {"id": 96, "text": "The movie is a complete torture. Such a poor make. Wow! How can one make this?"}, {"id": 97, "text": "The remake is not as crisp as the original, though it's the same team behind it. Unnecessarily dramatised in multiple places. Leaves a number of threads untied. Karan hams through almost all his parts. Bhoomi falling for Karan is simply indigestible, while the same was quite good when Anushka Shetty did it. Bhoomi has enacted her parts well, though could have done with some less intensity at places. She is a good actor, but needs to control herself. Mahie is a good actor and mostly did well, some bits seems to be forced by the director; and wonder why was she a Bengali, that didn't quite connect well. Jisshu is really good and performed well throughout the movie."}, {"id": 98, "text": "Super Acting of Bhumi... Must Watch...Very Good Remake of South"}, {"id": 99, "text": "It is a remake, but storyline is good..movie is best whether it is a remake or new"}, {"id": 100, "text": "Arshad Warsi nailed it once again ..... Bhumi was good ...Mahi gill's performance was outstanding .....but that idiot karan Kapadia looked really bad.....he has a face of auto wala and he should do that only"}, {"id": 101, "text": "Please stop remaking south films. Not even 1% of Bhaagamathie. And 100% overacting."}, {"id": 102, "text": "After a lot of bad reviews and 1 star rating, I feel all the 1 star raters are too much biased with South indian movies. No doubt that south indian movie makers are way ahead of bollywood movie makers and I think bollywood has to come up to speed. However, you can't demean the remake of movies if has been crafted wonderfully. Durgamati is a brilliant remake of bhagmati. Thouroughly enjoyed the movie. Job well done by Bhumi and other actors."}, {"id": 103, "text": "Wasted my time. No story. No sequence. No script. Totally waste."}, {"id": 104, "text": "Another pathetic attempt for a horror movie Bhumis acting bakwass Arshad warsi ma toh sidha hi acting kar paya na hi villan ban ke."}, {"id": 105, "text": "Another remake of popular South Indian film! Looks like bollywood has lost the thinking of new story that's the reason they started copying the hit and genuine stories of South Indian film.Coming to the movie story, the story is not that great to keep you engaged till last minute and the movie writer has failed to give an end message in the climax.If you don't want to murder your own personal time, then pls do stay away!"}, {"id": 106, "text": "I recently watched this movie and literally cringed though the whole movie, then right after that I watched the original version trust me the original movie is far better the acting is good, the cast feels like they fit in. however, in this movie some of the actors acting is good but not of all so, this movie is longer and boring I can keep going so, In my opinion it's a total waste of time if you really are craving to watch this movie please watch the original version!"}, {"id": 107, "text": "Please Mr. G, for heaven's sake, don't write any other movies. Find something else for yourself. Indian Film industry has reputation in world, let's maintain it."}, {"id": 108, "text": "Not so bad movie so far acting from bhumi pednekar is good and the storyline is also okay but the problem is that with too much length the movie starts to bore the audience."}, {"id": 109, "text": "Watched for about 90mins.. for the first time in 980 movies i watched.. did not understand a thing.. worst movie ever watched."}, {"id": 110, "text": "Poor Cinematography, direction, acting. Except Mahi gill and Arshad everyone performed poor. Bollywood must have tried to force their idea while remake. They ruined it. Anushka's performance was poise yet so powerful. Bhoomi's acting really worse."}, {"id": 111, "text": "Worse movie of 2020 after Laxmi. This is just a story which is made to accumadate a bollywood movie to release on OTT plateform. Seriously if want headache go watch it."}, {"id": 112, "text": "Bollywood is lost. Can't come up with anything new."}, {"id": 113, "text": "Bhagmathie(the original film) had so much more darkness and a layer of everything. From the radio saying There'll be high tides and rain explaining why most part in the night has rain.The eyes of Anushka Shetty, the way she took Bhagmathie in herself and dealt with it had already set a milestone for Bhumi. I won't compare because that'll be wrong, but Bhumi, according to me, could not do justice to the character of Durgamati. And Durgamati, The Only Original Thing in the movie, the name, nothing else, not a single frame or even a single jist is different from the Original. Why do you need to make a remake when you know it'll not be as good as the Original one."}, {"id": 114, "text": "Where Bhaagamathie is Reebok Then Durgamati can be Called Rebuke.. No comparison between Anushka And Bhumis Performance.. Anuskha is way better"}, {"id": 115, "text": "I firstly want to say that bhai movie ke pahele hi likha hai that this is remake. So if anyone from this bad reviewer was that good fan of south and don't want to watch reamkes toh pahele chashme lagake padh liya karo....  I think people are giving wrong reviews. I totally liked this movie.. Amazing work by Arshad sir. And all time hit actress BHUMI... Great work by director Ashok."}, {"id": 116, "text": "Copy and Paste... no creativity at all... Warsi and Mahie are watchable but Pednekar is the worst and unbearable.No way she can match ANUSHKA... Waste of time and a total ZERO."}, {"id": 117, "text": "Nice movie with ossum suspense, if you love horror and suspense movies you will love this one."}, {"id": 118, "text": "Another south remake it is. And this movie is very slow and just a worst movie I give 2hrs 30 min to this movie Worst movie..."}, {"id": 119, "text": "Bhumi Pednekar was supposed to fill the void of female actors who chooses a script using her brain. But she proved otherwise by doing this mindless logicless and boring flick of a movie. This will make boycotting bollywood even more easy."}, {"id": 120, "text": "This film making and presentation is excellent. It may be remake but in Hindi it's best film of 2020 I would say. I really appreciate the director and actress of this film. If it's film theatre it would be super hit indeed.Nothing much to explore to find faults. Time will just pass excellent making no lag.One of the best 2020 movie"}, {"id": 121, "text": "Everything ,everyone , is superb in this movie and acting is just super sexy upper 😍😘"}, {"id": 122, "text": "This movie is copied from South movie bhagamathie. Even they don't give credit to the original owner and single scene are copied. They don't added any scene by their owns."}, {"id": 123, "text": "This one is totally waste of time..... Ignore..... Full of overacting......Better watch the original one......again bollywood failed to provide a good movie....."}, {"id": 124, "text": "I saw this movie after watching review in imd truely rediculous here. The movie is very good and well framed, story is also nicely written. At the end you have to use much of the brain to understand the end. it is both Thriller and horror as described. I will recommend to watch it and then review. Everyone presented skill of acting very nicely"}, {"id": 125, "text": "Rotten ideas picked by so called bollydwood biggies like (akshay kumar). Stop stealing ideas from South Indian movies. And yes, stop stealing films from many underrated supremely talented actors in hindi film industry."}, {"id": 126, "text": "Worst movie. Not a horror movie, pathetic acting 3rd class story, watch Telugu version."}, {"id": 127, "text": "Third rate remake with pathetic dialogue delivery and a lose story line .. oh and yes if course let's add in a little hinduphobia"}, {"id": 128, "text": "Writer and director has made joke of himself. Actors looks like did not read the script and were only interested in money, Kapadia ended his career before it started, Arshad Warsi to retire"}, {"id": 129, "text": "The acting of the whole crew seems to be so overdone and unnecessarily extravagant. The CBI head MS. Ganguly imitated the character of Ganguli from M.S.Dhoni it seems . 😂 It also accompanies unnecessary yelling and stupid dialogues. The secrets of the story were piled up to the end which made the storyline seem stupid and severely bore in the middle part. Overall, the actors and the makers just overdid everything in the film and there are moments where we cringe."}, {"id": 130, "text": "Bhosdiwood is a disgrace in name of creativity, watch natgeo, discovery channel instead 👍"}, {"id": 131, "text": "This movie meant for theater audience. But due to Corona the makers released it in OTT. Those eho already watched it in Telugu or dubbing versions only watching and rating it again. alas. Thriller thrills you only when the climax not reveled. but mostly twice watched persons reviewing it. once again my conclusion is the thought behind the making of this movie is for those who lives away from data networks.But successfully corona and repetitive audience killed the thought."}, {"id": 132, "text": "Most of people are writing negative review saying it is south indian movie copy. Let me clear , it has been directed by same person G.Ashok who directed original tamil film. If movie is good then what is wrong to cater it to hindi audience who donot understand tamil.Coming to movie , earlier i hesitated to watch movie due to negative reviews but it is perfect movie to watch at night time. Trust me , i have watched many horror movie but this is something else. You will not find a moment where you will bored of scene. South indian directors always have courage to do something which bollywood directors hesitate to do. Acting of bhumi, arshad and jisshu sengupta is good. Use good speakers to get the feel of fear and real essence of movie. Till last scene , movie has something to give you a shock. Trust me , it is definitely a one time watch."}, {"id": 133, "text": "The plot is very weak. Anything can happen without any logic in the movie. The politician with best public image is also the worst and very corrupt. Acting is bad as it can get."}, {"id": 134, "text": "Bad direction, bad acting by Bhumika and over stretched movieArshad as always performer"}, {"id": 135, "text": "Bollywood ko kuch or ni ata h kya ya inse ab movies ni hoti Are to rhne de q Bollywood ko bdnam krne pe tule h"}, {"id": 136, "text": "One word for this movie .... tedious...Bollywood take your time and bring good scripts please... Bhumi reminds me of tiger shroff in this one ... Expressionless."}, {"id": 137, "text": "3rd class movie even copy paste is an art is evident"}, {"id": 138, "text": "Few points below to go ahead and watch thus movie -1) If you've checked the other reviews you must've seen lot of negative comments, trust me all of 'em are south movie fans. Just look at this as a entertainment. Bhaagamathie and Durgamati both movies stand at their level, just dont compare both and enjoy it as a entertainment.2) Acting where i felt little weak point specially Bhumi, she didn't gave her 100% in this movie.3) If you haven't watched the Bhaagamathie then you are gonna like it.4) Over-alll nice movie to watch with family.Thanks"}, {"id": 139, "text": "No work done by the writers as the scenes and story both are directly copied from original south movie . All the actors have done full of overacting. Camera work and sound effects were nothing new and used hundred of times in several so called hindi horror movies. But all this definitely makes you laugh. So a very good comedy movie indeed. Youtube channel T5 WEBCAST"}, {"id": 140, "text": "Sorry to say the film failed to recreate the magic of Bhagmathie."}, {"id": 141, "text": "This so called bollywood should learn from other industries of how to make good movies with talented actors...No original content ,Nothing new....Bollywood Sucks"}, {"id": 142, "text": "Its a sense of a revolutin, there is going to be no excuses to make a movie. Just to shoot it ."}, {"id": 143, "text": "Nothing is good, yuck acting of all actor. Even Bollywood can't copy in proper manner."}, {"id": 144, "text": "The Original Telugu one was good compared to this. Waste of money and time. The actress was good at some scenes but after watching the original, She gave her full to the movie but can't be compared to Anushka Shetty's acting in the original movie. #BoycottBollywoodMovies #JusticeforSushanth"}, {"id": 145, "text": "Bas karo South India ki movies ka remake, worst movie"}, {"id": 146, "text": "I watched real one first and then i used my prime for this copycat 😂 like they dont even change the dialogues"}, {"id": 147, "text": "What is the need of this movie?? It is waste of time"}, {"id": 148, "text": "The lead has two expressions. no emotions. very funny at all the wrong times. if you want to see bad acting- go watch your child act or your neighbor's kid, at that would be entertaining. the telugu version is 743923749 times better. please save yourself. if you want to have fun- go watch both side by side and compare. both are available on prime. anushka- what a grace. bhumi- what a waste."}, {"id": 149, "text": "Horrible casting, Horrible Acting. Not worth to watch at alll!!!!"}, {"id": 150, "text": "One word review for this movie.. pathetic heroine .. pathetic movie..pathetic producer akshay kumar who only tries to get movies from south or fool people with his fake patriotism.. horrible movie .. Bollywood R.I.P .."}, {"id": 151, "text": "Arshad warsi is the only watchable character in the film. Bhumi pednekar is not suited for such a strong role. Music , direction and length of this garbage gives a headache. A perfect miss."}, {"id": 152, "text": "This movie has nothing new to serve.Arsad Warsi acted very well but all went in trash because this is a common story.Bollywood has lost its creativity."}, {"id": 153, "text": "Boring! Save your time and energy!! Go to sleep / Watch something good on YouTube!"}, {"id": 154, "text": "Excellent story but very poor execution and performances. If you have seen the original south movie, the Bollywood version is pure insult. This has happen again as last month it was Laxmi (except performance of Sharad). Please guys Nakal Main Bhi Akkal Ki Zaroorat Pandit Hai. Better luck next time."}, {"id": 155, "text": "Spare yourself from the trouble of watching this movie."}, {"id": 156, "text": "If u want to spare ur time, watch the original three times. This is not even closer to original. Bollywood needs creativity and wake up."}, {"id": 157, "text": "Save sometime of your life and avoid this at all cost."}, {"id": 158, "text": "Guys pls save your time and watch something else. Not expected from bhumi to sign such a movie.most importantly it is not at all a horror movie......."}, {"id": 159, "text": "Great acting, great storyline, great action should be nominated for Oscar"}, {"id": 160, "text": "Why bollywood make remake of South. There no fresh contain bollywood have. Bhagmati is already a nice movie and also available in hindi. So why we waste our time to watch this type of worst movie. Sudhar jao bollywood valo."}, {"id": 161, "text": "These directors probably smoke weed before making such movies...what a waste of time oh Lord"}, {"id": 162, "text": "Tatti movie, poor acting, judgement passed just seeing the trailer, U can never surpass the acting level of South industry and that too u choose the movie aced by Anushka Shetty,"}, {"id": 163, "text": "Bakwaas movie. Too many twists, exposing corrupt politician, drama of being possessed and actual spirit, spoiled everything and if that was less, acting of Bhumi , giving too long dialogues was a blunder."}, {"id": 164, "text": "If you first time watch (if you are not aware of original bhagmati movie) you sure enjoy suspense of the movie Supporting actor most bakwas and time pass actingDon't watch this as horror movie.... But suspense movie sure little.All over ok ok type movie"}, {"id": 165, "text": "Take a bath instead 2 times. Watch the original , it is way more better"}, {"id": 166, "text": "I have seen bhagamathie nd Anushka Shetty's performance was phenomenal.. out of the box ..though bhumi Pednekar tried her best bt what Anushka has performed it was nowhere near to compare.. so whosoever who have not watched bhagamathi go watch it first then u will get my point.. for me durgavati is a big no! Still giving it 3 ratings only for bhumi and Arshad warsi's effort"}, {"id": 167, "text": "There are many movies on the same concept and this one with the weakest direction. The most irritating was the sudden air blowing and dialogue delivery with unnecessary pause. Lower camera angles doesn't necessarily make scenes scary but boring. It's more like watching a badly made serial than a movie."}, {"id": 168, "text": "Bhumi's overacting is irritating. Total waste of time. Plz don't watch."}, {"id": 169, "text": "Movie is just not good but does get away with the orignal theme"}, {"id": 170, "text": "It has been a continuous trend to copy south-Indian movies in bollywood. They even don't know the art of copying something good and try to make it better. Just copy the whole thing as it is and give the reason that we didn't want to spoil the Original concept of the movie. The only thing bollywood is good at is to stop upcoming talents..."}, {"id": 171, "text": "Don't waste your time there are so many better things to do than watching this flop"}, {"id": 172, "text": "Whenever you see bollywood actors doing overacting just understand either it is a south Indian remake or made by a south Indian director. God knows who make such fudu movies in 21st centuary. Its a mental torture if someone wants to watch it."}, {"id": 173, "text": "Where is Bollywood going? Movie just doesn't make any sense. Jailed criminal wearing silk clothes and well kept shiny hair. Let there be some kind of genuineness. Ridiculous is the only word!"}, {"id": 174, "text": "Bhagmati was far better than you think. You should not copy the south films. You are not good at it. You just spolied the Original One."}, {"id": 175, "text": "Why does someone make such a bad movie? Who finances then to make this movie? Poor direction, poor story. This is not a horror movie. All the horror elements are the same usual like other movies. Creaking doors, moving shadow, sudden sounds etc. This is more like a cheap comedy movie. Bad acting by everyone. Bhumi character looks funnier and her acting was worst. Highly avoidable"}, {"id": 176, "text": "Watch it at your own risk. Bollywood can't even copy properly."}, {"id": 177, "text": "Terrible film making, good acting by Bhumi! Bhumi should pay more heed to the script she's choosing"}, {"id": 178, "text": "The only thing that came to my mind while watching was paisa barbad b***. Waste of my prime account."}, {"id": 179, "text": "Out and out photocopy of Bhaagmati .... Goodness Gracious even some dress were copied ....Dialogues too copied ....No acting skills by Bhumi the lead player...Even Karan Kapadia acted far far well then her ... Arshad Warsi need better roles and better movies"}, {"id": 180, "text": "It's a humble request please don't watch. Shame on Bollywood logics..."}, {"id": 181, "text": "Amidst the horrible rating I still wanted to watch this movie for Bhumi pednagar. I has no hopes at first, but since I didn't watch the original movie I just went with it. I found this piece really interesting and engaging, there were some loops and sometimes I wondered where this is actually going but trust me what an amazing twist and plot Durgamati has.It blew my mind .Loved it, don't follow the group just go and watch it once ."}, {"id": 182, "text": "JNU mahishasur agenda implied ... defame the deity indirectly....go and do bell service word used"}, {"id": 183, "text": "Ok movie. Not so bad as others are saying. Got a story. Better than the recent Laxxmi Bomb ( that deserves 0 rating )."}, {"id": 184, "text": "I understand cinema is unreal but do far from reality is the achievement from the director. So many bloopers- you want in 21st century for people to be scattered of a old haveli with poor interiors. The only scary part is why didn't BMC demolish this? Special 26 CBI doing its usual fantastic investigation like the real one . Please stop deriding your viewers with stereotypes - mental prison cell, old secluded haveli . Such poor dialogue writings. Bhumi is the only down to earth performance. Must (Not) watch"}, {"id": 185, "text": "ABSOLUTE,COMPLETE AND TOTAL DISASTER!This movie is definitely Bhumi Pednekar's worst movie that she has ever done.It was an excellent move to release this film on OTT and not in the cinemas,as it might have not lasted the first weekend."}, {"id": 186, "text": "Durgamati is a copy of a Telugu-Tamil movie called Bilingual. Thay just not copy the script as well as the costume, look, few entertainer, everything, etc. One more thing I have to say that is, this copied film is produced by A. Kumar. Use orginal one if you want to test the real test of this movie."}, {"id": 187, "text": "The wrost acting of Bhumi Pednekar.. except her all doing well.. Bollywood plz create ur own containt...they can remake from south indian movies bt can't match there acting level... Anushka Shetty killed as Bhagmati..."}, {"id": 188, "text": "Not too good not too bad. Eveyone can watch atleast once."}, {"id": 189, "text": "Movie deserves zero star for zero effort. Zero creativity, zero effort, dull acting. Akshay Kumar just wants to launch a movie in every 2 months without using brain or without putting effort."}, {"id": 190, "text": "Horrible transitions between scenes, horrible acting, poor VFX, and pathetic script. Actors are expressionless, dialogue delivery is the worst, it's as if they are reading the script. Other than that, it's just weapon of propaganda promoting communism, portraying government in a bad light and protesting on anything and everything."}, {"id": 191, "text": "SAVE YOUR BRAIN POWER FOR SOMETHIG BETTER. USELESS BORING MOVIE."}, {"id": 192, "text": "Original was the best, actress in this film doesn't show any expressions. Don't spoil the reputation of south films by your worst crap remakes. wasted my time watching this"}, {"id": 193, "text": "This movie is ok and nice story suspense full movie bhumi acting is Amazing"}, {"id": 194, "text": "Another copied movie from south where anuskha shetty made a unparallel act while bhumi lack it there such movie downgrade the original one"}, {"id": 195, "text": "Durgamati: have to say this 2020 is ending but not the pandemic and films like Durgmati ensure that. Horror seemed comedy and comedy seemed horror in this. Bhumi Pednekar must have really been underpaid after promising big amount, only that explains her underacting and overacting"}, {"id": 196, "text": "I want to say that if you have'nt watch bhaagmathie then you will surely give this movie good rating but if you have watched it then it will surely be disappointing for you. 1 star for Arshad warsi's acting. 1 star for incredible bgm at some places. 1 star for good screenplay. 1 star for good song especially by B praak. 1 star for the wastage of money on this remake"}, {"id": 197, "text": "Started as It's so bad that it's good with all the awkward &amp; comical dialogues &amp; dialogue delivery &amp; transitions, but later settled into It's so bad that it's bad. I made my IMDB account, just so that I could vent out my frustration at the utter waste of an effort by a respected brand and some amazing actors, but it all just fell flat on the face. And then I learnt that it's actually a remake. Now that to me was the real horror. 🙏"}, {"id": 198, "text": "It's a scene to scene remake of Bhaagamathie. The good thing is that it is fast paced and therefore not boring. But Bhoomi Pedenekar does not do justice to the role. Anushka Shetty's facial expressions in the pivotal scenes were far far better than what Bhoomi delivers. Her performance seems quite forced and don't quite blend in. In a scene between her and Anant Mahadevan, Anant seems more convincing than her. Due credit to Karan Kapadia who performed his role well although a short one. Arshard Warsi was good in his role. A one time watch if you want to pass time. Frankly, I would rather watched the Telugu movie dubbed in Hindi though."}, {"id": 199, "text": "Worst concept ever! Do not waste your time as well as mental strength!"}, {"id": 200, "text": "I felt it had a very strong storyline in beginning but it was dragged a lot . I heard reviews that 2nd half is good but it is definitely not. It couldnt hold by interest and which is rare. I liked Arshads acting , it was natural. Bhumi Pednekar acting was a total put off. This role seemed too much for her. I havent seen the original one and this review comes from an unbiased view."}, {"id": 201, "text": "Dont waste your precious time watching it. Not even worth 1 one watch"}, {"id": 202, "text": "Bollywood is miserably inadequate and pathetic. I think this is the end of Bollywood. It doesn't make sense to simply copy paste the movie. There is creativity in web series then why its missing over here. Stay away from this torture. There is no class of Bhumika compare to Anuska. Everything was so perfect in Bhanumati and nothing is perfect in Durgamati."}, {"id": 203, "text": "Not so close to original..but watchable for its performance and acting for this suspense thriller.."}, {"id": 204, "text": "I never see this movie in my life super horror and trailer"}, {"id": 205, "text": "This movie is an official remake of the Telegu film Bhagamathie but lacks in its appeal. The horror scenes in the first half with Bhumi Pednekar are actually quite funny. I laughed to my heart content on her dialogue delivery. But that was later justified by the storyline in the second half. People who haven't watched the Anushka Shetty starrer Bhagamathie may feel a little bit suspense in the second half of the movie. The cast try to justify their roles, with Bhumi Pednekar, though doing a good job, did not match the aura of Anushka Shetty. Mahie Gill is not at all convincing as a Bengali detective. It is appalling to see Jisshu Sengupta standing beside her and see her falter her dialogues to make us believe in her role. But Jisshu Sengupta properly justifies his role as the ACP officer. Overall, this is a good one time watch."}, {"id": 206, "text": "This movie is really a blockbuster......I know it's a remake but this was super amazing 🔥🔥🔥🤘🤘😎😎😎Thanks to Akshay Sir for making a superhit movie🔥🔥🔥🔥"}, {"id": 207, "text": "I've not watched orignal one but after watching durgamati i liked it"}, {"id": 208, "text": "Acting my Bhumi is very much below expectation. Specially during her portrayal of Durgamati. Except of Jishu everyone else as done poor quality acting. In some cases the enactment is not even convincing. My rating is based on the unique story and the simple yet gripping portrayal. The unexpected turns and twists is awesome. Ignore the acting for most of the people, go for the story, it is worth the time."}, {"id": 209, "text": "Pathetic Copy , Bakwas Acting , Promotes Anti Hindu Thoughts , Stupid Producer , Anti Hindu writer"}, {"id": 210, "text": "Acting Direction Screenplayall are non sense, it cant be in horror category this is too bad. arshad warsi, bhumi, and actor did full of overacting. 1 star given because 0 cant be given."}, {"id": 211, "text": "Even one star is more for this .very poor performances"}, {"id": 212, "text": "Worst Acting, Direction is ok good, but choosing actor made wrong choice especially main lead role worst acting Arshad Warsi is good is best in it no words about it but Pednekar her looks like comedy not fit for role"}, {"id": 213, "text": "I like this movie..... Cast is good, movie is cool"}, {"id": 214, "text": "Another copy cat from South. Rather watch original which is much better"}, {"id": 215, "text": "The plot is terrible and the acting is even better worse. Bhumi Pednekar hams it all the way. Why do people keep making south remakes."}, {"id": 216, "text": "Everything went wrong. casting, acting, direction, screenplay.. Pure waste of time."}, {"id": 217, "text": "Every one is trying to remake of the south movies, but their job is not worth it, another flop after Laxmi bomb."}, {"id": 218, "text": "Overstretched snooze fest which clearly is more inspired than it is original. Can be skipped to avoid severe headache"}, {"id": 219, "text": "Utter waste of time, Anushka Shetty has done 1000 times better in Telugu.watch in Telugu Bhagamati."}, {"id": 220, "text": "Anushka shetty was phenomenal in the original. Bhumika was bad."}, {"id": 221, "text": "Expectations were high and bhumi Pednekar does not stand on any of them ...she acts artificially , her body language is pathetic ...the most imp scenes ( embodies durgamati ) is a murder of acting as a skill ...Even if u don't compare with original ( I have not seen the original ) ,you can make out the sub standard acting skills here by bhumi Pednekar ... If she won accolades for saying that she carried the whole film on her shoulders , it's also fair to say she took the film down single handedly ..."}, {"id": 222, "text": "No point watching a run down version when superior original version is available. This is waste of time and proves BW is not even good in copying"}, {"id": 223, "text": "South movies are much better than bollywood movies. Bollywood always copy south movies"}, {"id": 224, "text": "These brainless don't have their own mind They keep on stealing movies from the south Shameless !!!!!"}, {"id": 225, "text": "No one will beat Anushka Shetty When will these brainless come with their own scripts ?"}, {"id": 226, "text": "Why would I waste my money to watch a remake when I have already seen the fantastic original work Bhaagmathie?"}, {"id": 227, "text": "Bad performances... To sum up in only 1 word... HORRIBLE"}, {"id": 228, "text": "Well,first of all avoid it if u want to save ur mind, story is so messed up because of direction.thank God I watched it on prime with fast forward to avoid unnecessary horror build up n side characters so called comedy. Good effort from bhumi bt not great. Arshad bhumi,mahi did a good job bt wasted in bad scripted n movie."}, {"id": 229, "text": "I have not seen the south indian version of this movie, but this seemed like a joke. Reminded me of the 1980's dumb movies where people were spoon fed with silly plots. Not sure how the original movie had turned out to be, but this was a sure shot stupid. I mean in 2020 how can ppl make these type of non-sensical movies. Even if you want to make a good sensible movie with a great message, learn something from Tumbbad. The only great thing about this movie is that it gives a tough fight to Sadak-2 for being the worst movies in the history of Bollywood."}, {"id": 230, "text": "Worst use of 2.5 hours is watching Durgamati !! Such poor animation and dialogues !!!!!!!"}, {"id": 231, "text": "Power of Anushka Shetty in original movie is missing. Spreading Hindu phobia shouldn't be the only content"}, {"id": 232, "text": "I have to say this is the good remake, but not up to the mark, acting is good . People who are giving 1 star are angry on bollywood so without watching the content they are spreading hate. This is way better than Laxmi movie. But still bollywood should stop remaking masterpieces of South and use their own creativity ."}, {"id": 233, "text": "Nothing in the movie makes sense. Tried hard to see it but couldn't finish. Plot is totally ridiculous. Why would police/cbi keep a prisoner in a old haunted mansion all alone is beyond me. May be director/writer was smoking weed while writing script. Bollywood as usual lived upto its reputation of churning out garbage. Disappointing and a big thumbs down"}, {"id": 234, "text": "Cringe comdey..cringe dialogue..Poor story.. Last 20 minutes is entertaining.."}, {"id": 235, "text": "Another worst movie of 2020. Bollywood movies are now like just Grade less movies. Watching Bollywood movies means waste of time, waste of money and it feels like somebody is irritating you and scolding you for hours. Again useless movie, worse Acting, cheap Storyline."}, {"id": 236, "text": "Again propaganda movie, with bad acting and nepotism actors, they tried to relate maa durga with Arabic language, then bad acting of bhumi, and and akshay relative,"}, {"id": 237, "text": "Must watch - ignore negatives. It seems critics were not paid"}, {"id": 238, "text": "What a movie! Honestly after Bhool bhulaiya this is the first horror movie that I truly loved. Bhumi pednekar and Arshad warsi, as always will blow your mind and those who have written reviews like bad acting, boring , waste of time are those who love actors like salman khan. You wont be able to completely understand the plot till end and that's what i loved the most. Yes its true that you will get a hint from the start but not enough."}, {"id": 239, "text": "Direction could have been better. Bhoomi couldn't do justice to the role."}, {"id": 240, "text": "Now a days everyone is being a critic but this a highly capturing movie with nail biting suspense.i really loved acting of bhumi Pednekar and warsi saab.!!"}, {"id": 241, "text": "Bhumi Pednekar ki acting &amp; movie ka sound, bas ye theek h. Baki to kamiya hi kamiya he story me aur movie me."}, {"id": 242, "text": "Remake? Yes! But would appreciate the acting and found it flawless. A must watch! One must not criticise on, the basis on the remake and I found it 10* better than the original one."}, {"id": 243, "text": "If u watch it without knowing its south remake u will definately enjoyed it... awesome"}, {"id": 244, "text": "Sometimes overacting..but cast is superb.Arshad nailed the character and bhumi hats off"}, {"id": 245, "text": "Nonetheless, it was a brave attempt for Bollywood to remake this South Indian Hit &amp; to some extent it did well and Bhumi has done her role in a good way!!"}, {"id": 246, "text": "A must watch movie. Wonderful performance by bhoomi."}, {"id": 247, "text": "Promotes hinduphobic content, promotes drug culture &amp; don't know whom all taken drugs, procure drugs, give drugs &amp; trap people &amp; mix drugs in their drink, that's the culture they follow &amp; they all r Anti-Nationalist, chamchas of Dawood &amp; ISI agent Aneel musharat. #BoycottBollywood is a people's movement &amp; we will stick to it. They all hv to stop this illegal activities from drugs to child trafficking."}, {"id": 248, "text": "Nice movie, its 100 times better than lakshmi bomb."}, {"id": 249, "text": "Must watch!!! the story is too good. Arshad and Bhumi's acting is lit."}, {"id": 250, "text": "I haven't watched South version, but loved this one. I am sure South one would be great as people are saying, but i don't believe in watching movies for comparing actors and then crying X is better than Y. That's not worth of my time. If one has watched original one, then watching remake solely for comparison purpose is just a waste of time.So to summarize, if you haven't watched original then go for it, you wont be disappointed.. Quite a good movie. Thrilling, entertaining storyline, and good acting by lead and supporting actors..If you have watched original then you should have a good reason to watch any remakes. Or else you will likely be disappointed.."}, {"id": 251, "text": "Like the plot and twist. Arshad warsi in complete new role and moreover bhumi nailed in acting as durhamati."}, {"id": 252, "text": "I gave 10 out of 10 because the original story wasn't changed like Laxmi Bomb. Yes this movie is also a remake."}, {"id": 253, "text": "Just An Amazing Movie Bhumi Pedneker Killed Her .. Arshad Warsi Good Portrait Her Act Background Score Was Gd Chahte To Isse Accha Ho Saota Tha But Nice Direction Was Not Bad .... * Can't Compare Act One N Only #ANUSHKASHETTY She's Perfomance Powerful"}, {"id": 254, "text": "I liked the movie ....story is good ... bhumi is very talented ... she always justified with her roles..."}, {"id": 255, "text": "Bhumi mam your performance is awesome in this movie with full of energy and enthusiasm you play a beautiful role in character of durgamati I watched this movie so many times and replaying your durgamati character may be you performance is far better than Bahubal.🙂🙂"}, {"id": 256, "text": "Good plot.Nice twist and turns. Great acting by Bhumi.Must watch"}, {"id": 257, "text": "I haven't watched the original one but after watching this one I personally felt the story of the movie was really good. As for the acting, everyone did a bit of an Overacting"}, {"id": 258, "text": "Movie is good suspense thriller , People are rating this movie on what basis I don't know , i am never a fan of remakes but this one is too good , watch it without justifying anything and you will find this movie an excellent one , Bhumi again did an excellent job . Just go for it guys .. Far much better than laxmi which was just hyped because of akshaya kumar .."}, {"id": 259, "text": "Disappointed with Bhumi Padnekar's acting. Surprisingly everyone seemed to act better than her. Mahie Gill was also a dud and it was quite funny the way she was trying desperately to master the Bengali accent."}, {"id": 260, "text": "It's the same director of the telugu original who has made this remake, so should not be compared. Movie is amazing. Must watch."}, {"id": 261, "text": "Must watch movie....bhumi Pandnekar is fab in character durgamati untill we compare her to anushka sheety...1 star cut bcs of bad choice of CBI joint director.. highly recommended to watch this..."}, {"id": 262, "text": "Such a masterpiece. better story, jump scares, suspense, dialogues acting and everything else. a must watch movie. i don't know why it has been rated 16+ but, there's no mature content."}, {"id": 263, "text": "No doubt it is complete copy paste of Bhagmati, but the level of acting from Bhumi Pednekar is top notch. The way she adapted Durgamati was commendable. Arshad warsi as Ishwar prasad was great as well."}, {"id": 264, "text": "The movie has the capability to keep the viewers stick to their seats . Climax could be edited for 10 minutes. Actors also performed well. Movie was predictable at some places but overall ita a good watch"}, {"id": 265, "text": "Tho movie is a remake of south but this is amazing the vfx and all the features was amazing mainly Bhumi Pednekar acting I am shocked She is so good love this movie"}, {"id": 266, "text": "There's nothing wrong with making remakes of movies and introduce it to new audience who haven't watched the original movie"}, {"id": 267, "text": "If you want to see something exciting, be sure to check it out..."}, {"id": 268, "text": "Good one time watch..much better then Laxmi.... could have been made bit short....great cast."}, {"id": 269, "text": "Watched with lot of expectation. Would not like to shift blame on Bhumi. The entire ensemble just did not work. It failed to create and atmosphere of horror movie. In short it looked like the movie which was shot on handy cam. The movie jumping from different scene to scene with poor correlation."}, {"id": 270, "text": "Bhumi Pendekar acted really good. Fact that she was possessed was displayed nicely. The movie was a remake, so obviously nothing new about the story. The camera angles were *ehm* *ehm*... you get it right :$"}, {"id": 271, "text": "The major drawback of a remake movie is the comparison with the original one. Durgamati which is a cut &amp; paste of Anushka Shetty starrer Bhaagamathie also suffers from the same. For those who haven't watched Bhaagamathie, this remake might come across as a surprise.The movie is engaging in bits &amp; pieces, the political angle is well executed but falters in the horror sequences. G. Ashok's Bollywood directorial debut is simple and pretty much average. Few scenes and unpredictable twists in the second half will surely hold the interest of viewers.Despite the weak script, Bhumi Pednekar tried hard to excel in her performance but in comparison to Anushka Shetty's impeccable act in Bhaagamathie, Bhumi's performance looks dull. The makers also fail to do justice to the potential supporting casts, their performances are let down by a monotonous screenplay.Cinematography is impressive, certain scenes are beautifully shot. Unnikrishnan P P's editing could have been better.Direction 2.5/5 Acting 2.5/5 Editing 2/5 Story 3/5 Screenplay 2.5/5"}, {"id": 272, "text": "After the remake of Laxmii, which hit the OTT few days back, Durgamati is another remake which premiered on Amazon. Let us find if the horror-drama flick is worth-spending time and effort.Durgamati tells the story of Chanchal Chauhan (Bhumi Pednekar), accused of killing her husband, also being interrogated by the CBI officer Satakshi Gangulyy (Mahie Gill) for the 12 stolen temple idols in the last 6 months. As the interrogation might lead to public debate, Chanchal is transferred to a haunted palace near Panna village which reveals the ghost of former queen, Durgamati.Directed by Ashok, Durgamati is a remake of Telugu film, Bhaagamathie, starring Anushka Shetty, which was made by Ashok himself. As you step into the movie, you are greeted with superstition and blind-faith and of course folks who does not believe in ghost. The good thing is that Durgamati has lot of things going initially which will keep you engaged but the moment the main plot is revealed in the middle of the film, the horror drama loses the focus and sadly never recovers.The second half of Durgamati is laid back while the climax starts making sense and this is where Durgamati scores. At the end of watching Durgamati, you will feel that you are watching some old 90's cinema with typical masala ingredients to make it a blockbuster movie. Cinematography and art direction are fantastic. Durgamati suffers from poor editing which could have been trimmed to make it more impacting. Visual effects are hilarious and larger than life. Action scenes are fine. Dialogues are average. Songs are just about okay.Bhumi Pednekar carries the film on her shoulder. The brilliant actress is just improving with each film and after Dolly Kitty Aur Woh Chamakte Sitare, Durgamati will be another feather on her cap this year. Arshad Warsi was just about okay as I felt he could have done grey character with more impact. Mahie Gill looks absolutely stunning but has less screen space. Jisshu Sengupta gave a honest performance in his role.Overall, Durgamati was a typical masala entertainer which had it share of moments to keep you engaged - 2.5/5"}, {"id": 273, "text": "#sanjuzzreviews The film starts off with a ploy by opponents to defame an honest politician (Arshad Warsi) by trying to get inside dope from his ex- personal secretary, Bhumi Pednekar who is in prison for murdering her husband, Karan Kapadia.Since this is investigation is off the records , Bhumi is taken to an isolated and abandoned palace which is supposedly haunted by the spirit of queen Durgamati. This is when the fun starts... or rather should have started!!Unfortunately, that is not the case. The plot is outlandish and cliched. Thrills and chills are lacking. However the last 15 mins of the film are nice. This is the only saving grace.Seasoned actors like Arshad Warsi , Bhumi Pednekar(too much hamming) and Mahie Gill (with a funny bong accent) are wasted. Jisshu Sengupta of Piku fame has done a decent job but cannot save the film. Background score is too loud and jarring.Verdict: Ekdum dabba film hai . You can give it a skip and watch ramsay horror movies of the 80's instead.... Adios🙂"}, {"id": 274, "text": "Most of the people gave a lowest rating to serve their anger towards Bollywood, and yeah Bollywood definitely deserves it.Anyway, let me tell you about the movie - this movie is okay, I mean a new way of showing revenge with a horror touch that stays until the last.And people are comparing Bhoomi with Anushka ( whom they did not even know before Bahubali - majority of the the audience except South Indians). According to me - they both did a good job.Overall its a nice movie, at leats a 7 star movie - not a 10 star or 1 star. Unless you have a grudge towards something.Rest its a personal choice."}, {"id": 275, "text": "As now everyone knows this is a remake of south movie but it should had made in a Bollywood styleBhumi tried very hard but this kind of performances are not accepted by Hindi movie viewersThere are twists in the movie but it comes so late till that time u get fully exhausted and then at the climax the movie catches the speed rest it is very slow movieThe durgamati character was stretched so much that it failed to give the desired effect of climaxThe humour was pathetic and the horror effect was very poorCould had copied better"}, {"id": 276, "text": "Durgamati review :A frame by frame remake of Anushka Shetty's Telugu hit 'Bhaagmathie' (2018), Durgamati lacks the thrill and punch of the original. Moreover, Bhumi Pednekar, stepping in to Anushka's shoes, delivers her weakest performance till date.Playing an IAS officer who is imprisoned for killing her lover (Karan Kapadia), Bhumi underacts with a low pitch diction and then suddenly goes overboard screaming and shouting as Durgamati, the witch queen who possess her. Its an uneven and absolutely unconvincing performance from her which drags the film down by quite a few notches.Director Ashok, who also helmed Bhaagmathie, hasnt been able to adapt his screenplay effectively in Hindi. Infact, Durgamati's running time is more than the original and the film appears stretched in the second half.Arshad Warsi is okey dokey as the honest politician helping out Bhumi's character. So is Karan Kapadia as activist cum Bhumi's love interest. Only the chemistry between them is zilch. Mahie Gill hams it up as the CBI officer. Her Bengali accent appears forced and fake.Durgamati starts as a decent horror flick with some genuine jump scares in first half hour. After that, it just disintegrates in to an unintentional joke. Like the scene where psychiatrist (Ananth Mahadevan) is quizzing the possessed Bhumi Pednekar. Lol.Unsolicited advice: Skip Durgamati. Try out the original Bhaagmathie (with English subtitles) or its Hindi dub instead.Regards, Sumeet Nadkarni."}, {"id": 277, "text": "Durgamati : The Myth (2020) :- Movie Review -Too much of political and personal conspiracies with mythological non-sense. Durgamati was looking doubtful since the trailer because mythological touch given to the film was looking contradictory to it's politically connected characters. Even if we assume two different parallel narratives, one with mythological concept and other one with political conspiracy, still it was big risk. Putting an end to this speculations made with trailer, since the final product is out, and yes the speculations were right. Durgamati is predictably unpredictable yet doesn't offer powerful narrative due to constant mess spread around since the beginning.Durgamati is about an IAS officer Chanchal Chauhan who is put in a Haunted Mansion for CBI interrogation to expose an honest political leader. Later on the narrative opens up lots of secrets from the past and sets itself for twisted ride towards the end. In general point of view, the Personal revenge set in political conspiracy is nothing new and bad. It's mainly in the regular thinking but when it is involved with horrifying mythological story, it loses all the sense and the logic behind the main course of filmmaking. Bhumi Pednekar looks feeble in terrifying scenes with her sweet voice as it was totally opposite to what was required for the character of an haunted woman. Still, she manages to revive somewhat in the scenes which doesn't include that haunting stuff. Arshad Warsi, Jishu Sengupta and Mahie Gill (oh god, that accent) looks unsettled in their characters mostly because scattered writing.Durgamati is a long film coming close about 155 minutes and believe it or not those last 15 minutes have too much to say which rest of the 140 minutes couldn't even hint. So, it looks longer and boring for half of the time and then one or two musicals make it look even more boring. Thankfully, Durgamati has a terrific background score which is one of the highlights of the film. The Screenplay could have been better in terms of sense and detailing. An IAS officer being a secretary of a politician doesn't seem sensible, the plot created in the Haunted mansion is weak and the childish behaviour of cops and CBI was unacceptable.Director G. Santosh should have taken efforts to make this storyline sensible with the use of accuracy in plotting. You should have understood it at first place when you see the original film from south and realise that there are certain loopholes which needs to covered. Anyways, Santosh tries too hard but utterly fails because the overall usability of filmmaking properties doesn't score high and goes in vain due to unacceptable script. Somehow, Durgamati has one or two watchable scenes in the climax having some technical advances which makes it a Below average flick, otherwise it's a fine waste. It's Durga with no Mati (brain).RATING - 4/10*"}, {"id": 278, "text": "The movie at the start itself says that it's a remake of Bhaagamathie, but keeping that aside lets go on to the movies review.The first half the movie is totally under the horror genre and has decent scary moments as well, there is a visible lack of effort with few of the actors but still commendable for the veteran actor Arshad Warsi who keeps you captivated.While the movie moves on to the old and abandoned haveli, it becomes quite obvious that there are going to be jump scares, but still they succeed to get to you in a few instances. If you have the patience to bear the 2 hours of the story build up and wait for the suspense reveal, it is totally worth the wait.Don't want to reveal any spoilers but the last 30 mins of the movie will truly leave you gasped by the brilliant story and acting of the few actors in the lead roles."}], "reviews_amount": 279}