{"name": "Uncle Peckerhead", "titleId": "tt11695654", "reviews": [{"id": 0, "text": "This is a really enjoyable film with a strong story and brilliant acting from all of the cast.Although this film is quite simple, that is part of it's charm and suits the story - which has some interesting twists and turns - and the characters.Well worth a watch."}, {"id": 1, "text": "Quirky little film with some decent performances which belie the low budget feel - not that I'm knocking the low budget feel, that's part of its charm. There was no fat to be trimmed with the film pulling you along nicely to its conclusion. I hope to see more from this director and the actors."}, {"id": 2, "text": "Cast aside the fact that Judy is more mom than rocker or the guitarist comes across as a buffoon rather Than the riot boy In shy boys clothing I'm sure the character was meant to be then this film is a hidden gem.The tunes are good,the editing paced and the writing sharp.Well worth the effort.Oh whoever thought a fella, who looks like an accountant, wearing a sheepskin,gelled up hair with a ring in his nose is punk rock needs b*%ch slappingSolid 8"}, {"id": 3, "text": "I wasn't expecting much of Uncle Peckerhead, but found myself pleasantly surprised. It is as funny as it is gory and it is plenty gory. Very entertaining"}, {"id": 4, "text": "There is a good chance you will enjoy this. The title threw me off, but the plot reeled me in. It was gorey, it had great music, and the acting was good, with the right amount/kind of cheese. Was not disappointed."}, {"id": 5, "text": "Uncle Peckerhead was an amazing find. The kills moved forward with the plot, the music was well toned with the characteristics of the actors. This films a must see if you have passion for music and comedy slashers."}, {"id": 6, "text": "A silly movie with a silly plot but I had fun watching it. The characters are natural and fun to watch. The soundtrack is quite good too. Not a bad way to relax and spend 90 minutes."}, {"id": 7, "text": "I think it's a quite enjoyable movie for funny-gore fans. That's all. Do not expect a twisted script or great acting, it's an original B-movie."}, {"id": 8, "text": "In this age of first person...Blair Witch style horror movies that have become played out, boring, and unoriginal, it was quite a relief to see something like Uncle Peckerhead out there. The acting was decent and it was really well shot.I give it a 7/10 on originality of the storyline, the humor, and copious amounts of gore. This also reminded me of my days living in Austin,Tx playing dive bars for peanuts and crashing on couches after the show, so it also connected with me on that level as well. I would compare this to something like Deathgasm. I recommend checking it out."}, {"id": 9, "text": "This movie is fantastic!! Highly suggest watching it!! It's a unique take on horror, with humour, and touching relationship building, but then with a good dose of gore!!"}, {"id": 10, "text": "This is one of the best movies I have seen in along time. I recommend this movie to everyone... Academy award winner..."}, {"id": 11, "text": "Hilarious and well made blend of horror, comedy and musicSome great comic timing from cast who were all excellentPerfect movie for a few beers"}, {"id": 12, "text": "Well intended film that does speak to the some fun of a road film. But, it's story keeps a bit in the camp mode and maybe too much given the larger professional tone of the film. Still, its watchable and enjoyable but don't expect much from it."}, {"id": 13, "text": "The 1st 5 minutes of this movie really live down to your worst no budget indie horror fears but then it really comes alive. The main characters are engagingly low octane slow burners and the (excellent) band explore the Faustian pact success in music often demands. Talent just isn't enough, punk's not fair either but this is what might happen when you give the benefit of the doubt when you know you shouldn't. If you like noisy guitars that are definitely not heavy metal it really is worth sticking with this film."}, {"id": 14, "text": "First few minutes I thought this looked another cheap terrible indie horror but turned out to be really good, great acting, really relatable cast and great music, peck was strangely endearing to but bar a bit of camera stuff the film was thoroughly enjoyable. Only thing is continuity has to be looked at in these films but it's forgivable if as entertaining as this"}, {"id": 15, "text": "Worth a watch, surprisingly good! Didn't expect too much but was pleasantly surprised!"}, {"id": 16, "text": "6.9 rating because the people associated with the film were first to sway the score. Give this 2 or 3 days and I predict a MUCH lower score. This was one of the worse movies I've seen this year. Trash!"}, {"id": 17, "text": "Loved it. Decent storyline. Great acting. Funny......AND THE BAND IN IT KICK ASS!Very pleasantly surprised. Excellent film."}, {"id": 18, "text": "This movie is accurate in its depiction of touring life, and while the premise is spelled out early, the constant tension of wheater or not he will eat them is putrid. Peck can be a metaphor for many things the music scene is rife with, drugs, sexual violence, exploitation, etc., but where this movie works is as a metaphor for how we tolerate such things in pursuit of cohesiveness and admiration. I would suggest this to anyone who has seen a local show or like horror comedy, but while the laughs aren't constant, the gore and tension are."}, {"id": 19, "text": "One of those movie titles that you think is going to be a disaster...but...I believe it! A fun touring band zombie/werewolf gig."}, {"id": 20, "text": "This movie just falls short of being a cult classic by millimetres. It was a fun ride of a movie with gory effects but the script just let it down. 6.5/10"}, {"id": 21, "text": "This film left me speechless... Just wow. This is a twisted adult version of Scott Pilgrim without the fight for the girl theme but more focused on the battle of the bands. There is also an element of the film Almost Famous too... To add to the mix we get the most bloody roadie you can imagine. This is surprisingly entertaining &amp; the characters are well drawn out and the witty dialogue enhances the experience. This is a hidden gem of a film!"}, {"id": 22, "text": "I am a true horror fan and was excited to see this one ...man what a let down had so much potential its so hard to find a good acted Well written movie these days truly is a sad thing"}, {"id": 23, "text": "Lovely feelgood movie. Am 46 years old.. Some times you are better of just taking what they give you and enjoy it.Not analyse everything."}, {"id": 24, "text": "Not worth any time bad acting and just garbage. Not like the classics spinal tap!"}, {"id": 25, "text": "UNCLE PECKERHEAD is a low budget comedy which just so happens to feature one character who transforms via a werewolf-style curse into a demon at night, a demon with a penchant for human flesh. The rest of the story is about a punk band trying to make it big by going on a road trip in a plot which reminded me a little of Ricky Gervais' film LIFE ON THE ROAD. The budget is obviously low but there are some surprisingly fine performances here, particularly from the lead characters, and these enhance the comedic moments. As with many comedies a lot of it is hit or miss but the overall feeling is that this one's likeable enough."}, {"id": 26, "text": "Just watched this on Horrible Imaginings online fest and enjoyed it a lot. The acting is good, especially from the lead actress and the film overall is well paced and watchable.It has plenty gore, and the comedy element works, certainly for me anyway.The characters are developed quickly and comedically, and this helps us not just care about what happens to them, but also to want to see each of them on screen more.The horror element is good and Peck works well and fun as the horror creature; definitely elements of the late great Sid Haig in there as Captain Spaulding.In filmmaking terms there are clearly influences from other film styles, in particular Shaun of the Dead, certainly with the editing and character interaction. I also felt a lot of School of Rock in there, maybe just because the story is of similar notes. But the opening shot of Max lying asleep on the floor was reminiscent of Jack Black in a similar shot.A very accomplished and well put together feature film. And no, I don't know any of the cast or crew (yet), just a review from someone who appreciates the time and effort that goes into filmmaking and congratulations on an enjoyable watch."}, {"id": 27, "text": "I was lured in to watch Uncle Peckerhead given the movie's interesting poster/cover. And of course the title alone just had something brilliant about it. So without even knowing anything about the movie, I sat down to watch this 2020 horror comedy from writer and director Matthew John Lawrence.The storyline told in Uncle Peckerhead was definitely unique and had some interesting aspects to it. However, the movie just suffered from being a tad too predictable. Especially towards the end of the movie.Uncle Peckerhead have some interesting characters, and they are portrayed by some nicely cast actors and actresses. Now, what worked here, for me at least, was the fact that I wasn't familiar with those cast for the movie. And I do enjoy watching unfamiliar faces perform in movies.There was a fair amount of blood and gore in the movie, which was something that was worked well in favor of the movie. And I had hoped for something like that, given the movie's poster artwork. So writer Matthew John Lawrence did deliver on that account. And it should be said that the special effects in Uncle Peckerhead were actually good.While Uncle Peckerhead was watchable enough, it just ended up as being an overall mediocre movie experience. Which was a shame, because there definitely was a lot of potential to the movie. It had a lot of ingredients for being a great horror comedy, but it was just not to be.My rating of Uncle Peckerhead lands on a five out of ten stars."}, {"id": 28, "text": "Trying to get their career going, the promoter for an upcoming punk-band heading out for their first tour is forced to rent a van from an untrustworthy local, and as they come to find that he turns into an uncontrollable flesh-eating monster whenever he gets upset they struggle with stopping the tour or continuing.There was quite a lot to like with this one. One of the brightest aspects to enjoy here is the strong and enjoyable bond between the band which is what allows this to be quite funny for the most part. From the beginning, we're given plenty of light-hearted moments about the connection between the band who are the stereotypical lazy group of underachievers who poke fun at each other, rely on the determined girl to get all the work done and just don't go for the lifestyle making for some comedic moments with their unprofessionalism. That carries over into the later parts where the sheer unfazed nature they share over the situation which extends to how they accept the demonic condition which is revealed quite early on not only adds to this but simply makes for a fun, light-hearted effort here. As well, with the more enhanced horror elements that are present once they realize the character is a ravenous creature the film provides plenty of solid sequences. Letting the wild, savage nature of the creature loose with the ability to rip people to pieces in graphic fashion features plenty of over-the-top aspects with the full-on gore and kills getting quite worked over here. The splatter-filled scenes with the encounters between the venue promoter, the raucous fans they meet in the parking lot, and the later encounter with the rival band are not only hilarious but feature plenty of great gory goodness as well, providing practical effects work as well. Combined with the impressive high-energy music they create for their band, there's quite a lot to like here with this one. The film does have a couple of issues. It's biggest issue is the fact that the pacing here is incredibly off in the second half as there's a long stretch where nothing much happens. Once they realize that he's the way he is, it seemingly grinds to a halt with the band coming to terms with his condition and agreeing to go along with how to handle his status that seems to play on the joke that the group knows but are trying to convince themselves he's not going to hurt him which plays out rather oddly. As well, the scenes at the house which are turned into a flashback featuring the outcome of the rival band being incredibly similar to a previous encounter come off as lazy and hold this back somewhat, and overall tend to be the film's only flaws.Rated Unrated/R: Graphic Violence and Graphic Language."}, {"id": 29, "text": "About the only success this troupe of wannabe-movie-making stoners have managed is to hire a professional shill in the guise of @victoriapilotyyc - and a pretty bad one at that.You'd normally expect a trailer to tease you into wanting to watch a movie, showing you just enough to intrigue you but not enough to give the plot away. In this movie's case, though the trailer was appropriately short, it contained the ENTIRETY of worthwhile scenes - you will NOT get any additional entertainment from actually watching the movie in its entirety.The only reason I'm giving it two stars rather than one is the camerawork - for a change (among these lame attempts at moviemaking), it wasn't using the trademark wobblecam to make viewers nauseous.Best viewed at 4x fast-forward, but even then you might need to take breaks to recover."}, {"id": 30, "text": "When an undiscovered 3-piece punk band go on tour with a blood-thirsty monster, carnage is guaranteed to ensue.The members of punk band duh dream of making it big, but first they need their big break. Surely the tour that band leader Judy has arranged will give them a leg up. The only problem is that they are short on money and their van has just been repossessed by the creditors. With no wheels the band go on the hunt for a mode of transport when they bump into Peckerhead, a stranger who offers to take them on tour. Things seem straight forward enough, but when the band get ripped off by a venue owner normality is blown out of the water. Judy walks in to find Peckerhead eating the owner. Understably shaken, the band listen to Peckerhead's story and ultimately decide that the tour must go on. As they travel from venue to venue more death follows but it is mainly only Judy that is disturbed by it, drummer Mel and lead guitarist Max actually think Peckerhead's actions are cool at times. Soon enough though, things go from weird to downright scary for the band, they get kidnapped and only Peckerhead can rescue them, but it might be at a cost of their friendship.This is a slow burner of an independent film that gets better the longer it is on. It has got plenty of bloodshed and gore in it which is done on the cheap but with good comic effect. The characters do not have much depth or development to them, but they are pleasant enough. It made a change that they weren't bound to stereotypes of the genre of music they are from or the instruments they play - in this instance the lead vocalist is the shy and retiring type while the bass player is the organized one. It is a fun film which failed to really get me super excited, but it was still enjoyable and provided the odd chuckle.There is a simple charm to the film, which is nice, especially when it is juxtaposed with some of the slasher and splatter elements that help the story move forward. The music in the film is decent, it was nice to see a punk rock band in film and was amusing when one style was put up against the whiney scream-o style later on. The acting is decent, and the standout is Chet Siegel as Judy, the neurotic driving force behind the band. The effects are far from Hollywood epic but are more akin to a scaled down Braindead or Evil Dead - very over the top and laughable, but still highly amusing. The transformed Peckerhead-Monster is not going to inflict nightmares, but it is almost a tongue-in-cheek nod to bigger werewolf or vampire looks.Overall, I enjoyed the film, it was original and fun, even though the pace of the film was not the best. It was nice to see this kind of film still being released in 2020, rather than some over the top big-budget slap in the face, or a CGI heavy straight to the Sy-Fy channel piece of trash. This looks more like a product of passion and enjoyment than a vehicle to earn big money - which always goes down well in my books.Directed and written by Matthew John Lawrence this 2020 stars David Littleton as Peckerhead, Chet Siegel as Judy, Jeff Riddle as Max, and Ruby McCollister as Mel. It has a runtime of 97-minutes and is an 18-rated film, mainly due to the violence and gore."}, {"id": 31, "text": "One night I was searching on amazon for a movie to watch. I stumbled upon a movie that looked to be up my alley. The basic premise involves a punk band who goes on tour and are looking for a tour van. They stumble upon a homeless man living in a van. Upon first seeming irritated at their soliciting he quickly warms up to them once they inform him they are in a band. Upon gaining his trust he turns into their roadie and they go on tour with him.But soon they realize this man has a dark side. Every midnight he goes on a man eating rampage. Ordinarily, this would be enough for anyone to keep their distance but because the people he kills always seems to be people they have a problem with they decide to keep him around. He appears to be some sort of cannibalistic demon. As silly as the plot sounds it is supposedly based on a true story so I would be interested to know more about what actually happened.Without giving away too much I would certainly say I enjoyed the movie. Comedy horror can usually go either way for me but when done right it can be really enjoyable as in the case of movies like Tucker and Dale Vs. Evil or Shaun of the Dead. I would add this movie to the list. It was especially enjoyable given my love of both punk music and gore movies and I'd recommend it to any music or gore movie lover or fans of the comedy horror genre in general."}, {"id": 32, "text": "Would I ever seen this flick without Felicia from New York mentioning this, I don't think so. It's a low budget independant flick, not with the big promotion but still, small talk made it one to watch.Simple story, a bit of Spinal tap here and there and some gory moments. but stated as a horror I don't agree. Funny, yeah here and there but it's just a flick for lovers of independant bands with some roadie that turns into ' a beast' at midnight to eat people.Don't take it too serious. What I didi like was the accent of Uncle. What I didn't like,, some scene's were too long. But the gore is really well done.So not for everyone because it's all about being on the road as a band with some nasty moments. Did Ilike it, here and teher, just a mediocre flick. Cut it under 9à minutes so scene's go quicker and it would be better. Gore 3/5 Nudity 0/5 Effects 3/5 Story 2/5 Comedy 0,5/5"}, {"id": 33, "text": "It's an ok film if nothing else available. Silly but well shot and acting is bearable I guess. Characters are just cliched and the music parts are cringeworthy ......Barely any horror really and for the most part (couple of fun short scenes but played for laughs), the monster seems more like an afterthought......an addition maybe to add some humour to a weak script. Three moronic musicians are in a band that seem a bit confused about what they are style wise?? (They dislike 'Metalheads'!? even though their music is clearly pop punk Metal in style.) They go on 'tour'.....which is a stretch as playing during day and it's all so unrealistic. The writers are obviously clueless about what a band is really like etc. It's not a surprise as sadly most films about rock and metal bands make them look like idiots...............This is a below average comedy horror......... seen far worse but also far far better.Terrible ending."}, {"id": 34, "text": "From 5 minutes in I had a bad feeling about this one, but I tried to stick it out. I wanted to give it a chance to get better but after 40 minutes of terrible comedy and acting, I had to switch off.The premise of the film had potential but the delivery fails to live up to it. If you're looking for comedy then you're going to be disappointed, if you're looking for horror then you're more likely to find it in the acting than the film itself.It does get an extra star for having some plot and following a storyline, but I couldn't find any reasons to bump it up to three stars.If you want an undead comedy horror, watch Shaun of the Dead. If you want that with a bit of metal (music) then watch Deathgasm or, for a more serios one, The Devil's Candy.Give this one a miss."}], "reviews_amount": 35}