{"name": "The Paramedic", "titleId": "tt11127690", "reviews": [{"id": 0, "text": "A Spanish thriller. It is about a paramedic who lives with his girl trying to be parents and how he spends his time working until an accident makes his life change and the biggest of his dreams, which is to have a child, is frustrated. Entertaining Quality. Predictable like all of its kind. Mario Casas is unrecognizable and spectacular in this interpretation. Sometimes the language is run over and that makes some moments not understood. The character's psychology and motivations are very clear and bearable. The few successful sexual and violent scenes. It's about how we handle frustration of all kinds. An extraordinary option if you are a fan of thriller and Spanish cinema."}, {"id": 1, "text": "The concept is nothing new. But Mario's acting was everything in the movie. From the start we get an impression that the protagonist (Angel Hernandez) is recluse and doesn't like interacting much with people, he is an extremely controlling boyfriend and he suffers from a kind of kleptomania (maybe??) wherein he steals items from the injured people's homes or cars while arriving for help as a paramedic. When he suffers from paralysis his suspicion towards his gf grows stronger to the point he spies on her. In time, his gf finds what he was doing and she leaves him. The rest is kinda disturbing. As I mentioned, the plot is not new but you gotta watch this for Mario's performance. He just lives upto the character right from the start to the end with no remorse or feeling on his face regarding the type of things he did. The 7 stars go to him and of course to the ending. The movie has a good pace and doesnt leave you bored but it doesnt have anything extra ordinary to offer."}, {"id": 2, "text": "After weeks of trying to find a good film on Netflix (having watched almost all the decent ones) I finally came across this gem. A hugely enjoyable Spanish psychological thriller that I was glued to throughout - and a few unexpected plot twists along the way. Really enjoyable movie (there are actually a few really good Spanish thrillers on Netflix if you take the time to find them). Disturbing, creepy, suspenseful, good acting, good camera work and a fantastic ending. At times disturbing to watch, but that's why we enjoy psychological thrillers, isn't it? I give it 8 out of 10."}, {"id": 3, "text": "I started watching and and it didn't take long before the main character's behaviour gave me the creeps. The movie centers around him handling his new life with paralysed legs and the resulting frustration about it, which he works out on his girlfriend. Him being stuck at home also worsens his already existing jealousy towards his girlfriend which ultimately gains the upper hand.His actions constantly made me curious about what he was going to do next and I liked the suspenseful atmosphere that was created. Mario Casas puts down a good performance here. Not all the things happening in the movie are realistic but overall I liked the movie. Not as bad as some reviews here are saying."}, {"id": 4, "text": "I think some of the negative reviews are because this thriller is somewhat original in that it doesn't follow the usual thriller pattern. Quite interesting and creative and unexpected. I did not think this would lead down the road it went and the end is surprising. I won't say anything else as not to give anything away. The leads are great. The story is dark and twisted and very entertaining. Enjoy it and don't expect the typical Hollywood film. This film was great"}, {"id": 5, "text": "I don't regret watching, many things did make sense, but some details are quite funny - especially the end of ending, which feels like of another movie. But at the same time, it's not an open ending that leaves with a question wtf just happened. Watch it, judge by yourself."}, {"id": 6, "text": "Normally Spanish psychological thrillers never disappoints, but this one is an exception. I didn't feel sorry for the girl, didn't feel sorry for the dog, neither for the neighbour. The character development was that poor !! I seriously don't understand the silliness at the end. Just skip it , even on a lazy sunday."}, {"id": 7, "text": "Poor character development Movie has 2 characters who are pieces of crap The tone is dark The whole time I was expecting more paramedicy"}, {"id": 8, "text": "The movie tries to achieve suspense with some build up of how Angel begins to lose his mind after the accident. It tries to create internal montage for the character but fails the attempt, instead shows us a character with a non believable motivation of his actions. The miurders committed are so irrelevant and don't show anything cinema hasn't seen, a jealous man killing and kidnapping a girl. I think it's a movie that is just going to be a forgettable Netflix thriller just like what happened to Fractured, even less. Can't believe it's the same actor Mario Casas who made a great performance in the Invisible Guest. Although I wanted to know how was the movie going to develop, halfway through lost interest. Lack of originality and full of cinema cliches. Wouldn't recommend it."}, {"id": 9, "text": "I found the plot interesting. Good camera work and particularly love how they used facial expressions and music to tell part of the story."}, {"id": 10, "text": "I'm a big fan of Mario Casas, so would probably watch any movie he's in. I was hesitant on this one though b/c of the low rating. Don't let that sway you! I really enjoyed the movie. Has the story been told before?? Sure. But I thought it was a good thriller, entertaining, good acting and kept a good pace. Overall it was a perfect movie for a Netflix kind of night."}, {"id": 11, "text": "How can this be in the top 10 on Netflix is beyond me. The entire movie seems to have been made keeping the stupidest people in mind. A girl-friend who broke up with her boy-friend because he was spying on her, yet she goes back to his flat with him, all alone! The old man kept hearing screams of help, and all he could do was knock on his door saying I'll call the police! No wonder he was murdered. After some time it just gets too idiotic to watch. Not worth your time."}, {"id": 12, "text": "The Paramedic is reminiscent of better movies such as Rear Window and Misery, but without sufficient character development, it just feels like an exploitation film, heavy on violence and narcissism. A great deal of the tension generated here is sustained by the fact that the director establishes early on that Angel (an ironic name) is without morals, a guy in the healing professions who routinely steals from the injured and dead. We know that no internal ethics will interfere with his revenge scheme. He won't hesitate to murder anyone who gets in his way. He won't feel remorse or mercy, or change his mind about the evil he is doing, so nothing he does, no matter how vile, surprises us. Implausibility is high as people keep warning Angel they're going to call the police instead of just going ahead and calling them. Most implausible is that Angel, like a Mafia boss, has his own crime cleanup squad on call for getting rid of pesky bodies. All of this leaves little room for nuance and doesn't allow the mounting tension to ever let up, making this simply unpleasant and difficult to watch rather than engrossing, as a thriller ought to be."}, {"id": 13, "text": "Everything happens in a way you can guess. The movie doesn't surprise or excite you. Still, not that bad. I liked soundtracks."}, {"id": 14, "text": "This is a decent thriller! The music and camera work making it extra scary. Give it a shot."}, {"id": 15, "text": "A husband suspects his wife and he became limp at one stage...then he suspects more than before and he installed spy app in her mobile...later she found that app then she decided to separate from him and decided to stay with his friend..then he get angry decide to revenge them... One time watchable movie.."}, {"id": 16, "text": "Boring movie with no message. Basically it is a man with a girlfriend who is paralyzed, she wants to abandon him for one of his friends and he tries to prevent it with the skills of an abuser, killing him and kidnapping her while in a wheelchair. The story I do not know very well what it means, not even the final message where she takes him after leaving him tetraplegic (revenge ??). Very basic plot, and also most of the things that happen are surreal (the hacking, the murders while in a wheelchair, the stabbings, etc). Bad"}, {"id": 17, "text": "Ickiness embodied. Probably the worst thing I've seen in decades. I guess it's a top ten on Netflix because they shove it in people's face. Truly awful."}, {"id": 18, "text": "At the top of the list as the most unlikable character I have seen for a long time is Angel, the main character. The only reason I stuck with this mess is because I'm home during quarantine and I'm running out of things to stream on Netflix. I would not recommend this to anyone. Just awful."}, {"id": 19, "text": "Total scumbag loser of a human being paramedic that steals from those he is tasked with helping gets critically injured and becomes a complete lunatic to his girlfriend who he then torments. I wouldn't go out of my way to watch this, it was very disturbing and hard to watch but at least had a fitting ending. Hard to believe the girlfriend would have ever dated such a loser."}, {"id": 20, "text": "Feels like I've seen this movie couple of years ago, nothing new."}, {"id": 21, "text": "Such scenarios are very common. Every year many similar movies come out. If you are free for 1.5 hours and do not have anything to do then watch it. I just spent 1.5 hours which I can not get back ! Stupid beginning with stupid ending...."}, {"id": 22, "text": "I liked this movie, and thought this was a very good thriller. Mario casas transformed himself physically for this movie. The soundtrack is very fitting and the fight at the end is very tense! I thought it was well developed. Spain once again proving itself with good productions."}, {"id": 23, "text": "It's a fine thriller and worth watching. Cool soundtrack, good script, acting, cinematography, etc. It wasn't the most creative plot but it was enjoyable."}, {"id": 24, "text": "This movie has many flaws, very interesting and fun at the beginning while loosing it a bit toward the end. My 8/10 is mainly for the very good actor charismatic, very handsome and sexy Mario Casas. He was amazing in The Skin of The Wolf. Worth a watch."}, {"id": 25, "text": "I don't understand why some people start the review explaining what the film is about!! I just saw it! sooo , spare your time! I just had to share that. ##@@ sorry. This movie was very good, Mario Casas=excellent!, very creepy, pshycho thriller . Entertaining thriller / Horror for me, can you imagine? what would you do? really scary, because it can happens in real life."}, {"id": 26, "text": "I wasn't sure what I should expect with this but it ended up being ok. There are a a few tedious moments but for the most part I stayed engaged. The acting was good but I think it could have benefited from a bit more depth into the characters back stories. There were some things going on that could've used a bit more explanation.Decent watch though."}, {"id": 27, "text": "Fantastic obsession and control thriller. The acting performances were stellar. Mario Casas plays the Angel villain very well. I really hated Angel for being such a SOB and just loved the Karma his character gets at the end. Déborah François facial expression at the ending scene reminded me of Sophie Turner (Sansa Stark in HBO Game of Thrones) after she fed Ramsay Bolton to the dogs. If you don't speak Spanish and didn't get it, it's now Vane turn to take care of Angel. Now that Angel is totally disabled, she gets to turn the table on Angel."}, {"id": 28, "text": "Slow movie, based on history with no sense. The film is bored and no create any expectations that implies no attention by the espectactors. No recomended. Its a waste of time. No more to comment because is a empty movie. Thank you. Regards. Good night."}, {"id": 29, "text": "The original title is much better, but the film is great, an excellent Spanish film, tension and anguish in the right measure, and we bring to life the certainty that if the guy has a despicable, macho behavior and a dubious character, we get out, but here we have a great development and excellent outcome, very captivating and mesmerizing... Very good..."}, {"id": 30, "text": "The trailer says it all! No surprise and nothing new."}, {"id": 31, "text": "Slow, boring, predictable, and full of holes. I gave it 2 instead of 1 because it did manage to make me feel a little stressed out, which wasn't pleasant for me but I guess is the point of a thriller. Or whatever. Anyway it was bad, don't bother."}, {"id": 32, "text": "This movie did give me chills. It did remind me of The misery. The main character Angel so evil, but normal looking and who would suspect a disabled person.To give this more stars. I would have liked more closure. Like when did the incident with Ricardo happen and did he die? Also the last minute of the film bugged me. No one in their right mind would actually look after that POS. I'm hoping it was a revenge I'll look after you aka I won't look after you And disabled or not, Angel should have been in prison not a hospital.I guess it leaves it lingering to make your own ending but I don't enjoy movies with open or ambiguous ending. So remove the last minute of the film and it would have been given another star."}, {"id": 33, "text": "This movie has 0 logic And bad cinematography I don't know how did it make it on Netflix"}, {"id": 34, "text": "I somehow rooted for main character. It was interesting and I really expected stronger ending but there was nothing special. Watchable."}, {"id": 35, "text": "Not bad but the end was trash , I wanted him to kill her"}, {"id": 36, "text": "I thought its paramedic film, but actually a terrible love story. Actings are good tho, but very misleading film name. Storyline is just ok, not really good. Many unrelated scenes such as police officers visiting the house, CCP China COVID flu from radio... etc these don't change the story."}, {"id": 37, "text": "Calling this a horror movie is an insult. Or if it is labeled as thriller, there's nothing even thrilling about it. I yawned countless of times throughout the movie, annoyed by the incompetence of the police, and all the characters are not even sympathetic that I don't even care what happens to them. It's a shame that I even watched it to the end."}, {"id": 38, "text": "The first part of the movie might be a bit slow but wait for the second part, you will sure enjoy it and the final scene is brilliant"}, {"id": 39, "text": "What I load of nonsense that was, good idea but ridiculously executed.Don't bother."}, {"id": 40, "text": "What a useless movie! The acting was not bad and it did build a certain amount of tension, but then, it just falls flat...Forgetable..."}, {"id": 41, "text": "The Paramedic offers us nothing but neatly packaged captor-victim clichés. The thrills are minimal, the characters are thinly written (noone to root for, really!), and it's also a film where logic is conveniently sidelined for storytelling purposes. That's never a good sign for thrillers. Mario Casas is believable as the (jealous of his ex) paraplegic psychopath, but the rest of the cast don't really match up (owing to poor writing). If you expected something as striking as The Body, Marshland, or Casas' own The Invisible Guest, you'll end up super disappointed like me."}, {"id": 42, "text": "I don't recommend it to anybody! It is very cheap, ordinary and stupid story. I am extremely disappointed and regret losing my time for this nonsense. It was so unpleasant that I still feel bad 2 hours after watching it."}, {"id": 43, "text": "This Spanish thriller is sure to put you through psychological trauma, not because of its superb storyline or because of any extraordinary performances, but sheerly because of the title character Angel's utterly unconvincing obsession with cruelty and possessiveness. Angel, the paramedic seems to the devil's child and it's beyond comprehension that people around him, especially Vane, his girlfriend couldn't recognize his true character for so long that it's only after going through near hellish experience, she realizes that she needs to fight him! Does Angel change after he is completely immobilized? Physically yes, as it appears that now he does not have any control over his body. But then mentally he yet seems to be active even in the end and it's unthinkable as to why Vane still wishes to keep him company, though it's implied that she wants her revenge. Nothing really wrong in having revenge, but then when it comes to a sick character like Angel, keeping distance and not having proximity could have proved to be the best revenge."}, {"id": 44, "text": "Prior to the pivotal accident, Angél was already stealing from patients and being a general ass to everyone. After the accident he just goes off the deep end.He wasn't just a troubled man before the accident, he was already a bad person. It takes away from the tragedy of the accident, as you are never rooting for him, and it's believable he would have become as disturbed without it. Vane gets almost no depth of character either.Kudos to the actor for the physical work he did, which is the only reason I upped the stars"}, {"id": 45, "text": "The movie is nicely done, with suspense, and twists. Great photography and acting. I really enjoyed watching it!"}, {"id": 46, "text": "The story had a very nice suspense, especially in the beginning, e.g. you get a little insight of what a life of a paramedic looks like. Unfortunately the movie is ruined by unnecessary drama. A victim on a wheelchair and an emotionally driven female victim have a battle in their resolved relationship which causes nothing more but trouble around them.Moreover, there was absolutely no lead actor/actress in this portrayel, it definitely lacked someone who could lead the movie to be better. What's more, there was too little action going on.To sum up, you can go and give this movie a shot, but there are enough better ones out there that I could recommend!"}, {"id": 47, "text": "If like Mario Casas you have been in some exceptional movies, some may feel this being way inferior than it actually is, because of all the other stuff they've seen him in. So he is kind of a victim of his own good work (chosen work that is I guess). But is he also a victim in the movie? You'll have to watch the movie to see that for yourself.One thing is for sure: it is not an easy movie to watch. A lot of despicable things happening, a lot of straining and draining things. A lot of mentally disturbed things being done (even to a dog, which you kind of guess way before it happens). Are you able to go through with it? It won't be easy and it will take a lot from you, if you try to invest in the characters portrayed. One thing this does as many other movies have done before, is try to make you sympathetic to a degree with the pulprit ... I've seen enough of those to fight that. Then again, the evil character here makes it easy to not root for him ..."}, {"id": 48, "text": "Takes some time for anything to happen. Eventually got into it but its still quite predictable."}, {"id": 49, "text": "The plot is so predictable and very bad acting. Characters are lacking everything. Nothing is further explained in this movie. Safe your time and watch something else or play cards..."}, {"id": 50, "text": "Girl cheat on guy, but guy got punished instead. Cringe movie in general"}, {"id": 51, "text": "I feel deeply disappointed. I really expected more. Mario Casas is not a good actor but in this movie his acting is pretty decent. The problem is that the script is poor and slow in the wrong sense, there was no way of saving this. I would not recommend watching this film. If you want to watch a good film with Mario Casas you can try grupo 7 or contratiempo. The rest are average or simply bad."}, {"id": 52, "text": "When you see someone in a wheelchair enter in a house like the best thieve, kill a couple of people and survive a fall of a dozens of feets, only John Wick and the Equalizer are his level. Really poor movie"}, {"id": 53, "text": "I watched this in the original Spanish with captions.I was interested to see what happens. As someone else pointed out, there's little tension because at the very beginning of the film we see that the protagonist, Angel, doesn't really have a moral center. He steals from the dead and the injured he mistreats his girlfriend and he abuses her.She leaves, when she discovers that he has downloaded an app on her phone to spy on her. They live in a dark cramped little apartment and there doesn't seem to be very much joy in there. They're trying to have a baby and he goes to the doctor and he finds out that he really doesn't have the sperm count but he doesn't tell her.Subsequently while riding in the back of an ambulance it is t-boned by large vehicle and he's left a paralegic.He's nasty, he's manipulative, and he continues to manipulate and abuse his girlfriend . He's also spying on her with a app on his phone. He listens in on her phone and he discovers her talking to a friend of hers saying she's unhappy and she wants to leave them and her girlfriend is encouraging her to do so.he then decides to make nice and makes all sorts of promises to her about changing his ways, and you really don't know if he was ever going to really do it. Because the same night she finds out about the app on the phone and she immediately leaves him while he's in the shower.Later he sees her in the street with the ambulance driver and it's obvious they have a relationship and they are working on having a family together.He uses a ruse to get her up to the apartment. She stupidly goes up there without telling anybody that she's going. He drugs her, ties her to the bed basically kidnaps her.Also, as others pointed out people keep threatening to call the police (an old neighbor that hears her screaming, the distraught boyfriend that's looking for her), but they never do. The old man neighbor, instead goes in the apartment when Angel tells him to come in to see that no one's in there. Angel promptly kills him, then calls up a guy he sells the stuff that he steals from injuries people who just comes in and takes away the body.Sorry, but this guy is a nobody why would anyone cover up a murder for him, for a few dollars? Anyway it's at this point when you realize the movie isn't going to get better. You also realize that you don't care about any of the characters because there was really no character development.This was a movie that was a little bit different, that could have been better, but wasn't. Interestingly enough they incorporate a little bit of Covid into the movie. Although they don't name it. How timely is that?"}, {"id": 54, "text": "No idea why it was low rated.I loved this movie. It's a must watch for sure"}, {"id": 55, "text": "Well this was quite a tense and infuriating ride, and I mean this a good way! Though the concept is not really original, the whole execution is threaded very nicely; quickly reels you in and doesn't let go till the very end. The performance of 'the paramedic' is incredible, and the ending is satisfying and quite diabolical. Well done, a fine thriller indeed."}, {"id": 56, "text": "This was such a good movie, I could watch it again. Great little thriller that keeps you locked in from the start. Very creepy, a must watch!"}, {"id": 57, "text": "I came across this movie on Netflix and I decided to watch it. As I watched it from the beginning, it became very interesting capturing my attention. I don't understand all the bad reviews. However, I suggest to others who haven't seen this movie, please watch it because it's a good suspense movie. At times I found myself laughing during this movie. All I can say, Ángel reaped what he sowed at the end of this movie."}, {"id": 58, "text": "The start gets you intrigued but that's it. Mario Casas is a good actor and Spanish movies are susually very well written and exciting. But this is just poorly done. The main character does whatever he pleases despite his physical limitations with no problems. The girl that is in danger lacks so much emotions and doesn't generate sympathy with the audience, so despite you could feel angry at the protagonist for his actions towards her, you don't worry or feel connection with the girl. Nor the lover, the neighbor or any character has a development that makes you hate or love them and some of them deliver a very poor performance. The movie tries to sustain one tense emotion over the whole movie by adding dramatic suspense sounds to scenes thst barely have any relevance or importance in the film. Overall, the movie just makes you feel nothing. Their characters don't develop, their emotions don't connect with the audience, the story is unnecessary stretched (this could easily be well protrayed on a 30 minute short film) and some actions are too farfetched to be believable. Wouldn't recommend it at all."}, {"id": 59, "text": "Is what it is. Not a blow your socks off movie, more of a hmm and ohhh I see and ah ok kinda movie. Meh-ish Ended up being a paraolympics movie not a paramedic movie (lol I crack myself up)"}, {"id": 60, "text": "Don't waste your time as I did. Throughout the movie, I was hoping there would be a satisfying ending. There wasn't!"}, {"id": 61, "text": "It took me 3 hours to watch this movie because I was so bored so kept pausing to look at my phone. I kept expecting more thrills and twists but it took more than half the movie to get there. The ending was ridiculous. Shouldn't he be in some sort of prison hospital? And why would she want to 'look after' him even if it's to slowly torture him?"}, {"id": 62, "text": "I'm not sure what this was suppose to be or if it even had a point. A kind of thriller/horror , we are introduced to an unlikable character, who grows more unlikable and unstable as this preposterous movie progresses. It does help that the lead actor, Mario Casas is excellent in the role, along with being attractive, but are we suppose to root for him ? The dialogue in the film is really lame , although it is well shot. There are scenes that are just people acting stupid and none of it is believable, which is typical of bad horror when the writers have no idea where to take the story. It's was interesting to see a movie made from the nutjob's point of view, but the movie has very few suspenseful scenes and just kind of meanders along going in different directions and throwing in some cruelty. Really only worth it for Mario Casas's performance."}, {"id": 63, "text": "Acting was superb; story was nice but unfortunately there was nothin original about it."}, {"id": 64, "text": "This movie is so boring and lame, that you would do better watching the grass grow. A paramedic becomes lame and bound to a wheelchair, while planning revene on the girlfriend that left him. Does that sound like entertainment? NO. Yet another Netflix bore."}, {"id": 65, "text": "Didn't find the imdb rating first cz of the Swedish title dödlig medicin wasn't matched with the international title, and I'm happy I didn't see the current 5,6 with these 38 reviews from awkward people. It's a masterpiece, should be rated between 7-8, and I think the rating gonna land on 7-8 after few days. Everyone gonna enjoy watching it. Everyone should watch this movie."}, {"id": 66, "text": "There are just 2 main characters but they couldn't even develop their characters. You hate every single character in the movie so you are not going to feel sorry for anybody. If I were you I would watch this film to laugh. It is not thrilling at all."}, {"id": 67, "text": "I just like the if this movie! Especially the end, it makes you feel that revenge is not worth it.."}, {"id": 68, "text": "I think it is a stupid movie and a waste of time. I would not recommend anyone to watch it and I can't understand how the rating is as high as it is."}, {"id": 69, "text": "This kind of movie kinda repetitive but at least the excitement of this exist. Good to kill time and not too bad for this one."}, {"id": 70, "text": "Nice try guys, don't let anyone tell you 'you can't'. But maybe they can dedicate themselves to something else."}, {"id": 71, "text": "Love is scary A sentence that describes this film fits. The film is talk about a paramedic who was paralyzed in an accident, was abandoned by his girlfriend because of stalking her.The Paramedic itself has an interesting story but unfortunately this film is a little confusing, maybe from the editing team or the scriptwriting team who are in a hurry so that the transition from one scene to another is rough and too fast.Mario Casas' acting is quite good, but unfortunately Mario Casas has not fully immersed himself in his role during the stabbing or his role as a paramedic working in the field.As a suggestion, it is hoped that the actor can learn a little about how to handle a certain patient so that his acting can be better."}, {"id": 72, "text": "Started good but went down hell really quickly, very disappointing"}, {"id": 73, "text": "All over the baseline. acting,filmo,edit and score are without comparision. exciting and volatile avenge and revenge thriller.a good watch thinks the grumpy old man"}, {"id": 74, "text": "Not bad but way too slow paced. I skipped through most of it after the first big plot point. Wasted potential. Could have been excellent."}, {"id": 75, "text": "I see The Paramedic as a mixture of 50 shades of Gray and Knock Knock: boring, toxic and without any transition."}, {"id": 76, "text": "A film with Poor script and poor direction .. The movie doesn't surprise or excite you."}, {"id": 77, "text": "It reminded me of an Almodóvar film (Tie me up!) I dare to assert that Mario's acting is going to be always awesome, and this is not the exception. It could be interesting to watch, (if you have not better plans)"}, {"id": 78, "text": "This was fast paced and gripping from beginning to end. The acting was rather surprisingly great also. Definitely watch, if you want a good thrill ride type movie 🍿"}, {"id": 79, "text": "That's an hour and a half I ain't getting back. I don't normally regret watching movies, but this one is the exception. Mediocre."}, {"id": 80, "text": "Well acted. Didn't realize the ending would as dramatic. Kind of leaves you hanging in the end."}, {"id": 81, "text": "Mario Casas did it again! Fantastic performance! I became a fan of his after seeing him first in Contratiempo. He really is very talented. I loved him in this movie as well. Great plot, a lot of twists, kept me guessing and wondering what his character would do next."}, {"id": 82, "text": "The story is not good, the script is not good and the end is predictable. Don't waste your time watching this movie."}, {"id": 83, "text": "09/23/2020 It's just a decent well acted movie. No thriller, no suspense, just a guy who refuses to let his girlfriend date other guys and get pregnant. Anyway it's a Spanish movie and the main character who I am gonna call Stanley because he's no angel. It's not widely known butt Stanley was the first guy who ever entered the running of the bulls in a wheelchair (it's Spain you know?) and intended to outrun them in his wheelchair. Unfortunately he failed, much like his crushed wheelchair. Anyway, in the aftermath he had a bad headache and went to the hospital, not only for the headache but to get his wheelchair repaired. By mistake Stanley was given a lobotomy. Better call Saul. His old girlfriend wanted to come see him but was all tied up at home so he stayed in the hospital until his chair was fixed (not his head) and some of his memory returned. He still wanted to run with the bulls much like I'm doing right now butt upon wheeling out of the hospital parking lot he was struck and run over by a herd of reindeer on the evening of December 24, 2019. The driver, a big fat man with a red whiskey nose was sentenced to 5 years in prison for drunk reindeer driving so I ask you? Do little kids cry when Santa is a no-show? This may be a true review or perhaps? it's knot? Not a bad movie, I enjoyed it and suggest that you at least might give it a try? Bon Appetit'"}, {"id": 84, "text": "What can i say? an excellent, tantalizing creep-fest dripping with a somewhat subtle sense of ominous dread during the first 60-70% of the movie. i'd say it's rather equivalent to the netflix series 'You' in terms of creating an anti-hero that you can't help but feel sympathy for despite the obvious rapid evolution in said anti-hero's moral decay. the film does a great job at piling on the indignities upon the main character in such a way that when he finally snaps, you experience a kind of definite catharsis within your schadenfreude after you sense that it's finally time for the main character to experience a small, sweet taste of justice.unfortunately, what starts out as a magnificent, white-knuckle build up boiling over with myriad possibilities at just how our main character can taste revenge, it devolves into some yawn-inducing, cringe-worthy orgy of cliches that has our dark and brooding anti-hero collapsing into some whiny craven shell of a man that plays out like an entirely uninteresting and horribly dull shade of Norman Bates.a definite skip, unless you enjoy pointless time sinks and the bleak, sinking feeling of utter disappointment and compounded aggravation exacerbated by idiotic character behaviors/poor writing/just plain ol' terribad movie logic.Watch 'You' on Netflix instead, or the Korean revenge-horror film Bedeviled (not only is it an epic revenge film akin to other genre greats like 'The Piper', it's a surprise splatterfest damn sure guaranteed to sate any revengenerd/gorehounds cinematic bloodlust)."}], "reviews_amount": 85}