{"name": "The Wolf of Snow Hollow", "titleId": "tt11140488", "reviews": [{"id": 0, "text": "An unusual and unexpected film but a good one. It's more of a character study than a mystery or horror film. There were a few great funny moments but I would not have labeled it a comedy, more of a drama really, but not a wallowing kind of drama. It's snappy and moves fast and kept me engaged until the end. Riki Lindholme is great and Jim Cummings turns a character who might have otherwise been insufferable into one who can still evoke sympathy. A thumbs up from me."}, {"id": 1, "text": "Yes its slow, yes its quirky yes its a fantastic yarn. If you want Lycan action watch Underworld dont poo poo it because a trailer mislead you and then cry wolf in your review. Watch for over the top characters reacting to ott horror, perfect little Halloween treat."}, {"id": 2, "text": "The effects were great. The directing was competent. The writing needed work, as the story misfired and meandered, defied logic, and had a random reveal that seemed to have little to do with the investigation/clues that had preceded it. The acting was great, with one exception: Jim Cummings, who destroyed every scene he was in - I can't tell if that is the way he normally acts, or if it was a choice, but it was bad. Other reviewers have mentioned comedy, but I found absolutely none (not that I needed any). I'm a werewolf movie fan, and this could have been so good (every attack scene was great). To the reviewer that asked that no more werewolf movies ever be made - that's just daft; you may as well say to never again make a vampire movie, or a drama, or a comedy, or a horror, or a movie about a hit-man, etc. Bring on more werewolf movies - just make them a better."}, {"id": 3, "text": "After coming to terms with the hammy Cluedo acting and embracing it as part of this films ample charms I didn't want it to end. When you get past the flamboyant performances which will irritate you in the beginning you find yourself totally immersed in Snow Hollow and the grisly murder spree taking place. There's a hint of Fargo and a sprinkle of X Files all stirred in together to make a great little horror/mystery that had me guessing right up to the brilliant ending. The compact setting of a frozen small town suited the characters and killings perfectly, the Werewolf was done brilliantly as well, not just some tall bloke in a furry suit,,, pull the curtains and switch off the lights, don't over analyze the dialogue or characters and you'll have a great time."}, {"id": 4, "text": "A alcoholic lawman with severe personality issues and his department are in a race against the clock to apprehend a vicious killer, who strikes under the watchful eye of the full moon.This film turned out to be a true gem, brimming with great character work, a simple yet solid story and just allround beautiful work both in front as well as behind the camera.It also incredible refreshing to see comedic elements that doesn't smother the drama/horror tropes of the story (as is the case with so many features of this kind) but actually enhances the films overall effect.Top that all of with a great looking Lycanthrope - albeit a very sparse look - and you got yourself a real winner.Hope you enjoy it."}, {"id": 5, "text": "The movie definitely wanted to be Fargo, with perhaps a little Shaun of the Dead tossed into the mix. In some places it tried too hard, and came across as forced. Other places worked pretty well for me, like one of his arguments with his daughter, and his fall off the wagon from the stress.I wasn't bored, didn't wish I'd turned it off, but I also forgot most of it once the credits rolled.However, I did like the reveal at the climax. I appreciated that."}, {"id": 6, "text": "Funny and entertaining. Good job Jim for starring and directing this movie. I enjoyed it a lot."}, {"id": 7, "text": "Solid character driven movie. Humorous, good pace throughout and just the right amount of suspense. If you like movies like Club Dread and Shawn of the Dead this will probably tickle your fancy."}, {"id": 8, "text": "The film was bad. But that wasn't really the problem. Problem was that it wasn't bad enough. Lead actor, who was also director and writer was terrible. Truly. Not a single ounce of charisma. Plot, directing, character work, all hovering between bad and mediocre. In essence they should have double down one how bad the film is (and how bad the lead actor is). Make it so bad it's good."}, {"id": 9, "text": "Watching a little part of the trailer, I expected this to be a good movie. It looked right, but it felt stupid. We had a hard time getting trough it all. That police-guy-wanna-be with anger issues (Jim Cummings) just destroyed the whole movie. But hey, the joke is on him, he made this turd. If it had been in the same lane or quality as Super Troopers, I would have laughed. But this was a failure imho.Next time I see the name Jim Cummings on a movie (thinking about a porn actor) I will stay away and not spend a cent or any time watching it.All that being said, I'll give it 4/10Because it's actually better than any of the latest Steven Seagal movies!"}, {"id": 10, "text": "The synopsis is like a thousand others before it: small town, gruesome murders, emotionally challenged Sheriff and plenty of suspects.So what makes this one stand out you may ask? Well, in all honestly, nothing.But, the acting is decent and the pacing is okay. This is completely watchable and I give it 7/10 just because the last 10 movies I watched were all absolute filth and during this one I never felt the urge to hit the pause button to stop the punishment."}, {"id": 11, "text": "This movie was both pointless and obnoxious. The main character just yells at everyone for 90 minutes. There is no werewolf so this is neither a horror movie or a werewolf movie. The premise makes it seem this is a whodunnit mystery but the killer ends up being a random person never mentioned in the movie until the end. Just absolutely awful. It looks like all of the positive reviews are just big fans of the filmmaker (not this movie) and want to give him praise. Do not waste your time with this movie if you're a horror fan."}, {"id": 12, "text": "It's hard to come across some decent horror flicks, so this one was a nice surprise. Light, funny and with some graphic moments.7/10"}, {"id": 13, "text": "Odd ball, quirky, opinionated....some of the terms I'd use to describe The Wolf of Snow Hollow.This film tries to create a subtly eccentric, strangely humorous vibe. Its expressed, in large part, through an odd ball Sheriff who, already carrying considerable personal baggage on his back, is suddenly tasked with solving a series of gruesome and bizarre murders. Indeed, the whole affair is presented as a bloody comedy of errors. Regrettably, its consistent lack of well thought through ideas and contextual bridges, see's the whole thing slowly sink, under its own weight.The films cause is not helped one bit by its rather opinionated attitude towards men either. Lazy, lacklustre, incompetent, reckless and uncaring. A few words that sum up the attitude towards the majority of male characters in this tale. One highlight is the Sheriff's horny daughter, sneaking out for a rendezvous with her boyfriend, in full knowledge of the curfew imposed by her father, the Sheriff, to keep people safe. She's then almost murdered by the killer but promptly blames her father for not caring, when he saves her. Its illogical nonsense like this, that further undermines this already conflicted effort.By the end I was left feeling depressed, irritated and puzzled by this odd little film. The only real upside being the consistently solid acting from the cast and some moderately watchable, if predictable, horror sequences.5/10."}, {"id": 14, "text": "The yelling and screaming drive you nuts, bad script and acting!"}, {"id": 15, "text": "Dumb, that's the result when you suffer from Narcissism and want to do everything. Does this guy Jim Cummings thinks he's Orson Wells or Clint Eastwood? Somebody (his mother, his wife, his friends) should tell him HE'S SUCH A BAD, BAD ACTOR. Directing and writing is better his way but do not star your own movies for Christ's sake! This movie isn't thriller neither comedy. He wanted to mix all genres and messed up everything."}, {"id": 16, "text": "Opening scene you are slapped in the face with horrible overacting. I had hoped it would get better after that, but hopes dashed. Maybe if they tried acting instead of over acting it would have been tolerable"}, {"id": 17, "text": "This is the worst acted movie I've seen in quite a while. I know it was meant to be a comedy/horror, but it was just so bad that it wasn't even funny. The acting and direction were terrible and the storyline was disjointed and stupid. I see what the director was trying to do, but it just didn't work. Maybe the star shouldn't have tried to star in and direct the movie, though in truth his acting was really, really bad and the direction was pretty awful too. All around a major disappointment."}, {"id": 18, "text": "This film tries so hard to come off as quirky, but the humor falls flat like 95% of the time. It still gave me a couple of chuckles, mainly from the late, great Robert Forster who is effortlessly amazing, but the editing and performances otherwise are nothing that will stand the test of time. I saw one reviewer saying it's like Fargo with a Werewolf, and the truth is the film WANTS to be Fargo but it's MILES and MILES away from the greatness of that film. It's like Fargo for Dummies. That being said, it's very difficult to write, direct and star in a full length feature film, so I have to give Cummings credit for that, but the film itself didn't do much for me."}, {"id": 19, "text": "Absolute garbage! I was so looking forward to this. Werewolf movies are always something I look forward to as they are my favourite movie monster. Very dissapointed"}, {"id": 20, "text": "Where to begin, horrific acting, terrible script, etc. Tries for comedy and ends up just being lame, except for the monster costume and effects, now that was funny! I can only assume most of the positive reviews are being posted by those who were involved with the production of this trash. I have read adjectives describing this movie like, good, brilliant, charming, gem, etc. I can only assume that these people are lying, or they have never in their lives seen a movie before. One person likened Jim Cummings to Orson Welles, really? Mr. Forster passed away in Oct. 2019, which means they delayed the movie for a year. Most likely because they new it was trash, but with everyone staying indoors these days, they figured to garner more viewers and decided to finally release it. Luckily I never pay to watch movies, even though it was free, I still didn't make it all the way through. I just couldn't stomach it any longer. For those of you who have to pay for movies, SAVE YOUR MONEY!"}, {"id": 21, "text": "These reviews are lies. This has to be the worst movie. Lame plot, horrible acting, weird uncalled for loud background music, elementary script and most importantly waist of my time and six dollars. Seriously, how did this get good ratings. Oh yea, trolls. You can tell that the whole movie written and directed by the same person. We went and googled it, yup. The main actor is the brilliance behind this amazingly dump of a film."}, {"id": 22, "text": "Movie is just plain pathetic, only a few glimpse of the werewolf, horrible background music at all times, end is badly twisted, time wasted."}, {"id": 23, "text": "This film annoys you as though someone is scratching on an old chalk board but imagine that sensation for how ever long this film lasts.The characters are caricatures of typical clichéd ones you find in those types of film. I get the writers wanted to write witty characters but their ideas/concept of said characters are as way off as Dr Frankenstein's vision of recreating humans from corpses. It may be forgiven, from a distance, to think they are humans but on closer inspection you see the abomination... This is what I saw from this film.Ps I fell asleep and woke up hoping it would get better but how wrong could I be?! The best bit is seeing the end credits."}, {"id": 24, "text": "Bad writing, bad directing, bad acting, bad editing. There's absolutely nothing exciting about this movie, even though the trailer seems to suggest otherwise.No one talks or behaves the way these characters do. Oftentimes something completely random happens for no logical reason whatsoever, like a grown man losing a tooth. If you view it as a comedy, you might be able to sit through it, but that doesn't mean you should.This movie cost me 7 dollars. You know what else I could've done with 7 dollars? Literally anything else."}, {"id": 25, "text": "It's a shame because the premise was great on paper. The movie comes off as more of a bunch of put together clips that has no transition. No back story. Worst movie in its genre I have seen in a long time."}, {"id": 26, "text": "Don't waste your time.If you can hear the dialogue over the awful music then good luck.Is it a comedy or just terribly done dark humour?Nonsense"}, {"id": 27, "text": "More aptly titled 'The Asinine of Snow Hollow', making reference to its spectacularly stoopid law enforcement officers, one in particular rather than any lupine deviant. You have to question how directors and producers view the intellect of their audience when they publish incompetence like this.You'll need several silver bullets to remove this taxidermied meleagris (turkey) from your memory."}, {"id": 28, "text": "No idea why this has anything higher then a 4, the acting is bad, way to much music in half of the movie and well.... i dont know what I've been looking at, just dont liked this at all. There are way better movies out there."}, {"id": 29, "text": "Acting, story, directing... everything just horrible. Had high hopes but every second that Cummings is on screen is pure torture.The entire movie is so bad it inspired me to write my first review haha"}, {"id": 30, "text": "Gems like these come far and few. They're simply not making films that are watchable to the end without insulting the viewing audience intelligence. A dark comedy thriller with a well knit cast, plot and climax. Very rare in today's market of sex, political correctness and cgi nonsense. A definite must watch for movie goers who appreciate a good story build up. Will be watching again sometime in the distant future. All the hate on the film are coming from silly douchebags"}, {"id": 31, "text": "I had never heard of Jim Cummings till watching this movie and now I am a big fan! He made this movie hilarious! Started off slow, almost turned it off but I stuck through it and it really picked up! Supporting cast were great as well. Just don't go into this movie with any expectations and you'll thoroughly enjoy it. Definitely worth a watch!"}, {"id": 32, "text": "You will watch this movie with the main character just yelling all over for no reason. I thought the title should be The yelling of snow hollow, seriously I do. This might be the movie with the most annoying character I've ever seen in my life, no offense. My suggestion just skip this one, not worth your time"}, {"id": 33, "text": "But the main protagonist just made me cringe i mean the effects were good the way they filmed it gave me vertigo"}, {"id": 34, "text": "Direction was great. The story was great. Jim's acting was really bad. I'm beginning to think he sent himself the wrong script instead he sent a comedy script. His acting stands out like a sore thumb. He should have sack his acting self day one. Otherwise I enjoyed the film, I personally think it not easy to make a good Werewolf movie."}, {"id": 35, "text": "Jim Cummings please make more movies like this your perfect as a troubled cop with family issues. R.I.P Robert Forster reason enough not to down vote his final movie."}, {"id": 36, "text": "The film is new, but filmed like in the 80s. What a tiresome film, with all the meaningless dialogues that make up the whole film. Probably dumber than a movie about werewolves yet."}, {"id": 37, "text": "I'm so disappointed with this movie as it was good until the last 20 minutes, which really let it down. I won't give any spoilers but the end completely betrayed the whole film and left me feeling... Why did I bother? No explanation and nothing entertaining about this. I gave it 3 stars as the first 50 minutes kept me entertained but then just garbage. I love monster movies and don't mind if the creatures are not that great but this movie gave nothing!"}, {"id": 38, "text": "I absolutely loved Thunder Road, but thought it might be a wonderfully quirky fluke, but he nailed it again with this one.It could be easy to miss how really incredibly nuanced his acting is because of the somewhat surreal feel to his scripts, but he's amazing. And if he isn't in recovery for real, then he deserves an Oscar.His external dialogue feels like what goes through my head both in this and TR when I'm heading for a relapse, so much so that for both of his films I've seen I had to watch them a 2nd time immediately after (and I've never done that before though a big film buff).Can hardly wait for the next! I hope he becomes huge... sometimes I'll find a director I like but don't want to share with the wider world, haha, I'm sure some folks know what I mean, but he deserves to be gigantic. He's a solid talent in all three areas (and I'm not big on director/actors usually, I still am scarred by The Two Jakes, *shudder*).p.s. Ignore the haters, just looking at some of the other reviews of those rating this low, they were to a person genre fans who I don't think understood this is a character study, not a slasher flick. And watch Thunder Road if you liked this, you won't be disappointed.TL;DR Thunder Road w/ werewolves? I'm in!"}, {"id": 39, "text": "Bad actors, bad script and story line. Most of the movie police officer yelling and depressed. You're lost on this movie."}, {"id": 40, "text": "Bad acting, dumb plot, barely adequate effects. Great scenery at least. Jim Cummings was pathetic and the supporting cast wasn't any better, with the exception of Chloe East. Chloe seems to have some talent so maybe she'll get a better role next time.Their attempt at a surprise ending was about as ham-handed as humanly possible. The final battle was so lame it was barely watchable. Truth - I only finished it out of a vain hope that maybe I'd feel like I got my money's worth. But no. What I'd really like is a refund."}, {"id": 41, "text": "I watched the movie and enjoyed it properly. The script was fine, the directing was solid, but while I was watching the nagging idea of protagonist miscast was present from the very beginning. A remote country town with always well shaven and perfectly coiffured sheriff? Give me a break. Even when he supposedly relapsed into drinking he still looked exactly like excellent contemporary big city metrosexual. I understand that some of his weird mannerisms were supposed to indicate comedic moments in the movie, but I personally never bought them. They looked misplaced and badly acted by Jim Cummings. I have no problem with other actors in the movie only with the protagonist. I gave it 6 out of 10 because of that."}, {"id": 42, "text": "This movie is not horror nor funny,acting of casts is ridiculously dull and monotonous. the story cliche."}, {"id": 43, "text": "Sorry to say, but it got so droll watching this dude do his thing, over ... and over ... and over ... and again ... and again ... and then again ... that I finally just fast forwarded to the ending! I couldn't stand watching him anymore! This film strives to be something but just never quite gets there. An ultimate waste of a LOT of talented acting."}, {"id": 44, "text": "Okay I'm not really sure how to rate this cause its 50/50..It could be better though.. This is my first time watching Jim Cummings performances.. He is a handsome guy I would say.. Everyone says he's good. And since he's the director, writer and stars in this movie, I got a lot of expectations when watching the trailer.. But he was talking way too much and other cast too, which kinda annoying lol.. The actions are pretty good though.. Storyline and paced are good.. Overall it's a small budget film, so you can't hope too much.. #p/s spoiler: What's the deal with the ending ? Is he ??"}, {"id": 45, "text": "The script and acting makes this a light, very watchable horror flick. Rare to find these days 👏🏽👏🏽👏🏽"}, {"id": 46, "text": "The main character of the film just comes across as goofy and awkward. I don't understand the point of him or his relationships with the residents of the town. He is completely unlikeable and comes across as an a hole. Jim Cummings is a very handsome man but his acting here, his portrayal of this character tonally, just doesn't add up. It's a big miss. A big mess.For a horror comedy I found this film to be neither scary nor funny. There are moments in the film which I feel like are supposed to be comedic but the laughter just wasn't coming. It's a bit try hard. A real shame for me because I thought the trailer was very promising and I was excited to see it. Quite a let down."}, {"id": 47, "text": "Its all over the place and its not a werewolf movie for those hardcore werewolf fans...it was a total let down for me...."}, {"id": 48, "text": "What a total mess, if you think this was a comedy horror, you're just wrong. The comedy is painful specially for the lead actor. The horror is; wait there was no horror or suspense.The wolf is just OMG.Bad by all means. Acting, writing, story, cinematography. Not a single one good thing about this movie."}, {"id": 49, "text": "Watch this!! I didn't know what to expect at the start but once it got going it didn't disappoint. It was a wild ride of laughs. Main character was awesome!"}, {"id": 50, "text": "It's horror, with some genuinely funny moments. It's smart like cummings other stuff. I think it could have benefitted from some likability in the main character but that was probably intentional, i just would have enjoyed it more.The four stars went in with a lot of expectations i guess, because nothing in this film deserves four stars not even the cgi which i was impressed with for such a small budget."}, {"id": 51, "text": "I'll be honest &amp; say I wanted this to be so great. Werewolves are undoubtedly my all time favorite monster... if you love them as well, you are painfully aware how rare it is the movies get made now, &amp; even less rare that they are even OK, let alone good or better...That said, I tried so hard to make excuses everytime my mind said this sorta sucks.. but in the end..I had to face reality.It wasn't that good. The pacing &amp; tone were almost dreamlike, &amp; not in a good, nor intentional way. The movie cuts randomly from attack scenes to scenes hours later. The father/Sheriff was just ...he was too weirdly written (not the actors fault I don't think) it felt as if he was supposed to be seen as kind of an incompetent goof...? But also not...? Every scene he is in is bizarre, because almost every line feels like it could've meant to be a joke, but nothing at all done in a joking fashion. This only happened with him, no one else. Everyone else was played very straight, but he was this 'out of his element' goof even in the most serious of scenes...it just came across as too weird for me.The werewolf - the times we see it, it's great. Which isnt often but it's good enough...but with the twist (which I saw a mile away) it leaves obvious plot holes..At the end I'll give my biggest issues, for now... here's how I'd rate it:Story: 6/10 (done to death, but it was fine) Acting: 7/10 Cinematography/Quality: 10/10 Horror: 4/10 Comedy: 2/10Overall, if you just love horror...I could see you hating this. If you love werewolves though, you may enjoy it.SPOILERS AHEAD!!!The wolf turns out to be this somewhat random, very tall, thin man. He just wears a wolf skin basically, okay.. fine... but the police got reports back saying the victims were CLEARLY attacked by a large WOLF... due to the wounds, &amp; bites. These people do this as a career, they aren't going to mistake some knife/weapon for a specific animals teeth. That's giving the film extra credit because we aren't even explained how he did inflict these wolf like injuries. So..How did the victims have clear animal injuries?How did the man vocalize very distinct wolf howls?How was it the only man in this SMALL TOWN who is around 7'0+ tall able to evade being any sort of real suspect, when the only lead anyone had to really go on was that the suspect was VERY LARGE?Why was he cutting off specific organs/parts of people? They made this kind of a big thing, then I didn't see it explained.How was this man (who was in no way muscular or powerful looking) while donning a wolf costume able to generate enough speed &amp; power to ram into a TRUCK DOOR, &amp; Cause it to lift several feet into the air. Then punch through a window of it no problem, then evade the Sheriff firing shotgun blasts... while leaping from car to car, &amp; escape?I see those as not just questions unanswered, but loop holes generated by having it be a human.Also, what's the drinking deal? Never explained.It almost feels rushed, or like many people made the film instead of one vision.I wanted badly to love it, I ended up pretty let down... will never watch it again, but not sorry that I saw it. It was ok."}, {"id": 52, "text": "Very subversive. Main actor does a good job presenting the false infallability of men. A lot to teach and feel, not so much to see and laugh at. You end up laughing at yourself seeing the flaws that we disguise as personality traits"}, {"id": 53, "text": "What a solid movie until the end. I'm the biggest werewolf fan and good movies don't come around often. The movie had me drawn in and on the edge of my seat through the attack scenes and at the end when he was in the taxidermy office. Literally all that needed to happen was for the taxidermist to change into a real werewolf since it showed a real werewolf through the attack scenes it's eyes even glowed. But then it's going to show this guy with a cheap costume on halfway and doesn't even have the head piece on smh! I had my faith restored in another good werewolf movie this day in time but was crushed at the end of this movie! Don't make a werewolf movie without a real werewolf!!!"}, {"id": 54, "text": "One of the critics on Roger Ebert's website wrote a really good review on this film. He must of been watching something else. This movie sucked. The film is labeled as a comedy/horror, but it was neither funny or scary. The acting was terrible and the story was just as bad. Pass on this one. 4 stars from me 👎"}, {"id": 55, "text": "I was thinking how much I would have enjoyed this movie, if the camera was never on Jim Cummings. I'd like to edit every scene that has Jim Cummings in it, and I'm betting there's a decent B-movie underneath it. The acting went well, except of course for Jim Cummings gigantic lack of talent. There was a fairly good creature effect established, and some nice cinematography with the wide shots - large background scenes, and use of light &amp; shadow. It falls flat when it came to the comedy; some of it such as Sheriff Hadley played by seasoned actor Robert Forster went smoothly with the dialogue &amp; scenes, but then Jim Cummings ruins it with visual comedy. It's clownishly dramatic. You sit through a lot of long camera shots of Jim Cummings shouting things and being buffoonish. Every extended close-up of Jim Cummings made me want to punch him in the face. The film is bluntly a venture to showcase Jim Cummings, as it is directed by Jim Cummings, written by Jim Cummings, and stars Jim Cummings in the lead role. He makes this film unwatchable and brings (we) reviewers into play, because we MUST warn people about this terrible movie. I felt it my duty, because 'The Wolf Of Snow Hollow' is generously presented as an above-grade feature, and you might be deceived for the first 20 minutes, before Jim Cummings screws it all up. Don't waste your time with this one."}, {"id": 56, "text": "It takes me some great amazing humour to even get a whimper of a chuckle out of me. I think the moments of comedy were stitched in perfectly and was complemented by the quirky music score. I'm not understanding how some reviews were so opposed to Jim Cummings performance. I thought it was great, definitely seemingly excessive in the beginning but fit right in and was solid. I also super enjoyed Riki Lindhome's portrayal of her character. There was something familar about the character, but just can't see to place it. Demetrius Daniels and Skyler Bible were also super great. Even the extra's in the background were good. Some pretty awesome directing there. What was up with the snowboard instructor look when she's sitting with her students? Right at the camera? It doesn't seem to fit, nor believable that she would go explore the sounds in the forest beside the road. Such an overused cliche in the horror genre. The next scene had me forget all about the silly moment and camped it up greatly with the comical tunes. It had a classic comedy tone that fit so perfectly with Jim Cumming's performance."}, {"id": 57, "text": "Yeah just don't, save yourself and go watch Sesame Street instead"}, {"id": 58, "text": "Bad acting, bad story line, just plain bad movie. Sorry I wasted $2.00 renting this. Felt like a complete waste of two hours of my life."}, {"id": 59, "text": "This movie stumbles around like somebody wrote three different stories, and got the pages mixed up. It could have been a good werewolf horror, or a funny comedy horror, I can't tell which it was though. Jim Cummings was difficult to watch because you couldn't tell if his character was supposed to be funny or serious, because he was neither. His acting, and the jumbled, undeveloped side stories, distracted me from the actual main storyline. Not worth the time."}, {"id": 60, "text": "I am utterly baffled how this movie has such high ratings. I could not even get halfway through the movie. The acting is so utterly awful. This is such a B movie. The title has you thinking that it's a horror movie yet the music and the acting leaves you feeling like it's supposed to be a comedy.It is extremely disorganized and confusing there are constant cutaways to different scenes and it just leaves you wondering what the heck is going on.This is a perfect example of the directors ego being so big that they think they can not only direct the movie but act in it too, even when they're acting stinks to high heaven."}, {"id": 61, "text": "I love these type of movies. Bloody, winter setting, beautiful scenery... but the director, writer, actor? needs to relinquish some duties. He overacts in every scene and creates ridiculous characters. Any other actor in the lead and i would up this a few stars but i cant get passed his ineptness"}, {"id": 62, "text": "First off the lead actor made the movie almost unwatchable. He isn't a good actor and it took away from the film. Some of the werewolf effects were cool but the ending ruined all of that. I definitely won't be watching this one again. Not worth the rental fee."}, {"id": 63, "text": "Jim Cummings overacts and his fizzog is rather off-putting and really rather irritating much like Jim Carey - Fail#1.Then there is the inappropriate and overbearing music dropped in at the strangest points presumably for comic effect - Fail#2.Crude and dull dialogue and crucially not very funny - Fail#3Please, no more werewolf movies; it is a worn out hoary old chesnut now and this movie really bludgeoned it to death!"}, {"id": 64, "text": "This is the type of movie that is so bad it's actually annoying. It is not a comedy just an absolutely awful movie. The dialogue is excruciatingly awful. Clearly made by an untalented group of people."}, {"id": 65, "text": "I always see two kinds of movies, no matter what: howlers and sharks. Or more correctly, I always saw two kinds of movies. Not any more. Not after something so bad. I'll have nightmares about bad acting. Of the rest, I shall not speak. If I could give it a fifth of a star, I would."}, {"id": 66, "text": "I really like to know who rated it more than 1? And why? It's none sense piece of sh*, terrible acting, terrible actors, weak script, awful directing ... I couldn't even stand it more than 20 minutes."}, {"id": 67, "text": "What an overacting piece of crap. WTF did i just saw and how does it has so good reviews. I m big werewolf movie fan but this movie is a total Crap.WTF . WTF. WTF i cant even say over acting. To over act you need atleast a little acting. The actors are soooooooo bad that it ll make you slap yourself for ever starting to watch this movie."}, {"id": 68, "text": "It's an okay movie, but my word, the lead actor (character of John Marshall) is utterly awful. I've only seen one other actor who had a bit part in The Handmaid's Tale that was worse. Out of curiosity, I looked up who that was ... it was the SAME GUY. He played Burke in Season 1 Episode 3, and he was awful.Anyways, I could barely get through the movie. Plot meh. Acting meh to terrible. Plot meh. Visually, it's appealing to watch. I didn't find it overly compelling."}, {"id": 69, "text": "Started off promsing but falls apart too fast, the acting is awful just awful. It has no purpose and its not even funny I don't know what this movie was trying to be but it sucked big time."}, {"id": 70, "text": "Movie just felt like a joke to me.. some parts came off with some suspense and other parts flat. Oh and the sheriff (Jim) tried too hard. It just became forced.. his anger issues were annoying to say the least and he came off as wanting to be Jim Carey or Aston kutcher so bad. I just wanted the movie to end so I know it's no longer on my list of must watch. Overall just glad I am done with it. Not planing on watching it anytime soon."}, {"id": 71, "text": "What the h with the robotic narrator?! Its 90% in the movie, so distracting and ruined the movie, totally unwatchable and painful to listen to. Sucks big time. 1/10."}, {"id": 72, "text": "Jim Cummings' character is confusing and almost unbearable, I can see why the writer and director had to play that character. Other than that, this is a pretty good dark comedy. I didn't have any expectations for this movie and I wasn't disappointed. It was the main character that made me give this movie 5 stars."}, {"id": 73, "text": "I kept wondering why would someone make a movie this correct and choose a main character who can't act and a director who doesn't really know what he's doing. Then I realized the director, the writer and the main character are the same person, and that's never a good idea. It's a shame, because the movie has potential, but it's totally wasted by the bad acting of the one character that's supposed to carry the movie."}, {"id": 74, "text": "It's a shame this was one of the last Robert Forster was involved in as he deserved much better. Jim Cummings is out-acted by everyone in the movie to include his character's daughter; and I'd argue by a few of the dogs in the movie. I can appreciate a B horror for what it is and give them a pass; but this does not even deserve that much. It's just garbage."}, {"id": 75, "text": "Jim Cummings, who wrote, directed and starred in the movie manages to single handedly render it unwatchable.He wrote a passable script, but had some directing flaws and his acting just kills this movie. He is way too over the top in most of his scenes and seems to have been absent the day they taught subtle nuanced acting in class. I'm not sure what his thought process was, but with his bad acting most of his scenes were him screaming dialogue.It's unfortunate that this was Robert Forster's last appearance on screen, though his few minutes of screentime were good.Not Recommended"}, {"id": 76, "text": "Whilst pretty and well shot, this movie falls quite hard due to a miss match of horror with unfunny comedy and a skittish script that meanders around itself.This before not too long becomes irritating to watch and ultimately to leaving the room before it is over.2/10, needs a lot of work on the script and acting."}, {"id": 77, "text": "Directed by.... written by.... starring...JIM CUMMINGS! Not the best actor but I can tell he tried. This guy hopefully will check his ego before he is given funding again for another werewolf movie or maybe he thought it was cheaper to have himself in it but directing yourself is NEVER an easy task unless you absolutely have to because an actor bailed at last minute. That being said, I am sure he learned a lot from this. Also there is a sweet reveal in it that I don't think I will forget for a long time and I appreciate that! Having a good reveal gains my respect."}, {"id": 78, "text": "Jim Cummings did it! All credits to him... except for acting. Maybe the narcissism was too strong to choose a better actor, so I hope Cummings can overcome it. Better acting would take the film to the next level, and I hope next time that happens.Suspense, enough thrill, well developed characters, excellent directing. Watching it with my wife on Friday night was very enjoyable... for me... she fell asleep!"}, {"id": 79, "text": "If you want something on to watch while doing other things (like gaming, cooking, whatever) then this is a good choice.If you are watching this with no distractions you will likely be disappointed. The acting is terrible (the young stand in sheriff is so overacted its comical)If this was meant to be a comedy it would work but if you are meant to take it seriously then you will be disappointed.I love werewolf and horror movies but this was really just so-so"}, {"id": 80, "text": "Looks like it was filmed on a Samsung smartphone from 2012. Zero depth or color. The writing is trash... actually it's all trash. The only thing that made me start watching this is the key-art, great movie poster."}, {"id": 81, "text": "It jumps from brutal murders, to a cop with anger issues starting fights, to an ending based on very little. I've read Twilight fan fiction written by teenage girls with a more substantial plot than this. If you've ever watched the TV series Hannibal - they did it better. A very sarcastic thanks to everyone who rated this film &amp; made me waste 1 hour &amp; 24 minutes of my life. I know the exact time because, even during a lockdown, where you'll find ANYTHING to do, I felt EVERY one of those damn minutes painfully tick by."}, {"id": 82, "text": "Maybe it's a bit over the top in and there. There's a part of me that thinks it just misses and another that thinks that's the point. Either way it's a commendable effort in my book.It's campy, clumsy, thrilling, and hilarious. I was not aware of Jim Cummings but I have a feeling we'll be hearing more of him. And of course it's great to see Robert Forster. He will be missed.It's not for everyone. But it worked for me.It works if you work it."}, {"id": 83, "text": "Good Lord not even on a rainy Saturday afternoon is this movie enjoyable acting is just horrible goes to show you a hot body just can't make it to an hour and a half to keep my interest."}, {"id": 84, "text": "I'm 30mins through this. Haven't seen Jim Cummings or his work before. He seems like a great actor and director. Jim is going to be big..."}, {"id": 85, "text": "Fill in the phrase: A young couple goes to a cabin to spend the weekend when.... Yes. More of the same ridiculous plot a 'horror' movie, like the other thousands you already watched. Sad for Robert Forster to be on this one. Avoid this movie and go watch something better."}, {"id": 86, "text": "This film start with a couple(PJ and Brianne) went into a house, and PJ arguing with a man at the restaurant scene! As turnout, this film is about finding out the mastermind of killing a bunch of innocent girls! The mastermind actually is a werewolf disguise as a taxidermist Paul Carnury! Entire film full of boring conversation, and annoying overuse scene! Such as, overuse of the arguing scene, overuse of the TV announcer scene, overuse of the dining scene, and overuse of the staring scene! Make the film unwatchable! Barely intense scene is, John killing Paul with several shot at the head! At the end, after killing the mastermind, John visiting his daughter at the college! That's it! Another disappointed film!"}, {"id": 87, "text": "This movie was great!!!! recommend!!!! Great acting! Thanks!"}, {"id": 88, "text": "After Thunder Road, This was a must watch for any Jim Cummings fan."}, {"id": 89, "text": "You can tell Jim Cummings is a newbie to film because the guy has his name in the opening credits 4 times! In case you didn't know, he directed it, wrote in it, and despite having a more famous actor in this get's top billing as ACTING in it too. Any professional in film knows not to give yourself so many top credits like that or put yourself first because it makes you look inexperienced and vane.The film itself is fine - it's got great cinematography for a low budget film. The actors are really good and natural. The story is predictable."}, {"id": 90, "text": "This film could be good if ; there was a real werewolf (it turn out to be just psycho in a suit) , if acting from Jim Cummings was not like he took too much cocaine and acted like hysterical teenager for most of the film. For me the greatest dissapointment was that mystical element was not there and then totally gone after it was revealed that killer is just psycho in a wolf suit and also quite bad neurotical acting by JC. He might be able to act but not in this film. Beautiful mountain intro was promising too much."}, {"id": 91, "text": "You take a huge chance on wasting yo ur time with films wasting your time these days. I was really hesitant to sit and watch this. 2 reasons I did: I like Robert Forster and it's about werewolves. It has its faults ( the comedy aspect) but the music, acting, cinematography, location &amp; story are all good. The running time is short at an hour and 24 minutes but that's also a plus being that there's little filler and lull. The ending was a pretty good twist but kinda taken from Manhunter by Micheal Mann with the villain bearing a creepy resemblance to Tom Noonans character."}, {"id": 92, "text": "Nice fresh enjoyable effort. But Mr Cummings should stay behind the camera. I mean if u really want to, do a cameo. Jimmy Tatro would have been a much better choice."}, {"id": 93, "text": "The movie gives a feel of cheap B or C grade movie. The story line is meaningless and struggles to decide what it wants to really show? The main lead actor's acting is really pathetic. He just keeps screraming at people for no apparent reason.Movie really drags at slow pace and eventually crashng down."}, {"id": 94, "text": "I voted 2 stars just for Robbert Forster, but the movie was miserable! Less than an ordinary movie, nothing attractive! The same story from the beginning of the life! Boring as hell, I felt like I'm in KG"}, {"id": 95, "text": "A very oddly edited movie. Most of the scenes feel strangely disconnected from each other. Sometimes I was wondering if it was supposed to be some plot twist towards the end to show that some of the scenes were flashbacks, but no, they are just disconnected. Perhaps the editor had limited film to work with, but anyhow, this movie is safe to skip unless you're very bored."}, {"id": 96, "text": "The main character, as well as the other characters, were unpleasant and very foulmouthed, The acting was atrocious and the writing sucked over all a reall cheap and bad movie. James Welch Henderson, Arkansas 12/23/2020"}, {"id": 97, "text": "So low ratings came from people who don't get it, that this movie is not serious. It's a pretty dry comedy and delivers really great. I love the protagonist (actor), I' remember him from Thunder Road which is even a better comedy than this one (highly recommended).I'm giving this movie a high rating because it deserves it. Pretty casual yet fresh as frog and well acted. Don't take it seriously and you'll start laughing (hopefully). It doesn't really have a strong atmosphere for a horror movie, that horror indicator is only because of the plot which isn't that main catch here, it's the protagonist and how he's dealing with stuff. Also some great deep lines were used here which is just making fun of this whole movie."}, {"id": 98, "text": "The lead man totally ruined the movie. He can't act at all. The rest of it wasn't bad but he just made it ridiculous"}, {"id": 99, "text": "This movie reminded somewhat of the 1974 made-for-television movie, Scream of the Wolf. A small rural community is plagued by a series of savage murders that some locals begin to attribute to a werewolf. There were no comedic elements to Scream of the Wolf, however.I'd read both positive and negative reviews about this movie before watching it, and after having seen it, I can see points made for either case. I'm a sucker for werewolf movies, and so I did harbor at least some measure of high hopes for this movie. On the whole, however, Scream of the Wolf took the same basic premise and did a better job with it 46 years ago.In the case of both movies, the killer turned out to be human, and not a were old. In Scream of the Wolf, the killer turned out to be a big game hunter who had been called in to track down the murderous beast. In The Wolf of Snow Hollow, the killer turns out to be the reclusive local taxidermist.In both movies, the actual killer turned out to be unusually tall and strong. In the 1950s, 60s, and 70s, the epitome of the tall, burly character actor was Clint Walker, who stood in the area of 6' 6 and weighed somewhere around 250 to 260 pounds. The taxidermist in the Snow Falls movie looks to be a bit taller than Clint Walker was, but he isn't as heavily built.Being as I was hoping that the killer was an actual werewolf in the case of both movies, I was let down by the ending of each. Both are okay, and worth a watch, if you can view them for free."}, {"id": 100, "text": "Werewolves thriller plus comedy wanna be? Resulted a horrible thing, and Jim Cummings was the worst of all, hysterical all the time, I really stopped watching. Too bad for all money and other actors efforts spent for nothing."}, {"id": 101, "text": "First, let me start by saying I am a HUGE fan of werewolves &amp; werewolf stories are my favourite horror sub-genre, movies or books. About ninety percent of werewolf movies that are made are just downright embarrassing &amp; is why good production money for lycanthrope movies always get passed over for the countless, garbage vampire &amp; zombie films that seem to be an automatic green light. One of the reasons for this is because it's so hard to get the most important thing right, the werewolf. Well, it shouldn't be that hard with all the CG wizardry available today but these film makers don't have the passion for these creatures to give them the showing they deserve. And practical effects seem to have strangely gotten worse over time since American Werewolf in London. But this movie nailed it. I really wasn't expecting the werewolf to look any good. Disappointment was almost guaranteed whenever I sat down to watch a werewolf flick. But the first time they showed the werewolf in its full glory after it had just ripped the woman's arm off, I literally jumped off my couch &amp; gasped. It was beautiful! I hadn't had excitement like this since the Underworld movies &amp; more recently Howl in 2015. The second time they showed the beast was even better. It was huge, muscular &amp; menacing without the usual token roar whenever a monster is introduced in movies. It just stood there in all its into intimidating glory, just staring. It was what it should be, scary as hell. Not just some overgrown guy in a suit looking like a rabid Wookie. (I'm looking at you Late Phases) And this is why I'm so conflicted with this movie. Because someone finally got the werewolf right, but it wasn't a werewolf at all. Forget that even though the ending doesn't explain how this terrifying, realistic looking creature, standing on digitagrade legs, ripping people's limbs off is actually just a man in a suit. If this WAS a real werewolf movie, it would have easily been one of the best ones to come out in years. Instead they decided to go for a Scooby Doo style twist &amp; now a movie that up until the last 15 minutes I thought was going to be one of my favourite werewolf movies became just another run of the mill who dunnit. It had everything going for it, good acting, good directing, fantastic looking creature &amp; then they just threw it away. Deflating."}, {"id": 102, "text": "I have no complaints with this movie. good script funny jokes. Good acting. B movie but definitely worth watching."}, {"id": 103, "text": "Great movie! Lots of familiar faces. Suspenseful with humor woven in throughout, so pay attention. Very surprising ending! Can't wait to see more from this talented team!!"}, {"id": 104, "text": "Then this is a fantastic made , produced, acted and funny directed film , that seems to come out of nowhere in a hollow trench of snow upsomewhere in the god forbidden isolated state of utahhta-ta-ra-ta, in the beautiful, strong and great united states of america where it blows so much from right and left that it wakes the disturbed werewolves among us , hungry and with great lust for a snatch of female flesh under a fullmoon sky of blistering cold winterland...so its a film crampacked of strange caracters with strange visions of life and death and its causes and where the sheriffs son said common''lets do the twist again, like we did last summer''.just a little precautious warning, its a bloody and gory flick, so its not for the kids in the cradle to view, apart from that ,have a good laugh, best regards the grumpy old man"}, {"id": 105, "text": "Such a great movie. I'm not a big fan of big-budget films or all the stereotypes and cliches that Hollywood has to offer. I like dark comedies that are really just character studies. I'm from Utah (where this was filmed and takes place) and there are lots of small towns similar to this one. They got a few things wrong if they were attempting to be regionally accurate: Utahns don't have southern accents, we don't say y'all, and everyone in those small towns is Mormon, not Catholic. And trust me, they all say prayers at work. But those might have been choices they made on purpose as to make it more relatable. Utah is a strange place and those small towns are even stranger. Stranger even than this movie lets on."}, {"id": 106, "text": "Not everybody is able to do a great piece of cinema without the fireworks, the money and that fashionable gravity, empty weight that there is in your Netflix flicks. This is a good movie, with a great, honest script, good actors, good editing and good direction. I would show this at a cinema school. Thanks, whoever filmmaker you are."}, {"id": 107, "text": "A town under the snow fall to a serial killer and the proof he leaves is that it is a werewolf. he kills females and mutilates them. police is stunt. the sheriff is old and sick his son, the next in line for the job has personal problems and drinking problem. the dialog is intentional fast, and leads the thrill verry good. image is nice. personal, i relate to the young sheriff because his way of acting fast, bee it sacking the lazy or ,,traitor,, and jumping into the fight like a mad man. recomandation."}, {"id": 108, "text": "Overall its ok to watch it, good actings, and good effects, but the story is not promising! In terms of genre of this movie its definitely not what it says it is, definitely not scary, thriller maybe! But there is nothing funny about it!"}, {"id": 109, "text": "I am so confused. Movie about mountain ski town dealing with werewolf attacks. Funny, scary, sad and lots of dysfunction. Overall fun ride that could have used less woke junk and more nudity."}, {"id": 110, "text": "This was very disappointing. The main character is always yelling and angry and the overall acting stinks. It was an upset, frustrating mess. I wish there was some comraderie with the police. I stopped watching after the first 45 minutes."}, {"id": 111, "text": "With all the background and mysterious elements, just feel like Fargo. Story wasn't similar at all and I like the differences in this movie. The officials to investigate a unusual crime but not film in a boring way. Wonder it's from novel or not, even it's a bit 90s but still good to watch."}, {"id": 112, "text": "As one reviewer said, not the worst, not the best. Yes, Tar was worse. All but the director/actor's acting were good. He gave himself too much screen time, &amp; it became nearly unbearalbly annoying. I wished he had been a victim, of anything. But after this, I saw Tar, with that director/actor hoggin screen time, mostly just staring &amp; breathing heavy. So now, I won't watch any movie directed by a mostly unknown actor. And I no longer trust Metacritic's judgement, since they loved The Color of Space &amp; Come to Daddy."}, {"id": 113, "text": "After some of the crap I've watched this Halloween season this was one of the good ones!! Great acting suspenseful in all the right places and it kept me guessing right until the end. Found a great blend of scary funny and heartfelt all at the same time. Definitely recommend. Jim Cummings has excellent timing to make serious scenes funny to me even though they weren't necessarily supposed to be funny. Just loved it."}, {"id": 114, "text": "I adore Jim. His style makes every movie enjoyable no matter the emotional depth he reaches. This one has a few scenes of horror and some comedy sprinkled through out. I loved it. The cast was fantastic. The writing was good enough. A very enjoyable movie. Will watch again."}, {"id": 115, "text": "Fun to see all the locations/people that I recognize. I even saw someone I work with! Real fun. In terms of the actual movie, it was fun. Jim Cummings is fresh off one of favorites from 2018, Thunder Road. Which is a movie I liked more then this one. To be fair, this is quite a bit mkre ambitious then that. There's more characters, more plot, visual effects, the whole nine yards. Mostly it's surprisingly well handled. The cinematography is solid, the performances are good, and the dark comedy us good. I liked the juxtaposition between that and the gruesome subject matter. What elevates this above the typical murder mystery, police drama is the character work."}, {"id": 116, "text": "This isn't a gore fest if that's what you are looking for - but it is an incredibly engaging film that is fun from start to finish.The story is pretty straightforward, but what makes this film different and engaging to watch, are the characters -each one finely crafted by the cast with subtle and not so subtle ways of dealing with the stresses in their live.Certainly one to see if you like films that go deeper than the usual gore and screaming horror genre."}, {"id": 117, "text": "Maybe the best in the genre. The main character was perfect in his lack of control. The settings, supporting actors, story, and feel of this film landed the perfect werewolf movie I have been waiting for for decades. Plus, the transformation scene is one that will never be rivaled. Just not what you'll be expecting."}, {"id": 118, "text": "I was laughing so much my ribs started to ache its So much fun! The music is good. Pacing is good. Acting is good. 10/10"}, {"id": 119, "text": "Jim Cummings took all the good things from his debut Thunder Road and elevated them 10 times higher with this beauty by surrounding it with a Fargo esque universe.You're my hero.I will expand upon this review in the future, but Holy... what a good film. Cinematography, script, direction, acting- all great. When you see the same name as writer, director and first-billed actor, it's almost always a warning of either a grim vanity project or a film made on weekends by well-meaning but untalented amateurs; this is absolutely not the case here."}, {"id": 120, "text": "Jim Cummings is certainly going to be a force to be reckoned with, I think. Writer, director, star... and great in every role.Okay, the storyline may be a little shaky, and the denouement a bit obvious. But boy, is it worth the ride for the performances, the set pieces... and the cracking dialogue. Rarely have I laughed out loud so much in a movie of this sort - and for all the right reasons.It reminded me in many ways of Oren Uziel's fine 2017 bank heist movie 'Shimmer Lake'. Similar characterisation, similar dialogue sharpness, similar level of wit and comedy.Keep going onwards and upwards, Jim Cummings. Greater things await with this level of writing."}, {"id": 121, "text": "A real surprise in terms of story, character, and dialogue quality. Went in expecting a simple, mundane level of story, but the dialogue and character work was far superior to movies with a way higher budget. From a professional standpoint I would say the only downside is I didn't love the relatively flat lighting in some of the scenes (mainly in the day scenes). Felt like it cheapened the look of the movie, but it wasn't anything too bad. Worth the watch for sure!"}, {"id": 122, "text": "With perhaps the last performance by veteran Robert Forster, this movie is more than worth the watch. Written, directed and starring Jim Cummings and a great supporting cast."}, {"id": 123, "text": "Another spectrum take on film making by Cummings. It is more conventional than the previous one and I like it better. Although technically being full of cliches this movie keeps you guessing what from what you see is intentional and what is a limitation of talent, budget etc. Despite all shortcomings the movie is funny, well-paced and sometimes scary."}, {"id": 124, "text": "It's not a romp, but definitely an interesting way to spend an hour and a half. Lindhome hasn't steered me wrong, and now I know to keep an eye out for Jim Cummings, because he is great as an actor, writer, and director."}, {"id": 125, "text": "What I can say is that I did enjoy this movie. The Wolf Of Snow Hollow is entertaining, mostly due to its fast pace what results in that you never have a boring moment. The acting from the whole cast was good so no complaints about that either. I'm not sure if the comedy parts were really necessary, to me it could just have been a good thriller with some gore. The cinematography was good with clear well shot images. Good job from director/writer/actor Jim Cummings."}, {"id": 126, "text": "Jim Cummings is great. He wrote, directed and stars in this movie about a small town cop on the verge of a nervous breakdown while dealing with multiple grizzly murders. The great Robert Forster stars in possibly the last role before his death as the cops elderly and frail father who also happens to be the Sheriff of the town. It is a horror comedy but in a more dramatic and serious way than many other horror comedies tend to be and I really liked it. Jim has a Nicolas Cage-esque intensity that makes for a really compelling watch that can make you laugh but can just as easily make you cry and it's kind of amazing to watch. This joins my favourite Werewolf movies list along with Dog Soldiers, American Werewolf in London and The Howling."}, {"id": 127, "text": "The pacing was good, the humourous moments were spot on,and I like the over all unhinged feeling it had. The characters were great, I could watch a whole show about them. (Poor John, so high strung! 😱 )My only problem with it (spoiler alert!) was that the werewolf wasn't real. I don't like it when movies masquerade as supernatural.But definitely worth a watch!"}, {"id": 128, "text": "It's great for people who can appreciate good dark humour. I laughed a lot. Also fun acting, and Jim Cummings did an awesome job"}, {"id": 129, "text": "And that's not a spoiler. One of the intriguing aspects of the movie is whether the werewolf is real or not.The Wolf of Snow Hollow is one odd duck of a movie. It weaves deadpan humor with real-like family drama and genre horror -- a feat that isn't easy to do and tough to review as an armchair critic.Was the title of this review a non-sequitur? That's exactly how many scenes of the movie play out -- are those jarring tonal shifts or crafty blending of story/genre? Bottom line is that to rate this fairly, it deserves a re-watch.What really makes the movie work is writer/director/star Jim Cummings' likeability and sheer passion that permeates much of the film (although his huge canines are damn distracting and suspicious given that it could be a werewolf movie!)."}, {"id": 130, "text": "This film and his recent release before this, Thunder Road, are both incredible films imo. Cummings wrote, directed, and starred in both films. Now, his characters in both films have many parralels- struggling single father policeman with a daughter. However his capacity to show emotion is unrivaled by hardly any male actor out there today- again, my opinion. This intensity combined with his realistic refelction of a confused male dealing with things like ego, loss, connection, etc. ring so true that it felt like I was legitimately watching this guy go through this in his actual life.I have seen both films more than once now and eagerly wait his third title. I really hope the industry keeps this guy going with releases this size or bigger. These are the type of films we need more of."}, {"id": 131, "text": "I had a really good time with this one. It was funny, heartbreaking, and genuinely unsettling at times. The effects were great, especially considering the lower budget. Jim Cummings was fantastic and has created a wonderful follow up to Thunder Road."}, {"id": 132, "text": "Like the style, no holding back in storytelling, straight and raw. Comedy came in a little later and throughout the rest of the film. The final showdown wasn't surprising, could elaborate a little more about the guy's motives."}, {"id": 133, "text": "I thoroughly enjoyed Jim Cummings' acting and directing. He's humorous but his style of humor is not for everyone. The movie has a good balance between absurdity and emotional depth. Glad I watched it!"}, {"id": 134, "text": "Great photography and production values on a low budget that doesn't look like it.Jim Cummings does it all: writing, directing, acting. This kind of hat trick rarely does well. But here... The story is compelling because it is character driven, and there is a nice mystery road to follow.Kudos to Jim Cummings. I'll be checking on the guy: he's got a(some) great career(s) awaiting him."}, {"id": 135, "text": "Man these reviewers must not be movie fans. I really enjoyed this film. It was a welcome twist to the werewolf genre, multi-layered with a very human story. It was so fun and well acted, but had a lot to say about the human spirit and how we come back after we mess up. It really was a unique film, and I've seen a gazillion horror/thriller movies. So to review this movie like it's a standard B horror is ridiculous. Check it out for a fun take on genre movies, and a great story that takes you in all the way to the end."}, {"id": 136, "text": "Perfectly balanced movie that hits all the right notes. Plenty of laughs and jump scares and a beautifully told story underneath the horror/thriller genre. Great performances and an awesome twist that subverts expectations."}, {"id": 137, "text": "This movie started as a normal movie, continued as a normal movie, and ended as a normal movie. You don't see that often these days. I kept expecting some political issue to pop out but it didn't happen. In fact, there weren't even any black people in the movie, which is rare. Loved Robert Forster, gave me strong Twin Peaks vibes."}, {"id": 138, "text": "I dig this lol, I love comedy and horror, so...lead character had me lol-Ing more than once, he's handsome too."}, {"id": 139, "text": "This movie is so well done, i love it. You really get attached to the story since the first second, i love horror-comedy but this is different, because the movie takes serious the horror, i dunno i just really think is really worth to watch it."}, {"id": 140, "text": "Despite the low score here, the movie is really good."}, {"id": 141, "text": "Strange movie. Proves it is woke in first scene - ugh. Never sure what is next, laugh or violence. Uneven and strange. Anti-hero cop carries the show. Not worth a $6 rental"}, {"id": 142, "text": "Absolutely adored this hammy, sarcastic, dark and unexpected film. Jim Cummings is definitely a law unto himself- will be following him!"}, {"id": 143, "text": "*NON-SPOILER*In terms of comedy horror's these days you usually get an over filling of too many comedy scenes, where as this film mixes the balance perfectly. Some of the humour takes a short while to get into but it's definitely worth it.The story to the film is good, the acting is excellent throughout and all fitted their roles really well. The picture and setting was something a little different to the usual comedy-horror. It was all round just an easy but funny film to watch."}, {"id": 144, "text": "Very interesting and moving horror movie! I very much enjoyed it and I'm gonna watch it again and again for sure. I very beautiful soundtrack and really good acting along with nice directing. It's worth your time and I'm sure it won't let you down."}, {"id": 145, "text": "I didn't come into this expecting a Lycan tribute, reboot, I came for a character study and it delivered. I writing was on point, the direction and cinematography were both excellent and the acting from most of the characters was great. I can't remember her name but I've seen her in a couple of shows - the female cop - stole or came very close to stealing most of her scenes. At the end of the day, I just look to a couple of points, was I entertained? Solid yes. Did I care about the characters? Yup. Would I watch another film from this actor director? 100%."}, {"id": 146, "text": "As others have said, I don't get the negative reviews. This movie was great. It was soooooo slick &amp; well-written, if you go back and watch it a second time, you'll see all clues the director gave you along the way that you probably missed the first time. I loved that!!!! Fun, fun movie!!!!"}, {"id": 147, "text": "Director/production - 7; Story - 7; Cinematography - 8 Acting - 5; Makeup/FX - 7; Sound - 7; Music - 7; Personal motivation - 7; My average - 6,875For a long time that I saw a good werewolf flick, but is it?"}, {"id": 148, "text": "This has a great story and some good acting but Jim Cummings was really bad in this. He over acted and his character was to out of control and unbelievable. He did write and direct it to he does have talent. If you can look past that this it's a very enjoyable film."}, {"id": 149, "text": "Good cast, good budget...this is not a low level b movie. very funny, but with well done and scary attack scenes. only wish the attack scenes were a bit longer and not interrupted by alternating from attack scene to something else and then back again. interesting plot twist at the end. just keep in mind it is a comedy with horror, but doesn't make the attack scenes comical. no one needs to be beaten with a baseball bat for making this movie."}, {"id": 150, "text": "I really didn't expect to like this film as I don't generally like comedy/ horror but this surprised me so much that I'm now researching this guy who I've never heard of - Jim Cummings where have you been the world definitely needs more guys like you"}, {"id": 151, "text": "It has a great scare moment! The reveal in the end is a very cool scene and made the whole movie for me, its worth it to get to that reveal! All I will say is when he tells the guy to fully stand..... omg excellent!"}, {"id": 152, "text": "To those who've not watched Jim Cummings' debut feature Thunder Road, his latest Fargoesque comic thriller may seem brilliant. Though, my expectations as an avid follower of this young director were much higher than what I saw. Cummings' characterization of the protagonist, John Marshall, was too similar to Thunder Road's Jim Arnaud. Actually, that was the main destructive element in the whole movie. Nonetheless, The Wolf of Snow Hollow is worth a watch and definitely exceeds most of the recent trashy pictures that come out of Hollywood."}, {"id": 153, "text": "Just finished it and having found out about Jim through Greener Grass which is one my all time favorite comedies, which led me to the phenomenal Thunder Road and because of Dan Harmon, now this! Boom! That was well done in its writing shooting, editing, and the pacing of everything, was wonderful, the jokes came a mile a minute and I do wish it had been longer and a few little things explained that weren't but hell I'm ok without it. It's done as a mystery and done well. I agree with what someone noted earlier about the juxtaposition of his Jim's wolfen attributes fit nicely and nailed the feeling of dealing with sobriety and what that does cause a person to be like. Been there and know it well. I also know the feeling of a bunch of people talking at me all at the same time and that was on the money, though the people doing that to me where more like synchronized cannibals of the mind dissecting me, but anyhow, I survived and am I'm surviving. Now back to the film it glides from drama, comedy, thriller, horror as a mystery like a slow coiling of rope on a well, the audience in the bucket getting closer to the top and then like a flickering light of continual lighting strikes it shuffles those themes again, quicker never letting you stay in those themes, like a former all night, all day drinker moving into drunkenness' super quick after having been sober for a while was on the money. Sad Reality but Well Done! When he broke the stove door it was laugh and cry in a split second. Robert Forster had moments like that as well where they make you switch emotions like a light switch and That is hard to pull off and they did it without cuts. Massive Cheers! and tears for the master of his craft Robert Forester! Thanks Dan Harmon for bring it up and sending people it's way! I'm going to do the same. I'm also going to definitely watch it again because there was so much that happened even though it was short for the most part, but tightly knit. It felt like there was a knock on the homophobia in regards to the opening of IT 2, and I loved that even if there was no intention to do so it, made me smile."}, {"id": 154, "text": "This film is definitely getting some harsh treatment from reviewers. It's not a bad film by any means, nor is it great, but it doesn't deserve all these low ratings. Following review will contain spoilers.Jim Cummings is a talented filmmaker. Despite his mostly one note and loud choices as an actor, his dialogue is sharp and the film itself has its own style. Whether or not you can get on board with his particular style as an actor is going to dictate heavily weather you like this film or not. Personally, I found his performance had more strong moments than not, but I think someone on set having the balls to tell him to pull it back now and then would have done wonders for the film overall. Having sad that, the dark Fargo-esque comedy works most of the time and cummings' deadpan delivery certainly elicited chuckles from me.I've watched the film twice now. Upon first viewing, when the film finally played its cards, I was flummoxed by its final reveal and the identity of the wolf. I watch films quite closely and was certain that I had missed a scene or details earlier in the film during which we met the eventual wolf. Because I felt I had missed crucial details, I watched the film again, and to my surprise, I hadn't missed anything at all. In fact, not once in the film is their a mention of a taxidermist, we never meet the killer, there is no explanation as to what evidence the main character is returning at the end, there is nothing that transpires previously that clues the audience in as to why a seam-ripper would tip off the police and lead to the final confrontation. To me, this is a huge lapse in plot and I am certain they must have left something on the cutting room floor. Not to mention the complete red herring of the drug addict burning a body in bonfire outside his trailer. Whose body is it?The film is unique in its exploration of werewolf myth, but would have benefited from another pass. As others have said before me, don't make a werewolf movie without a werewolf. That's what the audience is there for and with genre pictures, just give the people what they want!"}, {"id": 155, "text": "This was the most funny horror comedy i think I ever saw. The humour was on point, the main protagonist very likeable."}, {"id": 156, "text": "My wife and I both loved this. I was surprised by the poor reviews, but we gave it a shot and really enjoyed it. The writing and dialogue was great, and the acting was solid. Better than the last 4 or 5 movies we've seen. Many of the other comparisons mentioned in reviews are deserved - sort of a low budget take on Fargo, Twin Peaks, meets Shaun of the Dead. Not nearly as perfect as any of those, but I'd say Wolf of Snow Hollow stands on it's own as a great movie. Would definitely watch it again."}, {"id": 157, "text": "Great acting, great pacing, thoroughly enjoyable movie"}, {"id": 158, "text": "I really enjoyed this all the way up until the big reveal. I think it hit on most of the big ticks up until then and I was really impressed with the human story being told in the horror setting and thought this was going to be a unique film but instead the ending fell flat in my opinion. The reveal *spoilers ahead* that despite everything we'd been shown that the monster was just a dude in a costume felt like a huge misstep. It went from being a very human story set in a horror setting to just another crime movie. Felt like a huge missed opportunity to me. But other than that it's an awesome movie."}, {"id": 159, "text": "I thought it was a little hidden gem at first. But it could have been much better. Its not a thriller, not a comedy, not a drama, not crime...maybe a little bit of everything. I like how they wanted to make it funny, but if you wanted to do that, go all in and do it 100%. I chuckled maybe 1 time. The sheriff was not funny, he just got on my nerves. The last 10 minutes was good. I still wanted a better explanation why all was happening. It worked, but nothing I will remember..."}, {"id": 160, "text": "The Wolf of Snow Hollow had enormous potential. A compelling story, well told, well shot. Quirky. But it was a cliff-notes version of itself that lacked cohesiveness. It is short (1.5hr) so there was time to work with that they didn't use. Too bad. So many good story-lines wrapped into the over-arching story that never received enough attention."}, {"id": 161, "text": "I usually really dislike horror/comedies for the simple fact that they usually fail at doing both. Meaning, they are never really funny are are often never scary. This movie, however, does both equally well, and works as either simply just a scary comedy or a funny horror film. I didn't expect to laugh out loud so often, especially hearing some of the tirades that the main character shouted throughout most of the movie. It really tells you a lot about an actor when they can be both serious and comedic without resorting to cheap, cliched one-liners.The best part about this movie is that everything is unexpected. You think you know where the story is headed but in the end, every element just comes together without the need for a lengthy exposition by some background character. The story just builds organically, and you are left satisfied and longing for more.I enjoyed every second of this film."}, {"id": 162, "text": "The good.Technically achieved. Simple but effective visual work. DP Is ok.The badMain character is so flat. The guy can't act. Don't know if he is trying comedy, as a stressed man falling apart, but with poorly built tensión. The interaction between him and his daughter is ridiculously awkward. So plasticky. That breakfast scene with all the cops looked like a MadTV sketch that never got to the punchline.The uglyThe music. Too much music. At one point I was expecting canned laughs.This Is really like a -B student film."}, {"id": 163, "text": "I hadn't heard of Jim Cummings before, actually the prolific Robert Forster was the only person I recognized, so I was pretty sure this movie would be crap. I also don't really like mindless and gory horror, or dark comedy that misses its mark, the former making me queasy, and the latter making me uneasy. Well I was pleasantly surprised by this movie. After writing a pretty tight script, with simple plot-points, character driven, decent banter in everyman speak, that gives even minor characters their own identity. Jim then hops up to the director's chair and pulls it all together, whilst also turning in a solid main performance. Again I must point out... He is playing an unlikeable character... It is not BAD acting... He is portraying an ex-jock, ex-military, alcoholic, divorced deputy in a small town, with an estranged daughter and a stubborn aging father/ boss. He feels his life is passing him by, he's surrounded by incompetent coworkers, overbearing constituents, and is making promises he seemingly can't deliver on... I thought he brought that right to the table steaming hot. The rest of the cast, particularly Riki and Chloe really assisted in fleshing-out his downward spiral. Is it a comedy? is it a horror? is it a... Who cares... it's a great story with chills, thrills, heartache, scares, shouting, laughing, crying, lying, and dying... You know... People stuff... Plus the wolf was great too."}, {"id": 164, "text": "By acting, writing and directing this mix between Comedy and Horror, Jim Cummings shapeshifts both genres into something quite awful, failing at both the comedy and the horror part.Badly scripted, despite the strikingly basic plot - alcoholic small town sheriff dealing with eerie killings.Extremely poor dialogue and delivery, often making no sense, or with lines and tone alien to human behavior.Attempts at comedy failed so bad you are left wondering if you missed the punchline.Main actor casting, performance and visuals are grossly off tone, by design it seems.+ Creature EFX and violent scenes are surprisingly good, by mistake I suppose. People rating this anything above 4 are really making an effort, this is a fresh piece of worthless of cinema, and you better not take a bite out of it."}, {"id": 165, "text": "Bloody fun, well written and often hilarious; The Wolf Of Snow Hollow proves that actor/writer/director Jim Cummings can tackle any genre you throw his way.In this comedy-horror film, terror strikes a small mountain town as bodies are discovered after each full moon.An incredibly original take on the genre makes The Wolf Of Snow Hollow one to watch. I now look forward to Jim Cummings' next project to see what he can do. If you haven't seen his debut comedy/drama film, Thunder Road, please see it. This was Robert Forster's final film and I think he'd be proud of the outcome. Running at almost 90-minutes, this film has enough blood, gore and laughs to play around with. I found myself laughing so hard at instances and shocked in others. All around great and fun film that is sure to keep you hooked.Follow @snobmedia for all reviews!"}, {"id": 166, "text": "The supporting cast are mostly good.The lead is terrible.The plot can be worked out within 15 minutes.Script, dialogue and delivery could be a lot better.Technical aspects are good, production, photography and sound all work well together.But all this is undone by a terrible leading actor, unless the film is supposed to be melodramatic shouty hot mess that finds women being mutilated funny.It also does poor service to those with alcohol issues or who suffer from PTSD.Give it a miss."}, {"id": 167, "text": "Initially, I must admit that I didn't have much of any expectations for the 2020 movie titled The Wolf of Snow Hollow. Why? Well, I hadn't heard about it, and usually werewolf movies tend to be dubious.But still, this being a new movie that I hadn't already seen, of course I sat down to watch it. And it being a werewolf movie definitely helped win me over.And I must say that I was actually genuinely entertained by writer and director Jim Cummings's movie. It was a rather well-written storyline that definitely had some good flavor to it, and the plot twist was actually good; I enjoyed the way the storyline panned out, especially since it was built up so that you were expecting it to be the most obvious of choices as to whom was the werewolf in Snow Hollow.The acting performances in The Wolf of Snow Hollow were quite good, and were for the most part done by actors and actresses that I weren't already familiar with. And that is something I enjoy in movies, seeing new and unfamiliar talents whose faces aren't already associated with previously portrayed characters in other movies.The special effects in this movie were actually quite good, taking into consideration that this was not a movie that were heavily reliant on special effects to carry it.I think that The Wolf of Snow Hollow is definitely a worth addition to the werewolf genre, and I can warmly recommend that you watch the movie if you enjoy werewolf movies.My rating of The Wolf of Snow Hollow settles on a well-deserved six out of ten stars."}, {"id": 168, "text": "Jim Cummings follows up his excellent debut Thunder Road with The Wolf of Snow Hollow.Here, as in Thunder Road, Cummings plays a police officer trying to cope with both his job and his familial duties, and in both he excels at portraying a man whose nerves are never very far from the surface, often boiling over to either dramatic or comedic effect (often in the same scene). Cummings' performance is astonishing, moving with ease from high emotion to slapstick to a glacial stillness, carrying the viewer along for the ride. He's ably supported by an excellent cast, all of whom impress throughout, though special mention must go to Riki Lindhome and the late Robert Forster for some brilliantly detailed work.Comparison has been made with Fargo, and although I can't deny the two films do share a similar sensibility and setting, I find The Wolf of Snow Hollow to be the stronger film. Though Fargo has many admirers, for me it often feels like caricature. Cummings' seems able to create characters who feel as if they have a life beyond the edge of the frame, and don't merely exist to populate a thumbnail sketch of small-town oddity.There's a freshness to Cummings' direction too; some of the shots are breathtaking, occasionally making use of a staccato visual grammar that might be expected in arthouse but is unusual in a film that presents itself as accessible entertainment, first and foremost. There's no pretentiousness on display - the shots always service the intent of the script, it's just that it's done with such a flair that it really makes you sit up and take notice.The Wolf of Snow Hollow can be many things to many viewers - a rollercoaster horror/comedy, a serial thriller, a commentary on the relationship between the sexes, a portrait of workplace and family or all of the above. Whatever it is, it's another demonstration that Cummings is a major talent."}, {"id": 169, "text": "Man. I ma really getting sick of downloading movies labeled as comedies on here, only to find that they are not any sort of comedy, what-so-ever. This film is a perfect example of that. This absolutely, definitely, positively not a comedy in any sort of way. I am pretty angry right now, having just this moment finished this mediocre slightly scary drama. I rarely watch new movies. But, I sometimes make an exception when one is labeled as a comedy/horror, as this one was.Anyways, besides what I have just mentioned, it did seem like it might be an okay horror. And, even while watching most of it, I thought that's what I was getting. But, by the end you realize it is basically not even that. It turns out it is basically an extended cop drama with an emphasis on the main guy's mental and home life problems. Puke.Besides all of those weaknesses, the film is pretty watchable and okay. The visuals are good. It is relatively scary. The visuals are good. And, it does have a little blood. But, by the end, I can't help but feeling angry and betrayed."}, {"id": 170, "text": "I can give Jim Cummings credit for writing , directing and starring in this, trying to create something stylish, a mix of horror and comedy but this movie doesn't work as either. A large part of the problem is that he has created for himself a fairly abrasive lead character, or maybe it's just bad acting. Appealing, very handsome yet annoying. His police officer is so over the top it brings the movie down. Even worse, the mix of comedy (none of it at all funny) edited in with someone being murdered in a realistically grizzly fashion is borderline offensive. On a horror level there is very little suspense and that aspect after awhile seems to be abandoned for even more of his over-acting. The movie, while beautifully shot, is also a mess in even telling the story properly, with obvious plot holes, gaffes, characters coming and going and happenings that are never explained. Other then the cinematography, some of the supporting characters are excellent, Riki Lindhome and Jimmy Tatro are great in their much smaller roles. The entire movie just comes across as one not very good vanity project. It is entertaining to some extent, I wasn't bored, but his writing , acting and obvious need to hog the screen turn this film into an embarrassment."}, {"id": 171, "text": "This remembered me of the 80's STV-movies, bulk, pulp, paperthin story, cheap monster suits and bad acting, but at least those actors tried and I have fond memories of them, this however needs to be forgotten quick.After 10 minutes of watching this, I had a pretty good feeling of what the rest of the movie was going to be like. I was wrong, it went much more downhill fast: After those 10 minutes, the music score kicked in and I couldn't place the dialogues anymore. It was like the wrong score was used. It went from bad to worse but still couldn't figure out if it was intentional or not. After seeing this movie listed as comedy, I realized it was just the worst movie score I had ever heard, it may have been somewhat more watchable with better music.Jim Cummings was supposed to be someone with anger issues, performs like a bipolar person but does that in such an amateurish way you can't even distinguish when he switches/switched to play the other guy.Robert Forster is a steady actor when it comes to performance, the only other good performance worth mentioning is the second victim, which says enough.Either I'm too old to get this type of movie/acting, or I need to booze up first."}, {"id": 172, "text": "You want people to stop talking s**t about the police? Do better police work. John Marshall (Jim Cummings)Jim Cummings had an inspired thing about the working class and harried cops in Thunder Road, and now in The Wolf of Snow Hollow he ramps up to small-town cop, John Marshall, facing a rogue werewolf appearing at full moon time in a mountainous place that seems to imprison everyone not in jail.What Cummings as writer, director, and actor has is a sense of the absurd (think Twin Peaks and Super Troopers) and the laughs it brings while commenting on the precarious situation of single parents and questionable authority like police. In both cases, Cummings has characters act foolishly (missing the point with a teenage daughter or falling off the wagon while on duty, for instance). Jaundiced attitudes toward authority are justified.Although the investigation of murders by some entity Marshall believes can't be a werewolf is progressing not much, Cummings is mostly interested in exposing the dull wit of a small town whose soul is tied up in a lost tradition of romantic small-town life. That paradise-lost syndrome is best exemplified in Marshall's ailing dad, Sheriff Hadley (the late Robert Forster), who must give over the duties to his son but who fights the loss of his place of importance: I may look old, but I can handle it.Cummings has done the nearly impossible of lampooning the horror formula while commenting on societal attitudes toward authority and the precarious place police have in the populace's psyche.The Wolf of Snow Hollow doesn't have to be viewed by horror devotees, just by those who like a few laughs while they think of small-town life and national mental health. The ambivalence of culture toward authority like police and parents is expressed in Marshall's cluelessness about their disrespect: Who would wanna throw a beer bottle at a cop car?A mild spoof couched in a formulaic awareness of societal silliness. Keep an eye on Cummings-he has a way with fragile blue collar and societal imperfection."}, {"id": 173, "text": "The bad; Main guy, writer director actor... i don't know what he was going for, like he changed his mind while they were making it if he was making a comedy, drama, horror, and this shows in the movie in general but his charactor is all over the place, it doesn't help that he can't act at all and stands out anyway, but it's just a complete mess The movie snips and snaps to different scenes quickly and not necessarily in time order, if done well this could have been good but it just makes the whole film more messy and frustrating to watchThe good; kind of good premise, location, enough to keep you watching to the end and when the credits roll you don't feel that it was a complete waste of time despite the many negatives.a watchable mess of a movie, main guy should def stop acting, maybe directing too. writing was ok in part just not consistant"}, {"id": 174, "text": "In my opinion there still hasn't been a truly great werewolf film, though I'm always holding out hope for one to come. Some have been passable, but most have been complete and utter misfires that can't capture the age old tale. Whether it's the overall story, the tonal clashings, or the effects of the actual creature, it seems like something that should've been accomplished by now. As far as this film goes, it's an embarrassing attempt that is downright amateur in every facet.What starts out as a promising opening unravels with awful forced humor that falls flat every time. There's horrendous acting from all involved, and mainly the lead actor who's also the writer/director which is even worse. There's oddly placed music choices throughout killing tones all over during scenes that don't need it . The horror aspects are virtually non existent aside from 3 20 second scenes and that's literally it. The conclusion is pitiful attempt at a twist that renders the whole already mediocre story useless.Overall this is probably one of the worst films I've seen all year and a complete waste of time even when it's good just having something new to watch right now. It's probably the worst werewolf themed film I've seen."}, {"id": 175, "text": "I must admit, my expectations were low - which is always an advantage to underdog movies ... but I really enjoyed this. Kind of Fargo meets Twin Peaks meets a werewolf movie. I agree with other reviewers that it's more character study than werewolf movie - but that's not a bad thing in this case. Jim Cummings did a great job IMO - although I can see how some people might not quite get what I think he was going for. If you consider that he wrote, acted in, and directed this, it's all the more impressive as usually that's a recipe for disaster. There is a ton of subtlety in what's going on and for the people who think that Transformers is awesome theater, well, they'll probably miss most if not all of it. I found myself laughing out loud at some of the reactions and dialog. If you chuckled your way through a movie like The Station Agent, you'll probably do the same here.There were a few weaknesses in the plot and the character arcs could have been better, but overall, I enjoyed this enough to watch it twice ... which almost never happens.Production values are good, acting is pretty strong, it's not awash in political agendas or wokeness, so, worth a watch."}, {"id": 176, "text": "I've pretty much seen everything the werewolf genre can throw at me, so it's with confidence that I say The Wolf of Snow Hollow entertains and surprises in many deeply gory ways.Unfortunately, it disappoints in lots of ways also.OBLIGATORY PLOT RECAP: Over the course of several full moons, a bunch of young women are brutally murdered in the otherwise quiet town of Snow Hollow by what appears to be a large wolf. One misfit cop is on the case, determined to prove that the killer is nothing more than a man.It's hard to say whether or not I liked this movie. When it impressed me, it REALLY impressed me. But everything in between left me with a big hairball of Meh.THE GOODEST STUFF: Practical werewolf effects win every time. Hands down. And so it is for true fans of the genre that I shout an emphatic: WATCH THIS MOVIE NOW! The Wolf of Snow Hollow has the best practical werewolf effects I've seen in recent years. Nothing since Dog Soldiers has looked this good. The gore effects are impressive and the movie's overall visual style is fittingly mysterious, bleak, and visceral.THE NON-GOODEST STUFF: As other reviews have pointed out, this movie is a tonal mess. When it commits to being a horror movie it's fantastic, but, unfortunately, it treats those moments of horror as setups for a sitcom-esque punchline that never comes. The brutal deaths of young women are handled flippantly and with little remorse. Even the main characters don't seem to carry the full weight of the trauma in a realistic way. The movie tries to walk the fine line between horror and comedy, but I just didn't find anything funny about it.As usual in a movie like this, you've got a cast of characters that never make very good decisions. (Why in the name of all Americans in London would you get out of your car on a dark snowy road to investigate a dead animal while you have a baby in the backseat? I grew up in rural New England. Nobody I knew ever made it a practice to walk up to large roadkill, especially not at night when there are reports of a humongous killer wolf roaming about. Jeeze!) But maybe these moments were part of the horror/comedy vibe the movie was going for.The ending, too, was ultimately a letdown, but I can't say why without getting into spoilers. Let me just say that if someone served you a bowl of wolf meat stew but didn't actually put any wolf meat in it, would you be disappointed? ... Yes? .... Ok, then you probably won't like the ending either."}, {"id": 177, "text": "Its a fairly entertaining film which for the most part I really enjoyed. Its very humorous, whilst not strictly being especially 'comedic' and I think this blends in well with the film in general and what I think it is trying to achieve.It has a great cast and is well acted and directed. There is a lot of suspense and this is placed quite strategically in a well paced plot. Direction is again good and bit for the screen play which lets it down, I think I'd have given it a few more points.The real issue is the story. I'd not heard of the film so when I started watching it I got quite drawn in. 20 minutes in, I thought this movie is like someone who's made it has put every idea they ever had into in instead of weeding out the won'ts that don't work. Well, after looking at the credits, that seems to largely be the truth of it.The failings are with the main character, who is really the main focus of the plot, and whilst its good to have strong focus on a lead, this one over engages in him without really fleshing out the intricacies necessary to convey a true perspective of his character. Too be honest, even if it had, it would still have been a bad idea, the real interest in this tale is in the murders that are taking place, what is going on with regards to the town, the victims, the search for the killer and the suspense, horror and intrigue therein. The focus on the officer Marshall, the thin window into his father's ailing health are inconsequential (for the most part) and are given too much attention. ultimately the film is in need of some serious steamlining.Anyway, I think it still a good film, and Jim Cummings CAN act, but his efforts here are misplaced in many ways since this could have been so much more with a little less.My advise is to watch it and see for yourself, because I think this is going to be one of those films which people will mostly like a lot or totally hate.... mostly. I think 6 is a fair score."}, {"id": 178, "text": "This movie is amazing. It's a superbly crafted, surprisingly serious horror-comedy about men grappling with toxic masculinity. It's also a self-critical werewolf movie. And no, the combination of those things doesn't play out as you might expect.It's not Scream. It's not Cabin in the Woods. It's not Tucker &amp; Dale versus Evil. All of which were fine in their own ways, but also extremely heavy-handed about their novelty of being meta. Rather than a film that's obsessed with trying to impress everyone with how clever it is, The Wolf is just a very clever film.What's more, The Wolf isn't a Hollywood piece of crap that tries to maximize commercial success by playing both sides of the fence at the same time -- an approach previously ridiculed by none other than the film's supporting actress Riki Lindhome in her other career as half of comedy music duo Garfunkle and Oats (see Both Sides Can Laugh). So no, this isn't a horror film that invites anyone to identify with the villain so they can satisfy sadistic, misogynistic fantasies. In fact, it's a film that tells you you're pathetic if that's what's brought you to horror in the first place.But when it comes to the flawed central character struggling to be better and some other male characters, the film doesn't give us demeaning caricatures. It presents these men with depth and compassion, encouraging us to laugh at them as we might laugh at ourselves.Consequently, a lot of people will either hate this film or miss its point entirely. Admittedly, I set my expectations way too low on the first viewing (because werewolf movie), and had to rewatch it once I realized what it was really about. But at least even the haters won't come away from this movie idolizing the next Tony Montana, Freddy Krueger or Big Bad Wolf.Jim Cummings seems to have executed a clear creative vision here pretty much flawlessly as the film's writer, director and lead actor. Riki Lindhome and Jimmy Tatro (American Vandal, Season 1) are perfectly cast and great in this, too -- as is Robert Forster (Breaking Bad, Alligator) in what I assume was his final role.I can't recommend this movie enough."}, {"id": 179, "text": "I was interested in this because I had heard that the Director's, Jim Cummings, first and only other film, Thunder Road, was really good. After watching this film, I'm very excited to see where this Director goes in the future. The Wolf of Snow Hollow is a surprisingly funny and emotional film that is able to mix its horror elements, dramatic elements, and comedic elements almost perfectly together. I never felt as if a scene was undercut by a comedic line or anything else. Some of the jokes may not have been super funny but a lot of them definitely got a laugh out of me. The horror elements weren't drop dead terrifying but they had a lot of tension and build up that made those scary moments effective and the dramatic elements hit really hard at points. Mainly with Robert Forster's character but I think that's because he passed away this time last year so it does feel a little somber. All of the performances here are great especially Forster and Jim Cummings. Each of their characters are mesmerizing and so fun to watch interact with everyone else. The script, also written by Jim Cummings, is great too and makes it easier for those elements to hit. On a technical level, the film has great editing, cinematography, and music. There are issues with pacing at points but it isn't too major and the occasional unfunny joke or weak element doesn't take away from the experience too much. If you are a fan of unique horror films or want a funny comedy horror film, then go check this out when you can."}, {"id": 180, "text": "First off I have to say a lot of these reviews that are below 6 on the scale are just plain ridiculous and pretty much the reason why I don't read reviews before I watch a movie. I feel compelled to say ignore them and watch it for yourself. Some people point out that the reason they don't like it is because of the main character and also the fact that it is not an obvious horror movie. I would agree it is not really a horror movie, it is a more of a character based story.You are not supposed to like the main guy, he is supposed to be annoying because of his inadequacies and that is the whole point of the movie and it is what they focus on the most. I actually really enjoyed the movie because I did not know what was going to happen next, it was intriguing. People mention that the clues etc don't really stack up, that is also the point, they were out of their depth and barely have to investigate murders and so were bumbling around making a mess of the investigation.Overall it was shot well with good quality effects, nice scenery, you really get a feel for the small town location. I also really liked the focus on the characters themselves, I felt like I knew a lot about the main character once the movie ended. Ignore the terrible reviews and give it a watch for yourself, just don't go into with an expectation that it is a horror movie because it is a little more than that."}, {"id": 181, "text": "A howling hybrid of lycanthropic terror &amp; dark humour, The Wolf of Snow Hollow packs as much fun as it does feral carnage and is one of the better delights of the year. A briskly paced, intelligently witted, gleefully violent, consistently thrilling &amp; thoroughly entertaining horror-comedy, it is a wicked mix of laughs &amp; frights that delivers the goods in just the right doses.Written &amp; directed by Jim Cummings who also stars as our protagonist, the story is small-scale &amp; simple in structure but it is executed with such flair &amp; confidence that it leaves behind a lasting footprint. Cummings' writing is sharp, his direction is polished, and the way he makes the elements of comedy, drama &amp; horror work in tandem from start to finish is both impressive &amp; inspiring.The deadpan humour in this story is very reminiscent of the Coen brothers' works, and the small-town setting &amp; inept officers on duty only make the influence more obvious. Cummings is as outstanding in front of the camera as he is behind it, and he is finely supported by the rest. The film is also noteworthy for featuring Robert Forster in his final role and he is simply hilarious, stealing all his scenes with ease.Overall, The Wolf of Snow Hollow is a terrific blend of flat-out comedy, heartfelt drama &amp; full-fledged horror that utilises its limited resources in a highly efficient &amp; effective manner and establishes Jim Cummings as one of the finest talents to watch out for. A smart, solid &amp; sophisticated thrill ride, The Wolf of Snow Hollow has all the makings on an indie classic and is one of the best films to surface this year. Don't miss it."}, {"id": 182, "text": "This is a solid little horror/creature feature, but the only issues was that I was never sure what it was trying to be. Some of the performances and the characters are over the top and give the impression that it's trying to be a horror comedy, but the some of the subjects and actions are too serious for it to be funny. A small town police man is dealing with his divorce, his teenage daughter, his recovery from alcoholism, and the failing health of his stubborn father who also happens to be the sheriff. If that isn't enough, people start being brutally killed in this sleepy mountain town, and some of the signs point to wolves... or possibly a werewolf. As the killings continue and the police get no closer to catching the killer, the townspeople start to turn against the police department which just exacerbates of all the above mentioned issues. It's well made, it looks slick, the special effects are mostly practical and we slowly see more of the creature as the film progresses which helps to build the suspense regarding who or what the real killer is. I had to watch it a second time to pick up the clues that led to the conclusion, and it held up okay on this second viewing. It's not perfect but its a fun watch, and possibly suitable for teens who are starting to get into horror."}, {"id": 183, "text": "In the remote town of Snow Hollow, brutal murders are leaving the police cold and the townsfolk terrified ...The movie started well but it meanders towards the finale and eventually it clicks that the story is less concerned with the mysterious Werewolf than it is with the alcoholic cop and all his issues.It's more of a black comedy / social drama than horror - which might be your bag - but it was disappointing for me. I much preferred the likes of Silver Bullet and especially Late Phases.Aside from the irritating, frequently yelling lead, the characters are good and the acting is solid and overall it's a very well made film. I would recommend it but know what you're getting, to avoid disappointment."}, {"id": 184, "text": "What a strange movie. It tackles so many topics which, if explored deeeper, could have resulted in a smart piece with social commentary. A fragile masculinity unable to fulfill expectations, misogyny resulting in horrible deaths, effects of family bonds being broken, men grappling with emotions, father-son relationship, father-daughter relationship, fighting with addiction, peoples mistrust towards the police; even origins of werewolf lore. Had one or two of these topics been explored and deepened, the film would be soo much better and smarter. But it tries to be everything at once instead, resulting in a convoluted mess with unfulfilling ending. I liked the camerwork, there were some beautiful shots of snowy landscapes. That's definitely one of the highlights. I see a lot of reviews criticizing Jim Cumming's acting. I liked it, I think he showed an absurd, unhinged and pathetic man that cannot deal with reality quite right, and I definitely saw a lot of comedy there. It's a pity that the movie never decides what to do with his character, doesn't give him a proper redemption arc apart from one scene where he admits he's a jerk, or a proper closure (saying goodbye on a cemetery and passing a sheriff's star to a person who - thankfully! - got it at the end would have been a nice wrap up.)A total wasted potential. Nevertheless, I had quite a good time, not expecting much."}], "reviews_amount": 185}