{"name": "Sputnik", "titleId": "tt11905962", "reviews": [{"id": 0, "text": "For those confused by the ending including some of the other reviews:The child adopted at the end of the film (the cosmonaut's son) is not the child seen in the orphanage throughout the film. Those scenes are flashbacks to Tanya when she was a child and thus the link between the running shoes in the box and the focus on the running shoes she unpacks when she arrives at the institute. The young Tanya's problems with walking presumably also linked to the scar seen on adults Tanya's back indicative of spinal surgery."}, {"id": 1, "text": "I have to say,I really liked it. The story was tense from the beggining and the acting was quiet good. This is how every sci-fi movie should be...Entertaining,good plot, new and fresh ideas...Overall a good sci-fi movie... well done"}, {"id": 2, "text": "I almost never give a nine for a movie but this one deserves it,I'm a big fan of science fiction and I saw probably everything worthwhile from that genre but this film is a real surprise for me,this is one of the best sci-fi movies in my life ! Watch this movie without the prejudices which you may have about Russian movies and you will be as surprised as I am !"}, {"id": 3, "text": "Well, what do we have here? Could this be one of those films that have stopped coming from big studios a long time ago? Could this be a decent, well-made and thought provoking story in an interesting setting with great visuals and acting? In 2020?Well, yes! Leave it to the Russians to bring some loving Sci-Fi back. Set in an intriguingly nostalgic feeling USSR of the 80s, Sputnik is a slow-paced, but increasingly intense story that manages to make you think a bit. The characters are nuanced, the plot is adequate, the cinematography very nice to excellent, and even the CGI is better than many films with way higher budgets.If you don't try to project any Western expectations onto it and maybe even understand the Russian soul a bit, you will definitely enjoy this."}, {"id": 4, "text": "This Russian sci-fi horror was surprisingly good. It captures the atmosphere of Russian military and alien amazingly. Yes, the relationship and motive between two main characters is debatable and feel unrealistic. But i am passing it as the rest of the movie was fantastic. Actors did a good job especially the military commander. It would have been 10/10 if they had tweaked the script a bit."}, {"id": 5, "text": "The only thing this movie suffers from is an extremely misleading trailer, in the vein of it comes at night. Do NOT expect an edge of your seat alien horror movie because that's not this one. It's instead an excellently crafted slow burn thriller helped on by excellent directing, cinematography, score, performances and some exquisite special effects (The creature especially!!!!!)"}, {"id": 6, "text": "Usually you don't expect much from non American sci fi movies. But this one is a good find. It's like seeing those movies of the 80's or 90's that still weren't that formulaic and doesn't try either to lecture you on morals or is totally devoid of any moral standing. The pace is slow but not boring (something American movies have lost the ability to keep) and the story evolves naturally and never fails to its own logic (there is no you gotta be kidding me moment as it all matches and fits without foolishness or absurdity, given the preset premises). Maybe it needed a little more or a little else to excel but it's quite a good product and the special effects are perfect (on par or even surparssing the American CGI's)."}, {"id": 7, "text": "I had a friend a long time ago who when we sat down to watch a movie together, if I attempted to name an actor, would silence me saying, suspend your disbelief and just enjoy the movie for what it is. It's easy to make comparisons with the familiar. It's a lot harder to judge something unfamiliar on its own merit. I'm not Russian, neither do I speak the language so I was grateful for the steady paced subtitles to guide me through the plot. If you need to measure this movie against others of similar ilk. You are probably going to be disappointed? On the other hand. If like me you are prepared to leave your ego and bias at the door. You might notice what a little gem this movie is. Go Russia. Make some more."}, {"id": 8, "text": "My dad is a fan of Russian movies and he recomend me this movie who really impressed me. the script wasn't like the american movies where you can guess the next move and how it will end. The special effects were well made. I totally recommend this movie"}, {"id": 9, "text": "I have seen a lot of similar sci-fi movies in the past. Ridley Scott's Alien is the one that most compares with this film. The other is the 2017 film Life. This movie is about an alien parasite that impregnates and uses its host as a literal space-suit so-to-speak. The movie also questions the fact whether the organism is a parasite or a symbiotic organism.Plot: A pair of Russian cosmonauts return back to Earth on account of their spacecraft malfunctions. One of them is critically injured and barely kept alive, while the other is miraculously unscathed. Both of them are kept in an isolated military facility, where Dr. Tatyana Klimova, a young psychiatrists under review for her controversial approaches, is brought, recruited by the officer in charge, Colonel Semiradov. Soon the doctor will learn the terrible truth of what happened onboard the spacecraft...Egor Abramenko makes his directorial debut and he has done a fine job. I am sure he will improve vastly with more films given to him. The cinematography, background music and acting is top-notch. The C.G.I. special effects are also very good. Horror and Sci-fi fans will not be disappointed here. The only problem with these C.G.I. effects I see nowadays is that they are executed to fast and the viewer not given time to digest.But overall, the flaws of the film are minor and the good points outweigh the bad. The movie is an original concept and I loved watching every minute of it. There are many Hollywood movies I have seen where my mind wonders away from the screen to something else. But this one kept my attention to the very end. 10/10. Egor Abramenko is going to become one of the best directors around."}, {"id": 10, "text": "Just finished watching the movie and damn, what a good picture. It kept me glued the whole time, everything is done so well and meticulously thought out. Story wise, nothing seems out of place, everything is explained in a plausible scientific way. It felt fresh and original, although it has some similarities with a couple movies I've seen before. The USSR atmosphere, the horror/mystery aspects are portraied pretty well, but they're not the main attraction. The gem of this movie is the main protagonist, Tatyana. She felt like an effortless marriage between Eleanor Arroway (Contact) and Louise Banks (Arrival). Very practical, smart, stoic and effective, with a lot of emotion and care. She grabbed my attention with every word she spoke, and all the actions she was taking. The acting from the main cast is very good as well, found only one weak link but they redeem themselves close to the end. Very tight and interesting script, great cast and writing, amazing original soundtrack. A strong 9/10 for a international mystery/thriller and a solid 10 for a Russian made movie."}, {"id": 11, "text": "The astronaut - alien parasite theme has been explored with mostly disastrous results by Hollywood. But the Russians finally nailed it."}, {"id": 12, "text": "I saw a trailer for this movie on reddit, and thought I would check it out, and I was surprised to find it released recently and gave it a watch. I was really impressed how hooked I was on the mystery. The film is very well done, especially great camera work and sound design. The characters were interesting and kept me watching until the end. I liked the movie all the way through including the ending, which is a rare feat to stick the landing on these types of movies. I enjoyed it very much."}, {"id": 13, "text": "Set in the mid 1980s, two Soviet space pilots land in Kazakhstan, and one is dead, the other brings inside him something, that makes put him in a cage and study, calling a brain doctor from Moscow. No, it is not exactly a 25th exploitation of Alien topic, but somehow close. The first hour is indeed full of suspense as we are slowly told what creature is in Vyshnyakov' s body and how they coexist or try breaking the bond. Later it becomes more of a hit and run movies only to end up in, in my mind, only possible solution for symbiosis for such creatures, human and alien. Also there is an abandoned son of the spaceman whom Tanya, the brain doctor, tries to save to.In general, a rather good, soberly colored attempt to the popular topic of alien vs human, watch it and you might be left satisfied. In the end, who knows, maybe this has already happened in any space mission?"}, {"id": 14, "text": "Wow, this was a lot better than I expected. I loved the imagery and the pacing and the general ambience, a powerful feeling of what old Russia was, and the film isn't accepting or rejecting of it, but just presents it. On top of that, it was full of unexpected events and great acting. I usually can predict a sci fi plot, and a typical American sci fi will eventually have a predictable plot outside of the rare few very good ones, like Interstellar, Annihilation, Ex Machina, etc. This was not predictable and was not a typical horror film, either. Ultimately, it addresses alien life in a complex way that I haven't seen done before, even as it mildly references the imagery of films like Alien.I loved it."}, {"id": 15, "text": "This is a very well done sci-fi with a solid creature which isn't too over the top and is kept just simple enough to really work. Some of the only gems coming out of the horror and sci fi genres these days are the indie/foreign films and this one delivers a scary creature without getting so bogged down and convoluted as some of the more recent big budget films. It is subtitled but you can still appreciate that the actors/actresses were quite good. It was an unexpected surprise and I recommend it to anyone surging through the massive catalog of cookie cutter and ridiculous horror movies of late."}, {"id": 16, "text": "This was a really well done film. The S/VFX were excellent. The directing was great. Writing, run-time and pacing were spot on. Cinematography and score were on point. The acting and casting couldn't have been better. Very entertaining indeed."}, {"id": 17, "text": "Sputnik may actually be the best Sci Fi film that i saw entire year only competitor can be Vast of Night and even if that film was also good,Sputnik was more effective and more chilling to me,it also had great use of atmospfere and some creepy imagery,Some people would compare this film to Alien or even Carpenters The Thing and even if it has some referances to such films,Sputnik was also able to be original in a way and it had interesting alien creature design,look of entire film and colors in it were also very strong and it blended with a story very well,relationship and chemistry between our leads was little rushed and with little chemistry between them,but it surved its purpose,Sputnik was a very surprising Russian Sci Fi film"}, {"id": 18, "text": "Absolutely Fascinating SputnikA horror movie without a single jumpscare, it's a rare thing, and whenever it happens you have watched #masterpieceMustWatch"}, {"id": 19, "text": "A Russian movie in the line of Alien, but like if it was writen by Lovecraft and the final script reviewed by Kafka. A bloody symbiotic relation between a space monster and the bad side of a Russian hero... I strongly recommend it."}, {"id": 20, "text": "A very enjoyable film. I can never watch a Russian film without having the sense that I'm missing something; that the director is also communicating a deeper message through metaphors, hence why many Russian films stay 'inside me' for a long time after I have watched them. I did wonder if the alien represented the old 1980's soviet communist state that Russians grew up with inside them and would identify themselves with although it was actually alien to them: a symbiotic relationship that ended, disastrously in many cases for both when communist Russia died. Anyway, that's my, rather unsophisticated, tuppence worth."}, {"id": 21, "text": "Not sure why the bad reviews. But this was one of the best Alien movies I've watched till date. Granted it had many flaws but props to the director for shooting it so well, revealing answers gradually as the movie progressed. I was on the edge of my seat the whole time. I saw many reviewers complaining about the secondary plot but they completely missed its interpretation and how it motivated the protagonist to do what she did. I'd say this is a must watch for alien movie lovers and thrill seekers in general."}, {"id": 22, "text": "Wow-was not expecting this to be so good but it was even better than good it was great! Gotta read the subtitles quickly as they fly by but this lean and sci-fi film is awesome. They get right to the story of a cosmonaut who returns to earth very different than he left. I just have to say with sci-fi for me you have to get the alien right as in scary terrifying interesting and this film does. The lady scientist is awesome and so courageous and the cosmonaut is tragic and tortured. All the way through to end this movie worked. Very entertaining and available on Hulu"}, {"id": 23, "text": "One of the best sci fi movies of the last couple of years. Intense, good story, good actors, proper effects without exaggerating."}, {"id": 24, "text": "This one comes from Russian production company. I am not a fan of modern Russian pictures in general, but Sputnik has this distinctive dark atmosphere that I really enjoyed.Actors did a great job, the script and the structure are solid. Sputnik did its job to keep the suspense throughout the whole movie. I would recommend this film to any sci-fi fans that want to see some fresh perspective of an alien from the east."}, {"id": 25, "text": "Excellent movie!! I wish they can dub it in English though! I always have captions on when I watch TV just in case I miss something lol. But listening to a different language while reading the English captions fast isn't always easy. But this is such an amazing movie!! It's very original in its storyline. And the graphics are beautifully done! I just wish the ending was more satisfying. But regardless of that, fabulous movie!! I would love to see more from the makers of this film!!"}, {"id": 26, "text": "Skip the Hollywood generic garbage and give this unique title a go.. YOU WILL NOT BE DISAPOINTED! AAA++ for me :).."}, {"id": 27, "text": "Set in soviet era Russia this film brilliantly unravels as a psychological suspense drama with sci-fi overtones. It is at heart a mystery story deconstructed against the socialist structure and forces at play during Russia in the 80s and this sets a tone that is unique to Russian film identity.It is cleverly told with nuance not found in most American films. The dialogue driven story slowly builds on the suspense that it sets up from the start and climaxes to a satisfying conclusion.The ending seems to be happy but hints at something else going on.Spoiler alert***Why does the son refer to himself as a girl and uses Tatyana's name before meeting her for the first time?Did the creature survive and use Tatyana as a host to connect with Konstantin's son .. if so then the connection with his son was established in some way while it was connected to Konstantin.Could this be a metaphor of breaking away from the socialist structure that held it captive to establish a hive mind in which it will now be able enslave humanity itself?"}, {"id": 28, "text": "Original plot much impressed. Deserve 7 star on IMDB but u guess some people are biased."}, {"id": 29, "text": "Man, I enjoyed much of this movie. From a technical perspective this movie is good but it always must be something in the plot to ruin everything, especially with the russians... A cheesy, forced love story that make this movie easely forgettable... I am glad that russians have at least the technical means to make good sci-fi and horror movies and I am sure good things will follow... Stop with the stupid, unnatural love stories in sci-fi and horror movies for f... sake!"}, {"id": 30, "text": "Never thought there will be another better creature thriller after 'Alien' franchise, but it satisfied that. Suspenseful story telling and human characters emotional arc made it as one of the best creature Thrillers."}, {"id": 31, "text": "Its not Alien! Its not Life! Its Sputnik!I enjoyed it very much. It is unique and it doesn't have to be compared to other Hollywood movies. It is well written in my opinion and it deserves its own recognition and stance. Great selection of cast and acting.The story is about Parasite or Symbiant. Very interesting intro of nonterrestrial using a human as a body suit then adapting with it. I assume the Soviet era was chosen to minimize the mix of modern tech. Everything i read about the 80s in Russia makes sense why they would choose military for the movie and hope of superiority: Brink of Star War, Cold War, and the big mess in Afghanistan.Well done, good job! You got me as a fan. I hope we see more of this in the future. Considering there were more than few studios that worked on this."}, {"id": 32, "text": "Anyone looking for a good new movie must give this one a chance. Its starts of as a quintessential alien movie but quickly goes towards a direction of its own. A lot of people have commented on the acting of the lead actress but i feel she has done a solid job. Great story, good characters and A grade acting."}, {"id": 33, "text": "As we can see in all the Hollywood examples, they generally made this kind of movies in the beginning stage. Not much of them try to go further. We had to watch bloody killing stages of the rest of the crew. After seeing a few examples of those films only boredom could accompany us through the end. Russians dare to go a bit further by starting on the second stage in similar kind of movies. We all have to thank them for it. Luckily we witnessed fresh stories and we all were able to think more creatively until they changed their mind to continue as Hollywood style. But still I have hope from them. After all going this far I am sure they may suprise us one day with more creative 3rd stage."}, {"id": 34, "text": "A well constructed movie with a great atmosphere (like the Chernobyl series). What it lacks is an original alien form and the script doesn't know whether it wants to follow the line of 1. Alien 2. The hidden 3. The shape of water In the end its just another easy way out for another alien movie . I rate this a 3 out of 10. Three for style and zero for substance. The lead character is a medical person with vacuum between the ears. And that's being kind...."}, {"id": 35, "text": "The movie begins with a real sense of suspense as you don't know exactly what lies inside the cosmonaut, which keeps your attention. The first act is really interesting and a bit disgusting, which here is a good thing. From the mid second act onward the movie devolvs into a messed up sequence of wrong screenplay and drags on to an unexpected (actually, dumb) end, more closely related to a family drama movie. All mistakes aside, it has a somber photography, over the average acting and gloomy characters. But that's all. I would had given four stars with a thumbs up, but four star is all IMDB allows me to give."}, {"id": 36, "text": "As i said, influences from past alien films are here in bunches, but this has enough going for it with 2 different smart subplots unraveling simultaneously. They keep the interest level going strong in between the true brutality and bloodshed that this particular alien being brings when on screen (sparingly) .There are moments of dragging dialogue and slow exposition scenes that do slow momentum at times. There's a great build up to a fantastic finale as well that serves as a nice payoff for those slower times. For the most part though, this is a very well shot, well acted, and well scored new entry into the alien genre. I was thoroughly impressed with how crisp and fluid the cgi on the creature was. Seeing how it was an IFC midnight film, i assume it was made on a humble budget, but you would not be able to tell because they utilized their production value extremely efficiently. Any alien lover should definitely check this out."}, {"id": 37, "text": "Oksana Akinshina (from the legendary 2002 film Lilya 4-ever) stars as a doctor assigned to a remote Russian facility to study a Soviet cosmonaut, whose mission crash landed under mysterious circumstances. I was fully immersed in 1983 cold-war Russia. The mood was eerie. The effects were seamless. The story riveting."}, {"id": 38, "text": "This is a solid sci-fi film. It is well made, well acted, builds up a mystrious atmosphere and the score nicely adds up to the feel of the story. It is a slowburner but the pace is well maintained throughout the film. The story itself is not that original and it is reminiscent of quite a few American films, most notably Alien and also The Thing but nevertheless has its own feel. The last part sparks some nice intrigue. I do not want to give anything away, but it will be interesting to see what other viewers will make out of the final few minutes and sentences of the dialogue. Overall, I thought it was a solid piece of film-making and if you love sci-fi that is not all about non-stop action and over the top CGI, you might be pleased with Sputnik."}, {"id": 39, "text": "The Eurasian Cate Blanchett appears in a Russian science fiction flick where the risk assessment of the marauding alien was thought low and merited little or no security, unless a pretty nurse counts - oh, the price you pay for your intransigence. Call The Doctor!"}, {"id": 40, "text": "This was a surprise find for me. It has all the hallmarks of bad sci-fi but is actually pretty good. Has a recycled plot, but is enjoyable. Pretty violent and gory in parts and keeps pace for most of the film. No dumb charachter driven plotlines or situations. Good all around. Worth a watch."}, {"id": 41, "text": "Good script, good camera work, good actors, good soundtrack. I feel like this is too good. Let me explain, i saw the trailer for this movie and i loved it, the feel of the movie is very good, most atmospheric, i was sold. Then i saw the actress from Lilja 4 ever, and she as the actress made a big impression on me when i was young to this day, so seeing her in this movie was like a match made it in heaven. She is amazing in this role, and i feel this movie should be bigger than it is, but because it was not made in Hollywood it's going to hurt this film. Sadly i think its gonna go under the radar for most people but please, see it, its very good and don't let russian language bother you, is really easy with subtitles. It was better than it need it to be, and if you like movies like Life or Alien, it's worth it."}, {"id": 42, "text": "If you like films about aliens from outer space, i can warmly recommend a peek of the film called sputnik. its the story about a space operation in 1983 gone bad at the return to earth, there are one survivor, in fact two time will show. the critically ill+ intimidating creature is brought to a highly secured military medical assignment base in desolate, marslike kazakstan where treatment and experiments are done and truly fails everytime to isolate the thing and to make the astronaut heal . help is brought in from moscow, a rather beautiful comradine of the andropovidized russian communist era. and this is the start of a tale that youll have to see to understand why i givbe 9 stars.i like films that has got outer space aliens, the thing and the alien are some of my favourites, and sputnik isnt far below. the creature, and the perfectly depicted russian 1983 environment and building standards are just amazingly well made a done. there aint many mistakes made in the filming nor the editing, to be squemish it might have a little too long playtime and slow plot, and under the average english subtitles, but the story are nervewrecking and the special effects brilliant.the grumpy old man had an amazing moment with sputnik and will warmly recommend sputnik for all of its intensity and grittyness, a decent russian scifi horror it is."}, {"id": 43, "text": "The good.. CGI - however sparse Setting - great choice time wise and location wise (80s Soviet Union, Soviet space station) that would have been great for a well developed story The bad... Character incentives and motivations - absolutely non realistic, illogical, and frankly speaking at times stupid. Storyline - a mishmash of ideas that start from nowhere and lead to nowhere. My impression is that the producers tried too hard to imitate hit Hollywood blockbusters, but ended up having an incoherent and illogical mess (for example.. Why would an alien creature that obviously survived light years of interstellar travel in cosmic vacuum would just land on a small metallic satellite just couple of hundreds of kilometers above earth, rather than, well the rest of the entirety of the earth?)"}, {"id": 44, "text": "Not completely original as it pays omage to Alien, one of the great sci-fi Alien movies, but it offers an interesting twist and great creature effects. And it's from Russia, so improving their film quality and abilities is nice to see."}, {"id": 45, "text": "Sputnik is one of the most original sci-fi horror films I have seen in a very long time, where the story didn't just boil down to a human versus alien gun fight. This film showcased exceptional character development, realistic CGI (even better than some of the modern Hollywood films), and gave enough of a glimpse of Soviet ruled Russia for a foreign audience to both understand and enjoy.This film wasn't half-assed in designing its extraterrestrial organism. It was well thought out and scientific, and its means of sustenance is very original. It's also refreshing to watch a film that doesn't rely on over-exposition. The characters are both convincing and relatable, their emotions carefully conveyed by the actors who did extraordinarily well.One of the reviews unfairly criticized this film for borrowing ideas from popular Hollywood sci-fis, because at this point, most ideas from films are borrowed from another. There is only a number of possible angles that an alien sci-fi can take, and despite that, Sputnik still managed to show some originality.8 stars and 8 thumbs up! (^_^)"}, {"id": 46, "text": "So here's a possible reading of the film. It's all a metaphor for a man escaping from the hold the Oedipal Complex (obsessive love of mother) has over his mind. Excuse some of the misogynistic themes ahead. I didn't make the film, I'm only trying to analyse it ;-) The return from space was the birth process including the way the alien (representing his mother's will) kills his brother who represents his free-willed alter ego. The conversation in the shuttle showed the protagonist has some kind of troubled life while the partner, who ends up dead on arrival, is a happy-go-lucky character without hang-ups. No fun allowed with a controlling mother around! So the father figure, played by the military officer who seeks out the psychiatrist, sets out to find a way to understand this mother-son conflict. He brings in no less than a very attractive young woman to present a way forward for the 'son.' Upon the first meeting between the young woman and the alien-mother, there is an immediate wary respect. They recognise in each other a fair rival for the protagonist's life and love. They continue to study and circle each other. Finally when the woman goes to meet the alien-mother, it strikes out at her and wounds her. Such is meeting the in-laws in some families ;-) I could go on. There's a lot to say on this. Including how the father-figure wants to harness the power of the mother for destructive purposes. But to get to the point, we find that the alien-mother and the hero-son are so totally entwined that he will not survive without her. The young woman determines that separating him from her is the only way to save him. Eventually she tries this and he 'kills' himself to destroy the alien-mother and its hold on him. In the final scene we see her collect the hero's progeny (son) from an orphanage. This represents her final rescue of the hero-son and starting a new life with him as his new independent free-willed self. The question left for me is what she will become in time. A new mother-figure? Ok, enough. It was a very interesting film. I hope you enjoyed it too."}, {"id": 47, "text": "Hard to believe this is the director's first feature. Solid sci-fi horror film with strong characterization and strong tension and mood and also presents one of the most terrifying movie monsters I've seen in a while. Oksana Akinshina gives a soulful performance.Oksana Akinshina, Fedor Bondarchuk, Pyotr Fyodorov, Oleg Karpachev (music), Maxim Zhukov (Cinematography) I gave a standing ovation."}, {"id": 48, "text": "A wholeheartedly agree with the Wall Street journal's review of Sputnik, which describes it as a creature feature with flare. It is essentially a combination of The Quatermass Experiment and Alien. Production values are high, the actors give very solid performances, and there is more character development than you might expect from this kind of movie, but not the kind of melodramatic character development that can bog down an action movie.I found the very ending to be a bit confusing and am a little embarrassed to admit that I had to turn to the Wikipedia plot description to understand what happened in the closing moments. In any case, far, far above average for sci-fi horror direct to video, and an entertaining genre flick by any reasonable standard."}, {"id": 49, "text": "Director/production - 8; Story - 7; Cinematography - 8; Acting - 7; Makeup/FX - 8; Sound - 8; Music - 6; Personal motivation - 8; My average 7,5What movie makers in Hollywood don't wanna do or dare to do these days, can make foreign movies great. See this one as a example."}, {"id": 50, "text": "Home invasion, but a different kind. And home being something different than what the original thought was behind the saying. Then again, while we have some cliches here, we also have certainly interesting characters. At least to a degree. Especially the female lead is very interesting (not just because of her looks), the way she acts and how she holds herself up against a male driven force.But later on in the movie she gets a bit two dimensional, almost irratically helpful. While there is an explanation to that at the end of the movie (with a twist), it does not warrant all the things she does. Good deeds never go unpunished? For whom you may ask ... and that would a valid question. But that is nitpicking and would be a bit of disservice to the movie. A movie that is visually also stunning (talking effects here) and does turn it up a notch when it comes to violence, so not for the faint of hearted. Science Fiction friends will love this ..."}, {"id": 51, "text": "I liked this movie. I kinda zoned out on having to read the subtitles and forgot I was watching a Russian film. The movie was entertaining and all, but that last three or four minutes left me confused as all. The shoes? The boy saying he's a girl? The sudden ability to walk? The boy answering to his boy name? I think the writer was trying to convey some symbiosis between the boy and Tanja, however completely missed giving any explanation as to why there would be a bond."}, {"id": 52, "text": "This movie is like a melancholy emotional twisted mishmash of the Alien franchise.. I don't know how many people would enjoy that! I mean we have audiences for emotional movie, yes but combining that with the horror genre is not ahem! Recommended in my honest opinion. So although the VFX is good, the movie falls short of giving a good ending, the start is good though."}, {"id": 53, "text": "I saw a lot of SyFy movies. Loved the thing, species. But this one? The opening was good. But then one hour of stupid Dialoges. A very lame cgi monster. And lots of speaking and no action. The story itself is total flat. Nothing really to mention here. Very disappointed because trailer looked good."}, {"id": 54, "text": "In the ocean of the Hollywood's crap, this movie gives us hope, that great sci-fi is not lost for all. It ask you questions about human nature, it has a great storyline, great actors and great music. I must compare it to Life with Jake Gyllenhaal because in many aspects it's very similar but it is just ... BETTER"}, {"id": 55, "text": "The idea of an alien into the body of a human is not exclusive to Ridley Scott movie. Am I the only one who remembers the Alien invasion through human bodies converted by alien forces in the book Roadside Picnic by the RUSSIAN Strugatzy Brothers (the ultimate Sci-Fi Masterpiece IMHO)? this is in vein of that, in fact the same alien seems to be inspired by those aliens. Knock-out main actress and beautiful OST complete the package. Recommended."}, {"id": 56, "text": "This film may have similarities to other films, but at this point that's bound to happen anymore. Although this movie started out fine, it kind of lost me in the third act. Why would they let the doctor into the room with the creature while wearing a protective suit when they know it may rip her to shreds if she's so vital to their understanding of it?The relationship between the cosmonaut and the doctor didn't feel earned as they have don't end up knowing each other enough to form a bond like the film eventually implies.I suppose the creature did die along with him after he killed himself as they guessed it would, but we don't know because they don't let us know one way or the other.She really barely knew him so why would she adopt his child? Why can the child suddenly have the ability to walk because he puts on a pair of shoes? Why does he suddenly say he's not a boy, and that his name is Tanya, but then answers to his name? Maybe to imply there is some sort of symbiotic link between him and the woman that he never met that suddenly shows up to adopt him? Who knows? The whole sub plot with the child could have been left out completely.On a different note, the acting is pretty good in this film in my opinion and the CGI work on the creature is right up there with some of the best and really sells it, but the valuable time spent shoehorning the kid into the story could have been spent that was very much needed."}, {"id": 57, "text": "It is a bit slow in some parts but an amazing movie. The story is different and hard to know what is going to happen. I like the music and atmospheric sounds. Also the footage is very nice. I just loved it 👽"}, {"id": 58, "text": "Overall I believe it is filled with really good concepts that are not executed as well as they could be or that we haven't seen before. if you want a good alien filled gore thriller, you will enjoy this movie"}, {"id": 59, "text": "As someone else said they nailed the atmosphere of scifi/horror,i'm surprised its a russian film,.as i've seen a few before but they werent at this level ... Dissapointed in the negative comments on here though... I suppose it made me think of spliced the movie sometimes...the main creature was creepy ! if you liked arrival, alien, you'll like this ...."}, {"id": 60, "text": "All the reviewers comparing this to Alien must have a limited scope of sci-fi. The premise immediately reminded me of the Stargate Symbiotes, not a Xenomorph from Alien. Namely that Xenomorphs can't live inside the body they just need something living to incubate inside of until they hatch. The design looks like a combination of Calvin from Life and the Symbiotes from Stargate. I doubt any of the movies/shows I've mentioned directly influenced the writers or directors. The acting is good, it feels very Russian in the tone and mood they set. The cinematography ha wide cuts of bleek colorless environment that sets the mood.I'm not entirely sure what other Americans are expecting going into this but it's not your typical alien flashy thriller. It's an atmospheric kind of mystery and dread leading up to the end.8/10 I couldn't find any obvious and annoying issues with the acting, set design, costumes, graphics or dialogue. 2 stars less than 10 because I do happen to like flashy action thrillers a bit more."}, {"id": 61, "text": "In the trailer I was promised : It wipes the floor with its Hollywood counterparts. Excellent gory nail biter One of the most suspenseful SF movies in yearsWhat movie had they been watching? Because there's absolute no way they've been reviewing Sputnik!"}, {"id": 62, "text": "An immensely poor effort at a sci-fi film (odd one out example of the genre in Russian cinematography) overlaid with clichés and hollow scenes aiming to dwell on the nostalgic atmosphere that has been continuously used in the past decade."}, {"id": 63, "text": "The concep sounds really good, but is Just that, The movie is borring and really slow, is not going enywhere, i hope a remake comes out in the future"}, {"id": 64, "text": "A good symbiote between Alien and ,recently, Venom. The story is interesting, but the ending is a wee disappointment , for me. If you watched it you're gonna think exactly what i was thinking (it should .... to the .....). The effect is good, on par with Hollywood movie. I enjoyed alot."}, {"id": 65, "text": "It's no Arrival but it's definitely worth a watch. The Cinematography, Sound, CGI is pretty good. If you're a SCI-FI fan give it a go."}, {"id": 66, "text": "Like a lot of viewers say the beginning is pretty good but after that it's boring as hell. Was expecting a lot more from this film from other reviews. Thumbs down. 👎👎"}, {"id": 67, "text": "This is the cutest alien after The Life's. Scenario and the visual effects are brilliant."}, {"id": 68, "text": "Didn't expect it to be so good. I liked it very much."}, {"id": 69, "text": "From the double entendre in the title to the ending, this movie was a treat, even charming, which is quite unusual for the genre.It's not in your face horror like Alien or Apollo 18, almost more of a psychological suspense than horror film, despite the clear horror elements.Well acted, interesting characters, nice plot. The characters and plot twists were, while not entirely new, well executed.Would definitely like to see more from this crew."}, {"id": 70, "text": "I was very surprised and pleased with this movie. I expected some lousy horror with a lot of blood and super-heroic characters. Instead, it is a really serious and smart movie about trying to handle a horror creature. The story is not the most complex, but it has its twists and will keep you entertained. What I really enjoyed though is how authentic the 80s were. The movie feels very authentic (coming from Eastern Europe, this is how the 80s felt :D ), which must have taken serious budget. The creature effects are also excellent. I felt that the writing and the execution both holds up throughout. The ending was one of a handful of predictable scenarios, but this does not take away from the fact that this is a well made, enjoyable movie that I can heartily recommend."}, {"id": 71, "text": "High quality film making. No cliches, good storyline, great writing, solid actingWould be ruined by hollywood but be renowned as a sci fi alien classicCannot recommend highly enough. Sound, editor, camera, director all deserve full credit for a solid piece of film making"}, {"id": 72, "text": "The Russian movie industry has a history of sporadically producing thought-provoking sci-fi movies. Tarkovsky's SOLARIS (1972) and STALKER (1979) being notable genre classics.Now we have SPUTNIK, a 2020 movie set in the former Soviet Union of 1983. And its not half-bad.The plot is a re-tread of Nigel Kneale's seminal 1953 British T.V. serial THE QUATERMASS EXPERIMENT and later 1955 Hammer movie version THE QUATERMASS XPERIMENT. In both serial and film, a space mission (British) goes horribly wrong when only one of the three astronauts returns to earth. He is one sick puppy, having been infected by an alien invader and gradually evolves into a murderous monster that must be destroyed.Sputnik-1 was the name given to the first artificial Earth satellite launched into orbit by the Soviet Union in 1957. Sputnik roughly translates into English as attendant, companion, travelling companion or fellow traveller.In SPUTNIK (the movie) something bad happens on a two-man space mission, and upon returning to earth there is only one survivor. He is one sick puppy, having been infected by an alien invader and gradually evolves into a murderous monster that must be destroyed. This time the alien invader can shrink itself down to live inside the astronaut, emerging when he sleeps to feed on cortisol drenched human brains. The astronaut is being held under armed guard at a military installation in Soviet controlled Kazakhstan, where the Colonel in charge recruits a female psychiatrist with an unorthodox approach to help in separating the alien from the man. His objective is to weaponise the alien - now where have we heard that before?Probably goes without saying, it does not end well.This film wears its influences prominently on its sleeve. Mostly, Quatermass and the Alien franchise. That said, if you can get past the feelings of déjà vu - and they do leave weighty impressions, unfortunately - there is a fair degree to enjoy. Gorehounds are well-served with juicy blood splatter and bone crunching sound effects when the alien chows down. And the creature itself is pleasingly rendered in all its slimy, slithering semi-translucent glory, complete with high-pitched scream before it attacks.Performances are adequate, but personally I found I did not relate to or care about any of the characters in any significant way. Konstantin, the astronaut, does not seem all that tormented or concerned about his plight as such - more focussed on escaping to retrieve the son he abandoned to an orphanage. Quite how the kid would respond to being rescued by a father who has an unbreakable symbiotic relationship with a brain-eating alien doesn't appear to be an issue for consideration. Tatyana (the psychiatrist) suspects that if separated for any length of time, both host and alien will die, yet still perseveres in a faintly hare-brained way, and Semirov (the colonel in charge) is little more than a by-the-numbers military villain of the piece - cold, cruel and emotionally blank.It is a bleak little fable, well-made, nicely shot, with a lean and spartan feel to it. Fans of the genre could do worse. A lot worse. Just don't expect a classic."}, {"id": 73, "text": "It's a low budget monster thriller worth watching. Better than other low budget monster horror thrillers from the West. A slow burn thriller in the first hour or so, where you slowly learn of the creature and the experiments conducted. The last third of the film could had done with more exposition on the condition of the cosmonaut, and should had explicitly explored the current motivations of the female lead. Overall, the characters seems real and are well acted onOn other technicalities: Good set design, good cinematography and sound design. Some anachronism, but it is 'possible' that the interior of the base is modeled on a fancy hotel from the era. (there are examples in interior design magazines of the era but heh..if it was truly realistic, it would look hideous on screen)-----Spoilers below which involves the final scene of the movie:They gave the main character the motive and the background to do what she did. Why the attempted escape? Why the drive to separate the specimen when? Why attempt to do all this when it feels like an impossible to the viewer?it is because she had experienced something that is suppose to impossible before as a kid. A medical miracle to realize her dream to walk and run. That also explains what motivated her to attempt to cure cases deemed hopeless, by controversial means (the latest case of hers was adjudged by a committee hearing early on in the film).---critique on critique:some others has said that there is a love interest in this movie. There is none. Nothing remotely romantic is shown between those two main characters."}, {"id": 74, "text": "Sputnik puts most mainstream sci-fi / horror flicks to shame. This Russian thrill ride will creep you out and have you an the edge of your seat.In this film, at the height of the Cold War, the lone survivor of a spaceship incident hasn't returned back home alone; hiding inside his body is a dangerous creature.A slow burn and at times darkly funny, Sputnik is a low budget film that has big budget potential and puts most Hollywood blockbusters to shame. A great story, surprising visuals and a solid cast. There's also just the right amount of gore - it isn't too excessive. If you're into films like Alien or Arrival, you should stream Sputnik.Follow @snobmedia for all reviews!"}, {"id": 75, "text": "Have read a few reviews of people saying it's a rip-off of Alien... I'm not sure what they watched because it was nothing like it bar the alien being inside the cosmonaut! Overall the movie wasn't too bad, it was a refreshing take on the idea of an alien being brought back from space. It's a slow burner, nothing really like the trailer implies and not a whole lot of action/horror scenes.It starts off really well with intense scenes but kind of loses it momentum and goes a bit Hollywood in the later half. Won't go down as one of the best alien movies I've seen but definitely not one of the worst. I would say watch it if alien horror movies interest you, otherwise you're not missing much."}, {"id": 76, "text": "It is 100% in Russian. I turned on my closed captioning with Amazon Prime. If you don't mind that and like Sci fi you'll like it."}, {"id": 77, "text": "I don't write many if any reviews, but with that said I will say this movie is worth your time. If you are a fan of sci-fi and looking for something different but still very enjoyable watch this."}, {"id": 78, "text": "Sputnik is welcome addition to the science fiction horror space genre. Like Event Horizon and Alien before it, it delves deep into the fears around being confined in enclosed spaces and of being possessed by otherworldly creatures.The story line very much pays homage to what has gone before - it wears the Alien influences on it's sleeve, while making itself a unique entry all the same.Oksana Akinshina is fantastic as the scientist Tatyana Klimova, who is hired to examine a cosmonaut's mental state after he returns from space with an unexpected visitor.Stay until the end with this one, you won't be sorry.6/10."}, {"id": 79, "text": "I need to start off by saying I have a real problem with modern Hollywood's movies, especially when it comes to Sci-Fi and Horror. Hollywood always has to appeal to the lowest common denominator, throwing in wise-cracking characters, idiots you are supposed to believe are scientists, sappy love stories and loads of nonsense. Russia instead , has been producing some grand films and Sputnik is right up there with the best of Sci-Fi but without the unlikable characters or even worse, some music star who wants an acting career. This film is exceptionally well done, makes you feel for the actors without throwing in some unbelievable romance, is well acted, beautifully shot, suspenseful and has enough gore to keep it interesting. The special effects are excellent. The 2 leads, Oksana Akinshina and Pyotr Fyodorov ( The Duelist and The Blackout ) are outstanding . A must see for fans of Sci-fi/horror."}, {"id": 80, "text": "This Is a good one, I hate to see movies get bashed when people dont take the time to watch them or simple because they dont like subtitles. Anyways, this is a good film dont judge by the cover."}, {"id": 81, "text": "Sputnik is a refleshing film with drama, horror and Sci-Fi elements. The script is really good, the cinematography is perfect, the setting is creepy and cold, the direction is wonderful and the performances are great. One of the best points of this film is the production values and the great special effects. A modern classic!"}, {"id": 82, "text": "I don't watch Russian cinema, so I didn't know what to expect going in but what I got was a well made film. Sputnik felt like a horror version of Arrival, and while it is no where near as good as Arrival, it is still smartly written and at least tries to have some emotional weight even if the emotional aspects don't quite land. Overall, this was a good watch, and I'm interesting in checking out more Russian films in the future."}, {"id": 83, "text": "Good movie about kosmonaut infected by parasite from space. very intense from start to finish"}, {"id": 84, "text": "I am always pleased to watch cinema from other counties. I was curious what Russia have to offer nowadays and I was quite pleased. The story is nice, do not expect an action movie full explosions and shootout, but instead a slow paced narration that gives a different point of view about the alien invasion genre. Sometimes the movie lose itself in story lines that are underdeveloped, to change suddenly direction, leaving the viewer with even more questions that will remain unanswered. The ending is rushed and does not make any sense.I gave 5 stars out of 10 because main characters are interesting and they have a nice development, special effects are incredibly well done. Overall a watchable movie. For Sci-Fi lovers could be a nice addition to the library, but do not expect something memorable or original."}, {"id": 85, "text": "Great production value, camera work and scares. Suspenseful and creepy. The characters fell a little flat and the story went a little meander in certain points a bit cliched and not fully developed.While I feel the film makers could have made a better film I do feel that as a lover of sci-fi this is still a good entry in this category. Especially during a year when not a lot of new films have come out. I look forward to what they do next."}, {"id": 86, "text": "Sputnik translated as travelling companion is a suspenseful sci-fi horror action film from Russia. It takes place in 1983 when a two astronauts or to be more accurate cosmonauts crash land back to earth. One cosmonaut called Konstantin Veshnyakov survived and he is being held in a secret government facility and undergoing numerous physical and mental tests. A psychiatrist called Tatyana Klimova is brought in to assess his condition. It turns out he has brought back a life form inside him when landing on earth. A life form that is able to use Konstantin as a space suit which it can discard for longer periods of time every day. The question becomes is this life form a parasite or a symbiote and how dangerous it is.Overall Sputnik was a highly entertaining and well acted film. The effects were very good and so was the direction. Fedor Bondarchuck as the villainous Colonel Semiradov was particularly memorable but the rest of the cast was very good as well. The biggest issue with the movie is the somewhat rushed and sort of predictable hollywood ending. However, even though the movie does have similarities to Hollywood movies such as Alien, Life, Appolo 18 and Arrival amongst others i still found it a lot of fun to watch and i particularly liked the score as well as how well the effects were used in what appears to be a tight budget film. A solid 7 out of 10."}, {"id": 87, "text": "It started well, cinematography is good, atmosphere is good, even the story is OK.but it gets a lot weird and confusing on the second part. Acting is poor, sidestories are pointless. Character development is a mess. Story becomes weird and nonsensical.All in all, it is a shame what this movie has become, considering the potential. I wouldn't waste my time watching this."}, {"id": 88, "text": "I was quiet amused of this movie. there is a interesting development in the characters and a alarming tension all the time. Of course, there are some annoying scenes. in the last 30 Minutes the story seems to go nowhere. BUT its still a RUSSIAN SCIFI - you have to remind yourself about that fact! and with a budget of only 2,6 Million US$ really lovely! also i liked the final ending with a nice little revelation, you almost forgot about.I watched in OV - russian language with subtitles for the flair! Liked that too"}, {"id": 89, "text": "This film is very good, human-oriented sci-fi.The plot is building upon the tradition of Soviet sci-fi filmmaking (e.g. Solyaris), as it is focused on the human condition. Cinematography may not be artistically groundbreaking, but it is good. The actors are well-directed and obviously talented for cinema, sparing us of the typical overacting found in the heap of mass-produced sci-fi. The visual effects are great and properly used within the storytelling, not over it. A weak spot is found in the music, which is both uninspired and overused.Overall it's a very enjoyable film both for general audiences who like sci-fi, as well as for the lovers of the sci-fi genre as it has been defined by great writers and directors."}, {"id": 90, "text": "I have just watched this film as as a part of a VOD film festival, and I enjoyed every minute of it. Much more realistic than similar American films. The small crew is stressing the clandestine nature of the investigation. Every scene makes sense and promotes the story. There is very little sentimentality / romance, most of the story is very matter of fact. I would like to see more films of this quality. Regarding comments made here about subtitles - I am very used to them, and I recommend (to Americans especially) to get used to them, otherwise you will miss out on many good movies.I think it is much better to watch every film in its original language. I hate voice overs."}, {"id": 91, "text": "For a Russian film? Excellent. Cinematography, camera views and focus comparable to western styles and standards. Acting excellent: Gives quite an accurate view of blunt and cold personalities in 1983 Russia. And that was its most scary aspect. Interesting twist on an old idea and execution. Alien was a bit silly looking (thin, skinny and shrinking yet having the power to expand and dismantle bodies and crash skulls), but that's a minor point in the overall story. Probably one of the best sci.fi films of 2020 and will likely stay that way for quite some time, given that the idea of alien parasitization has been done to death. Didn't really expect it to be that good. Kudos for a Russian production."}, {"id": 92, "text": "I say this film advertised online as a historic retelling of the Russian space race. It is not that type of film. It's an Alien Sci-Fi movie.It has a good setting as in capturing the coldness of the Soviet architecture back in the 80s. The special effects are good too and the story (while a little shabby in places) is solid. Not too Americanised either.Nice little twist at the end too. Blink and you'll miss it. Very good for modern Sci-Fi."}, {"id": 93, "text": "This one is not like the average alien movies, it has a more serious touch and is ment for those who are able to concentrate on what being said in the movie. If you enjoy the X-files serie you also should be able to enjoy this as a good movie."}, {"id": 94, "text": "All in all I'd say this was a good movie. Better CGI for the creature than I was expecting. Its story isn't necessarily groundbreaking but pulled its weight in a genre thats typically hit or miss."}, {"id": 95, "text": "This film was a mix of Ridley's Alien and Prometheus plus the film Life. Great Xenomorph special effects and great story to go along with it. Great acting and great overall plot. Hoping the Russians will make more similar films in quality."}, {"id": 96, "text": "On par with Life (2017) and an interesting remake of Hollywood's Night of the Blood Beast (1958). Plot could have had more twists and turns, but no complaints with technical aspects, acting, directing, etc. It should have had a US theatrical release, especially for those who wanted a more serious take on Venom (2018)."}, {"id": 97, "text": "Really liked the film, thought the acting, the cinematography, costumes, scenery - all was amazing. Story was very interesting too - though of course nothing new, it was made very interesting by placing the events in the 80s USSR. Creature design was good, too. I felt the ending wasn't as good though, left me with some questions: 1. If the host was killed, wouldn't the creature simply pop out? Or was it at that point too connected to the host? Kind of weird how easily it was killed. 2. The whole story of some sort of commission arriving to rescue Tanya, and she being allowed to get on with her life doesnt seem particularly credible. I know its 80s, not the 50s, but still. I feel she would have been locked up in some mental hospital somewhere to cover it all up. Apart from that, great film. Pleasure to watch."}, {"id": 98, "text": "I see a few reviews comparing it to Alien or it's no alien but myself I'd liken it more to 2017's life which deals with the same sort of ideas. I don't watch many foreign movies either, the last russian sci fi's I remember being nightwatch and daywatch from 2004-06 so it was good to see another well made movie from there. The score is hauntingly brilliant as is the aliens design.I wont go into the story as i'm terrible at explaining in a write up but other than that it's just one of those movies thats worth a watch."}, {"id": 99, "text": "Really enjoyed this. Definitely worth a watch if this type of thing is your go you'll really enjoy it. Would've given 6.5 if they'd let us do halves."}, {"id": 100, "text": "Despite being a cliché full of conspicuous logical discrepancies - it's a cliché with completely new approach to one of the major plot elements, and logical errors are the hallmark of this genre. Good cinematography, detailed world-class level CGI and a pleasant overall experience except for the very end of the movie makes up this simple statement: far from being a masterpiece, but still fun to watch. Once. I lowered my rating from 7 to 6 because of the last 3 minutes of the movie for which would be better if they didn't exist. I also had the feeling that it could've been written much better, potentially resulting in a rating of 8 or more."}, {"id": 101, "text": "A doctor specializing in neurobehavioral science is sent to a remote facility, to study the sole survivor of a space mission that went horribly wrong. Little does she or the astronaut know, that he didn't return home alone. Director Egor Abramenko delivers a suspenseful and gorrific thriller that was a great watch from start to finish."}, {"id": 102, "text": "But I don't understand why people are comparing it to Alien. There is no comparison...far from one."}, {"id": 103, "text": "On most levels the movie is well made. I like the cinematography and the acting. The music can be a bit much but it works well for the most part. The script is where it falls apart.The setup for the movie is intriguing, the rest seems like they didn't know where to go. It turns into an almost love story that they don't commit to. The main character has a goal to achieve but it never feels like she's doing much. Mostly just observing. For the ending to happen the way it did, everyone needed to make the dumbest decisions they could for not much reason.Also, this isn't horror. There are violent deaths, but the movie never tries to unnerve or scare you. Never did I feel that the characters were in danger."}, {"id": 104, "text": "I'm myself one of those comments dependant watchers but this time i gave it a try without reading any comments at all. The story keeps you engaged till the end. Very good camera work. Actor's performance on top. You don't care about cgi. And the end is the best part of this movie . Give it a try. And Sputnik has two definitions one it means a partner and the second the name of first manned spaceship."}, {"id": 105, "text": "Dissapointed after seeing the high reviews. Slow pacing, below average effects, nothing related to Alien or Life as some mentioned, unispiring and hasted ending. Lost two hours."}, {"id": 106, "text": "This movie is long on atmosphere, romance and evil humans, and short on fear or an intimidating, terrifying alien presence. It promises many things it never delivers and the alien is so ambiguous, as to it's plan or motivation. Nothing gets resolved, really. And who needs two love-birds in this setting, anyway? I was very disappointed, after all the alien chatter. And what was up with that ending? Is the woman in a biologically symbiotic state with the girl/boy(not sure) she has never met and has no reason to connect to?"}, {"id": 107, "text": "Leave alone the unoriginal plot and borderline bad acting, this Russian-made film has a Hollywoodish, c-grade movie feel to it. That is, disregard to details and lack of any depths to the characters when it comes to portraying anyone non-American. Not to mention the contradicting motives of pretty much everyone involved. We used to laugh at American movies portraying Russians (or Russia), well, the laugh is on us now. O. Akinshina, who, by the way, has only two facial expressions throughout the movie: annoyed discontent and irritated indifference, plays Tatyana - a doctor with moral values, who is trying to save everyone. None of it, of course, is true since she is only trying to save one person (who, in his turn, is a threat to pretty much every living thing on Earth and she KNOWS it), while countless others are being slaughtered left and right as a direct result of her actions. The portrait of her heroine wouldn't be complete without mentioning that she has to express her annoyance at everything and everyone soviet in every second phrase she is saying i.e. every 5-10 minutes. Mr. Bondarchuk can actually be very entertaining, e.g. Down House or $ 8 1/2. Not this time though. He seems tired and uninterested. The rest of the cast isn't really worth mentioning. Another disappointing effort from Russia. 1/10"}, {"id": 108, "text": "Nice Russian sci-fi thriller horror. Great special effects and atmosphere too. Decent acting. 7 stars.I really liked how they executed the Soviet aesthetic in the movie too. Combine that with an alien and you get a pretty entertaining movie.3 stars for the story. I expected a little more background/discovery of the origins of the alien. I felt like the movie over explained the alien's reasons for inhabiting the hosts too. Kinda expected more soviet analysis on the origin and where it came from. But that's just me.Oh, and for a very fit soldier, that jogging scene was pretty poor. They ran like what, 10-15 meters and they suddenly stopped. He's like we need to sleep. Dude you just crushed the fitness tests how's jogging 15 meters suddenly a problem? :)"}, {"id": 109, "text": "This movie is long on atmosphere, romance and evil humans, and short on fear or an intimidating, terrifying alien presence. It promises many things it never delivers and the alien is so ambiguous, as to it's plan or motivation. Nothing gets resolved, really. And who needs two love-birds in this setting, anyway? I was very disappointed, after all the alien chatter. And what was up with that ending? Is the woman in a biologically symbiotic state with the girl/boy(not sure) she has never met and has no reason to connect to?"}, {"id": 110, "text": "Am I supposed to tell you how I felt or what the movie was about or both? I didn't feel bored. But to compare it to Alien is laughable. Better compare to Parasite or something of that nature. An alien hitches a ride to earth in a space capsule. How fast was that capsule traveling when the alien landing on it? impossible? maybe. It was enjoyable. But that powerful for its size. Probably not. Anyway. Give it a look see. You will enjoy it but not up to the caliber of anything close to Alien."}, {"id": 111, "text": "It started out fine but further and further the film just falls apart. The woman actress has the same expression throughout the entire film. I'm sorry but she was not the right choice for the role. Her motivation for helping the man escape make zero sense. She suddenly felt some bond to him during their 10 minutes of screen time together? Terrible tacked weird romance subplot. The alien feeds on cortisol when it leaves his body at night. Ok? So what's the plan for when he escapes and it starts killing people? She's not ok w/ killing rapists and murderers but she doesn't flinch as the alien obliterates soldiers and scientists? The guy can control the alien... only when the the main character is involved apparently. Again non sensical writing. He likes her so much that he's somehow able to keep the alien from attacking her? What? Why would they release the alien in the open when they saw it didn't attack her the first time and she even mentioned to the kernel he had some control over it? Bad writing or these highly trained professionals are incredibly stupid. How does she escape in the end Scott free? We just get a cut to her outside the orphanage with no explanation whatsoever. Where did the alien come from? It was just floating randomly in space? How was it surviving before? She adopted a random kid for really no reason at all.This film is just dumb and full of plot holes. Throw out the stupid semi romance plot completely, explain the bond between the creature and host more thoroughly, get a different lead actress, and this could have been a decent film. Anyone rating this high clearly doesn't have a brain."}, {"id": 112, "text": "This movie doesn't get Alien. It lacks tension, and is a creature flick. Sputnik isn't thought provoking, but a pretentious film. Alien worked because of the cosmic horror influence from H.P. Lovecraft. Many films like 2001 Space Odyssey, and The Shining took inspiration from Lovecraft. This film pastiches Alien, but doesn't understand the fundamental basics why the film Alien worked."}, {"id": 113, "text": "Really didn't enjoy this...a major letdown. The cinematography was decent but overall, left much to be desired. didn't enjoy the ending and borders on silly. Can't recommend this to anyone..."}, {"id": 114, "text": "It says available in Russian and Latin? That cant be true"}, {"id": 115, "text": "An astronaut, rather, cosmonaut returns ,,impregnated,, with an alien life form and the movie shows how the russians have him tested in a military facility. The creature is a white pale skin one like in Prometheus. It kills people but could be controlled by its host as the host doesnt die but lives to be home for it. The scientist is a woman and thats that. Its a ripp of of the Alien serie. Bland, unimaginative, boring, unoriginal. Dont recomand."}, {"id": 116, "text": "6.5/10, maybe a 7 if I feel generous (which I don't at the moment). The movie is simply just okay. Nothing special about it. If you have nothing better to do than watching this movie to kill almost 2 hours of your day is perfectly fine. You can do so so so much worse than this film (and you can do so much better, but rarely in 2020). One of those movies that you'll see once and when the credits start to roll, you will never think about it again in your life."}, {"id": 117, "text": "I might edit my review after this but trying to watch on Apple TV after paying seven dollars I couldn't keep up with the close captioning and I challenge anyone to try and keep up with those captions and make sense of this movie. I'm only halfway through and I've already asked Apple for a refund. Might be a great movie and if I can actually understand what they're saying, I am happy to edit my review"}, {"id": 118, "text": "Started great, a mix of an x-files episode and Alien . Nice . I like the whole USSR atmosphere. Technically, the movie looks and sounds great, the acting is good. My only issue is with the story, it should have been smarter or/or less predictable.Overall good, very impressed with Russian cinema , it looks Hollywood level. I watched it in Russian and English subtitles."}, {"id": 119, "text": "Let me guess everyone or mostly many have watched flicks like - Life, the thing,alien etc etc and expect more out of this but dont be skeptical about this one and its flaws to be honest the filmmakers wanted this movie to be a alien (or symbiote) that hunts but doesn't waste time in stalking they got 2 elements right. 1.characterization and display of the alien itself 2.Gore . but most of the time has been spent on the a female character trying to decrypt the situation there than the main lead itself where there is no proper backstory or support which felt like a letdown since she done alot of talking syncing with the character as she was supposed to . and i cant say about the other characters since most of them were generic like most alien movies are and always be. ( Weaponize aliens lol) it is worth a watch and times when horror movies are rare during c virus this movie did NOT BAD.. I sincerely hope they do justice to this alien ."}, {"id": 120, "text": "Couldnt make head nor tail of it!! was all in foreign!!! unless you can speak fluent sputnikion bypass this!!! didnt even have good music!"}, {"id": 121, "text": "I wanted to like it, I gave it a chance but I couldn't watch it all the way until the end. No character development (except Tatyana), slow, boring and depressing. The constant addressing to people by both first and last name is do distracting. I understand Russian enough to watch movie without subtitles but this formal talk goes to my nerves and simply make the movie unwatchable."}, {"id": 122, "text": "Definitely story could have been better,but what a nice film it is!Especially personally for me,as I grew up in CCCP,in years depicted in the film,so for me it was even more important to notice,how many smallest details about that times they got correctly and nicely!Got nostalgic) Anyhow,very decent film.Recommended!"}, {"id": 123, "text": "Seen it at the science+fiction festival in Trieste, in Russian with subtitles. This is a magnificent, old school, sci fi movie. There is everything: the space journey, the alien, the lone hero looking for atonement. A hidden gem"}, {"id": 124, "text": "This movie puts a lot of Hollywood movies to shame! From the visual effects to the story telling everything is masterfully done. Russian art has a unique style, and they incorporated it excellently with modern lighting techniques, color grading and special effects. I hope we'll see more similar movies in the future!"}, {"id": 125, "text": "SputnikThis was a stylish and sophisticated sci-fi thriller. I was gripped by the near gothic styling, music and lighting that heaped dramatic impetus in this highly unpredictable movie.Some scenes of a brutal nature were handled masterfully as were most of the action sequences.Yes there were some plot holes and some strange contrivances but this was overall a really great movie and I thoroughly recommend it.I'm giving it a hard 7"}, {"id": 126, "text": "If you watched the excellent Life sci-fi horror thriller, this is its spiritual sequel. A cosmonaut returns with an alien life form in this slow-burn Russian export."}, {"id": 127, "text": "The movie is good. The Hollywood recipe is used to choose the theme of the film, inserting a series of metaphors along the way that lead us to the idea that: the one who manages to control does so only through and with the help of FEAR, and the one who frees himself from fear becomes his own master. and in the conditions of living in a dictatorship. The film has everything, suspense, intrigue, love story, action, is quite alert, is well played, there are some leaks but overall I would give it a grade of 9."}, {"id": 128, "text": "A pretty good, refreshing take on the genre. Though i don't understand what the kid got anything to do with anything on this movie."}, {"id": 129, "text": "Disclaimer: I am based out of the US and am not a commie or a trump supporter or any sort of biased reviewer. This is solely based on my interpretation of film making as a whole.This is a well acted, directed, edited and thought provoking sci fi film. Oksana A the main actress is stellar, she needs to be in more AAA titles end of story. Solid B rated film, with a larger budget I have no doubt this cast and crew could have pumped out an A rated film."}, {"id": 130, "text": "An 88% RT score convinced me to watch this space horror-thriller and it was well worth it! Director Egor Abramenko's dark, brooding narrative piques one's curiosity from the word go and the novelty in the storyline does the rest, backed by cutting edge special effects work. Oksana Akinshina (Bourne Supremacy) lets her expressive eyes do most of the acting, with minimal dialogues and chilling sound effects accentuating the thrills during the alien attack sequences. A nail-biting, intelligent horror-thriller that merges sci-fi and the chills to give you an amalgamated end result that is definitely worth an evening viewing. Recommended"}, {"id": 131, "text": "I loved this film. Its set in the cold war and the backdrop looks bang on. The acting and effects are well worth a watch. The subtitles put me off watching this, but when I eventually did. I totally enjoyed it."}, {"id": 132, "text": "Too bad this movie turned out to suck for me. I don't really watch all that many Russian movies, but it's been a few. This got me interested the day I first heard about it. Being a BIG BIG BIG fan of Alien, Life and a lot of other sci-fi horror movies like these, I got really disappointed. The story had great potential, but it got turned around to something stupid and quite honestly boring.If you love the classic Alien movies and such, I would just skip this movie. 4/10"}, {"id": 133, "text": "Useful if you are looking for a Russian translation of every American SF movie cliché ever written."}, {"id": 134, "text": "I think they could have done so much more with the second half and created a really good suspenseful movie, but they obviously ran out of a believable plot ending and it falls flat.The CGI and setting are actually surprisingly good and it kept me entertained. The subplot about his son was just extra filler and was not needed as well as the extended ending with an extra twist to get the audience a little something to think about.Perhaps a better ending would have been if Tatianna put the Alien inside her and then carried it to the orphan boy who then used it to get out of his wheelchair. With all the screen time of this useless subplot of the orphan this was probably the original gotcha ending and then they changed it up afterwards.I'm not sure any ending would have helped though, the film already badly paints itself into a corner and can't conclude effectively."}, {"id": 135, "text": "I'm not one that likes to watch a foreign film with almost 2 hour of subtitles but I make an exemption for this film.What starts out as a routine space film soon spirals out of control and descends into a journey of discovery, repercussions &amp; consequences.This is a slow burner with an interesting storyline about a cosmonaut returning from space with an unexplained dead comrade. He is quarantined and held captive to discover the cause of said incident. It is obvious that he has brought something back from space and the scientists are trying their best to understand and use it for their interest.A troubled doctor, Tatyana Kilmova (Oksana Akinshina) is at a hearing and the board members are deliberating on her punishment. An opportunist Colonel Semiradov (Fedor Bondarchuk) oversees this and offers her a chance to work for him with the pretence that if she does a good job maybe he can use his influence to save her career. With her they go to a secret military base to continue work to discover the circumstances in which this tragedy occurs and to understand what lies beneath...If you like space films then you should give this a watch. It is character driven and you get to know the protagonists and antagonists confined into this military base. The characters are in a metaphorical slow burning caldron &amp; simmering away &amp; we await for it to boil over &amp; what a pay off it is!"}, {"id": 136, "text": "Much better than most of the recent Russian productions I'd come across in the previous decade, whether I watched them in their entirety or chose not to waste my time with them at all.A fairly original approach to the alien body-snatcher cliche. This time instead of just having random carnage like in a computer game (hint: Alien or Doom), there is an actual symbiotic relationship between the creature and his host, and this is explored (quasi) scientifically, and from several dramatic angles as well: something we're not used to from American movies which are nearly always very straight-forward and dumb with this theme.Sure, there are the usual military-wants-to-use-alien-as-weapon cliches, but at least for once it isn't the U.S. military but the Russian military - or to be more precise the Soviet one. This is set in 1983.Considering that Putin's tyrannical, mentally ill regime has a rather schizophrenic attitude toward the USSR, it was interesting to see how the USSR would be portrayed. It is portrayed as corrupt and inhuman, here at least. Perhaps the next Russian movie set in the USSR will be pro-Soviet? That would be in line with the afore-mentioned schizophrenia. This is assuming that Putin's censorship team is in full control of all scripts (i.e. scripts depend on their approval), which is a logical assumption in such a control-freakish 100% dictatorship such as the one in current Russia.I do have an issue about Oksana's common sense though. She is against feeding the creature with live prisoners. Considering that these prisoners are all child-killers (or similar scum), then not only is the decision justifiable but ingenious. What a great punishment to have such deviants fed to a head-crushing monster! Furthermore, Oksana wants to risk bringing the cosmo-nut into the civilian population, completely disregarding the havoc the monster could wreck there. She seems to believe that the life of one person is more worth than that of many. The hell?...Besides, the real Soviet Union wouldn't feed deviants to the monster, it would feed political prisoners to it. They'd actually recruit the deviants into the KGB. (The more intelligent deviants would become spies, the dumb ones would sweep the floors.) Could this be how Putin got recruited into the KGB? Did he slaughter children in a kindergarten? Just speculating...The writer wanted so badly for Oksana and the astronaut to escape the base but... well... escape from a top-secret Soviet military base would have been pretty much impossible, which is why the writer resorted to some rather flimsy, unconvincing plot-devices:1. Allowing the cosmo-nut to have more freedom made little sense. The creature was extremely dangerous and it may have been becoming more independent, or at least stronger, with time. Giving him new quarters was illogical.2. Allowing the cosmo-nut to mingle with Oksana outside - pretty much unsupervised as far as conversations go - made very little sense too.3. Oksana convincing the Nobel Prize hopeful doctor to help her - hence pretty much to seal his own fate - also seemed far-fetched.4. Oksana and the cosmo-nut being shot at by Soviet's elite forces at close range, yet missing her, was far-fetched.5. The jeep leaving the base: also not realistic.Still, despite the movies screenplay flaws the story is developed interestingly and fairly competently. The dialog isn't the kind of Mickey Mouse crap we get in American monster movies (whether 50s B-movies or recent big-budget: not much difference there). That Oksana falls for the astro-nut is a bit too convenient for the writer, but I guess he needed certain things to play out the way he'd intended.A slick movie, but with a better written, more logical first half. But then, isn't that nearly always the case in such movies? The resolution (in thrillers/horrors/mysteries) is usually where most of the nonsense occurs, when the logic falls apart i.e. is sacrificed to the needs of the story, but at least I wasn't bored with it. And none of the nonsense was too annoying or hugely stupid.The movie offers a unique situation, whereby the host of a body snatcher - in a way - takes part in cannibal behaviour (though not intentionally). This presents a fun philosophical dilemma: did the cosmo-nut become a cannibal or not?"}, {"id": 137, "text": "The atmosphere presented was ghastly and the plot was simple. hits all the spots of horror sci fi movie. more please"}, {"id": 138, "text": "I liked generally teh movie and the URSS atmosphere of the 80's. Pity they could be better plot and increase the psycological aspects of the problem. Ending left me little disappointed"}, {"id": 139, "text": "I enjoeyed some scenes of this film. I found some characters interesting and I was genuinely interested in the alien species. Nevertheless, I think this film doesn't amount to anything great. The acting isn't bad and in the end the film is watchable, but I would also say that this film doesn't do anything new.Furthermore, the whole debate about political power dynamics and authorities is a bit of a cliche and quite frankly corny, I understand this film was made in Russia, but it's not an excuse to forward a corny picture.I would say it is a film worth watching once, but it's not a film I will rewatch any time soon."}, {"id": 140, "text": "After seeing this film was confused at the ending so I checked one review that explains it.. nevertheless really didn't make a difference on my opinion. Bottom line I really didn't care what happened to any of the characters, the love story angle didn't work , the creature was like whatever, not scary in the least, was watchable true but then afterwards it was easily forgotten."}, {"id": 141, "text": "I know something about Russian cinema (I live near Russia and I speak Russian).Let me explain why this movie is not what it could've been.First of all, modern big-budget Russian cinema is desperately trying to copy Hollywood-style productions and franchises, they even borrow some scripts and ideas (which is fine, many European filmmakers do this). Indie Russian filmmakers mostly do other types of films and there are lots of great Russian films out there, like Durak (2014), Leviathan (2014), Zhit (2010), Zavod (2018) and many more.This film is not an exception in terms of Hollywood copy-pasting. Up to around 1 hr mark, they just copy scenes and concepts from popular films like Annihilation, Venom, Gravity (opening scene), Arrival, After Earth, and Alien Covenant. This is a common practice since sometimes they just straight-up rip off scripts and whole films like Nochnye strazhi (2016) (MIB rip-off with vampires), Den D (2008) (Commando scene-by-scene ripoff), Voin (2015) (a rip-off of Warrior (2011) and many, many more.They do this copy-paste pretty well, the cinematography is great, the 80ties Soviet-era setting works although they never really dive deep into it since this film was made for international release and most of the more complicated stuff just wouldn't be understood. In this film though they re-create those scenes not exactly knowing what they are meant to establish. Many scenes are supposed to be emotional but not in this film, they clearly misunderstood the tone of some of those since the music is heavily misused in this. Like the scene where the doctor is transported to the facility, which was taken from the Arrival, but they play military-style music which does not fit well into the delving into the unknown style of the scene, more like an action film build-up.Right around 1hr mark, they run of these and just start making their own stuff up, making really big stretches in terms of the script. Since the premise was a mix of other films they didn't really know where to go with this and thus, the film transformed into a mess of unbelievable scenes and random unnecessary subplots. Character motivation is completely dropped and all the things the characters do make absolutely no sense, nobody knows what and why they are doing.The kid subplot was so incredibly unnecessary and disconnected that removing it from the story would change absolutely nothing. I have absolutely no idea why it was even included (probably because of using this mix of ideas they didn't really know what genre the film is supposed to be, a sci-fi horror? a family drama? who knows).The ending is very messy and kind of defeats the purpose of most of the unmotivated character actions, which is a staple of these types of films.We will surely see more of these since foreign markets are very profitable, and since most of these big productions are co-funded by Fond Kino (Cinema Fund, Russian governmental organization), the creators are not really scared of losing money and are just trying to build up better visuals and more recognizable imagery to sell their product worldwide.Even though this film was quite a mess, I still want to give props to the filmmakers (one of which is the son of a great Soviet director Sergei Bondarchuk (the author of many great films and even an oscar-winning Voyna i mir (1966-67), who plays the commander in this one) for achieving a technical level of a good Hollywood production.Too bad they had no original concept or a general idea of what they are trying to show.Hope this review makes it easier for foreign viewers to understand and appreciate this film for what it is."}, {"id": 142, "text": "This movie starts off well enough with an intriguing, if a little slow account of the aftermath of a Russian space craft's return to earth. There is a good deal of suspense throughout the movie and its well acted and reasonably well directed. The problems stem from the failing plot that surfaces about an hour into the screenplay where the focus shifts from the extraterrestrial and scientific aspect of the events, to one of inter-Soviet self interest, coupled with professional ambition, deceit and posturing.This is all done fairly badly and is incongruous with the preceding story line. The result is a sudden and very disjointed feeling from what was a quite immersive film experience. I'm not sure why this was done, but I suspect it was a foolish attempt to add depth and dimension to a plot that really needed something quite spectacular to successfully bring it to conclusion given the topic at hand.Though this isn't Alien, or anything like a number of other titles involving extraterrestrial or extraordinary beings unwittingly coming to be present normal life, It is s subject that has been breached numerous occasions, and finding a unique path for development which is successful isn't always easy. Here, the plot becomes messy, the scenes and dialog delusive, and progression of the story becomes dependant and the characters making unrealistic decisions, poor choices, and atypical behaviour.I definitely liked it initially, but sadly I began rolling my eyes with the later developments and by the end I was fairly disappointed with what really should have been a good film.Old Hollywood films always had romance in them. It didn't matter if it was a Spy film, Sci-Fi, Comedy, Thriller or some other genre. There was always some romantic subplot thrown in for good measure. This movie had aspects of this dated approach included for reasons I can only guess, and the results made it feel stilted and hackneyed, especially because it was done so obtusely.I can't recommend it in all honesty, though I think a six is a fair enough score given it did have some good aspects."}, {"id": 143, "text": "I am happy to see that Russian scifi films are finally moving towards the Russian scifi literature that I loved so much as a child. This is a wonderful little gem, a Russian version of Life, but with more focus on the people and less on the special effects and action scenes. Not perfect, mind you, but so far the best Russian science fiction film I've seen them make recently. And the special effects were very good, too, which makes the decision to keep them in the background so much more laudable.The weakest link is the main character, unfortunately, who does things that make little sense for a scientist. Yet her contribution is not that of a character, but as a carrier of the audience, so what she does is really not that relevant.I hope Russian cinema will start bringing back the intellectual slow burn story, the civilian scientists that have to solve problems without relying on strength or weapons, but on their own thinking."}, {"id": 144, "text": "Cinematography (camera, pace, lighting, angles) is top-notch. Score is majestic and utterly suggestive of a dark, claustrophobic atmosphere and the sense of grappling with the unknown. Acting is good enough. However, the story goes nowhere really. The reach of the plot runs out at just over an hour, once the picture has become clear of what the situation is. From there on, it becomes nonsensical, as it lacks a credible motivation for the main characters' choices of course of action. There is also little reason behind a middle ranked army officer keeping all of this secret from headquarters. And the child subplot is rather superfluous and contributes nothing. The resolution of the story is hasty and fairly commonplace, a sign of the script having run out of original ideas.The film is, therefore, a mixed bag. Technically, it stands its ground very well against better and more expensive sci-fi productions from Hollywood . It is true that special effects and CGI are sparse here, but this film is not meant to tread the same roads as thinly-scripted, CGI-heavy, teen sensations like Transformers. Instead, a well worked out script would have allowed expert direction to make this into a solid, sober and tense, sci-fi drama."}, {"id": 145, "text": "The quiet place,Ad astra,high life You name it,this movie is better than all of them combined .Yes u read it right. What a beautiful cinema! Oh my,where to start? First this movie will seem a little slow,dull,same premise,same objective as any other alien sci-fi movies But at the middle you ll see something's are different in this movie,i wont reveal them but they are terrific and perfectly understandable.Why every alien would want to kill an alien? Is it necessary because its horror genre s groundwork? Kudos to that director for his innovative idea. Cinematography and background score is cryptic and emotional,fits like a symbiote.Go for it,you won't regret.. This movie deserves alot more praise. And anybody not understanding this, need to watch the movie on its emotional ground And forget about the sci fi element."}, {"id": 146, "text": "I don't normally write reviews but felt I had to, as I don't understand the low scores.I'm a big fan of sci fi, and I like stumbling across finds like this.Maybe I went into it not expecting much, as the alien parasite thing has been done before, usually by Hollywood. But I was pleasantly surprised.Great acting performances throughout, and great camera work.It was suspenseful and I was on the edge of my seat the entire time. At almost 2 hours long I barely noticed. I liked that I couldn't predict what was next.Great script and the ending topped it all off.Even the effects were good.Give it a go!"}, {"id": 147, "text": "Frankly, I don't like subtitles movies. I usually don't watch them because I find it difficult to watch both the visuals of the movie while concentrating on reading the subtitles. After the opening scenes I didn't care, I was already too interested in watching the plot unfold.If this movie was filmed in English, or with Hollywood actors, I can't see it being any better. Director, Egor Abramenko and whoever cast this group of actors chose the best cast for the job, and they were exceptional in my opinion.Some may say this is just another rip-off from previously made Hollywood blockbuster films. But isn't that true for almost all films? All directors and producers attempt to achieve the same success all horror and sci-fi films strive for? The plot is unlike others in how this movie unfolds, and continues to tease and taunt you for 110 minutes. The last 3 are just as important however, and they help us conclude the story.So, not only does the movie ebb and flow very well, it also teases you with a sub-plot that waits until the last few moments to reveal itself.Well worth the 113 minutes!"}, {"id": 148, "text": "Let me start by saying this is the best alien/host/assimilation film since, quite possibly the Alien franchise started, and go as far as, its better than the everything after the first two Ridley/Cameron entries into the franchise. Instead of bloated, macro-budgeted, shiny yawn fests---with Sputnik you get the atmospheres, the buildup, a real story line with character development, the horror/tension element coupled with the releaseI enjoyed this film. A lot. Maybe it was the need to watch something that felt a little more grounded and less production driven...from the opening sequence, the overwhelming sense of dread is amplified by the cinematography, sound direction a well as excellent acting throughout. This one moves along at a nice pace. As derivative as the story IS, the storylines intersect on occasion of past alien host films, but they soon evolve into something beyond what you have seen before. Old world USSR political ideology, aliens seen as the future of super weaponry and power moves within controlling the host, the doctors involved with treatment and containment of the hosting astronaut along with his past trauma just make for a more interesting take on the genre.Ambiguity and mystery shroud the ending a bit, but a more than enjoyable neo-classic genre entry.My only complaint, and a mild one--- was the conceptual CG design of the creature, but the film was more than likely, not knowing the budget while reviewing this, constrained a bit---knowing this aligns more with arthouse than Hollywood blockbuster production scaled budget7.8/10Worth a look, Russian language film/subtitled in English"}, {"id": 149, "text": "There's a genuine sense of creeping dread in Sputnik. Its disturbingly biological, figuratively as well as literally horrifying. It shows us how alien we can be to each other, as much as we are, relatively speaking, alien to something from beyond the stars.Obviously, the immediate point of gravity for this film is Ridley Scotts 1979 film Alien. Let me start by saying it only superifcally bears a resemblence. This is very much its own film. Its a slow burn sci fi, monster mash up, that's as much psychological, as it is literal.Does it work? Well, sort of. There's some moments of genuine tension and terror, as well as a sickening sense of what people are capable of doing to each other. Who's the real monster is a question that sticks its ugly head up.Action is on offer too but its very brief and over almost before it began. Whats left is interesting but does not serve up enough bite on the action or psychological terror front, to really amount to more than a entree, when a main is called for.6/10 from me."}, {"id": 150, "text": "REVIEW - SPUTNIKReleased 14 August 20With a lot of films pushed back to next year because of the pandemic I have been watching some films from other countries and the latest is a Russian film so warning there will be subtitles.2 astronauts in space hear footsteps on their capsule, upon returning to earth they have not returned alone.As with many films this starts off great with the introduction of the characters and especially the reveal of the alien but becomes disjointed with the introduction of a son that the surviving astronaut left behind to go into space but the main problem with this otherwise great film was why would the female lead character suddenly decide to help the astronaut to escape especially after what she witnessed in the pen?This could and should have been so much more.Rating 6 out of 10"}, {"id": 151, "text": "I had no idea what I was getting myself into when I sat down to watch the 2020 Russian sci-fi horror movie from director Egor Abramenko. In fact, I hadn't even heard about the movie prior to actually sitting down to watch it.However, I must say that the movie's poster and cover was definitely interesting and served to lure me in.And I am glad that it did, because writers Oleg Malovichko and Andrei Zolotarev really put together a very enjoyable and entertaining movie. I liked the storyline and how it panned out. And truth be told, then there wasn't really a dull moment throughout the course of the almost 2 hours that the movie ran for.Don't let the fact that this is a Russian movie put you off, because you will definitely be missing out on an interesting movie if you opt to skip on it solely because of the language.I can't claim to be familiar with a single person on the cast list, and that is something that I enjoy. And I will say that they had a great ensemble of casted actors and actresses to portray the various roles and characters in the movie. And that definitely added to the overall enjoyment that is Sputnik.Normally sci-fi is not my go-to genre of movies, nor is it one that I actively avoid. But every now and again there are sci-fi movies that catch my interest and entertain me. And Sputnik was definitely one such movie.Right, well before I forget, then the special effects and CGI should be mentioned. Wow. Just wow. The special effects team and CGI team definitely knew what they were doing. And the alien creature looked really realistic - if there is such a thing to be said about aliens, if you believe in them or not. But color me impressed. It was really nice to look at with such great CGI effects.All in all, Sputnik turned out to be a great movie, and if you enjoy a darker sci-fi movie with elements of horror to it, then you should most certainly sit down to watch Sputnik. My rating of this 2020 movie is a solid seven out of ten stars. It is well worth the time, money and effort."}, {"id": 152, "text": "The criminally easy pitch for Sputnik is to assign the movie as Russia's Alien. Ridley Scott's 1979 masterpiece is inspiring, imitated and, most times, blatantly replicated, to borrow a word from another of Scott's resume. Fortunately, Sputnik is more inspirational work than a mere copy. Whereas Alien might bring more blood to the game, Sputnik counters with flesh, and all the emotions that come within.In these times of reboots and reimagines, Sputnik breeds nostalgia. More Stranger Things than slasher scare. More Starman philosophical than Predator rampage. And when the lights go out? As fun as Gremlins.The year is 1983 and Soviet cosmonaut Konstantin Veshnyakov (Pyotr Fyodorov) is a survivor of a strange encounter in space. Once back in the USSR, Veshnyakov learns he is host to a parasitic xenomorph that only comes out to feed at night. Soviet Russia, still engaged in a Cold War power play, seeks understanding with hopes of weaponizing the alien. A Russian doctor renowned for unorthodox procedures, however, wishes to save the man instead, politics be damned.Whereas the weaponizing plot is hardly original, first-time Russian director Egor Abramenko, with writers Oleg Malovichko and Andrei Zolotarev, uses that known factor to revisit a date in the past and inject it with modern day style. Similar to how the Duffer Brothers and JJ Abrams and Denis Villenueve have conquered known and familiar stories while making something unique, Abramenko mainlines on Gen X nostalgia and makes the cliché sci-fi chase thriller a modern-day morality play. There are no shortcuts taken. The creature must eat.Or should it?Abramenko constructs a deceptively tight feel to his movie. In the sci-fi world where too much is never enough, Abramenko channels Hitchcock and masterfully restrains, builds pressure, awaits an inevitable explosion. Instead of a neo-spectrum of stars, he creates a Soviet utilitarian universe of concrete gray; of wood panels and analog devices. Sputnik looks and feels like a contemporary 21st century movie yet breathes Cold War complacency.A guarded Kazakh institute provides Earthbound claustrophobia replacing that of the Nostromo but the elements remain. Abramenko makes good use of those hallmarks of Eastern European war theater: the drab, twisting corridors and ever-vigilant security cams. Everything gives off a surface appearance of control. When that nighttime action does ramp up? Then fear assumes control. For Abramenko? Horror is cool.The story calls for three essential roles - the cosmonaut, the doctor, the colonel - all spot-on performances for basic, primary characters. Yet, each of them also seek to play savior. Veshnyakov wants to fulfil his role as hero for the Motherland. Tatyana's (Oksana Akinshina) desire, as a doctor, is to save the man. While Colonel Semiradov (Fedor Bondarchuk) plays all sides as father, friend, commander, and, possibly, a power broker.Aside from the occasional flashback or dropped hint, none of the characters are remarkably deep. Veshnyakov and Tatyana possess scars stemming from a lost childhood and empty parenthood. They form a friendship of sorts that, most mercifully, does not deviate into a carnal relationship. Remember, this is a sci-fi thriller. Russian stoicism is all that is required and here that is as plentiful as there are ushankas in Siberia.The creature F/X are a highlight. For a movie that delights in capturing a look from nearly 40 years back, the F/X are neither anachronistic nor dominating. The creature is believable, raw, and entirely physical. Likewise, the encapsulation of the facility is authentically practical.Sputnik revels in its classic inspiration while showcasing an accessible tale. The movie breaks away from genre tropes and highlights the drama between the three principals and their strange visitor from another planet. Language aside, Abramenko successfully delivers a universal movie where isolation and mystery and fear and acceptance are all shared emotions within the human experience. Sputnik, along with its American counterpart The Vast of Night, is a new class of sci-fi that re-opens those questions about life among the stars. Although those answers might not come easily, the question on whether Sputnik is a mere copy of Alien is conclusively answered with a nyet."}, {"id": 153, "text": "I hate that people are comparing this to Alien. This movie reminded me of Arrival in terms of atmosphere, pacing and theme. Alot of interpretations could be made regarding the Alien-Human symbiotic relationship, the theme of abandonment, adapting and fear going on.Oksana, the lead actress was the best part of the movie. Someone found her rigid, I thought she was very believable and nuanced.The cinematography and vfx are best features of this movie. There are some plot holes, unexplained things like the creature is sensitive to light, how did it survive in open space with blasting sun and radiation? And a few loose ends but the technical aspects make up for it.I would've liked the editing to compliment with the direction but it didn't. Tried to be fast paced in some places but lingered in other places. Background music and sound design are A grade.Must watch for those who liked movies like Arrival and Annihilation.Solid 7.5 / 10."}, {"id": 154, "text": "Thanks to Hollywood, we are really spoiled for choice when it comes to movies about alien arrivals, many of which result in scenes of death and destruction on an epic scale. With that in mind, director Egor Abramenko and writers Oleg Malovichko and Andrei Zolotarev should be praised for avoiding the urge to create another over-the-top shoot 'em up. Instead, Sputnik is a far deeper movie, and because of this, viewers who imagine this will be another man versus alien knock off, will be disappointed. My recommendation: go into this film with as few expectations as possible.Sputnik crafts a story that thematically explores love, family, what it means to be a hero, power, sacrifice, and the greater good. These are imbedded into the film's narrative, and treated competently. Unlike other alien films of recent years, where cheesy dialogue goes with it like peas and carrots, this Russian gem is intelligently written, with characters making decisions that are not only smart and logical, but make sense in regards to their character.The film is set in 1983. Konstantin Veshnyakov (Pyotr Fyodorov) and Kirill Averchenko (Aleksey Demidov) are cosmonauts, whose space module, that's returning them to Earth, is inexplicably hijacked. After Moscow loses contact with them, the pod mysteriously crashes in Soviet Kazakhstan. Enter Tatyana Klimova (Oksana Akinshina), a psychological professional, who is as brilliant as she is beautiful, and who is renowned for thinking outside the box to solve complex cases. Hired by a colonel named Semiradov (Fedor Bondarchuk), her task is to evaluate Konstantin, who is believed to be harboring something sinister from the missing hours in space.Characters are likable and well developed. Each has strong views and values, and the resulting conflict makes for a great back and forth between them, with equally believable chemistry. Even characters like the arrogant doctor, Yan Rigel (Anton Vasilev) have likable qualities, demonstrating that everything is both good and bad, an idea the film frequently postulates.Having similarities to movies like Alien and Life, yet developing its own unique interpretation of the genre, Sputnik is a film filled with terrific imagination. Despite occasionally resorting to telling the audience rather than showing, the explanations greatly assist us in having a perfect view of the complex situation. The pacing is really good, the feature slowly ratcheting up the evolving situation and tension, one event feeding into another.The orchestral score superbly adds to the film, the sometimes bombastic or eerie tones developing an unsettlingly ambience, though it can be surprisingly gentle at times too. The sound design, moreover, is just as effective, while the effects are phenomenally sublime. The movie is not bogged down by these, choosing to show us the creature in moderation, adding to the alien atmosphere. At the same time, the cinematography (example, shots of the steppes) is gorgeous to behold, while the set design tonally adds to the feature.The inclusion of a sub-plot about an orphaned child does feel a bit tacked on, considering we know more about the alien than we do about him, yet he becomes pivotal as the narrative progresses. Furthermore, the film does toy with a love story during its almost two-hour run-time. Despite there been scenes that subtlety explore this, this thread also needed further weaving to stand up to scrutiny.You can probably tell by now that I'm just nit-picking. As a creature-feature, Sputnik is delightfully entertaining in its design and execution, this aspect of the movie receiving the most attention and devotion. Sputink is a testament to the fact that diamonds can always be found, even in overdone film genres, and this Russian addition truly shines."}, {"id": 155, "text": "...became dull and cheesy at the last part.First, let me say one thing : the alien pictured in this movie looks like the Brain damage creature, Elmer. As it is a parasite/symbiote too, and seems to eat human brains as well. Nothing to do with an Alien because when the Alien exits an human being, it kills it. In Sputnik, that's not the case, as the alien can exits its human host, then goes back in it afterwards and so on.So, the story building is good, but no clues are given about what the alien wants.It looks to be bulletproof, can live in an human stomach, and can be fed with human brains. That's the story.However, this is going nowhere. I didn't understood where the writer wanted to lead me."}, {"id": 156, "text": "My feelings on this film get worse and worse each time I think about it but I think a 6/10 is fair for now. I really enjoyed the first half of this film a lot. The opening scene itself in space was beautifully shot and full of tension and the rest of that first half had some good character development and tension until we see what the creature is. After we see the creature for a little bit, the film took a harsh nosedive. Basically, I enjoyed this Russian boots on the ground version of Alien but after that first half, it wasn't doing anything for me. It become very dull and boring and the characters lost a lot of their motivation and become very dull. It turned into a B- action film with no tension at all until the film finally ended. I felt the film had some pretty good performances and was well shot for the most part. The one technical aspect I really enjoyed a lot was the music. It sounded great and worked well with most of the film even if it felt a little over dramatic at points. If you want a different kind of horror movie or just want to expand your horizons with international horror films then go check this out but if not then pass on this."}, {"id": 157, "text": "Laboriously Inspired from 'Alien'; Sputnik still conspires to do things antithetically. Clearly a desirous attempt to incorporate discrete perspectives; doing so it lost its proposed way in transition.This being my entryway in 'Russian' filmography; I'm guilelessly astonished by the production quality they endured. The comprehensive look &amp; feel felt no different from Hollywood! In all seriousness, That's definitely a plus. Albeit the substratum is derived from the aforementioned Hollywood blockbuster. In other areas they wanted to make themselves distinguishable. Meanwhile; they messed it all up!The performances were reasonably competent, but an addled writing restrained their respective characters from further developing. An alluring cinematography; crafted with discernible expertise was indeed a pleasurable treat to the eyes! That soothing journey too hampered by an ordinarily composed soundscore. Indubitably unfitted corresponding to the specific ambience they created.Although the foremost Issue that I have is with the contrived execution as a whole. A befuddled resolution, result of blending more than two distinctive genres. It's a SciFi Horror right? They pointlessly tried to include social commentary in it. And that's not all; they did all they could to overly dramatize few sections of the script. Especially emotion heavy moments. All these concoction unable to bear satisfying results in the end.In conclusion, this was a fervent endeavour that sacrificed a conventional route in order to exhibit unparalleled outcome; but all their good intentions have fallen apart due to inept hands behind writing &amp; character development. Such a pity!"}, {"id": 158, "text": "'Sputnik', the name of the Russian science fiction film directed by Egor Abramenko, immediately brings to mind the period of the beginning of the space era six decades ago, and the technological and political competition between the two superpowers of the time - the United States and the Soviet Union. If in terms of launching the first satellites and sending the first people to space, the Soviet Union had for a time a considerable advance, in the parallel competition, that of science fiction films, there was no doubt that the Americans dominated permanently. And yet, there was also a tradition of films about space exploration made by Russian studios and directors, materialized in successful films like 'Planeta bur', and from this tradition, renewed in the recent decades, descends the film 'Sputnik'. Its sources of inspiration however are also space horror films like the 'Alien' series. The two lessons are well learned, and we are dealing with a well-made science fiction flick. The dose of originality, at least for the spectators less familiar with this geopolitical space, can be found not necessarily in the story itself but in the placement of the action in 1983, the last decade of existence of the Soviet Union. The context in this case matters.The hero of the film is Konstantin, a Soviet cosmonaut (Pyotr Fyodorov) who returns from a mission on the space station. Something happens during the maneuvers of re-entry into the atmosphere. Konstantin loses consciousness for a while, and when he wakes up on Earth he finds out that his mission partner has not survived. The story takes place in the Soviet Union in 1983, a time when bad news were not made public, and Konstantin instead of the expected hero reception he expected is placed isolation in a remote military base and subjected to a KGB-like investigation by colonel Semiradov (Fedor Bondarchuk) and his assistants. As the presence of a living extraterrestrial entity is suspected, psychologist Tatyana Klimova (Oksana Akinshina) is called for help. She is of course blonde, beautiful, and brings with her a baggage of her personal traumas. If the line of the story seems familiar to you from movies like 'Arrival', I think it's not a coincidence but a direct inspiration. What is different is the atmosphere of permanent surveillance, suspicion and terror in which all the heroes live. KGB methods were still in used in those years, people were still dominated by fear, and the heroes were more likely to find allies among aliens than among their human fellows. Political thriller is added to space horror and the mix works quite well.Oksana Akinshina succeeds to create a credible, beautiful, intelligent heroine, sensitive to psychological nuances, which can be added to the gallery of female heroes who are space researchers who at least on screens balance the gender inequality still existing in this field. But the most formidable role belongs to Fedor Bondarchuk, the son of Sergey Bondarchuk, the famous Soviet director of the second half of the last century, and himself a multilateral personality (actor, producer, director). Colonel Semiradov created by him is a 'bad guy' that gives shivers, acted realistically with maximum attention to detail, in the style of good Russian cinema. If this film had been made elsewhere, Max von Sydow could have been cast. The cinematography is reasonable, the special effects are not the most spectacular, but it's hard to imagine space monsters after 'Alien'. The excellent sets combine a scientific research center with a prison or a concentration camp. Egor Abramenko is in his first feature film, but 'Sputnik' doesn't look like a rookie movie at all. On the contrary, I think that the director demonstrates skill in handling the tools of the profession and applying the lessons learned from different sources. I hope that he will have the chance to receive some original scripts, or maybe he will write them himself in order to be able to develop his talent creatively."}, {"id": 159, "text": "This in an interesting one. It is a Russian scifi/horror movie. The IMDB blurb states: At the height of the Cold War, a Soviet spacecraft crash lands after a mission gone awry, leaving the commander as its only survivor. After a renowned Russian psychologist is brought in to evaluate the commander's mental state, it becomes clear that something dangerous may have come back to Earth with him. As a sci-fi lover I wasn't expecting much but I must say I was pleasantly surprised. The story is nothing new. We have seen the same astronaut comes back to earth but brought something with countless time, so the storyline is definitely not unique. It is set in the early 1980's when the space race was still raging and returning astronauts seen as hero's. The only surviving cosmonaut of a Russian mission is kept against his will in a remote Russian scientific facility and he is told that it is to monitor his health prior to him being taken to Moscow for a lap of honour through the city streets. A controversial female scientist is called in to assist with the assessment but she soon realises all is not what it seems.The acting is very solid, the setting is bleak and communistic and the CGI is pretty impressive, not over the top but rather believable and realistic (considering this is a sci-fi). What the story lacks in originality it makes up for in believable and likeable (and unlikeable) characters. There are a few twists thrown in for good measure and these are done pretty well. They all caught me off-guard and added to the story positively.I really like foreign language films and Netflix have done well with several German, Polish, Korean and French sci-fi and horror titles recently. This is not a Netflix title though and the only complaint I have is that the English sub-text is sometimes so fast between shots that you barely get the opportunity of reading it all before it disappears.The world is quickly catching up to Hollywood. We are so used to all the big ticket movies coming from the US and it good to see foreign non-English movies getting more main stream airtime.Well worth a watch if you love sci-fi/horror."}, {"id": 160, "text": "I'm new to films with Russian culture. Chernobyl was the only movie/series I saw prior to this and I found a lot of similarities between the two. I really liked them both.It's the dark elements incorporated in the theme that sold it to me. Cinematography, CGI, and story were great. I liked how the plot was simple and yet classic and believable. As a person who never misses block buster sci-fi films, this is way better than sci-fi counterparts in Hollywood who had higher budgets. The actors did great in portraying their roles. The added emotions later on and the romance (yes) was necessary to gel all parts of the story.I'm a medical student who appreciated the accuracy of the incorporated terms and other aspects in the film. They chose the good ones.Why just give it a 9 if I liked it so much? I wanted more aliens! Hahaha. But I guess that was the essence of the film - keep it simple yet believable. Highly recommended. - JJNR"}, {"id": 161, "text": "I am so sick of Hollywood movies and their PC/Superhero/woke phase they are going through, so I almost always watch foreign films now (pretty sad Hollywood has lost it's talent), anyways on to this movie.If you are into scifi / space /alien kind of movies then this movie won't disappoint, it starts off strong and kinda lags in the middle and the end but I still thought it was very well done, the atmosphere was great , the acting was good (although from a foreign pov Russians seem to have trouble displaying emotio, idk maybe just me)..I felt the story was kindof scrambled in places like the orphanage was it her as a kid or was it his kid, kinda got lost there, but after thinking the wheelchair and her scar kinda makes sense it was her, but what that had to do with the movie I don't know maybe some content was cut.the cgi was very well done and the creature looked good, I felt there could of been more interaction with the creature (ie where it came from were there more, is it intelligent, alternative food sources ..etc) but they tried to focus more on the character drama but still I found it entertaining..I give it a 8/10."}, {"id": 162, "text": "Like the design of its alien antagonist, the movie Sputnik has things that work and things that don't. Unfortunately it's the things that don't work that make the movie--and the alien-fall apart in its own logic.What'a great about Sputnik is its atmosphere. Every. single. shot. is perfectly structured to feel unsettling. The lighting and placement of certain objects and characters throughout the movie generate a sense of isolation and fear. It's visually gripping from beginning to end.That being said, a lot of the movie seems to reflect American sci-fi cinema in style, but it is devoid of any understanding as to WHY certain stylings are employed. Hence, a scene that's meant to be heartfelt falls flat because what's needed to make such an emotion work--i.e. tone, dialogue, direction, color pallet--is replaced by stylish nonsense, as if the filmmakers are just repeating what they've seen in better movies. In fact, now that I think about it, the whole movie feels cold and heartless, despite many honest attempts to pack some emotional punch.As much as I ultimately didn't like this movie, I've got to give credit where credit is due. The screenplay is amazing. You can tell the filmmakers really care about the characters because much thought went into crafting who they are, even if their motivations aren't always clear. The story makes several literal and metaphorical connections to the fearful nature of human beings, the early 1980s time period and Cold War isolationism, and the irony of what makes national heroes... heroes.Where Sputnik starts to show its cracks, I think, is in the logic, or lack thereof. There are things about the creature that aren't fully explained, so when it does certain supernatural feats we are left scratching are heads with no thought beyond, Well, at least it looked cool. Characters seem to flip-flop in their decision making, sometimes arriving at conclusions that don't make any sense at all.And I'm no professor of anything, but when I find myself arriving at solutions to problems that our supposedly highly-educated characters haven't come up with yet, then the movie has a problem. Audiences shouldn't be able to out-think a movie's heroes.Sputnik has what could be called a surprise ending, but I think most audiences will just find it confusing. Without getting too spoilery, it's an ending that seems to come out of nowhere and for no clear purpose, although it does reveal something interesting about one of the characters. Regardless, why the filmmakers felt we needed that little twist feels completely unnecessary. It doesn't play into the movie's A-plot, or even the B-plot, and therefore feels like you could totally remove it without impacting the movie at all.Ultimately, as cool as Sputnik looks, it just more sci-fi space junk."}, {"id": 163, "text": "A cosmonaut with an alien parasite inside of him (which periodically leaves his body) is contained in a research facility. A young doctor is recruited by the shady military to assess the man but uncovers a sinister truth.Although writers Oleg Malovichko, Andrei Zolotarev ideas are derivative, borrowing from countless others. The creature is reminiscent of Prometheus' (2012) Hammerpede design. Nevertheless, it doesn't stop Sputnik being an effective claustrophobic alien horror.Thanks to director Egor Abramenko's gripping set pieces, gross-out gore and overall production values Sputnik its own legs. The serious dark and ominous tone elevates Sputnik, delivering a satisfying, gripping experience.Notable are lead actors Oksana Akinshina, Fyodor Bondarchuk and Pyotr Fyodorov. Oksana subtle performance is impressive, echoing the leads in The Thing (2011) and Underwater (2019). Bondarchuk commands his scenes with great screen presence.The Soviet-era setting and character study performances coupled with a closing twist puts Abramenko's offering up there with some of the best of the genre."}, {"id": 164, "text": "We all know the alien/outer space genre has plenty of attempts ranging from eye-rolling to truly memorable. Let me tell you the Russian film Sputnik was an excellent addition to the list.The difference between this movie and many other outer space movies is that the director spent time developing certain characters and spent less time on cheap jump scares and CGI.The plot was solid, the pace smooth, the scares were well-placed, the dialogue was believable, and extra points for the music score- it sounded like a Christopher Nolan movie. And the unique take on the monster was refreshing.I highly recommend this movie if you are a fan of the outer space/monster genre- you wont be disappointed![7/10]"}, {"id": 165, "text": "A solid enough effort for a first time outing, Sputnik is a competently crafted chiller that at first takes a procedural approach to its space alien horror premise and was going quite well until it chose to discard all of that and head straightforward into the clichéd territory to finish as yet another serviceable entry that exhibited potential but lacked the conviction to embrace its ideas.Directed by Egor Abramenko in what's his directorial debut, the story brims with an undeniable sense of dread from its opening moments plus the Soviet-era backdrop only amplifies it further. The first half is as thrilling as it is engaging and exemplifies the secrecy, distrust &amp; corruption within the Soviet establishments with finesse. But as it enters the second half, things start to go downhill.On the plus side, the horror elements are handled with care and executed with flair. The setup is brilliant &amp; promising even if much of it is squandered for a predictable third act. Also helping the ride is the neat camerawork and steady pace while the fantastic score drives the action expertly from start to finish. Performances aren't compelling, for the characters aren't fleshed out and fail to earn our investment.Overall, Sputnik delivers the goods in sufficient doses but with more refinement, it could've catapulted itself to a much better height than what it eventually settles for. The plot teases with many concepts but instead of fully embracing them, it tends to hover on the sidelines. Even the bloody action is held back for no reason. Failing to realise what was up for grabs, this Russian sci-fi horror is effective at times but it is far from its finest version."}, {"id": 166, "text": "This was a film that I heard about earlier this year and since I'm a fan of sci-fi horror films, I was intrigued. The director was on a podcast and was interviewed, so that gave me some insight to the movie without spoiling it. This was one where I watched a sci-fi horror film as a Featured Review on Journey with a Cinephile: A Horror Movie Podcast, so I thought this would pair up nicely. The synopsis here is the long survivor of an enigmatic spaceship incident hasn't returned back home alone - hiding inside his body is a dangerous creature.We start this movie off with a couple of cosmonauts in their shuttle back in what I believe to be 1986. The one that seems to be in charge is Konstantin Veshnyakov (Pyotr Fyodorov) and with him is Kirill Averchenko (Aleksey Demidov). They're singing songs as they prepare to disengage and return to Earth. They make a terrifying discovery when a shadow moves past the window and it sounds like something trying to get in. They then crash land in Kazakhstan. Averchenko is missing a portion of his head from what it looks like and Konstantin seems to have survived. His eyes look black though as he screams.It then takes over to Tatyana Klimova (Oksana Akinshina). She is brought before a board as she did a risky treatment on a patient. She is at risk at losing her position and from what I gather, the ability to perform medicine. All she has to do is admit her fault. She refuses to do so though. Watching this is Colonel Semiradov (Fedor Bondarchuk). After it is over, he approaches her about a top secret research that he wants her to participant in. She can say no, but he wants her to come with him to at least give her assessment.When she arrives in this remote location, Colonel Semiradov explains the reason for the isolation. We learn later is that they've given a cover story to the news. They claim that everything went good and that the two cosmonauts are being held for routine testing. Actually though, Konstantin came back with something else. In charge of the tests is Yan Rigel (Anton Vasilev). He doesn't really like Tatyana being there as he feels threatened. We see that she doesn't necessarily play by the rules and goes in to interview Konstantin, who is interested when he sees her. Her assessment is that he is dealing with PTSD and that she isn't needed here.Colonel Semiradov doesn't give her all the information. He brings her back that night and she sees more of the truth. There is a parasitic creature inside of him. It comes out every few nights and while it does, Konstantin goes into a coma. She changes her mind and decides to stay. Her goal is to separate the two, but the more she looks into it, it might be less of a parasite and more of a symbiotic relationship. There is also more that Colonel Semiradov isn't sharing as well.To take this to my thoughts on the movie itself, we have an interesting set up here. Part of the interview was stating why they decided to set it in the 1980's. One easy thing is the technology is a bit easier to use here, but we also are putting this in the Soviet Union. I really got vibes of Citizen X here with how ineffective the government was working and the lies that are being fed to keep it a secret. Colonel Semiradov also being a military man is looking toward weaponizing this creature. This shouldn't be a shock with things like Alien and being this is ight in the middle of the Cold War/arms race.Going from here though, I like the characters we are working with. We don't necessarily always know what to believe. Tatyana will say or reveal things to get a reaction out of people. She is quite smart though and dead on a lot of the times though as well. She is brought here since she did this radical treatment. Colonel Semiradov knows if anyone can solve what to do here, it is her. I'm glad to see they went with a woman for this role as well. The Colonel is an interesting character too. He really seems to embody the Soviet mentality with only revealing what he feels needs to be known. He's a cold, calculating man and it works. There is also Yan, who is only looking out for himself. He never does anything unless he can see the benefit to be gained. Tatyana sees this and can manipulate him. What I will say, Yan starts out as a jerk and I like where he ends up.Another character I really need to break down is Konstantin. He is selected by this creature and the movie gives us some interesting reasons why. The major one I see is his will to survive. He has a mother that without him has no one. He might also have a son that he may or may not know about that is in an orphanage. Tatyana and him have interesting back and forth conversations where you don't always know what is real and what's not. There could also be a medical reason which I'll shift over to next.Moving next to the creature, from what I remember I think they went practical as much as they could. I still feel there probably is CGI here, but it is pretty seamless. I will give a slight spoiler here, this alien creature eats humans. The movie gets a bit more specific, it is creepy that it wants us to be scared of it before it eats us. There is a certain chemical it needs and something here comes into play why Konstantin was chosen over Averchenko. I'm also a fan of the comic book character of Venom. This entity is similar in that it creates a symbiotic relationship with Konstantin.Aside from the creature effects, I think that this movie is shot very well. I've already said I liked the time period it is set. It does feel like that with the technology. What I will also give credit there is that it does have a timeless feel to it as well. That is something that bodes with since it is ramming down our throats the era it is set.Since I've broken down the characters, I'll give my thoughts on the acting next. Akinshina I think is really good here as our lead. I like the character she portrayed and I think she fits it well. Bondarchuk is the same. He is a villain without being one the whole time. For a good portion it feels like he's adhering to the rules of his country, but we also see that he needs the control. Fyodorov has a good look for this cosmonaut and his performance was good as well. He's another one that feels like a villain at times, but the movie did a great job in humanizing him. Vasilev works well as this weasel guy while also having good growth to here he ends up. Demidov and the rest of the cast I thought rounded this out for what was needed.Quickly I wanted to go over the soundtrack. I really like how epic this soundtrack sounds. For me, it really feels like something you'd feel inside if you learned an alien like this existed. It is good that it really for the more exciting scenes we get this type of music to really help build that feeling up. Aside from that, I think the score fits for what they needed.If I did have a gripe and I feel like I've been saying it a lot lately. This movie does feel like it runs a bit long. There are aspects that we do need. The scientific process needs to be there and that works for me to learn more about this creature. The problem is that I don't know if we need 113 minute runtime. It takes awhile after the initial shock of seeing the monster until the climax that even around 10 minutes being cut would have made this run tighter for me.So now with that said, I really enjoyed this movie. I'm a fan of these sci-fi horror movies and I like setting this in the past without beating us over the head with it. It really makes a lot of sense for a Russian movie like this being that it would have been the Soviet Union with their strict rules there. The acting is strong across the board. I really like the concepts this movie is exploring with learning about this creature and the more we do, the more horrific it becomes. The effects were on point and I think the soundtrack for the exciting scenes are as well. If I do have a gripe, it is just a bit too long and it bogged down a bit in the middle. With that said though I still found this to be a good movie overall and worth a viewing. What I will warn you though, I watched it in Russian with the subtitles on. If that is a problem, I would avoid this."}, {"id": 167, "text": "Hi. So I finally was able to watch this movie last night, of all places in Hulu, which I'm liking more and more, in spite of the ads. What can I say? Can't really afford ad-free, for now. Well, actually my wife won't approve, because we're also paying for Netflix. But back to Hulu, it has good shows and movies, including The X Files. Incidentally, this review was in no way sponsored by them. Oh yeah, Sputnik, the movie. I digressed there for bit, sort of intentionally, because it's what I kind of did last night after the first 2 acts. I liked the setup, and thought it was a clever idea. Almost an actual X file. I always enjoy movies showing smart, professional people just doing their jobs, and actually being good at it. For me that was both the psychiatrist and the military boss who recruited her. But then there was a point in which the third act lost me a bit. Which in part might be because of something I missed. I was just reading another review in here explaining something about the end, involving a child in an orphanage, which I completely missed. I guess I'm not as smart as these Russians. Plus I was bit tired and dozed off for times. I do have good memory for actors, and as soon as I saw the gorgeous psychiatrist lady, I knew it was the girl from the end of one of those Bourne movies. You know, when he breaks in to her house and tells her he killed her parents. The actress has a sort of melancholy to her in both movies. Heck, I'm right now thinking it could be the same character. But Bourne doesn't show up. And neither do Mulder and Scully. Anyway. even though I don't know much about the technical aspects of movie making and am in no way a movie critic, I can say that this movie looks good, and has good production values, like they say in Super 8. All in all, I would recommend it, if you like this sort of movie."}, {"id": 168, "text": "Greetings from Lithuania.Sputnik (2020) was a very good sci-fi movie. It reminded me heavily of Alien and Arrival. Its like an Alien and Arrival smashed into one and also set in a different place then usual. The place and time is 1983 and its Soviet Union - setting of sci-fi movie you simply won't see anytime soon. And this movie kept my attention during its whole 1 h 50 min. Its not just a monster flick - like i said the whole wibe of this movie reminded me heavily of Arrival - you kinda feel that there is more to it then it shows. Acting by two leads Oksana Akinshina &amp; Fedor Bondarchuk were amazing in my opinion. Music at the end was haunting and directing of the whole thing was the thing that kept it going.Overall, Sputnik is a very good sci-fi / horror gem set in a very unique place and time. It borrows heavily from two masterpieces - Alien and Arrival - its not as great as those for sure, but i really liked Sputnik on its own - and the ending was very haunting + soundtrack was superb."}, {"id": 169, "text": "Watched this as an original with subtitles and throughly enjoyed this title, granted the the subplot was a bit weak, but I guess part of this was a clumsy telling of who's the bigger monster, the Human or creature?With just under a 2 hour run time, sputnik disn't bore me, nor did I have th eurge to do something inbetween, as the intertia of the tale kept me interested all the way through, even though as in all movies some stupid decisions were made, but if everybody thought properly, then we wouldn't have these stories I guess.If you enjoy Sci fi creature movies, then this is for you and it makes a refreshing change to see something other than the cliched Hollywood efforts that get churned out at an alarming rate.Creature effects are very good and the 80's post cold war setting adds to the bleak atmosphere of this film.This movie got an 8/10 from me, as it's great to see Russian cinema provide us with some valid alternatives to the normal diet of run of the mill junk we're bombarded with and I'm hoping that more Russian Sci fi hits our screens soon...can't wait!!"}, {"id": 170, "text": "This is my first venture into Russian films and I must say that I was very very impressed by this film. If this is the standard of filmmaking in that country then I think I'm gonna be watching a lot more Russian films.I would also like to say that as an Englishman, I don't speak or understand Russian and watched the film with subtitles. Even with that I still found the experience very emotional and moving, found it very easy to engage into the story and the characters. I know that foreign language films can be daunting to some people, who find reading the subtitles distracting, trust me you will be so invested into the film that it won't become a problem.I would comment on the cast however as I don't know any of them I will just say this, they were all very good in there respective roles. If I was going to give a shoutout to any of them I think it would be Oksana Akinshina who played the lead role and I thought she was very good. She is almost plays the character of the audience in the film in stages, we are exposed to things for the first time just like she is. All round pretty solid!!The areas of the film that impressed me most are Directing, Cinematography, Score and Production Design. Firstly the directing in this film is flawless from start to finish, combined with some gorgeous cinematography this film really is a feast for the eyes. I love the fact that the film is set in 80's Soviet Union, its always interesting to see how that era is played out on film and adds another dimension to the story. Last but not least is the score which is as haunting as the creature itself is, gave me chills.......its that good !!!!!Overall I really enjoyed this film however I do have a bias for Science Fiction films, especially ones that aren't run of the mill and take some risks. I love the horror elements added into the film, has some of the most nerve-racking and on edge moments I've seen in film for a while. Fantastic work !!!! 70% out of 100 or 7 out of 10 !! Please please don't be put off by the fact its not in English because it is well worth your time !!! It has everything you could want in a modern Sci-Fi / Horror !!!!!"}, {"id": 171, "text": "Sputnik Micro Review -Comrades! Sputnik is a new Russian Sci-Fi horror film that tells the story of the mystery behind a crashed Cosmonaut in 1983. While Sputnik in the United States is known as the first manufactured object launched into space by the Soviets, the meaning of the word Sputnik translates as a travelling companion. This distinction is incredibly important in the understanding of the film's theme as an International Film playing to a United States audience - the role of internalized fear on personal choice.Sputnik is quick to show the creature which is incredibly well done. The Soviet 1983 setting is a purposeful choice intended to play the creature horror genre against a backdrop of recent real-life nationalized based horror. The film uses its creature fantastically in this analogy. Although for the purpose of this theme the film does make several convoluted plot choices for the sake of progressing the story. Specifically, in how the Cosmonaut is not under 24/7 video monitoring?Sputnik is probably not the film for someone who is not already interested in Sci-Fi horror. I do not see this as a good gateway film. But despite the few larger leaps of contrivances, I had a fun time with the film. I am extremely excited to see what writer-director Egor Abramenko creates next."}], "reviews_amount": 172}