{"name": "Demon Slayer the Movie: Mugen Train", "titleId": "tt11032374", "reviews": [{"id": 0, "text": "If you liked the animation of the season 1 of demon slayer you will simply adore this film this is a true masterpiece with a captivating story and music that will make you cry , a must watch for any fan of the show ."}, {"id": 1, "text": "Ufotable is honestly on a roll with the hit Demon Slayer series. It's simply bloody fantastic but also has a lot of heart, as a lot of people will see in this movie, which introduces one of the other Hashiras of the Demon Slayer Corps."}, {"id": 2, "text": "Worth watching in cinemas, This movie gonna insane for demon slayer fans you all definitely love his songs an animations. Some of scene able to make you cry. Very Insane!!."}, {"id": 3, "text": "I want to set the score 100, not 10. The story, characters, visual, actions and moves, professional voice actors, sounds, Lisa's main song are so completely mixed at supreme level. (By the way, the meaning of Mugen Ressha-Hen is Infinite Train Arc. The name of the train in the film is Mugen (Infinite).)I love movies, seeing it in theaters. Net-streaming is OK as a supplement, but I think it cannot be the mainstream of this industry, and I do hope this movie will be released in USA, Europe, China soon, pull the people back to their nearest theaters, save the industry.I saw this movie on the 1st Saturday, the 1st show (8AM) in a theater near me. 400 seats were 100% full, the audience must wear a mask, drinking was allowed, but no eating (usually in Japan, no shouting, no chanting even without COVID19).Just before the start, I felt total concentration breathing of the all audience in the theater, complete silence &amp; 100% focus on the screen, that explained how we all were long waiting for this movie's release.The movie itself is really great, so breathtaking. This is the ultimate Anime of a popular Manga/comic series, and I want to give big big big applause to Ufotable who have created this masterpiece.For those who have seen the anime series only (26 episodes), not known the full story of this film, you must go and see Rengoku-san's several Flame-breathing forms, which give you goose-bumps. His scenes are so super and great that make all people understand Hashira's power &amp; strength.For those who have seen the anime and read the manga series (known full story), you also must go and see how each panel of the manga moves (it really moves!!), and enjoy comparing the scene and the panel after watching the movie (like me). You can also feel the characters' feelings more vividly than the manga series.In the end of the movie, you would be thankful and grateful for the mask, not only for anti-COVID19, but also for hiding your tears and runny noses. (this happened to me, I was so moved and emotional...) In the end, during the last song, the theater was filled with many sobbings.---- Spoilers ---- I try to minimize my spoilers here.Before the last battle, I felt that the all audience again did into total concentration one level deeper, and I guessed that most of them must have already read the manga series.The last battle was so so great, I have never seen such a great battle in my life that I cannot describe it with my poor English vocabulary. I can only say that it surpassed the episode 19's battle in Demon slayer anime series, and Ufotable has realized/materialized the manga 100% or more with visual, sounds, voices, backgrounds, etc.I also praise the power of Japanese professional voice actors/actress. They express the characters' feelings completely and you will be easily captured by their voice-performance. I really feel great and am proud that Japan has such great voice actors. I recommend all people in the world to see this movie with Japanese original voices with your own language subtitles, so you can listen/hear/feel their great performance.Ufotable/Aniplex did very good job to make it secret about the last battle. It was not revealed until the opening day. They also even hid the voice actor's name of the key character in the last battle. When I heard the voice in the theater, I felt like and shouted in my mind, Wow, it's him! Yes! Some of them in the theater must have been same like me. The voice was 100% fit and so convincing that I was like persuaded to become a de....Anyway, please enjoy (with tears)! I am looking forward to seeing/reading your reactions/reviews about this film from all over the world."}, {"id": 4, "text": "An amazing thrill ride full of comedy, dark and emotional moments that will leave you begging for more. If you liked the Demon Slayer anime, you are sure to love this movie."}, {"id": 5, "text": "Worth watching in the cinemas! The animation and the story arc is excellent!"}, {"id": 6, "text": "I was worried because the movie is in the train, and I was afraid it will become boring. After I finished the movie, i realize that I shouldn't worried about this thing from the start. Every scene in this movie is really well planed, if the action scene start getting too long they will change it into another scene so we will not get bored with the action (I mean the composition of action and te conversation is balance.)And then the effects, both 3D and 2D. It's P E R F E C T. Even though we only have 2 hours to know Rengoku character, but the feeling, the emotion still really hit me. Like I cry a river in the cinema😬It's really recommended! But please remind this in your mind that you need to watch the season 1 before you watch this movie."}, {"id": 7, "text": "This is the best anime movie ever atleast for now, but i ain't cappin abt this u must watch 100%!"}, {"id": 8, "text": "Wait until universally released, This gon' make a noise that can't be unheard"}, {"id": 9, "text": "This movie's story is not a great or a new one. We've seen it a million times, in animes and countless fantasies. If you are expecting the movie to tell you one great story, its really not for you.The movie, however does not let you blink. Its just too damn beautiful. Soundtracks, are spot- on and worth listening to over and over again. The animation is... the best out there is any anime. A lot of cliche, more than a few unfunny gags, but the animation makes up for it. The studio really has done their job well to keep me glued to seat."}, {"id": 10, "text": "The story is amazing. You can feel the pain in every fight and get involved into every character story. The animation is amazing, what a great job from UFOTABLE.Kyojuro's death will be something that will have a big effect over Tanjiro and the rest of the demon slayer corp. I'm pretty sure that next season will offer us an amazing battle between Muzan, upper moons, the hashiras and a cotinue growing Tanjiro.I highly recommend to watch this anime and movie."}, {"id": 11, "text": "Guys I guess it's masterpiece from ufotable best movie The best 👌"}, {"id": 12, "text": "Es demasiado bonito, y realmente conectas con los personajes, la animación sigue siendo una joya, y la banda sonora, ufff inigualable"}, {"id": 13, "text": "Master piece movie rengoku is a top tier character plot twist were fire animation we're good 11/10 movie mangaka is a genius likes she's knows however to portrait here characters Very we'll specially inosuke add tanjiro character development in movies is so good"}, {"id": 14, "text": "I am from Bangladesh. I am waiting for it for long time🙃. It is resaled in japan but what for us?"}, {"id": 15, "text": "A visually so stunning but the story is quite protracted as a lot of drama that can make you bored sometime. The action scene of the Keawjuro and Akasa are the best fighting scene of this movie"}, {"id": 16, "text": "Best anime film ever. Super awesome 😁. 👌👌👌👌👌👌👌👌👌"}, {"id": 17, "text": "I'm crying a river, the sound the art the story everything about it are just superb :')"}, {"id": 18, "text": "I cried so much even until now when I remeber Rengoku's smile at the end I immediately start to cry. Demon slayer is god's work for me. I have never read something so good and so unfortunate. The movie and entire manga take a very very special place in my heart as I've never felt such connection and pain to something. The movie- oh the movie, the animators did a great job and all the expressions and voice acting were on top tier level, Tanjiro and Inosuke's cry are so touching and realisticly painful. The movie is beautiful, sad and totally something you should experience watching. Such small details give you feels from the movie. From the moment Tanjiro saw his siblings...it was such a heart breaking scene, expect my tears the moment he sees them. Overall the scene that I think is the most precious to all of us is Rengoku seeing his mother, I replayed that over 40 times."}, {"id": 19, "text": "Masters piece movie one in a Life times stuff what's a goat character is rengoku"}, {"id": 20, "text": "To start with I actually thought at one point that demon slayer was overhyped but no I was wrong. This movie lived up to the hype and i was shocked to see how ufotable delievered it. Rengoku by far is my favourite character in the movie. He was original and amzing. As for people who think he is weak please!!! A upper moon is = to 3 hashiras at minimum and this fight actually proved that he was a hashira among hashiras. Please dont judge the guy badly. He saved 200 people, 3 rookies and even gave a big threat to upper moon 3 and by the way the top 3 upper moons are stronger then all the pillars newsflash. As for the lower moon 1 part. Imgine cutting hundreds of tentacles in 5 carts all while keeping the damage to a minimum. That aside movie was stunning with alot of visuals and rengoku vs akaza was the best fight this year. Fast paced and I had goosebumps of the year when I viewed the battle. The best part was that there was no victor or loser and that last million dollar smile....Man I almost cried. Rengoku looked like a baby tbh he died in a dignified manner. I loved the guy"}, {"id": 21, "text": "Tanjiro cried, Zenitsu cried, Inosuke cried, the crow cried, I cried and everyone cried. Graphic 10/10, Music 10/10, Rengoku 11/10"}, {"id": 22, "text": "I have seen Demon Slayer first season and it was not that bad.But this movie is full cringe.there are lottah cringy fight scenes nothing remarkable here.the ratings are only for the animation,the story is pretty much child's play."}, {"id": 23, "text": "Finally, this movie was released in my country (in Asia) since last weekend, and surprisingly, almost all the reaction/review for it are very positive from both fan and non-fan/just casual movie goers. Many people who are not into anime much (to be honest, anime movies often don't do well in my country box office) still really like it after watching. ---------------- My reviews: _Visual and sound: no need to talk more. 10/10. _Content: Good meanings and messages which can resonate well with the audience. Reasonable framed. Handle sittuations properly. No random asspull power-up. There is time to focus on each character to develop and emphasize their role, leave the impression on audience. The producer team knows how to choose the starting point and end point so that audience in general can enjoy the movie. Through out the movie, there are good meanings and messages that can resonate well with audience (especially for Japanese people due to culture and lifestyle I think). 8.5/10 Overall: 9.25/10"}, {"id": 24, "text": "This movie is awesome! Highly recommended! Better experience if you've watched season 1 and haven't read the manga before!"}, {"id": 25, "text": "Caution, there be spoilers ahead. When we were introduced to the Hashiras, my expectations were sky high on their abilities. Since the Flame Hashira was the poster boy for the movie, I was expecting great things from him. Boy what a disappointment he was. He was a non-factor the ENTIRE first half of the movie and when we do get to see him fight, he has ONE cool move that was entirely ineffective.Let's go back to the first half. WHY ISN'T EVERYONE DEAD? The baddie essentially can kill everyone, but is instead wasting time on top of the train....for what?! Ridiculous storytelling.The big fight between the baddie and the Hashira is a big let down. Don't expect great magic, great moves or great strategy...it's pretty much a straight up, vanilla, generic fist fight until the Hashira decides to pull his ONE cool move, which ended up being stupid. This man is a Hashira, best of the best, and he doesn't know that a strike to the baddie's body is useless? He had ONE cool move and that move was a strike to the body that basically did nothing, NOTHING. And to make everyone feel bad, the baddie got away.Watch it cause the animation is beautiful. Don't watch it expecting great fights and a great Hashira."}, {"id": 26, "text": "The anime is fantastic. The film is a big disappointment. I hope that they will continue with the series and that they will never make a film again."}, {"id": 27, "text": "U shouldn't be missed it. It'd be worth watching go nd watch. This movie makes you cry cz it has some emotional moments. Everything was top notch. Hat's off to creators."}, {"id": 28, "text": "CUAse I cAnT WaatCh iT insane absolutely bonkers can't wait for season 2 had me on the top of my seat the whole movie"}, {"id": 29, "text": "Amazing im greatfull i visit this apps to watch movies"}, {"id": 30, "text": "Tanjiro couldve beamed sun rays at the demon to kill the demon but didnt so the anime doesnt make sense its soooooooo bad lmao"}, {"id": 31, "text": "Wasted my time, nothing compared to anime. The show is much better. The movie didn't have much detail and was very good."}, {"id": 32, "text": "Any thing you hear see or feel or get to know about this movie, and you think its just HYPE, NOOO!!! It is the ground truth. For a long time I was sure no anime/movie can beat AOT story line, but here we are with a MOVIE DEFEATING WHOLE FULLY DEVELOPED ANIME'S."}, {"id": 33, "text": "I read the manga and loved it and I hope I can watch it soon"}, {"id": 34, "text": "These days it's not easy for us to go out to leisure facilities, needless to say, due to covid-19. Movie theaters are a few exceptions even in Japan where infection hasn't been relatively severe. That most foreign films don't play this year helps only domestic films such as Demon Slayer play unusually many times a day.Covid also brought a serious blow to Japanese businesses which had already been in an economic slump for many years. Particularly in the pandemic era, people are likely to lose their ways and not to have an idea what they should do.Demons originally symbolize unknown terrors to humans like earthquake, eruption, flood, or plague. The very classic story line, a brave boy who has a sense of justice beats demons, gives people a hope of salvation and brings about catharsis. The old-fashioned and creepy ambience depicted by a lavish, high-quality animation exactly fits with the current time."}], "reviews_amount": 35}