{"name": "Darbaan", "titleId": "tt11880600", "reviews": [{"id": 0, "text": "Worth watching and a very beautiful movie 👍👌 must watch for a wonderful story of Rabindranath Tagore ....."}, {"id": 1, "text": "'Darbaan' - A beautiful story of relationship , care and loyalty. A story written by Rabindranath Tagore and narrated by Annu Kapoor. Story line and performances are exceptional. Especially Sharib Hashmi is outstanding. Highly recommended to friends and family as this is one of the few movies one can watch with family on OTT. 😊"}, {"id": 2, "text": "What a human can do to overcome his guilt or his mistake is shown in this movie. Slow start but totaly worth is afterall written by Gurudev Ravindranath tagore."}, {"id": 3, "text": "In these times of loud movies its a welcome relief watching a calm and sensible story line.Darbaan is the story of a caretaker who does a mistake and then his life changes. He lives in a guilt and how he deal with the guilt and society is the base story line.Sharib Hashmi looks convincing as Raichur and delivers an emotional and strong performance. Sharad Kelkar does a good job in a limited screen presence. The whole movie is basically revolves around Sharib's charactrer.Basically the movie portrays the Raichur's guilt and how does he cope with that guilt and with society."}, {"id": 4, "text": "A very beautiful and emotional drama.A clean movie without any foul language and vulgarity ."}, {"id": 5, "text": "Going very smooth, simple ,and also unexpected end, they sould have added something new.."}, {"id": 6, "text": "This movie is very softly made and it goes in a smooth and simple wayVery nice story of course it has to when it is from rabindranath TagoreThe direction is very nice and up to mark with soothing music and very good locations.. in this era of ott this movie is clean and simpleSharib played his role marvellously this making the movie very emotional and touchyA good light entertainer"}, {"id": 7, "text": "All characters well played, and specially sharib hashmi stealing the show. Overwhelming, emotional bonding of caretaker and son. Worth it watch."}, {"id": 8, "text": "Raichand character is brilliant and all cast crew so good"}, {"id": 9, "text": "Loved this movie. Earlier i used to watch only big stars movies but now i realise that small screen actors are way much better than them Always supporting small screen actors"}, {"id": 10, "text": "I know it's the time for experiencing Tenet, but it's a request not to miss this beautiful film. This movie will touch your heart with pure emotions. As expected, Bipin Nadkarni on Director's chair doesn't disappoint us. Cinematography is brilliant in this film.This is a Sharib Hashmi Show. He has many more to give us in future. Rasika Dugal in her less screen timing is beautiful. Sharad Kelkar &amp; Flora Saini are also good. Annu Kapoor should also be praised for his wonderful narration. In this world of remake, music of this movie is a breath of fresh air. Don't Miss This."}, {"id": 11, "text": "Totally a piece movie... Just awesome...These type of movies people will not watch and they will say that bollywood is not Good..but people even doesn't know that this film is being released today.. What a story by Tagore ji.. and a movie on that story is just awesome.. will recommend every one to watch this movie..if anyone found this movie bad then pls dislike my review.."}, {"id": 12, "text": "What an emotional journey...Sharib sir ...the next level acting... enjoyable movie... sharad sir and flora saini...flawless performance...Sharib sir u r underrated actor..also in scam1992..no one mentioned u."}, {"id": 13, "text": "I cant describe my experience after watching this movie on zee5, means huge thumbs up to this. Act was brilliant, especially Raichand he is a legend. Nothing to say anymore, Just go for it guys.Its awesome, I really loved it. Whoever will see will definitely love it."}, {"id": 14, "text": "A heartwarming tale with average execution. The story was good but the screenplay didn't work well. The slow-paced screenplay lacks depth. Sharib Hashmi delivered an impressive performance but other casts have nothing much to offer.Direction 2.5/5 Acting 3/5 Dialogues 2/5 Story 3/5 Screenplay 2/5"}, {"id": 15, "text": "Movie without logic. Sudden change of events without any sense. Total waste of time."}, {"id": 16, "text": "A rare movie in the age of vulgarity, foul language. Watch this movie just to believe that a movie can be made without foul language, violence and cheap skin show."}, {"id": 17, "text": "The movie deals with human emotions so if you are sci fi movie fan... You won't understand the heart of the story.The movie was very soulful to watch and emotional.The songs, OMG they add the cherry on the top. So beautifully written especially when the girl sings Jamuna kinare mora gaav Gives goosebumps!!Acting/casting 5/5 Story line 5/5 Location and shoot 5/5 Story length(short and sweet) 5/5"}, {"id": 18, "text": "Loved the content, the way it is being directed and executed makes the film very special. One word: beautiful"}, {"id": 19, "text": "So, recently watched Darbaan which was aired on Zee5. I was very excited for this one ever since I heard about it's plot and casts and to be honest i was ready for some emotional rollarcoster ride but to my surprise it wasn't close to that. You don't feel connected towards any of the cast not because of their acting but because of the dull execution. The acting was brilliant as always and that's why ive given 3 stars."}, {"id": 20, "text": "A very emotional &amp; beautiful movie, holds the ability to make you cry! Tagore's story is impeccably made into a movie and does complete justice to the viewers. Was left speechless at the end of it, just amazing and heart warming. Songs incorporated just add to the feels, do watch!"}, {"id": 21, "text": "After some time a really nice movie hai come. A must watch."}, {"id": 22, "text": "Incredible story by rabindranath tagore and nice acting by all cast of this film specially sharing hashmi sir🙏🏻🙏🏻🙏🏻"}, {"id": 23, "text": "An unforgettable, poignant, impressive, and memorable film based on the self-styled Rabindranath Tagore ji story Darban. Fully viewable 👌🏼👌🏼👍🏼👍🏼 Hail! 🙏🏼"}, {"id": 24, "text": "This is such a great movie to watch with family, But many Indians would ignore a movie like this !! A great watch ! GREAT STORY BY RABINDRANATH TAGORE. Definitely should watch it.."}, {"id": 25, "text": "What a performance by sharib hashmi. Excellent story. Excellent narration. You are going to cry after watching this film. OTT platforms are giving excellent content."}, {"id": 26, "text": "People scream....Nepotism-Nepotism.... But always watch crap movis. This movie is an emotional, worth watching. Please watch"}, {"id": 27, "text": "This movie is purely made by heart. Acting is excellent and story gives you amazing feeling throughout the movie"}, {"id": 28, "text": "This movie takes Indian cinema to another level. Master story telling by Bipin Nadkarni who also is a national award winning director for another classic - uttarayan !The cinematography and emotions capturing is fantastic. Such movies take Indian content industry to another level"}, {"id": 29, "text": "A heart-touching story, brilliantly portrayed by Bipin Nadkarni. Amazing performances by all - Sharib Hashmi, Sharad Kelkar and Flora Saini were standouts. The music is beautiful, and each song is more soulful than the other. Thank you Bipin Nadkarni for giving us such an amazing cinematic experience and providing a bright spark in a dull year like 2020."}, {"id": 30, "text": "During our childhood, we have always seen our parents keeping maids and caretakers who used to look after our household and family. They kept us happy with their faithful service and in return earn our trust. Sharib Hashmi, Sharad Kelkar and Flora Saini starrer Darbaan which premiered today on Zee5 explores the friendship bond between a boy and his caretaker.Based on the 1918 short story Khokababur Pratyabartan written by Rabindra Nath Tagore , Darbaan introduces us to the world of coal mines during the 1970's era. As the government took the decision to nationalize the coal mines pertaining to the heavy losses suffered by the private owners. The world of one of coal mine owner, Naren Babu (Harsh Chhaya) was blessed with happiness as his son Anukul (Sharad Kelkar) enjoyed the company of care taker, Raicharan (Sharib hashmi). As the business of coal mined suffered due to the government decision, Naren Babu decided to let go off his servants and so was Raicharan who had to depart from Anukul.After few years, Anukul returned to his home town with his family and requested Raicharan if he could come and stay with them to look after his son. Being faithful to the family, Raicharan happily agreed and started looking after Anukul's son just like the way he used to look after Anukul when he was young. On one unfortunate day, Raicharan loses Anukul's son during one of evening stroll and is never able to find him. Struck with tragedy, Anukul's family is devastated and blames Raicharan for the disappearance of the child. Raicharan, filled with guilty, leaves the house but decides to repay his service with a gift which makes the life of Anukul and his family filled with happiness and love.In the age of gadgets, fast-paced crime, drama and thrillers, Bipin Nadkarni directed Darbaan is a welcome change as it transforms you to the world of village life where things were simple and yet beautiful. As the drama begins, you are introduced to picturesque world of Anukul and Raicharan which is enhanced with beautiful camera work and photography by Vijay Mishra, Sumit Gangopadhya and Amalendu Chaudhary. The movie works well initially as everyone is happy and you might be wondering what exactly is the story all about. Post 35 minutes, the movie breaks into tragedy as Raicharam makes the biggest mistake of his life.While the story moves on with act of suffering and guiltiness, Raicharan still had to make his final redemption. Here Darbaan suffers with a blemish writing, especially the scene where Raicharan searches for his son in the busy street of Gangtok. Even the climax is laid back and less impacting. The good news is that editing and a happy ending compensate for the minor suffering.Darbaan is a performance driven film and it is Sharib hashmi who finally proves that he can carry a film on his shoulder, despite playing diverse supporting characters in a big-budgeted films and web-series. The versatile actor excels in his role as Raicharan and brings out the emotions whom you will be able to relate. Shard Kelkar is another gem of an actor who keeps on surprising with his powerful performances. I liked Flora Saini as she does well in her role. Rasika Dugal impresses in her special appearance.Overall, Darbaan works on electrifying performances, strong storyline with a beautiful life lesson - being honest. Encouraging 3/5"}, {"id": 31, "text": "Before I speak about the film, I'd like to tell that I was eagerly waiting for this film ever since I'd watched it's trailer in March and had planned to watch it on my birthday in April but like all other films that got direct OTT release, this one had the same fate. Now maybe after waiting almost 9 months, my expectations were really high with this film and that's when I learnt that it's best to never expect anything because that way you'll never be disappointed.The performances are average except Rasika Dugal who was brilliant in her short role and Annu Kapoor's narration was perfect. There are some scenes which were really impactful. My personal favourite is the one where all family members are sitting on chairs while watching television but the caretaker sits on floor. On one hand the narrator says that the caretaker is like family but on the other hand, there's this divide which led to him sitting on the floor. This 'like' I think is what makes all the difference. There are many such subtleties if you look carefully and that works well for the film. The music here is all original and blends brilliantly with the narrative and is a plus for the film. Another thing that favours is the length of the film. Since it's adapted from a short story, the length is also short. Just 88 minutes. And that's good because the writers almost stayed true to the material and didn't try to stretch it unnecessarily. The underlying message and themes of loyalty, love and guilt have been conveyed in a nice way. So yeah, give it a watch because we surely have a dearth of good Hindi content but don't keep any expectations."}], "reviews_amount": 32}