{"name": "Nocturne", "titleId": "tt11044858", "reviews": [{"id": 0, "text": "Personally I think the rating does the film a disservice but maybe people expected far more horror where this is more psychological. It is an interesting perspective into the creative arts and from beginning to end focuses on the inferiority complex of mediocre protagonist Juliet. Even to the end she wasn't able to perform, get into Julliard, and died seeing an illusion of greatness. Two things that make it obvious it isn't real is she saw the vision of herself on the stage earlier in the film plus Vi's proud smile that is the total opposite of her demeanor in their final interaction. The cherry on top is even in death it seems like no one notices her. Perhaps that would be how the devil operates, he would promise greatness but ultimately you wouldn't be able to achieve it before sacrificing your life."}, {"id": 1, "text": "This movie reminded me of Black Swan and Perfection, but was original enough to be entertaining. Without giving much away, I will say I would have appreciated a bit more explanation on the notebook or the origin of how it came to the first girl. I guess it leaves endless room and questions for sequels and prequels. There is definitely more there to be explained, and it was good enough that I would watch another one to find out more."}, {"id": 2, "text": "... but remember, music is a blood sport and Juliet shows us why with a powerfully crimson performance as a teenage girl determined to rise to the challenge. Twins sibling rivalry and a piano provides the foundation but the cornerstones are the pressures placed on adolescence, the price of admission to achieving aspirations, the penalties incurred due to high expectations and the effects on others that take place as a consequence. Imaginatively done, if not all that original, it is the composition created by Sydney Sweeney that deserves the credit and a well earned round of applause."}, {"id": 3, "text": "Very surprised by this film. Not your typical horror but I would say this is way better than most. Solid acting, great use of music, well directed. This is definitely a film that will keep your attention. It is a little slower paced but the mood and setting more than make up for that."}, {"id": 4, "text": "I enjoyed this one, with the creepy faustian deal occuring in the background.Though why this is so interesting is because they chose to leave things a little vague and open ended. I interpreted this movie in at least 3 different ways, maybe in 4 even.At the end of the day it is hard to come across well shot movies with good plot beats, audio/music, and solid acting. This one covered the bases very well and has elements of horror woven into it, just enough to keep you on your toes.The ending was damn creepy as well.7/10 bravo, good watch."}, {"id": 5, "text": "Part supernatural horror, part sibling rivalry but lacks conviction in either area.An arts student who is hungry for success has bitter feelings towards her sister who is widely regarded as the superior pianist of the two, until she happens upon a cursed notebook which previously belonged to a former student ...Superb acting and direction but overall the story is not very gripping. Also, the side-plot of the supernatural notebook is not tied in too well with the central sister rivalry plot. It's interesting but its inclusion feels a bit irrelevant at times.The story feels quite familiar, seen before in movies like Starry Eyes and Black Swan but it's different enough, if less good, to warrant a viewing."}, {"id": 6, "text": "The movie started out so well, I thought I was in for a treat. Exceptional camera work and unusual use of sound, together with a compelling plot, this movie seemed to be going places, reminiscent of Roman Polanski's The Tenant.Unfortunately the tone of the movie shifts with the plot near midpoint from a young student's sense of identity fracturing under the stress of creative disappointment to mundane sibling rivalry.Generally, the acting is good, so is the direction. This movie could have been so much more."}, {"id": 7, "text": "This is a film that is wide open to interpretation.It has it's good qualities. Most of it can be found in the tension between our main character and well, just about every aspect of her life. The music is phenomenal, without doubt.The concept is interesting but I feel it could've been executed better. It was so vague and slow paced. For the most part, this was bland for me. Even though the best part was the final scene, overall, it just didn't impress me.It is a different take on envy and if you like films that explore that subject from a psychological thriller sprinkled with some horror/supernatural aspects, check it out. It wasn't bad but it didn't get me where I hoped it would take me."}, {"id": 8, "text": "The film itself was fine, yes you can clearly see the inspirations in terms of themes like Black Swan, and in terms of visuals and direction, like Suspiria.On a symbolic and thematical level, it was fine, but they have really outdone themselves with the endings.I mean ok, she froze as she did in the past, she ran away and tried to escape by committing suicide, but as she did that she imagined her successfully playing the piece (as she did before in her dreams, so she convinced herself that she was successful and her dream came true), but then again, she did die, but then again, she didn't, since nobody seems to notice this.My take is that she either did really die and as she did before, just imagine her becoming someone since she couldn't be someone in the real life. Or the whole ending was again symbolic of sacrificing everything to becoming someone, killing the old Juliet. And as the other teacher noted, you die and maybe in 300 years, someone will remember something you did, but your sacrifice may remain unnoticed, as it happened in the last few seconds.Either way, the film was mostly good, but they have really overdone the ending, it didn't have to have so many layers IMO.Also, what was the point of having all those horror elements? Just let it be a rivalry/success/failure/sacrifice thriller.All that stuff with the first girl and some of the horror nightmares feel forced in since the film is not really about that, it's more psychological.Maybe I'm missing the big picture here, but a more focused ending and less forced horror could've made this much better."}, {"id": 9, "text": "What is it with these new horror movies that leave you guessing what the ending is supposed to mean? Am I just that thick that I'm the only one person who's left thinking, What the hell was that? I don't think I'm giving anything away here to call this a spoiler. The rest of the film was enjoyable, and the acting was well done. I'll leave it up to you to decide your own interpretation of the ending."}, {"id": 10, "text": "Jealous sister, rivals and the desire to be the best in a tale that wasn't all that interesting. Typical raw ambition taking over and creating a monster. I would skip this."}, {"id": 11, "text": "This was okay but not as good as I expected it to be. I found myself bored several times throughout the movie wanting to skip forward. The concept was good it just didn't connect with me in the end."}, {"id": 12, "text": "Not a good start to this Welcome to Blumhouse thing. 4 films and this one was not a great kick off. In general the structure is alright. Beats hit when they should and the performances are pretty solid too. That is all my praise for this. It's a hideous looking movie for starters. Shot composition is ugly at best. The color palette is horrific. And the camera work is completely uninspired. Not only that but the sound design and visual effects are awful. They really put in as little effort as possible on the filmmaking front. But this is a horror movie so, is it scary? Not at all. There aren't any scares in this. Any mildly atmospheric sequences are dreams which couls not be more cliche. The rest is teenage melodrama and weepy expressions. Don't watch this."}, {"id": 13, "text": "I dont remember the last time I was so bored watching a movie. Slow burn is apparently synonym for overdraged these days."}, {"id": 14, "text": "Just so boring. Reminded me of something like black swan which was also bobbins. Didn't even bother finishing watching it."}, {"id": 15, "text": "Deus ex machina all the way. Forceds script, forced situations, all to fit a bad idea of a movie. It doesn't depict madness or a deal with the devil. Don't waste your time."}, {"id": 16, "text": "Great plot and very well executed.Definitely recommend to watch.The music,the camera work everything is so well done.Dont let me speak about acting-Sydney did a phenomenal job as everyone else,she'll be a superstar.The ending was not something that I expected but it was beautiful."}, {"id": 17, "text": "This started out slow and had a few twists. I would say that it held your attention, kind of had a The Perfection and Hereditary vibe to it. But I felt like it needed much more. In the end it could have been a little confusing for viewers but from what I could tell: too much propranolol will make you hallucinate."}, {"id": 18, "text": "1 out of 5 stars.Nocturne is a horrible supernatural horror film that plays more like a psychological drama film. About two sisters going to college and trying to be professional piano players. Juliet is struggling and jealous of her sister Vivian who is always successful at what she does. Until Juliet finds a music journal which builds her confidence.The film is boring. It lacks suspense. It is not even scary. The cast is tedious. The script is slow. The direction is dull. It is one of the worst films ever."}, {"id": 19, "text": "I was already intrigued by this movie, but it exceeded my expectations after viewing it. I actually really like this movie. The acting, the score, and editing was well done. This movie will keep your attention, though it slows down for a bit...but it snatches you right back at the end. You won't be disappointed."}, {"id": 20, "text": "Trust me it's worth watching. Acting performance was great. Writing could be more better but story was memorableI don't know why it's rated so bad but it should be at least 7.5"}, {"id": 21, "text": "It's really bad. think Black Swan except not good."}, {"id": 22, "text": "TERRIBLE I was excited to watch it because in the previews it looked interesting, and it was not what I expected it was horrible waste of my brain cells."}, {"id": 23, "text": "The movie flowed rather well, I just dislike endings that leave you guessing. IMO, when this happens, I'm more on the belief that the writer had no clue how to properly end the flick, so it becomes a toss up. The acting was great, camera and effects all blended well - it drives me nuts though when I have to google wtf just happened once it's over."}, {"id": 24, "text": "Saw this till the end waiting for something to happen. It didn't. This is obviously the American version of the British hammer house of horror the story was written by someone who clearly couldn't be bothered to finish it properly. The acting was bland. I mean it's basically about someone trading their souls just to play one decent bit of music. Far to much was left to the imagination. Something that the people whom made this crap were obviously lacking. Miss this!"}, {"id": 25, "text": "I'm sorry but this movie fails to convey any message at all, it's like watching plants grow. I noticed lately that many filmmakers have difficulties showing horror which they mix with annoyance or disturbance."}, {"id": 26, "text": "As a psychological thriller this scored low and if honest what ever label it was given genre wise it would score low not enough build up in story or much else I found the whole thing tedious and not entertaining in any way infact the only commendable thing in the whole movie was the short inserts of music which was very good"}, {"id": 27, "text": "I wasnt expecting much from this movie but it was very tense and the depiction of a panic atack at the end was spot on. Great movie with belivable characters."}, {"id": 28, "text": "This looks like a horror version of Whiplash. As describing the girl named Juliet who is obsessed with realizing her dream, this adopts the eager girl's story to the horror. So its plot must remind you of the type of movies which express a dreamer is cursed to succeed such as Whiplash, Blackswan. But This one is more gore and satanic.Me personly, I love this movie. the story is my favorite thing besides the combination of dreaming is a curse story and the satanic ritual factor is working well.As Juliet goes far, the gore expression drives and which is making sense with its story too. If you are a fan of Demian Chazelle and horror movies, I highly recommend this one."}, {"id": 29, "text": "How good is a deal and what is it worth? To you and to society I reckon. Overall I thought I'd give the movie a 7 out of 10. But the ending really convinced me to go and give it another point. So while the movie is well made overall and Blumhouse has shown us, they do know how to make horror movies and thrillers, it is always nice to see, visually and otherwise.The actors are really good in it too. Perfect Blue, a Japanese Anime may have handled the theme about fame and what it does to ones psyche better. And it was quite more vivid than this - way more brutal too. But that does not mean there can only be one. This can exist too and have more than a right to be and be watched. If you are interested in what the movie tells, you might not care about what critics have to say anyway"}, {"id": 30, "text": "Not much going on beyond the synopsis but it's well carried. Despite the early signs of it looking like a teens on campus film there's no idle filler scenes of dialogue for the sake of dialogue, instead a good chunk is taken up with classical piano. Not a gory or jump-scare horror, more eerie supernatural vibe kind of deal. Sweeney does a fine job as the lead and the rest are okay."}, {"id": 31, "text": "Who was the pianist on the Saint-Saëns? It amazes me when important talent goes unmentioned even in the crew credits."}, {"id": 32, "text": "Nocturne is another Welcome to the Blumhouse horror movie dropped together with three others on Amazon Prime. More of a B-movie version of Black Swan (or the slightly better Perfection on Netflix), the high school teen drama really weighs it down.And nothing very original either: someone kills themselves in the opening minutes, the protagonist finds her weird evil book, and life starts going her way (or so she thinks). I must have nodded off because for the life of me I don't recall why its even called Nocturne. The evil book I guess?Pass on this one and watch the much better Suspiria remake instead."}, {"id": 33, "text": "I only watched this movie because I am a Sydney Sweeney fan and she did not disappoint. It started off slow but definitely started getting interesting and entertaining halfway through the flick. Very Erie feeling throughout the movie. The ending keeps you thinking what the meaning of the whole movie is....which I liked. Well acted from both lead actors Sweeney and Iseman. Blumhouse has been releasing great flicks!"}, {"id": 34, "text": "God, this was awful. So slow and not much of anything interesting going on. Then the ending was ridiculous. Would definitely not recommend."}, {"id": 35, "text": "First of all I wouldn't call this horror. If this is horror then almost every movie with a bit of suspense is horror but whatever. I thought Nocturne was just an average movie, really nothing special, and on top of that with a stupid ending. The cinematography is okay but not special either. As for the acting I guess it wasn't bad even though Sydney Sweeney is annoying to watch, but that's only my opinion. The story could use a faster pace and more intersting scenes. Now it all felt a bit bland, a bit boring, not really the kind of movie I enjoy."}, {"id": 36, "text": "I think the film might have been better if the writers left out the dark arts/supernatural cliche out of it and developed the characters of the two sisters better. If the focus of the writing was more of jealous and sibling rivlery taking a dark turn, the story could have been much more interesting"}, {"id": 37, "text": "I really enjoyed this film. A pair of gifted sisters compete for greatness in their piano playing. One is deemed better than the other which obviously causes jealousy and a beehive of emotions.One of the sisters (the one deemed less talented) finds a book belonging to a fellow gifted music student who recently committed suicide. She begins to follow the teachings in the book, not realising what the book actually is. Determined to better her sister she continues the path laid out in the book.The story and atmosphere gives an air of Suspiria. The cast are fab, the plot is fresh and gritty. The cinematography is quite beautiful."}, {"id": 38, "text": "Not a terrible movie by any stretch, Nocturne's drama has its moments, though you'll see its plot beats coming from a mile away. If you're looking for a horror film, this simply isn't one.The macguffin of the film (a mysterious sheet book with drawings that seem to foretell the future) doesn't make a lick of sense, but don't worry, it gets completely forgotten about by the time the third act finally rolls around.Don't be fooled by people getting hung up on the ending, it isn't particularly dense or necessitating any sort of analysis. Juliet's sacrifices resulted in nothing in the end and life moves on."}, {"id": 39, "text": "Did not expect to stay with it, but this kept me interested throughout. Doesn't need a bunch of graphic violence and therefore didn't use it. Felt like I was watching a legit film for the first time in a while. Main actress was great and I didn't end up hating her for being tiresome. She was pretty relatable as was the story of sibling rivalries. Nice dose of supernatural without going overboard."}, {"id": 40, "text": "Sydney Sweeney and Madison Isemen are excellent! The trailer when watching other stuff convinced me to see this movie, I'm glad about it too. The horror elements are magnificent to me although partly isn't one at the same time some of it seems like a teen drama. Nocturne definitely has some wtf vibes!"}, {"id": 41, "text": "This movie has no solid climax. This movie is like a modern art. You can perceive anything from this movie.I don't know what the director had in his mind."}, {"id": 42, "text": "Don't go on the negative reviews, its a slow burn but its a must watch !!"}, {"id": 43, "text": "The film is a suspenseful horror drama about how negative emotions can sometimes be a demonic force for an artist, but it's horribly dull and at times unbearable.The teenagers are uniformly immersive, and the characters are so conventional that it's easy to forget that the setting is a music school. The protagonist is Juliette and her sister is Vivienne, especially foreshadowed by the initials of her sister's name being VI, but the pact with the devil is just written in a notebook, and there are no Satanist groups or anything else in the film.Sidney Sweeney gives a relatively good performance, so her fans may be reasonably satisfied, but horror movie fans will be disappointed as nothing more than a synopsis or plot happens."}, {"id": 44, "text": "Nocturne was a somewhat enjoyable horror flick that was obviously inspired by some big hitters like Suspiria both versions and Black Swan and since Black Swan is inspired by Perfect Blue you can also add that film to a list to.So back to this film,it was somewhat enjoyable,it had a solid characters with simple motives that were easily understandable and i was able to support them in their causes from some unknown reason to me.Story was fine but it could have been a lot better then it actually was.Ending will leave you keep guessing what it all meant but it wont cause you headaches i think"}, {"id": 45, "text": "What was the point of this movie? In the end it was just a sad and meaningless film. All this girl wanted was to be as good as her more talented sister. Apparently that's a death penalty. Anyways, she stumbles onto a book and with each page turned she somehow becomes a better piano player. When she finally realizes the book is evil, it's a little too late. I was disappointed with the ending. They try to trick you into believing the film ends two different times. One is where she nails her performance and becomes a star. The other is her jumping off of a roof and committing suicide. They went with the sad ending and I thought it ruined the movie. 5 stars from me."}, {"id": 46, "text": "She's incredibly talented! The wide variety of expressions and body language she has possessed throughout the movie is impeccable. The movie's script in weak, and direction not upto the mark. But, watch it for Sydney Sweeney. She's brilliant. She'll remind you of Natalie Portman of Black Swann."}, {"id": 47, "text": "Don't waste your time on this. It's agonizingly slow. Shallow plot."}, {"id": 48, "text": "I like in this movie that they shoot light in different frames in the storyline."}, {"id": 49, "text": "I honestly enjoyed this film quite a lot, especially the ending. Although it was foreshadowed and kind of served as a spoiler in and of itself the execution was delightful and imo well done. The pace of the movie was great, the acting great. I could easily compare the characters here to the characters from Black Swan (one of my all-time favorite movies) so of course i maybe bias. Either way, it's nothing to rave about but 100% watchable and can be enjoyed. Not worth such a low rating at all."}, {"id": 50, "text": "It was a pleasant film until the end. Perhaps I wasn't paying enough attention, but the end made me feel ripped off."}, {"id": 51, "text": "An interesting story that is visually executed very well. Two competing overachieving twin sisters are matched against one another at a music prep school. The envy of the slightly less achieving sister is palpable and drives the movie. It's a good story, and my only regret about the movie is that it is poorly executed at times, and the story hiccups a bit awkwardly at times. Worth watching."}, {"id": 52, "text": "So we start out here with some girl who plays Piano. I guess she's got a sister and they live at home with....... well a bunch of guys??? I see Dexter's girlfriend there so one of these guys is probably Dexter. Looking at some good California mountains and hills there when they do some driving.So she's off to some college / music school and I guess she's going to be living in a dorm there. So I guess someone died who was going to do some big performance for the whole school and they are starting a competition to fill that position again.Haha, so in the competition , younger sister plays the SAME PIECE her older sister played. This is not smiled upon by older sister!!!! So wait now in the middle of playing the piece, something happens....She's now walking around in some sort of dreamscape hallway or something... Oh wait. She sees SOME SORT OF VISION OF HER SISTER GETTING ACCOLADES!! And then she wakes up, on the floor where she apparently passed out playing her piece.Oh and now she's got a tude. Her teacher slaps her for her tude. That was quite uncalled for. The teacher does seem like a buffoon. So she gets assigned to another teacher, the one who was teaching the girl who offed herself.Okay the teacher, had a great line. +1 STar for a Great Line...Okay after a party where they drop some E or something. Vivian falls and breaks some bones. This leaves the gap open for Julia to take her place in the Concerto! Which she does. And then Vivians boyfriend breaks up with her and does the deed with Julia.-1 Star for a sex scene with no nudity. We don't like that.Juliet's teacher sees real magic in his student. Probably just like he did wiht Moira, the girl who DIED. Juliet starts to understand that all these things that have been happening are drawn in this book she has. Where did she get this book? Did she draw it??So finally we get to the Concerto! And man does Vivian let Juliet have it verbally before Juliet goes out hter to play. Wait what did Juliet just do??? Oh I thought she burned her hands. Well she does take some pills before going on stage!!! And then she gets out there and FREAKS OUT!!! aND THERE IT IS.... THE LIT UP EXIT SIGN!!!! THE LADDER TO THE ROOF!! YOU CAN DO IT!!! AND THEN .....SHE PUTS HER BEST FOOT FORWARD!!!!!! Or wait, she didn't just go up to the roof and jump off. She actually played the Concerto. SHE RECEIVES THE ROSES!! OR WAIT....DID SHE JUMP OFF THE ROOF???? IT SURE LOOKS THAT WAY....OKAY WHAT THE HELL JUST HAPPENED?? HAHA. THAT ENDING WAS JUST BIZARRE. DID IT HAPPEN OR NOT???5/10"}, {"id": 53, "text": "Nicely shot and styalised, and a good premise. Sadly the potential for a memorable Faustan horror was lost due to flabby, ponderous and ultimately pointless scenes which seemed to drag on for too long. The 'devil's bargain' element which should've carried the whole film was a nebulous mess with no clear definition. A real shame.Acting was pretty decent, and I guess the lead got the teenage angst' down pretty well, not that it means anything to viewers outside that age group. The dynamics between the sisters was a bit boring and cliche'd too. The music was beautiful though. If only there was less time on the meaningless navel gazing and more time deliniating the central theme. 4/10"}, {"id": 54, "text": "Stupid teenage movie ,dont waste time ,you can predict everything in this movie,nothing new !"}, {"id": 55, "text": "Great performance by the lead actress; though not that original, the script was interesting; on the whole, it's worth watching as entertainment material."}, {"id": 56, "text": "A beautiful movie that kept me guessing. In the end.... well it was left to be determined by the viewer what you personally think it means6.4"}, {"id": 57, "text": "Zu Quirke's directorial debut, 'Nocturne,' plays like a remake of 'Black Swan' (Darren Aronofsky, 2010) but with echoes of 'Whiplash' (Damien Chazelle, 2014) and the more recent 'The Perfection' (Richard Shepard, 2019). It is not too scary nor overly intense but it does have an engaging story and characters that which will keep you watching. The best thing about this film is its lead, Sidney Sweeney, who finds her moments to shine even in a roughly sketched character."}, {"id": 58, "text": "In the general sense a nocturne is a musical composition that is inspired by, or evocative of, the night. In this story it is more aligned with the darkness of a musician selling one's soul to the Devil to gain something otherwise out of their reach.Twin sisters have been pianists since they were little girls. Viv has turned out the more talented one, with a scholarship to Juilliard, while Juliet is always a step behind in her shadow. But Juliet wants more and when she finds the notebook of a fellow student, a violinist who jumped to her death recently, it sets her and her sister on a much different journey.While I don't often watch horror movies, or movies with an occult theme, I found this one to be suitable interesting and entertaining. On Amazon streaming, from the Blumhouse Production company that specializes in making TV movies."}, {"id": 59, "text": "A teenage flick with classical music pretensions. I am a little confused here. Is she a pianist or a violinist? Or both?"}, {"id": 60, "text": "I loved it! That was very good and there was really tension in the movie. Good characterization and acting...Worth watching."}, {"id": 61, "text": "The concept overall is quite good. But it feels like no idea was thoroughly thought out. Either for lack of budget or the time limit, nothing happens besides what you already know is gonna happen. The writing is so bad, there is not even one relatable character in the whole film.Black Swan is a masterpiece compared to this."}, {"id": 62, "text": "Loved the music, I would have liked to have heard more. The teachers at this academy are all scumbags, and the world of competitive music competition is exposed warts and all. I didnt quite get all the imagery and Faustian deal going on, until I read someone elses review. However, enjoyable, the rivalry between sisters can be intense especially when one of them is a dysfunctional psychopath."}, {"id": 63, "text": "Black Duckling meets Whiplash, but without the tension necessary to keep your eyes glued to the screen. Sweeney does a decent job at being a stop-at-nothing brat, but Zu Quirke's script is too messy and quite basic. A decent first feature, that fits right in at Blumhouse."}, {"id": 64, "text": "It's a decent movie without any real big faults. Acting is fine and story is ok. It does get a bit slow and tedious for a moment but picks up towards the end. Oh and it's not a horror movie, so don't expect one."}, {"id": 65, "text": "This 2020 horror-drama tells about a young woman, Julia (Sydney Sweeney) who is a talented pianist. She finds a mysterious notebook of a recently deceased, violinist that starts to control her behavior, fate &amp; relationship with her sister. This is a weird &amp; disturbing flick, but Sweeney does an ok job. If you like psychological/supernatural flicks, this may be up your alley."}, {"id": 66, "text": "Beautiful music accompanies a dark story. The world of arts is a competitive one, and Juliet and her sister Vivian learn this lesson. It's visually appealing, the story is good, and it has some Dark Swan vibes that I'm digging."}, {"id": 67, "text": "For goodness sake - why do young American actresses speak with such annoying inflection.The story wasn't bad, although the production/editing/directing should have been a lot tighter. Many scenes were left hanging for far too long without any benefit to the story at all.The lead actress' acting also brought the production down in to an annoying level - although that is at the fault of the director of course.All in all a very tedious and annoying production where not enough thought went in to production. Give it a miss and ignore the fake reviews."}, {"id": 68, "text": "This one is okay. It's not terrible, but it is a little juvenile. It probably would have appealed to me when I was in high school. The acting is fair, the premise interesting, but it just didn't all come together in an intriguing way, and it ended up being pretty predictable. I usually like movies that come from Blumhouse, but this one just didn't do it for me."}, {"id": 69, "text": "Nocturne 2020 15 Director: Zu Quirke Starring: Sydney Sweeney, Madison Iseman, Jacques Coliman, Ivan Shaw, Julie Benz, Rodney To, Jonell Kennedy, John Rothman etcOverall rating 78/100Nocturne is about two twin sisters Juliet (Sydney Sweeny) and Vivienne (Madison Iseman) who both play the piano at a musical college, but Juliet becomes obsessed with trying to better her sister and will do whatever it takes to do so. I really enjoyed Nocturne and it executed and delivered in most of the areas it needed to with a few flaws, so let's get started.I loved the cinematography, set pieces, use of sound and strange tone. The movie was visually really interesting, with fantastic use of colour to represent different emotions of as a visual symbol for the darker elements to the movie, It was overall filmed very well and had some really interesting high angle shots and close ups to cause tension and to make an impact, the set pieces were also really great, with multiple different key sets which served a specific tonal purpose. The use of sound was also excellent, there was a lot of disturbing background noise or repeated diegetic sound that appeared to make you feel uncomfortable, due to this the movie had a very strange tone that worked very well, due to the dark subject matter the playing of the piano was done in a really haunting and uncomfortable way and had me on edge the whole time it often felt like a hallucinogenic or dream like tone.My next few positives would be interesting concept and characters as well as the slow building of tension. I thought the whole concept of classical music being a key element in the story was really interesting and rarely done in movies like this but in fact it helped the movie with its desired themes and tones. I also found the relationships in the movie to be really interesting, the relationship between Juliet and Vivienne was really interesting to see, the slow deterioration of their relationship was done really well and actually contributed to the story well. I also thought the movies slow building of tension was excellent, they did an excellent job at teasing the audience and making the impact of each scene more and more big with every scene to make you feel more and more uncomfortable.However, I had a few problems with the movie which included the lazy set up of the main plot point, the lack of believable relationship, the lack of development between the sisters and the mediocre main performance. I thought the way they set up Juliet getting the musical book was a bit lazy, having it just drop on the floor considering it was such a big plot point they could have been more creative here, I just found that the movie lacked any real believable relationships, the sisters never really felt like they were, and there was never a proper connectable relationship only brief moments. I also thought that there was a lack of development with the sisters relationship, I personally thought that the sisters permanently being jealous and hating each other instead of having some form of character arc was disappointing for me as for me it would have been a more satisfying development for the plot and characters to have some form of positive aspect to all the negativity. And finally I sadly found the main performance to be very mediocre, no offense to Sydney Sweeney she tried her hardest and was certainly watchable but I just didn't find her good enough for this specific role, I never really connected to her performance therefore limiting my connection to the plot and her character and always thought she played it safe.My final few positives would be the main characters slow decent into madness, the clever links between plot points and the powerful ending. The film excellently conveyed Juliet's slow descent into madness, they made slight changes to her costume or hair and make up to signify big changes with her character and this kind of subtle nuanced changes really worked, I also found that the links between the illustrations within the book to what was happening with Juliet was very cleverly done and once again the subtleness of it really worked when you didn't realise that they were linked. The ending was powerful as well, the imagery linked to Julet's character was absolutely excellent and left a big impact in the realisation that no matter how much she tried she was never going to be noticed.Overall Nocturne is a very strong movie, that despite it's lack of attention to a more in depth look at the characters and the movie playing it very safe in parts, I still was impacted by it's successful message and it's successful execution of it's themes and tone."}, {"id": 70, "text": "Intriguing film set at a private arts school centering on twin female pianists. Julia, the main focus, is overshadowed by her sister V (Vivianne). The setting pulls for the tension between siblings, the rivalry at school, as well as what exists for twins. There is a strong element of the supernatural that infuses the protagonist and fuels the conflict, but it soon begins to alter Julia and question her sanity. The build of the film is good, and the acting decent all the way around. But, the culmination of the slow burn ends with a whimper not a bang. Adding to this, the adolescent angst is played a notch too high for my tastes and only detracts from the tension."}, {"id": 71, "text": "As weak or strong as we are there's still a chance the weak may decide choices for the the strongest individuals. Acting cast did a great job detailing this storyline!"}, {"id": 72, "text": "This is certainly an interesting movie filled with great performances. Sydney Sweeney is outstanding in the lead as a pianist overshadowed by her more successful sister. Ivan Shaw is also great as her teacher. The movie is beautifully shot, the music excellent ,if you love classical. No pun intended, but this movie hits many of the right notes in keeping it fascinating and to some extent spellbinding. And yet, ultimately I feel the movie fails because of a failure to commit as to what it wants to be. Listed as Horror, Mystery and Thriller, it may be somewhat of a mystery, but there is no horror to it and while at times thrilling, this is not a thriller. I just finished it and am not sure what I just watched. More a psychological drama, it's one more movie that wants to leave you hanging as to what you've just watched. Honestly it's also kind of gloomy and depressing made more so by the fantastic and realistic performances. Worth watching but unsatisfying if you are expecting horror."}, {"id": 73, "text": "The fourth and in my opinion best of the four announced Blumhouse films for Amazon Prime has arrived with Nocturne. The film stars Sydney Sweeney and Madison Iseman as twins Juliet and Vivian. Both attend a noted music school and Vivian is a prodigy who has been accepted to Julliard upon completion of her studies.Juliet had applied only to Julliard but was not accepted and this has caused issues with the faculty who had encouraged her to apply to other schools as well due to the 7% acceptance of Julliard and the longs odds of one or both of them being accepted.When the top musician at the school kills herself, a spot to do a featured performance at an upcoming showcase arises and Vivian is asked to perform as she is clearly the next in line. Juliet comes into possession of a mysterious notebook filled with strange drawings that belonged to the recently departed former prodigy and she becomes obsessed with the drawings which seem to predict the future and in turn cause her to add drawings of her own to them. This starts a chain of events where Juliet sees a change in personality where she begins to covet her sister's talent, success, boyfriend, and more and begins a chain of events that will upturn their lives.The film like the prior three Blumhouse Amazon films is not scary nor overly intense but it does have an engaging story and characters which will keep you watching and delivers an entertaining twist on films such as The Competition which depict the struggles and conflicts of aspiring musicians.3.5 stars out of 5"}, {"id": 74, "text": "Music is a blood sport. Dr. Cask (Ivan Shaw)Having just viewed The Wolf of Snow Hollow, which combines the satiric with the traditional horror genre, seeing writer-director Zu Quirke's Nocturne made me realize that a horror film with no digitized scares or much blood to boot can be a most terrorizing rendition of that durable formula. The scare is in the mind, you see.Juliet (Sydney Sweeney) and her more talented sister, Vi (Madison Iseman), compete at their high-class music school for the chance to play in the school's final concert. They both choose Saint-Saëns' Piano Concerto No 2 (remember the concerto competition with the demanding Rachmaninov 3rd in Shine?). Although Vi wins the right to play it at the concert in the end of the year, Juliet makes an implied Faustian pact with the devil, whom she found in an old playbook, to reverse her sister's fortunes and enhance her own.What is so impactful is the lack of blood and screams; in fact, there are few, if any, jump scares. The terror is in Juliet's head, her obsession to win, her jealousy as the guiding principle. It's all very sotto voce, so to speak, a quiet doom tamped down by beautiful music and feelings kept just low enough to allow effective dialogue and feel the presence of a malevolent force, which may be the devil but surely is the green-eyed monster which doth mock the meat it feeds on. In some sense, I am reminded of the rivalry in Black SwanAbout the Saint Sens, pianist Lise de la Salle wrote: The highly lyrical first movement is an expression of late Romanticism. The second movement is as effervescent as a glass of champagne. And the final movement, a real whirlwind, a fantastic ride (wonderfully captured in this quasi-perpetual movement in triplets), is quite dizzying. These elements could be found in Nocturne.Welcome to the Blumhouse is a program of eight terrifying genre movies coming to Prime Video, and if the other seven are as good as this one, Halloween viewing will have matured to an intelligence and psychology worthy of a genre rarely this high class or intellectually satisfying."}, {"id": 75, "text": "The second of Amazon's Blumhouse collaborations I watched was Nocturne, a debut feature from writer/director Zu Quirke which, not unlike Black Box eschews conventional horror, this time for more of a psychological thriller.Juliet (Sydney Sweeney) lives under the shadow of her twin sister Vivian (Madison Iseman). Though both are talented pianists, Juliet's demeanour means that Vivian is graduating to Julliard but she is not. Moira (Ji Eun Hwang), their current schools most gifted student, takes her own life, which means the final concerts solo is vacant. Vivian seems the natural person to claim it, until Juliet finds Moira's notebook, a cryptic and dark series of notes, markings and illustrations. The book has an effect on Juliet, increasing her confidence, but how far is she willing to go to claim that solo.As with Black Box I feel that there's lots to admire with this film, but little to love. It does feel like a budget version of Black Swan, with its story of pressure are the higher end of artistic achievement. The performances from the two leads, Iselman and Sweeney, are really good. Art direction and cinematherapy are decent, the effects - such as they are - aren't bad - though it does help that they often aren't looking for realism, rather part of a fantastic dream type sequence. I do feel like I'm prepared to give the film a whole point for the final shot (to say anything more is a bit too spoilery).But plot wise it's a bit too humdrum and predictable. You'll be well in advance of Juliet in terms of what is happening and you'll probably see the ending coming a mile off. There are a couple of minor twists that the film doesn't do a great job of disguising and it's all just a little too flat, and lacking in originality and invention to recommend it as worthwhile.Negatives ultimately outweighed the positives for me, but at least there were positives."}, {"id": 76, "text": "While watching 'Nocturne' it can be really hard not to notice the similarities between this and 'Black Swan'. It's slightly less sexual but the story follows a very similar pattern. To be fair there are far worse films to base yours off. It's just something I noticed. The opening scene of 'Nocturne' sets up some intrigue. It's not a scary or suspenseful scene, but it is strange and leaves you wanting to know why it happened. From there the film sets about telling its story, and does so in a surprisingly compelling way.I'm not a big music fan (and certainly not classical music) but I didn't find that hindered my enjoyment of the film at all. If that's putting you off seeing the movie I would suggest not to worry about it. The film is a horror, but more in a bizarre way than a suspenseful or gory way. If horror isn't for you, I would say that isn't necessarily a deal-breaker on this one. I could imagine non-horror fans finding a way to enjoy this movie.Sydney Sweeney was really good in the lead role here. She played a big part in making the film as watchable as it was. She's in every scene so it was very important she got her performance right. I liked 'Nocturne' without ever perhaps loving it. It's worth a look but don't set your expectations too high."}, {"id": 77, "text": "I got a little problem trying to figure out how many stars this deserves.The movie is great. The acting was phenomenal, so much u can even feel the nerves in your veins just as the main character.The whole plot is good, I loved the times of the movie, not too slow, not too fast, is just right. The film make me stay there trying to look for answers the whole way. Pretty focus on what's going on. Very interesting.Now, there are some things that makes this movie really awesome, incredible. Things that make me love this movie so much. BUT, also, there is something that causes me a weird feeling (specially after watched it) Like a hole, a sensation of emptiness. But, after thinking about all day I think it's a great ending. It seems a little confused but when u think more about it, all the movie is about that. All plot guides you to THAT ending.So yeah, it is definitely worth to see. Just keep an open mind."}, {"id": 78, "text": "Art and academic institutions have been the backdrop of many a horror film in the last 100 years. The ones that immediately come to mind include Black Swan, Suspiria, and Whiplash (less horror, more drama). It's almost like these films had a love child. Sibling rivalry is what takes centerstage in Nocturne. Juliet and Vivian are pursuing music at a renowned institution for classical musicians, which has recently witnessed the expiry of a student named Moira.Juliet, reserved and less popular, always looked upon as the understudy, is a stark contrast to her sister who performs well, has a boyfriend, and is guided by one of the best teachers at the school. When Juliet gets her hands on Moira's diary, things begin to look different. She goes down a very dark and twisted path replete with hallucinatory visions, malicious intent, and a deteriorating relationship with Vivian. Writer-director Zu Quirke enhances the rather predictable plot with mystifying frames, solid music placement (composed by British EDM artist Gazelle Twin), and by extracting a great lead performance out of Sydney Sweeney.In a style that draws parallels to Garance Marillier from the Spanish cannibal drama 'Raw', Sweeney lets her eyes do much of the talking. The ending wasn't the best, however, the storyline came full circle. At a crisp 90-minute run-time, Nocturne manages to tell a story that intrigues, gets under your skin mildly, and makes you sit up. This is, without a doubt, my pick among the current Welcome to the Blumhouse collection, which ranges from lackluster (The Lie) to borderline terrible (Evil Eye)."}, {"id": 79, "text": "The 4th and final film in the Blumhouse/Amazon collab Welcome to Blumhouse is the least effective of the four. That being said it's still a decent but slightly generic shocker. The movie is a mix of Black Swan with a dash of Hereditary. It centers on a young woman whose one of two talented pianists currently enrolled in a performing arts school who are both twins. After the suicide of the school's top talent, it leaves an opening for one of them to be featured in an end of the year concert. One of them seems to have it all while the other constantly struggles. That is until she gets hold of the dead girls notebook and begins experiencing delusions, pushing herself and hurting her sister. This was a really hard one to get into but it's well made with good performances and the subject matter that explores the stress teens feel is intriguing and relevant. Although it never quite reaches the heights of it's creepy potential. The effort is admirable and overall interesting enough to merit a light reccomend.***/5"}, {"id": 80, "text": "This was a very enjoyable movie. Not truly a horror movie in the traditional sense with jump scares and excessive violence/gore. It is more psychological so keep that mind before you watch this movie. Sydney Sweeney and Madison Iseman were excellent in this film and definite highlights. The soundtrack and music throughout was very high quality and you could tell that great care was taken to make sure that the score was top notch. The story and advancement of the plot was a good balance and the kept interesting by the splicing of supernatural scenes and a certain amount of questioning for the audience whether this was real or in Juliet's mind. I also like the competitive/jealousy dynamic of the sisters throughout the movie and it serves as the basis for why both sisters can be down right cruel and vindictive (both of them get their shots in, especially Madison near the end of the film). I liked this film from start to finish and heavily sympathize with both sisters throughout the film. Madison was the prodigy who had a promising future and Juliet was always in her shadow. She wanted to be somebody, popular and famous, loved and valued. A thought provoking film with an ambiguous finale and I look forward to watching again in the future to gain some additional perspective on certain scenes. An easy 9/10 for this genre of film, do not skip it!"}, {"id": 81, "text": "The downtrodden twin in a piano-virtuoso sister act seeks inspiration to rise up and hit the high notes. But her inspiration comes from a dark place ...Promising start to a movie that wants to go beyond horror conventions. The opening scene is mysterious yet full of clues, with assured direction, editing and set design. The outstanding element is the music and sound, which opens with Tallis style singing, ethereal and atonal, and then hands off to a mysterious violin before shrieking away with a tritone hell-cry. Phew.The home and school are elite, but the story does take us into the domestic normality of a family with a standard sibling rivalry over musical achievement. The shadow lies in the history of tragic deaths among the supreme pupils at the arts academy, so we're in for a clash between mundanity and excellence, which leads to a good bit of dialogue about the Devil at the door.Effective horror sets a boundary between this world and the otherworld, the normal and abnormal, and a good horror takes us across that boundary with energy and imagination - through the looking glass with a gasp of fear - while a true horror sets that boundary in every second of the experience.There's been a problem with some recent praise-worthy horrors, when issues dominate the crossing over - family troubles in The Babadook, the trouble with dementia in Relic - and the horror is never fully realised, but acts as a vehicle for the story elements. The horror has to come first, and if the characters are true then a mind expanding awe will shake itself out of their bones.Same problem here, as the writer-director frets too much over the logic of his scenario, with frequent bouts of exposition and on-the-nose dialogue distracting from the weirdness promised by the music. It does stay on track in the first half, even mentioning the tritone, but it probably veers away with the hokum theme of musicians striking a deal with the devil, when there's a whole field of neuroscience about music and cognition to draw upon. The final scene does bring back the weird, but not enough to cover the cautious build up - which itself is probably reflected in the neat running time of 90 mins.The obvious comparison is Black Swan, which is deeper and more passionate. Maybe closer in theme is The Sonata, a lesser attempt at the diabolus in musica. So much of this is impressive, and there is the brief promise of something special, but I'm still waiting for the genius who integrates the horror of music into the story itself.Overall: Promises the black nipple, squirts out formula."}, {"id": 82, "text": "Mine is that this is also a movie about the different sides of sibling rivalries. Perhaps the ultimate version of them because this one is between wombies, aka twins. I've always known twins to be so close and so supportive of each other that it's hard to imagine that there could also be dangerous rivalries. That one could be emotionally traumatized by the other sibling. The same as can occur between non-twin siblings. I grew up with a case of sibling rivalry that continues to affect my relationships with my brother and sister to this day. So I can relate to this drama play. The psychological thriller element is intriguing because it raises questions like 'what could have been', or 'what might have been'. Even 'wait, what just happened?' Movies such as this that attempt to portray the interpersonal relationships of siblings is fascinating in what it can reveal about the pro- and antagonists in both the best of relationships and the very worst. The things that can affect our other relationships later in life too. The only potential spoiler I will reveal is my observation that one must really watch out for the silent ones. The emotionally too detached relationship. And don't ever give up trying to break through to find whatever it is that 'haunts' them and that prevents you from being close with them. Those conversations can be troubling perhaps. But the effort expended while attempting to better understand each other can be a wonderful revelation. So always love the one you're with, and make sure they properly perceive your love and affection for them."}], "reviews_amount": 83}