{"name": "The Sun of Gnosis", "titleId": "tt11833648", "reviews": [{"id": 0, "text": "This picture is a great start for Godus brothers into this industry and it was their natural development from content creator in YouTube into film makers, i wish them much more success and many more movies in the future as our culture has a lot of stories haven't been told yet on the big screen.As they did in Predicament in Sight, this story is personal to the creators, it represent a true picture of the 2010 era in KSA and Saudi people specially who lived in Jeddah will connect directly with the story and the characters who were nicely written and well acted. The journey our characters took to create the film was lots fun, i sympathized with the struggle they went through and loved how the coincidence with Mr. Orabi was a factor for their film to be created, not everything in life is planned. The comedy was good, i laughed a lot and enjoyed the comedy that came from the characters themselves specially Mr. Orabi and Maan were really funny characters and actors . There were couple of sequences beautifully shot and edited and it gave me a thrill, the camera work in general was fantastic. The throw back to the original Saudi YouTube programs like EyshElly and 15 to 9 who made an actual cameo was hilarious, I couldn't believe they brought back Mohammed Bazaid! the guy made a company like 6 years ago and disappeared. i liked how they used the bad language as people are actually using and they did not try to make the dialog looks clean as we usually do in movies/TV series yet the language wasn't that bad. Also the animation scenes were really nice addition to represent what's going on in Hussam's mind, loved it. From the story point of view i wished I'd spent more time with the characters before Mr. Orabi's accident happens specially with Orabi himself, i wanted to hate him and laugh at him more before he joins the team lol . I loved the ending, their film was crap and they knew it but their passion was true and they kept developing, until one day they reach to the level they will accept as a critics, to themselves. I should give Baraa Alem a credit for his performance as he showed a good acting and emotional range for his first role that made him the true star of the movie, i hope we see more of him and wish him best luck in his new career.The down sides for me that sometimes the events were a little bet messy specially during the shooting of the film scenes. The voices were not clear in some shots.In general it was a funny enjoyable movie, i had a blast watching &amp; experiencing it and time flew by, worth the time and the money and what a come back to cinemas after these dreadful months. I'll definitely watch it again."}, {"id": 1, "text": "Loved the movie, the whole movie was so reflective of our society and of the things that touched and affected us in our most sensitive youth. The characters were so vibrant and vivid, the storyline had the perfect ups and downs that colors any great movie. The comedy was brilliant. The directing was innvoative and aesthetically beautiful. Loved everything about it and hopes it is a firestarter for a promising Saudi cinema."}, {"id": 2, "text": "It was my first Saudi movie that I watched and I couldn't be more happy, fulfilled, relevant ever in a movie such as this one. The directing and acting efforts were so good it left amazed honestly with a great story and well rounded characters that I've felt so relevant to, in all, I couldn't be more proud about a Saudi production, especially in the most heart warming aspect of entertainment, cinema. Well done boys."}, {"id": 3, "text": "This movie is amazing and very funny. I like the actors they do very well and the directors are awesome."}, {"id": 4, "text": "I am a Saudi filmmaker and i loved everything about this movie, it's well written, acted and directed throughout. No matter where you come from you will relate to this story. The Saudi Arabian film industry is still a baby and after watching this film i can see that we have a bright future ahead of us."}, {"id": 5, "text": "The idea of a Saudi citizen wanting to be a film director might be a little bit derivative but the movie improves by the timeline and exceeds my expectations by being unpredictable and funny. Sure, it might have its corny moments but the acting and the production is better than any Saudi film i've ever seen."}, {"id": 6, "text": "Mr BaraaAlem you've done a great job and I hope that we gonna see your face again in that big screen.Good job for the casting department for choosing BaraaAlem.👏👌Lord_Stark5"}, {"id": 7, "text": "The first Saudi feature-length film to be shown in our local cinemas and I'm proud of what I saw. I already had faith in the team behind this movie but to not be disappointed I lowered my expectations and as you can see from the title of this review they definitely delivered.The movie was balanced in all its aspects in my opinion. Most of the jokes landed well, the shots were highly Stylized but not too flashy, the conflict between the characters was acted and delivered without exaggeration. The whole concept of the movie any saudi can relate to it especially the school and everything happened in it and I liked that.I'm so happy to see this kind of production coming out from where I live. We have been waiting for a long time to see movies made here in Saudi Arabia. I'm now more motivated to keep pursuing my dream of becoming a filmmaker."}, {"id": 8, "text": "I liked the movie, but for the first twenty minutes I was bored, but then I was amazed at the movie and didn't feel the time. Nice scenario. I loved the movie very much and recommend it to everyone to watch it and give a chance to Saudi movies because they are worth watching."}, {"id": 9, "text": "A very real movie Ma'am was great character Thank you guys you did something deserve every minute I watched"}, {"id": 10, "text": "I think this is a great comedy and perfect story And maybe i could this is us"}, {"id": 11, "text": "A very beautiful movie that I enjoyed and never felt the time, a wonderful comedy from everyone especially Baraa Alem, a movie written in astonishing way, and brilliantly produced. Greetings to you guys and very proud of you"}, {"id": 12, "text": "This movie is phenomenal, I can watch it over thousand time and I will not be bored by it"}, {"id": 13, "text": "I loved the unforced comedy ! genuine characters .. the art and colors ..The spirit everything about this movie makes me want to jump and make my own movie! Cause they truly delivered an amazing piece !"}, {"id": 14, "text": "The movie succeed by letting me have fun and laugh, The movie gave me a very unique experience to that I'm thankful and I congrats the actors and the director and overall it's a very enjoyable movie . Thank you ."}, {"id": 15, "text": "I'm really happy that this is the first saudi movie i've ever watch and i'm really proud and happy"}, {"id": 16, "text": "This movie represents a wonderful start to saudi cinema"}, {"id": 17, "text": "A big step a head for saudi film making , comparison with saudi's other pruducts , that was so fascinating , the comedy was so nice , all the individuals where luaghing , an i really enjoyed watching this saudi pruduct that i proud of it although it's just a comedy movie , but i think it's an evolution"}, {"id": 18, "text": "I'm so proud.. that's how Saudi films should be 👏🏻👏🏻👏🏻"}, {"id": 19, "text": "I've never laughed in my whole life while I'm watching a comedy movie like Shams al-Maaref. Such a lovely comedy movie with good acting especially the dramatic side from Baraa Alem. I really love it and I'm so proud of you guys for this amazing job. Thank you from the bottom of my heart."}, {"id": 20, "text": "I've just seen this movie, in my opinion it is the best Saudi movie yet. Brilliant story, amazing comedy scenes that I was laughing hard. Even though I had high expectations after many recommendations, I was amazed. A must see movie for every Saudi Well deserved 10/10"}, {"id": 21, "text": "This work must reach the global level The Saudi production is great It's a great comedy movie"}, {"id": 22, "text": "That was amazing ..that's how should be Saudis filming a movie"}, {"id": 23, "text": "Based on Hassan's telephone conversation with Ziad, and Aboodis recommendation...I recommend this film."}, {"id": 24, "text": "I really enjoyed watching the movie and I recommend watching it"}, {"id": 25, "text": "I would say that this movie is completely a piece of art. I enjoyed it so much and the most important it made me live back to the the era where Saudi film makers started to pay more attention to the YouTube. I must confess that each scene is reasonably realistic simulating how high school student's lives as we as the pressure they face due to deciding what to do next after finishing school. it indicates of of the critical part in someone's life whether to advancing higher education that secures your futuristic life and be with the flow as other people normally do or simply do what you like and accept the reality when consequences pouring to your face. the shooting was really up to standards and the ost was coming between 2009 to 2011 which was innovative. Also I liked the sense of humor and comedy they acted. In particular, Sohaib who really acted as a real physics teacher in a high school not to mention other characters that did great in the film I rate this purely 10 out of 10"}, {"id": 26, "text": "I was so proud of them ..its good and worth to watch .. super fun film"}, {"id": 27, "text": "This movie are motivate your life. and also the main actor are also jolly person . i love this person acting. i will be appreciated for this movie ."}, {"id": 28, "text": "Great characters build with really touching humour and excellent direction"}, {"id": 29, "text": "It's fun, light and simple but very entertaining with incredible performances by it's three leading actors. Some breathtaking visuals with wonderful writing and directing. the dialogue is quick-witted and charming. Loved the childish &amp; mature humor and the many Saudi-pop-culture references. If you grow up in Jeddah and went to a public school, the school scenes will feel very nostalgic and relatable. All and all well done."}, {"id": 30, "text": "I enjoyed watching the movie... the teamwork and the acting is really nice. Well done to the whole team."}, {"id": 31, "text": "This is the first Saudi movie that I don't regret going to . The first 20 minutes was a little boring and I felt this was the worst decision in my life to come and watch this movie but then things started to get better and better. I would have given this movie 8 but the movie is loaded with profanity . I was confused that I did not understand if this amount of profanity considered as a regular part of the conversation or is it to make the conversations between the characters sounds more funny ."}, {"id": 32, "text": "One of the best if not the best very real and truly an amazing movie"}, {"id": 33, "text": "I want to start by saying I am extremely proud of such product. It's truly rare that you see a Saudi film very well written. The script and dialogues are very well thought of. The movie truly touches the local audience. I was noticing the whole theater laughing and thoroughly enjoying the film. Not once did I felt bored. The comedy in the film is genuine and come across very brilliant. Great mixture of thriller and comedy. The cast is well selected as well, I felt attached to the characters and their struggles, I have seen myself in several occasions during the film. Beyond proud and beyond satisfied. Thank you Qodus brothers. Next time, take me as an actor with you, wouldn't you???"}, {"id": 34, "text": "The script is well written, i loved the music, the cast, the animation. It was amazing and hilarious."}, {"id": 35, "text": "I really enjoyed ever second of watching the movie 😻😻😻😻😻👍"}, {"id": 36, "text": "It's a good start for the sandy move and they will get more like that"}, {"id": 37, "text": "It is so real, simple and nice movie . It is so real, simple and nice movie. It is so real, simple and nice movie ."}, {"id": 38, "text": "It was a saudian masterpiece and the amazing music that you have ever played in a long way and a fun time with the amazing music music that I love the monster music music and the amazing songs I love it so far and amazing I can't play music that music is a little bit better than a music game and music is amazing and music music and music"}, {"id": 39, "text": "Wonderful movie, I enjoy it and encourage everybody to watch it"}, {"id": 40, "text": "One of the best movies in our region. Don't missed it. It's absolutely a masterpiece. The story and scenario well-made. Bravoo for everyone who contributed to this movie. Finally, I found a high quality movie from our region."}, {"id": 41, "text": "Thanks to everyone who contributed to this work you guys made a breakthrough In the field of cinema and photography in KSA The idea of the movie is very cool, the agony of how to make a movie within a movie And how things do not go as the characters want And life pressures and bear criticism from parents and teachers"}, {"id": 42, "text": "This movie gave me hope for the saudi fiilms the script is amazing! filled with good comedy, and they chose the right actors for the roles. perfect soundtrack + sound effects ! i had a roller coaster of emotions watching it, such an inspiring movie."}, {"id": 43, "text": "I've rate the movie 10/10 because it's the best Saudi movie I've ever seen Yaah. Tash matash is sucks ;) All the group made a great job. The problem is the ticket a little bit expensive that I couldn't bring all my friends."}, {"id": 44, "text": "The entire room and I couldn't stope laughing throughout the whole movie, which is very rare to happen. Bottomline, a well-rounded movie from all aspects: acting, editing, directing, script, picture, sound, music, and the list goes on and on.Bravo Godus brothers! We are eagerly looking forward to your next work."}, {"id": 45, "text": "Loved the movie, the whole movie was so reflective of our society and of the things that touched and affected us in our most sensitive youth. The characters were so vibrant and vivid, the storyline had the perfect ups and downs that colors any great movie. The comedy was brilliant. The directing was innvoative and aesthetically beautiful. Loved everything about it and hopes it is a firestarter for a promising Saudi cinema"}, {"id": 46, "text": "Great story and great comedy . And actors is vrey brilliant . I hope in the future like this film created saudi ."}, {"id": 47, "text": "The story was somewhat not new, but this never affected the film in terms of my enjoyment in it, the adventures of our characters and their aspirations and the challenges they face from their parents or their workplace and the impact of community opinions on them and how to make them support each other to change the general idea about young content creators, a good balance Between drama and comedy directed by it was very distinctive, and indirect storytelling enjoys the viewer, in general he did not deserve all the construction that he got, and we hope that he will receive many prizes at the (Red Sea) Festival."}, {"id": 48, "text": "A great film by Saudi Makers, the writing and the directing of this movie exceeded my expectations.. i think this movie is a good start for better Saudi Movies in the future."}, {"id": 49, "text": "Such an amazing and fabulous saudi movie I enjoyed it very much as well as family It is the first Saudi movie that really took the challenge into a different level Thanks to everyone participated in that movie Hope will get something really special in the future even better than this beautiful movie Good luck to all of you Mohàmmad, Tabuk"}, {"id": 50, "text": "The direction is great and actors performance is good except for the extras because they are not actors."}, {"id": 51, "text": "Very good acting Good directing Nice comedy moments"}, {"id": 52, "text": "The movie is really good. The story is made in a way where people can relate to the feelings and journey regardless of the the specifics. The movie could be shorter by 15-20 min but nevertheless, very good comedy movie in general and for me, by far the best of all Saudi movies and TV Shows so far."}, {"id": 53, "text": "It was better than what I expected and for sure the best Saudi movie ."}, {"id": 54, "text": "Loved every single minutes of the movie! The writing , the acting also the sitting I was very impressed but actually not surprised, I knew Qudos brother's will accomplish something will lead them to make the history of Saudi films. Truly proud"}, {"id": 55, "text": "Good game love the game love it but I have no idea what to the app it is and it is ok app but"}, {"id": 56, "text": "I like it I'm an American and I like it i like it so much"}, {"id": 57, "text": "Great writing nice story and wonderful acting I enjoyed every minute of this movie I think it's a start of New era in the Saudi film industrial"}, {"id": 58, "text": "I would watch it again and again its so good, it shows a lot of history in jeddah and accurate representations and the story was very emotional."}, {"id": 59, "text": "Though they doesn't really represent the saudi culture but still half of the saudi schools Anyway its really funny and I can never get enough of this movie Recommend 👍"}, {"id": 60, "text": "This movie was made with passion and love for filmmaking, it has very smart referencing, and the movie is full of life as you see the characters bond and struggle with the project breaking them and making them confront thier social fears.this movie made me laugh, cry, and get inspired by the relentless persuit of the movie characters.this movie is a future classic and a big milestone to Saudi filmmaking."}, {"id": 61, "text": "This took my a while to watch don't think its worthy and it's like all saudi movies were all about marriage problems and that's kinda of trash and repeatable content. will made."}, {"id": 62, "text": "I was expecting the movie to start from the bottom since the film making industry in saudi arabis is a disaster. I was surprised by the performances and by the storytelling. The comedy is awesome and the topic touches everyone living in Saudi who has a dream to pursue. I am really proud of you guys and extremely happy to be able to see my culture and my people in the big screen."}, {"id": 63, "text": "I really did enjoy the movie I was surprised I didn't expect it to be that good but it exceeded my expectations."}, {"id": 64, "text": "Very bad quality movie regarding pictures and story construction and acting ..Can't be considered comedy even !Very bad assaulting words repeated frequently"}, {"id": 65, "text": "Nice acting and direction and I'm surprised that there are saudi movies has genius direction as like this movie"}, {"id": 66, "text": "The first film in Saudi Arabia deserves this rating. We wish them to make other films."}, {"id": 67, "text": "I've really enjoyed the movie, Linking between the era of BBM and the start of YouTube shows was really impressive and hilarious, keep the good work guys"}, {"id": 68, "text": "I'm probably the last one to see this movie but I'm so glad I did, what a great acting, nice sense of humor, amazing story, I've always loved baraa as a movie reviewer but seeing him act he was incredible, also all the actor were so good, I feel so proud and happy that finally, we have a Saudi film with this amazing production quality"}, {"id": 69, "text": "I'm very proud what a great film good job guys !! Qrt2s"}, {"id": 70, "text": "That movie is on another level very funny and joyful, good job everyone"}, {"id": 71, "text": "Very nice movie keep going my friends ....................."}, {"id": 72, "text": "I've never enjoyed in Saudi film as this one The story, the cast , the direction it's all amazing Good effort well done Keep going"}, {"id": 73, "text": "Great writing nice story and wonderful acting I enjoyed every minute of this movie I think it's a start of New era in the Saudi film industrial"}, {"id": 74, "text": "I loved it sooo much! i was kinda expecting it to be crappy and low budget (sorry) but it turned out to be the best saudi movie ever made :) faris godus and the whole crew you guys did a really great job &lt;3 thank you so much for everything!! Also i laughed A LOT during the movie lol"}, {"id": 75, "text": "I really enjoyed watching this! It makes me proud to see Saudi films like this one, Go on 👏🏻"}, {"id": 76, "text": "It really exceeded my expectation. I expected to have a good story with average attributes, however, I found that the characters were well made with great lines and some funny moments.The movie had nice pacing, no dull moments and it really keep you in the story.The cinematography was impressive for such production, I'm really excited to see their future projects, with hopefully more funding."}, {"id": 77, "text": "The best Saudi movie tank you guys all the love The best Saudi movie tank you guys all the love"}, {"id": 78, "text": "Great photography and directing and an interesting story"}, {"id": 79, "text": "The story is quite simple yet the movie met the expectations there's no flashy twists whatsoever but you can appreciate the energy and the storytelling which is great the film was realistic easy to watch and funny tenderly beautiful with a very realistic appreciate twist in the end the whole vibe of overall thing suited the movie perfectly. I gotta add the script was on point and there's no overdoing of anything in film great work !"}, {"id": 80, "text": "The way the society, parent, dreams, hope, past future friends and teenager period was portrayed just brilliant"}, {"id": 81, "text": "These kind of movies that i love, the story was good, the acting was splendid and authentic . Mannn there are some scenes that really astonished me. Simply thank u guys for such a wonderful movie."}, {"id": 82, "text": "Boring story, descent acting though. 2 stars for the descent acting, the rest is miserable. Saudi cinema is still lagging behind."}, {"id": 83, "text": "Cheap comedy, all about the street's nasty words. Nothing else was even near to comedy. I'd rate 0 star if I could."}, {"id": 84, "text": "I think it is a 9.0 but because I know the filmmaking environment here, and how hard it is to even go beyond 7.0 I rate it at 10. They put so much thought into it, came up easy to digest, funny not cheezy. I think they should be scared, they set the bar very high, so I titled this what it is next. All Saudi producers should make such stories, nothing complicated.Ehh"}, {"id": 85, "text": "Best saudi movie ever. Excellent, amazing. Every act are lovely from the actors. Nice story ad touchable."}, {"id": 86, "text": "I'm a Saudi and this movie gives me hope for great movies ahead for Saudi production of movies. We need more ."}, {"id": 87, "text": "This movie shed light on some of the most common dilemmas faced by teenagers, from finding yourself a true passion all the way to dealing with peer pressure and corrupt authorities displayed in a very simple and authentic way which definitely makes it worth watching."}, {"id": 88, "text": "When unprofessional people get camera and money, stupidity is the output."}, {"id": 89, "text": "Worst movie in 2020 , time wasting , overrated , overrated"}, {"id": 90, "text": "I swear this movie sucks and the cast awful and the poster is rubbish and i wish these guys head back to youtube and stay there"}, {"id": 91, "text": "You do not have to mock your religion and make fun of the best Arabic series to make people laugh! Bad acting, bad directing, everything is bad in this ugly movie, a bad film in the fullest sense of the word"}, {"id": 92, "text": "The worst acting I have ever seen. If you value your time do watch it"}, {"id": 93, "text": "This work is very fun and I enjoyed watching it, which brought me back memories of this beautiful country with its people"}, {"id": 94, "text": "Recommended!!! Thank God this movie came to Netflex USA."}, {"id": 95, "text": "Unlike the other Arabic movies this film add something new, the story of the film reflecting the actual community as it is! Without distorting or trying to impose an american version image of society!!, this movie was independent. The music, camera angles, actors, storyboard, and everything is very good and responsible, yes the sound of the film is very bad, the story have some boring moments can be cut short, but in general that film is 100% better than any other arabic movie that trying to show the American version of the Arabic culture in order so success."}, {"id": 96, "text": "It's such a waste of time and money. more like children movie"}, {"id": 97, "text": "I actually like the graphics the editing the way of filming it everything was great But i was disappointed of the story and of the language, this was the first saudi movie in cinema and the first one in Netflix , this shouldn't be appropriate .. 70% of the script was cursing there wasn't any humour or any idea idk actually why they made it and the actors they were the worst we have a million great actor in saudi arabia idk why they hired these !!? They don't know how to use their facial expressions ??? I'm sorry i want to support our films but god seriously what was that , i'm not supporting you and lie and say it was great because it was the first film naaah , around the whole world before even 1920 there were films they supposed to learn their lesson from the whole movies not just make one with good cameras and graphic and sound effects and having a bad story and a bad script for god sake i felt i was forced to see it i'm really disappointed"}, {"id": 98, "text": "I couldn't watch it for more than 20 min Contains a lot of bad language and curses that is not acceptable by decent people and should not be filmed like that Comedy is not what you are showing here"}, {"id": 99, "text": "Good film! I enjoyed every single minute of it. Thanks for it, and I hope more good Saudi films in next years"}, {"id": 100, "text": "The Quds Brothers film .. First of all, as a Saudi work with medium capabilities, simple production, and the lack of experience of the producers and the two brothers, so this work is very good from the YouTube platform to filmmakers! I wish them good luck and success in their upcoming work. Indeed, they have a brilliant future in film production and the field of cinema, especially with the development of the Kingdom and its interest in the cinematic field. Acting is okay with time. Development comes as the character of the Arab teacher, the actor Suhaib Qudas is the best character in the film. In some situations, the comic side was familiar with the sense of humor about myself. I enjoyed it and it attracted me and drew my attention to the emergence of well-known programs such as What I, Luqaimat, and Muhammed Bazid's Return I did not like the large number of profanity words. Very good, and with time, the Saudi work becomes stronger, God willing, with new and varied ideas and representation at a high level, my rating is 7.5 / 10 .."}, {"id": 101, "text": "Best arabic-speaking movie ever. Saudi motion pictures industry started here.."}, {"id": 102, "text": "Very great effort for a Saudi movie I am very proud of this work The story is a great and the acting is very good"}, {"id": 103, "text": "The music in the movie was really beautiful, and the actor in the movie was really awesome! But I didn't like the end but it's fine."}, {"id": 104, "text": "I am shocked how a Saudi film at this level . awesome movie"}, {"id": 105, "text": "Thank you so much for creating shams al-ma'arif and sharing it, I enjoyed from the beginning hopefully we will see a lot like this"}, {"id": 106, "text": "I am just proud, there is no word to describe my feeling !"}, {"id": 107, "text": "By God, creativity, and the first time I see a work like this, and God willing to be upward, Lord, frankly, the idea is bitter in my liking, but the performance was not good to me before the last scene, but as a work or an Arab in principle. Advanced in everything, God willing, not only acting and directing"}, {"id": 108, "text": "I want to start by saying that I've known the work of the Gudos brothers since their collaboration with Telfaz and other Youtube related projects. I wasn't very excited to see the movie fearing that it would be similar to other national projects that are cliched or cinge-worthy. But after actually seeing the movie I realized that it's nothing like any other Saudi project I'm very proud and delighted by this experience.The movie follows the path of a high school kid (Hossam) who is passionate about movies, a passion he shares with his physics teacher (Orabi) and his peers. The group decides to kick off their career and make use of Hossam editing and directing skills by filming a horror movie Shams al-maarf. Throughout their journey they encounter the difficulties of having dreams and working to achieve them in an environment that is not supportive to say the least.What I mostly loved about the movie is how relevant it is, everyone can relate to it in one way or another, but its relevance doesn't affect how well thought the story is. The performance of the actors was great, this is the first time that I see Bara'a acting and he didn't disappoint, I was a bit concerned that Sohayb performance might be over the top sometimes like in six windows in the desert but it wasn't, he did a great job portraying the middle aged teacher who still feels like a kid once reminded of his dreams. The soundtracks used in the movie were beautiful, I enjoyed that almost all of them were original and in the Saudi dialect. Finally I really appreciated that the movie is not trying to be something it's not, not imitating other projects and trying to find its own style and uniqueness.Shams Al-maarf is definitely a turning point for me to believe again in Saudi filmmakers, it's a movie that I would enjoy watching again and again."}, {"id": 109, "text": "The Book of Sun is both a high school coming-of-age comedy and a film about guerrilla filmmaking, and it nails it in both areas. The story is very entertaining from start to finish and invokes an atmosphere I have enjoyed in films like Bowfinger and The Disaster Artist without actually being anything like either films. Here is a film that was truly made for the local sensibility and very true to that, yet I believe would be a smashing success has it been given the chance to play internationally. The filmmaking is very well done, and the camera shots are smart and dynamic without being flashy. The filmmakers smartly imploys music, animations, outdoors shoots, and camera flourishes in service of telling a really good story. Set in 2010, it would have been a tall order recreating that time and place in a country with little infrastructure and expertise to pull that off, but the filmmakers managed to do that on a budget that must have been modest, and used the limitations to double down on the DIY atmosphere of a high school kids with talent and passion trying to make a movie in an atmosphere that was anything but supportive. There is a high level of situational comedy, and the cast who consists of mainly unprofessional and unseasoned young actors really delovered on the jokes. Baraa Alem, playing Hosam the aspiring filmmaker, is very good in delivering a wide range of emotions between the drama and the comdey. He is the straight man in this mayhem. The stakes are high for him, because his future is on the line, and the pressure is high on him to succeed in school to become what his family and society deem a successful man, even if it means abandoning his passion for filmmaking which he is clearly good at. The supporting team lead by Sohayb Godus, Ahmad Sadam, and especially Ismail Alhassan truly deliver on the comedy in a big. If Baraa Alem's Hosam is the brain here, Ismail Alhassan's Ma'an his best friend is the beating heart of the gang. There are many funny gags that I believe should not be spoiled, and I feel they are ripe for repeat viewing. Not only the film is great, even the film within a film is the kind of shlock horror films I would totally watch and enjoy. This is in no way a perfect movie. If I have to say where it could have been improved, I would say the plot is predictable and the film would have been better off cut to 100 to 105 min instead of 2 hours. That said, it still is a very impressive effort considering it's the debut feature film of Godus Brothers. It is one of the rare times that I don't have to qualify my enjoyment by saying it's a good enough for a Saudi film, and instead I think it's a film that could stand on its own merits and represent us everywhere and not be graded on a curve, which might be the highest praise I can grant the film."}, {"id": 110, "text": "6 stars is really what I think about this movie, actually If I compare it with the rest of SAUDI movies and TV shows it would be the best, 10 stars without thinking, but comparing to worldwide cinema, 6 stars is fair enough. First I'd start with what I didn't like about the movie cons:1- Really much use of bad language! I know they try to make the movie look much of Saudi real society life but this bad language is too much! Even with my closest friends I wouldn't say that, I don't know about Jeddah society since I'm from Al-Qassim but I don't think any SAUDI society would approve and accept that much use of bad language, and even 13+ movie wouldn't handle that much bad language2- Too much outside references, people who don't know anything about directing/producing/designing would not understand/enjoy the movie, especially with lack of local movies we have, you would expect a lot of tastes and genres to see this movie so most of the audience wouldn't get the whole movie story3- (not major thing) The movie supposed to be in 2010 but I notice a fair enough 2010+ stuff like Windows 10 in some computers4- Since cinema is new thing to us I'd prefer if they respect some of Saudi values so they can have much audience to support them, despite the bad language, smoking and drugs references is too much for 13+ movie and for a society like Saudi, there's a lot of mocking of some saudi values I didn't appreciate it honestly, for a beginning of Saudi filmmaking, they have to have some respect of our values to have more support.5- Classical representation of a dominating/commanding mother, weak/insecure father and perfect/beloved-by parents-sibling, all teen local and worldwide shows used that representation of a family.6- The script is too replicated and predictable sometimes you get bored with it. Now for the pros:1- Directing is so good, the image is always moving and not still you hardly can get bored2- Some actors are really good they surprised me with their acting, especially Sohaib with Orabi character, I knew him for a YouTube Top 5 show but I didn't know he could act like that good, you have also Hussam I knew him from a channel in YouTube and I noticed there that he has a career in acting and it was a good thing to see his first role in a Saudi movie, other main characters were meh, you really feel they acting the acting, but they have a good chance in acting career3- Storyline was pretty predictable but in same time was a little bit good.4- The movie took us to more than one place in Jeddah which made me feel that it's really vivid and make me take a different look to what the other sides of Jeddah is.5- using animation to represent Hussam ideas was a really good move, I really liked it!Finally, for a beginning, it was really good movie! And I can't wait to see how local filmmaking would be in future"}, {"id": 111, "text": "First, I must admit that I had long gave up on Arab movies, but this movie was like a new blood flow in the cinematic Arabic content. I LOVED LOVED every scene of it, the comedic timing, the efforts behind every scene, and how relatable the characters are. I feel like les effets comiques are gonna be a thing that gonna stay in the Arab youths' mind for years to come, at least in our house. I'm gonna scream tortai3a every time I feel endangered or my siblings crack a silly joke. Ismail Hassan was very fine and could get me to lol in every scene he is in especially the tortai3a ones. Baraa is my crush from his youtube videos and loved him even more here. Arabi or Sohaib had a great arc from his silliness and belief of the greatness of his acting to his emotional scenes. I'm pretty sure I'm emotional in this review but what's more wholesome than a very entertaining, joyful, yet relatable, and a movie minak fik. Loved it, more power to the creators. Keep entertaining us with such out of the box realistic, and funny projects. P.S: Baraa keep ur beard for the next projects, it's more of an eye candy. I can hear u screaming tortai3a, but don't worry I'm a girl :)"}], "reviews_amount": 112}