{"name": "The Princess Switch: Switched Again", "titleId": "tt11199410", "reviews": [{"id": 0, "text": "Fans of the Princess Switch will not be disappointed in this second instalment of the movie series. Though the story was predictable and the premise behind the 're-switch' made little sense, the movie kept me engaged thru-out. Plus, there was a bit of a twist to the 'switch' this time around. Vanessa Hudgens's performance, in her multiple roles, was excellent. And the performances of the supporting cast, such as Nick Sagar (as Kevin) and Sam Palladio (Edward), were strong. The dialogue was cute and funny at times; I laughed a bit with the use of new words such as 'couzy' (aka cousin). And I do like the Balkan theme for the names of the kingdoms. I was trying to come up with some myself during the film...maybe 'Croatiannia' (for Croatia) or 'Ljubljanaro' (for Ljubljana, the capital of Slovenia). The scenery, props and sets were beautiful. Well done. Overall, though a bit silly at times, I found myself taken in by this movie. It is a cute, funny, and entertaining film, a nice little edition to Netflix's original Christmas movies."}, {"id": 1, "text": "The plot is ridiculous and everyone makes dumb decisions. People are also not paying for their crimes. It's dumb, it's fun and I want another one."}, {"id": 2, "text": "Fans of the Princess Switch will not be disappointed in this second instalment of the movie series. Though the story was predictable and the premise behind the 're-switch' made little sense, the movie kept me engaged thru-out. Plus, there was a bit of a twist to the 'switch' this time around. Vanessa Hudgens's performance, in her multiple roles, was excellent. And the performances of the supporting cast, such as Nick Sagar (as Kevin) and Sam Palladio (Edward), were strong. The dialogue was cute and funny at times; I laughed a bit with the use of new words such as 'couzy' (aka cousin). And I do like the Balkan theme for the names of the kingdoms. I was trying to come up with some myself during the film...maybe 'Croatiannia' (for Croatia) or 'Ljubljanaro' (for Ljubljana, the capital of Slovenia). The scenery, props and sets were beautiful. Well done. Overall, though a bit silly at times, I found myself taken in by this movie. It is a cute, funny, and entertaining film, a nice little edition to Netflix's original Christmas movies."}, {"id": 3, "text": "It's a christmas chick flick that is enjoyable. Vanessa played three different roles and was on screen 80-90 percent of the movie. Thats talent. Every christmas movie is not going to be a 10/10. They are written for generally a younger crowd to sit around with family and enjoy, or the couple wanting to get into the holiday spirits and watch a movie together in the evening over hot cocoa. If you thought you were going to get the new BIG MUST SEE every year christmas movie after knowing this is a sequel.... then i don't know what to tell you. I enjoyed it. It was predictable to a point. It wasn't all over the place or overly complicated. It had a lot going on but it made sense. And if i was able to follow the entire movie you probably should put your phone down and enjoy a FUN movie for what it is."}, {"id": 4, "text": "This one had a different plot but overall acting was okay. just another ones of the christmas movies to watch. It was pretty funny some times but overall I preferred the first movie."}, {"id": 5, "text": "I saw similarities with a Christmas Prince so the story is not really original. But the characters are lovely and pretty cute. The storyline is just okay. I loved to see Queen Amber and King Richard with the baby. I was just excited about to see Rose McIver and Ben Lamb."}, {"id": 6, "text": "Really liked the first one so was looking forward to this.It was silly at times but overall i really enjoyed it. Plus Vanessa Hudgens is awesome.Will there be a third haha."}, {"id": 7, "text": "Second time around the sequel has lost the comedic touch and fun the first movie had. It's still a decent Christmas movie and thanks to Netflix we have some to enjoy this Christmas."}, {"id": 8, "text": "I rated this for the genre and not for movies in general. In that regard it's totally fine. It's warm and fuzzy, non sensical, but who cares. It was a nice sequel. Although how a husband wouldn't recognize his own wife is beyond me, but for the sake of the plot... Just sit back and watch this if you had a long day and wish to not think. Also, sugary sweet but that goes without saying."}, {"id": 9, "text": "If you had a negative feeling about this movie going in, you probably had a negative one going out. It's a light movie that builds off the first movie with even more ridiculousness and accents from Vanessa Hudgens. Yet, that's exactly the reason why I liked it. It's Netflix one upping Hallmark, sometimes you just need cozy."}, {"id": 10, "text": "It's no Oscar winner, let's be clear....But if you're after a cosy and predictable Christmas chick-flick curled up on the sofa with a mug of mulled wine, this is the film for you."}, {"id": 11, "text": "One three many Vanessa hudgens. The cousin's motives for switching places and taking money from the crown just don't make sense. Why would she just run away to take piñas coladas forever?? Why is Edward there? He had zero relevance to the plot. They replaced the little girl????? Why??? Stacy is just annoying. Like she's too busy for her husband when he's the one with royal duties??? Like she runs a bake shop but we never see her bake?? Or do anything for the shop? I guess they're on Christmas break but why include a shop if it isn't relevant? Margaret just doesn't know what she wants. She had a sense of duty but like that's it?? I have a lot of questions. I just didn't like it.They also had like four Christmas trees per room and for some reason it really bothered me. Like who has that many Christmas trees?ALSO THE CORONATION SCENE W/ the cousin didn't make sense??? Why was the prime minister so okay with everything?? ON CHRISTMAS EVE?? she didn't even question it???...so many questions.Please, don't make another one."}, {"id": 12, "text": "This one was just as good if not better than the first one. Great little family movie or just a good one to watch with friends. I love how it all came full circle. Only thing I didn't care for was the annoying cousin and the obvious actress recast of the daughter Olivia. Other than that this movie exceeded expectations and I look forward to the third installment next holiday season."}, {"id": 13, "text": "I'm definitely more of a fan of the 1st one just because this one is a little weird but still good. it's just the plot it's like they had to come up with something late and decided to have another doppelgänger ya know? no? okay."}, {"id": 14, "text": "Enjoyed the first one more, liked the extra third Vanessa Hudgens. Been watching Vanessa since high school musical, so I like her acting. I didn't like the change of Olivia, Mia didn't have the cuteness of original person who played Olivia. It felt weird with the swap, as all the other characters were the same."}, {"id": 15, "text": "I'm a sucker for romantic comedy's. Sure this movie is super cheesy, so much so I had to pause it every now and then. But I liked the movie, it was interesting and I was on the edge of my seat. Not everyone will like this movie, but if you like cheesy comedy's to snuggle on the couch with then this is for you. I hope they make a third one!"}, {"id": 16, "text": "The Princess Switch: Switched Again is the worst sequel. The acting isn't as stiff, but definitely just as awkward. The dialogue is terrible, the story isn't needed, and the song when Fiona comes in is awful. This movie did not need to happen and bored me to death. I ended up stopping it halfway through."}, {"id": 17, "text": "The Princess Switch Switched Again is the sequel to the 2020 film of the same name and stars Vanessa Hudgens This time Margaret (Hudgens) has moved on from Kevin while Stacey(Hudgens) is happily married to Prince Edward. But when Margaret's cousin Fiona(Hudgens again)arrives unannounced and scams her cousin pretending to be her,in order to get money,will Margaret and Stacey save the kingdom from Fiona?Overall it's a silly yet cute movie but I enjoyed it as much as the first one. Also stars Rick Norwood who played Arthur Fat Boy in Eastenders."}, {"id": 18, "text": "Like with the first movie I couldn't stop cringing when Vanessa spoke the posh Montenaro wannabe british accent but I still managed to watch until the end. The story of Switched Again was as good as it can get for a part 2 I guess. I did miss the actress Alexa playing the little girl Olivia from the first movie. The girl in part 2 was less charismatic and fun in my opinion."}, {"id": 19, "text": "As far as the plot is concerned, there was just way too much going on. It was just very busy. What I don't understand is this: if Margaret and Kevin were watching A Christmas Prince on Netflix in the first movie, they know that Amber and Richard are fictitious characters. Can somebody please explain to me how fictitious characters are able to attend a coronation?"}, {"id": 20, "text": "It's predictable and ridiculous, but who cares. I want part 3, because it was entertaining and it's all that matters."}, {"id": 21, "text": "I dont understand why such low rating. This movie was great and I salute Vanessa Hudgens for an amazing triple performance. She has become one of my favorite actresses. I cant wait to see more of her"}, {"id": 22, "text": "This was a very confusing. Why couldnt Stasey tell her husband about the switch and make it easier for all parts? Why couldnt that cousin just sell some of her very big house? And did she really think she could get away with kidnapping Margaret and she would just stay quiet? So many questions to the very bad plot, but still 4/10 because i have a guilty pleasure for bad christmas movies."}, {"id": 23, "text": "The movie series is something so special I just feel so connected and it fulfills certain things in me for some reason The Princess Switch movies are really special to me"}, {"id": 24, "text": "Bad accents. Horrible writing. Corny antics. Predictable storyline. This is the kind of movie for which you put your brain next to the Elf on a Shelf, have your ditziest gal pals over, and open a couple of bottles of wine. It's just so bad it's good. And yes the villain and her minions make this entire production. They are the worst. I want to travel the world with them."}, {"id": 25, "text": "If there were a showbiz award for Christmas set design, Netflix would clean up year after year. Their Christmas originals deliver the most beautifully designed sets every single year. This year included with Vanessa's latest Christmas sequel, Princess Switch: Switched Again. The story, to be frank, is terribly ludicrous, but it's made tolerable with the stunning settings full of immaculately designed Christmas themed rooms that significant elevate the quality of the picture. I'd also offer that Ms. Hudgens does a pretty good proper English accent and not bad Cockney like accent that nearly allows her to pull off playing three different but identical looking beauties. (which is part of the ludicrousness of the story in the first place, but who's paying attention to that anyway when we're gobsmacked with the fairytale castles and manor homes they're hanging out in) 6/10"}, {"id": 26, "text": "If the first movie was a bit cringe but also lovely, this just feels like we have no ideas what to shoot, but we have to shoot something to earn money kind of movie. I mean literally Vanessa is one of the prettiest women alive, super-cute and aww, but this movie is more or less like watching ice melt = quite pointless."}, {"id": 27, "text": "The first one was better. It dragged on and on for me, even thought it is only hour and a half long. It is a light watch, Vanessa is fenomenal in doing the three roles, the Christmas decor is stunning but the first movie is still better..."}, {"id": 28, "text": "When one makes a movie that is nearly 100% depraved of violence and cruelty and with all good and happy smiles, one needs to pay attention to the devil in the details. Because those will ruin the ambiance. It sure did it for me. If I watch Walking Dear, I'm expected to see 18+ . If I watch a Hallmark movie, every single detail can spoil the whole movie.Two major unacceptable flaws IMHO. 1) they redo the switch again to reconcile the broken couple and failed to mention it to the prince who thinks she's sick. Why wasn't he informed? Major lack of trust. They should go for counseling or breakup. She's been kept in the dark until the end. And he's like no,no don't worry, and so sorry for being an helicopter husband . WTH?!?! 2) The cousin gets community service for KIDNAPPING a person and pretending to be the Queen but the only the employee gets arrested and serves time in prison?!?!?! And children are going to be watching this ?!?!This movie, by it's deliberately over-simplistic scenario, was meant to put a smile on my face. How could they fail such a simple task.(I enjoyed the first movie)"}, {"id": 29, "text": "Easy movie to watch with yout family. But the only thing i concern is about Olivia's cast. Really bad to change the cast. The girl at season 1 was better. Better smile and act. Sorry to say but im this season 2, The energic girl is gone. Really like figurine. U shouldnt change the cast if the new one does not into the character"}, {"id": 30, "text": "6/10 - a good example of a sophomore slump still manages to make for some fun mindless entertainment"}, {"id": 31, "text": "I watched the first one and it was meh. Cheesy definitely but it was a normal amount for a cheesy Christmas movie. But this one was over the top in the cheese department. Terrible writing, terrible acting, terrible storyline. Trying to erase this movie from my memory as we speak..."}, {"id": 32, "text": "Enjoyable but some scenes are really dumb and cringe. Also, the costumes are terrible, I mean...a future queen at the ball, in winter, wearing a flower tulle dress? Looks so cheap and definitely not royal-like"}, {"id": 33, "text": "I think that's what happens when the actor is the producer at the same time. Let me just act the cousin too so I can make more money! And I believe she thinks that's a great idea to have 3 Vanessa Hudgens in the movie. What is the idea for the next movie? 4 Vanessa Hudgens?"}, {"id": 34, "text": "The first movie Princess Switched was fun and very funny and cute. I was surprised when I looked at the trailer of this one and there were three of them. I was so excited to watch it. And then when the movie came out. I didn't know what to think , it was kinda buffling what will be the third one's character. Well, I was not dissappointed at all. Fiona is the new, fresh, a little naughty though. But she brought the laughter of the movie. Vanessa just pulled off Fiona's character perfectly. Infact if there is a third princess switched, switched and switched..again? movie, I'll be too excited to if Fiona will be the new star of the show!"}, {"id": 35, "text": "The first few minutes of the movie was really boring and the plot was messy, confusing and predictable. Adding a third twin was boring twist and lazy writing in my opinion. Overall it was an okay movie but it wasn't as good as the first."}, {"id": 36, "text": "This movie brings the christmas charm to it and Vanessa excelsnplaying three characters.also the movie was funny wish it got a higher score"}, {"id": 37, "text": "The setting and plot was cute and entertaining enough, but Vanessa Hudgens trying to bounce between 3 personalities and people was not successful. The acting was embarrassingly bad and cheesy at times. The climax also could have been much more exciting."}, {"id": 38, "text": "I knew what I was getting into watching this film: a cheesy, romcom with some half-decent actors and a whole of silliness. But, unfortunately, it didn't quite hit those high notes and fell a little flat. If you enjoyed the first movie, don't get too excited about this sequel and you won't be disappointed."}, {"id": 39, "text": "This is beyond a doubt the most mind-benumbing garbage my wife and daughter have ever paraded across my tv screen. It is geared toward 10-yr old girls who want to be princesses, who have no appreciation for whether acting is quality or neighborhood-theater amateur caliber, and who can't process or analyze the logic of a plot line... And the mothers who indulge them, who also want so desperately to be princesses, and are living vicariously through the hopes that their daughters will be one day.I certainly hope Vanetta Huddie, or whatever her name is, fades even further into obscurity, beyond the hopes of a Hallmark career revival, by being blackballed after this pitiful piece of thespian refuse. Hideous. Wretched. Sorrowfully sensory-hebetating."}, {"id": 40, "text": "There are SO many things i questioned in this movie but the most important thing... on the first movie, nobody knew they switched and it was like yea ok whatever but in THIS movie, they (both partners) dated and even got married and he still doesnt know which one is his wive????? the heck?? also that smug dude that was only interest in the queen for money knew in 2 seconds that it was the cousin but novody else figured it out? also they're all not legit twins like parents trap or something so they couldnt be THAT identical it just doesnt make any sense... i know these kind of movies arent realistic but stilll man... u know one thing tho, i thought she was going to have a singing scene or something.."}, {"id": 41, "text": "Corny in some places, of course, but the ending left me happy and completely satisfied! The acting was obviously over the top for some characters, but it only added some humor. The song at the start of the credits was amazing though!!!! If you liked the first one, you'll enjoy this one too! Can't wait for the third."}, {"id": 42, "text": "I actually enjoyed the first movie. Vanessa's accent when doing the duchess was very cringy but overall it was fun, cute, and it made sense. Then there's this one. This time we get 2 cringy accents, and I really did not like the Fiona character, completely over the top, her only personality trait was a duckface (one good thing I will say about her is that her reactions to finding out she'd kidnapped the wrong girl were quite funny), and her plan made absolutely no sense and was so poorly executed. It was so obvious to me that the writers just needed to pad the runtime because they couldn't even manage to write a decent plot that lasted 90 minutes, so they added in the completely useless plot point of not telling King whatever his name is that the girls switched, even though telling him would have absolutely no negative consequences on the plot whatsoever, they just needed some extra drama because the plot really was that thin. I also didn't like the recast for Olivia, I'm really sorry, I know that girl did her best, but honestly none of it was believable and it just came off as annoying. Overall, I was left extremely frustrated by how little logic the writers put into the script and the plot, and the performances were underwhelming to say the least. Then again that's only my opinion, the only way to really know how'd you'd feel about it is by watching it."}, {"id": 43, "text": "I love to see another one Part 3 Because it's amazing and wonderful."}, {"id": 44, "text": "Please just stop it right here. If they're going to make another switches I think I'm gonna puke.The first one was okay but this one sounds like a bad thing."}, {"id": 45, "text": "Most Christmas movies tend to be generic cookie cutter clones of each other. Boy meets girl (or switch the roles), half way point boy tries to kiss girl but fails. Once the main characters learn about about themselves they can be together. Cue Christmas music &amp; snarky little girl.For these type of movies, sit back and enjoy it for what they are. Movies like this have wonderful nature scenes and messages that say: family and friends are important, take time to stop and smell the roses and Christmas is more then about yourself.Although the stories are predictable they are more interesting then contribed twists. The movie's plot is something that you don't think about too hard, but can enjoy the colorful characters &amp; scenes."}, {"id": 46, "text": "Why always make another movie when the first one is successful. The first one was so good and this was one was just awful. They ruin everything, so many times that this happens"}, {"id": 47, "text": "Looks like i was really bored during the weekend. The plot is scaryly predictible and not exciting at all, dialogue sooo cheesy and dumb, characters make such cliché choices and act like stones. It is bad, but this is a perfect example of so bad it is quite good type of movie. Really enjoyed it's dumbness :)4/10 for me"}, {"id": 48, "text": "Really cannot fathom the low ratings on this one. The casting is strong and charming and the story fun. There are a few twists and turns in the predictable plot (after all we all want HEA and no lasting surprises). And there is an adorable amount of cheese in the dialogue. What makes this film a cut above in the genre is the stunning costumes, lovely score and beautiful sets. Overall, a very fun ride."}, {"id": 49, "text": "Too mature for teenagers and too silly for an adult audience. It is about the coronation of a queen and how her twin is going to help her and a cousin also identical to wanting to take the throne from her for a few moments. An unnecessary sequel. It falls for all the clichés. We could not even accommodate it in a genre: it can be drama, adventure or youth film or failing that, none of them. A mix between the Disney greats The Princess Diaries, Princess Protection Program and Twin Game. Or among the top Mexican soap operas like Lazos de amor or Trestimes Ana. Quality. At times parsimonious and at others too fast. With nonsense situations and things. Light performances and two or three moments without achieving. It does not try to prove anything or delve into something. Predictable like all of its kind. A movie for when you have nothing to do."}, {"id": 50, "text": "This film has everything, the highs, the lows, the laughs and the crys. Every character has so much range, a true master class in Christmas filmmaking. So many twists and turns, all completely predictable but joyous nonetheless. There is even a brief cameo from the Champions League theme which caught me completely off guard.I still have no idea who this fairy godfather is that appears all the time, but the magic is still there.The perfect Christmas film."}, {"id": 51, "text": "The acting is so awkward that it was painful to watch, I wasn't sure if it was because of poorly written dialogues or lack of effort, but just horrible"}, {"id": 52, "text": "This is way cheesier than the first one but so worth the watch! The plot just gets more complicated and to pull off 3 characters at the same time it's not easy to pull off. So please watch it and put your critical reviews and expectations on the down low because this is an actual good movie! Just sit back and enjoy it for what it is :)"}, {"id": 53, "text": "This was cute, but I adore the first one! Vanessa is still as adorable as ever. I am not a fan of the recast of Olivia at all. I do give Vanessa props for playing 3 characters, but it got a smidge confusing. I loved that Queen Amber and King Richard from Christmas Prince made a quick cameo at the end. I think a movie with all three couples would be cute"}, {"id": 54, "text": "They should have leave that little girl out of the movie, for adoption or something.. I couldnt take it anymore she was so annoying and a very bad actress she better focus on her school or something. I LUV Vanessa, but that little rat ruïned everhting for me in this movie."}, {"id": 55, "text": "Is this the best movie ever made ? No. Is it better than the first ? Again, probably not. But it's definitely entertaining if you get into it with an open mind and accept the fact that you're going to watch a light christmas movie.If you liked the first one, you'll like this one too."}, {"id": 56, "text": "Worth the watch if you've seen the first one but as you can imagine it's not as good as the first. Reggie and Mindy were an irritating addition with horrendous acting, besides that the film was enjoyable."}, {"id": 57, "text": "So, let me get this right. According to US telefilm makers, Europe is full of kingdoms, principalitirs and duchies, where Americans rule by marriage. It's a shame no-one had informed Wallis and Prince Edward when they should have."}, {"id": 58, "text": "The Princess Switch: Switched Again sequel was not needed at all. The plot is good but the scenario and the acting is REALLY BAD this time!"}, {"id": 59, "text": "Movie is too silly, bad way of presenting princess, the outfits and everything, Disney is the only one who should be making princess movies."}, {"id": 60, "text": "I rarely give a bad score...but this is bad. The only good thing about it it's the cast. Yes, Vanessa it's bloody talented but the plot is so bad I can't even. Living proof that sometimes Netflix should stop milking money and invest in developing good content. (Aham, like the OA was. We didn't forget that,) Overall, without Vanessa this would be a certified fiasco and it's all on Netflix's greed. She played beautifully all 3 parts but honestly the plot is so forcefully twisted it doesn't give any actor much to work with."}, {"id": 61, "text": "Calling this movie dumb is being nice. Awful accents to go with the awful acting. Vanessa Hudgens being one of the many producers explains why this was made. Time would be better spent watching paint dry."}, {"id": 62, "text": "I watched The Princess Switch back in 2018 (or whenever it came out) and I thought it was cute and fluffy. I rated it a 6 on the Christmas/Lifetime/Hallmark movie scale.Having zero idea that they were working on a sequel, I was quite delighted to turn on Netflix today and see that not only was there another movie but it's also trending at #2.The reason I rated this movie higher is because of the cousin factor. Vanessa played all three roles quite well, surprisingly. She really stepped her acting game up and it was refreshing!!Overall, very fun, enjoyable movie."}, {"id": 63, "text": "But let's be honest it wasn't really hard. The first was a messy, cheap disaster. This movie has more care put into it and a much better use of the money. The sets don't look as cheap as the first one, the stand ins look better. I was pretty shocked because normally the second film in a series tend to get cheaper and more lazy.Was this a great film though? No. It was pretty fun to watch however because of the terrible, terrible disaster that was the third Vanessa. I honestly wish the movie was about her and the two minions. It was such a disaster that i couldn't stop laughing. It was the most cartoonish thing i have seen that isn't actually a cartoon. She had her own 'evil villain theme song' that played every time she walked places. The parts on the movies with just evil Vanessa and the two henchmen were the best parts because no one could act, the jokes were just terrible and it was just great.I honestly could have done with out the rest of the movies happening though. I think they spread them selves really thin, there were lots of little plots going on and they all kind of got jumbled up. I got quite bored when evil Vanessa wasn't there.Im sure if you like the first you will like this. Maybe even just skip to the parts where she is the evil one. Them parts really were something else."}, {"id": 64, "text": "IN A NUTSHELL: Every year in December, I get in the mood to snuggle under the covers in my bed, drink hot chocolate, and watch a super sugary Christmas movie. Last year, I stumbled upon The Princess Switch on Netflix. It was just what I wanted, the kind of sweet Hallmark-style movie that blends romance, beautiful things, beautiful people, and Christmas. If you're a Vanessa Hudgins fan, you're going to be in heaven because this sequel to the princess story features her, not twice but as three very different characters who switch places because they all look so much alike. Directed by Mike Rohl, this saccharine chick-flick is filled with more beautiful things, places, and people.TIPS FOR PARENTS: Two gay men dance together A married man tries to woo his wife into bed. Some alcohol. Someone gets kidnapped KissingTHEMES: Christmas is about giving. - Lady/Queen Margaret Dishonesty Greed Identity True love Friendship Supporting one another, service to others Communication in marriageTHINGS I LIKED: Vanessa Hudgens does a great job playing three different characters. She changes her posture and voice and adds subtle nuances to make you believe you're seeing three different people. She's just lovely. In case you can't remember what happened in the first movie, which was adorable, the first part of this one gives you a quick overview in animation form. It has all of the elegant, palace settings that you'd hope it would have. The set designs are gorgeous. Every little girl has fantasized about this type of regal life, right? Speaking of gorgeous...there are lots of beautiful gowns and costumes. Lots of Christmas decor and spirit. Beautiful pastries. The perky music by Alan Ari Lazar was fun and cheery. The cast showcases some diversity.THINGS I DIDN'T LIKE: Lots of cliched dialogue, characters, and shenanigans. With all of the Christmas spirit, there is no talk of religion or what Christmas is really all about. If you loved the story about Stacy De Novo and Prince Edward, you'll be disappointed because the focus of the sequel is not on them this time. Not to worry though...there is another romance in the air. The plot is very simple as long as you can keep the 3 young ladies straight! There is a strange plot point that is completely unnecessary. In the first movie, the prince is in on the switch of the two girls. In this one, they intentionally leave him in the dark, which makes no sense. There are two henchmen that feel more like slapstick cartoons than real people. It's definitely an attempt at humor, but it often falls flat, at least for older viewers.You can see the rest of my review on my Movie Review Mom YouTube channel and website!"}, {"id": 65, "text": "Rubbish.Vanessa Hudgens remains terrific, but 'The Princess Switch: Switched Again' is disappointing in every other way. I enjoyed the first, but this is a let down. The plot is woeful, with the set-up and execution equally as bad. The new characters are lame, while what they do with the original lot is boring.The new character is just annoying, not helped by how poorly they are written; as are the clichéd goons alongside, though noteworthy (for me) to see Ricky Norwood cast as one of them - Fatboy himself. iykyk. Elsewhere, the main bunch from the first film reprise their roles, with the exception of Alexa Adeosun as Olivia - which is a shame.I admit this isn't anything utterly terrible, I didn't dislike it massively. I wanted a better follow-up though, this is a rather lacklustre attempt. A third film has already begun filming, I'll likely watch it either way but hopefully it's an improvement on this."}, {"id": 66, "text": "The Princess Switch: Switched Again is a 2020 American Christmas romantic comedy, sequel to The Princess Switch (2018). It continues two years after the ending of its prequel, Stacy (Vanessa Hudgens) being married to Prince Edward (Sam Palladio) is now the Princess of Belgravia and Margaret (Vanessa Hudgens) is to ascend the throne of Montenaro after the death of the king and his successor choosing to abdicate. With the unexpected responsibility bestowed upon her, Margret finds herself in a conundrum and tries to juggle between her personal and her new 'professional' life which leads to Kevin (Nick Sagar) and her splitting up. Stacy and Olivia (Mia Lloyd), Kevin's daughter, are heartbroken seeing this break-up, are trying their best to get them back together. This task is full of difficulties as Margret is fancied by a count/ his childhood friend/ his chief of staff Antonio Rossi (Lachlan Nieboer) who tries to stymie any new developments in Kevin and Margret's relationship. Stacy hoping for them to get back together suggests doing the good ol' switcheroo. But things get complicated with the arrival of Fiona (Vanessa Hudgens), Margret's cousin, who has a switcheroo plan of her own. Needless to say Fiona also resembles Stacy and Fiona. If you think that the film seems a forced and unnecessary sequel, you are not alone. The film tries to stretch out the story of the original film that too without much thought. Even after keeping very low expectations from the film it is still disappointing. The original film too lacked a good script &amp; screenplay but it still had a little flare to its story which is completely missing here. Vanessa Hudgens tries her best to portray the three different characters, but her efforts do nothing more than make the viewer realise the absurdity of the story. Of course we have seen absurd stories be highly entertaining in the past, but here there are no attempts to make the movie better with other aspects of the movie. One can hardly make out which side of the Atlantic the fictional country of Montenaro is, with uncanny European accents of the characters and portrayal of American-esque environment in the backdrop. Or even better it may belong to a new fictional continent, who knows. The movie could have been at least named better with something like 'The Queen Switch', in line with the continuation of the story. In conclusion, the film is a thorough let down and barely entertaining. One would be using their time better doing anything but watching this movie. Acting- 7 Casting- 7.5 Cinematography- 8 Dialogue- 5.5 Directing- 7 Editing &amp; Effects- 7 Sound &amp; Music- 6 Story- 4 Storytelling- 5 Rating- 5.5"}, {"id": 67, "text": "A fantasy world, royalty, love stories, christmas,...: it has all the elements a christmas movie can dream off. The plot is (of course) predictable, but entertaining. But the movie as a whole is just... too cringy. To start off with a positive note: I like the third Vanessa. It 'thickens' the plot and it's entertaining.But I hate, like absolutely hate, Vanessa Hudgens' English accent. It's not even near being good and this is a non-native English speaker writing. It literally ruins the movie for me, it makes it way too cringy. Don't get me starting about their conversations. Literally nobody talks like that, not even royalty.For the record: I'm all for an unrealistic plot that evolves around princes and princesses. But there are way too many elements that almost make it a parody. Like, throw them in the dungeons. I mean, come on! Or: playing god save the queen at the coronation. That's the national anthem of the United Kingdom. Educate yourself. I expect more, even in a Netflix-Hallmark type of movie.But if I'm being honest: I'll probably watch the third movie. Three stars."}, {"id": 68, "text": "Not a good watch, probably won't watch again, and can't recommend unless you're obsessed Vanessa Hudgens or the first movie / Freaky Friday tropes.Look, Vanessa Hudgens does a good job working 3 times as hard for the same paycheck, but the story is a mess. The characters literally have discussions about how they don't know what's going on anymore.The addition of this cousin undercuts the original movie's concept that it's amazing that someone else could look just like her. It is also barely amusing.Where the first was Freaky Friday meets princess diaries, this folds in The Hustle to add a criminal element, but like big crime: kidnapping and international affairs.It is a very specific band of fans that are going to love this. It's not like there isn't anything to love, but the big selling point is the worst thing about the movie: it actually would have been good if they had the confidence to just do a simple switch again."}, {"id": 69, "text": "The first one should've never been as enjoyable as it was and perhaps it just got lucky. Because The Princess Switch: Switched Again is anything but enjoyable. It took everything that made the first and good and decided to throw it away.The biggest change comes in the form of a third Vanessa Hudgens. And it's this new character that makes the film as bad as it is. Indeed, for the most part, or should I say the parts without the new character, the movie is nearly as charming and fun as the first one. However, as soon as Fiona (the third Hudgens) enters the film, it's quite frankly all downhill from there. It's the type of character that just doesn't fit a film like this. She is unlikeable in every way, and what's even worse, she offers absolutely nothing to the film. But, as much as I dislike Fiona, I dislike her minions even more. All they manage to do is be annoying.The first Princess Switch film kept its story as simple as possible, just as it should have. However, this second instalment tries to introduce a much, much more complicated and quite frankly dumb plot. The fact that two different characters in the film have to clarify what is happening should be a pretty good indication of what a mess this film's plot is. Furthermore, this film takes itself way too seriously. The first one clearly knew that it was dumb and cheesy and embraced it. It never tried to be anything more than a Christmas rom-com. Switched Again, however, tries to be more than that and fails miserably.It really is quite unfortunate that this film is what it is. I ended up enjoying the first part more than I'd like to admit and I was hoping that this new one would follow in its footsteps. It didn't, and I can't help but wonder why a sequel was needed in the first place. The first one is great as it is. But if you do make a prequel to that kind of film, then whatever you do, do not change the formula. There was absolutely no need for a third lookalike, nor was there any need for an overly complicated plot.Had this movie stuck to what it got right in the first one, I think that it could've been just as good. Indeed, there are glimpses of the first movie in this one, and those moments are great. The Princess Switch: Switched Again, unfortunately, tries to be something that it isn't and completely fails."}], "reviews_amount": 70}