{"name": "The Kung Fu Master", "titleId": "tt11497232", "reviews": [{"id": 0, "text": "Loved the movie! The fight scenes especially were really good!"}, {"id": 1, "text": "One of the best action packed Malayalam movie watched recently. Congrats Abrid shine"}, {"id": 2, "text": "Normal story with an absolutely fantastic fight sequences. Loved it"}, {"id": 3, "text": "Could have been given a little focus to the story, but extreme level action and beautiful visuals"}, {"id": 4, "text": "One of the underrated movies in malayalam Must watch. Good action"}, {"id": 5, "text": "Must watch action movie. Total justification to the title.loved it."}, {"id": 6, "text": "I saw the move very near in asianet it was awesome action movie: forget about the story who is the hero without screen cut he done action very well- thank you abrid shine"}, {"id": 7, "text": "The First Indian movie in MALAYALAM language showing the full contact martial Arts(Especially the Wing Tsjun style of KUNGFU. Starring the real life KUNGFU MASTER Mr. Jiji Scaria in a lead Role along with talented martial artists. Mr, Jiji Scaria's performance showing us the powerful WingTsjun KUNGFU. It's a must watch entertainment movie iof action packed Don't miss to watch"}, {"id": 8, "text": "It like Chinese martial arts movie, Donne yens style of martial arts, good feel, good location, j like so much"}, {"id": 9, "text": "Best fight scenes in malayalam movie industry. All did their role well.. And can find the effort and hard work taken by each and every person in the movie.. But story was not up to the mark. All together its a good movie to watch and happy to see martial arts in malayalam movie.."}, {"id": 10, "text": "I loved it from the beginning to the end. very inspiring and fantastic movie😍😍"}, {"id": 11, "text": "This was a superb movie with real fight.....No rope or any safety measurements.....Those who acted in that movie was superb in fighting....It was really awesome....I really like it.....Very much interesting👊👊🥋🥋🥋🥋"}, {"id": 12, "text": "Very good action I love action no and this is very powerful movie and motivated movie also"}, {"id": 13, "text": "Shooting fight sequences in the snow would have been hell of a task. Hats off to the crew for the work that you have put up. This movie definitely a great attempt as an action thriller . And of course a visual treat !"}, {"id": 14, "text": "Loved the actors. Eventhough the script and naration was not up to the mark, film gave 100% sincerity to martial arts. Villain character played a vital role throughout."}, {"id": 15, "text": "Awesome martial arts movie. A real wing chun fighter"}, {"id": 16, "text": "Good movie. I liked it very much.One of the best movies"}, {"id": 17, "text": "Couldn't watch this movie in theaters, but watched it recently on Asianet.One of its kind in Malayalam movies, or maybe in Indian cinema; purely from an action point of view. Felt authentic. Kudos to the team for pulling it off gracefully.But have to point out that storyline was thin, as seen in most movies of this genre.Can't believe Abrid made such a drastic choice from ultra-realistic to full on action-drama. Always a fan of directors who breaks their own boundaries in filmmaking. Can't wait to see what he is up to next."}, {"id": 18, "text": "This is, without doubt the greatest Martial Arts film ever in Malayalam. Even though the story or narration is not appealing, it is a real treat for Action or Martial Arts lovers."}, {"id": 19, "text": "The Kungfu Master is a complete martial arts action filled movie. Feel no wire works in action sequences. Fist to fist epic. Hero , heroine and villans all are action skilled experts. Locations are awesome and songs are also good. I watch the movie several times. Thank you Abrid Shine(Director) sir for the movie. Appreciate each one of your crew. Waiting for the blue ray release. This must be in my action movie collections in life time.."}, {"id": 20, "text": "As a fan of chinese martial arts movies, I loved this one. Actors and directors put a lot of effort for the fighr sequences and its perfection. If you love watching movies of Bruce Lee, Jackey Chan, Jel Lee, etc. it is highly recomented for you."}, {"id": 21, "text": "The movie Kungfu master is a good action movie which primarily focuses on hand to hand combat which is well choreographed. The actors in the movie have done their best to maintain a good fighting rythm inorder to keep the sequence flowing. Overall it's a good action movie worth to watch"}, {"id": 22, "text": "A good entertainment ,Yet an impactful.one !worth a watch and a good motivator"}, {"id": 23, "text": "The fight are so realistic and thrilling.. Weiting for more action movies like this"}, {"id": 24, "text": "The movie was awesome for its action. Personally I feel the character of the bad guy Louise Anthony took the cake. He was very expressive and seemed natural.The lead and villain seem to trained martial artists, if not, they did a good convincing job.Script and narration could have been a lot better. Actors seemed to be trying hard. Chemistry between the family was missing. Failed to ignite the emotion during the murder of the family.Overall an average movie but 10/10 for action."}, {"id": 25, "text": "I think its a new milestone for malayalam film,i believe its not that easy to put together such fight scenes,hatsoff to the crew members."}, {"id": 26, "text": "To be honest, the story is not very interesting but let me tell you, the action,fight parts of the movie is really good. Happy to see such a movie from Malayalam movie industry."}, {"id": 27, "text": "Good movie packed with real authentic fights placed on a family drama plot."}, {"id": 28, "text": "Script is average but super action👍💪💪💪💪💪💪⚔ all the best"}, {"id": 29, "text": "Good action Nothing special in story line But visual treat for a martial art fan"}, {"id": 30, "text": "Watched it last day with my friends it lacked a good script anyhow I liked its action scenes are good overall above average movie"}, {"id": 31, "text": "Mst wtch action movie in Malayalam probably in Indian movie so far. Really enjoyed ❤😍"}, {"id": 32, "text": "Positives: *Action sequences is the main positive thing in this movie and it convinced perfectly *Abrid shine done a good job in terms of making the movie * Bgm is perfectly matching for the movie *Dop also good Negatives: * Story is very simple and predictable *Dubbing not good * Acting is not a big part in movies it was average though Conclusion: Those who like to watch action movies should see this.👍 If your are demanding good script and performance not watch this movie🙏"}, {"id": 33, "text": "If you what to enjoy the movie change the playback speed to an average of 130%😅"}, {"id": 34, "text": "The positive aspect is that the action sequences were good. The acting and dialogue delivery were too irritating. I had to wait a long time to see a fight scene. Such a slow paced movie."}, {"id": 35, "text": "This is a low budget amateur movie. Lighting is always bright in every shot, and probably shot the movie with un movie like cameras. It's about kungfu or martial arts, but fight scenes are not usual movie style shots, but often close up. Script lack twists, and predictable. it's first 20 minutes are a well edited home video, and overall someone trying to make a movie for the first time with a small group. I saw lots of crap reviews on IMDb, so decided to post about what I saw."}, {"id": 36, "text": "Worst acting, non existent story and horrible lines !The action sequences are good, but you can see nothing new, watch good martial arts movies from 70s and 80s of Bruce Lee / Jet Li instead of this garbage"}, {"id": 37, "text": "This entire movie is cringeworthy action and and story is simple. Total drag in first half. And acting is mediocre. Waste of time."}, {"id": 38, "text": "Good one but fights are good but acting of Co artists disappointing... I feel missing of realistic magic of abrid shine Watchable for that fights only"}, {"id": 39, "text": "Very slow paced family story which leads to an martial arts movie.only positive factors are the fight sequences,the cast were good at fights only..other acting sections were weak,probably bad casting option for this movie.watch this movie at your own risk"}, {"id": 40, "text": " The Kung Fu Master  Malayalam movie.Abrid Shine does extensive background work on his projects, before venturing into them. If the movie '1983' was on cricket, 'Action Biju' was on Police life and 'Poomaram' was solely on youth festival.In this project, he has selected 'Wing Chun' ...a Southern Chinese Kung Fu technique, as a theme for this presentation. Wing Chun' a form of self defense that requires quick hand and leg movements, to conquer over the opponent. Abrid Shine was able to introduce the Mallu audience, some un-adulterated action sequences, without any dupes not any camera techniques.Storyline revolves around the brother sister couple, both Wing Chun' experts, suffering some personal damages and loses due to attack by a goon gang and the revenge follows. The background scenery is beautiful, as the story is happening at Rishikesh, Dehradun and Mana the last village on Indian side....snow clad scenic settings for a Kung Fu climax fight.Director, himself taking care of the action sequences, has choreographed the fight scenes to perfection.The story is so flimsy and usual revenge thread, which we would have seen in, so many grade 3 Chinese Kung Fu movies.7 on 10 ....get ready for some rapid fire punches.Even though most of the actors are naive and debutantes, they have perfectly done the action choreography, to mask their inexperience. Neeta Pillai has grown from the bubbly girl' image of 'Poomaram' to a disciplined killing machine, in this presentation.Bruce Lee, Jackie Chan ... not your cup of tea.... Forget about this movie.Me, enjoyed those speedy repeated punches, very much ... Ouch ! Looks like, I dislocated my shoulder."}, {"id": 41, "text": "A brave and successful effort to present the Beauty of the FULL CONTACT Martial Arts(Mainly the CHINESE Kung Fu, Wing Tsjun Style) in the Indian movie, from the Well known Director Mr ABRID Shine. The Movie Main Character(HERO) Mr JIJI SCARIA is a real-life KUNG Fu Master by Career And The Chief Instructor of the Wing Tsjun Kung Fu international(INDIA &amp; KUWAIT). The Kung Fu lovers will definitely like this movie as its the first effort to Show a Full-contact Martial Arts movie Acting the Real Life Kung Fu And Karate Masters Leading by Master Sifu- Mr Jiji Scaria. the Realistic Action done by the martial artists led by Mr. Jiji is the main highlight of the movie, moreover, the Movie has had a Heart touching story too. I recommend All of the world viewers to not to miss it. Mr Jiji Scaria is trained under the Grand Master Sifu- TOMMY LUKE BOEHLIG and is the Managing Director of The BDS(Boehlig Defense Systems), working together with Jiji Scaria."}], "reviews_amount": 42}