{"name": "Love at Look Lodge", "titleId": "tt11212172", "reviews": [{"id": 0, "text": "The male lead is selfish, whiny, rude and disrespectful during most of the movie so when they get together in the end, it leaves you shaking your head rather than giving you that feel-good ending they're looking for. 80 minutes isn't enough time for redemption when the characters stay unlikable for most of the movie."}, {"id": 1, "text": "Noah was completely miscast. And the writing was disappointing. There was absolutely no reason for Lilly to have feelings for Noah. For Hallmark's first foray into interracial relationships of main characters, I expected much more."}, {"id": 2, "text": "Agree with the other reviews that the acting was off, lead romantic characters had zero chemistry, and everything felt forced - esp the interracial aspect. If you're going to be diverse, use people who can act like they are attracted to each other or have some attractive qualities. It was just awkward overall."}, {"id": 3, "text": "I've seen all the Hallmark movies but this one about put me to sleep. The cast all seemed awkward and no one really meshed together. Try it again, please."}, {"id": 4, "text": "No chemistry between the two couples. I found it to be a boring yawner and ending up fast forwarding thru a lot of the second half. Wanted to give it a chance but just didn't enjoy it."}, {"id": 5, "text": "Wow. This is one of the MOST boring Hallmark movies ever. Bad acting. No chemistry. Stupid story. The leads were awful. The supporting cast annoying. This one is right up there with a couple other recent REALLY BAAAAAAD Hallmark movies. Couldn't even watch it all. Wake up Hallmark - I used to love all of your movies. Not so much anymore."}, {"id": 6, "text": "First if all high five to Hallmark for an interracial couple...finally! However, the casting was completely off. The two leads had no chemistry whatsoever and to be honest the storyline was boring and slow. I actually muted it after an hour and read a magazine. What a yawner!"}, {"id": 7, "text": "I agree with the other reviews, which were more entertaining than the movie. Unfortunately, this was not one of their better ones."}, {"id": 8, "text": "This was a cute little movie. I'm glad to see diversity in a hallmark movie. It was a sweet love story. The couple's were cute. I'm not really understanding the negative comments. It was a typical Hallmark movie. Two people meet, and fall in love. It's not a major motion picture folks it's Hallmark. If you want oscar performances don't watch these movies."}, {"id": 9, "text": "Characters are hard to like and be hopeful for. Not a believable love story."}, {"id": 10, "text": "Very disappointing, I looked forward to it, but it almost looked like the cast didn't like being around each other. It felt forced and awkward that I couldn't even watch it all of it"}, {"id": 11, "text": "I have enjoyed other movies with Jonathan Keltz but not this one. Was it horrible writing? Acting? I don't know.... the cast had absolutely no connection to each other and definitely there was not a spark, not even a flicker, between the love interest characters."}, {"id": 12, "text": "Usually a fan of these, but this one was tough to watch. And after a few days at this busy (but annoyingly small and empty!) resort, the guy didn't even earn or deserve a ticket to the friend zone -- let alone, a romantic dance and kiss.I hope this isn't an indication of things to come during the rest of 2020! 😏"}, {"id": 13, "text": "Two hours of a snoozefest. Formulaic plot as always. Not a wit of attraction between the leads.I hate to be so cynical but Hallmark has gotten some really bad press about their lack of diversity. Was this deliberately a horrible pairing just so they could say See, we tried an interracial couple and nobody liked the movie to justify abandoning the effort?The plot just crawled, didn't make you care about anybody. A total waste of time."}, {"id": 14, "text": "Pretty lame. No one had any chemistry, and the acting, on the whole, was weak. I see a lot of Hallmark movies. The casting, all of it, should have been rethought. And the script itself was a yawn."}, {"id": 15, "text": "The writing is pathetic, the story is weak, and the main characters (who are lovely) never appear to actually be falling in love. While the Hallmark mysteries are uniformly excellent films, many of the newer movies are disappointing with poor writing and stilted acting."}, {"id": 16, "text": "This movie was awkward. I felt bad for the lead guy. His sister basically forces him to plan her wedding, which he clearly didn't want to do and had no aptitude for, and then the wedding coordinator at the venue badgers him constantly for not being engaged enough in the planning. Why didn't the sister plan her own wedding, like any bride would?? And the wedding coordinator should mind her own business. A lot of unlikable characters."}, {"id": 17, "text": "I liked the movie nice and sweet glad Lilly and Noah got together. Lilly is a beautiful woman."}, {"id": 18, "text": "The wedding coordinator seemed to be too pushy and rude. For example, she took Nate's phone during the group photo. That was out of place. At the end of the day, she is there to please the guests, not to act like their mother.Overall, this movie felt forced and the characters had no chemistry. It was very awkward and I lost interest immediately.Maybe they needed more film time, so they could have more chemistry with each other."}, {"id": 19, "text": "Personality-wise, both of the leads were unpleasant. Looks-wise the heroine was way too attractive for the miscast hero. The actor might do well playing a 90 lb weakling unconventional underdog type, but not as a supposed-to-be-attractive hero. The plot was boring. Nothing to recommend about this one except Hallmark's effort to diversify their cast. A lame effort is better than none at all, I suppose."}, {"id": 20, "text": "The plot follows a fairly classic Hallmark path. But the movements don't hold together well. Also the chemistry is weak among the couples."}, {"id": 21, "text": "This movie was lame &amp; a poor take on the cast!! No chemistry is being nice really!! This was a lame duck from the get go for Hallmark!! Couldn't stand to finish this it's just that bad!! I have read the paid for comments on here &amp; also read the real comments on Hallmarks fbook &amp; those pretty much sum up how people don't like this!! There were also some who were having audio problems with the film as well!! Overall, I would rather watch Pickler movies than this &amp; Pickler is a horrible actor in what few she has done for Hallmark!!"}, {"id": 22, "text": "I'm a big Hallmark fan but this was terrible. Boring. I hope this isn't the best of the Fall movies. Multi racial is great but these two didn't click at all."}, {"id": 23, "text": "Really enjoyed this one. Nice to see an interracial couple and I can't believe it is the first ever.Cute story and great visuals. I really liked the lead couple and also the little girl playing Beatrice."}, {"id": 24, "text": "I'm a big fan of Hallmark but this movie fell short of expectation."}, {"id": 25, "text": "I don't agree with most of the reviews of this movie. Yay for diversity and an interracial pairing. Chemistry between leads was good, it would have really been evident with a better storyline. I didnt think this movie was any worst than some of the HM movies I've watched. Glad we're moving toward more representation of all types of pairings."}, {"id": 26, "text": "Clark Backo is a very interesting screen presence and I hope to see more of her in the future. The film overall was not very original and mostly flat. I realize that the leading man was playing the typical annoying role that is supposed to become more likable by the end of the film, but honestly I think he was just miscast. I never felt the slightest bit of chemistry between him and Clark, and I think a stronger leading man would have made this much more entertaining. Bravo for at least doing an interracial romance without focusing on race. That is how it should be done."}, {"id": 27, "text": "Look, this is Hallmark. I get it. The movies are not bleeding edge big budget Hollywood films.But people have got to realize that this couple have zero chemistry here. I wonder if they have ever spoken before showing up to the set...there are better Hallmark movies out there."}, {"id": 28, "text": "I have to agree with many of the reviews.this movie dragged and was dull and boring. I wished I had just dvr it so I could have skipped the movie just to see the sneak peek at Luke Macfarlane and Merrit Patterson's new movie. Do yourself a favor skip this one! I sure hope Hallmarks lineup is better then this one!"}, {"id": 29, "text": "Lily works at the Look Lodge with her sister and she wants to prove that she can do more so she becames a temporary activities director for a wedding party, which includes our main character, Noah, who is there with his family.We have an interracial couple, good Hallmark, points for that. But that's it. There was no chemistry between the characters. I didn't like the acting at all. I don't expect Oscar performances and I understand we are going through difficult times but it's like they didn't even try. I didn't even care about the secondary characters either. (not even the child!)Halfway through it I grabbed my phone and left the movie as background sound, that's how bad I thought this was. I never do that."}, {"id": 30, "text": "I was excited to see that we actually got an interracial romance; it seems while media portrays more people of color, couples tend to still be monochromatic. And there's a younger actress (not mother or grandma) with hips, even if she isn't the main character. those were the best parts of the movie. the two leads work together fine but the romance wasn't there; would've been better if they'd left that part out. the male lead is a self-centered dope and the female's sister is a total witch. nothing felt terribly cohesive."}, {"id": 31, "text": "Not the worst Hallmark movie but not really worth spending any quality time with. As folks mentioned it is extremely flat. Lousy chemistry. Maile lead is not good (common in Hallmark movies). You could play it in the background while you go about crafting or housework. Otherwise not worth your time."}, {"id": 32, "text": "I guess if you watch this thinking it's going to be bad, it's really not that bad to watch. I've seen much worse hallmark movies than this. It's not a lovey dovey one, so if that's what you're after, skip this. Other reviewers claim no chemistry but it's not that, it's the fact you have 2 very career oriented people coming together. It feels forced because it's not obviously done and the movie has a sense of being made up as they went along. Nothing to do with main actors. It was harder for me to believe the brother and sister were ever close. Yes not a spectacular ending. And what's with that girl taking a pic and having to show everyone? It got annoying by the end. Like it was a time filler or something. Watch if you need a time waster and like hallmark movies. Otherwise, you're not missing much. Don't expect sparks just two people that enjoy being around each other."}, {"id": 33, "text": "This movie barely had a plot. It was to to tell who the main character was. It was filled with plot holes and was so hard to follow. The characters kept being over dramatic about everything. I'm writing this review and I haven't even finished the movie yet. It's that bad."}, {"id": 34, "text": "I agree with everyone who said there was zero chemistry between the 2 leads, and the writing was very poor. The setting was gorgeous. Someone suggested it was Grey House, I assume from Good Witch, but that building is in Dundas, Ontario. The Look Lodge location is actually a beautiful inn outside Ottawa in North Gower. It's called Strathmere Resort and Spa."}, {"id": 35, "text": "I really don't understand the negative reviews. What do people want? I think it was an enjoyable movie and far from dull and boring ."}, {"id": 36, "text": "Great light and feathery movie. My family loved it. Great work Hallmark👍🏿"}, {"id": 37, "text": "Loved this movie, it was so cute and all of the cast members were very well casted. I loved the nice moments with Beatrice and her father. Very nice feel-good movie over all"}, {"id": 38, "text": "Another disappointment. Keep waiting for this director to start caring about filmmaking rather than caring about living the life of a filmmaker. Begs the question: if you are able to find funding and distribution for your films but consistently give the world terrible films...should you finally stop and do something that contributes to society?"}, {"id": 39, "text": "The entire movie the female lead was telling the male character to get off his phone and be a better brother. Not a hint of them liking each other in a romantic way or anything. ZERO chemistry! Bad writing! The kiss at the end actually surprised me because of how there was not one element of romance between the two during the entire film! The story should have focused on his sister!"}, {"id": 40, "text": "Not the best writing. Never see any other guests at the lodge, which makes no sense. Lead actor is absolutely HORRIBLE!"}, {"id": 41, "text": "This is Hallmark at its worst. The performers are fine, but they are saddled with a script that just rattles on and on without any kind of real complexity. It's just one big talk fest that takes minor situations and then makes the cast ramble on and on endlessly. None of the actors have any real chemistry between them, but how could they generate any when they are hampered with such a lifeless and dull storyline? Sometimes they look like they can't even believe what they have to recite. Skip this dog. The scenery and sets are quite nice, but the cast keeps getting in the way with that hackneyed script ! Originally titled Falling for Look Lodge. I gave this an extra star because it might just be a cure for insomnia. Hallmark should change the title again to Falling Asleep at Look Lodge and market the DVD exclusively at pharmacies !"}, {"id": 42, "text": "This movie had the potential to be good, but the storyline was weird. The acting seemed rigid as if the movie had been thrown together at the last minute. A very short-staffed sister fires her sister before a wedding deadline, after the activities coordinator had bailed, then kicks her out of her room? The brother/sister dynamic was odd. I just realized there were no extras in this movie, which added to the inauthentic vibe. And for crying out loud, Hallmark, you used Grey house!"}, {"id": 43, "text": "The story had some fresh aspects with some of the formula stuff thrown in. The general outline had potential but a lot of the details were handled poorly. Charmaine was all wrong from start to finish and I'm not sure if that was writing or acting but probably both. The whole day of the wedding was disconnected and contrived.The acting was mostly poor. Clark Backo did OK with what she was given. Jonathan Keltz was not impressive at all and had zero chemistry with Backo. Noah and Lilly went too quickly from totally antagonistic to confidants and even then it seemed like there was as much yelling as sweet talk. With a little more transition, the story could have shown how Noah respected Lilly's honesty and straightforwardness, but the story didn't do that. It didn't help that both characters appeared to arrogant and stubborn in general at the beginning so it took a while to like them, especially Noah.It felt like something more significant was going to come out of Noah's relationship with Beatrice.The supporting actors all had something to be desired. Gabrielle Jennings, as Beatrice, didn't seem natural. Something seemed odd about Evert Houston's character, Teddy.Neshama Entertainment made this film and they don't appear to be directly related to Crown Media, but they have done other things for Hallmark, Lifetime, and UpTV among others."}], "reviews_amount": 44}