{"name": "David Attenborough: A Life on Our Planet", "titleId": "tt11989890", "reviews": [{"id": 0, "text": "David Attenborough has been a part of my life since I first started watching nature programmes when I was a very little boy (I was born 1968)In nearly 70 years of film making he has pretty much visited every place possible on the planet and travelled millions (literally) of miles to do so.He has never failed to awe and wow us with the wonders of the planet.So when SIr David, at the age of 94, makes a new, one off film with the strapline My witness statement, you have to sit up and take notice.I decided to see this on it's release date in the cinema, to really immerse myself in the wonders of the world on a big screen.The film opens with Sir David in the ruins of Chernobyl where he shows the results of ONE stupid, mammoth mistake and then leads into the state of the world today.SIr David takes you on a journey through his life, showing population levels, CO2 levels and %age of the planet still classed as WILD each time. He presents the facts in his warm caring style but showing a picture of how bad things have got.STATISTIC : Of all the animal biomass on earth, 60% is estimated to be human livestock, 36% humans and a mere 4% for everything else.The narration pauses with about 30s of silence and the look on his face says everthing - no acting just a man looking back over the years - brought a lump to my throat.But after all the doom and gloom he says This is my witness statement. But it doesn't end there, we can fix this and I'll tell you howFo the second part he talks about all the ways we can, as a world and a species, start to fix things and put them right. But these are not just pie-in-the-sky methods, he talks and shows about how positive change is ALREADY happening. Watch for the examples from the Netherlands &amp; Costa Rica.He talks about the human population peaking and how we can make this happen sooner by actually IMPROVING people's lives - no draconian fertility laws, just the course of nature.SO he ends on a positive note - he really believes we can fix this and based on the fact Costa Rica DOUBLED its jungle and forest cover after mass deforestation in just 25 years and when you see how nature has reclaimed Chernobyl it will hearten you too.The fixes don't require us to deny ourselves but to manage things BETTER and in fact if we do things BETTER we will have even more.Now we just have to get our politicians, especially the deniers, to wake up and DO SOMETHING.I honestly believe that anyone who gives this show a negative or neutral review or rating (under 6) either has completely missed the point OR is a denier and there is no hope for them at the moment.Final thought - Many scientists have said that the lost of biodiversity on the planet at the moment is so great and so rapid that it has to be classed at the 6th Great Extinction Event the planet has suffered in the 4.5 billion year history. Whatever happens, life WILL flourish again, but the question will be, Will humans be part of it or will we go the way of the dinosaurs?"}, {"id": 1, "text": "Unbelievable, I have watched many documentaries over the years on natural history and climate change. But this is the nail in the coffin. The final hurrah. This should be shown in schools and so many more places for education. It's informative and really hits home on the challenges this world faces."}, {"id": 2, "text": "'Life on our planet' not only holds the humanity accountable for the nature's destruction but also questions our very model of brazen and impudent consumerism...And as an Indian, my country seriously needs a birth control law..."}, {"id": 3, "text": "The saddest, yet most hopeful film I've ever seen. This man is not only a national hero, he is an hero for the whole world. Made me cry, but gave me hope. Sir David, your life works will be remembered with the likes of Einstein and Newton someday, you are just as big a genius in your field as they were in their own fields. You are inspiring me to become a better version of myself. Film of the year."}, {"id": 4, "text": "Such a legend and he tells his story (and our story) with breathtaking honesty.We must transition to sustainable energy, raise the global living standard and we must stop our consumption of meat.It is that simple and concrete."}, {"id": 5, "text": "Look at the name. Look at the man. The man is the greatest, and no one else can ever compare. Humanity literally peaked with him. The word legendary is actually defined as: Sir David Attenborough. Just do it please."}, {"id": 6, "text": "Masterpiece. If this movie doesn't change our minds and actions nothing will."}, {"id": 7, "text": "This will be different from my other reviews, no pros or cons...You all just HAVE TO SEE THIS.All I can say is thank god for Sir David AttenboroughLets start helping future generations, wildlifeQuote - if we help nature then nature will help us - Sir DavidRating - 5/5"}, {"id": 8, "text": "David Attenborough is an absolute hero! He has had an amazing life and it shows through this powerful documentary! If you haven't watched it already... go and do it now! It's very sad but hopeful! Like most people have said on these comments! He really is a legend and he will always be a legend! What an amazing man!"}, {"id": 9, "text": "Really powerfull message for everybody on this planet! This film should be obligated for all the kids and adults. Rewild the world!"}, {"id": 10, "text": "This is my first review, ever. There is no debating this. This is a must see for every capable human being."}, {"id": 11, "text": "This was a great documentary, with a rich point of view!"}, {"id": 12, "text": "Possibly the most frightening film I've seen. I have children. I hope, in due course, to have grandchildren. What sort of world will they live in?Attenborough's message is not new, though coming from him we *have* to believe it. The planet's heading for disaster. And yet he says it's not too late.That last bit I find hard to believe. Life on Earth, Attenborough says, will survive, in some form or another. Humanity might not.I wonder if we deserve to?"}, {"id": 13, "text": "When Sir David Attenborough makes a documentary and calls it his witness statement you have to watch it, there's no good reason why anyone shouldn't watch this one. The documentary begins with shots from present day Chernobyl where humanity has long gone and now nature is taking hold of it. Sir David time lapses through his career and talks about how the actions of humans have put the planet Earth in jeopardy, how the biodiversity is being lost and how the climate changes are being proven catastrophic not only for the species around us but for ourselves too. In the second half, he talks about what'll happen if we continue the trajectory we are on right now, the result is something which no one would want to happen, afterwards he gives account as to how it doesn't have to be that way and how there's still something which not only we can do but we must because we have no other choice, the ending makes you gloomy about what humanity has done with Mother Earth and at the same time very hopeful and determined more than ever that we are going to make things better. A species can only thrive when everything else around it thrives too ... This is not about saving our planet, it's about saving ourselves."}, {"id": 14, "text": "Any nature fans must watchCalling the film (streaming on Netflix) his witness statement for the environment, David Attenborough goes on to trace his more than 60-year career as a naturalist, mapping how steeply the planet's biodiversity has degenerated before him. Global air travel was new when he began his work, and footage of him as a young producer encountering exotic flora and fauna lends a moving, even haunting, note to his plea to restore ecological balance.We can turn this around."}, {"id": 15, "text": "Having watched David Attenborough for numerous years and his love for the natural world which has manifested in the form of great documentaries, I must attest his message is extemely important.Humanity has a choice; to either continue as we are and run ourselves into an unsustainable and bleak future or to make amends now, in the hope that our future generations continue to thrive in a world we have all long enjoyed.Change doesn't start with educating or influencing governments or politicians, it starts with each one of us. If we all made the effort to make small changes to not only our lifestyle but our mindset then perhaps it is not too late.Everyone should watch this, and is duty bound to educate our younger generations."}, {"id": 16, "text": "This film is astonishing. It serves as a greatest hits of Attenborough's career, featuring some of the greatest wilderness shots ever put on camera. It doubles as a powerful statement about the direction we've taken our planet, and examines the choices the human species has to make. I've never felt such awe, sadness and hope in the space of minutes, or sometimes simultaneously. This is Attenborough's most powerful film because it examines the very essence of humanity, and our unbreakable relationship with the world he has spent his life researching. A must watch"}, {"id": 17, "text": "This magnificent piece of cinematic art is informative and beautiful, but at the same time sobering and heartbreaking. I cannot recommend watching this enough!"}, {"id": 18, "text": "''The saddest, yet most hopeful film I've ever seen. This man is not only a national hero, he is an hero for the whole world. Made me cry, but gave me hope. Sir David, your life works will be remembered with the likes of Einstein and Newton someday, you are just as big a genius in your field as they were in their own fields.'' This review sincerely says what I want to say. Thank you very much for inspiring new generations. As a 19-year-old teenager, I have been fighting plastic pollution and climate change every day since my childhood and convey your invitation to people. I will never forget my dear David Attenborough and his testament. Show everyone you know about this documentary and the facts about our world, even if they are not interested in nature. Nature has no owner, country, or religion. It belongs to everything that exists on it. Yes, I cried too."}, {"id": 19, "text": "This is the best thing I have ever watched. Everybody needs to watch it, it articulates the planet's issues so beautifully. David Attenborough is a god send. The storytelling makes me feel so simultaneously desperately pessimistic and yet so hopeful. If only all humanity could watch and appreciate this."}, {"id": 20, "text": "I knew his voice from my childhood when my father were watching his film but never know him until today. This documentary made me cry and now I feel more responsible for our planet for future generations and my kids. Highly recommended to everyone to watch.I think all governments in this world needs to start educating people more serious about our planet life. Today, C19 taking people life and if we all don't make act humanity has no longer exists in future. I gonna start change myself with small things to care more and we all need to care more."}, {"id": 21, "text": "Ignoring this movie should be criminal. Although visually this certainly lives up to the reputation Attenborough is known for, but unlike his previous works this movie will not leave you elated by the magnificence of Earth."}, {"id": 22, "text": "I state my case. Force your family, friends and bypassers to watch this film. If only a portion of people saw this, the future of this world would be a lot brighter."}, {"id": 23, "text": "An eye opening documentary, a must see, so sad and so true, I hope we can all find a way to turn back and save our planet. Everyone must play a part. Thank you David Attenborough"}, {"id": 24, "text": "One more time u prove you are only one man who really care about the planet. Always love u sir for everything. Feeling is not describe in words so just feel it. Hats off sir with love and respect."}, {"id": 25, "text": "You can always expect a few climate change warnings in all Attenborough documentaries however this one is our FINAL warning that comes with instructions on how to fix it! Every human being should watch this and use this as an a roadmap for sustainable living NOW!!!"}, {"id": 26, "text": "There still is hope for our planet, but we need to realize that we need to adapt and change with the planet or for the planet.This movie is a good way to learn how we can adapt and help ourself and the planet"}, {"id": 27, "text": "This will be shown in history classes for centuries to come."}, {"id": 28, "text": "This needs to be shown to the whole world. What an incredible piece of television and education. It is often sad, especially as it feels it could possibly be one of his last pieces of TV, if not the last. This needs to be watched by everyone."}, {"id": 29, "text": "Very beautiful documentary. Nice build up and ends with a clear call to action. Hopefully we can convince enough people outside our bubble to see this one."}, {"id": 30, "text": "We are the most intelligent species that has ever lived. But that intelligence is not enough. What we need, is wisdom. From the mouth of one of the wisest men there is."}, {"id": 31, "text": "A life on our planet is a must see documentary. Sir David personal witness statement to the planet and a urgent message to us to change the way we life for our own sake. It's very well filmed as you would expect and feels more personal than some of his other series. Definitely a 10 out of 10 and a well done to Netflix for this one."}, {"id": 32, "text": "This movie is depressing yet beautiful at the same time. I really hope humanity choose the right path toward a better sustainable future"}, {"id": 33, "text": "Words can't describe how shocking, stunning, amazed and horrified I felt while watching this film. My tears dropped when I saw the earth from outer space, when the blue whale blowing water, and the coral reef turned white. It's an extremely powerful message to us all, from the earth, from the legendary David Attenborough. Remaining Wilderness of 2020: 35%"}, {"id": 34, "text": "A must watch. Heart breaking. Encourage everyone you know, young &amp; old to watch this program."}, {"id": 35, "text": "As much I love all nature documentaries of David Attenborough, this latest movie is without doubt my favorite, even if it wasn't as delightful or 'rich' in its animal shots.Simply going along with the timeline of Attenborough growing older, we see how the nature is destroyed by our exploitation, how other beings suffer from pur expansion, how the remained wilderness has dropped from 66% in 1937 to 35% today. 70% of the birds existing now are domestic chicken fed in tiny cells to be eaten. Only 4% of the existing animals on earth are not grown by human to service ourselves. But he's not just warning, he is giving out solutions and bringing up attention. Watching him being 93, walking around Chernobyl, looking back at his old times, and making such immense effort to spread his words, I feel very touched and lucky.I strongly recommend the documentary as I am so touched myself by his work that I cried while watching. After all the nature will always rebuild itself with or without human. But if we want to survive and protect our civilization, we have no choice but learn to take care of the nature."}, {"id": 36, "text": "Everyone on Earth needs to see this amazing film. Especially in America. We need to start taking climate change seriously. We are so close to the point of no return and as a species we need to come together and reverse the damage we have done to our home."}, {"id": 37, "text": "Sir David explains the critical interlink between climate change, wildlife, responsible production and consumption coherently for us, putting things into perspective. And he doesn't stop there, he also shares ways in which our individual actions can help heal the planet and in turn, save ourselves."}, {"id": 38, "text": "My heart breaks, for nature, for all other living things, for the future generations, and for David Attenborough, because he is obviously devastated. He will pass away without knowing if it is going to be fixed. I am so sad I just want to bawl my eyes out."}, {"id": 39, "text": "David Attenborough is a personal hero of mine and I must admit I've never seen him like this. I've known for a long time that we're destroying our planet and ive lived in ignorance. This documentary made me want to change and do more.I can't help but feel like this was all very final and Attenborough is saying goodbye though, as if to say it's over to us now.Please watch it, it's an extremely important message from a national treasure."}, {"id": 40, "text": "What a wonderful, great beautiful man! This movie made me think a lot in my son and I admit I cried a little, but is also a message of hope. Please, anyone reading this, spread the word... People need to see this and really act, to do something, no matter how little it seems. Thank you David!"}, {"id": 41, "text": "Everyone should watch this, amazing and informative. Share with everyone you know and do something different to help no matter how big or small"}, {"id": 42, "text": "It's an extraordinary tragedy that we are profiting off of our our destruction. Mankind is the architect or their own doom. We're poisoning our very food source. Humans are surely the evil that plagues the earth. The chronological narration is undeniable... It's gutt wrenching... It's disgusting. Our future is almost certainly doomed, unless... John Webster put it aptly by stating that Whether we fall by ambition, blood, or lust, like diamonds we are cut with our own dust. God help us."}, {"id": 43, "text": "Masterpiece after masterpiece. Are our leaders are all blind to see the future? Lets hope it will not be too late to fix our world or next generation will not be liable for what kind of monster we created for them. A perfect tv documentary within a short period of time."}, {"id": 44, "text": "Everyone should see this because this here is the wisdom that we all need and the wisdom that sir david talks about in the film, thank you sir david you will always be the greatest Narrator and humanitarian to me."}, {"id": 45, "text": "Speechless and remarkable.. the way it is shown, it's so breath taking and touching.."}, {"id": 46, "text": "Great summary of why we must act to live in harmony with the natural world."}, {"id": 47, "text": "David Attenborough at his absolute best!I felt as if he was talking to me; telling me off. I've since googled my carbon footprint on the WWF website and planned some changes I can make. Imagine if this film makes every viewer feel &amp; do the same. Now we're winning and it's achieved what David set out to do!! Amazing!"}, {"id": 48, "text": "If the G20 leaders watch it, they will understand what humanity is up against. Previous five Mass extinctions took millions of years, the next one may happen in next 100 years.. Thanks to our unprecedented misuse of natural resources. We still have time on our hands. Let's hope we wake up. If everything is done judiciously we can save ourselves. As Sir Attenborough said himself.. It's a case of nor saving the nature but saving ourselves. Nature will survive...!"}, {"id": 49, "text": "Powerful. Terrifying. Uplifting. Visionary. This film is quite simply the best and most important film I have ever seen."}, {"id": 50, "text": "The name of the man should be enough.And yet he needs to do this movie to once again display the need for our earth be our best legacy."}, {"id": 51, "text": "This is an incredibly powerful documentary about the current state of our planet told by the most iconic wildlife filmmaker of this generation, Sir David Attenborough. Through Sir David's story we get a glimpse into the change of our planet he has seen and a vision of hope for the future if we correct course. This is one of my favorite documentaries of all time and I would recommend it to everyone."}, {"id": 52, "text": "As David explained, the urge to change is bigger than ever. Everybody should watch this documentary, Our planet, and all the other fenomal works of Sir David, to feel an live by the urge to change."}, {"id": 53, "text": "This was one of the most powerful documentaries I have ever watched. Here we have David Attenborough, 94 years old, giving us his life testimony, his story. But it isn't just a testimony of his life, it isn't just his story. It is a part of the life testimony of human kind as a whole, seen through his eyes, during the part of history he's been a part of.The conclusion of his life experiences, experiences which excels most other's, is explicit. Nature is developing in the wrong direction and we need to take action on a global scale now. If not, destructive cumulative effects will trigger each other one after another and the degradation of nature will increase exponentially to a stage where we are left incapable of changing the outcome.At this stage the documentary could have ended. It would have left the viewer with a bad conscience, yet a powerful message. But no, that is not the way of David Attenborough. He is an optimist, not a pessimist. Despite being a front row witness to human kinds extensive abuse of nature he is optimistic. Despite being 94 years of age he wants to contribute. With this documentary he gives us his wisdom, his contribution.What do I feel after watching this documentary? I feel optimistic. I feel a desire to contribute. And I feel David Attenborough is a true legend."}, {"id": 54, "text": "A lifetime witness statement on the wanton destruction of our planet. I can't think of anyone more qualified to set out the perils we face if we choose to continue without a huge readjustment to how we ALL live. David Attenborough always gives us hope citing a way forward but it is obvious in this film his sense of utter despair. If you care about the 'tomorrow' which most world leaders believe never comes, this is a MUST watch film. With a sense of optimum, maybe there will be enough of us that will act on its message to make a difference."}, {"id": 55, "text": "This film is unbelievably moving. It blew my mind. I thought I knew what global warming and climate change were, but I knew nothing. Yet it's very optimistic and provides solutions as to how we can save mankind. The wisest hour and a half I have ever spent."}, {"id": 56, "text": "Together we can do it! lets face the biggest challenge of humanity! Start by sharing this movie and rate it up!"}, {"id": 57, "text": "After joining Instagram and making all of us surprised, David Attenborough introduced their new document. A thinkable document. A Life on Our Planet gives us a general information about what is going on on our planet? The way sir David narrate is lovely. The sudden changes of beautiful pictures into ugly and gloomy pictures may shock you so you will find what the real disaster is and also you will realize that we need immediate changes in every aspect of our lives. In addition, in world environment day the theme of 2020 was said biodiversity and the importance of biodiversity was shown well in this film. I figure out the hopeful perspective that A Life on Our Planet gives us. Sir David states his solution for solving problems. The look simple but they are effective so instead nagging all the time, face with problems. Another thing that we can mention is there is no hyperbole in this film. I can summarize this film just in four words: important, simple, short and helpful."}, {"id": 58, "text": "David and team have given me hope beyond reason that we can save and restore our beautiful planet. I have not felt this empowered in a long time and I now know what I aspire to do in life, Help Lead the Change! Thank you for not pointing fingers, not blaming anyone, not politicizing anything, but instead gracefully laying out our current 'state of affairs' and our options moving forward. You're attestation will not soon be forgotten and I pledge to do my part to continue educating and transcend this 'wisdom' that you have given us to save our most beautiful planet as one united human species."}, {"id": 59, "text": "It brought me to tears, lifted me up and inspired like no other movie. It's true, it's raw, touching, it's a must see for every child and adult out there. Amazing footage, great commentary. Eye opening!"}, {"id": 60, "text": "Poignant and powerful storytelling of David Attenborough captivating. It is a must-watch because it tells us the damage the greedy humans inflicted on the planet and tiny roles we all can play to preserve the beauty and biodiversity. We are very much a part of biodiversity too."}, {"id": 61, "text": "WE HAVE TO START NOW! This is truly an eye opener and something needs to change NOW! Please watch this, you will thank me later 🌙 We still have a chance to manage our impact"}, {"id": 62, "text": "Although I do not believe it is Sir David Attenborough's finest work, it is by far the most personal. The visuals and its messages are striking, exhilirating, realistically morbid but at the same time offer a glimpse of hope. The film clearly portraits what can happen in a lifetime thus highlighting the importance of our current era. Will we make the right decisions? Because nature will overcome anything, with our without us."}, {"id": 63, "text": "What a beautifully made film !A deep perspective and meaning given the natural earth canvas by having 360 degree coverage over multiple centuries on where we are and where we are headed and a vision for future from none other then Sir Attenborough.A very important piece of visual reminder for each of us. Dont miss it !"}, {"id": 64, "text": "The most important collaborative opportunity in the world."}, {"id": 65, "text": "It's a great documentary that follows the progress of our extinction that we have been producing. There is so much information about it that it's shocking how there people who don't recognize the damage we are doing to ourselves. It's our extinction and not one done while we sleep but a painful one. It's not a joke, we are going to far."}, {"id": 66, "text": "An Ambassador for Nature and Humans. After watching his programs over 40+ years, he seems to have refined his delivery of the hard truths with the impartiality of Mr. Spock's understanding about human weakness. Yet still delivering the force and passion for what is beautiful and what is right, as only a genuinely human person can do. Maybe all those years in nature has fostered such an admirably balanced person."}, {"id": 67, "text": "A renewed commitment to live a life as part of Nature. To live a life sufficient to my needs."}, {"id": 68, "text": "While it's full of doom and gloom, the stats are incredible re: destruction, you are left with an relatively upbeat ending. Attenborough always hits the nail on the head and this is no exception. Watch it, then act on it."}, {"id": 69, "text": "I was a huge anti-climate change supporter. Can't stand unpolite brats that are manipulated by adults to play a role, can't stand most of famous people on this matter.BUT THIS DOCUMENTARY... THIS MOVED ME DEEPLY. Dear Mr. David and entire crew - This documentary will make a change"}, {"id": 70, "text": "It's a really beautiful and powerful documentary. It shows us what is wrong with the planet and how we could fix it (the problems that still can be fixed)I think everyone should watch this documentary, so people will know in how much trouble planet earth really is. Because if we keep doing what we are doing we will be facing extinction."}, {"id": 71, "text": "This is more than pure gold..... as a being myself who belonged to the race of greatest predators in the world . Its in our hands to save ourselves also the coming generation and the future of our very Existence. Ill try from this second..... Will You ?"}, {"id": 72, "text": "If there ever has been a movie that talks to us about what we have done, what we should have done and what hopefully we will do, this is it.I never enjoyed a documentary and connect with like this. I felt sorry for what we, humans, have done to out planet and how selfish we acted. And it doesn't stop there. A very positive and productive documentary that at the same time crush you under the guilt and shows you the hope of what can be done to recover."}, {"id": 73, "text": "Sadness in a beautiful made package. Good Monologs, amazing filmed and colored wildlife."}, {"id": 74, "text": "Probably the best and most important documentary you'll ever watch."}, {"id": 75, "text": "It's about saving ourselves. Natural will always thrive with or without us, but can we thrive without the nature?"}, {"id": 76, "text": "I sincerely wish everyone would watch this amazing documentary showing how we are completely destroying our planet so that the majority of people would finally realise that we have to act NOW. This is a truly eye-opening documentary by the great Sir David Attenborough."}, {"id": 77, "text": "I rather enjoy watching documentaries about the planet or space exploration, but until now I've simply watched them with a reserved grandeur of the world around us.After listening to Mr. Attenborough tell his story, I feel like it's my obligation as a human being to make changes happen now. Not only for my own well being, but that of my children and grandchildren.This documentary has really given me the ammunition to make impactful changes and open my mind to the world around me. I cannot thank him enough for opening my eyes."}, {"id": 78, "text": "Brilliantly shot, perfectly directed,expertly narrated and humbly executed to give a giant wake up call to each individual and nations alike to do much much more to safeguard our collective future."}, {"id": 79, "text": "This movie should be watch by everyone as a lesson."}, {"id": 80, "text": "We are facing nothing less than the collapse of the living world. The very thing that gave birth to our civilization. The thing we rely upon for every element of the lives we lead. No one wants this to happen. Non of us can afford for it to happen. So, what we do? it's quite straightforward . It's been staring us in the face all along ~David Attenborough"}, {"id": 81, "text": "Something everyone should watch. Sad and anger inducing but beautifully done, thought provoking and most importantly inspiring."}, {"id": 82, "text": "Made me cry, made me think, made me want to change! A must see, encourage everyone to watch it, and listen to what he has to say!"}, {"id": 83, "text": "What a wonderful world it could be if the humanity could cut off the greed and stop destroying the planet. Makes you really sad that his vision probably will never come true. But on the positive side, the earth will reborn again after we all are gone."}, {"id": 84, "text": "It's beautifully done and such an important topic. This one is a must see."}, {"id": 85, "text": "David's amazing lifetime of documenting our changing planet is documented in this feature. How to save our planet and out on a self sustainable trajectory... how to transform Mankind from being apart from nature to be a part of nature .. simply amazing 10/10"}, {"id": 86, "text": "One of the greatest movies I've ever seen. David describes the world and the nature as he's seen it in the past and how the world would go down if we don't stop our bad behaviors to mother nature. He also give some really wise advices how to solve the problems. Excellent, would strongly recommend as a must see for all future politicians."}, {"id": 87, "text": "Everyone must see it. Everyone needs to know the truths, experiences and views that the legend shares with us. Please share it with your fellows."}, {"id": 88, "text": "We all must act now. Every single person could make at least one simple change in their life that will have a huge impact on the world."}, {"id": 89, "text": "It is just exceptional. I knew how bad we were treating our planet but watching this still blew my mind.Please watch this documentary."}, {"id": 90, "text": "A must watch for every human on the planet, the existence of our future generations depend on listening to this brilliant and caring man. Informative and very enjoyable production"}, {"id": 91, "text": "This film perfectly juxtaposes the dire situation that we, as humanity, find ourselves in with a hopeful future. David Attenborough's life is the perfect and poignant vessel for this story."}, {"id": 92, "text": "The most important film I have ever seen! Must be seen by all human inhabitants of mother earth to understand we are part of nature."}, {"id": 93, "text": "A great movie from the perspective of a great mind. We should be more attentive to Sir David's words of advice. Sadly, we, humans, really are the biggest and horrific monsters on this planet"}, {"id": 94, "text": "Here is a docu that's gets both sides of the argument totally correct. And by both sides I mean the problem and solution.On the way it brings a eye opener and emotions that will make you feel the highs, lows, and hopes.The only critique to this docu isn't even a bad one, just I wish he would have gone a little into the politics of it and why politics is playing such a large deal here, and hopefully open people's eyes into how to select the right politicians that have a interest in nature over only business."}, {"id": 95, "text": "If David Attenborough cannot convince climate change deniers, I do not know what will. It is a heartfelt call for action by a man who loves our planet and everything it has to offer."}, {"id": 96, "text": "It was beautiful and moving but also a terrifying visual of what we could all see in our life time. Please watch this and please do something to make the world a better place"}, {"id": 97, "text": "It all boils down to are we willing to live small so that our offsprings will live on? The current pandemic and the lockdown has taught me that it is possible to reduce our carbon and consumption foot prints. It is possible to live small and it is not a sacrifice when you do it with a purpose."}, {"id": 98, "text": "It tore me down and lifted me up. It made me lose hope and helped regaining it. It made me feel paralysed for a moment to make me want to become active now. Powerful film, powerful statement. Changing the way how human society works so we become more sustainable is not about saving the planet, it is about saving ourselves. It demonstrates how much we have damaged the world already. Things I knew before but chose to ignore. Just to then follow up and offer simple solutions, which make you realise that there is no more excuses for ignorance and passiveness."}, {"id": 99, "text": "Don't you love it when your 'grumpy negative' world view that has made you fairly unpopular with many of 'the general public' for about a decade now is shown to be shared by one of the most respected intellects of the modern age! ❤ Over population and the unchallenged 'right' to have large families, junk food and cheap produce etc at the expense of our health, quality of life and future has been an important concern of mine for some time. Now with lots of word of mouth and support I hope enough people can see this to the point where we can collectively all understand how important this world is, take the blinkers off our eyes, the fingers out of our ears and take back some power by doing our bit however small that is.. maybe we could even stop this machine of huge commerce (at the expense of everything else) and slow the profit down just enough to save our own species future..."}, {"id": 100, "text": "An important message for humanity to thrive. Quite possible if released in all languages one may get the wisdom to choose right and wrong. Long sustainable energy source and forests are the only option for us to survive."}, {"id": 101, "text": "Every human being living on planet Earth should watch this... it's a true eye opener."}, {"id": 102, "text": "David Attenborough, for DECADES (literally), has been the voice of both the natural world wonders and as well as it's alarm. Viewing his various series has moved me to travel to numerous places I might never have ventured to.The warnings he gives now, I take even more seriously than before and am helping (at least financially for now) various environmental organizations. I hope this is widely viewed and maybe even shown in schools.The message is too important."}, {"id": 103, "text": "Just watch it - absorb the reality &amp; do something to effect a change! NOW!!"}, {"id": 104, "text": "Everyone needs to see this. Through a combination of archive footage and glorious 4k photography, from the 1950s to the present, David Attenborough presents the wonder and beauty of nature on our planet whilst documenting the changes that have happened and a stark warning of the impending mass extinction, the tragic loss of species and wilderness, unless we act now."}, {"id": 105, "text": "Watching this made me wish I was much younger than I am, that I might have been able to do more. I wept for the loss of our natural world and more so for our children and beyond. Unless all of us do something meaningful I honestly feel, after watching this, we are lost. Sir David has more faith in human nature than I do, as ordinary individuals I believe we do want to change but big business and governments is where the problem lies. But I hope that many more will watch this and who knows, may be we can save ourselves. A great documentary"}, {"id": 106, "text": "What an incredibly important and devastating portrayal of the state of the natural world today. No other documentary, climate protest or news story gets the message across quite as clearly as this. It avoids being in any way preachy or depressingly dull. Instead this message is put forward against the backdrop of stunning and moving filmography as well as a powerful narrative that allows the viewer to see how our world has changed through each decade of the last century, and then a future-casting what direction we are heading in. The film ends hopefully, exploring the things that we are and could do to make a difference. Hugely impactful overall"}, {"id": 107, "text": "You want to stop the destruction of our natural world but don't mention the fact that 100 companies create 71% of the worlds emissions. Capitalism encourages the destruction of the natural world and the unregulated hoarding of resources. For me the change we need to see has to come from the top, and it's a shame David didn't pursue this argument more. That being said, everyone can and should do what they can to help, but it won't be enough if the most powerful in this world don't make the changes they need to."}, {"id": 108, "text": "Beautiful, moving, scary, but a story of hope. Everybody needs to watch and act on this."}, {"id": 109, "text": "David Attenborough's witness statement combines astonishing pictures (as in all his movies) with a vitally important message to all of humankind. To answer the question appearing before the credits, Who else needs to see it?: all 7.8 billion humans!The British legend of nature documentaries delivers a warning without ever being overly patronizing. In a simple and straightforward manner, he explains how we can save our future on this planet - and what catastrophes are yet to come if we don't.There is still hope. As Attenborough puts it: If we take care of nature, nature will take care of us.In order to take care of nature, we need to reconnect with it: We need to move from being apart from nature to becoming a part of nature once more.Because in the end, we won't be able to conquer nature anyway, or as Attenborough says: This is not about saving our planet, it's about saving ourselves. The truth is, with or without us, the natural world will rebuild!"}, {"id": 110, "text": "This piece of art made by people who care. Who care for Our Future. It is so well built, so well thought, step by step it opens up your whole perspective Literally about Life on Our Planet. I genuinely think that every human should watch that perfect film."}, {"id": 111, "text": "This show Us All how come the XX century change forever our suffered Planet, the time-lapse its genuine and truly scary... We All should watch it."}, {"id": 112, "text": "David Attenborough is my favorite person, if we only listen to his messages.. we live a better place"}, {"id": 113, "text": "Seeing this documentary brought me to tears. Its appalling what is happening and we are not doing anything about it other than make it worse."}, {"id": 114, "text": "'A Life On Our Planet' serves as essential viewing for all that call our planet home. David Attenborough offers us a chance at 'rewilding the world' before it's too late, but not before educating us on how far we've taken things from the way they should have been. Regardless of your stance on climate change or any other issue surrounding such debates, one simply cannot turn a blind eye to the in-depth, intricately crafted and phenomenally heartbreaking, and yet, inspiring testimony of Attenborough in this must see instalment."}, {"id": 115, "text": "Solutions are also shown and discussed. We need to take care of our planet before its too late."}, {"id": 116, "text": "I think everybody has to see this. Is very importent."}, {"id": 117, "text": "The Documentary Sir D. Attenborough shares with us, should be mandatory for every human being since it shows us in a very beautiful, frightening and blunt into which direction we as humanity are currently steering to.This said, we as humanity need to finally realize, we all have a voice, we all have an impact and we all would like to live on a planet that is not struggling and trying to get rid of us, I believe everyone wants to live on this beautiful planet we call home without fearing to extinct ourselves. I truly wish that each and everyone on this planet comes to this understanding that we need to stop self destructing us.Let us dream of a whole planet, let us find a way back to this beautiful planet."}, {"id": 118, "text": "Must see for everyone. We control what future holds for us, by our own decisions and by the politicians we elect."}, {"id": 119, "text": "Like his other documentaries, this is insightful and beautiful to watch."}, {"id": 120, "text": "A must see film for everyone on our planet. I've never given a movie the highest rating, but the message of this documentary is so important and moreover, this is the world famous David Attenborough, who (at age 93) can still tell a powerful story. And of course the images are beautiful, certainly alternated with the images of a young David."}, {"id": 121, "text": "This film documentary needs to be shown in every school in the world. David Attenborough is the most inspirational and watchable personality in the world. The world needs to take note of his wise worlds."}, {"id": 122, "text": "David Attenborough is absolutely correct, but unless humans realize they are not the most important species this process will never stop. You need to castrate a lot of people from third world countries to do anything about this. everything on this planet are valued after availabilty.. except humans... That is worng. considering the amount of humans our value is not very high unless you actually do anything good for our planet."}, {"id": 123, "text": "Watching this documentary, his witness statement, sent shivers down my spine as I realized how close humanity is to the edge of their existence.I have little words but only deep appreciation for Sir David Attenborough, his life is something I could only dream of experiencing but as he said, it's up to us to make sure that the Natural World he experienced first hand in his life was not just a momentary illusion.The Pale Blue Dot will be the home of humanity for centuries to come if we make the right choices, I'm sure of it!"}, {"id": 124, "text": "David, thank you Sir for your lifetime commitment to wild life and our life. Yes it's about saving ourselves not just about saving the planet. It was a privilege and honor to watch and learn from you! I highly recommend to see this documentary."}, {"id": 125, "text": "Great to see some clear direction on what we as a species need to do to survive and thrive - let's hope that governments and (future) world leaders take note!"}, {"id": 126, "text": "Attenborough tells the truth about our species impact on the planet. Humanity is destroying biodiversity that is essential to all life."}, {"id": 127, "text": "This is a must see for all that live on planet Earth."}, {"id": 128, "text": "IN AWE! Tell EVERYONE you know about this film and let's work together. THANK YOU THANK YOU THANK YOU Attenborough!!!!!!"}, {"id": 129, "text": "I think it can go without being said that Sir David Attenborough is not just a national, but an international treasure. Beloved by millions, he has been the voice of the planet for multiple generations across the planet. So when he says, at 94 years old, that this is his witness statement and cry for people to act, then we owe the man who has given his life to bringing the greatness of our world into our living rooms, to do something about it.Show this to your kids, parents, family and friends. Show it to your boss, your employees and urge your politicians to watch it. Commit to the steps Sir Attenborough is asking the world to take...now, before it's too late."}, {"id": 130, "text": "The remarkable tale of a remarkable man, with the most important message you'll ever hear. Everyone should watch this."}, {"id": 131, "text": "Everyone must see it, especially governors of all countries. We must change our way of life because there is no another world for live in it."}, {"id": 132, "text": "Stating perfectly explained facts on the current situation this planet has found itself. Also shows the most logical approach for the future on how to fix things as a species to preserve... humans. Eye opening documentary that could catalyze a turning point. 'The living world will endure, we humans cannot presume the same.'"}, {"id": 133, "text": "Must see, must act. Save the human race. The planet will survive"}, {"id": 134, "text": "Human population need to slow down. It has never been said more eloquent than here. And never rang more true."}, {"id": 135, "text": "In this documentary, David Attenborough makes the cause of rapid climate change of the recent century exceptionally clear. Human population growth has seen growth rates like never before, and many people are unaware of how this growth has negatively affected our planet. I, too, was unaware until watching this documentary. This is why this movie is at the top of my list of recommendations to any person who wants to become educated on climate change. Anything from why it occurs, One of the main reasons why I found this documentary so compelling was that Attenborough uses undeniable evidence to show that humans are the cause of an overworked planet. This masterful camera shots, numerical evidence, and scientific data all support a narrative that becomes increasingly clear as the documentary continues.Another way that he presents his case is through by presenting the negative effects that are already prevalent on our planet. The rising sea level and temperature has come at a cost that is rapidly reaching a point of no return. Should we reach that point, living on Earth would become increasingly difficult as sea levels rise and temperatures continue to rise at a steady rate. One numerical way that Attenborough provides evidence to support his claim is by pointing out the stark decline in biodiversity as human population growth reached exponential levels. The loss of biodiversity negatively affects us because it harms our relationships with the planet. It changes the rhythm of the seasons and the change of resources between the living and the nonliving. Attenborough's goal is to create a mutualistic relationship with the planet that we exist on before we reach a point of which our very existence cannot be supported by our planet any longer.What makes this documentary exponential is also the fact that Attenborough shows that he has committed his life towards these pressing problems, but his main message is that there is still a large amount of work to be done. He points out large scale habitat destruction, carbon emissions, and a rapid decline of our natural resources. With the most masterful shots that I have ever seen, he showed habitat destruction, ice glaciers decreasing, coral bleaching due to rising sea temperatures. It becomes necessary for us as the human species to help build a sustainable future for the generations that will come after us. Attenborough continuously makes it clear that the problems that we are faced with are problems that we can all work towards helping. In a single documentary, we point out the work that needs to be done in order to build a greener future.I would recommend this to any person that has the time to watch this eye opening piece of work that Attenborough has helped to create. Anybody who watches this documentary has the potential to learn many things about their impact on their planet, and how changes to their everyday lives can leave a lasting and meaningful impact towards the planet that has already provided humans with so much. It is clear that Attenborough is pushing for a future in which we work with nature and not against it."}, {"id": 136, "text": "We are to digest, but I'm not sure if we will able to, as a species. Thank you Sir for your lifetime conclusive story. You've delivered the message, and that's all you can do. Should be required viewing in every elementary school program. At least some children can pick up.I fear that we that will have to learn the harsh way. Maybe WW3 purge, with much sufferings we inflict against one another to fight for food and resources. Or to prevent that, Nature releases other means, like Covid and beyond to contain. She says, you've killed my many other children. Stop it, or you'll be culled."}, {"id": 137, "text": "I am so very happy that Sir Attenborough decided to give us this look into his years, and a warning about the future. I find it quite amazing and sad that we human beings haven't begun to consider the problems we've been warned about since the early 60's. It's like falling from an enormously high cliff but disregarding the approaching base."}, {"id": 138, "text": "Nothing better than a person whom's life was about exploring up close the wild. This person that saw everything beautiful, from first sigh, in his early years and pin point what has gone wrong in time so that he won't let careless people look away and spread awarness is just amazing. It's good that there are exaples of people that already take actions. Just amazing!"}, {"id": 139, "text": "Give this a watch, it is extremely eye opening! I have watched every documentary he has been it and reccomend them all."}, {"id": 140, "text": "Wow! I just have finished seeing this marvelous movie and I was stunned by its quality and thrill. Besides the fact that the movie is about wild nature, one of my favorite topics of all, and Nature's photographs were filmed in the most amazing way, the film was brought by the narrator David Attenborough who was doing a wonderful job. After watching his amazing series by the name of Our Planet (which is also got highly rated on IMDB), I realized that he isn't just telling us a story that read from a script, but that wild nature and the amazing treasures that it contains it's basically his life enterprise. The film tells us that nature is very essential to humankind but also in great danger and if we won't do anything to stop the destruction of our world, then humanity will finally become extinct. enjoy watching!!!"}, {"id": 141, "text": "This man is a living legend. Everyone on earth must watch this. David Attenborough should be a world leader. He probably has a solution for coronavirus."}, {"id": 142, "text": "Such an eye opnening documentary. Everyone needs to see it and act together! thanks for sharing with us your great experiences and thoughts Sir David!"}, {"id": 143, "text": "It's staring us in the face, for the sake of our kids &amp; our kids kids we need to wake up &amp; respect our planet. Nobody, literally nobody can outline that message more so than David Attenborough &amp; deliver a resounding call to arms to everybody. The answers are there we all just need to play our part. A must watch, spread the word...."}, {"id": 144, "text": "David Attenborough is truly a legend and this documentary is his witness statement of a grave crime committed by all of us. How we have wasted and destroyed the beautiful and bountiful nature we inherited. It is absolutely horrible. And yet, he is not pessimist. He shows things being done right now around the world that have helped reverse the damage caused by us. And if we can implement such strategies on a global scale, there is an even better future ahead of us, one in which we thrive, sustain and improve our standard of living by working WITH nature instead of going against it. BUT time is running out. It will require determination, global coalition and shedding of the hubris that we can tame the nature for our purposes and not suffer any consequences. Because one way or the other, nature will bounce back as it always has, with or without us being a part of it."}, {"id": 145, "text": "Governments all around the world must include documentaries like this in educational curriculum for younger minds.In this busy modern era, young generation will not be interested to watch a documentary. Which is why it should our responsibility to make sure that next gen is aware of the doom path we are currently on.Ignorance is not always bliss but sometimes a catastrophe."}, {"id": 146, "text": "Such a masterpiece, but on the other side it's heartbreaking to watch what we did to this planet in just a 100 miserable years in comparison to 4.6 billion years that it existed."}, {"id": 147, "text": "A masterpiece! Made me cry and motivated me right after. Amazing documentary that I recommend to everybody."}, {"id": 148, "text": "One of the best documented representations of the ecological issues our world faces. Perfect depiction of the urgency and how our planet current systems are in need of change. Highly recommend and must see."}, {"id": 149, "text": "I wish this film becomes a part of the school/college curriculum across the world."}, {"id": 150, "text": "With just a few exceptions, almost each and every human is living in its own bottle, with the cork on, without knowing the smallest thing about the bottle or about that cork - therefore, as a direct consequence, this kind of movies (informations) are amazing, interesting, and like this... or like that... just for a few more minutes after they are learned, otherwise everything will remain the same, and we will let nature to be our true teacher, and when the time will come nature will teach us in ways that we could not have imagined not even in the most post apocalyptic movies. We are not yet human beings but we are still the children of the biological evolution..., to put it in an elegant expression...!!"}, {"id": 151, "text": "This is another Attenborough classic. How does he still possess so much drive and care for a world he will only see another few years of. He is clearly so devoted to this lifelong passion and love of his, to the point past selfishness. Here is a man who is well into what should have been his nice retirement of the last twenty years at least, but he is still trying with all that he can to drive home the message that we need to make a change. David Attenborough is one of the greatest humans of the 21st Century."}, {"id": 152, "text": "A rousing portrait of the atrocities committed by mankind against nature over the past decades. Tells about the greatest nature and wildlife filmmaker of our time based on the exciting life. Sir David Attenborough, now 94 years old, has traveled the world as much as few other people before him. At a time when the world still seemed all right. A great documentary. In the chronologically structured documentary, Attenborough reports on the world he got to know during his time as a long-time TV reporter - and how it has developed over the decades. Very few should be surprising: Unfortunately, nothing has changed for the better."}, {"id": 153, "text": "This documentary is overall impressive and eye opening but it didn't mention animal agriculture as leading cause of rain forest destruction. Instead only palm oil is mentioned.It's absolutely necessary to switch to a plant- based diet for the future of our species on this planet."}, {"id": 154, "text": "This is the sort of documentary that should be shown at every school in every country, talked about for years to come.Hopefully we are not to late to save our world."}, {"id": 155, "text": "From the very beginning, Attenborough declares that this film is his witness testimony - a direct testimony. In an extremely emotional request, he makes us see the world through the eyes of someone who has cared for it for almost 100 years and wants us to take care of the planet we're devastating after his departure. Life on our planet is both a love story, a requiem, and a final request, like a movie about deforestation, overfishing, soaring population and various other culprits that led to the ecological crisis that we all live in today. If you're fed up with the hopelessness of other documentaries about the various atrocities we did to the Holocene, perhaps this personal touch will force most of us to act before it'll be too late."}, {"id": 156, "text": "The whole world needs to see this. David Attenborough has truly outdone himself."}, {"id": 157, "text": "Sobering insight into how we must help our planet and ourselves before its too late. Love the positive and optimistic ideas towards the end. This man is amazing!"}, {"id": 158, "text": "Can a human being make more of his life than David Attenborough? This is a frank, accurate and emotional account of what humans have done to our planet. At the age of 94 he is fulfilling his responsibility to the natural world that he has studied throughout his life. He is the greatest human ever."}, {"id": 159, "text": "Precise and comprehensive, with breath taking documentings. Sometimes exciting sometimes terrifying but most of all important and awakening. A most see film for everyone!"}, {"id": 160, "text": "We must share this movie as much as possible with our friends and family. Everyone must understand the seriousness of the situation and start acting. These documentaries really touch my soul."}, {"id": 161, "text": "It is to inspire young people to protect the Environment and Biodiversity.."}, {"id": 162, "text": "The reason I gave this documentary a 10/10 is because it is one of the few films that is a direct call to action to save the planet as we know it. Sir David Attenborough recognizes the greatest threat mankind has ever faced, and he is advocating for a change in human lifestyle to change the world.However, I do not fully agree with the methods he proposed to save the world. More drastic measures than the ones he proposes must be implemented. At the current human population, we cannot sustain life on Earth. It is going to take much more than a shift in our farming and energy production practices to save the natural world. With all that being said, what Sir David Attenborough recommends is an excellent start to shifting the human consciousness, which is fundamental to bring humanity together to save the world."}, {"id": 163, "text": "I knew before watching this documentary that climate change was real, and it was impacting our day to day life already. However, I didn't have the fundamental knowledge to answer some of my burning questions like how much have we humans contributed to it? what are the man made factors which are contributing to it? and what can we do to prevent it?Attenborough breaks down the answers to these questions, and much more, in small stories throughout the whole documentary and keeping the main message alive.Worth a watch if you get confused by the numbers and the science."}, {"id": 164, "text": "The statement he isn't talking about saving the planet, but saving humans on the planet sums it up."}, {"id": 165, "text": "Other than human error we all need to stop ignoring and hoping for someone else to bring a change and start the change ourselves,Thank you David for this educative Documentary"}, {"id": 166, "text": "Unfortunately the (over)population argument is unnecessarily emphasized if not a misleading simplification, distracting from grave societal problems encouraging disastrous environmental exploitation today."}, {"id": 167, "text": "With out doubt a horror show of mans nature. In such a small span of time we have decimated our planet. Our total disregard for nature because of what's shown in this film and what science has been doing to disgrace the natural order (cloning, covid,transgender),should and will lead to our over due extinction. The world knows but will continue to desecrate the planet and kill everything living on it. I feel sir David's pain."}, {"id": 168, "text": "Sir D A gives his valid ultimatum of humanity and what we have ignored due to money greed. He has show cased nature and warned us for decades of human destruction. Love this ultimate deep harsh words of human reality. This modern day film needs to join George Orwell's Animal Farm literature/digital in schools across the globe. Unfortunately Human egoism has absolutely no hope and he knows this. Challenging the globe to change for the better."}, {"id": 169, "text": "A wonderful treatise on the inextricable connection between humankind and nature...Attenborough's magnum opus. Beautifully filmed and written...a love letter to Mother Earth."}, {"id": 170, "text": "Fantastic, stunning, awesome, and thought-provoking"}, {"id": 171, "text": "Its a love letter from david, with a single clear message. nowadays the whole global warming and friends is kinda pushed down your throat, and this ducu cetainly fits that niece. But is doesnt come off as too preachy, and with david, who cant take it serious? but nothing really blew my socks off, or was something i dint already know.6/10: good but not groundbreaking"}, {"id": 172, "text": "Thank you David Attenborough for his harvest and reflection. Everyone on earth should watch this documentary if they have the opportunity. Please use your wisdom to protect our earth and our generation."}, {"id": 173, "text": "Whilst BBC Earth spent years for new rare clip but Netflix just milking the cow out of David with repeated footages and scripts. All the hype made for this 1 hour 23 min episode still can't beat 10 minutes of BBC Earth narrated by Mr. Attenborough. Plus no Zimmer."}, {"id": 174, "text": "I was a bit disappointed with this, as it really looked like it was going to be a documentary about Attenborough's career. It's actually more to do with the human race's impact on nature, specifically using his lifespan as a starting point to show the difference we have made on the earth since he was born. It's still interesting, just like all his wildlife documentaries, and a lot of good points are effectively made, but I was really looking forward to the detailed story of his life"}, {"id": 175, "text": "I truly respect and love sir Attenborough. First half of the movie was excellent. Second was not. Lecturing on obvious things and ignoring politics is ridiculous. Live by your means dear dutch, english or mumbaican and don't ask for Brasil, Ukraine or Norway to feed you. And yes we have short intestines, canine teeth and large brains. Eat brocoli and see what happened to some unfortunate castaway people in the last 3 millennia India."}, {"id": 176, "text": "David Attenborough: A Life on Our Planet is a worrying overview of a planet in decline. He concludes that to save and restore the planet we need 1) fewer ppl, and 2) more trees (really!) Attenborough and Moore's Planet Human are interesting to compare. The first doesn't mention politics, and the second exposes the failure of politics. Both want immediate action, but who's taking the lead?"}, {"id": 177, "text": "There's not much new here but it is surely very well made."}, {"id": 178, "text": "I can take to heart, the anecdotal testimony of a 93 year old man, who has travelled this earth more than most of us have. David puts forth his opinion on what he needs us to change, to save The Wild, and perhaps humanity.He only gets political when he advocates his solutions, but he refrains from being overtly partisan, which is refreshing, compared to the usual nature documentaries. He focuses on the beauty of the natural world and the changes that he has personally seen.I will nod to David, and also, not get partisan in this review.It is a beautiful documentary, and I don't think there is anyone that wouldn't enjoy it."}, {"id": 179, "text": "This was one good documentry what reavealed many truths that people are still not ready to hear them,but they must or we wont be on this planet for much longer and it teaches us how we need to restart nature from beginning and let it breath with full life cause if we do that all creatures on this planet could leave in harmony and sharing world between us.when we talk about quality of this project i must say that it is very good and it had a lot of strong messages and lessons in it,but i wont lie i already know about this staff and how climatic changes are big problem,so tehniacly i didnt learn nothing new,but still this was a good documentry"}, {"id": 180, "text": "Thank you, Sir David Attenborough 10/10, for humanity not so much, STill surviving \\o7"}, {"id": 181, "text": "A must see for all. It's eye opening what we are doing to our planet and makes me sad.Well narrated as usual. Amazing imagery too as you can come to expect from anything David Attenborough puts his name to.I hope people can watch and try and make our planet better in some small way... if we all do something small together maybe we can make a big change."}, {"id": 182, "text": "I've always known the message this film pushes, I've known its the most crucial thing that currently or has ever existed, I know that people are eager to enable it to happen, but I also know at this rate it never will.Watching this made me cry. Not because it enlightened me to the reality of the issue but because it reminded me of the barbaric reality that is humanity. I want more than anything in the world for people to work solely on this issue to come as close to a solution as possible, and I Know writing this won't change anything. I'm not writing it for you. I'm writing it for me. From here forward I will be working to become a environmental engineer to perhaps come closer to the solution. and I know I'm just one person but as David Attenborough has demonstrated, as he has influenced me, it only takes one person to change the way another preserves or interacts with the environment creating a chain reaction that might just save what enables not only humans but EVERYTHING to exist."}, {"id": 183, "text": "David Attenborough, one of very few you can hold in as high regard as Gandhi or MLK, calmly and clearly enunciates his experiences throughout his 94 years, bearing witness to the carnage, the chaos and the destruction wrought by the populations of this world on the oceans, the landscapes and all the lifeforms we inhabit and share our planet with. He presents us with a pathway to recovery, a way to repair, to make amends. No histrionics or melodrama, a simple message, of learning a lesson, of reparation and recovery, of sustainability, longevity and perpetuity.If, like most, it's a story and message you're familiar with, make today the first day of the rest or your life - go for it, start making the changes the future yous need you to make, to save their world, the flora and fauna, from the imminency of self inflicted mass extinction, holocaust, genocide and Armageddon. Make today the day that you decide to change your world and, by doing so, help to re-establish and rebalance the scales of nature that have been so biased and skewed by the sinister and greedy enterprises of fossil fuels, inorganic mammal and poultry production, these manufacturers and machines of chaos - make a difference today, make a difference tomorrow but above all make a difference while you still have the chance to make that difference, and a chance to make that difference count!"}, {"id": 184, "text": "I went to see this at my local cinema on Monday 28th of September the only day this movie was being shown in theatres (but is getting released on Netflix on October 4th) and it was breath taking, frightening but also beautiful as I knew it would be and more! I seriously wholeheartedly hope most people on this planet will watch this documentary and especially world leaders and government officials! Not to mention this documentary is just Incredibly educating and should be shown in schools eventually. There is zero excuse not to see this movie. ZERO! This is a MUST watch for everyone. Because we all call Earth our home and there is NO Planet B for us! There is NO denying the scientific evidence and vitally Important message this movie gives. If you deny it you are a stupid non intelligent human being who should NOT be allowed to be in charge and make big decisions on anything period! Wild Biodiversity MUST be protected at all costs for the future of humanity on Earth because by protecting it we protect ourselves as well as countless other wild animals and plants that we share this planet with!!! Please watch David Attenborough: A Life On Our Planet. I Implore everyone to!"}, {"id": 185, "text": "I just returned from the premiere of David Attenborough: A Life on Our Planet, a documentary in which the man himself talks about how he witnessed many drastic changes that happened in our world during a single lifetime. As I was watching it, I often felt the need to look away, even though I knew that I would be closing my eyes to the harsh truth of our planet's decay if I did. My advice? Do not look away from this documentary for a second. It will show you seemingly irreversible damage done to this earth, but give you specific hope that'll make sure not all will be lost. It will show you that everything that has been destroyed can be rebuilt. My personal favorite part is where he shows us that this is not about saving our planet: it's about saving ourselves. Because if humanity perishes due to its own errors, life will start anew anyway. It's all about the legacy we leave behind that will determine whether our species becomes extinct... or gets to live another century to see the world rise from the ashes we created.All in all, a convincing documentary, not with necessarily lots of new visual content, but rather an incredibly moving, personal story beautifully tied together with video footage and fantastic music."}, {"id": 186, "text": "This is David Attenborough most personal and most hard hitting documentary to date!Rather than focusing on just the natural wonders of the world, the legendary presenter reflects on his career and highlights how the environment and natural world has changed during its course.The impact of his stern words are heightened when you see the facts that support what he is saying. However at many points whilst what he is saying and explaining is quite frankly horrifying, it's not all doom and gloom.In his unique way, he outlines some of the routes we can take to reverse the damage mankind doing, and return the natural world to a balanced and abundant position, which is nothing if not motivating / uplifting.As he mentions, this is his witness statement, and never had a message from someone so important been so needed.As he explains we have ravaged the natural world with impunity, but in order to save ourselves, we need to address and restore the naturals worlds balance.Hopefully many people will be as inspired and awakened as I was when watching this."}, {"id": 187, "text": "The thing that makes this documentary so inspiring is that it is not a lecture. Sir David Attenborough demonstrates through his wealth of experience over the years, the chronology of the decline of the natural world without preaching to us. The beautiful imagery accumulated over 50 years of natural history film-making coupled with a considered, poignant and practical analysis of where we were/are and want to be offers stark warnings, certainly, but also scope for hope and optimism too if only we can get a grip. His manner is affable and authoritative, he is the teacher every one of would have loved to have had - and perhaps, had we, things wouldn't look quite so ominous! The photography - particularly the archive - is gorgeous to look at and underscores perfectly the points he is making, and the global perspective he takes gives this a currency far and away more valuable and penetrating than any politically driven assessment. It's a wonderful film that everyone ought to see. It also serves as a fitting testament to the visionary people at the BBC (often together with WGBH) who created these documentaries over many, many years - providing an essential spine for this narrative, but also so much of my own understanding of how the planet works. It is a shame that the BBC is now heading for a similar extinction level event; with - sadly - very few ready to take up the cudgels on it's behalf."}, {"id": 188, "text": "David Attenborough: A Life on Our Planet is a Documentary - Biography movie in which we follow David Attenborough through his adventures and his observations around the world. He travels us in the world he watched all these years and presents the changes that occurred since then.I liked this documentary very much and I believe that everyone has to watch it, I highly recommend it to everyone. In this documentary David Attenborough presents us some moments of his previous documentaries from his start until today. In this way it's easier for us to truly understand how much the environment has changed and how much was human's influence on it. Even if you have already watched some others documentaries of David Attenborough like Planet Earth, Planet Earth II, The Blue Planet, Blue Planet II, Frozen Planet or Our Planet, I am absolutely sure that you will be amazed by this one because it's a big surprise and it's more than you expect. Finally, I will use two phrases of David Attenborough because I found them very interesting, important and I believe that it's food for thought for everyone of us: 1) We require more than intelligence to survive, we require wisdom... and 2) If we take care of nature, nature will take care of us...."}, {"id": 189, "text": "This film is my witness statement. This opening quote hit me hard, as it should you, if you enjoy the rare moment of living on this planet right now... David Attenborough intentionally breaks the fourth wall from his decades of documentaries to record (and express) his emotions, ideas, inspirations, and possible future to help guide us, instead of simply educating us, on what (still) exists on this planet (our shared singular planet) currently in our collective lifetimes. It is not absent of deep emotion, wise reflection, and determined concerns without presenting an archival presentation of what is still possible to pull us all from the brink he had personally witnessed in his lifetime. With a currently living 101 year-old grandfather, this kept my attention and drew my focus to every word of wisdom he had to share (just as I have, personally with my inevitably aging grandfather) whilst still able to share it with us all - with a hope of sharing wisdom behind our own age. These are rare moments to be thankful to be able to listen to our living elders while they are still alive: to relay and share their wisdom. Pure and simple, deep and complex."}, {"id": 190, "text": "The fact that this documentary has gotten so many positive reviews highlights the shift that is already underway in human awareness about our place on this planet and the changes we must make if we are to survive.I am in my late thirties and David Attenborough has always been the number one nature guy on TV for as long as I can remember. His voice is, after all these years, EXACTLY the same!!! Best. Voice. Ever.Stunning shots in this doco of rainforests, oceans, wildlife, etc from the vast library of David's work. He's chosen some thoughtful metaphors to convey the message and does so in an easy to understand way.I know a lot of people found this documentary depressing and I did cry in one part. But on the whole, I think this documentary is a profound piece of media. The world is finally ready to hear this message. And the fact David has brought his life's work together into such a powerful message is both heart wrenching and beautiful. Thank you, sir David!"}, {"id": 191, "text": "A important movie to watch. Let's all change for the greater good! I got the message. Incredible images of a fantastic planet, I call home. I know you do too.I have been a great fan of this man since I was a kid. Seen him on TV as long as I can remember. His voice, burned into my brain forever. What a great man, what a legend. What great experiences he shared with us, and still do.I am not one to be a fanatic, I will never stop eating meat and I will not be chaining myself to trees in the jungle. But, I am not too greedy or naive. I understand that we as a race, need to change our ways. We need to stand united and care more about our children's future, then our own wealth right now. But it's politics basically, some people or companies will not let go of their power and money. How can we change, when the big boys won't let us change? I have learned that if you want to teach a child, person or an animal to both behave and change, you'll need to take something away from them, or remove an option for them. Then, and only then will you get the change you are seeking in creating. But as being a smart grownup, how can we just sit and watch our planet being drained to extinction?I recycle, I don't throw stuff into nature. I leave the forest as I entered it. But still, I see plastic and other things, just thrown away around in the forest. Luckily we all know someone who cares enough to pick it up and recycle it. We need more people to do the same. We need everybody to do it. I wonder if we'll ever get to experience that. We need to share our wealth, to gain more wealth in the future. One for all and all for one.10/10 (How can I give anything less?!)"}, {"id": 192, "text": "David Attenborough presents here what sort of feels like it could be his equivalent to David Bowie's Blackstar. Much of the documentary is Attenborough reflecting on his past, and being self-aware of the fact that his time left on this planet is limited. It's a sad thought, but he seems determined to keep warning us about the direction that our planet is going, until his life's end.While this is a well constructed and important documentary, I do have a couple of more complicated thoughts on it. The first is the timing of its release. For a lot of people who don't concern themselves as much as they should with the environment, there is no way they are going to pay attention to this right now. Have you seen how much else is going on in the news?? I know the survival of our planet is more important that just about anything else, but neither the media nor the general public are logical when it comes to what they should pay the most attention to. It's good that the filmmakers made this short and digestible, and that Netflix seems to be promoting it pretty well, so I hope it can reach a decent audience... but I'm not hopeful, unfortunately.Then there is the matter of it retreading themes explored in Attenborough's most recent series, and in some instances, reusing footage. This is a minor point though, because what is being talked about is still relevant, the way it presents these ideas whilst also covering Attenborough's life story is interesting, and some of the same stuff still hits really hard (the sight of those walruses falling off the cliff is still unbearably sad to look at).So: it's not 100% original. And it's at no fault of Attenborough's, but I feel like the timing of the release may make it fade into the background for many potential viewers. But since its themes are still relevant, and since I could hopefully be wrong about this not getting enough attention, I can't it good conscience mark it down too harshly. The narrative is still strong, Attenborough is as great and interesting a presenter as always, and it covers a lot in less than an hour and a half. While I'll always be skeptical that a well-made climate change documentary can sway those who truly don't care, I'll remain hopeful that this one might still have an impact (hell, I watched An Inconvenient Truth a decade after its release, and it changed many of my personal behaviours and beliefs).And sure, this is largely 83 minutes of David Attenborough lecturing you about the planet's future, but he's earned the right to lecture anyone he wants about anything on the planet, dammit!"}, {"id": 193, "text": "My personal love for nature and it's ongoing crisis around the globe continues to motivate me to spread the message of hope just as Sir David Attenborough still does. It's only when you see the vast lands, the beautiful species on land and within, that you get a deeper appreciation of what exists on our planet. And he has shown us marvelously with his experience that it's now time to wake up, it's time to act and now is the time to not just save our planet but ourselves from our inevitable doom. It's quite simple to watch such eye opening documentaries and turn a blind eye. But to make sure you do something about it to make an individual change is what truly matters. It's as simple as spreading the message that we need to do better, we NEED to become better in order to survive. We NEED to rebuild on ourselves and put out our bets energy into the life that gave US life. It still does given out irresponsible actions towards diet, transport and lifestyle. We need to rewire our brains and our lifestyles to acknowledge the fact that there's more to life than what we percieve it to be. If we didn't eat meat for 2 days in a week, we're not going to die. If we survive in plant based diet, we can assure ourselves that we do not need what's been shown to us that we actually need. Capitalism will ruin not only the basic humane and moral life of ours but in turn will take our planet away from what it once was. The only way that it can thrive is with renewable and sustainable ideas. With Sir David Attenborough's and along with the entire globe's effort, we can truly imagine the life we can live in the coming years. Ah, what a sight! Let's start making a change, for even the smallest one can spread throughout the globe for a better world to live. A beautiful documentary indeed, and an exclaiming reminder that shows the horrid possibilities if we don't act soon as a collective."}, {"id": 194, "text": "According to Sir David, our planet's health check reveals the following: loss of biodiversity, deforestation, reliance on fossil fuel, over-farming, over-fishing, climate change.According to Sir David, these are what we must do to prevent total collapse of ecosystems and human civilisation: restore biodiversity, halt deforestation, shift to renewable energy, sustainable farming, sustainable fishing, halt climate change.He gives examples from various parts of the world: replanting native trees in Costa Rica, smart agriculture in the Netherlands, harvesting solar energy in Morocco, the UN's no-fishing zones. Restoring our planet's balance is as simple as ABC.But is it? It only works if all nations take part. What are the chances of that? What would he say to the Middle Eastern countries whose main export is fossil fuel, to Malaysia and Indonesia who rely on their oil palm plantations, to Brazil which has the Amazon rainforest also known as the biggest timber reserve known to humankind? And peculiarly poaching has been left out. How do we convince people in certain parts of the world not to kill endangered animals?The world's resources are finite but so is the human lifespan. Until we address self-interest which is the real impediment to saving the planet, countries will act according to their national interests, companies will only be concerned about their profit and individuals will remain slaves to consumerism. What incentive is there when most of us will probably not be around to experience the worst case scenario?As the recovery of environment during the current COVID-19 pandemic demonstrates, it will take no less than a worldwide shift towards personal responsibility and ethical behaviour. Frankly, anyone who lauds this documentary is hypocritical if they are not prepared to take fewer overseas vacations, downsize their McMansions, drive energy-efficient vehicles, reduce their meat consumption and material possessions."}, {"id": 195, "text": "Let me say first, I LOVE David Attenborough, and I love that he fights for nature and wants to make a point even at his rip golden age of 90+. The footage he shows is brilliant and mostly new (due to being on Netflix I suppose). The biggest flaw in this new installment of let's save the planet is that his view on how humans will turn the corner and not face extinction is entirely flawed.First we start with slashing forests down for more cattle and coffee plantations - that's not going to stop. Costa Rica is a bad example and even if they were a great example, Brazil will never stop it, Indonesia will never stop it, they prefer to grow tobacco instead of having some useless trees. In the end, the government wants money, the people want to earn money, not look at trees and live like hippies around them. Which is actually the problem with most of David's ideas - the governments, the corporations, they will not follow! Nature can recover, we've seen that not only in Costa Rica but also in Malaysia where they created a fake rainforest to see if it would turn out the same, and I don't need to go to Chernobyl 40 years after the disaster to check if nature takes back the space - I can see that in my garden after just half a year of neglect. Mr. Attenborough, nobody wants to go to Chernobyl because it's radioactive, but you cannot assume that people would leave alone free land in e.g. Oregon, for nature to grow a forest if it could be used for agriculture or new housing developments instead. That's not how our society works.Fishing is the WORST solution he provided, enabling no-fish zones to provide spill-over to fishing. The example he made was PALAU of all places. Fact is that Palau receives almost all of their food from the US - Hawaii if I'm not mistaken - by boat. Once the boat didn't come for a month and they all didn't have vegetables for that time period. The locals all live on welfare rather than farming on their own and they all burn their trash to cause more harm to the environment. The fisherman in the documentary throws a tiny net out to catch his fish - that's not the problem anyway - it's a huge Chinese vessel coming along, ignoring any kind of no-fish zones (Palau, Tonga, Galapagos, Antarctica just to name a FEW examples, they are everywhere and will NOT stop!) and the poor fish are all gone. You cannot have this working if rogue nations like China and to many extend Japan just fish whatever and wherever they want.Overpopulation, Mr. Attenborough, may peak soon but that's not because of society educating young women or family planning - it will be because there is no food, no space, no health care system to care for all of it. His example, a horrible one again, is that Japan stopped having babies! Well, that's their attitude, a lot of women work and don't want children, true, but they are also facing a disaster of no young generation to fill the gaps in the pyramid. Is every nation going to be like Japan? No, Europe has parts of their populating declining but that's mainly because of family planning and understanding that you don't want to have 3-4-5 children anymore. China's controversial one-child policy may actually have worked to level the population growth but I suppose nobody wants to talk about that. Does the rest of the world follow? No. India, Pakistan, Bangladesh, they still have a huge amount of kids. Religious believes, no access to family planning, contribute to an oncoming disaster. Let's face it, the Catholic Church banning contraceptives is medieval.The elephant in the room is that politics and corporate greed will always destroy our planet rather than individuals. We can recycle our trash as much as we want but BP oil spills are worst than us not having recycled our entire life. Brazil says they cannot control the Amazon burning down - I'm sure the plantation owners are happy to see new land becoming available for more cattle that make your burgers (which is horrible again because cows cause more harm to the environment than humans due to constantly belching methane, so do your part and switch to chicken meat).Lastly, people are selfish and greedy too - let's not lie about it. Maybe you personally reading this are a kind soul, bless you, but there are enough individuals who seek opportunities to gain money, spread their seeds, exploit nature if necessary. That's going to take a lot of effort, and David is maybe trying to reach us for this point but I think he definitely failed in his approach. New York will be cleaner when we switch to renewable energy? Let's hope so!"}, {"id": 196, "text": "We need to 're-wild' the world. Richard AttenboroughAttenborough, a natural historian, has been chronicling the changes in our natural habitat for most of his 94 years, so his A Life on Our Planet documentary is a fitting capstone that summarizes his vision for sustainability as the answer to saving the planet. His narration is soothing, his demeanor avuncular, and his message simple: We can prolong a healthy world if we become a part of nature, not apart from it.Some of the pleasant footage comes from the nine series of the BBC's Life collection: Life on Earth, The Living Planet, The Trials of Life, Life in the Freezer, The Private Life of Plants, The Life of Birds, The Life of Mammals, Life in the Undergrowth, and Life in Cold Blood. His approach is quiet reasoning as he takes us from the teeming wilds of the early 20th century to the current dangers of overpopulation, excess carbon dioxide in the atmosphere, and the dramatically reduced wild earth left.A short 83 minutes, A Life soothingly shows how we have encroached on nature, but it brings hope that we can save the planet by reasonable activity. Attenborough's mission statemen is one of the best, most helpful, and most entertaining documentaries you will ever see.You'll wish he were your uncle. You'll wish we would listen to him. You'll rejoice that someone has found the answer to our survival. And you'll be happy it's not about the election and the pandemic, yet they are not far from his advice for survival."}, {"id": 197, "text": "The movie could've made a more powerful impact, both emotionally and logically. There was very little visualization involved - I only remember the decrease in forested area of Borneo being shown; most of it was Attenborough's narration. Emotionally, there was the polar bear swimming in the ocean (great), but it was unclear why exactly the walruses were falling off cliffs. Overall, I felt the documentary didn't explain why biodiversity in particular is what we need. Why not replant with the trees most efficient at carbon capture for example, or those that grow the fastest, such as bamboo? Or why not combine that with artificial carbon capture?Finally, two major omissions:1. Covid-19. It's been shown that the temporary absence of humans has revitalized certain ecosystems on a very short time frame - such as the Hanauma Bay in Hawaii.2. Artificial meat. Yes, we should switch to a more plant-based diet, but how realistic is that? Well, artificial meat makes it a lot more palatable."}, {"id": 198, "text": "Depending on when you were born and where you were born, some things the very famous David A. is showing to us here, will be familiar or not. Wilderness is something that is not seen as a positive word. Because we use civilized and well educated and organized and other words to describe something positive. Or what we consider positive.Why am I even saying that? Well just to put things into perspective. And to make you realize where the movie comes from. Visually this is amazing. And all the animals? I just love that. Some may feel differently about that of course. But this is about the animals as much as the wilderness and the planet as a whole. Something we tend to forget. Not just during a pandemic (which helped the world itself heal a little as I've come to understand), but generally speaking.A documentary that seems to have found the right crowd (considering the rating here, good for the movie). Consider that before you watch it for the wrong reasons - because if you don't feel the message, you won't like the movie/documentary either."}, {"id": 199, "text": "A Life on Our Planet by David Attenborough is an extraordinary documentary that deeply elaborates on how humans have impacted biodiversity on Earth and the effects of population. David Attenborough is a 93-year-old man who has experienced many things on our planet. He tells his story of global decline and offers a vision for the future. The living world is a unique and spectacular marvel. Billions of individuals and millions of kinds of plants and animals working together to benefit from the sun's energy and the minerals of the Earth. Leading lives that interlock in such a way that they sustain each other. We rely entirely on this finely tuned life-support machine and it depends on biodiversity to run smoothly. The way we humans live on Earth, is now sending biodiversity into a decline, caused by bad planning and human error. It will lead to a place in which we cannot live. We have cut down 3 trillion trees across the world. Half of the world's rainforest has already been cleared. We cannot cut down rainforest forever and anything that we can't do forever is by definition unsustainable. If we do unsustainable things, the damage accumulates ultimately to a point where the whole ecosystem collapses. To restore stability to our planet, we must restore its biodiversity. We must re-wild the world. When it comes to land, we must radically reduce the area we used to farm to make space for returning wilderness. We are also hunting too much ocean life. Without the large station of other marine predators, the oceanic nutrient cycle stutters. Without predators, nutrients are lost for centuries to the depths in the hotspots of fish start to diminish, which leads to the ocean dying. Ocean life was also unraveling in the shallows. Corals began bleaching and dying. Scientists discovered bleaching was caused because the ocean was warming. Climate scientists had warned that the planet would get warmer as we burn fossil fuels and release carbon dioxide and other greenhouse gases into the atmosphere. Summer sea ice in the Arctic has reduced by 40% in 40 years. Our planet is losing its ice, one of the most pristine ecosystems is heading for disaster. Attenborough suggests that the living world is essentially solar powered. If we face our fossil fuels and run our world on the eternal energies of nature too. Sunlight, wind, water, and geothermal. A renewable future has many key benefits. Energy everywhere will be more affordable, our cities will be cleaner and quieter, and renewable energy will never run out. He also recommended that when fish stocks reduce, we can respond by restricting fishing practices and banning fishing entirely from many areas. In one act, this would transform the open ocean from a place exhausted by subsidized fishing fleets to a wilderness that will help us all in our efforts to combat climate change. The human population's rapid growth has caused us to utilize more and more resources until we run out. To improve the population, we have to work hard to raise money for poverty, give all access to healthcare, and enable girls, in particular, to stay in school as long as possible. We can make the population peak sooner at a lower level, which causes the population to stabilize and decrease the population. Our blind assault on the planet has finally come to alter the very fundamentals of the living world. David Attenborough has offered a vision to better the future. A Life on Our Planet by David Attenborough enriched my knowledge about population, biodiversity, and awareness of the future."}, {"id": 200, "text": "Sir David Attenborough, what else is there to say? He is not only a documentary voice, he is also a voice who cant be ignored. 93 years old, and yet so clear and alert. What else is there to say about this important message? Every Country, government and citizen need to make a change - very Soon! It cant be done in a week of course, people need to get use to things, and take it step by step.What to say as a documentary? Its so nice to finally see David(not just his voice) in a whole film. As always, astonishing picture and sound(Planet Earth, Frozen Planet, Blue Planet-style). It could have been more daring I suppose, dare to hear from the government/UN what the next steps are and so on. It could been more of everything - BUT I also understand why Its only 80min long, you dont want to scare anyone off with a 2h 30min film or 10 ep series either. Since This important documentary is for anyone on this planet...Sir Attenborough, you are a true legend"}, {"id": 201, "text": "By far the most effective documentary about climate change that I've seen.Attenborough has spent a lifetime showing us different worlds, and life through the eyes of different species on our planet. Now, we get to truly see the world through his eyes. It makes for fascinating, heartbreaking and hopeful viewing.Documentaries about climate change are often far too pessimistic. In fact, their messages often get lost on me because they're just so doom and gloom. The heaviness weighs me down and I come away feeling depressed and hopeless for the future of the planet.This documentary left me feeling good. It doesn't shy away from the predicament humans have put themselves in, but unlike many others, it provides (in a nutshell) a roadmap out and optimistic look at the future if we act now. I found it very effective that the film was bookended by Attenborough at Pripyat.If this David Attenborough witness statement happens to be his last work, then he leaves us with his most important yet.A must watch for all of us."}, {"id": 202, "text": "This is the saddest and most educational documentary I've ever seen.Sir David Attenborough speaks the truth from the heart using his vast experience and passionate for the natural world.This has reached me and made me reflect about what I am doing to help the wider world and society.I hope one day we will watch this documentary and think about what we are doing to make a better world for our future generations.Please let's take on board what the message is here and make a change big or small...Good luck."}, {"id": 203, "text": "Our society is only a few decades away from total annihilation. And very few explains it better than Attenborough in A Life on Our Planet. This is ultimately a horror story, a true story, of the impact we humans have had on our planet, and the grave and looming danger we are now facing.A child born today will witness the total collapse of everything we humans have taken for granted for hundreds of thousands of years, and it is humans that are at fault. But it is all still fixable. Though I'm afraid that humans will not rise to the challenge, before it's too late.I don't mean to be a cynic, I try my best, even though i stare doom in the face. I recycle, i eat all the food i buy, i don't drive a car, i don't use fossil fuels, i wear my clothes for as long as it's possible, and i send them to recycle once they are worn out. I do all these kinds of things, because it doesn't really take up much of my time to do it. It's all quite simple really, once you get used to it.A few years ago, i read about how much food we people in the western world throw away every year, and the number was about half of all food produced. Half. It is a staggering number, and a testament to the mindset we humans have come to inherit. We take everything around us for granted, and thus become blind to the overwhelming damage we slowly but steadily inflict on the nature around us, which we are completely depended upon.There are still those on this planet, millions upon millions in fact, that do not believe that the climate is changing. People who think that everything related to climate change is fake, and it does not matter how many violent record breaking storms, record breaking wildfires, record breaking temperatures, and record breaking ice melting we see and experience every single year, some people simply refuse to take in reality.It would be a damn shame if we perished now, just as we started to get good at space travel, before we had the chance to truly explore if there is life elsewhere om the solar system and beyond. It would be a damn shame, if we after all this technology we have invented, and all the smart people we have on this planet, simply could not persuade enough leaders to take action, and we make irreversible changes to the planets ecosystem that will be devastated for millions of years.Some humans might be able to live through all those years, adapting to whatever comes next. But they will venture back to the stone age, and they will be looking up at the sky, gracing at the moon, not knowing that once upon a time, long long ago, their own species actually walked on that. As time passes by, in the hardship we have to endure, we simply forgot, and no one is left to tell the stories of what we once did achieve.This is to me the saddest realization. That we simply couldn't fix our mistakes, even though we were told time and time again, that we had to. I hope I'm wrong in my pessimism, and that humans actually do succeed in turning it around. But it needs to happen now, right now. There is no more delay.This film, is essential to watch for everyone, to understand, and to grasp the reality we are currently in.10/10"}, {"id": 204, "text": "I was waiting in anticipation to watch this documentary. I am an Attenborough fan and have watched all his documentaries. Because I admire his work I placed my expectations high. I just wish it had said more, encouraged more, targeted some key areas of development in a specific manner. The documentary is a rushed account of our current state. The focus, I felt, from the trailers would be on solutions. But it swiftly moves through to meet a time limit. That renders it superficial. What it presents is common knowledge. Great visuals as usual though. I expected it to be insightful. Empowering individuals with the courage to act and showing them how. Clearly Specifically targeting Industries like fashion, food, the luxury cruise are imperative in the discussion of climate change and behavioural changes that are necessary to bring about this shift. Promoting conscious consumerism to individuals is essential for the well-being of the planet. It merely scratched the surface. Generic and broad comments avoided targeting specific corporations and governments. A more courageous work would have been groundbreaking. The powerful need to be convinced and coerced into adapting ways that promote a positive impact. A voice and persona like Attenborough could have made a grand impact. I felt that was sorely missed."}, {"id": 205, "text": "This is not an easy or pleasant film to watch, and I would not advice a child to watch this without an adult close by.The film presents the story about human progression and the impact thereof on the natural world, throughout the lifetime of David Attenborough. It does so calmly, somberly and truthfully without embellishing, using new footage combined with excerpts from nature films dating back some 70 years. At the end of the film, possible solutions are presented, that may alleviate or even reverse some of the effects humans have had upon the world.An important film with an urgent message. Force yourself to watch it! Even the scenes where you wish to look away.David Attenborough is a fantastic narrator and he has given voice to so many great nature films. This may be the most important one! 10/10 from me."}, {"id": 206, "text": "David Attenborough is a fabulous nature film maker and I love the idea of showing how the planet has changed within his own lifetime. That was brilliant.The thing I didn't like pertained to his comments on the population. He cited Hans Rosling's work on how the global population will level off at 11 billion once every country is developed and families only have 1-2 children. We have 7+ billion people on the planet right now and we are exhausting the earth's resources faster than it can keep up with. Our current population is unsustainable so adding 5 billion is impossible. The planet was at its optimum human population when Attenborough was born. It's only a matter of time before the planet ejects humanity as a cancer. We refuse to acknowledge and deal with the real problem of over population.Last thing. Michael Moore did a fabulous documentary called Planet of the Humans which exposes renewable energy for what it is: dependent on fossil fuels. We need to face that niggling truth as well while getting away from fossil fuels."}, {"id": 207, "text": "If you care about yourself, the next generation, nature and animals... do yourself a favour and watch this strong piece of work. It's a dazzling documentary about our impact on planet earth and how we can reverse it to our own benefit and have a sustainable lifestyle.The whole team did a wonderful job on this documentary. Perfect narration, superb soundtrack, dazzling cinematography, meticulous editing, professional directing, and wonderful storytelling in a linear way.The only thing that could be better in this wonderful and necessary-to-watch piece of beauty is, focusing more and deeper on the solution part and trying to show to the masses that changing the lifestyle is easier than it seems. It's just the clutter that big political and economical powers are making to stop you from hearing the nature's sound and will!I myself have changed my lifestyle years ago and I'm extremely happy about my decisions. It's been now six years that I'm a vegan and I never ever looked back to that dark and wrong lifestyle and diet.I believe we can change our system and lifestyle to our benefit. It's not impossible. They're just new different ideas, we just have to adapt ourselves to them.Witnessing all of these horrible things that lots of us are doing to this world is hard on these kinds of documentaries but it's something that we have to do and this one was another eye-opening and inspirational one.8.5/10"}, {"id": 208, "text": "A beautiful and well-made documentary, of one of the best contributors to our knowledge about wildlife, Sir David Attenborough.Being a short doc (90 min runtime), it covers most of Sir David's work from the beginning, around the 60s, to the present day. It is clear that this man has a passion for nature, for living beings and for our planet in general.He was a pioneer in the discovery of many unexplored territories in the 70s, always with the intention of learning from these places and with the native, and never with the intention of exploring these areas to obtain any benefit.It ends with a message about the future of our species, the destruction of the planet and much of animal and plant life, if our selfish, capitalist and immediate return habits are not changed quickly.For those who do not know his work, it is a good summary of his career as a defender of nature."}], "reviews_amount": 209}