{"name": "Infidel", "titleId": "tt11229780", "reviews": [{"id": 0, "text": "Having lived in the Middle East, I was thoroughly impressed by Infidel. There were far more well portrayed and peaceful Muslim characters in this film than there were evil. That's how it is in the Middle East. Most all citizens are sick of being repressed by their governments and their kings, princes and clerics. That was well reflected here and the characters felt like real people. I credit the writer/director, all of the very talented actors and the cinematographer. This is easily one of the more realistic Middle Eastern thrillers I've seen and my family and I were very impressed by it."}, {"id": 1, "text": "I'm a Persian and I'm a Christian and I'll say this. God bless this man for starring in this movie and demonstrating how disgusting the government of Iran truly is. God Bless beautiful, gracious, loving America! ❤😘"}, {"id": 2, "text": "I can't help but laugh at some of these user reviews that call the film low budget. I was in the industry for over ten years as a location scout. This film has at least 40 to 50 locations. That's not cheap. It was obviously filmed in Jordan. Their currency is stronger than the US's. They used hotels, airports, helicopters, etc and had a ton of international actors and actresses. So my estimate is around $15million and that's not low budget.Now onto the film. I'll keep it short and sweet. It's my favorite film of the year. I was on the edge of my seat from the first scene. There was nothing obvious about it. I adored the cast, specifically the top billed cast (Caviezel, Karvan, Ozsan, Savante), I thought the writing was very smart, and I loved the way it was shot. 10/10 from me."}, {"id": 3, "text": "Incredible movie, go watch and you will not be let down!"}, {"id": 4, "text": "I actually enjoyed this movie and I learned a lot about the persecution of Christians in Iran. It's low budget, but the storyline is solid!"}, {"id": 5, "text": "This was a low budget movie but it was an absolute masterpiece a must see"}, {"id": 6, "text": "I absolutely loved this movie. I would have never known it was a low budget film if I hadn't Heard somebody say it. I learned a lot about the Middle East and how Christians were persecuted. Not to mention how our government knows what's going on. I was extremely disappointed to find out that our government had known this man had been arrested and yet they did nothing to help rescue him. I also learned how other countries are infiltrating America. Excellent, excellent movie"}, {"id": 7, "text": "Well written and sad, funny along with a few surprises. Based on true events and you walk away making your own decisions"}, {"id": 8, "text": "The area I came from, makes it so real. It's true picture of not having freedom of speech. Great movie."}, {"id": 9, "text": "Loved this movie. should have been called based on true events as this happens all the time. if you are a fan of real terror and drama and action, see this movie"}, {"id": 10, "text": "I saw Infidel, starring Jim Caviezel-Person of Interest_tv, The Passion of the Christ; Claudia Karvan-The Darkside, Daybreakers; Hal Ozsan-Jessica Jones_tv, Dawson's Creek and Stelio Savante-Bad Ass, My Super Ex_Girlfriend. This movie is based on a true story about a Christian, Jim, that is invited to Cairo to speak about military uprisings in the Middle East. Claudia plays his wife, who advises him that he should not go-it's kind of dangerous in that region of the world and Claudia works for the State Department, so she knows what she is talking about. Jim goes anyways-Duh-and makes a Christian statement while appearing on Cairo tv which sets off some extremists. Hal and some of his friends-extremists-kidnap Jim and move him to a secluded spot in Iran. Claudia tries to get the US government to launch a rescue but to no avail. She then decides to go in and see if she can get him out herself. Stelio offers her his assistance-he has some connections. The first part of the movie is a little routine-with the torture scenes-but the last part is a little better in the rescue operation. It's rated R for violence and language and has a running time of 1 hour &amp; 47 minutes. It's not one that I would buy on DVD but it would be a good rental."}, {"id": 11, "text": "This film reflects what is happening in our world today. I truly found it to be educational. It was suspenseful and it was different because of how revealing it was. It was superbly shot and directed and the acting was excellent across the board. I especially appreciated the international cast."}, {"id": 12, "text": "This movie was great from the scenery to the acting. I loved it!"}, {"id": 13, "text": "When I saw Dinesh D'Souza and Jim Caviezel were part of this film, I just had to give it a look. What I found was that their exceptional work has gotten even better. If you are looking for a film where every Muslim is bad and every westerner is as pure as the driven snow, you've come to wrong place. Add libertarian director Cyrus Nowrasteh and you've smashed through the propaganda claims and are hit with something called reality. That reality is today's Iran. Women who commit the slightest infraction go missing and the men who don't fight the mullah's version of the holy war are put to death. Then there's the real resistance who are the people of Iran who yearn to be free. Infidel is their voice and it must be heard by the world."}, {"id": 14, "text": "I can't believe I'm seeing any good reviews. I thought it was a cheesy Christian movie, but it had tons of language. Acting and music was awful. Script was terrible. It was like a Rated R Christian movie. Worst movie I've seen in a while."}, {"id": 15, "text": "Nice movie , do not let propaganda motivated low start reviewers stop you to watch it.if you like the truth and can handle it I dare you to watch it."}, {"id": 16, "text": "Pro right less pro left and mainly not bias Iran iran has a dangerous facist government that decides like Nazi court extreme left and right is evil and this movie points it out thank you"}, {"id": 17, "text": "... are getting their undies in a twist (for the same old same old reasons), that is more than a sterling recommendation in my book. Looking forward to seeing this film.Now let's see if IMDb posts my view. Lately my reviews have not been appearing. Even when they a about a film. So maybe now this one will make it. Unless IMDb has gone woke and won't print posts that might offend the terminally sensitive."}, {"id": 18, "text": "First of all let me quickly describe my own movie rating system... A - Awesome. I want to watch it again, immediately! B - Pretty good. I'll definitely want to watch it again, later. C - Okay. If I'm bored someday and it's available I'd watch it again. D - I consider my time wasted. F - I either walked out, turned of the player or am kicking myself for not doing so.I give Infidel a B-.The story is interesting, mostly plausible and has an acceptable balance between the conflict and the resolution. Jim Caviezal is dependably good in anything he's in. While his character, Doug's behavior is a bit questionable in dealing with other faiths, since he's not actually a Christian leader, but a Christian blogger, that part is reasonable. (I doubt many Christian leaders would have been that blunt on a Moslem TV show, since they'd know it wouldn't be accepted very well). I like that they included Moslems assisting his wife as she tried to get him released. It showed that the problem is not just a religious squabble but actually a political problem where religion is being used as an excuse for political abuse.I did have a problem with several plot elements left hanging with no resolution. And the character development could have been done better.SPOILERS....It's established that Doug's wife Liz (Claudia Karvan) was having a crisis of faith (this was only revealed after she'd used several profanities which was bad timing, making it sound as if Christians normally use language like that). But the movie ended with nothing else being revealed about her loss of faith in God. Did she still blame God, or did she resolve the conflict?Doug also used profanities, including the F-word, but given the context, they were placed during moments of severe crisis, which hopefully people will understand as weakness, not acceptable behavior.The character of Ramzi (Hal Ozsan) murders his own daughter, yet the only punishment or consequences he ever receives is a punch in the face. That was unresolved conflict which takes away from the ultimate enjoyment of the story."}, {"id": 19, "text": "Save your money, this is a ridiculous non credible so-called middle eastern intrigue story which is decidedly simplistic and superficial fitting in well with our administration of foreign policy imbeciles. A complete waste of electrons."}, {"id": 20, "text": "Clearly one of the propaganda movies of Dinesh D'Souza.... poor production. Left after 45 minutes. Don't waste your time...."}, {"id": 21, "text": "Great Move! Old style, amazing international cast, beautiful Isabelle Adriani plays Maria Landi, a mistery woman who carries a secret and saves the protagonists. Awesome thriller. Dont' miss it!"}, {"id": 22, "text": "Intense and interesting, real life story line. I normally only watch comedy because I don't like to be stressed but I'm glad I gave this movie a shot!"}, {"id": 23, "text": "I have seen more movies than your average person will see in a lifetime and I can honestly say that this is the worst movie that I've seen in a theater. It's definitely the worst movie of 2020 thus far. Anyone who gave this a 10/10 must work for the production company."}, {"id": 24, "text": "The scenes cut from one to the next with no emotion or purpose. At some points it just felt like a poor Christian propaganda movie. Would have been a decent watch if the production and plot were convincing and more creative. Poor directing."}, {"id": 25, "text": "Christian good, Muslim bad. That's what the film is about. And it's not surprising in seeing that well known felon, grifter, charlatan and Christian fundamentalist Dinesh Dsouza is one of the producers. He should be put on the posters so people will know up front what this garbage will be before they watch it. Avoid at all costs. This is trash."}, {"id": 26, "text": "An awesome well acted movie. A true masterpiece that depicts the true accurate account of events. Beautiful actor Caviezel. Dinesh has done wonders with this movie. Ignore the rabid haters giving low scores.Must watch!"}, {"id": 27, "text": "Having an action movie based on religion can stir some controversy, but this movie navigated between the situation well. The acting is believable and the plot is well thought out. I enjoyed the dynamics between the characters as the wife desperately tries to rescue her husband. The tension between societies come off as understandable. I would watch again."}, {"id": 28, "text": "Pretty low budget movie with the most absurd action scenes... The acting is mediocre at best. I was also not expecting this to be so religious and preachy... don't waste your time on this one, unless you're into Christian films."}, {"id": 29, "text": "I love these type of movies so I couldn't wait to watch this . The cinematography was good and I liked the locations , the characters seemed believable. A small plot twist, the ending seemed rushed and far fetched. A lot of the stunt work and fight / chase sequences could be better. Overall not a bad movie to pass some time, but I wouldn't watch it again."}, {"id": 30, "text": "Very Poor ! They didnt even change the street digns to Persian, poor set up , poor acting, waste of time ! Didnt know Lebanon had a border with iran, they drove to iranian border from Lebanon with the same car and a guy on board! It is laughable . Extremely inaccurate"}, {"id": 31, "text": "This is the first movie I've seen in 2 years and it did NOT disappoint! I was literally sitting on the edge of my seat for the entire movie, hands constantly moving to hang onto something. Fast moving, riveting scene changes with suspense around every turn. It scared the Hell out of me because I know these things really happen. My Aunt and Uncle lived in Tehran in the 70s but that was under the Shah. This totalitarian regime of Mullahs is NOT the same country as women are murdered for accepting Western culture. Go see it if you dare! If you don't want America to be like this, vote Republican all the way."}, {"id": 32, "text": "This is an amazing movieLiberals, socialists and people who hate Individual freedom will be against this movie.Vote in the 2020 election.Patriots who love your Family."}, {"id": 33, "text": "I am currently watching this movie. I am a Republican but if the right wing of the Republican party thinks we are this stupid... Then we got you.. And Dinesh D'Souza needs some help...ASAP."}, {"id": 34, "text": "First of all I am an Iranian. I tried to watch the movie without pre- judgment Though I do not want to talk about custom designer that was terrible.The crew even didn't bother themselves to change the sign of streets and shops from Arabic to Farsi . some Farsi slogans on the walls are misspelled and nonsense , Although the script and acting was disappointing. I am surprised rhat the name of the director loos like Iranian name but he did not have any information about Iranian government nor judicial system. That is a wate of money and time."}, {"id": 35, "text": "Almost 2 hours of utter BS...offensive to the Middle East and to anyone who's lived between Muslims and Christians"}, {"id": 36, "text": "A very boring movie about pest &amp; colera. Probarbly the worst job i have ever seen Jim Caviezel ever do. but with such a terrible script and im not surprised. The worst part is that both religious weirdo groups seems just as retareded so picking a side wont be easy. Also this movie is dedicated to Americans held captive in Iran. I would be seriously offended if someone dedicated such a bad movie about religious weirdos to me while is was held captive"}, {"id": 37, "text": "This was an average movie. It was very predictable and had a far fetched ending. I think with there not being a lot of movies released some movies are getting better reviews than they deserve"}, {"id": 38, "text": "Utter trash! poor acting, poor direction, poor everything! dont waste your time on this garbage as I did"}, {"id": 39, "text": "Inaccurate and bad. Just bad. This is what makes war in the world.Jim Caviezel was one of my favourite actors (The Count of Monte Cristo). Even though that movie was also not at all like the original story in the classic novel, I enjoyed the film. He's a great actor and he shouldn't stoop this low."}, {"id": 40, "text": "Poorly acted caricature of a film. Does it's best to portray Muslims in the worst possible light but only serves to make Christianity the bad guy in this. The film has the subtlety of a sledgehammer and the intellectual integrity one would expect from a Trumpian sycophant."}, {"id": 41, "text": "We enjoyed this movie. It's a pretty realistic story of a man kidnapped and imprisoned for speaking about religion in the middle east. We are so lucky in the USA to have free speech. Many people here take our freedoms for granted."}, {"id": 42, "text": "As someone who loves action, history and war movies, I just knew Infidel would be another kickass gun blazing war movie. Boy was I wrong, the action scenes were lackluster and to be quite frank i'd have better times doing those scenes playing call of duty. Great, but cheesy message of how standing true to your faith and morals can work out for you. Definitely would scroll right past this on Netflix or Hulu, save your money and just avoid."}, {"id": 43, "text": "Propaganda movie, far from the truth. This movie is very insulitng for many, many people around the world."}, {"id": 44, "text": "Read the 10 star reviews, and you'll clue-in that you should not waste your time with this one. Realistically a five."}, {"id": 45, "text": "This movie give you a good lesson.. the lesson is to shut up when you don't really know what you're talking about.. faith is always based on knowledge, without it you are just guessing.."}, {"id": 46, "text": "An islamphobe cheap flick most probably funded by mossad to undermine the growing serious concern on racism and islamophobia in west, so it comes down to you if you an islamophobe you might going to like this movie despite its low production and bad acting, if you're not its complete waste of time.most of reviews on this movie or atleast 12 i read on top seemed fake trying to give movie a better ranking.p.s suggestion for producers stream it in india it will be an instant hit."}, {"id": 47, "text": "I really wanted to like this movie, but didn't. I was like a really bad Rambo movie. As a Christian, I did not like the Islamic stereotypes. The final scene included a helicopter that looked like a little news chopper instead of a military chopper. Disappointing."}, {"id": 48, "text": "Not what I was expecting. Almost no action until last few minutes."}, {"id": 49, "text": "Its an OK movie , They filmed it mostly in Amman Jordan , They did a good job covering the license plates of the cars in the scenes but they did not do all of them as you can clearly spot Jordanian plated cars , But they clearly had the intention to give muslims a bad image and thats not acceptable, as half Palestinian and half Spanish Muslim , some stuff about the plot is kind of exaggerated and offensive , In Egypt you could totally preach for Christianity without getting kidnapped , there are so many Arab Christians in Egypt , Jordan and Palestine , we live peacefully among us , so for a local person , I find it hard to believe that all of that would happen just because a guy tried to preach, giving christian viewers a bad image and sensation of insecurity in this region is false and totally inaccurate. Without any spoilers but also the plot is exaggerated towards the ending , I would have given the movie a lower score , but I liked the British accent actor Ramzi , he was really good and I hope he gets picked up in more bigger budget movies."}, {"id": 50, "text": "Despite it being dedicated to certain people, I didn't find it riveting, the acting was ok, every turn was predictable."}, {"id": 51, "text": "What have I just watched? A half-assed thriller with a horrible script, horrible acting, horrible cinematography, pushing a Christianity agenda and Islamophobia (it's Dinesh D'Souza after all). Jim Catweazle (Caviezel) shows what a terrible actor he is and why he has shown nothing after Gibson's 'The Passion', I really hope he will go back in hiding again.....this time in shame. All the bad guys (Iranian Muslims) speak perfectly English (also to each other), and the main terrorist even has an East-London accent ('mate', 'innit'). It's all so embarrassing, and so is the story. This is not even a B-movie, the special effects are down very cheap as well. This is all about portraying Christians as the people who are really persecuted by those bad &amp; evil Muslims. This is the worst movie I've seen in 2020, maybe even in years..........avoid at all costs."}, {"id": 52, "text": "I'm just gonna say- 15 minutes in I thought I was watching a pure flix movie, just sayin, the acting, the tone etc, the obvious-ness...."}, {"id": 53, "text": "I cant believe this at all. It was the boring and worst movie Ive seen ever. Do not waste your money here guys. Music is terrible. Script is awful. Poor acting."}, {"id": 54, "text": "This movie was horrible. The acting was bad and the whole plot was worse. Anyone with an ounce of common sense can see the plot holes. First half was decent, tail end was trash. The reviews on this one speak of paid propaganda. There's no way this is a 6 star movie."}, {"id": 55, "text": "I like many of the films and TV shows Jim Caviezel has done, but this was weak. The basic message of the film is Christians are good. Iran is bad. If you are a Christian fundamentalist, you will probably enjoy this film. After having watched it I discovered that Dinesh D'Souza, a right wing conspiracy theorist and criminal pardoned by trump, was one of the producers. Had I known that before hand I might still have watched it, but at least I would have been prepared for the cringey Christian bias. One punch from a Christian blogger and a bad Iranian is knocked unconscious. Wow!"}, {"id": 56, "text": "Man that was awesome. The plot was amazing, as a guy who lived in the middle East the movie does an awesome job potraying it. Jim Caviezel is such a great actor. Guys ignore the negatives about this movie, they are just hating this because they hate Christianity. A must watch!!!"}, {"id": 57, "text": "This film start with a man Doug being execute, and the flashbacks of six months earlier scene! As turnout, this film is about a wife Liz need to save her husband Doug from the kidnap of the Iranian, after Doug's anti-Islam speech! Entire film full of boring conversation, and annoying overuse scene! Such as, overuse of the annoying song playing at the background scene, overuse of the flashbacks scene, overuse of the blackout scene,and overuse of the calling names scene! Make the film unwatchable! The only intensity of the film is the explosion scene! At the end, Liz, and Doug get away with the chopper! That's it! Another disappointed film!"}, {"id": 58, "text": "It is so easy to load all the specialties solder to iran for rescue a worthless american guy"}, {"id": 59, "text": "The haters will tell you that Infidel is a poorly made, heavy handed Christian movie. It's not. It's an international action thriller movie. American man travels to foreign country and is abducted and tortured for his beliefs. His wife works for the State Department and her bosses decline to help. She steps up and tries to rescue her husband.Infidel contains the action and suspense fans of the genre want.Yes, Doug, the main character, is a Christian, and he is abducted and tortured by Iranians. Yes, that does happen in real life. In fact persecution of Christians goes on everyday in Muslim countries. The haters are getting their shorts in a wad, not over real life human suffering, but over the depiction of that suffering on screen.There is no heavy handed Christian proselytizing in this movie. It's not a Bond film, but it's satisfying as a representative of the genre.Jim Caviezel is, as ever handsome and charismatic. Claudia Karvan, as his wife is charming and lovable, as she should be. Hal Ozsan is very good as the torturer."}, {"id": 60, "text": "The fact this is a film with an agenda ... doesn't make what it has to say untrue.If you go to Cairo as a high-profile Christian blogger ... and effectively preach Christianity to a massive TV audience of diehard Muslims ... don't be surprised when your life suddenly takes a rapid turn for the worse. LOL.Having said that, this is a film worth watching, not so much for the mains (turning in occasionally hammy or contrived performances), but for the concept overall, and particularly the performances of supporting characters such as Ramzi.The harshness and lawlessness of the Middle-East felt real (if a little cliched in places) ... but you are left in no doubt as to the eternal divides which exist between the (primarily) Judeo-Christian culture of the West ... and its counterparts of radical Islam elsewhere.In short, if these themes interest you ... the film is worth checking out."}, {"id": 61, "text": "The filmmakers claim that Infidel is about cultures, not faiths, and aims to show only that people of different backgrounds should try to get along. That sounded great, so I went into the theater with that expectation and while watching the film, my mouth hung open time and time again in bewilderment at how misled I was. Even now, it seems unbelievable that the filmmakers could lie so blatantly.The truly saddening part in all of this is the fact that real journalists are far too often imprisoned and killed for their investigative reporting which attempts to bring the dark side of humanity into the light of day. There are also valid, substantial and worthy criticisms that should be made of both modern Christianity and modern Islam. I would deeply appreciate a film that authentically and unbiasedly explores these topics. Unfortunately Infidel doesn't even come close. What Infidel does accomplish, is to repeatedly portray Christians positively and Muslims negatively. It's pure and utter religious propaganda that should be labeled as hate speech. Therefore I highly recommend avoiding this movie. Infidel will only intensify righteousness and deepen hatreds and that is exactly what the world needs less of."}, {"id": 62, "text": "The old middle east capture and escape drama-thriller has been done to death a million times and its as if we have seen this film a zillion times before.That would be ok if it had some interesting twists or something more to say but it doesn't, its just a tired re-tread of a well worn topic with nothing new to say apart from the fact that islam is the enemy of all civilised society but that is nothing new its been obvious since the airplane hijackings of the 70's!Not really bothered by the political motivations that some seem to find with the film, I am just looking for a decent, interesting movie with something innovative and new to bring to the table and unfortunately this is not it!Nothing really to recommend this, even the Catweasel seems unimpressed by his role and saunters through the drama with equal diffidence!"}, {"id": 63, "text": "Infidel (2020 release; 107 min.) brings the story of Doug Rawlins. As the movie open, we are reminded the film is inspired by true events. We are in Tehran, Iran, and a guy is standing in front of 4 armed and masked soldiers, as he is about to be executed. We then go to Washington, DC, Six Months earlier, and Doug is picking up his wife Liz from the US State Department, where she works. Doug works in a small tech company doing contracts work for the US government, but he is also an active Christian blogger. He is invited to speak in Cairo, Egypt in a widely broadcast interview for the Muslim world. Doug can't help himself and invites Muslims to convert to Christianity, enraging Muslims all over. t's not long before he is abducted... At this point we are 15 min. into the movie but to tell you more of the plot would spoil your viewing experience, you'll just have to see for yourself how it all plays out.Couple of comments: first, this is the latest film from writer-director Cyrus Nowrasteh, whose The Stoning of Soraya M some years ago was quite good, but who more recently has been involved in some dubious stuff. Second, more troubling, the production company behind this film turns out to be D'Souza Media, the company run by far-right wing activist Dinesh D'Souza, a convicted felon whom Trump pardoned in 2018. (Among other things, D'Souza also claims that the Democrats are racists, and that fascism is a left-wing movement. Yea, we're dealing with that kinda garbage. He is of course very much welcomed in Trump circles.) When I saw that name in the opening credits, my heart sank. Third, the film claims to be inspired by true events, but never discloses what those true events are (if any). Fourth, the movie coulda/shoulda been a riveting film, but alas is just not very good, and it whiffs big time, period. The script has holes the size of Manhattan. The acting is outright poor (Jim Caviezel who plays Doug fancies himself a new Ben Affleck). Speaking of Affleck, Infidel more than anything comes across as wanting to be a new Argo (tense hostage drama in Iran), but comes nowhere close to it. I mean, not by a mile or ten.Infidel opened this weekend in theaters (fully adhering to all COVID-19 protocols). The Friday early evening screening where I saw this at here in Cincinnati was attended dismally (2 people, including myself). Honestly I can't see Infidel playing in theaters more than 1 or 2 weeks. Of course, I encourage you to seek it out, be it in the theater, on VOD, or eventually on DVD/Blu-ray, and draw your own conclusion."}, {"id": 64, "text": "Despite how much I enjoyed this film and how necessary it is, I fully understand the one star ratings. None of them are valid in and of themselves. There are no aspects of this film, any critic could point to that warrants an one star but in this current climate of Islamic violence apologetics, speaking out against such a film, is the safest bet both in a cowardly industry and on a personal level. It simply doesn't pay to speak the truth, when no one in power cares.While the threat of international terrorism was historically treated much like any other threat by Hollywood, superficial bad guys with foreign accents, the modern response has been the mirror opposite, both in quality and style. Instead of simple good guy bad guy, we have a reversal of protagonist and antagonist, while instead of right and wrong being easily identifiable, we suffer a post modernist take on the issue. An attempt by modern movie makers to blur the lines between what is and isn't justifiable violence and who is right or wrong. This film is stand out by sheer value of being almost alone in tackling this issue. We need more not less in the way of nuanced, personalised and whenever possible, real stories about terrorism.Instead of making apologies for Islamic violence or portraying all terrorists as evil, it would be far better to address the issue in a way that allows for both sides perspective to be told honestly and let the viewer make their own mind up. Unfortunately that isn't going to happen in the current climate.As for the elephant in the room, tackling the horrific treatment of Coptic Christians in Muslim countries, never mind Christians in Communist countries, there seems no interest and no end in sight to the world's complete indifference. Although Christians are by far the most persecuted religious group in the world, by every metric available, no one, anywhere, other than Christians themselves, seems willing to even bring up the topic and this film deserves props simply for addressing it."}, {"id": 65, "text": "That we in the ''western civilisations'', mostly brought up as abrahamian/christian believers, can put together a sugar sweet story like this. everything the cristians do in this film are either stupid and ignorant, and they try to make all muslims cruel and terrorists, and im sure that the most fundamentalistic muslims will gain more on a movie like this than any cristian citizen will. i bet that they call upon a fathwa on every infidel after this film has been issued, based on the stupidity of the plot and story, and lets make a universal , not cristian nor muslim, prayer from humanity to all the different believers inside every muslim country, that will become scrutinized after such propaganda movies are made...im not a religious person, but i have studied quite a bit on religious -isms through a long life in a rather peacefull spot on earth, so when americans does business like this i do get angry. there are a human rule thats called respect and what the main caracter of this story does is rather disrespectful.humbleness is considered a weakness in western progressive cultures, and that is what should be the key sentence to this drama, not that usa and mossad are able to outmanouvers a local iranian prison.just remember that iran is a country that has a record number of domestic spies, and can mobilize millions of kadres on a days notice. that human wall of women demonstrating at the prison gates, wouldve been grilled and tortured away from these premises at ablink of an eye.so the story and plot is a crime against religion in my opinion.as a product ,some of the acting plausible, the score are entertaining and boost the suspence, and thats itthis is not an attack on any religion from me, its all a question of respect for eachother. a heavy sigh of frustration and just a 4 from the grumpy old man of an ass, still trotting round and round like a record baby rightround roundround...."}, {"id": 66, "text": "The film equates the male and female leads to the story of Jesus Christ and his persecution under Pontius Pilate. The purpose of the film seems to be to stir anti-Muslim sentiment and promote Christianity. The film literally tells the audience that the United States Government supports Christianity. It's actually kind of impressive how much of this agenda is implanted into each line and scene in the film. The acting is lackluster but it's probably because of the poorly written script. This movie is insulting not just to Iranians and the Islamic faith but to everyone who has a semblance of morality as well.The following are the seven deadly sins (there are more minor sins as well) to watch out for if you decide to watch this cheesy, literal white savior, anti-Muslim, pro-Christianity propoganda piece. 1. Cinematography: Corny shots and pull your eyeballs out terrible transitions. 2. Count the number of times they say the name of the film in the first five minutes 3. Anti-Muslim stereotypes about every 20 seconds (count em up!) 4. Stale, like 6000 year old stale dialogue 5. Hilariously poor choreography 6. Pro-Christian sentiment every 15 seconds (count em up too!) 7. Heavenly level of plot armor shields the leadsThe one and only commandment you need to follow is; Thou Shall Not Watch This Film.P.s. Why do his bruises go away and his beard not grow(continuity makes no sense)? Also, weirdly and randomly mentioned coronavirus in the film (small plot device)."}, {"id": 67, "text": "There is actually so much to bear when it comes to relationship. No matter how good you are to them it doesn't mean that they will treat you the same way. It's so sad to discover my woman whom I thought could be a back up but it seems I have been deceiving myself for months. I need to desperately know what she's been up to lately so I had to reach out to webhubghost (@) gmailcom who got so many truthful and amazing reviews on the internet to remotely get into her mobile phone. He got that done in a twinkle of an eye, the service was delivered perfectly I was able to see her whatsapp messages, call logs, text messages which was quite amazing and I figured she lied to me about all the money i sent to her and her mails were the worst I could ever imagine.. I sincerely recommend webhubghost @ gmailcom if you are in need of a similar service and you want a perfect job done. This is not a hoax or deceit, I need everyone to find their luck spying their partner with this honest and noble IT expert. This app works perfectly but you need the help of the real deal with the email above to get loose from the chains of a cheater and abusive relationship by getting concrete proof through his expertise and prowess. Give Ben a try and regret no more, better days ahead.Email: WEBHUBGHOST (@) GMAILCOMText/WhatsApp: +19044177214"}, {"id": 68, "text": "Going through the reviews, you see a lot of 10 stars and a lot of 1 or 2 stars. So you might think the this is a thought provoking movie and a manifestation of how polarized we are.IT IS NOT THAT.This is a low budget rushed-in production with few modest action scenes and a conflicting and hallow plot. How hallow? In one scene Covid is mentioned but through the whole movie you don't see a single person wearing a mask. (obviously was added post-production). But most of all, the plot doesn't make sense.Although there are a few surprisingly fresh dialogues but those few are not enough to balance the cliche and half-hatched rest of the movie.SO WHY SO MANY 10 STARS?I think its because no matter how weak the movie is, it is extremely appeasing to those who have already made (and closed) their minds and believe in their own righteousness and the absolute evil. Its their attempt to support their truth as much as they can.And as for the 1 and 2 stars, they just try to balance the bias."}, {"id": 69, "text": "I'll start by saying the film was poor from an artistic and script/story perspective. I'll leave that there.More importantly for me is the broader impact a film like this has on society and the world. As an artistic endeavor, you cannot subsume topics like Islam/Christianity and depict characterizations of large parts of the world like the Middle East and North Africa (MENA), and not ask what is the image and truth you are trying to convey about the people in these religions and the geographic areas. Perhaps the makers of this film did just that - I imagine it was calculated - but it leaves Christians and Muslims in a worse place.I will stop here for context and say that I am a Christian who lives in the U.S., who was also a U.S. Soldier, deployed twice to the Middle East.The film goes to great lengths to highlight religious affiliation which pragmatically serves as more of a dividing tool (think here of Bosnia in the 90's with Orthodox, Catholic and Muslim affiliations during the war). Undoubtedly, many far-right conservative Christians in the U.S. who have not travelled to the MENA region and have no Muslim friends will appreciate the subtle Christian vs. Islam shallow and hostile narratives, but ultimately this is perpetuating harmful views. Am I ignoring evils that have been and are still being done in the name of Islam? No. But this film goes to painstaking endeavors to highlight the separation, difference, and division between Christianity and Islam, and chooses to paint Islam with broad brushstrokes as evil and dangerous.Islam and the MENA region is far from homogenous, and it possesses rich history and millions of great people. Most of this film at best paints Muslims as agnostic and untrustworthy figures, and more usually as homicidal ideologues who should always be viewed with suspicion - especially if they are your neighbor or co-worker.In reality, it is films like this - that create or confirm ignorant and divisive/destructive biases - that should be viewed with suspicion. The net result of this one is a film designed to be pro-Christian - communicating a very non-Christian message."}], "reviews_amount": 70}