{"name": "Citation", "titleId": "tt11481312", "reviews": [{"id": 0, "text": "Definitely African movie of the year, enjoyed every minute of the 2hours 30minutes 😀👏👏👏🔥🔥🔥🔥🔥🔥✔✌"}, {"id": 1, "text": "For me, This movie has a good story but it was unnecessarily long, had unnecessary scenes and it was slow. Plot holes and weak acting that appears so exaggerated. Boring, not gripping, baffling Unrealistic characters as well for a Nigerian setting. I had to keep checking if I've watched up to 45minutes. The plot holes were terrible nothing made me want to watch more"}, {"id": 2, "text": "The story line should get a 10/10 because I can understand the trust and deception that could occur between a naive, young and smart lady and a much older personality both in academics and age. I rate the acting 2 because it was so obvious it was an act, none of the actors OWNED the character portrayed. It was bland and cold at the same time. Unfortunately, I sat and watched just because I'm not a quitter."}, {"id": 3, "text": "The film citation is a necessity, I do not see where it would ever run out of relevance. The actors were carefully picked and displayed such professionalism, the location were amazing never new had such good universities in Senegal , the arts and craft of our African leaders carved out the African identity.The message this movie carries, how it was told is so special, insightful and artistic. The suspense is on another level, the melange of feelings it creates to us the viewers is something else.Citation is a must watch go watch it on NETFLIX"}, {"id": 4, "text": "The 3 star is for the cinematography which was spectacular and also the use of different languages. The plot was terrible and the acting was meh. I don't understand the hype. Jimmy Jean Louis wig was also terrible. I had to endure throughout the movie because I wanted to see if it would get any better but it got worse. Also, the lead actress was as bland as white rice she didn't really have a personality. Please if you haven't seen this movie don't waste your time."}, {"id": 5, "text": "Nigerian movies are just plain hype with popular people in it. The story could have been way more exciting. The acting and dialogue were weak in many extents. This is a movie for goodness sakes not a stage play, why wear a main actor a fake wig? I won't recommend this to anyone. With the cameras used, equipment and cinematography, you guys have to come up with way better. Also, why spend 2.5 hours just to tell a story of sexual harassment in higher institutions?"}, {"id": 6, "text": "The videography(?) was very high quality. However, all else failed. The plot, dialogue, acting were mediocre at best. Unnecessary / too long scenes. Had lots of potential, but fell flat. Felt like they weren't trying to make a great movie, just one that would distract its audience with great scenic shots and unnecessary french. This might be me being picky, but as a Nigerian I would prefer not to read subtitles for HALF the movie, especially for a non-nigerian language. Good effort, Kunle."}, {"id": 7, "text": "The story is an important one to tell however lacked some of the realities of the real life situation. It was therefore disconnected in some parts. Adding others languages Yoruba and French, was a bad move for the characters given that the pronunciations were very amateur especially the Yoruba for Temi, who could not even pronounce her characters name properly. The so called Igbo characters also had strong Yoruba characteristics which caused another disconnect and made the characters feel unreal. Film was too long for what it was worth."}, {"id": 8, "text": "More lengthy than necessary but by directing an atmosphere that is silenced and platforming a world of secrecy, the movie gives an intimate account of a survivor in a debilitating world of rape culture, encompassing beyond Nigeria to other parts. Beautiful movie."}, {"id": 9, "text": "Kunle Afolayan's latest directorial effort is a juxtaposition of sorts. Deceptively simple, but incredibly complex, Citation combines several elements in the telling of one story. Warring elements of friendship and betrayal, love and manipulation, courage in the face of adversity, individual triumph over general progress, tell the story of a young lady on a quest for truth and justice.Citation is a story that spans three African countries, carrying you on a nostalgic journey to the halls of Obafemi Awolowo University (OAU), Ile-Ife, Osun state, to the hot expanse of Senegal, and the watery coasts of Portuguese speaking Cape Verde.The movie takes on a wholesome approach in tackling the sensitive and sore subject of sexual harassment, particularly in an academic setting. Rather than let itself be stifled by the negative aura of this subject, the movie is punctuated by love, music, humour, beautiful languages and heartwarming scenes, delivering a delicate balance to the tense stories of betrayal, manipulation and lies.This work of art expertly displays the role perception plays in the expression of reality. In the search for truth, it becomes obvious that individuals have different interpretations of events dictated by their bias, prejudice and relationship with the involved parties.Temi Otedola delivers a brave and brilliant performance in her debut role as Moremi, a young woman in search of justice. Haitian-American Jimmy Jean-Louis, is enthralling in his transformation as Professor Lucien N'Dyare, the well travelled, well decorated, respected but predatory, supervisory lecturer, who has come all the way from Senegal to spend his sabbatical at OAU.Gabriel Afolayan, is earnest, cocky and supportive as Moremi's boyfriend Koyejo. Ini Edo, Joke Silva and Ibukun Awosika (who appears as herself) deliver stellar performances in their supporting roles. There are also a number of cameo appearances including Seun Kuti and Kunle Afolayan himself, appearing briefly as Koyejo's brother. In spite of its heavy star power, the plot does not get lost, neither does the story become laborious, but is carried easily by its protagonist's poise and natural grace.Conversations throughout the movie flow from English, Yoruba, French to Portuguese, forcing you to pay attention to nuances, expressions, body language, more than words. Citation is Kunle Afolayan at his directorial finest, telling a beautiful, warm cross country story set against harsh lines. Temi Otedola delivers a quietly brilliant performance in her debut role as Moremi Oluwa, embodying the courage that anyone seeking justice in the face of adversity must wear."}, {"id": 10, "text": "The movie is a wonderful delivery of the sexual assaults on university female student by some lecturer. It passes the message in a simple unsuspecting manner. Unpredictable end however, a few forgivable misses"}, {"id": 11, "text": "Citation is a must watch for everyone, it embodies a part of the rich African culture, an amazing love story, overall the movie is fantastic."}, {"id": 12, "text": "Best movie of the year 💕💕💕I wish it didn't end."}, {"id": 13, "text": "Every movie from Kunle Afolayan is always a story we can all generally relate with. The storyline, natural acting , great casting is always something to watch out for. Citation has got a good story line with it's plots and twists describing natural causes in our lives. I would say, this is another amazing movie to watch."}, {"id": 14, "text": "Perfect Movie! Finito. Loved every second of the movie. Wished it didn't end"}, {"id": 15, "text": "The Director and the producers did amazing work on this movie."}, {"id": 16, "text": "A beautiful story, well told &amp; portrayed. Everything from the locations to makeup, cast, costume, even language &amp; and the showcase of culture was simply breathtaking. Well done Kunle Afolayan"}, {"id": 17, "text": "IMo, I thought this thing was very well put together. I loved the way they used the flashbacks in court from the protagonist's perspective to unfold the truth , so there was no paraphrasing in the throes of recalling unreliable memories.It just worked, I also loved that I got to experience through the film another culture and it was nice and sweet and all the ancillary characters added a lot to the story.And I loved the antagonist how his huge ego got in the way of a functional life for him , really cool! It was all explained and well-thought out. Loved it!Way to go Netflix, this deserves a lot praise."}, {"id": 18, "text": "I love the story line, I love the act and I love the fact that its a story about what is really happening in our society"}, {"id": 19, "text": "Moremi shares her aspirations: I vowed from that day to spend the rest of my life trying to make a difference to the world at large. Girl you did it!"}, {"id": 20, "text": "Citation is a blend of artistry work and talented personas"}, {"id": 21, "text": "It's part of history that countries somewhere in the world that sexual harassment is kept under the table. It's a journey in history by a woman victim that change the standard. Good movie with teh content and casts as well."}, {"id": 22, "text": "Citation is a good reference when perceived from a filmmaking point o view. The opening visuals were stunning and richly endowed with breath-taking cinematography utilizing calculated rhythmic camera movements. The story is apt and timely, in view of the current agitations against sexual molestation and abuse in Nigerian Universities. The sound design is realistic and it helped with the story progression. The setting was natural and relatable; likewise the characters. Now, to the structure. The non-linear nature of the storytelling made it easier to keep the viewer glued to the unfolding story; blurring out all rigid demarcations between the inciting incident, lock-in, right up to the first and main culminations. However, the mise en scene countered the suspense in the plot and structure. It was clear from the beginning that the professor was guilty hence, I was just waiting for the end of the movie to see the 3rd act twist - which came with little surprises. The predictability of the conflict resolution watered down the anticipation that would have ordinarily fueled the dynamism of my emotions throughout the 190 minutes of pure artistry on screen. I also found Moremi to be more fluent in French than in Yoruba, which is not too much of a bad thing if only her effort in delivering her lines in Yoruba didn't affect her overall performance in those scenes. Her strongest scenes were those in which she spoke french... oh, it was a beauty to behold! All the key actors were exceptional - especially the Professor, and Gabriel Afolayan, who graced his scenes with his signature near-lifelike acting. Ini Edo was good but didn't quite hit an exceptional note with her performance. Overall, Citation is a brilliant movie with a high production value. It is embellished with well-thought-through artistry from the lighting design to the cinematography, and overall production design. From my subjective point of view, it might have been graded differently to keep it contemporary. But this doesn't undermine the grading it currently has. Finally, Citation did what every contemporary movie should do - reflect the times, and address pertinent issues amidst the entertainment. Just like Kunle's past movies, Citation triumphs in elaborating a simple plot with believable characters, placed in realistic situations.Well done, Kunle."}, {"id": 23, "text": "So, this film is about a girl in college who gets sexually assaulted by a professor, who's popular, and brings it to the attention of the school and a 'trial' is held by the school administration. Basically a he said, she said. While I don't put much stock in fictional tellings of a 'true story' ('cause it's rarely accurate to the actual story) this is supposedly based on a documentary where people went undercover at varying universities in Nigeria and Ghana and recorded the interactions made by staff to the undercover student(s). So, in that vein: more true than not however the 'trial' seems total fiction to outline the scenario, which is totally fine.This film shows very well how one can change a narrative by slightly changing a phrase from a positive to a negative (or vice versa.) The main problem with films like this is they provide two points-of-views when it should provide three but; and I know that's not the easiest thing to do especially since this film doesn't necessarily tell you present-tense and past-tense separately. One has to figure that out for themselves though one can tell in most scenes but not really in all scenes. Now, it's not a great film in the vein I think it was trying to be to resonate the advocacy of bringing attention to the broader issue of the subject matter and that's because in the flashbacks it shows the one point-of-view, and then speaks of a second point-of-view. Meaning: the one point-of-view shown is the truth and the spoken point-of-view is the lie. That's why a third should have been present to be better represented in a more equal telling. It also could have been 20-30 minutes or so shorter and primarily because it kept deviating from the message of the film and added unnecessary fodder.Overall, it's a good film but not a great film. What makes it not so great is the thriller aspect they added to the last 30 minutes where the professor previously got another girl pregnant and after she had the baby she commits suicide as if a 'shooting gun' scenario is needed for the overall message of the film. It isn't. It never is. The message is what's important but one doesn't need to dilute that message with thriller aspects. This is not to say, in general, it's an untruth but this is a fictional story probably based on a documentary on various people not a single person. Start with that, if one must, not end with it."}, {"id": 24, "text": "All the movie was unusually long and their acting wasn't spot on.it was a good watch cuz am not a fan of Nigerian movie but this particular one is good. The storyline was okay. The part I love most was the karate scene ."}, {"id": 25, "text": "Good story line that requires so much attention. But overall, the movie is well done."}, {"id": 26, "text": "I should have rated this movie 100% but nothing can be 100% perfect even though the entirety of the movie is close to perfection. Mr kunle Afolayan has never disappointed us for once right from the day's of #irapada,it's always from one level of professionalism to another. Always amazing and giving the best."}, {"id": 27, "text": "Forget the critics, this is perhaps the best African movies this year. It has the best plotting and acting and to top it all, the best storyline."}, {"id": 28, "text": "Please more of this meaningful content. Not movies focused on Lekki and oil money lifestyles. Yes some things might have been better but it gets a 10 from me because this is the type of content i love to see come out of nollywood.Big respect to you Kunle."}, {"id": 29, "text": "Not a fan of Nigerian movies, but this one pleases. A solid hollywood grade, eye glueing 2hrs 30mins intense ride. Graphics and vfx is visually transfixing, even though it wasn't shot with the Alexa or Miramax.. the operator behind the DSLR knows his tweaks. Audio is superb. Shot in Senegal though, set locations are amazing. The cast director selected wisely, the actors impressively reincarnate the true events back to life. Overall, its a cinematic masterpiece, hence the Netflix distribution."}, {"id": 30, "text": "Movie was okay. However storyline wasn't a 100% realistic , acting was poor and bland, no suspense and no diversifying storylines by the side. Felt like I was watching a play."}, {"id": 31, "text": "Until when will we keep silent about gender sexual harassment? This film tackles this scandalous and little treated subject in a masterful way. Invites and encourages not to remain silent when you are sexually harassed, to raise your voice and not see it as something normal or something that happened because of carelessness or because someone caused it. It shows both the version of the victim and the perpetrator making it interesting. It seeks to awaken in women the awareness of raising their voices and it succeeds. It is about an international academic who is accused of sexual harassment by the best student in the class and they are taken to the school hearing to clarify things, but the situations that arise turn the case around. Quality. Entertaining Baffling. Current. Safety pin. Slightly parsimonious, they abuse the detail of developing each thing in the last situation, so the duration of 2 hours and 30 minutes. The script is interesting and smart. Some performances are at the level and others not so much. Told in two times where the present is in full screen and the past in cinema mode. A film that simply seeks to raise awareness. A powerful African drama."}, {"id": 32, "text": "Citation delivers on giving us a logical representation of what happens in the real world to a large percentage of the youth, particularly students, and more particularly those of the female gender.It portrays the flaws in the educational system, the power of the judicial system, the strength in a positive united voice and agenda, and the fault in our so-called stars. It's narrative sequence and epic flashbacks deserve honorable mentions as they draw us deep into realms unfamiliar and virtually unseen to the distant eye.Morever, at such a sensitive time as this in the year 2020; it butresses the point of power in the people; and most importantly echoes this particular quote- The government should be afraid of the people, and not the other way around .The manipulation, the jury, the tales of well-favored lies, together with the splendid academia, fun, celebrations and music all make this movie a must see!"}, {"id": 33, "text": "It's a movie with quite a compelling plot I understand that the director sets out to draw us in as the movie goes deeper, but he failed at that by adding some unnecessary scenes and dragging some of it which resulted in it being very slow and gradually uninteresting for the most part You want to like the lead actress and root for her because of her obvious precarious situation, but the acting is not very convincing, nor endearing this failing to make us fully sympathise with her. She doesn't even speak the local language (Yoruba) properly, then why bother?!! Plot holes are so numerous (I won't mention them, to prevent spoilers), it makes it difficult to watch. The movie is so slow and isn't really captivating The cinematography was very fine and the location management was just as good, they took some really nice shots. The set decorations and costume design would have been very good too, but for the laughable Merkin-like wig they had the Professor wear (I mean!!) The movie had a lot of promise, also coming from one of the best directors in Africa, one in whom we'd expect nothing short of quality, but it ended up being below par, and all for 2½ hours? Common!"}], "reviews_amount": 34}