{"name": "Don't Listen", "titleId": "tt11750282", "reviews": [{"id": 0, "text": "I watched it without expectations. And then it turned out to be really scary and good. I love when that happens. Loved the twist at the end, too. There's a post credit scene that hints at a sequel."}, {"id": 1, "text": "We've seen this story a thousand times. It's also stupid and unoriginal.Movie relies heavily (and by heavily I mean only) on cheap jumpscares.Of course, no one ever bothered to check the kids drawings. Of course, the protagonists decide to split up many timesI can't believe we're still doing this kind of movies in 2020. Nothing to see here."}, {"id": 2, "text": "Pretty good with lots of jumps. Storyline was a bit basic with a few holes. But aside that it does make you jump. Plus the ending not traditional and I thought was really good."}, {"id": 3, "text": "This was disappointing. I was expecting a lot more from the Spanish. They usually make very good films especially horrors. This was mediocre at best. Standard Hollywood horror. Yes the ending is decent but it doesnt take away the fact that there was a missed opportunity here. From what started out as a promising horror with a good storyline just fell a bit flat in parts. The jump scares were predictable, the tension was good and could have been so much better if they focused a bit more on the payoff of built up suspension into a jump scare but it just didnt do it for me. I dont get the 10/10 reviews for this. The acting was good but i wasnt drawn into the characters as much as i wanted to be. Still worth a watch but dont go in expecting a horror classic that stands the test of time."}, {"id": 4, "text": "This film gives the impression of being carved by copying parts of many films and series that have achieved success in the industry. but unfortunately, I can say that this movie was unable to create its own originality. IMO the biggest betrayal of horror cinema is to create fear by making the audience to wait only for jump-scare scenes. Other than the jumpscare scenes, other scary(!) scenes, as I said before, were stripped away from other movies.Of course it's not bad at all; to some of those who'll read this maybe it'll become the one of the best movies of the last couple of years. But for me it's just NOT! Watching productions such as haunting of hill house, the conjuring or insidious for the fiftieth time will satisfy you more, it is incomparable."}, {"id": 5, "text": "I really liked this movie. It's very scary and it gets you every time. A must see if you like horror movies"}, {"id": 6, "text": "Most movies i see have tons of cliches and bad moments that i tell myself i wouldnt have written this scene like this. They ruined it. It didnt happen to me in this movie.Everything is well set up. This movie has some thriller moments and scary situations that i dont see in most movies nowadays."}, {"id": 7, "text": "I was pretty excited about this one because of the really good reviews it got . I must say I wasn't disappointed but wasn't surprised either . THE GOOD -The acting is great -The atmosphere is really creepy and so is the special effects and makeup . -The first 20 minutes of the movie are shocking and scary THE AVERAGE -The jumpscares . At the beginning the jumpscares were great but as the movie progressed they got cheaper. THE BAD -The twist was really predictable for me .Overall you should watch Don't listen because it's definitely worth checking out but you shouldn't have high expectations . I am going to give Don't listen a 6.5/10"}, {"id": 8, "text": "Horror movies are often disappointing these days. Too often it's just cheap scares, screaming and gore. This one is truly creepy. I hot a bit worried in the middle with the witches that it was going to get americanised  but luckily it didn't. And oh wow, what an ending. Also keep watching till after the end of the endroll, there's more there."}, {"id": 9, "text": "There is very little to save here. Everything is too predictable, the screenplay is rife with lousy clichéés, the characters are dull and unlikeable, lots of cheap jump scares and the usual scary puppets and nothing much more than that. In the end, a very boring copy of the copy of the copy of a hundred films of the same genre you have already watched. Just let it go."}, {"id": 10, "text": "Although the ending was a surprise but wasn't really scary. It's like they mixed all the different horror movies together and didn't really know what to do with it. Even at some points boring."}, {"id": 11, "text": "It's a conjuring ripoff but one of the better ones! The plot itself doesn't give you any surprising moments but the scary scenes will compensate you from start to finish. Creepy enough, the tension is palpable throughout the movie, the atmopshere is also quite effective. it's absolutely worth checking it out."}, {"id": 12, "text": "It does have the jump scares. Of course I wouldn't recommend for the little ones. Does show the killings upclose and bloody. Love that it gives you an additional scene after the credits. I can see a sequel or even a series with the remaining characters."}, {"id": 13, "text": "Film of constant suspense and extraordinary plot twist. A script clearly treated and thought, something that is currently scarce. Amazing recommendation for lovers and not of horror who want to live an absolutely unexpected experience..."}, {"id": 14, "text": "If you remove all the screaming and noises you get just a poor arguments with lots of mistakes and holes. Two things were ok. The twist at the end was really good and Rodolfo Sancho was brilliant."}, {"id": 15, "text": "An adequate Spanish horror movie but nothing special. Effects and jump scares are good. The story follows the usual lines of new family that have bought a new house and are renovating it only to find out that it is haunted. However the outcome differs from the usual and is somewhat unexpected. You will scream at the indulgence of the set designer who felt that the colours turquoise/teal and red/wine had to be present in every scene, but at brisk 97 minutes the horror eventually ends."}, {"id": 16, "text": "4 stars just cause there are worse films...Thais one is just boring, uninteresting, dull and dumb...not recommended at all..."}, {"id": 17, "text": "Very disappointing movie. Such a rubbish ending. Made me think why did I bother watching this for. Its pretty jumpy and scary but the story line is a bore"}, {"id": 18, "text": "Very short review. Should be called Don't Bother. That's it."}, {"id": 19, "text": "I'm always expecting something more from a spanish horror movie. But this movie was very bland and boring. I didn't care for the characters, whether they would live or die. The introduction to the characters is not good, yoi jump right into the horror elements of thr story. There is some good plot twists, but overall this is not enough to make a good film. The cinematography is fine, and the acting is ok. Very disappointed, I just wanted a mindless horror movie to pass the time but this bored me to tears."}, {"id": 20, "text": "Creepy scary anything with creepy siren noises like silent hill gets to me if you like jumpy scenes Erie noises haunted house this one for you I liked it. The under the bed scenes get me everytime hide under blankets kinda movie"}, {"id": 21, "text": "Dubbed voices over the acting which worked surprisingly well. Great acting, the set was good, very edge of your seat kinda film. There was a lack of connection and anguish with the main actors. The madness and mental pain a lose of a child would cause, is majorly missing. It was just missing that depth and didn't feel any anguish for the dead actors or the witch that would have been tortured under the house. They should have lost it more, built up the noises and the message from the other side, they just skimmed the surface .This was defo a rated 12 rather than a potentially excellent rated 18. Would watch again but nothing crazy special. The plot twist was good but a bit quick and last min, like an after thought, such a shame."}, {"id": 22, "text": "Could have been an 8+ if not for some silly audience manipulation, which is a shame because they did a lot of things well with this haunting tale. Great setting, solid acting, and yes a few good creeps (despite what the internet tough guys might say) that weren't all Jump Scare based.---1 Moody creepy quiet kid trope - Check (sorry, he's highly intelligent) 2 Characters finding themselves alone and having scary encounters/croaking - Check 3 Characters not learning from previous near-death experiences and going it alone again - Check Check Check 4 Cheap audience tricks - Check Check 5 Shoehorned ending twist - Check (he pulls pictures off the wall and then goes through them, a few key ones weren't even on the wall but this causes him to /// Big Spoiler /// /// Blow his own brains out in a combination of points 2-4.Pretty good otherwise!"}, {"id": 23, "text": "Pros: The story and the screenplay was good, never let me skip any scene. Jump scares are decent and were plotted where its needed. Unpredictable climax and the twist. Cast performances were good. Sound and cinematography was good, enjoyable with home theatre.Cons: Not much but I felt some slowness in-between the movie."}, {"id": 24, "text": "It is actually not that bad.There are some attempts to not fit into the same old cliched formula here.There are some genuinely atmospheric moments, and a few places where the story takes unexpected turns.It is not a film that relies on some minor jump scares, and tropes, like so many have as of late.Plus they did try for an original ending, and not the Hollywood style garbage that ruined horror. I would say that if you like the haunted house style genre, then check it out."}, {"id": 25, "text": "Spanish horror!!!!This is a very, very well made horror movie. It is creepy AF! At the end of the movie I actually looked specifically for the directors name as I was impressed with his skill. I will be watching his career from now on. If you are a true horror fan then you should definitely give this a watch. It's worth the investment."}, {"id": 26, "text": "There's not much to say about this movie: it's the same, lame horror movie that uses the same jump scares with which the genre is saturated and it reuses them over and over so that it also becomes extremely ripetitive and boring; a screenplay filled with stupid characters forced to create the situations needed for the jump scares and the same extremely unoriginal soundtrack used as an excuse to make scary what they realize wasn't but that at the end is just noisy."}, {"id": 27, "text": "I wasn't expecting this, but this a truly masterpiece. This goes way beyond The Conjuring Saga, Anabelle and Insidious limits. This movie contains what those movie lack, true suspense all the way. Stop being a typical lazy foreigner, set up the subtitles and watch with the real language. You won't be able to sleep well, at least for one night, guaranteed."}, {"id": 28, "text": "It's technically a very good film, it's very well produced, the acting is excellent, but for some reason, I was bored to tears, now I'm not sure if something was lost in translation, it was dubbed into English, but at no point did I feel in the least moved, scared or thrilled.I genuinely love Spanish horror, they make some of the best, this just had nothing new, we've had the fly before, we've had the under the sheet figure before, I am sure you will have seen all of this before.It was at least very well made, and the actors played their parts well, trouble is the material was lifeless. Dull, 5/10."}, {"id": 29, "text": "Yay! Netflix is producing good horror movies now. This is good, even voiced over in English was fine for me. Nice quick plot, not too fleshed out but doesn't need to be. Cool plot, bring it on Netflix! we want more Horror!!!"}, {"id": 30, "text": "It's a similar story we've seen but well done well acted and very entertaining and that's all we ask for in a horror thriller. I also liked the house and the setting it was spooky if you liked amityville you'll like this"}, {"id": 31, "text": "Really enjoyed the story. Looks like there could be a second film at some point which I can't wait for."}, {"id": 32, "text": "I really like horror/thrillers movies. I've pretty much seen it all and only a few have me interested till the end nowadays. 'Voces' being one of them.Don't read anything about this movie, just watch! It had me within a few minutes all the way to the end. There are some minor horror clichés, but certainly not in a bad way.I don't think I'll watch this 100 times like The Exorcist, but I'm certain I'll watch it again someday."}, {"id": 33, "text": "I dont understand the bad reviews. If you are a fan of the horror genre- I mean true horror, not the gory, teen slashing stuff- you would love it! The first couple of minutes seem very off putting but hang in there! It does get better. Definitely one of the bests of its genre in 2019-2020."}, {"id": 34, "text": "I really enjoyed this film. It was much better than I expected. Some real tension in there. It doesn't rely on cheap scare tactics (but it made me jump a good few times). Instead, it takes a different approach. The entities don't just disappear, they stay and they get nasty and dangerous! Some great plot twists too, including about the best since the sixth sense."}, {"id": 35, "text": "The scariest thing in this movie is the wall-to-wall carpet in the bathroom. Honestly just more of the same we've seen in horror cinema the past many years. Brings nothing new to the table."}, {"id": 36, "text": "Awesome , really scary! only for horror fans!!, very tense as well!! avoid it if you don't like horror! Not a movie to see with (little) kids. Rodolfo Sancho again, just such a good actor, really good!"}, {"id": 37, "text": "Really good flick out of Spain...dubbed english for Netflix...solid and scary in its own right with an ending I didn't see coming that wrapped it in a black bow of despair...highly recommend 👍"}, {"id": 38, "text": "Very classical story, nothing new actually but it makes me scare much. I can say it is well written and logical one. Worth watching if you love this genre."}, {"id": 39, "text": "Although nothing is new but the storytelling and acting is very good. Didn't feel the time pass and the movie keeps you engaged for most parts"}, {"id": 40, "text": "This movie has enough content to make a good psychological thriller. I was scarred, because the jump scenes were so obvious. They walk around sneaking in the dark with spirit boxes/walkie talkies listening close as possible to static. Or sneaking around in the worst places hitting the flashlight because it's pitch black and the battery ir failing. I use the mute button on these scenes. Its not worth it. You know something is about to make a loud appearance. Lack of script and voice dubbing from French to English was pretty bad also."}, {"id": 41, "text": "I absolutely LOVE scary movies and horror films. This one actually gave me the chills a few times and had me talking to the TV.Start off with a death of a young child, throw in some strange voices as well as the voice of the child calling for help to mom and dad, mix it up with some ghosts and some jump scares, sprinkle it with some folklore and you've got a pretty decent movie.The acting is not so great and there are some plot holes but so what! Remove your brain for a little bit, stop pretending to be a movie critic, and enjoy a pretty good movie that should hopefully give you the chills too!"}, {"id": 42, "text": "First of all, I liked the introduction. It was not so long and action started in first 10 minutes of the movie. The next aspect I loved was the style of the house. I liked that child and mother was killed, because it brings a little bit more action. I wasn't expected that child is going to die. The idea seemed a little bit bland. There are plenty of movies with flies in the wall and childs who can hear voices so it didn't surprise me. The ending was rushed. I get the idea of drawings and etc. but it doesn't make a lot of sense then. No one saw drawings in the entire movie just at the end of it. In backflash, where guy killed his son, also didn't see a lot of logic. How mom didn't heard when child was calling for help, but she heards when gates are not closed, that's just ridiculous. The whole movie wasn't bad. I would say a little bit above average, like 6/10, but it's 2020 and there are not many movies so I'm raising it to 7. However, I wouldn't recommend to watch it because it's not really that interesting."}, {"id": 43, "text": "I read many of the reviews and most of the feedback that is negative describes this film as unoriginal, with a typical horror storyline. I decided to watch it anyway, but my approach is to watch with an open mind. I honestly thought it was excellent. Kept me in suspense and freaked me out on countless occasions. I highly recommend it. Instead of trying to compare it to other films, just have fun with it."}, {"id": 44, "text": "I'm easily scared and I never watch horror movies, but I gave it a shot while I was at my cousins house. I was expecting to get easily scared but the movies jumpscares and twists were predictible.To make a point of how not scary the movie was, we watched it with all the lights out at 12 Pm, and I slept in an inflatable bed on the floor that was desinflating and even I having trouble sleeping I slept super quickly and like a log."}, {"id": 45, "text": "No big surprises, but this movie shows you some action, it is not that psychological bull**** where everything happens only in crazy people minds. Acting is fair (blonde girl is the worst)."}, {"id": 46, "text": "Suspense from beginning to the end, excellent acting. Watch till the very end of credits, surprise waiting..."}, {"id": 47, "text": "It was actually good. Small budget can do so much CGI and makeup but they got by and it was entertaining. Should be in the conjuring universe."}, {"id": 48, "text": "This movie is so bad it's pathetic. Horrible acting, ridiculous story, full of cheap jump scares that don't even make you jump. Skip this one. It's not worth your time."}, {"id": 49, "text": "Having seen this movie yesterday, I thought I would give it 5/10 stars, but now decided to give 6/10 stars because it gives the viewer some thrills. thrills are sometimes expected, when watching a horror movie, and those this movie delivers quite nicely. but only thrills and a basic horror story or basic horror plot won't make me give more than 6/10 stars to this movie."}, {"id": 50, "text": "There were plenty of expected scares. But several times things went in a different direction. There's room for refinement and improvements. But please not in a sequel."}, {"id": 51, "text": "This is a good Netflix movie for those who enjoy horror/thriller built on suspense and creepy atmosphere. For the genre and type of movie it is well made and possesses worthy scares - something that has been lacking in the horror/thriller genre in 2020.This film does have some jump scares, but for me it was most notable for it's real, atmospheric scare. If you expect gore, cheap scares (e.g. a pointless loud knock at a door to generate a jump), or emotionless acting, this movie isn't for you.Horror fans who appreciate the value of non-gore, emotion driven tension and suspense, and cinematic atmosphere should find this to be a movie well worth the time.Rating: 7/10"}, {"id": 52, "text": "Clichê e jumpscare sem surpresa, mas considerando os últimos lançamentos de terror/suspense da Netflix até que é um bom filme"}, {"id": 53, "text": "Dont Listen was a fine horror film about a haunted house and how its residence its starting to realize that and how to stop it.This kind of films are very common this years in Hollywood and rest of the world and it lookes like Spain isnt imune to them also but at least Spanish atmosfere and some chilling use of shadows and voices were decent enough for me to give this film a positive score still.Actors did a fine jobs and they sold their characters in a fine way even if i didnt cared for them.Voces was a fine horror film for one time watch"}, {"id": 54, "text": "I wasn't expecting too much of this movie but I have to admit that by watching it alone , I felt quite uncomfortable a few times! Tension is very well released and if the plot is classic, hell it's that kind of movie isn't it? Not every movie has to be a masterpiece. Lots of grinch in the comments but if you're normal and like horror movies this is a little treat."}, {"id": 55, "text": "Whoever wrote the script probably watched a bunch of American grade B screamers. First half hour was ok but the movie degenerated beyond than into a dull plodding predictable ending. But I did make good use of my time, trimming my nails and toenails. I don't think I watched much of the last hour but I paid halfway attention to the dialog."}, {"id": 56, "text": "Once it's inside ... there is no way to escape ... the horror. Or something along those lines. Now this doesn't just look good! It only sounds good! Very fine sound work on this one, especially if you have a good sound system to play that back with. And sound in this case really elevates the horror and the experience you are going to have with the movie overall.Story is quite simple and straight, although there are some twists and turns as can be expected. Nice performances too by all involved, with the usual jump scares and decision you may disagree with. Still overall more than decent and quite the experience ... ending in or excluded depending on how you receive or rather perceive that."}, {"id": 57, "text": "This movie is lame on so many levels - predictable plot twist, horribly executed jumpscares every 5 minutes, inconsistent overacting and worst of all - the straight thought that Spanish inquisition was right by killing and torturing thousands of innocent women, because sometimes there were real witches. I don't know if Catholic church is sponsoring such movies but you know, in the real world there is no witchcraft, as well as there is no devil, ghosts or demons or any other imaginary foes of church but there are a bunch of greedy sadistic fanatics who are abusing their power. Please don't show them in a white light in the future, because there was absolutely nothing good about them. Secularism and progress rules."}, {"id": 58, "text": "Enough jumps to see you through the whole film. Good tight pace, and tension. Every jump is correctly mastered, maybe there was one which didn't pull off as well as the others. Good subtle nods to a couple of older USA classics.. I'm a massive horror fan, and appreciate when it's done well. Thanks to all involved for this much needed film."}, {"id": 59, "text": "That was the greatest horror movie I've watched in recent."}, {"id": 60, "text": "The movie is great, i liked where they shoot it and the story is a bit disappointing at the end and very sad and I wonder it's the same with all the honor movies. I wish it was a little different anyhow would recommend it."}, {"id": 61, "text": "Another above average foreign horror movie from Netflix. While the story was nothing original, it was well executed and scary. Besides a few cheap jump scares, most of the frightening scenes were well done. The acting, effects, score, and photography were combined effectively . As long as Netflix keeps pumping these out, I will be watching!Side note- Javier Botet seems to be the gold standard for portraying a sinister creatures! I will watch anything with him in it!A solid movie thats worth a watch.Recommend [7/10]"}, {"id": 62, "text": "I had a good surprise about the movie. Better than many movies from Hollywood. For it is the best horror movie I haven't watch. 10/10"}, {"id": 63, "text": "Scary! Worth to watch. The direction is good. The plot is unpredictable."}, {"id": 64, "text": "'Don't Listen' relies on its excellent cast and magnificent direction and staging to survive the traps and loopholes of a shameless 'The Conjuring'-inspired script that needed a few twists and turns. It's a promising beginning but, unfortunately, all the rest was just a disjointed and tedious mess."}, {"id": 65, "text": "So the idea of the story is quite good, old creepy house, new people in, on Spain is good, but it goes downhill after the first family member, the history has a lot of plot holes on main events leading characters without proper introduction and huge holes on the story."}, {"id": 66, "text": "Some scenes are really scary.It's terrified but good to see, better than expected."}, {"id": 67, "text": "I love movies that make me jump and this one had my heart racing!"}, {"id": 68, "text": "I enjoyed this movie very much. Just let yourself go and experience it!"}, {"id": 69, "text": "Your typical witch haunted house. A movie to scare the kids"}, {"id": 70, "text": "At the time I finished this waste of film, it has a 6.2 user rating. I wanted to like it. I thought Netflix' involvement might pretend good things, but no. And the suggested sequel? Can't be worse than this one, but unlikely to be better unless it has new writers and new actors."}, {"id": 71, "text": "Scary as hell.One of the best.Maybe equal to Insidious and Conjuring."}, {"id": 72, "text": "The movie is quite good. Really loved it. But still if you think that it would scare the hell out of you then thats not the case. But yes its a good horror. It creates that environment that a horror movie should be creating. Jump scares are quite good. Overall a decent movie. Give it a try"}, {"id": 73, "text": "Found myself laughing at times at this all too predictable movie."}, {"id": 74, "text": "I enjoyed the journey through this movie, especially the jump scares and the well established ending - clues throughout, but not obvious until the reveal, and then it's of course.I think I liked the first part of the movie that seemed to be more around the family dynamics than the later parts where the villain is attempted to be slain, which presents as somewhat predictable. That is mostly washed away with the ending, which artistically rewards us as it mirrors the opening shots.Above average acting of a well written script using a re-used premise with some good new twists brings me to an 8."}, {"id": 75, "text": "The storyline is one we heard and seem before. A haunted house, voices can be heard and a child that is overly sensitive to this. However the movie, the actors and the screenplay do deliver. The story build up quite intensely, keeps you on the edge and has some effective scares. OK not overly original but rewarding if you keep watching (to the very) end."}, {"id": 76, "text": "Plot line was good just a few loop holes here and there."}, {"id": 77, "text": "While the atmosphere is positively gloomy and the premises interesting, the execution is very average. Indeed, this movie consists mostly of jump scares and the so called plot twist is very predictable. Still worthy a watch tho."}, {"id": 78, "text": "Spanish productions hardly disappoint me, and this film is another example of that. With a simple plot, it can be scary and interesting at the same time, it holds your attention and doesn't disappoint. There are some cliché scenes, but it doesn't really ruin the film. Do not turn off the TV after the initial credits, there is still another quick scene."}, {"id": 79, "text": "The film editing and music score is extremely well done. It is a predominantly jumps scare film, but the scares are well set up. I was only disappointed with the underlying story. If only they spent more time writing it. Nevertheless, this film is very enjoyable. It may even give you nightmares. I am giving it an 8, or 9 for the well-done scares and a 6 for the writing. All of the actors gave great acting performances"}, {"id": 80, "text": "A film that justifies the Spanish Inquisition by demonizing the poor women who fell victim to its inhuman torture."}, {"id": 81, "text": "A pretty scary ghost movie this. One of the best I've seen. Dubbed English dialogue done very well in that the voice actors don't sound as if they're amateurs reading from a script! Put it this way, I recommend you don't watch it late at night - on your own! Unexpected twist at the end."}, {"id": 82, "text": "He deserves the highest evaluation I was really bothered"}, {"id": 83, "text": "Not comparing this to any other movie, it is a great movie in itself. I only took off one point because of typical horror movie plot advancers. There are flies gathering in one spot in the wall and you spray bug spray! Everyone splits up! Not immediately going in fire blazing - stand there for a minute and give her time to stab you. Not look at the pictures your child is telling you voices are telling him to draw. These could have been resolved any other way but alas this is the structure of horror movies. What's a horror movie without yelling to the screen, WHAT ARE YOU DOING?"}, {"id": 84, "text": "You surely won't be disappointed if you don't expect much."}, {"id": 85, "text": "As many have written to this effect: Been there, done that. When the old man and daughter were still chatting after the releasing action, and given the time left (which was about 15 minutes), I started thinking Ok, who's getting chopped next...? Let's just say I'm thankful for technology allowing such things as viewing movies at faster speeds...thanks to Netflix for that..."}, {"id": 86, "text": "Meh, I actually watched this entire movie because I had to read the captions. This is a Spanish movie and they speak Spanish throughout.This movie, like other reviewers said had every cliche in the book including a rolling red ball. Where have we seen scary rolling balls before?There's a scene after the credits that makes zero sense.***********************Spoiler below*************There's a twist at the end but even that wasn't that great because I always suspected dad. He just, I don't know, something about him -something about the language he used. He cursed a lot and he just didn't seem like that great a guy so I wasn't surprised by the ending either."}, {"id": 87, "text": "Ending ruin whole movie. Could have been wy better"}, {"id": 88, "text": "Don't Listen (Voces) is a movie that takes a lot of cues from the very successful Conjuring franchise, but at least it does so stylishly well. A family of three are fixing up an old mansion to sell it for a profit. The father, Daniel, seems to make his primary living doing this. He and his wife Sara have their eight year-old son Eric speaking to a therapist at the very beginning of the movie, because apparently Eric is having trouble adapting to the new environment this time around. He hears voices in the house, through his toys and the walkie talkie he uses to communicate with his parents. The therapist presumes he's acting out but very soon learns to regret this assumption. One thing this movie does that's interesting is that it takes a drastic turn sooner in the runtime than you'd expect if you're basing the pacing on other haunted house movies. Daniel asks an EVP expert for assistance, and the expert brings along his skeptic daughter Ruth to help him search for answers in the house. They find out that the house was once used for other purposes and realize that they have to perform a ritual to stop the haunting, and then it all starts really hitting the fan. The acting and special effects are good and the use of saturated bits of color in a desaturated landscape gives the film an interesting visual style. Eventually, though, it becomes obvious that this film is setting up a franchise, and it might turn unintentionally funny if everybody winds up dead every time this guy shows up to help. Like when Yor the hunter from the future visits your village, you know he's trying his best but everybody's doomed. It is a very watchable movie, though. I'd watch another one."}, {"id": 89, "text": "Really, really bad. Music dips, jump scare. Music dips, jump scare. Repeat, plot twist. Fin.There's just no point in this stuff."}, {"id": 90, "text": "Quite a sinister and twisted little story told in this movie. What appears over the majority of its running time as the usual dark mansion, child hears strange things, shadows wander around flick, picks up quite some speed towards the middle and surprises with a tense and uncomfortable finale."}, {"id": 91, "text": "I normally steer clear of foreign language movies because I tend to watch movies while doing other things so I can't read along. Well this movie had me reading along! Well acted, creepy, suspenseful... it's been a long time since my heart raced during a scary movie. This one made it happen."}, {"id": 92, "text": "Very good movie. Scares and tension guaranteed all the time. Excellent camera, visual and photography work. Committed actors and good performances. Unexpected end. The talent of director Angel Hernandez, who competently developed the story, is surprising, despite the obvious few resources at his disposal."}, {"id": 93, "text": "Metaphysical horror film from Spain. Spanish cinema has a very good reputation for mystery / horror films, and this is one of the examples. Although the idea of hostile spirits is now very common, the film is interesting to watch, has plenty of suspense, good actors and a pretty good script with some twists and turns. Despite the low production costs and the usual script, the film is serious and well made and is a good recommendation for fans of the genre."}, {"id": 94, "text": "I can say that this horror-angst movie (Spanish), will be felt much stronger in some people, because the things that are seen succinctly and a suggestive sound of a walkie-talkie in the kid's room, which disturbs him, leads to a series of inexplicable things, it is these things and these noises that will make the spirits work, in addition with a kid, some people will have an even stronger capture of the atmosphere. Personally, i followed the movie without really wondering where it was going to take us, because the script follows easily, the performers are not bad at all, a little lengthy, a script that the Spaniards have already exploited before and apparently they like that kind of movies. In the end, the movie can be watched without problem and it is certain that there is better, but in its genre it is not too bad."}, {"id": 95, "text": "Don't Listen (Voces): An electronic voice phenomena (EVP) horror thriller. A couple and their young son move to an old home in the country intending to renovate The house Is fly-infested and soon strange noises and voices are heard over phones and walkie talkies. Tragically the son drowns but his voice is still heard over the phone. The father calls in an EVP psychic investigator. Things go crazy from there, suicides, attempts at self-harm, cats hanging from trees. There is a malign presence in the house causing the noises and manipulating people. Some really gruesome scenes, the cats bit is bad enough but there are also shootings, stabbings, hangings, throats slit and a tree branch impaling a head. So plenty of horror and shocks plus a few plot twists keeps things interesting. The rambling, sinister old house with shadowy, dark rooms and tunnels provides a fitting backdrop to the unfolding of this narrative. Directed by Ángel Gómez Hernández, written by Santiago Diaz. On Netflix. 7/10."}, {"id": 96, "text": "A Scary, thrilling and enjoyable horror film! I very rarely find movies creepy, but this one actually succeeded at times! I highly recommend viewing this gem"}, {"id": 97, "text": "The movie is ok.I personally think it would have been better if America made their own movie with the same premise (like The Ring, The Grudge, One Missed Call, etc) instead of dubbing an already existing movie. I feel very disconnected since the voices don't seem to fit with what the actors are doing (some of the voice acting doesn't match the physical acting)I also find it a little jarring that the lip movements don't match with the English dialogue.But the movie's story was great, maybe a little slow"}, {"id": 98, "text": "Watched this on Netflix last night, knowing only the basics of the story which I find is better sometimes. First part of the film you think you are watching a haunted house film which talks to the son, that then takes a twist and it then takes on another story, which I thought was a good turn for the film. I am not going to give anything away in the film, so sorry about that. Overall I enjoyed the film, I watched it as a dubbed version which was done very well and I didn't feel that it took anything away from the impact of the film. I don't know whether to give this film a five or six star rating but I think because Netflix horror films don't live up to the hype I will give this a six."}, {"id": 99, "text": "As horrors go Don't Listen (2020) isn't a terrible film, its only let down is it's a well known story (i.e. an old house with death and evil).So the good and the bad: It does what it should do, it's scary.Personally, I thought the setting and the way it was filmed (i.e. colour and hue) were ideal for the movie.The film is predictable in that it is set in an old house etc. but even then I was still caught out at the 'jump' momentsThere is always a twist at the end of a movie like this, and sure enough Don't Listen (2020) doesn't avoid this. Again, personally I thought it was okI can't speak for the other languages, but for dubbing, the English version was goodOverall, it's engaging, at times scary and a good movie.Recommended for people who enjoy the 'old house' horror."}, {"id": 100, "text": "Well... If your child is hearing voices there are three probable reasons for this:1) He has a very strong imagination. 2) A traumatic life experience or mental health problems such as schizophrenia or bipolar disorder. 3) The house you are in is haunted.As Don't Listen is a horror movie the third option is clearly the obvious one. This is a fine Spanish horror flick that is full of creepy moments - we get many of those wonderful shots of shadowy figures in the background - and the atmosphere of dread and horror as the malevolent spirit preys on the residents with a series of brutal mind games is great, that all said, it's unfortunate that the last act relied heavily on our cast of characters acting like complete idiots, which to be is fair standard horror stuff. This movie also answers the question, What is worse than building your house on an ancient burial ground?Note: If flies are swarming around a crack in the wall it might be a good idea to find out what's inside that particular wall.."}, {"id": 101, "text": "The plot: after a family moves in to an old house, the parents become concerned that their son is hearing voices.Haunted house movies tend to be pretty cliched. You have to really like the formula to sit through most of them. It helps if you shake things up by watching the occasional non-English film. But, even so, you frequently end up feeling like you've already seen that movie a few times already.Don't Listen doesn't stray from the template used by so many other haunted house movies. There's the standard bit of exposition about why the family can't leave the house. And, of course, someone finds a book that explains the movie's plot in detail.However, quite a few of the scenes were well-acted, and the characters were all pretty likable. Each of the characters got to have their own spooky moment, where they sloooowly reach toward something they probably shouldn't be reaching toward. Then there's a sudden, loud noise, and the character sloooowly backs up, not realizing that there's something spooky behind them. If you can handle such cliched scenes, it's actually done pretty well.Near the end of the movie, everything is explicitly and tidily resolved. There is absolutely no metaphor here, and there is literally no chance that you walk away from this movie scratching your head. It left me wondering if maybe this was meant for a younger, less jaded demographic than me."}, {"id": 102, "text": "I really liked the first 20-30 mins of the movie: The build up was good. The visuals give you the creeps (and depending on your level of scare, they might even seem scary) and you can tell that it's about to go down, the movie does a good job of building the anticipation. Watch this movie for the first half if you'd like to. Would recommend that! The acting was good too!But halfway through, I lost interest. The movie had so much potential but it was a let down then on, especially in the final 30 mins. A couple blatant things were missed to move the plot on that made a character seem dumb, only made me care less for him. The narrative around the paranormal/witch/ghost in the final third felt weak and rushed. The lore could have used more time and stretched bit.The final twist - Interesting. I'm torn with this one though but I'll take it. I guess the first 20-30 mins and the this final twist are the two things that I'll take away from the movie. That's about it. Turns out, there was a post-credit scene, that I missed, about a new story. I don't think it's worth the time to go back watch it, it's not gonna salvage the story in this movie for me."}, {"id": 103, "text": "An abandoned house in a dense forest, a family indebted in constant changes of housing, sinister and haunting figures and voices.The horror genre doesn't necessarily have to have original works to stay active. Although it has a premise already known to the public, the Spanish production, Don't Listen, will make you be surprised and never look at flies the same way again.With great impact right at the beginning of the film, literally, the plot unfolds with a moderate amount of twists, but forceful quality in all of them.After the loss of his son in a tragic and mysterious accident in the house where the boy said he heard voices, a stunned father remains in the house where the horror happened to end the reform in which he invested his savings.Without the company of his wife, who left the place to try to overcome what happened, Daniel, very well played by the expressive Rodolfo Sancho, returns to hear his son's voices in recordings and calls made after his death.The boy's request for help on the other side despairs the late father to the point of seeking and convincing a paranormal investigator marked by traumas, accompanied by his affectionate, but incredulous daughter.The similar concept of this narrative with other productions of the genre is slightly irrelevant in view of the development of the way in which the production accompanies the plot.Beginning with a dramatic family tragedy, the work manages to maintain this line and link it, in an increasing and surprising way, with traces of action, mystery and the different lines of terror.Like most films of this genre, dark montages of scenes, settings and jump scares do not go unnoticed. However, the tension and attention built over the course of the plot will maintain the priority and fright for the progress of the narrative without deteriorating or even exaggerating in any aspect the other approaches to production.Without reinventing terror as a whole, Don't Listen captivates and disturbs, in a coherent way, with the optimal use of the particular elements of its script, environments and cast.The freshness of this Spanish production ranges from the empathic and suffering family relationships wounded and haunted by the entities from the beginning of the film to its shocking ending without the absence of high doses of bitterness, as was experienced throughout the course of the plot."}, {"id": 104, "text": "Having trouble sleeping in their house, the parents of a young boy become distraught when he accidentally dies around the house, but when he stays behind to grieve a series of paranormal incidents causes him to gather a specialist and his daughter to investigate bringing them in contact with a dark supernatural presence.This was an above-average if slightly disappointing genre effort. One of the films' biggest positives is the atmospheric touch this adds to the material that feels rather creepy. The general vibe here is of a true haunted house effort, mainly coming from the constant static and noises occurring throughout the house on any device capable of producing such sound but the other attempts to introduce the technological enhancements into their ghost-hunting practices which reveal evidence of the paranormal. These manage enough to generate a rather dark and chilling atmosphere here that plays perfectly into the finale where the ghosts are much more active, much more frequent and actually manage to become somewhat chilling in their recreations of the past events but also interacting with the group left in the house which has a lot to like for the most part. There are a few issues to be had with this one. The biggest issue affecting this one is the completely cliched and predictable setup here that follows all the usual rules and ideas usually associated with this type of film. The idea of the parents trying to figure out what's going on with their kid who's clearly disturbed by someone or something else other than what he's been telling them is going to result in the same stereotypical scenes usually featured here, from the parents yelling at the kid to behave and not understanding what's going on to showing the kid being influenced even further by the spirits in the house and the resulting strain being forced onto the parents trying to cope with everything. This resultant tragedy serves the film nicely in creating the perfect backdrop to the unease within the film but also feels quite tropey and expected as if nothing new or unique is done with the material as a whole. The general series of subplots and revelations about the ghosts' past brings nothing new here either, making them feel so expected and generic that they don't register much in the long run. Moreover, the scenes in the second half where they bring in the paranormal researchers cause more problems. Their introduction and immediate entrance into the supernatural goings-on are unbelievably rushed as a few lines of dialogue at a book-signing is enough to enter into the fray which is wholly unrealistic, while this also ends up bringing about so many ghost-hunting cliches in their search of the house it can feel like outright plagiarism at times. The scanning sequences with their devices are nearly shot-for-shot from just about every other attempt to utilize this setup, while the expected jump-scares of something running by in the background or off in the distance are telegraphed by jarring musical stings and expectant camera cuts which render the shocks ineffectual. With a glaring twist ending that changes the entire scope of what had previously, rendering everything into a huge waste of time, these issues bring the film down considerably.Rated Unrated/R: Graphic Language, Violence and children-in-jeopardy."}, {"id": 105, "text": "This was a movie that I checked out as part of wanting to see other films that people were on high when it came to rounding out my year end list. This one popped up as Marknado, a friend of mine on social media, had high up on his list so I figured I'd give it a go. The synopsis here is Daniel (Rodolfo Sancho) and Sara (Belén Fabra) have a 9-year-old son Eric (Lucas Blas). They've just moved to a new home, not knowing the neighbors call it 'the house of the voices'. Eric is the first one to notice the odd noises behind each door.We start this movie out with a dirty swimming pool inside of a gate. Daniel retrieves a ball from it with a net and it shifts over to show us the house. It is pretty old and rundown, but this family has moved into it. Daniel flips houses so along with his wife of Sara and their son Eric, they move around quite a bit. The movie then takes us into Eric's new room as he meets with a psychologist, Beatriz Arjona. She gets from the boy that he's sad they moved and that he has to make new friends at school. He reveals also that he has trouble sleeping due to the voices that talk to him. They also ask him draw things. The movie then gives us our first taste of something supernatural when the psychologist dies on her way home. Eerily, Eric drew a bloody branch as it happened.The boy continues to be plagued by things he hears over walkie-talkies. Daniel got these so his son can always talk to him. While the boy is the in the bathtub, he asks Sara if his father hates him. She asks where he heard this and it concerns her. Things are even more concerning when he gets expelled from school.Tragedy then strikes the family with something happening to Eric. Daniel can't leave the house as most of the family's money is tied up in it to renovate and flip it. Sara can't stay in the house though. When Daniel hears what he thinks is Eric through a recording on his phone he sent to Sara, this causes him to seek out Germán (Ramón Barea) who is an expert in EVP phenomena. He brings his daughter Ruth (Ana Fernández) who is skeptic. They're in for much more than they bargained for when they investigate this house. It leads to a dark past and why it is called 'the house of the voices'.Now that's where I'm going to leave the recap for this movie. I don't necessarily want to go into spoilers so that gets you up to speed where this will take you. What I really want to comment first here about the movie is the foreshadowing that this movie does so well. As I'm watching this from the beginning, I knew the swimming pool was going to come into play which it does. They show Germán really early in the movie on television and again, I figured this was going to allude that he would come back in later. This movie does well in setting up things without making them too obvious and then strategically coming back to them later.What really strikes me about this movie is how well it handles heavy subject matter. This movie goes to some dark places, but handles it in a way where it avoids going into the exploitation movie. It does something that is very depressing and can be a trigger for some, but it spurs Daniel into what he does. It also deals with the idea of suicide. This is something that really has tore Germán and Ruth apart. They're still close, but there is a dark secret that isn't spoken about between them. The entity in this movie is pushing suicide on many of them and it is quite convincing with the lengths it will go to convince them. This movie shocked me a few times in a good way for sure.Again I don't want to spoil what the entities are in this house, but it is really something that I'm a huge fan of it. It actually makes a whole lot of sense and realizing that this is from Spain, it really works with the dark past of things done in their country. What is interesting here though is that we don't have someone who was killed unjustly. The entity that is back probably deserved to die from what we learn was done in the past. The way that their execution was carried out might have gone too far, but they did some evil deeds for sure.Where I want to shift over to next would be the soundtrack for this movie. I'll be honest, I don't love the title. It does make sense in the grand scheme of things, but it really isn't a viable option to prevent what is happening. I'm assuming the original title is translated as Voices, but that is a bit generic and there are at least 2 movies in the horror genre with the same title. Regardless, we have this static that is telling Eric horrible things and then it branches out into others. The sound of static is just creepy to me now-a-days thanks to a lot of movies I've seen. There are a few set up jump-scares, but they were pretty effective. One got me for sure as I wasn't expecting it. I also think that the musical selections worked to the advantage of this movie. With the title, if these weren't effective it would have been a major letdown.Since I've been going over the scares, I'll shift over to the effects. This movie has some really good practical effects. The opening death looked really good. I like the look of the entity. They were quite creepy. They do another scare with strobe light that was eerie. On top of that, they're using infrared cameras and there is some creepiness that comes from them as well. There is a bit of CGI, it is looks fine to me and for the most part really seems to be there for enhancement and not the focal. I can get down with that for sure and I'd say the cinematography is well done. They really liked to use the depth of focus. You really need to pay attention to the whole frame as they like to hide things in the background which makes me uncomfortable in a good way.The last thing that I'll go over would be the acting. Let me lead off stating that no one here is going to win major awards. That's not meant as a slight or that they weren't good. I first off want to commend both Sancho and Fabra. They do really well as these loving parents. We get that baseline before they become the grieving parents after what happens to Eric. I believed them and it made me feel for them as well. Blas was fine as their child. I really liked Barea in his role. He at first doesn't want to help, but then he becomes pulled in by the facts. He also has some trauma to deal with as well. Fernández was good as well. She's quite attractive and I like her as the counter to her father in not necessarily believing. Everyone that played the entities did well in being creepy which along with the rest of the cast rounded this out for what was needed.Now with that said, I'm really glad that I didn't sleep on this movie. Seeing how high it was on a list for 2020 makes a lot of sense now. This movie really has some good emotions along with the dark subject matter that it is dealing with. It really made me feel uncomfortable with what they did with the depth of focus, the truth of what happened here and what this entity is forcing people to do. The soundtrack and sound design help with the atmosphere, the acting was solid and the effects were well done in my opinion. I don't really have a lot negative to say if I'm honest. Overall I'd rate this as really good movie, bordering on great. This is a contender for me for my year end for sure."}, {"id": 106, "text": "Into this spanish horrorverse, and i think youll come back outside pretty disturbed, if not to say shaken. because this is some of the grooviest of soulshocking non gore horror, close to the gates of purgatoy ive seen anytime. you know everytime something sinister is at the doorstep and , at least i, couldnt help to retain my juvenile reflexes of closing my eyes and thumping my ears, only to find out that the air stood still still ...so if your not a fan of shock jolts 15-20 times in a 100 minute film then make a pass. also if convinced religious, take a nap.the story is really plain and simple, its a ghostbuster kinda thing, but the acting and the score makes this all more intense. the location and set designs are perfect for the story, and the editing and filmography goes hand in hand into the other side with bravour.i am not a real horror fan due to negative effects of films thelike in my childhood, but this is a gyssare, so wanna feel uncomfy and small kid again then watch the voices, ''voces'', its a 9 from the grumpy old man"}, {"id": 107, "text": "I was reasonably entertained, but not much more. The story is in the well-known vein of a clueless family that comes to live in an old house, that turns out to be built upon an ancient place where once horrifying things have happened, so as a result restless ghosts-with-a-vengeance spook around and turn against the new residents. There's nothing wrong with such a premise, if it's well worked out, provides some original twists and succeeds in being seriously scaring.Here I was not so impressed. The first half hour was promising, but after the ghosts appear the sinister atmosphere is mainly dominated by one jump-scare after another. Original twists are't there, the arrival of an experienced ghost-expert and his assistant, who fills the house with microphones and camera's, is something of a cliché in this kind of story, all in all it reminded me a bit of Poltergeist, albeit that here the ghosts don't polter so much, but are more of the whispering kind (hence the title Voces). In the very end there's an ultimate plot-twist, nicely made-up, but to me it didn't make sense at all, since it didn't have anything to do with the origin of the haunting. Anyway, the acting of all concerned was good, especially the little kid did a great job."}], "reviews_amount": 108}