{"name": "Ka Pae Ranasingam", "titleId": "tt11731768", "reviews": [{"id": 0, "text": "Aishwarya Rajesh shines in this movie, the first 15 minutes and last 5 minutes of the movie is so haunting that i had nightmares thinking about it, the visuals were so powerful, that the last frame never left my mind, it shows people and politicians of all different colours, not every character is either black and white but have grey areas in their personality, it shows the problem is systematic that everyone of us plays a part, this movie is a slow burner and it had its flaws but overall a strong movie, the cast and the director really done a great job, this is as close to reality a commercial movie can get, it doesn't show a solution to the problem like every other social message movie, it only showed a great amount of social evil in our society"}, {"id": 1, "text": "Aishwarya Rajesh did fantastic work. It could have been a better movie. You can watch it once. It is a social message film."}, {"id": 2, "text": "If this film was 2 hrs long, with less love scenes and accepting Aishwarya Rajesh as the main protagonist, it would have been another Aram(2017). Even though this film starts saying that it is based on a True story, we forget it 20 minutes into the film, because of the commercial elements and because of that it was hard to accept what happens later. Since this is a online streaming film you can choose to skip the scenes you think is unwanted. I loved the twist and turns which is unusual for an indian film. Hats off to the writer for selecting this story. Only if the writing was short and crisp, Kanavan Peyar Ranasingam would have been a masterpiece. I am still happy that this film was made and it makes me want more films in the Aishwarya Rajesh, Vijay Sedupathi combo. This film is hard-hitting and will leave you shaken. Definitely a great experience."}, {"id": 3, "text": "New story.... Aishwarya rajesh done fantastic work semma role.... VJS also nice.... Main strength of the flim is bgm.... Nice attempt dir.virumandi..."}, {"id": 4, "text": "When i saw the movie duration is more than 2and half hrs, hesitated to watch the film. After watching the same,i came to know the depth of the film, and the ppl who are working as labourers in abroad. Clearly showed the another perspective of lives of the labourers and the family. Must Watch film, for the ppl who desire to work labourers in arab countries and how they are being treated over there It also portrays that what will happen to a common man if he is struggling in this kind of Scenario in our country,director has made the audiences to walk in aishwarya's shoes. And shows the international politics and weak govt policies and our judiciary system of our country in this regard."}, {"id": 5, "text": "Those are the scenes are good..it reflects the current situation..but I am not digest to the character meets PM directly which she isn't supposed to do with CM..Courts only believing the fakes which Raja said courtavathu mairaavathu..that's true well said..news attention scenes are good...only celebrities news are highlighted while rest of the news are hided.overall all characters are good in acting"}, {"id": 6, "text": "It's a nice movie, first half n hour to forty five minutes was so good.. Then it was bit slow.. Editor could have edited some portions.. Other than that VJS was as usual (simply superb), Aishwarya rajesh deserve lots of awards. All the character selection n crew was amazing.. Including that PM Thatha.. Hats off to the director and the team behind their success"}, {"id": 7, "text": "It is very fantastic movie Aishwarya Rajesh once again proved his acting. Dialogue and screen place very good"}, {"id": 8, "text": "Best emotional and sensible movie ever watched! Aishwarya rajesh performance in this film deserves National Award."}, {"id": 9, "text": "About:Current social issues. AiswariyaRajesh once again stuns with Her Acting really clinical performance. A blockbuster movie for VJSethupathi after few failures. Perfectly suited character for VJS. Good dialogue delivery. First ever Blockbuster tamil movie in OTT in this quarentine. Really satisfied to watch."}, {"id": 10, "text": "The movie 'Ka Pae Ranasingam' brings a topic that must be discussed. It should be appreciated as the struggle is real.No comments on perfect acting.One thing want to highlight is the scene changes. Though the movie is longer than 2 hours, no enough time had given to change the scenes smoothly - happens so suddenly, and it is disturbing."}, {"id": 11, "text": "It really feels painful just by imaging the kinda pain/emotions that people in those real situations would've gone through. The profession of the male protagonist of predicting the rain with just his instincts might sound magical to many today's world but it is a fact that there are real people around us who're still capable of pulling this job that even today's heavy-duty machinery would find it difficult to pull it off The female protagonist has as usual done a fabulous job as the character in the film has demanded. The plot does move slowly and among a handful of govt servants, bringing in more &amp; with some twists/turn might've made it much better, maybe but the twist, in the end, was a good one although it was expected."}, {"id": 12, "text": "It's a powerful movie..Late watched but happy that I haven't missed it."}, {"id": 13, "text": "Paado jemme. This story explains how ariyanachi's struggled to overcome a problem that almost many go through in India. An eye opening story. Thirpiyo solren. Paado jemme."}, {"id": 14, "text": "Awesome movie and acting, little drag in few scenes, but good one, climax could have been a bit more gripping."}, {"id": 15, "text": "Though the film has Vijay Sethupathi in the lead role, it's more around Aishwarya Rajesh role. Inspired from real story, the film adds so much drama and tragic scenes, where Aishwarya Rajesh excels in every frame. Depicts how a women goes through all the struggle against Government officials and Foreign Country officials to get her Husband Dead Body back for performing final rites. Ariyanachi role demands so much patience, strength and moreover emotional drain. Glad this film receiving as much love it deserves, it also tells us the struggle of villages and youth in other countries."}, {"id": 16, "text": "Here is a movie that fears and scares every viewer. It reveals the allegations of governments across the world. If a poor family has to face a huge government...A big salute to the director for best screenplay."}, {"id": 17, "text": "A true-based Emotional drama. so heart touching 😭😭 Luckily got released in OTT else censor will done his part.( Especially last 5 minutes). Must Watch Movie it's almost 3 hrs but worth spending time. I liked both Ranasingam (VJS) and Aiswarya Rajesh is leading roles in the movie. Especially Aiswarya rajesh amazingly hold the story in her own way in Ariyanachi role. The movie shows exact problems we all are facing with the government officials and film practically shows how leaders those who sitting on power, how they using People to get publicity and for votes. End scene was so realistic and very disturbing it left an impact on every one. The best emotional movie for this year."}, {"id": 18, "text": "This movie is amazing . Why people under rate this movie."}, {"id": 19, "text": "Another gem 💎 by South Indian cinema. It's not just a movie it's an experience. It shows the dirty side of politics, struggle of village people. A must watch for every cinema lover. Don't dare to blink your eyes in last two minutes."}, {"id": 20, "text": "What a movie by vijay . 😪😪😪 highly apriciated. Before watch this please make your heart strong for not to cry."}, {"id": 21, "text": "Worth watching. Nice movie. The movie is a bit long but there is a lot of story to tell. As always Aishwarya Rajesh and vijay sethupathy means it's minimum guarantee for story. Based on true events. It's worth the watch."}, {"id": 22, "text": "Its been a long time since I witnessed such a strong portrayal of a woman lead, performed beautifully by Aishwarya Rajesh. Its her narration, her story, her pain, her struggle, all the way! Though there are flaws in the characterisation of supporting roles, the intensity with which Ariyanachi was scripted, made me focus just on her. Eventhough Vijay Sethupathi is the Ranasingam, he became just a primer for the whole plot to weave around him, with Aishwarya Rajesh taking the lead! The screenplay offers the breathing space for us to understand, realise and sense the pain and suffering of Ariyanachi, through each and every step she takes. The intensity was handled quite well by Aishwarya Rajesh.. This will be one such character which will be remembered for a long long time."}, {"id": 23, "text": "The movie was very emotional. Must watch movie with family. All commercial director has to learn from this movie .the climax twist was very emotional and it get affected to light hearted persons. Light hearted Please don't see this movie"}, {"id": 24, "text": "It's worth for watching This movie is not entertainment we are all think about rights🙌"}, {"id": 25, "text": "First of all a big negative for its run time. A totally clueless length for the actual story. The story line is actually simple but they dragged it with some so called romance comedy scenes which makes me to wonder why?. Though Vijay Sethupathi not starred in the so many scenes of the movie, Aishwarya Rajesh pulled off the other scenes with her best performances. But the film had its own illogical scenes as it reminded us that its just a cinema and not a reality drama. Thats was the only cons throughout the film. They should reduces some scenes for the gripping of the story. But at the end of the movie you will get emotional for the story. A good one time watch."}, {"id": 26, "text": "Casting and sharp dialogue are an asset to the film. Ariyanachi's fight for justice does get tedious beyond a point and the melodrama overtakes earnestness at instances, but that's no excuse to miss it. Very disturbing yet great film! Please bear with the slow first half! The 2nd half saves for it!! A well-intentioned, impactful but long-drawn social drama."}, {"id": 27, "text": "Aishwarya Rajesh steal the show.The film's biggest strength is undoubtedly Aishwarya Rajesh's intense performance as the determined and innocent Ariyanachi. She is a perfect choice, and needless to say, the actress is in top form and does complete justice to the character."}, {"id": 28, "text": "Though the plot is new, the execution is more (or) less same. From 1947, all movies made regarding Indian bureaucracy, only blame the red tapism and govt officials (or) an angry young man take over the system and overhauls it. This movie adopts the first approach, where the female protagonist runs errands to get the body of her deceased husband from UAE. The movie gets preachy sometimes throwing punches and criticizing the officials. The whole point of the movie is to what extent one has to go to get things done from officials which is seen in countless other movies too. The movie never shows how authorities and officials actually work. They are simply bound by the law and not to the emotional whims of the public. I would seriously like to see a movie where they show the rat race and about the uncertainty to become an IAS, IPS and how things can be tackled legally rather than criticizing these officials. Its a good watch for emotional folks and not for practical ones!!"}, {"id": 29, "text": "Can be watched once for Aishwarya.. Pandy doesn't fit the charector upon aware of his real character.. it's a kinda political drama aimed to support the sitting union govt whose aim is to suppress the rights of farmers..."}, {"id": 30, "text": "An interesting Idea developed into an average script and made into a boring dragging lengthy film. Vijay Sethupathi is over used in a extended Cameo appearance. Aishwarya Rajesh is at her best."}, {"id": 31, "text": "So boring and un-entertaining peice of screenplay, too much drama. Better to spend time elsewhere."}, {"id": 32, "text": "A brave film made by virumandi. It really felt me lively in the situation. Ghibran made his contribution through music perfectly. Aishwarya made her asusual versatile acting. I loved the story flow and plots. I was in a flow till the climax travelling the characters in the screen. The climax twist made me out from a ordinary viewer to a emotional live men inside the flim. Hope it's one of the best director touch in the ending. Overall oru Nalla padam"}, {"id": 33, "text": "Ka Pae Ranasingam is a endearing saga of a wife to get her husband's mortal remains back. Ariyanachi (played by Aishwarya Rajesh) persistently fights the red tape and bureaucracy to find the truth, behind her husband Ranasingam's (excellently played by Vijay Sethupathi) unfortunate demise.Powerful performances, and it exposes the dark side of Indian capitalism, something which Ranasingam always fought against. The movie stays with you, several hours after watching it.Worth a watch, for this long weekend. The only drawback is its length. It could have been about 20-25 minutes shorter. But, all in all, an excellent movie, with marvellous performances."}, {"id": 34, "text": "Couldn't accept the charector of collector as he doesn't fit.. Pandey meant for communal disharmony things, other than that charrcterisation is superb..."}, {"id": 35, "text": "This heart wrenching social drama is all about a widow, her hardships and fight against a corrupted community to get back the body of her dead husband from foreign country.Ka Pae Ranasingam is the most effective film to come out of OTT this pandemic season. This hard-hitting drama touches up on a serious socially relevant topic and leaves a lump in your throat at the end. A woman centric 3hour long journey carried forward by the towering performance of Aishwarya Rajesh. The exceptionally impressive act by the gifted young lady deserves more appreciation and attention from Kollywood. The last few minutes completely belongs to her. 'Makkal Selvan' Vijay Sethupathi has given his usual best, but the real problem is the forced romantic track and fight sequences to glorify the protagonist which becomes tedious at parts and deviates from the main plot. Rest of the cast blends into their characters neatly.This story could've been told in a more poignant way which gets pined away by lengthy duration. It's deeply disturbing towards the end and I'm still not able to get over it.. This film would've made more difference if it had a theatrical release. Ka Pae Ranasingam is not flawless it has glitches all along its way but still it's worth a watch. Give it a shot.Over Stretched but effective"}, {"id": 36, "text": "Occurrences like what was shown in the movie may get in to the newspapers but not to the right papers which can actually have end results.What is the issue? When can an issue be fixed? Who can fix it? Where lies the actual issue? Who can prevent the actual cause? Why is there no permanent solution despite understanding the actual cause?No questions will ever have a response. Even if it does, it will not carry any sense nor will it serve the purpose.Finally, you just need to accept the reality, that is, unfair, indigestible, frustrating and nothing but all in vain...KA PE Ranasingam is not another entertainer but TRUTH AT ITS MOST BITTER FORM...."}], "reviews_amount": 37}