{"name": "Love, Guaranteed", "titleId": "tt11100856", "reviews": [{"id": 0, "text": "With all the dud films on Netflix at the moment (To All The Boys I've Ever Loved 2, Kissing Booth 2, All Together Now) this was a lovely movie to pass the time. It didn't try too hard to be something it's not, force a narrative or leave you feeling dissatisfied.Yes, it was predictable but it was the predictability that made Love, Guaranteed quite charming in its execution. Cook and Wayans have such a lovely chemistry as well that drives the movie along quite nicely."}, {"id": 1, "text": "You just don't find love stories like this. Finally a cute love story I can watch with my family that is not animated. Thanks Netflix!!"}, {"id": 2, "text": "Sweet love story, yes formulaic - they haven't reinvented the wheel here, but a thoroughly enjoyable movie with appealing and funny characters."}, {"id": 3, "text": "Sometimes you just need that cookie-cutter rom-com where the stuck in a rut business woman meets a really nice guy (who she has, of course, underestimated). This movie has all of it. Oh no! The deadline is in two weeks? Their date was nearly ruined by a precocious kid? There's a major obstacle to this perfect romance and they can't talk about it? Whatever will they do????Damon Wayans Jr. and Rachael Leigh Cook are delightful in this movie and I found myself rooting for them every step of the way. Will it win an Oscar? Doubtful, but it's better than your average Hallmark movie and I enjoyed every minute of it."}, {"id": 4, "text": "It's a cheesy, sappy, highly predictable romantic comedy with a few laughs here and there. In that respect it serves its purpose. It is light entertainment to watch at home when you don't expect to be challenged intellectually. Don't watch if you would rather be stimulated and on the edge of your seat throughout."}, {"id": 5, "text": "Netflix keeps getting better and better with its movies! The previous Rom Com movie on Netflix, Desperados, was good but not great with co-stars from, New Girl, - Nasmin Pedrad and Lamorne Morris (as much as I love them). This Rom Com movie, Love Guranteed, featuring Damon Wayans Jr. blows past it with flying colors. Very surprised the ratings on this movie doesn't keep it a solid, 7. This movie definitely has a predictable outcome but it is a must watch movie with character and authenticity (compared to other movies now and days)."}, {"id": 6, "text": "It was an okay movie to pass the time. HATED the ending! I mean, you spend the whole time fighting this company only to BECOME THE FACE OF IT at the end??"}, {"id": 7, "text": "I wanted to like this, but the film ended up as Netflix's pandering to those that grew up with 90s romcoms. Sure, it played the formula (pretty/unconventional girl meets handsome guy in a funny situation and so on), but the leads lacked in chemistry. Jokes were flat thus missing out completely on the com part of romcom, especially since comedic timing felt stilted and unnatural. Situational comedy was used but it was half-hearted and didn't make any of the characters endearing. The film ended on a predictable note (which is to be expected) but it could have at least been built up better."}, {"id": 8, "text": "What a lovely movie. A must see. Short and really enjoyable. Cute story"}, {"id": 9, "text": "Movie is ok, nice romantic comedy, what you see is what you get. But I am super partial to Rachel Leigh Cook and after many years of wondering what had happened to her, it is great to see her again! So, not an impartial critique of the movie but rather a bit of a fan rant! Apologies!"}, {"id": 10, "text": "So what if it's predictable and simple. It's sweet and charming. We need more movies like this. Anyone can watch this. Negative reviews make no sense. What did you expect."}, {"id": 11, "text": "Enjoyable romantic comedy. Yes, it is the predictable girl meets boy storyline, but I thought the script was perfect for this genre. The look at the online dating world was hilarious. Cute movie with good acting. True, the 2 leads didn't have a lot of chemistry with each other, but their hesitation worked with the storyline Very enjoyable, clean, feel good story to watch when you want something light to enjoy. I would love to see the 2 leads in more movies."}, {"id": 12, "text": "It's an amazing movie. It's not about the predictability of it all, it's about how love is portrayed in the movie. It's about whether the movie can convince u of the love the couple portrays. If you love rom-coms, then this might actually get your attention."}, {"id": 13, "text": "After watching the trailer I was unsure but took a chance and I'm not sorry for it. If you don't love rom-coms stop right there. First, it's not a comedy. It's pretty much just a 'rom' and mildly so. Sweetly so. I watched Love, Guaranteed on a whim and enjoyed it very much. The dialogue was fresh and sincere. Nothing overly dramatic and I'm glad! other reviews said there was no chemistry and I disagree. Acting was great all around. This was a thoroughly enjoyable film for this Saturday afternoon. I rest my case :)"}, {"id": 14, "text": "I liked the leads, I think Damon is very charming and great as a romantic lead. The premise of the movie is not very believable, but regardless of the problematic plot, the story was shown in a very shallow way, it never developed into anything interesting, they didn't discuss why Arianna cheated, introduced any normal woman into the dating mix or explained why the dates didn't go well (1000 dates and all weirdos?), I couldn't understand when he actually works, if he even had a second date with someone on the website or if he was ever interested in any of them. The trial was horrible, it added nothing besides a stage for the final speech, which was OK, but didn't provide any struggle or drama."}, {"id": 15, "text": "Love Guaranteed Is about a man trying to sue An online dating service for not doing what they said they wouldIt's a Sweet simple Rom Com Format a feel good Movie and is the perfect length (Not too long)Light on the on the romance and light on the comedy not ground breaking or really special but sweet enough and knows what it needs to do"}, {"id": 16, "text": "I knew they are going to get together at the end because its obvious, they're both main actors. Anyway, its a simple, naive romantic comedy, Susan and Nick were really lovely characters and well suited each other"}, {"id": 17, "text": "For a selfless lawyer who takes to much pro bono cases and is trying to keep her business afloat, she lives a weirdly comfortable life. I counted 5 super fancy autumn/winter coats, and her car which is made to look crappy from the outside is almost sparkly polished on the inside. The details sell it, and that is exactly what doesn't sell this movie. Everything is too polished, which doesn't fit the story. Bad acting aside, the romantic kiss in the end is one of the most awkward kisses I've seen."}, {"id": 18, "text": "Of course this is predictable, that is why it is a Rom-Com. It is good to Rachael Lee-Cook bavk in film where she belongs."}, {"id": 19, "text": "A good and fast paced romantic comedy that explores the uneven ground of online dating.Worth a watch!"}, {"id": 20, "text": "If you're still watching this movie, save yourself! Pick anything else!!!!!! It's not just one thing wrong, it's just all wrong. My migraine I got while watching it is 2000% more entertaining than that movie. Save yourself!"}, {"id": 21, "text": "Terrible script, everything is so false. Dont waste your time in this."}, {"id": 22, "text": "Avoid!Predictable. Zero chemistry between leads. Amateurish actors. Unfunny script.This one goes the whole 9 nine yards when it comes to the making of an unfunny rom com."}, {"id": 23, "text": "Don't get me wrong. I love cheesy romcoms and teen movies. But this one is possibly one of the most boring romcoms I have ever seen."}, {"id": 24, "text": "If it were any more boring and cliché, viewers would drop dead"}, {"id": 25, "text": "Funny and charming it's a rom com that stays at a good pace and the actors work well with each other. Writing sometimes can be very cringy especially with Netflix, but I never felt cringe just funny and relatable. Great work."}, {"id": 26, "text": "The movie is filled with cliches and is completely predictable. There is zero chemistry between Nick and Susan."}, {"id": 27, "text": "Sugar sweet predictable and nauseous. 90 min i will never get back. PS i am a man. If your a single man avoid it at all costs. If you have a girlfriend make sure to barter, if you watch this you get a new car... Or plane"}, {"id": 28, "text": "The film started out good, with some cheesy lines and bad acting but honestly I was rooting for the characters and was having a good time watching the film. As soon as she gets the call that threatens the case (when they begin falling for each other), the plot just goes downhill. The whole aspect of being able to somehow PROVE that they're falling for each other in a court of law is so absurd. And why does she suddenly go cold on him instead of just explaining to him the details and waiting till after the court date to resume their relationship? They quite literally only have to wait a few weeks at the most and then they're free to be together. As soon as that part of the movie happened, it became personally unwatchable and I had to stop the movie because it was becoming so cheesy and quite frankly unbearable to even continue watching."}, {"id": 29, "text": "Good film, easy watch, sweet film. Its a nice story and good characters in Nick and Susan and also the law assistants Ricardo is hilarious"}, {"id": 30, "text": "Cliche, poorly developed characters, unrealistic plot, forced dialog... Perhaps this describes two thirds of the romantic comedies out there, and all faults could be forgiven (or at least overlooked) if there was a romantic spark. Sadly, there is none. Zero chemistry between the leads. They are good looking people, I'll give you that. But looks alone just aren't enough. A total waste of time."}, {"id": 31, "text": "Extremely predictable. Figured out the ending within the first 5 minutes of the movie.Wanted to give it a shot, and hoped to be proven wrong, so I sat through cringe-worthy moments, and at the end of it, I was right.Save your time for something more important."}, {"id": 32, "text": "I wasn't expecting this to be anymore than what it was, a feel good cheesy rom-com. Unfortunately it was so poorly executed that it wasn't good light entertainment. Sadly the acting was the biggest letdown for me. If you're looking for light, easy, cheesy fun, try something else."}, {"id": 33, "text": "Just sorry I spent an hour and a half watching. Should have read the reviews first."}, {"id": 34, "text": "I thought this would be one of the worst movies of all time when I saw the preview. Watched it just to prove I was right.I'm not hating on rom coms, but the execution of this one was insultingly bad. Script is so dull they must have pulled the trigger on the first draft. The scenes have no flow, very disjointed. Damon W Jrs acting is horrificly awful. Not an ounce of chemistry with Rachel's born yesterday character at all.It just wasn't fun, interesting, or cute..."}, {"id": 35, "text": "This might be predictable, but it's a very entertaining movie.You could call it a feelgood movie I guess.Nice acting, some funny moments, and just a movie you can watch with a smile.And for all ages."}, {"id": 36, "text": "A nice feel-good film with a sense of humour.You can predict the ending of this movie within the first minutes, but who cares? It's light hearted and sweet and the two main characters have good chemistry.Worth a watch if you're looking for some light entertainment."}, {"id": 37, "text": "In about 5 minutes from pushing play you can tell how it will end as per usual with these kind of movies. You have the standard gay guy, the independent woman and the predictable ending. And like in every single movie in the same category nothing is out of the ordinary. The political correctness meter is peaking, almost exploding the PC meter, and the movie itself so boring it's hard to even give it a 1 star rating. The even crazier part is - movies are so bad nowadays a 1 star is almost a standard rate."}, {"id": 38, "text": "Ok movie but man I can't stop drooling sooooo cheesy. Perfect movie for a couple of girls who want a romantic comedy night"}, {"id": 39, "text": "Damon Wayans Jr goes on 1,000 dates via an online dating agency, then sues the dating agency. You don't need to be Miss Marple to see where this romantic comedy is going., but, the acting is fine, plot is okay and in general not that bad."}, {"id": 40, "text": "Couple areas of humor in this flick but you should save your time and watch something else."}, {"id": 41, "text": "I need them to stop pushing this narrative of blcak men with hwite women. They put these two on the cover and thought this would be the one. Show me something I havent seen before like TWO medium brown complexion people in love for once Hollywood. This movie casting is corny and tired and trumps the very original idea the writer had in mind."}, {"id": 42, "text": "Basic predictable movie, extra cheesy at the end. Ok actors. Rushed plot."}, {"id": 43, "text": "...in other words, your typical rom-com. Not understanding the hate. It's cheesy at times with a few eye roll moments, and it's quite predictable, but since when does a light romantic comedy need to have complex storylines and multiple twists in order to be enjoyable? I thought the movie was really funny and the main characters were excellent and believable.If you're looking for good date night movie that's light and fun, this fits the bill."}, {"id": 44, "text": "It was solid most of the way, had some funny parts but then of course, because this is a netflix romance, they had to add the i don't even care anymore i just love you so who cares about what this entire movie was about and just hit the movie with a wrecking ball at the end, I also dislike the part where she's like wow I love this dude let me be late to the business I own and manage because....who knows then act all overly happily. Overall its ok until the end"}, {"id": 45, "text": "It was an okay film, was a bit short in my opinion. Also was very cheesy but I did like the connection between Nick and Susan. Probably wouldn't watch again, however I did enjoy it."}, {"id": 46, "text": "They took a wonderfull Concept with full of potential and Dumped it in Dumbster. No Drama the completly missed the opportunities within the film to create meaningfull drama. Cumpelsive Lack of creativity Ending. Probably the worst. They missed on an opportunity."}, {"id": 47, "text": "The ending of this movie is horrible. They could have easily won the case given the terms stated on the website. It doesn't matter that they fell in love, those were not the terms. Throwing away the case, not holding the company responsible and then turning around and working with them??? Not how it should have ended at all."}, {"id": 48, "text": "Everyone involved would know about conflict of interest client-attorney cannot date and she cud have just told him that they'll pick-up where they left off post case! Her entire personality changes literally overnight because she hugged a guy she liked and learned he may like her back!? Come on... so over the top!! Amateur acting, lame stereotypes... predictable and cringy!!"}, {"id": 49, "text": "Of course, like every rom com. But if you are looking for a relaxing rom com like I did, this is for you. It's sweet and so lovely filmed, nothing but pleasure."}, {"id": 50, "text": "That forehead kiss was steamy and adorable. Cliche with no depth but also a funny yet true duplication of online dating so in general Yup I liked it"}, {"id": 51, "text": "Seems like the movie was forced upon the actors. It was very hard to connect with any of the roles. The chemistry was severely lacking, and seemed forced in some scenes.The characters seemed to be picked so that a checklist of common hit criteria can be maximized. Which leads to an awkward, hard to believe, setting in scenes which is just bad.The only thing going for this movie is that it has an interesting plot. Everything else is sub par - including the climax.If you're reading this, I can assure you that your time is better spent elsewhere."}, {"id": 52, "text": "A very predictable movie with an even more predictable ending."}, {"id": 53, "text": "Don't get me wrong, expectations were low - sounded like it could be a mildly entertaining rom com. Looked like a fairly decent cast, therefore, a cheeky hour and a half well spent. WRONG. Hard to know what's worse, the writing or the acting. Beyond predictable. It's the sort of film you'd see in the background of a decent film; an over-the-top, extreme, embarrassing version of a romcom where the characters cut their conversation to side eye each other sighing at how bad the film is. Do yourself a favour, boil 18 eggs. Do anything other than watch this."}, {"id": 54, "text": "I am not one to write bad reviews, but other than the chemistry between the lead actors, there is nothing redeeming about this movie. The plot is ridiculous, and there are plot holes big enough for Zorro to drive through! (You ll understand the reference if you see it). I finally gave up on it when the opposing lawyer made the case that if she fell in love with her client, that would break her case, because then the dating site would have been responsible for him finding love. Was it written by 10 year olds? I am all for silly rom coms but at least try to make sense!"}, {"id": 55, "text": "I'm not a fan of romantic comedies but i enjoyed this one. Of course the plot is predictable and we all knew how it was going to end the minute it started. Still, good acting, good plot, good chemistry and relatable characters. Perfect option for those nights where you just want to turn off your mind after a stressful day and chill with a cute story. Sometimes it's nice to just lay back and watch nice people having good things happen to them!"}, {"id": 56, "text": "This was actually a really good movie. I highly recommend it for rainy days or you just want something cute to watch."}, {"id": 57, "text": "Okay, I will admit, I like a nice cringe-fest every once in a while by watching a Netflix rom-com. But this, was just unenjoyable. The scenes attempting to create drama (for example, the court parts) were lacking terribly. When they start to fall in love, get ready for one of the most *cringe* realization moments. Of course, I knew what I was getting into. So if you enjoy no real connection, but hey, they're attractive! romance, and terribly written annoying jokes and pestering unnecessary character additions, then this movie is for you. I will say, I did enjoy the special touch on the credits."}, {"id": 58, "text": "This was so bad. Like terrible! I remember when romantic movies used to good. Like sure they were cheesy but still had a good premise. This movie is not. Like at all!She's a lawyer and fell for her client. Very bad ethics but anyway. The case is only 6 weeks and they had to just not date for those 6 weeks. They were fucking making it sound like it was a lifetime! Like holy crap! With the risk of throwing the case, they don't care. Like this is stupid. So along with the damn case and date afterwards. No one is dying. So so so bad!"}, {"id": 59, "text": "A story even a teenager can write, you don't even have to watch it to know what the ending is going to be. Waste of time."}, {"id": 60, "text": "Was not expecting it to be an awesome movie(a Netflix original for one...), but ended up watching the entire thing which finished like in a jiffy! Both the main lead actors do a great job and shine throughout the film. It comes across as a simple but fun RomCom just like the ones from the 80's. What I loved the most was the consistency in the script and the honesty of both the actors which shows on screen. Saw Rachel after so long in a movie and to discover she also happens to be the producer! Good job both!! Definitely worth an evening!"}, {"id": 61, "text": "A warm classic love story. If you are a lawyer you are probably gonna go crazy about the court scenes."}, {"id": 62, "text": "I could not complete the movie. Full of weak seens."}, {"id": 63, "text": "The plot is new. Found it lame at times because if we're being realistic there is no such case in the real world, but the charm and dialogue are what lifted it up and kept me going for it.Nick Evans is indeed the perfect gentleman. This charming actor has a unique way in acting I liked his performance. Susan is adorable and she fits the lawyer role."}, {"id": 64, "text": "Love Guaranteed is a 2020 romantic comedy starring She's All That's Rachael Leigh Cook and Big Hero 6 star Damon Wayans Jr and is directed by Mark Steven Johnson(who wrote the likes of Jack Frost and Simon Birch). The story is as follows a lawyer named Susan(Cook) helps a young man named Nick(Wayans Jr) who aids Susan to help him with a dating app that his been on which goes to court over the app. However Susan falls for Nick Evans. Will they or won't they get together and will Susan win the case over the dating app.The chemistry between Rachael and Damon was nice,the story is very predictable as I knew (like in every other rom com) how the story was going to end.If you love Romantic comedies and predictable cliches then check it out.6.7/10"}, {"id": 65, "text": "Movie is simple and sweet. The chemistry between the lead pair is wonderful, and all the side characters do their job well. Good comedy, great romantic moments, and good heartbreak in the middle to set up the finish.Its romantic comedy, everyone knows the ending. Its just how we reach there that matters."}, {"id": 66, "text": "Cute movie with good acting and the script wasn't so bad for a rom-com! I love a movie that isn't too corny and I'm smiling at the end. I was entertained 😊"}, {"id": 67, "text": "It was fun to see Rachael Leigh Cook back on screen. Damon Wayans Jr. is his usual self with a touch of seriousness. What people came here for: A predictable rom-semi-com movie with an inaccurate background of Seattle (Seattle is gross). If you want to watch a decently scripted movie that will take you out of your own reality, this'll do."}, {"id": 68, "text": "Sometimes I just need a light feel-good movie with a happy ending, and this fit the bill! Rachel Lee Cook and Damon Wayans have great chemistry and I found myself laughing out loud more than once. No, the movie is not life changing, but it certainly brightened my day!"}, {"id": 69, "text": "My wife and I watched this on Netflix. It is honestly a very funny movie. There are quite a few good laughs and everyone in the cast gets their time to shine. It is like a Hallmark movie with better writing and without the terrible cutesy music they put into the background of every movie. If you want something light, quick and painless, give this a try with your spouse."}, {"id": 70, "text": "I don't understand what's with all the negative reviews. It was a solid romantic comedy. It had everything you'd expect from it. Likeable main protagonists, chemistry between them, catchy tunes and enough moments to give viewer a chuckle. And of course there's a happy ending. I really liked it. Perfect fit for Netflix's lineup."}, {"id": 71, "text": "It's totally predictable and it hits all the standard rom-com tropes, but the cast are charming and play their roles cleanly, and the script knows exactly what it is, their isn't a layer of pretense, and doesn't fall down into unwatchably bad writing because of that. All you have to do is look at the poster to know whether or not you will like this movie."}, {"id": 72, "text": "Predictable and silly. I'm glad I fast forwarded most of the movie. I couldn't believe the writing could be so bad."}, {"id": 73, "text": "At first I couldn't place the face. Was it Natalie Portman? It looked a little like Natalie, but it's not her. Why did this actress look so familiar? Ah ha! She was the girl from She's All That, a classic teen movie from 1999. 20 years later, she's a leading lady! I found her screen presence very engaging. I could see her playing parts similar to Sandra Bullock.The movie itself was quite pleasant to watch. Rachael Leigh Cook and Damon Wayans Jr. had good chemistry. I could have done without the cutesy touches that the filmmakers throw in (such as the cute text graphics).Overall, it was pleasant and a nice way to spend 90 minutes or so. It didn't create anything new or groundbreaking, and there are some similar romantic comedy Sandra Bullock movies that I liked much more. But I would definitely watch Rachael Leigh Cook again if she lands more leading roles. Damon Wayans Jr. was also excellent."}, {"id": 74, "text": "Chessy Rom com movie Nothing special what so ever Watch it if you cannot go to sleep"}, {"id": 75, "text": "So this nick guy dropped the chance to help so many children to find his chance in love. Wtf?"}, {"id": 76, "text": "Everything about this film screams Hallmark Christmas movie. Except.... it's not. You definitely have to be in that mindset in order to really enjoy it."}, {"id": 77, "text": "Sweet movie, but the ending almost ruined it for me. Also, I'm all for representation, but why are LGBT+ people always portrayed as caricatures in romantic comedies?"}, {"id": 78, "text": "If you want to see the worst attempts at jokes this is the movie for you. There was maybe 1 attempt at a joke and it was something about how her assisstant doesnt like to knock the door before opening it. Thats right that was what what makes this a comedy. The 2 stars are because rachael still looks hot."}, {"id": 79, "text": "Enjoyable, sweet movie featuring well casted roles. Only Heather Graham could have pulled off her character. Will watch again."}, {"id": 80, "text": "When picking a rom-com, you know exactly what you're getting. One person falls for another, there's some conflict about halfway through, conflict is resolved and they kiss as the camera pans out and fade to credits. This movie had all the typical elements of a standard rom-com but falls short in actual story development. All the stuff between falling in love, conflict, resolution and final kiss. This movie could have been 10 minutes and would have been better for it."}, {"id": 81, "text": "Usually I don't like predictable movies but I love this. You'd know throughout what's about to happen but you'd still love it"}, {"id": 82, "text": "I've liked Rachael since She's All That and Damon since New Girl, so that was a good start. Together they make a cute couple and have a decent amount of chemistry. The idea of ruined dates arranged through an app was quite original and gave us some funny scenes. Yet the movie didn't use its full potential, there was certainly more fun to be had. The ending was overdone, but that could be expected given the genre. All in all, a feel-good rom-com - not as hilarious as this year's Holidate, which is also from Netflix, but definitely more family-friendly."}, {"id": 83, "text": "It's a sweet movie. It shows Vancouver in all its serenity in Autumn.. though the flyovers ARE Seattle across the border. I live in Vancouver by the way... Back to the movie... Tiffany song is ALWAYS a delight to hear in this movie and of course The Umbrella Academy. It's a movie to not take seriously but cuddle up in a blanket over Xmas."}, {"id": 84, "text": "I love, love this one. It has to be my favorite Hallmarkish love story movie thus far for 2020 and it's December."}, {"id": 85, "text": "6/10 - cute courtroom romance makes for a nice guilty pleasure"}, {"id": 86, "text": "Just what I wanted ! Simple jokes and simple storyline. There was nothing unnecessary or stupid. They didn't try to send a big grand message or something. It made for a relaxing watch!"}, {"id": 87, "text": "Didn't see this movie coming.Funny and a lot of cliche corniness too."}, {"id": 88, "text": "It was nice to see RLC on my screen and Damon Wayans is always very good but the script is super run of the mill and a bit strained. Basically Wayans sues a dating company because they have a silly guarantee... that if you go on 1000 dates with their service, you will find love. He went on 1000 dates, he didn't find love, he sues. He finds Rachel Lee Cook's law firm to pursue the law suit. Over time they fall for each other. This had a couple of issues for me. I can't root for the Wayans character too much because he is one of those persons who abuses the legal system.. no matter how noble the movie trie to make it. And the ending, well, I thought it was a stinker. Instead of just a happily ever after story they have to be clever which imho didn't work. Put it on if you have nothing else to watch."}, {"id": 89, "text": "I really liked the storyline, the character of the two leads.Gave it a chance because of the lead actress, was pleasantly surprised by the lead guy, he was good. Was worried his role might be comedic because of his last name.Turned out to be a pretty cool character. Reminds of the good old fashioned romantic comedies, which I love."}, {"id": 90, "text": "The only thing that stood out was the 'swoosh' sound effect on the the opening credits. Why?"}, {"id": 91, "text": "The film flirts successfully with 90's romcoms. However, there's no chemistry between the main charachters. However, not even the casting of Damon Wayans Jr can save this movie from being annoingly boring. Go watch romcom Love and other disasters or the satire Isn't it romantic instead."}, {"id": 92, "text": "Yikes - and I wanted to like it. Some highs with her employees.... nothing else landed though, so it was a big cringe."}, {"id": 93, "text": "A tasteless movie with no progress and not much going on. Had potential and two good actors but the movie is a sleep pill with failing jokes here and there. A guy decides to Sue a dating app with help of a female lawyer Who grow on each other, and thats where the movie starts and ends."}, {"id": 94, "text": "This is probably the third Netflix production that I have watched recently that should not have been this bad. The acting was fine, the characters, the backdrop, production.... all fine. But the writing? What in the world is happening over there? These are starting out strong, great backstory, character development is engaging... And then it runs off the rails. Lazy writing, skewing down unnecessary paths. It was a pleasure watching Rachel Leigh Cook and Damon Wayans Jr together at first, but then I began to pity them as actors because of the forced trajectories their characters were sent down. And poor Jed Rees: he is supposed to be lead counsel for a major conglomerate/social influencer/top dating app and website... But pouts no fair at the judge when presenting a ridiculous objection and is shot down? I have been a fan of his since his delightful turn in galaxy quest and can only imagine how cringe he this must've been for him. Shame on you, Netflix. You have done better, can do better and should."}, {"id": 95, "text": "A good chick-lit movie. Brightens up your mood 😃 and it's said love cannot be guaranteed it's unpredictable but worth falling for."}, {"id": 96, "text": "I have never wrote a review about a movie. But just for this movie I made an account to stop people from watching it. I'm not joking these were Some of the worst 90 minutes of my life. For your own sake, do not watch it."}, {"id": 97, "text": "This movie is overly predictable, you'll see the ending coming from a mile away. I thought it was a decent concept before watching it, but was left wanting a lot more from it. The characters in the movie are either far too over the top or borderline unrealistic. I guess we will have to ignore the fact that he goes on 1000 dates in over 2 years and a half. Breakfast, lunch and Dinner. Even 3 years after a break up would be extremely ambitious/unrealistic and not to mention insane. Not a movie you can watch more than once, but it still is watchable."}, {"id": 98, "text": "It's not bad because it's 'predictable', but because it doesn't let you forget you're watching a movie. It has nothing I need to be entertained: it has no good writing, no surprises (even if they come on the way to a predictable end, one or two surprises are needed), no good acting (for instance the male lead seems to have the same facial expression the whole time), but most of all no good camera work (too much filming from the same perspective) ...'Predictable' rom coms can be good if they offer you a dynamic and interesting or really fun way that leads to a predictable end. This one mostly drags the viewer to that end."}, {"id": 99, "text": "Nothing new here. All the normal boring romcom strokes were hit and I feel dumber for it. I need to stop letting my partner pick movies because this genuinely made me angry."}, {"id": 100, "text": "Traditional rom com. Perfect for a Friday night. Good chemistry all around.For those who gave it a negative review, true it's a mostly forgettable movie. But it wasn't trying to be Schindler's List. Its just a solid good time. Well worth the 90 or so minutes it'll take to watch it."}, {"id": 101, "text": "Movie was good. Lot of one liners. Is it sex jokes and f bombs every other scene, no. But is it cute and funny, ie everything you want in a corny romcom or whatever you call em, YES!!! I enjoyed it and wife did also. Damon was very reserved, wasn't goofy etc. the leading lady was cute too. Give it a chance and ignore haters. I endorse this message!"}, {"id": 102, "text": "I thoroughly enjoyed this movie! The comedic timing of all characters was great, including Nick (Damon Wayans Jr.), Susan (Rachel Leigh Cook), and Susan's 2 office staff.While it was obvious that Nick and Susan would likely end up together, it felt very realistic, just a little at a time, and not at all contrived.The CEO of the company Love Guaranteed and her lawyer were perfectly swarmy and easy to dislike.I did feel that the company Love Guaranteed should have been found guilty of portraying lies, since the couple on their posters were models instead of a couple who had met on the website. In addition, Nick went on 1,000 dates and did not find love until AFTER the 1000 dates, so he should have won his court case.Nonetheless, Nick and Susan end up together happily, and there ends up being money for the children's portion of the hospital, so that's a win-win."}, {"id": 103, "text": "I absolutely LOVED this movie. Easy watching rom com with fabulous acting/actors and zero cheesiness. I also loved that Tiffany was a focal point and thus made Susan more real. Because who didn't have their favorite singer on repeat in the car??!!! And Damon Wayans JR made it watchable from the opening scene!! Who doesn't love a good looking lead man? Highly recommend !"}, {"id": 104, "text": "I think they did a really good job casting the two leads, they seemed to have sarcastic chemistry and since they can both act, they weren't hallmark channel caliber actors. I love a good rom com!! My attainable dream car is the Karmann Ghia, so I was also super excited to see one (Albeit needing a little work), running and in many parts of the movie!"}, {"id": 105, "text": "Clever concept with ah-mazing chemistry. These 2 just click on screen. Critics have no idea what they are talking about. Might be time for Roger Ebert to retire and th a**holes should go crawl in a hole. It was a beautifully crafted story written by those who must understand internet dating, because it is soooo accurate. Favorite line involves debriefing!! Lol. Want more fun movies like these!!!"}, {"id": 106, "text": "A witty script with a couple with perfect chemistry. Set in Seattle with awesome opening about pumpkin spice lattes. No idea why it's gotten bad reviews, but looking at other classic RomComs like Sweet Home Alabama...I think critics just don't like RomComs."}, {"id": 107, "text": "A very engrossing yet good romantic film.I know the concept is old but it was a good movie all together with the 2020 touch to it with the flavour of Netflix movie with wonderful cast and cinematography as a romance movie should be."}, {"id": 108, "text": "I enjoyed the movie. Great chemistry and a nice ending. Feeling good."}, {"id": 109, "text": "Yes, it's predictable romcom movie like any other romcom. What makes it enjoyable is the plot, realistic scenarios. No sizzling scenes. Clean romance which can be watched with family. No scene seems to be too dramatic or exaggerated.2 points goes because the plot could have been developed into dramatic romance and comedy. The movie is weak on comedy. Yet its fun to watch"}, {"id": 110, "text": "Overall a good movie to watch both the characters did a good job"}, {"id": 111, "text": "Great feelgood movie! I really recommend it! Great actors! 10/10!"}, {"id": 112, "text": "This movie is not bad. I think people who like romantic comedies with some cliches will totally like it."}, {"id": 113, "text": "It the best among the Romcom. Loved it.Though there was nothing unpredictable, the whole story wasn't dragging. It, rather glued me into it.Both Damon &amp; Rachel portrayed their characters well. They gave justice to the part!"}, {"id": 114, "text": "I liked both protagonists, it´s a silly and lovable rom-com."}, {"id": 115, "text": "This romantic comedy is really sweet. And it is funny as well. I really enjoyed it."}, {"id": 116, "text": "Rom-coms these days, especially TV produced ones, are usually pretty dang disappointing. This one is actually quite cute with a few flaws sure but overall me, and even my fiance, really enjoyed it. Rachel Leigh cook is great."}, {"id": 117, "text": "Decent movie, but with a non-original love story idea. But the movie is built on a huge lie. The setting was in Seattle, and if that was the case, the city would have been overwhelmed with rioting, looting, arson, and murder going on in the streets. That is today's Seattle, and that will be tomorrow's Seattle. Same as in Portland as well! Well, same as in all democrat ran cities! They are all burning cities. spiraling down into the gates of hell. 🤣😂🤣"}, {"id": 118, "text": "Super cute love story and clean the whole family can watch. No profanity, no dirty jokes, cleaner than a Hallmark movie but still very entertaining."}, {"id": 119, "text": "Let's face it. Life is incredibly tense and scary right now. COVID-19, economic uncertainty, politics that make your head spin, practically biblical plagues and other crises. You need a break. We ALL need a break!This film is funny, fun, sweet. The characters (even the bad guys) are all likable. The supporting characters are delightfully ridiculous. The loose-cannon surprise character tosses in just the right amount of suspense... The main characters are nice, normal folks with flaws. Will they get past their own baggage enough to make a happy ending? It's worth waiting them out...Love, Guaranteed gave me just the right amounts of refreshing and uplifting. I laughed. I cried. That's what I want from a romantic comedy!"}, {"id": 120, "text": "Sweet, charming, enjoyable. I really really liked this movie. Most romcoms have a happy ending so it is not a spoiler to make that statement. But how they got from beginning to ending is what made this movie a pleasure to watch. I am a doctor so I try not to watch medical shows on TV. They are so unrealistic. I suppose if you are a lawyer you will not be able to tolerate some of the legal stuff in this movie. But setting that aside, I enjoyed seeing the various interactions between the good guys and bad guys. I laughed, I felt moved, I thought the cast had a lot of very attractive people in it. Thank you Netflix."}, {"id": 121, "text": "This PG rated Rom Com is such a nice change from the trash that Netflix has been putting out lately. Although it's a typical and predictable story, it's got great wit, great acting, and memorable characters. There are also some nuances of the film that make it much more enjoyable and add character to the setting and plot line. No politics. No agenda. Just good, clean, family fun. Highly recommended for some laughter and warm fuzzies."}, {"id": 122, "text": "This movie is sweet, charming, and comical. Yes, it's predictable but who cares? Who isn't excited to get a new movie during a global pandemic? RLC and Damon Wayans Jr are great together. Love this movie! Highly recommend!"}, {"id": 123, "text": "Idk if 10 of my stars are worth it. But I watched a second movie on the same day after that. And in the end of the day all I was thinking about was Love, Guaranteed. It's a really good story with a beautiful couple to be. The actors, actually the leading actors, had great chemistry! Deep down I was wishing to find love like this."}, {"id": 124, "text": "It was okay not the worst rom com movie I have seen it passed the time,it was some funny moments in the movie, and some sweet moments in the movie"}, {"id": 125, "text": "I like Damon Wayans, Jr and Rachel Leigh Cook and I like ALL of the cheesy rom-coms and romantic dramas, but this was just ... dumb. It's beyond simple, but has way too many that doesn't make sense even for a basic romantic flick that had me shaking my head pretty often. The nail in the coffin for me was the drama that resulted from Susan avoiding Nick and just calling off whatever was just getting started between the two of them. All she had to say was Hey, we need to quit whatever this is until the case is over. It was that simple. These movies always have some ridiculous drama that could've been prevented by a conversation, but this one is so utterly ridiculous -especially when it comes to winning a lot of money."}, {"id": 126, "text": "This formulaic rom-com might have worked if the two leads had an iota of chemistry but they do not."}, {"id": 127, "text": "A generic romantic comedy. It's about a guy who wants to sue a dating site because he didn't find love, based on company policy, hiring the services of a lawyer to help him through the process. Predictable like all of its kind. It is not something that we have not seen, we already appreciated it in Love is expensive with George Clooney or Love at second sight with Sandra Bullock. Entertaining Quality. Pick up on the romantic comedies of the 90's. If you ever had an online date, you will feel identified. With light sexual jokes."}, {"id": 128, "text": "Love, Guaranteed is up there with Hitch. It started out slow, but the plot twist was worth it, with a stellar ending! As a straight male, I was in my feels a couple of times lol! I would definitely watch it again."}, {"id": 129, "text": "So when I watched the trailer I was under the impression that it was going to be through the eyes of Damon Wayans character, Nick however it was quite the opposite. They never really touched on why Susan was single or what happened to her previous relationships. All we knew was that she didn't really have time to go on dates, she did a lot of pro-bono cases as a lawyer and lived right next to her pregnant sister.There wasn't much depth to her storyline especially as she's considered the main character, later on we do find out about a previous relationship but its the only time we really here about her love life. If you didn't already know Damon Wayans Jr has starred as Coach in New Girl, Brad in Happy Endings and has starred in a variety of hilarious comedies. I think the writers really missed an opportunity to make him the romantic lead which I think could've saved it.All in all this film was full of missed opportunities and random story points that lead to nowhere. They could've shown more of the 1000 dates that Nick had been on adding a comedic relief that was much needed. I would have also liked a connection to the Tiffany song 'I Think We're Alone Now' which played several times throughout however was only acknowledged once when we learnt that the tape is stuck in Susan's car and is all she listens to while driving.This is definitely one of the worst rom-coms I've ever seen and I've seen a lot of cheesy Hallmark Christmas films. I saw where they wanted to go with the film, and the storyline had a lot of potential but unfortunately didn't hit the mark for me."}, {"id": 130, "text": "And that's too bad cause it falls short of most Hallmark films I've seen. I like a lot of the actors so I watched. It lacked energy. I'm a big romcom fan, but this wasn't smart or interesting or fun or well acted or well written.....I thought my bar for romcoms was pretty low, but not this low."}, {"id": 131, "text": "This movie made me laugh and made me smile. It's very beautiful and the courtroom confession omgg!!!!"}, {"id": 132, "text": "Nothing overly original here but it is done better then average... If you're looking for a feel good film, give this a try..."}, {"id": 133, "text": "Well storyline althou its simple. Online dating works. Fill with all kinds of ppl."}, {"id": 134, "text": "It was a cute story and clean which is refreshing for once."}, {"id": 135, "text": "I just loved it. It was romantic. Two beautiful people that are so good hearted finally meet and fall in love. I just loved the ending."}, {"id": 136, "text": "I didn't hate it, but not one of the better Netflix romcoms. Main issue was the use of the old standby of lazy writing - these characters have a problem, so rather than talk about it like normal human beings, they're just not going to so there can be conflict in this movie. Also the characters were alright but not overly likeable, I wasn't particularly rooting for them"}, {"id": 137, "text": "Only reason I started watching this movie is because of him. Funny, cute, good actor, family lineage that I grew up with my whole life. But I just don't know which one to blame. The writing, directing, or editing. Maybe it's just not my jam. Idk. It'll all be worth it if we get more DWJ in our lives, that's all I'm saying lol"}, {"id": 138, "text": "This movie is exactly what you would expect it to be, in a good way! It's also lovely to see Rachel Leigh Cook as a leading lady again... and Damon Wayans Jr., who never disappoints!"}, {"id": 139, "text": "This is your typical love story where you know the two main characters will get together but it still manages to put a smile on your face.It is a nice, happy and romantic movie with a feel good to it.I thought it was alright. I had a few giggles and it made me feel good at the end.Rachael Leigh Cook looks just as gorgeous as she did when I seen her in the movie she's all that and Damon Waynes Jr reminds me so much of his dad. Funny too.Would I watch it again? Yeah probably."}, {"id": 140, "text": "Cook not only stars, she also produced this cute movie. Hallmark should pay attention to this movie, that brings us a family friendly rom com without strictly following the same formula as dozens of other films. Cook did bring along some of the best supporting players from her Hallmark days. Bizarrely, Heather Graham costars. Yes, Roller Girl is now playing second fiddle to Rachel Leigh Cook."}, {"id": 141, "text": "Script has an interesting half-comedy/half-cartoon quality, silly and upbeat, punches OKCupid on the nose. Are you game? Actors and director all aboard; performances straddle the line between rom-com kooky and a Disneykins character. Rachel Leigh Cook is a quirky, neo-Holly Hunter and Damon Wayans Jr the cranky, Cary Grant-style leading man. Distinctly screwball millennial tone with a gooey heart of Reese's. Sweet!"}, {"id": 142, "text": "But folks, this film has me in several versions, in several meetings, all very real, and it seems like an exaggeration, only those who are not so much, should be recurrent, strange encounters, cakes, and many meetings between cafes, lunches and dinners, but always taking something good from each meeting... Excellent, real, fun, romantic and adorable..."}, {"id": 143, "text": "This movie was fantastical I was awaiting upon the arrival of Susan's angry ex but he never descended his current location. I am nearing the end of this movie and I would just like to share my thoughts: 1) I think that the main male character should have taken off her car door and hid it in her office so she thought she'd lost it but in fact he had been hiding it in plain sight 2) I believe that Susan should've been his last 12 dates and she should've turned up in various disguises."}, {"id": 144, "text": "I am incredibly surprised by the low reviews and question whether these people have a heart or a sense of humor. I absolutely loved this movie. It truly has some lol moments, very relatable - of course a little cheesy at the end but overall a very fun and entertaining movie. I also very much appreciated the absence of foul language or crude content, which is hard to find these days while still being funny. I about died when Tiffany's I think we're alone now came on in her car - it was the very first cassette tape I ever owned in the 80's. 😂🤣 So maybe this movie is just only relatable for a specific target audience like myself. 🤷‍♀️"}, {"id": 145, "text": "Love,Guaranteed is a watchable romantic comedy that had some cute moments and parts of story that werent fully horrible and in least it had a very likeable characters and a solid and sweet story in it.There were plenty of moments that were predictable as hell and it was easily guessable how this film in the end,in other words like many romantic comedies realeased now days,it diddnt offered nothing new to a genre and it felt a tit bit old fashioned for its own taste and like they passed border with such ideas,Love Guaranteed was a watchable film and it is better then some of this year realeses but it is still more of the same in end"}, {"id": 146, "text": "Love the idea for this story, but they missed some opportunities. Loved that Damon Waynes Jr was the lead because he made this enjoyable to watch. Sure his story line - dating 1000 women is quirky and seems unrealistic, but that's what makes this a fun, cheesy flick. However...like dating websites -this film over promised and under-delivered. Which is why I gave this six stars. I couldn't relate to Susan (Rachael Leigh Cook). There's no way I'd drive a car with the cassette stuck in the deck for that many years- too unrealistic."}, {"id": 147, "text": "Nothing extraordinary and nothing too ugly. A movie that will keep you good company on a Saturday night, but you wont remember it after two weeks.Happy to see Ms. Leigh Cook in a genre in which she is actually good and with which many of us have grow up seen her."}, {"id": 148, "text": "My husband and I really enjoyed this movie! It was cute, clean, and funny. We laughed hard at the your water is gross part! The leads had good chemistry and the side characters were fun. Good character development and the romance was sweet! Great movie!!"}, {"id": 149, "text": "This movie has the Hallmark movie feel. Terrible acting and predictable plot, but still super charming and loveable. It's a light hearted entertaining movie. Would recommend."}, {"id": 150, "text": "I mean come on guys, what did you come here for, if not a cheesy romcom?? Let's get real now. I just wanted something light and fun after a long day at work. And I LOVE Damon Wayans Jr. Because I'm not a huge romcom fan I came for him, knowing I'd get a cheesy fairytale ending. So I'm not mad at it at all! They threw some fun characters at you, dates, sidekicks, family and friends. They were fun too. So if you need something easy to watch, and amazing Damon and maybe been some awwwwww in your life watch it."}, {"id": 151, "text": "This movie was decent, though...no I guess it was decent. Kind of a feel good movie. The actress was nice to watch, though nothing special at all. The main actor was good....The storyline was alright too, good. I think the main actress had an interesting life in the movie. I wasn't taken back by the player aspect of the man, but the woman was interesting. I liked her life, living arrangement, work, career, and somewhat her attitude. She was fun to watch. Heather Graham was also in it, and I liked her character.Might or might not recommend.6 stars"}, {"id": 152, "text": "I guarantee the love and feel goodness in love guaranteed."}, {"id": 153, "text": "Nothing new about the concept. Just a modern way of putting things by getting the comparison between the online dating and old school love. The story at some points does bring a smile on your face. It's straight forward story with no dramas. I found acting of both the leads effective and cute. Those who likes romance, go for it. No surprise but happy ending."}, {"id": 154, "text": "Truth is, these stories write themselves at this point. If you want a cute film that checks all the boxes this was it. The leads were adorable, enjoyed the assistants, Seattle is a nice touch (not many besides take place Sleepless in Seattle), music was good, and overall simple. Rom-Coms that check the boxes correctly can be good and one aspect I liked overall the characters outside of Tamara Taylor were not written with force-fed troupes. In some weird way I could buy this as a stretched out true story with the Hollywood spin. It is a simple popcorn flick to not think deep into."}, {"id": 155, "text": "Predictable? Yes. Cliché? Yes. Cringy? Sometimes. But honestly, up to the scene where Rachael dances into her office I was enjoying it. Then it became a little tedious and poorly written. Would not necessarily recommend but wouldn't tell people to steer clear either."}, {"id": 156, "text": "Overall ok movie. Nothing special, but no major holes."}, {"id": 157, "text": "I enjoyed the movie although predictable! The universal theme of godd should searching for love and the unexpected answer to their search was charmingly written and a little funny."}, {"id": 158, "text": "It turned out to be a simple, classic and honest love story. The characterisations are beautiful and the ending of the movie is beyond any one's imagination. A clean movie indeed.."}, {"id": 159, "text": "This flick certainly won't win any awards for its plot, but it's a fun, predictable love story featuring a pretty descent cast, some above average acting against a beautifully shot Seattle backdrop"}, {"id": 160, "text": "I've seen over 20,000 films in my life and this is definitely in the top 5. Just breathtaking."}, {"id": 161, "text": "It is that a good romantic comedy with an original idea for this time i think. If you want to watch a not boring or drama movie with your partner i can recommend you this one."}, {"id": 162, "text": "The main character states in the beginning that the lawsuit is a gotcha cashgrab, and it is. The only thing that changed is that she decided she liked the defendant and his plans for the money and also her firm was broke. Furthermore, the assertion that the defendant was not looking for love is a true one. He stated that he planned to hit 1000 dates and test the guarantee. Also there is no way he could go on three dates a day and not become too detached to form a relationship with those girls. He was going into each date expecting it to fail. In fact, one of the girls he dated even stated that he might have thought he was looking for true love but she had the impression he was proving it didn't exist.Finally, there is a stupid line implying that nobody uses dvds anymore which I found pretty cringey considering Netflix's current position as a streaming platform. Physical media collecting is very much alive. I have over 300 blurays myself and know of several online communities dedicated to their collection. I gave it 4 stars for the four times I laughed. Some of the writing in the first half was pretty good."}, {"id": 163, "text": "Damon Wayne is such a great actor and I feel like he couldn't use his full acting potential on here afraid he would overshadow the other actors. The main girl character was ok and side characters were funny."}, {"id": 164, "text": "Okay, so I'm trying to figure out why this film is receiving so much negativity. For those reviews that say they were able to figure out the ending in the first 5 minutes of the film, congratulations. You should have figured it out from the three or four line plot description and the fact that it's a romantic comedy.All romantic comedies are predictable. So if you don't enjoy that, then what an earth are you doing watching it? It's a fairly silly decision to make isn't it? I think you should really focus less on writing bad reviews and more on brain development. I suggest the elevate app if you have the means to purchase it.The boy meets girl and they fall in love story will always be the centre of a romantic comedy. That ain't hard to figure out. What's different is the story of how they meet and fall in love. And I for one thought this film had a nice, fresh story of how the lovers meet and get to know one another. I've certainly never seen it before.If you like cheesy rom coms which I think everybody should once in a while, then this movie is for you. If you're sad and bitter about the world and prefer to be negative, then it's not for you. To be honest, I don't know what is for you. Maybe some anti depressants."}, {"id": 165, "text": "This movie is a romance movie of a TYRONE getting a clumsy, middle class girl who drives in a run down car who so happens to be his lawyer.They meet by the typical bump into and then the simp, mushy stuff appear, and I feel bored.In this movie you get to see a lady assault a man with a highlighter. And a lady hit her own lawyer. Imagine if the role was reversed.(they censor somethings then allow others to get away with being violent')Overall, the quality looks good. The story had potential it would have worked better as a comedy romance.Verdict: Its a week movie. This guy went on 1001 dates I can't even get one. #incel"}, {"id": 166, "text": "You come home after a long workday and you'd like to relax, unwind, watch something lighthearted and new that has a hint of originality - not another superhero flick or a reboot, thank you very much (I do realize there're other kinds of movies but these are the easy targets so just.. shhh, let me finish.) You can't go wrong with this one.The premise of the movie is simple enough: Nick, a heart-broken, honest no wrong-doer sues a dating app company over the misleading promise of a guaranteed love. To help his case in court he hires the young, beautiful and celibate lawyer, Susan, a Jake Brigance-type woman of the people who self-proclaims as standing up for the little guy. You can already see where this is going, and I'm not here to convince you otherwise, that this is a genre-subverting, trope-mocking self-aware movie: it isn't. In fact by around the first quarter of the runtime you could guess what the ending might look like. But!... despite all the that, it succeeds none the less, and here's why:For one, the writing (narrative, character dynamics, dialogue) is engaging. The premise is interesting enough to get you to click and although the plot-line, to an extent, is predictable, it's never boring. It checks all story conventions without somehow falling prey to it and I couldn't but follow and fall for what I knew was coming (movie magic, amirite?) It's well-written, the story expands a bit and then is tied back together perfectly by the end. It's funny all the way through (stick for the ending credits) and heartwarming and might even get you to drop a tear or two.The characters serve their purpose and then some more! They're entertaining, lively and fun to watch. You got Susan's quirky co-workers; the antagonist- how should I describe her... imagine if Goob (Gwyneth Paltrow's company) was a person and it started a dating app company; the wise old man; Susan's sister and her family who seem to have their own thing going for 'em, adding a bit of 3 dimensionality (is that a word?) to the movie. And then there's our main couple, cute and adorable, rom-com style.Side note: In the Romantic Comedy spectrum, the movie tilts more toward Comedy, but I think it had the potential to be more serious (ever seen Love, Rosie or About Time?) Now I don't know if it would've been a better or worse movie for it. Maybe it would've made for a deeper, richer, more re-watchable movie; or maybe it would've made the tone off-balance or something... I don't know, just throwing that out there.If I had to 'critique' it, I would say that it felt like more of Susan's movie than Nick's. Everything we know about him is 'economical': it serves a purpose in the narrative. That isn't a bad thing in its own but when you contrast it with her and what we learn about her life, Nick's character falls somewhat under-developed.I don't know what else to tell you, watch it and you will probably like it; don't and you won't be missing all that much. Time flew by when I saw it and if this was playing in the theaters it would've been a good day at the movies' for me.M"}, {"id": 167, "text": "I took a chance on Love, Guaranteed on Netflix mostly because I wanted to watch a sappy romance, and I thought this sounded like a decent concept for a rom-com. A man who brings a lawsuit against a dating website for guaranteeing love is a timely topic, and the irony that he falls in love with the lawyer he hires is a cute idea. I also thought with this cast it would be a legitimate movie, because there are a few movie names in there that I wouldn't expect to be in a shoddy made-for-tv romance. (And it's hard for me to resist anything with Rachael Leigh Cook.) Sadly, I was wrong, because this is straight out of the Hallmark Movie handbook. It doesn't take place at Christmas, but otherwise this is cheesy, and utterly lacking in any solid story-telling. It's kind of embarrassing how bad the writing is throughout the film, and they don't even keep a logical storyline going. It's one of those films where things just happen because the movie needs them to happen, not for any good reason.The saddest thing about Love, Guaranteed is that even when I turned off my critical brain and accepted the kind of schlock I was watching, it didn't deliver on either of the most important points. For starters, it was completely unfunny. Even the montage of bad dates they show are such played out jokes that it didn't make me crack a smile. The supporting cast of wacky characters were utterly lacking in anything funny to say (it was kind of pathetic.) I struggled to even laugh AT the movie because, while it was incompetent, it wasn't in a humorous fashion. Likewise, the romantic moments in Love, Guaranteed were lackluster. I didn't have that warm swell of emotion as I watch the couple finally realize they belong together. The romantic speech was poorly written and didn't have the kind of pay-off you want to feel from this kind of sappy film. While I've seen worse excuses for a rom-com than Love, Guaranteed, this is far from good and I think even someone desperate for romance would be more satisfied with the cornucopia of other options out there."}, {"id": 168, "text": "I caught this on netflix, and thought it was amusing in spots, It has great leads, and a sweetly well told story. But was it all has it should be?Rachel Leigh Cook and Damon Wayans Jr are both very talented performers, and play there parts well, but together they just didn't really click, sparks didn't fly with neither one. I feel the movie could not decide if it was trying to a comedy or drama, because the laughs where few and far between. And just when the movie pretends to have surprises, and then it says no we don't. Heather Graham is not much of a character she's a cliche waiting to happen. But all in all an amusing film, despite what I said, I didn't hate this movie, it's a good way to spend 90 minutes. I thought Rachel Leigh Cook and Damon Wayans Jr where good in this, just not together."}, {"id": 169, "text": "Really good watch, would watch again, and can recommend.I love the opportunity to see Rachel Leigh Cook act again. There are a few moments in the movie where she's a little stiff, but I'm quickly reminded that she's playing a stuffy lawyer type as she goes into a highly emotional mode.Damon Waynes Jr. is great and not only embodies a level of cynicism that also makes him act stiff in a couple of points, it clearly shows his character is cynical because of how open he actually is to love.The writing itself holds some great values, from its concept of the legality of corporate lying, and testing the bounds of a terms of service agreement through such a ridiculous implementation as 1,000 dates to using a situation to do something good for charitable service (like a rehabilitation clinic) to capitalizing on situations despite the cost.There is a lot of good drip feeding of information despite it not being a mystery movie. The discovery being used as a character building is a really good mechanic and you don't see it very often.I think most of the credit goes to the actors for bringing such charming characters and situations to life, but I'm just glad that there is a 30's style romantic comedy this good out there."}, {"id": 170, "text": "Love, Guaranteed (3 out of 5 stars)Love, Guaranteed is a fair romantic comedy film that is cute with its cast ensemble and entertaining love story. But filled with a cheesy script and direction. And a predictable outcome. It is about Nick (Damon Wayans Jr) who hires a lawyer Susan (Rachael Leigh Cook) that he wants to sue a dating app called Love Guaranteed. That after 1,000 dates he did not find love.A cute and fun predictable love story. Nick is a gentleman and courteous. Susan is a loveless lawyer. Which her team sets her up on that app to date. And come across awkward and weird dates that did not match there own profiles. Which is true about the reality of online dating. Which is funny to see on film. The boss of that app played by Heather Graham was entertaining. Which she tries to play as a love guru.The film is filled with cheesy dialogue. And a cheesy direction. The cast ensemble sells it. With the charming Rachael Leigh Cook which is nice to see her make a come back. The last thing i seen her in was She is All that. Damon Wayans Jr. was also good playing as Nick as well. Along with Heather Graham.It is a cute and fun romantic comedy film but not really something that would stick out to the rest in that genre. Entertaining but easily forgettable."}], "reviews_amount": 171}