{"name": "Dune Drifter", "titleId": "tt11835714", "reviews": [{"id": 0, "text": "This story was dragged out with pacing slower than a snail. I barely could stay awake. This may have been bearable if it was a short film. The acting was amateurish and the directing terrible. I guess the filmmakers didn't even have faith in their own film... of the 9 current reviews, all of them are clearly bogus and convenient 9/10s. That's pretty sad. Don't waste your time on this mess, even if you're bored."}, {"id": 1, "text": "This movie just was not good at all in any sense. Too bad, I looked forward to a new chapter. The fake (obviously fake to anyone unbias and truthful who actually see it) reviews are laughable. This was a true waste of time by a bad script writer and producer and I wish someone who have been honest enough to call this before it went out to the public... it was a dying horse from birth. Arrrgh as Charlie Brown would say. It is time I wish I would have spent better. If you don't like it from the first 5 minutes, it is just more of those 5 minutes put back to back to back to back. Sorry Kyle, they didn't live up to the name."}, {"id": 2, "text": "Really? It's one of the worst movies I've ever watched. Couldn't even watch it all the way. And to steal the name of a movie that's about to come out...so lame, man. So lame. Are you expecting to take some of their money by baiting people to go and watch it? Just sad... And what a coincidence, that all people that said it was good, gave it the exact same rating.....NINE stars. Are you really going to give it the same rating THE GODFATHER has?!? Have you no shame?!? Even if the story was good, it still couldn't pass FIVE stars. AND YOU GAVE IT FREAKIN' NINE !!!!!"}, {"id": 3, "text": "I had to try. I love SciFi, but i knew this was going to be a roll of the dice.I lost.This movie was stupid from the very first 10 seconds of the movie - all the way until the end.The special effects were pathetic - like..... horrible. A Middle School class could do better with some flashlights and plastic wrap. Story? Dumb. Acting? Equally dumb.Run for your life."}, {"id": 4, "text": "Why is so much of this movie shot with such tight shots on the actors? Seriously, about 45 minutes of this 90 minute movie is practically shot up the actor's nostrils?The result is making an already dull movie almost unbearable.The story is bad, the directing is bad, the acting is bad. The dialog is idiotic. The special effects would be laughable in a movie made decades ago. The texture mapping on the space ships is especially poorly done.Everyone involved in this film should seek other careers.Someone decided this would be good for movie night because of the deceptive name and artwork they were duped into thinking it was a Frank Herbert movie - It isn't. We watched it (frequently hitting fast forward) more to punish the person who selected it."}, {"id": 5, "text": "Looks like old Star Wars stuff, except without the acting and thrill of the Star Wars movies. We watched, we yawned, we turned the volume down and we gave knowing looks, eye rolls and laughs. Sorry guys it just wasn't put together well by a great team. Not everyone is a writer director or actor."}, {"id": 6, "text": "How can we sell this piece of movie gold? Think damn you, think!I know! Stick the word DUNE big as brass on the cover art, then add the word Drifter in tiny writing.Right, that's the plan, meeting adjourned."}, {"id": 7, "text": "Both Humans and Aliens must be getting their plasma coils from ACME Rocket Ship Parts Inc.Oh and Alien like wearing jeans"}, {"id": 8, "text": "So, 10 users review this with 9/10????? please don't waste your time!"}, {"id": 9, "text": "It's definitely not going to win oscars but for a low budget flick it actually wasn't bad. Pacing was overall fine, acting was sub par and it wrapped up very fast but that's to be expected in B flicks. Worth a one time watch for those not afraid of B movies."}, {"id": 10, "text": "Abysmal acting, abysmal space combat, abysmal logic, easily the contender for one of the worst movies of all year. Left after 30 minutes to watch something FAR more enjoyable. If you want some indie sci-fi worth of watching go with 10th Cloverfield Lane or the two (second installment included) Iron Sky movies instead of this abortion."}, {"id": 11, "text": "Dune Drifter is another one of those movies that are made when a bunch of inebriated friends get together, collect the small change in their pockets and decide to make a movie.The same guys then ask a random thirteen-year-old Star Wars fan to write a script on the back of an envelope. And the kid does this in the school bus, while going home.I think that is the best way to summarize Dune Drifter.It is bad, really bad."}, {"id": 12, "text": "Following a very noisy Star Wars type battle in the vacuum of space, Phoebe Sparrow is marooned on a planet and needs to cannibalize an interchangeable part from a crashed enemy alien ship. I expected them to copy Enemy Mine at this point, but they did not.Very boring.Guide: NO swearing, sex, or nudity"}, {"id": 13, "text": "It started with a space battle.... like star wars. the graphical UI pays homage to 80s sci fi flicks. the spaceships looks basic.then we have the survival thing after the ship crashed on a planet. and some paintball suit guy with gasmask and a nerfgun hunting the protagonist. super boring. could have been a 10 mins short film.this movie left me sitting in the middle of my seat while playing with my phone. give it more than 1 stars for effort."}, {"id": 14, "text": "My cat barfs up better looking hairballs then this movie."}, {"id": 15, "text": "The Asylum movies are way better! And we all know how crappy are those movies (except Sharknado LOL).Dune Drifter has nothing to do with... its title, Dune Drifter is so boring that you might suicide yourself... twice, in the middle of the... Sorry I can't call it a movie.After watching that... thing, I came immediately here to try to prevent some suicides with this review! Be careful, boringness, dullness, dreariness, insipidness await you if you watch this!I also discovered that all reviews with a 9 out of 10 were made from cast members... click on their username some of them have no shame as it is clearly written that they were part of this thing ;)"}, {"id": 16, "text": "A budget take on sci-fi, and it shows. The various components of ships, weapons and suits are very recognizable and does not look like advanced technology. But ok, maybe that's what they were going for. The story is paper thin, there are some suspenseful moments that work well, and the little acting involved isn't horrible from the main character. The CGI is cheap, and I keep thinking things are too repetitive, lumpy and cumbersome. A lot of it is probably due to what we are used to seeing in more expensive sci-fi. I read a review where someone said it could have been a short movie, and it would have covered everything they needed. I second that opinion. A 25 minute feature wouldn't be out of place."}, {"id": 17, "text": "I really wish they'd had a bigger budget so the SFX could have been better. The lead actress is pretty good but the other one (Hazel) drove me crazy with her overacting and making noises like she's turning into a zombie. There's nothing new here but it could have been worse."}, {"id": 18, "text": "This was so slow and boring ! The only explaination I could come up with to why this movie exists, is that it acts like a trap for people who don't pay attention and think they are going to see Dune."}, {"id": 19, "text": "Well, I admit I wasn't expecting a lot, but as soon as I saw the space suit helmets full of lights inside, I knew what I was in for. Inept movie makers cannot resist doing this, to make the lighting job easier. Any dimwit can see that if your helmet is full of bright lights, you won't be able to see a thing outside. Even so, I was unprepared for how bad this mess really is. I love Sci-Fi, and am usually pretty forgiving of mistakes, as it's hard to find a piece of watchable space opera these days. And there are those rare gems that somehow find their way to a release of sorts. This is neither of those. Rather, it distinguishes itself as one of the worst movies I've ever seen, on all levels. Could have been directed by Tommy Wiseau. I really can't say any more."}, {"id": 20, "text": "OMG!!! 100k $ budget?! Thats way it was some stupid film. Dont waste your time, its a total BS!!! From plot, the scenes, actress. OMG what a BS"}, {"id": 21, "text": "It's so bad, I can't even consider THIS to be a movie.The fake 9/10 star reviews from the actors who happened to be in this crap are simply disgusting and offensive."}, {"id": 22, "text": "I've seen plenty of terrible no-budget films, and this is probably the least interesting. Keep the mind bleach handy if you're daft enough to watch this. Abysmal acting, half-baked script, tuppeny sfx, and the lowest production values in the known universe. The aliens wearing off-the-shelf Vietnam-era gasmasks is the icing on the stalest of cakes. I've seen more realistic episodes of Thunderbirds."}, {"id": 23, "text": "This is not a movie Alert! Albert!! This is just a fun made video Alert!! You better not making sci-fi videos again, it's some kind of idiotic story and acting just for kids."}, {"id": 24, "text": "Come on first this movie does not deserve a 1 its not that bad of course clear up the fake reviews with the 8-9-10 too because it certainly does not deserve such a high rating.The effects are quit good if you compare this to the awful asylum movies. For the budget they did a great job with that. Looking at the FX the costumes and all they where able to do this with 100k even the spaceship battle at the start of the movie are well done.Its a sci fi very low budget movie. I am giving it a 5 for the effort also the acting was not that bad compared to today standards of beautiful people with no brain."}, {"id": 25, "text": "I FWD it several times through the absurdly Boring parts, to conclude what I figure it'd be the simplest of plots at the beginning, but I was hoping to actually see a lot of interesting turns of events, that never happened. This was a scam to get a quick buck, a 4 year old would have imagined something better; all the people involved in this catastrophe should be shamed of themselves, I wish I could give it -10 stars, 1 is way too generous"}, {"id": 26, "text": "I'll usually give a movie a go, no matter what the ratings and reviews are like. This movie, well, I'm kinda on the fence about. It took a long time to get pretty much nowhere. They could have done a lot more with it. As it is, I struggled to maintain enough interest to sit through the whole thing. But I did. All that time spent telling a story they could have fitted into a 30 minute tv episode. There's a lot of the main character walking. Leading to more walking. A bit of fighting, without anyone really getting hurt. Then more walking. Oh, did I forget to mention the amount of... walking? The only real interesting bit was the lead character (I didn't care enough to remember her name) had to keep trying to blow her hair out of her face inside the helmet. Basically, it could have been better (story &amp; effects-wise), but it's one of those movies you have to see for yourself to make up your own mind."}, {"id": 27, "text": "It's amazing what creativity can do with a small budget of $100,000 (estimated) Marc Price built parts of the set in his living room! Phoebe Sparrow's performance is very believable and intense Don't believe the haters, They love to hate. Just go into it with no expectations and you will find your self in a bonafide science fiction action movie with some very intense scenes. It's not perfect but well worth a watch if your a true scifi fan."}, {"id": 28, "text": "Luckily I didn't see the rating on this before watching this movie. It's better than many 6 star movies and it certainly isn't stupidly unrealistic like even a few big budget movies. The sci-fi part is quite good and despite the low budget it's quite good what the team has achieved. The story line is a bit slow but still faster than a few of the reknowned series. That's good enough for me to watch it once and enjoy it. A good story and execution also helps."}, {"id": 29, "text": "The first rule of IMDB is you should ignore all the 1 star ratings. Anyone who rates a movie 1 star clearly has an objectivity problem. 1 star, by definition, means it's as bad as the worst movie ever made. This quite clearly is not.This movie is a decent little indie Sci Fi. The first half hour is a bit weak, especially the overly-slow deaths and the admiral's aide character, but once they land on the planet it tightens up and becomes a great little suspenseful action movie. The acton was pretty good, especially the lead's use of weapons."}, {"id": 30, "text": "It started poorly with the worst case for female soldiers I have ever seen. Too much screaming and yelling - bit pointless? But it improved with a satisfying finish. The strength of suits and weaknesses seemed implausible. Phoebe did a great job. Editing was crisp but floundered at times."}, {"id": 31, "text": "Dune Drifter is a pretty good space movie. Reminded me of the first short film I produced. They even used the same alien costuming I used with the black outfits and the gas masks.One of the funny things about this movie, is during a wide shot of the protagonist crawling along the ground, two cars passing by in the distance are unintentionally filmed in the scene. Who would of guessed they'd have cars on other planets.The alien volcanic planet with a toxic atmosphere that the movie ultimately plays out on, had a river flowing in it, weeds growing, and a sky with clouds. One would assume that a planet with lots of water, vegetation and clouds would have a breathable atmosphere. Interestingly, the protagonist never decides to explorer or check on whether the river contains water. Why wouldn't checking the river to see if its fluid is water, be a top priority?The aliens, reminded me of the putty creatures in the Power Rangers t.v. series.Other things that stand out are the compatibility of the ship parts despite being completely different kinds of ships, designed by two entirely different species, from different worlds. Yet the protagonist walks right up to this foreign ship, knows where to look and finds a needed part to repair her ship.It almost feels like a major connecting scene was left out between the time it takes the protagonist to walk to and return from the alien antagonists ship. Before leaving the co-pilots body is intact. Upon return the co-pilots head is shown melted, without any reference or explanation.Something that seemed highly unbelievable is how the alien weapons were unable to penetrate their alien uniforms, yet a stray shot was able to destroy their ship.My favorite part of the movie is when the protagonist presses a adrenaline button on their suit and becomes super badass. If the writers had implemented more of these kinds of action moments into the movie, it would have been a much better movie. This particular scene was truly epic and the highlight of the movie.I gave this movie a 5 Star Rating because the effects were well done, the story overall is compelling and kept me interested, it challenged me to put myself in some of those situations and wonder how I might react or handle them, and it has at least one epic scene. It's worth a watch if you like space movies and it comes up on your favorite video service."}, {"id": 32, "text": "This sci-fi movie is so evidently made by someone who loves sci-fi movies. There's little winks and nods to so many classics from the genre and it looks incredible! The locations are stunning, the space battles are suitably epic, and the score fits beautifully. In a world of CGI-heavy special effects, it's great to see Marc Price opting for practical effects that work so well on-screen and look better than most of the CGI I've seen. It's getting some high praise as a low budget sci-fi but whether it's high budget, low budget, or no budget is irrelevant; This is, quite simply, a great film and one which I hope will inspire filmmakers everywhere."}, {"id": 33, "text": "A truly amazing film. It had me sitting on the edge of my seat from start to finish. It is unbelievable to realise that this film was made on a low budget as the choices the director and crew make while filming and editing it together creates a masterpiece of visual splendour."}, {"id": 34, "text": "Totally evocative of Enemy Mine/Battlestar Galactica/Battle Beyond the Star/(and of course the BIG ONE). Of course, Marc Price is known for his clever use of production budgets but what often travels under the radar is how he compensates with emotionally gripping personal journies for his central characters ... arcs (traumas?) that keep us gripped and engaged until the credit crawl. Phoebe Sparrow as Adler gives us just such a journey. Awesome film. Hats off to the Roger Corman of our times. :)"}, {"id": 35, "text": "A fun low budget romp, that combines effective use of budget and smartly dances around effects that it couldn't necessarily pull off. The pacing is a little bumpy but it's engaging and really is endebted to the Roger Corman school of filmmaking."}, {"id": 36, "text": "You need to watch this film twice Watch it now Then find how much it cost to make and then... Watch it againIts gripping, its tense, its a good film Great to see so many women in leading roles in a sci-fi filmCongrats"}, {"id": 37, "text": "Such beautiful dramatic scenery and so well shot, cleverly done. After watching the clips of how some effects were created I was really impressed. I was on the edge of my seat!"}, {"id": 38, "text": "Very enjoyable, great film. Love a bit if si-fi makes a change from other space films."}, {"id": 39, "text": "Great film. Great cinematography and writing. Really well done and most enjoyable."}, {"id": 40, "text": "What starts as a claustrophobic journey to a battle free zone soon goes sideways, as a band of pilots and gunners in their space fighters are swept up in a dogfight against the enhanced and ruthless Drekks.The lense then opens up as a crash takes us down to the seemingly deserted planet below, where the real fight for survival begins.The dialogue, certainly in the introduction interlaced with the close up shots of the pilots and their gunners really conveys the fear and dread they have about going into battle, and really sets the scene for the world (of what's left of it) they're fighting for.An injection of humor is also welcome as our heroes fight to stay alive in a brutal and beautifully shot landscape.With some great hand to hand combat choreography, as well as some nice use of miniatures for the ships, this indie flick certainly shows every dime on screen and looks like it cost a lot more thanks to some creative and frenetic filmmaking.Check it out."}, {"id": 41, "text": "Found it by chance and thoroughly enjoyed it, on the edge of the seat the whole way. A wonderful rawness like the original Alien movie. 1st class."}, {"id": 42, "text": "After a bumpy start, the pace picks up and it's actually a decent film.The film actually gets better with improved cinematic views and very good camera work. There's something very Dr. Who about the landscape????Some of the helmets are unfinished looking like a grade school craft project in the beginning.Seeing one crew member on the video as they don't disintegrate right away was more than enough? That was excessive and poorly executed. There could have been some dialogue snuck in to further develop the Adler character for later on. I felt a bit disconnected to her character several times, even though it was the character was incredibly well portrayed.The excessive moisture in the helmets? The Alien outfits? Something about that just didn't seem to work. The colour contrast of the red suit with the dark muck landscape was great.A few issues with the sound editing. Sounds were often unbalanced and/or not blended in. The fight scenes were pretty solid, well done on the crew that did that.Phoebe Sparrow led a carried this movie with an excellent performance. I anticipate an incredible career for her and seeing more of her talent for many years to come. I am not familiar with Marc Price (not to be confused with Marc Price who played Irwin Skippy Handelman on Family Ties btw) I want to see Colin just because it was done with literally zero budget and Magpie looks like a emotionally powerful film.I'm not really sure how to rate it, as the start was not good at all, and it took a long time to recover from that. For the budget, camera work and Phoebe Sparrow it definitely earned a 6."}, {"id": 43, "text": "I should have realized when I saw the word DUNE in the title (trying to cash in on the upcoming remake of the original DUNE 1984 classic) and, having seen the stolen film title strap line, from the 1980 film, Battle Beyond The Stars, I should have just left it alone! However! In my defense (as an ex Graphic Artist and current digital artist) I blame the excellent artwork on the film poster; it seduced me and tempted me and I suffered for art :).There is nothing in the entire film that is in any shape of form akin to any Sci-Fi movie ever made and, certainly not Star Wars...although the Earth fighter ships were quite clearly modeled upon the Star Wars Battle Cruisers of the Emperor. But! After reading the plot/story-line the superb Dennis Quaid and Louis Gossett, Jr. film, ENEMY MINE (1985) did spring to mind; it was of course absolutely nothing like (or as good as) the aforementioned classic.I'm not going to waste time on too much descriptive verse as it would give some of the film away like spoilers. The one thing that completely ruined this film was the camera work...as well as the directing. The entire film was shown in extreme close up views and with the jerky movements, akin to the camera action of the crappy Blair Witch Project, it just got more and more tedious as it dragged on.Other annoying bits were... 1) All the fighter crews women were screaming like squealing pigs but none of the men cried out (tells you a lot about the directors antiquated thought about women). 2) The hyper space flight scenes were ridiculously embarrassing 3) Four alien ship crew members (wearing fetish wear gas masks) were immune to the female pilots sidearm blasts. Pilots always have a sidearm at their hip and I could not believe it when this female pilot pulled it out of what appeared to be a sort of handbag :) I would have laughed if it wasn't such a monumental cock up! 4) The flight suits of both the Drekk alien crew and the Earth pilots looked like sets of overalls that sewage workers etc would probably wear.Watch it or don't watch it...its entirely up to your good selves. Just don't forget it was me who warned you of its dreariness!Sometimes watching paint dry can be so much more enjoyable :)"}, {"id": 44, "text": "Well, first of all I must admit that I am not really a great fan of the sci-fi genre, unless it turns out to be Star Wars. But still, I was given the chance to sit down and watch the 2020 movie Dune Drifter, and since I hadn't already seen it, of course I found the time to sit down to do so.While Dune Drifter was semi-watchable, writer and director Marc Price wasn't really delivering a sci-fi classic with this particular movie. The plot was just way too generic and predictable.The special effects were adequate for the movie, given it was a relatively low budget movie. And I will say that the props were definitely good. Well, aside from the suit that the 'enemy' was wearing, which was just a hardball protective outfit with a gasmask. Seriously? That was just so laughable and painful to watch, and it was so hard to take it serious.Dune Drifter is the type of movie that you will watch once, then never think about it again, because the contents to the storyline and script were just so vague and mundane that there simply is no purpose to watching it a second time. Plus, the movie just can't support more than a single viewing anyway.Initially I had thought that Dune Drifter might have been a mockbuster from The Asylum on the upcoming Dune movie. Luckily it wasn't that. But let's just be honest, Dune Drifter was by no means a memorable movie regardless.My rating of Dune Drifter settles on a generous three out of ten stars."}, {"id": 45, "text": "Let's be clear, this is film is better than the one star reviews would have you believe. Does it have its problems? Sure. The nine star reviews are also over the top. There should have been more breathing room for the setup in the beginning of the film, so that we get to know the characters better and care more for them.Having said that, they clearly made the most out of a very limited budget... and at times I was impressed with what they managed to pull off. The astronaut suits looked pretty neat, as did the ships and the combat scenes.Part of the problem, is that most of the story (from the second act onwards), happens on a mostly deserted planet. It's why the plot had to be pretty basic and some reviewers complain about it being slow. However, that's mostly a factor of the limited budget they had to work with.Could it have been better? Yes, but you shouldn't go into this expecting the same experience as you would with films that have ten (or one hundred) times the budget. If you have some sort of concept of how difficult it is to make something yourself, you can appreciate that these kids did a good job... and also that there's still room for improvement!"}, {"id": 46, "text": "For people confusing this with Dune Anything, if they would just read the description of the movie they would figure out it has nothing to do with the HerbertVerse. There are no Sand worms, No mighty Houses, no Bene Gesserit, and no Muad' Dib, and No, the spice does not flow.This is a raw movie. A simply made movie. Too realistic for most people. A movie for hardcore sci-fi fans who will stick it out through all the unpleasant screaming in the beginning, the somewhat bland darkness of space, and the simplistic props and wardrobe.But alas, no one wants to use their imagination anymore, so when they see simple costumes they immediately crap all over other peoples hard work.You don't like what this director did, that's fine. How about you make a movie so we can all see how well you would do...This wasn't a great film, great story, or great acting. The movie IS long and tedious. But the last 10 minutes make it worthwhile as things come together and some questions are answered.Will I ever watch this again? No. I am content I saw it once, though."}, {"id": 47, "text": "Having watched this at FrightFest, I can say that I was in love with this film. Marc Price has been able to create that balance of low budget sci-fi aesthetic from B movies that most of us feel nostalgic for with High Brow commentary and character exploration that not even some of the bigger budget films can provide.It does this by being a film of 3 parts. Part 1 is the Understanding of the Characters/World all set in a confided space of a small fighter ships. We get to really know this diverse band of rebels, before it is swiped from us in the 2nd part which is this slocky but epic space battle scene that clear references to Star Wars after which you are thrown onto the planet's surface to produce a survival horror similar to films like Alien and Pitch Black.Its pace is Slow, Fast, Slow, Fast, End. Being a literal rollercoaster and building those stakes up even more. I can not recommend this film enough!"}], "reviews_amount": 48}