{"name": "Mookuthi Amman", "titleId": "tt11311958", "reviews": [{"id": 0, "text": "This is the worst movie I have ever watched. Based on loose story and faulty screenplay."}, {"id": 1, "text": "Urvashi mam. Ohhhh what an acting. She acted in two extremes for soorari pottru and mookuthi amman."}, {"id": 2, "text": "Completely waste of the time watching this..to defame Hinduism this movie was taken.."}, {"id": 3, "text": "Gist of the movie Jesus is good and a friend hindu gods are bad hindu gurus are villains."}, {"id": 4, "text": "Rj balaji over action is unbearable. Boring movie. I will not recommend"}, {"id": 5, "text": "Worst movie ever saw.....its against hindu society. Its indirectly getting yogi adityanadh and ramdev baba into it...not even dared to picturize Christianity and its dark shades of pastors...."}, {"id": 6, "text": "Poor storyline. Poor direction n characters. Totally a pathetic movie. Only good thing is, didn't spend money in theatre!! Balaji is real poor in acting! This is not a tv show Balaji!"}, {"id": 7, "text": "Typical leftist propoganda film. Don't waste time watching this."}, {"id": 8, "text": "Why always targeting Hindu gods and showing in a bad light?"}, {"id": 9, "text": "Very good movie with good message.A very good family entertainer after a long time."}, {"id": 10, "text": "1 The film's cringe af. 2 It openly mocks Hinduism. 3 Misinterpretation of Hinduism. 4 Don't know why paster scene was deleted. 5 Nothing to say. 6 Watch this on your own risk."}, {"id": 11, "text": "I already put 1/10 for this film because I can't put 0! The film disappointed me because I said to myself it's a film directed by RJ Balaji, so I expected a film like LKG but that's far from LKG! Or else the film made me think of Nithyananda."}, {"id": 12, "text": "Someone should take movie to demonstrate how Christian Pastor fool people and do conversion"}, {"id": 13, "text": "Fun filled message film. Packed with humour and pakka entertainment movie."}, {"id": 14, "text": "Only for Urvasi madam..she performed extremely...."}, {"id": 15, "text": "The movie starts like a typical tamil movie... But ends up delivering a good message for our society... Enjoyed a 2 hour run without a lag or boring moment.. A worth watch movie... Loved it"}, {"id": 16, "text": "Love nayantara acting as Amman in this movie. Paartene song is amazing. I repeated some of the movie scenes like when Amman dissappear in front of camera. This movie better than most of the tamil film that focuses on romance"}, {"id": 17, "text": "Blatant disregard &amp; false implication of Hindus .... Try mocking your own sect"}, {"id": 18, "text": "I felt this as an average movie because the direction lacks!!! Starting was good and then directiom lacks. Songs were also average. The pre-climax portions sucks ie., God coming on tv and all the people are watching that😂whats that??? So anybody can watch them aah?? When balaji was coming in a bus with naynthara, people cant see nayanthara but on a tv program with fake peoples all can see her. Climax as expected!"}, {"id": 19, "text": "When the need of the time is to make world more inclusive and it's needed to be understood that there's isn't not just one god like allah or Jesus but thousands of gods around the world ,our indian cinema industry is busy making more and more hinduphobic movies instead of making movies on no conversion of hindus and other ancient polytheist faiths."}, {"id": 20, "text": "Good Movie but too dragging and songs us not needed in some place.One time watch."}, {"id": 21, "text": "Felt like the old style God movie... Direction can be better but given RJ Balaji who is really venturing into this area and making some genuine effort, deserves accolades. While there were some snags in the script; keep your brains out and watch this for a full treat. Don't compare it with any versions of PK movie (Hindi) or Oh My God (Hindi)... You need these light weighted subjects with some real good common man messages."}, {"id": 22, "text": "It is a good movie with good theme that is happening in real life.... But 10 minutes before intermission Overtalking by R J balaji..."}, {"id": 23, "text": "Beginning was slightly slow and normal asusual with the normal film But they concluded in a good way of manner to the current trend and about the belief where it uplift the movie to slightly better film Overall it seems to be good😁"}, {"id": 24, "text": "The goddess is jealous of Lord Balaji, Jesus is friend, it's a cunning movie to denigrade Hinduism and prod people to quickly convert to Christianity"}, {"id": 25, "text": "Only first half is good that to only Becoz of Urvashi acting &amp; Balaji fun comedy. Other than movie is mokka."}, {"id": 26, "text": "I love Nayantara! But said to see this movie is made to mock few people pinpointedly"}, {"id": 27, "text": "Rj Balaji has to do a better study before taking any concept. He got a chance to direct movie but wasted. This movie is an example to show his undeveloped brain. If no Nayantara in this movie, it's a trash."}, {"id": 28, "text": "There is misrepresentation and mocking of Hindu religion in movie. 1. Jealousy between Hindu gods? 2. Do god's compete to become famous? 3. Are all Hindu Swami's thieves?There should be a silver lining where freedom of expression doesn't invade people's religious sentiments. In other countries and religions , there would be serious repercussions, should ppl even dare to create a Cartoon on their messiah or god. Just hope this trend stops sooner than later."}, {"id": 29, "text": "I really felt I wasted 2+ hours of my life watching this movie. See, I am not against satirical movies and in fact enjoy them. But when you take on a topic, you better research on that topic properly and then make a movie about it. The movie projects a certain Hindu guru in bad light which is fine as there are unfortunately such elements in every culture and religion. But I wonder if these moviemakers target only them because they are soft targets and will not hit back. There was supposed to be a scene about another religion and was removed from the movie trailer and the movie itself. So, if one does not have guts to critcise something known to be a silly practice, why even take a movie about it? The plot was average, screenplay was average - could have definitely been better and above all, the very message they have tried to convey is very fudgy &amp; does not come out clearly."}, {"id": 30, "text": "Useless movie. Wasted my time. Don't make the same mistake!"}, {"id": 31, "text": "Full of Whatsapp &amp; Facebook jokes... copied from pk."}, {"id": 32, "text": "Fake activism, Pseudo Rationality,Pathetic research, Hypocrisy these are the terms which describe this wannabe revolutionary film. RJ Balaji says no broker is needed in between humans and gods,pointing to spiritual leaders.But in the movie,Engels Ramasamy (RJ Balaji) himself distributes pamphlets of Mookuthi Amman to people,does all work to take the God to the people.Then is he not a broker himself?Why does the movie villify spiritual leaders who earn money? Did RJ balaji care a bit to do any research about what they do with the money? Art of living for example,has desilted thousands of ponds and lakes in India.It has done peace interventions in so many war fighting Nations.Baba Ramdev donates 100% of his profits for charity.Isha runs free schools for the underprivileged children.Isha Agro Movement has revolutionised farmer's income. These people have done so much to this country and are 100% not for profit..People who do real good to the society on a large scale is rare.And what RJ Balaji has done is, sown empty hatred in people's hearts through his false propoganda film."}, {"id": 33, "text": "I don't want to tell the negative points in this movie because there is a good message for present foolish people who believe Baba's and samy's .. everyone should watch this movie once.. some scene's are we don't believe so I give 10\\5"}, {"id": 34, "text": "The plot was really great and the message the crew wanted to convey was successful. But, the cinematography and pace of the story should have been improvised...Continuation between scenes wasn't that good... And the villain's character could have been much more strengthened.. He didn't give a villain feel to me apart from his looks."}, {"id": 35, "text": "Below average movie.. one time watchable. Don't expect more."}, {"id": 36, "text": "This 7.1 stars for this movie is not apt ... can give only 5 to 5.5"}, {"id": 37, "text": "Monotonous bashing over a specific religion alone, the director did not have the guts to mock thé superstitious belief in other religion rather they mock only Hinduism. These kind of movies should not be encouraged and should be thrown into thrash without any consideration"}, {"id": 38, "text": "Am gonna make it in tamil .. yen thaai mozhi Indha padam RJ BALAJI oda nalla padam.namma ellarum kadavula kondada neraya vazhi vechirukom he has chosen his way of celebration. Na romba naal ave atheist, kadavul irundha naama yen ipdi kashta padrom ngra type. Ellarukkum ellame easy ah kedashta adhoda arumai theriyadhu dhaan. Ana ellarukkum ellame kedaikadhu. I had felt sorry for those who suffer more than me,always. I felt lonely when my sibling got their positions. Naanum neraya list vechurundhaen god nerla vandha kekka, padam pathapram puridhu namakku evlo kuduthalum paththadhu. Indha diwali ku nammala thiruththa moonu peru vandhanga NEDUMARAN RAJANGAM, MOOKKUTHTHI AMMAN and ENGEL'S RAMASAMY......... thanks for a good movie."}, {"id": 39, "text": "Nice movie, very well acted by NayanTara .. nice message."}, {"id": 40, "text": "Good message movie . only message can be bored so this movie fulfilled by comedy entertainment. Question asking is powerful."}, {"id": 41, "text": "Right time movie is release with very must needed message for our society right now. If you watch it doesnt mean you are against religion. Movie is very practical and convincing, just to watch this movie, I subscribed to HotStar. Must watch.Thanks, Meena."}, {"id": 42, "text": "As usual persecutes Hindu sentiments and the GURU culture. Audience and the general public need no messages from the likes of film makers, So RJ would do well to stop his amateur propaganda , as if the general public are fools and he has come here to make us aware of what we are doing wrong.. Rather he would do well to just focus on giving us a time pass movie and entertain us, which is what is expected of him, and spare us this I HAVE MADE THIS MOVIE TO SHAKE THE PUBLIC CONSCIENCE ABOUT RELIGION (esp hindus)  VIBE thorough the movie.. The film just about managed to entertain us initially in the first half n hour, but it was all downhill after that, just abusing and ranting about one Community throughout the movie.In summary, very average imagination and execution,, try something better..spare us for now"}, {"id": 43, "text": "Horrible movie. Don't watch.This guys doesn't deserve to be an actor. Horrible dialogs, and direction."}, {"id": 44, "text": "Urvasi acting superb.. Sema fun movie after long time.. enjoyed.."}, {"id": 45, "text": "A refreshing take on devotional comedy. God knows we've had to live through bad VFX with the goddesses performing paltry magic tricks, insanely loud laughter and pet snakes popping out of nowhere. Glad Tamil Nadu is catching on with the trend of OMG in Bollywood. The movie is highly relatable to urban and rural audience in one neat little package. Every RJ Balaji dialogue in the movie reflects the candor and naiveite of a common man. Urvashi killed it with her quick wit and uncanny performance. The sister asking for a day's leave would resonate with every household. Finally, the god herself, Nayanthara's expressions with the BGM would put all heroes of TN out of business. The subtle hit on Christian missionaries in the name of schools, hospitals and prayer centers could have been more of a loud bang. Overall, the movie does not have one dull moment. Hope Kollywood dishes out movies like this for festivals like Diwali and Pongal rather than stereotypical hero worship movies."}, {"id": 46, "text": "Mookuthi Amman begins with an unexpected bit of lyricism, in a voiceover about how we know if God is happy with us, or how we know if God is angry with us. The lines involve pongal and cashew nuts, rain and schooldays - I thought RJ Balaji, who has directed this film with NJ Saravanan, was venturing into a direction very different from where he went with his last outing, the blockbuster satire LKG. A card at the beginning quotes a number of inspirations: Bruce Almighty, Bedazzled, Groundhog Day, Wild Wild Country, The Story of God with Morgan Freeman, The Invention of Lying, Dogma, Oh My God, The Brand New Testament, and the filmography of directors Shankar and Rajkumar Hirani. Maybe Balaji has put all these movies in a mixie and come up with a brand new formula!READ THE FULL ARTICLE ON FILM COMPANION"}, {"id": 47, "text": "I dont care about negative reviews..really i enjoyed well becozz of oorvasi and balaji's comedy..most of the dialogues and messages are good..only thing is that tv interview with baba ji looks very unreal...and cliche fight in pre climax...finally climax is awesome.."}, {"id": 48, "text": "A good message movie, RJ Balaji was too good. Nayanataara is simple and justified."}, {"id": 49, "text": "Comedy timing is awesome, all the cast is wonderful. Very good acting"}, {"id": 50, "text": "Excellent family entertainmer. From cast selection to pre production every single thing was excellent. Nayantara madam was perfect for the modern day Amman....finally a good entertainment after so long time."}, {"id": 51, "text": "It's a one time watchable film, Nayanthara looks beautiful and perfectly suited as Amman. RJ Balaji does what he does best, Urvashi maam comedy timing is great. The movie suffers from pacing, the beginning portions are entertaining but it loses the steam gradually especially in the second half. The comedy also drops as the movie progresses. The bgm is fine sometimes loud, cinematography is neat. The film also looks to be inspiration from other films of the same kind but has a different feel. You can give it a try with minimum expectations."}, {"id": 52, "text": "Each and every scene of Nayantara is Mesmerizing... Fascinating..!!!"}, {"id": 53, "text": "Great story, screenplay, excellent performances. Urvashi excellent acting. RJ Balaji, as usual great comedy timing and good performance. Nayanthara, Lady Superstar proves again she is a great actor."}, {"id": 54, "text": "RJ Balaji and his team have done a brilliant job again. Comedy sequences are excellent especially between RJ Balaji and Urvashi. The only issue in the film is second half is rushed in writing and climax is very short. Could have taken more time to write few more comedy scenes in second half or tell us more about Bagavathi Baba. Overall, great family entertainer with outstanding first half and above average second half."}, {"id": 55, "text": "1. 💯 entertainment movie 2. Urvashi at her best in this movie. All the characters have done justice to their roles. 3. Great work by Balaji. 4. Good message to everyone."}, {"id": 56, "text": "A good film Full of Entertainment and society needed film"}, {"id": 57, "text": "A Silly idea developed into a foolish script. Logic less Magic more. Urvasi gives an extraordinary performance. Nayanthara doesn't look like a Godess at all, but she is cute and some times hot. Her face graphics dominated her botox shots. Most of the film is just a satirical comedy show with no head and tail. watch at your own risk."}, {"id": 58, "text": "Note:Please don't expect logic in these kinds of film. If u don't expect this film is Masterpiece for U. Review:ScreenFull of RJBalaji Uplifting whole Movie. Nayanthara Perfectly suited as Goddess &amp; shown Very beautiful than anyother films she acted. Urvashi extraordinary acted like a middle-class mother. 3sister done their job pretty well. BagavathiBaba Scenes are very funny&amp;Superb. RJBalaji Direction was unbelievable. Lots of mistakes but we can't mention it. BGM was fantastic. A must watch Film. Nice Social message film. Finally pakka Funny Enjoyable Diwali treat MookuthiAmman."}, {"id": 59, "text": "Message was really good, If the story was more realistic it could have been much better, but it was really disappointing, there were so much of of logical loopholes,( the main characters were not there in some scenes, like wise) I was really expecting a movie like PK but ended up as a usuall masala type movie"}, {"id": 60, "text": "The best religious comedy ever. A must watch for all Indians. Especially if your Hindu or Liberal minded. Nayanthara did amazing in this movie also same goes for RJ Balaji. Nayanthara's acting was expected to awesome, but R J Balaji surprised. I will never miss movie of him again.OTT release might have impacted the popularity of the film, but I request the creators to to keep making such good movies."}, {"id": 61, "text": "This movie if it was told from a atheist POV , no one would have listened or it would not reach its audience. But Director cleverly has told a Need of the hour message to the mass. Right when things are looking going very RIGHT... This movie tells to stop following self-made godmen who are there to swindle you and also countries wealth in the name of GOD.Both Nayanthara and RJ balaji have done an excellent job."}, {"id": 62, "text": "Super movie go watch it in disney hotstar vip . powerful questions asked nayantara super"}, {"id": 63, "text": "The best movie I have watched in the recent times, it doesn't have a thrilling story, not an action movie or complex Sci-fi. But wins the hearts with light hearted comedy and a strong message, especially exposing the follies of the religion you know which, also exposes the nexus between Indian politics and the so called spiritual leaders who con people for their personal benefits and to nurture division and hatred in the society for the benefit of politicians.this movie is a tight slap on the face of Baba's and senseless politicians and a strong message to the people who fall for such spiritual and political leaders.Absolutely loved it."}, {"id": 64, "text": "Good family entertainer no adult comedy,no skin shows...fun family entertainer with good message...rj Balaji,nayan &amp; urvashi mam performance is the main plus point...other characters also done there job perfectly especially bhagavathi baba reactions &amp;that sister character...music department also good..cinematography Nice.. graphics also good for this budget....logic mistakes &amp;poor screenplay in second half but dialogues try to hide that..watch with family &amp;kids perfect entertainer"}, {"id": 65, "text": "Kick the corporate Godmen out of the country. They abuse our innocence people and squander money."}, {"id": 66, "text": "Nayanthara is the best option and her next-door-girl-like-God role is perfectly fitting her. Oorvasi's acting needless to say yet have to be mentioned throughout the movie especially in 2 places. But we can enjoy her character throughout the movie. Qudos to RJ Balaji's acting and directing this movie as a God movie is outstanding. The movie was treated as a wholesome entertainer. The God scenes created goosebumps really after a long time. BGM is one of its cause. There were physically many people present in the shots, being a beginner director, it's nice that he could handle this much crowd in the movie. Voice sync was less with the girls. Overall, it would have been a treat if seen in cinemas."}, {"id": 67, "text": "Would like to give 5 stars For the effort and thoughts of Balaji. And the entire crew of the movie performed so well. Mookuthi Amman - Awareness"}, {"id": 68, "text": "Really enjoyed it and RJ balaji had nailed the fact humorously . Loved it"}, {"id": 69, "text": "Great message and good acting by all the characters."}, {"id": 70, "text": "After a long time in Tamil cinema, it's really happy to see the fantasy movie in the name of goddess to convey the goodness. Usual concept, but it was handled properly, gently and interestingly. Perfectly scripted for this generation. Decent - thought provoking - family entertainer. Good Film. Appreciation to the entire team!"}, {"id": 71, "text": "Mookuthi Amman seems destined to be the big comedy of this Deepavali.A pure perverse laughter.A comedy binge-fest with a strong message against the so called Godmen stupids. Indulge yourself without guilt. Vera level🔥🔥."}, {"id": 72, "text": "A slipper shot to all the joseya kaarargal .. a fun filled family entertaining movie with a fantasy touch"}, {"id": 73, "text": "Loved the movie !! They made sure no other religion is offended the movie has really good message at the end . Pakka family movie and entertainment guaranteed !!!"}, {"id": 74, "text": "Nice movie to watch with family, all the best to Balaji &amp; Nayantara acting."}, {"id": 75, "text": "If we keep our logical knowledge aside!!This is superb Message Oriented Flim..One time watchable...😌😌😌"}, {"id": 76, "text": "Amazing acting as usual by Urvashi who keeps us laughing from beginning till the end . Nayanthara impressive with her range of silk sarees and dialogue - lady super star indeed. Movie has a lovely message !"}, {"id": 77, "text": "What an acting from urvashi mam. She acted in two extremes for mookuthiamman and soorari pottru"}, {"id": 78, "text": "First I would like to tell about this movie is there is no boring things, the director directed ll useful things with a great message and the goddesses nayanatara acted very well and the director r. J balance directed very well"}, {"id": 79, "text": "Very good and impressive story line and casting nayan 😍😍😍😍"}, {"id": 80, "text": "Each and every dialogue, scene, concept!! Damn..!!Amidst all the movies nowadays that provoke atheism, this movie is on spot! Even a movie like this a year would do more good in the minds of people.Thank you RJ Balaji for this."}, {"id": 81, "text": "It's a half boil movie like LKG. Irritating comedy, worst vfx. Don't waste time."}, {"id": 82, "text": "The movie potraits shame to our Siddhar and attacked devotees of Palani Murugan do they have the guts to show the same about Church Pastor or a Maulvi I strongly Boycott such movie which Shames our Hindi culture First it was Bollywood now Tamil Movies.have also started deframing our Hindu Culture"}, {"id": 83, "text": "Worst movie ever.... If they don't dare to troll other religion... Then you Hindus... Is hindustan are living without heart,Don't they have feelings... Such a stupidity movie"}, {"id": 84, "text": "It's a well planned movie, family entartainer with social message. Typical RJ balaji movie. Nayatara look stunning, done her role very well..."}, {"id": 85, "text": "Nice moving with a theme that there is no need for man between us and God. There are some Sangees asking why only Hinduism? They should ask the same question to Hollywood film makers, Why only Christianity? It is a no Brainer but Sangees ? BRAIN??"}, {"id": 86, "text": "Need of the hour. Excellent message. RJB could have reduced the speed of dialogue delivery."}, {"id": 87, "text": "After long time,watched an awesome god movie.End to end good content and very good awareness to society."}, {"id": 88, "text": "Christians have massacred millions on indians during british raj but no hindus r bad"}, {"id": 89, "text": "Seems like this is yet another movie where a social message is exploited to churn out a movie which neither has good direction nor a good plotline nor has it used good actors like Oorvasi well... The objective was perhaps like this - in the current political climate in Tamil Nadu- let me make a movie on a subject that gathers maximum TRPs and publicity - even if my filmmaking skills are faulty to the core, and even if the movie is a dud otherwise ... that spoils the art of filmmaking..."}, {"id": 90, "text": "Rj balajis acting is good and he is very bold to take these kind of movies.. As Rj balaji himself said that this movie was inspired by pk hindi movie but movie is not that much interesting like pk.. He could have done more better.. Urvasi mam acting is very good... Pk movie given the social awareness message more entertainingly than this movie.."}, {"id": 91, "text": "The plot starts right from scene 1 where a Godman is trying to confiscate a land area. But, the humor and best scenes are taken up RJ Balaji's family and Urvashi. The first half is laugh riot and gradually moves towards the usual Godman zone. The movie is well written to fit in the commercial 'masala' genre and RJ has given his best performance. But, the last 30 minutes looks like a mashup of Oh My God, PK and other similar films. While LKG had something new to offer like the political analyst, this movie gives only lectures and social message like countless other Tamil films. Expected something better from RJ Balaji &amp; friends!!"}, {"id": 92, "text": "Looks like review of this movie has been taken over by hindu right-wing nut jobs. Hope IMDB acts.This is a breezy, entertaining and watchable movie. Nayanthara proves why she is the most sought after actor in Tamil. Reminded me of the 80s ,90s Amman movies and bought back a wave of nostalgic memories. Incidently in those movies too the villain was always a hindu godman/magician, luckily those were more tolerant times .Music and songs were another plus for the movie. Urvashi was exceptional and RJ Balaji passable.. The downside was the predictability and the poor acting skills of the villain, wish he gave a more nuance performance. Hoping to see more Amman movies."}, {"id": 93, "text": "Wow what a direction from RJ Balaji. How it is possible to direct a film like him as a expert. Hats off Balaji and Team."}, {"id": 94, "text": "Background music and story narration and graphics and acting and screenplay etc..everything is awesome... love you mukkupudaka ammaa..."}, {"id": 95, "text": "50/50.Good But Not Enough. Story Good. Screen play Ok. Scenes are Length Nayanthara Scenes 20 - 30 Minutes only, RJ Balagi, Oorvasi Comedy's are hilarious.Watch it Worth"}, {"id": 96, "text": "Excellent t performance by each character. Strong message with fun filled screen play. Brilliant BGM (Especially Nayan Intro). Nayan has nailed it . Once again RJ and Lady Superstar proved it. Urvashi mam as usual the same innocent mother made us laugh as well as cry. Kudos to the entire caste and crew."}, {"id": 97, "text": "Urvashi acting is awesome . R J BALAJI is a great actor. This movie deals with fake swami or those who people who claim that they are God's own man. This movie is another version of Amir Khan's P.K and fahad Fazil's trance (not the same) In my point of view, it doesn't says religion and god are fake ,it says that swami ,god men are all fake In the end of the movie nayantara ask viewers that if god wanted to perform miracle he didn't wanted to use human because god have power to do so. Therefore movie deals with fake swami who misuses god's name to loot people not with Hinduism."}, {"id": 98, "text": "This movie delivers a very nice message for the society. Those claiming hinduphobia probably are bhakts of some brokers selling religion. It shows all we need to do is believe in GOD only, not the brokers in between. Babas are looting our nation openly and their bhakts are blind. They launder money, protect corrupted people and cheat poor helpless people. Story has a strong message, that's why I rated 8. RJ balaji direction is amaeture and its evident, but I'm sure he has passion and will shine in future. Story should not have exceeded 100mins, but it drags and becomes boring in the last 30mins. All the best to RJ Balaji Sir!"}, {"id": 99, "text": "Good watch. First half of the film is awesome, lots of very funny moments and really good lines. Good acting all around especially by Urvashi. Nayanthara is a good casting choice for the goddess. However, the film fumbles when it starts focusing on the baba. It was too caricatural, too deja vu. The actor has a strong screen presence though. It's frustrating that the movie doesn't manage to have a 2nd half as strong as the first one but I'd still recommend it. Also, people just scream Hinduphobia for no proper reason these days. The movie literally has a Hindu goddess in traditional attire come kick the a** of a fraud lol."}, {"id": 100, "text": "Some of giving bad rating due to religious. It is not correct. Good movie with good message"}, {"id": 101, "text": "Full entertainment fully enjoyed.The music is too good. Now its my ringtone.Lovely"}, {"id": 102, "text": "Time waste movie, you can give it a skip. Unnecessary drama and damp story"}, {"id": 103, "text": "Silly &amp; stereotype movie. Urvashi as an actress has so many dimensions but lack of directions made all scenes look so fake &amp; forced jokes..mockery of only one religion &amp; their beliefs, clearly had some politically driven agenda..! &amp; movie definitely did not speak anything fresh!"}, {"id": 104, "text": "Poor director , can't bear RJ Balaji because of his worst acting skills..."}, {"id": 105, "text": "Doesn't have nuts to show Christian fake missionaries in movie but talk only about hindu fakes which this movie shown a targeted person was not even like how it is portrayed TOTAL RUBBISH"}, {"id": 106, "text": "Fake propaganda, worst acting from rj balaji can't understand hi dialogues"}, {"id": 107, "text": "Even they censored Cristian dirty jobes on society nowadays"}, {"id": 108, "text": "The movie moves around fantasy and specifically targeting certain self-proclaimed Hindu leaders. The camera has done an excellent work in capturing the field of depth, beauty of Nagercoil and freshness of nature. The costume designer for Nayantara has done a great job and she looks gorgeous. At the same time, due to a dull screenplay, storyline and not-so-needed so called comedy tracks makes the movie really boring. Balaji acting gets monotonous and irritating after sometime. Second half gets long and editor could have done a better job."}, {"id": 109, "text": "Movie started off well, first half was filled with comedy, second half was bit messed up because of inconsistence in the screenplay. Overal, a good movie, one time watchable."}, {"id": 110, "text": "Nayanthara does nothing but walk around in Lalitha Jewelery and Saravana Stores Sarees.RJ Balaji does his usual bit about being the angry young man. He acts well and is funny at times (His Dialouge where he talks of Ammans objectives of Reforms in India - had me in splits). His emotions, His Suppressed Anger are all excellent for comic relief.The Baba Actor is the usual caricature mixture of Nithyananda and Ramdev. It is Urvashi who steals the show. Her emotions, her comedy is flawless. Simply flawless. As a mother desperate to save face from embarrassment who resorts to lying all the time - she is perfect and her sorrows when finally, being confronted by her son is also priceless to watch.One questions remain why was the fun targeted at Hindu Rituals or babas? Others??"}, {"id": 111, "text": "Mookuthi Amman starts off with an alluring promise. Over 43 km of land is being bought by a so-called swami, much like Osho did in the US back in the 1970s. RJ Balaji plays a reporter named Engels (named after yes, Engels, co-writer of the Communist Manifesto). At this point, I thought we were off to a great start. Balaji's going to tackle both religion and snidely attack political ideologies. But, that's not where the rest of the movie goes.From the minute, the titular Mookuthi Amman arrives onscreen, the whole movie witnesses a tonal shift. Till the end, I never knew if they were still doing this with satire on their minds. By they and their, I refer to the makers. Whatever the case may be, I was not pleased with the post-production. The dubbing and lip-sync is terrible in a lot of places. Balaji's over-the-top comic-riddled performance didn't help either.There are some interesting things to talk about but the question remains is the movie any good? The answer, after a lot of hesitation, is no. Mookuthi Amman is largely a misfire. I assume this was because of a lack of focus. With LKG, they seemed to have a script that knew what it was talking about. Here, it feels like a hotchpotch of many ideas stuffed into a piggy bank made out of clay."}, {"id": 112, "text": "Positives : Social Impact / Aspect: A must watch and digest for all the communities, in Tamizh Nadu, India and the world at large.Every place where some god man is humiliated, it is substantiated with a perfect reason, a lesson and the way to move of it in a fine manner.Movie Making: Cast &amp; Crew : Selection of Oorvashi Mam, Nayanthara as Goddess(Start cast appeal), R J Balaji Anna, Mouli Sir, 3 sisters and the Crew WRT technicalities of the movie did a splendid job.Everyone in the movie (above mentioned) has did their role pitch perfect.Negatives: There was this 2 to 5 minute(s) in the entire movie where I could not stand the noise, that was very negligible. But, for the fact, that scene had to be shot that way to deliver the emotion it has to deliver (It was realistic, but noisy)"}, {"id": 113, "text": "Movie has many laughable moments and some point/realizations that they make are definitely true.Some stuff like fake Baba's and people blindly going behind them is well addressed in this. Fake Baba's are so obvious! When you know that they are business minded, why go behind them? Some other points like, god being angry because you prayed to one god instead of another is just absurd lol. There are so many faults in this one statement itself, but in short, just be faithful to the one god that you believe in (or don't, upto you). Do not believe everything that you see in this movie as it doesn't portray all necessary truths about the religion either.Just watch it as a normal movie and enjoy the comedies light heartedly. The jokes were pretty nice and the storyline was pretty nice too. A good family movie which can definitely be enjoyed by many."}], "reviews_amount": 114}