{"name": "The Beast", "titleId": "tt11499506", "reviews": [{"id": 0, "text": "Yes this movie is formulaic, but that's not what bothered me. Am I to believe that a 30 year veteran of the special forces is really going to be that bad at fighting? And also to show up unarmed (not even a knife?) to the compound full of criminals where his daughter is being held? And then to basically just get his ass kicked and accomplish nothing?I didn't think that the acting or cinematography were really that bad, it just would have made more sense if the protagonist was some average Joe rather than an elite special forces veteran if we're supposed to believe he would be as bad at fighting as he was.The ending also bothered me, like oh, it's great that he's prison because now he's finally going to get some group therapy? Doesn't track."}, {"id": 1, "text": "This movie is watchable, but not as good as I had hoped. Guy just gets his ass kicked most of the time. Should have gave the script to Scott Adkins."}, {"id": 2, "text": "The movie starts OK and then the plot becomes a mess... and the action scenes are boring. No need to view it."}, {"id": 3, "text": "The action sequences in this movie are pathetic and the plot is totally unoriginal. Lead actor looks like a beast but fights like an out of shape old man."}, {"id": 4, "text": "Liam Neeson has held a tough guy/image of a father since TAKEN. After five minutes THE BEAST starts I can see so many similarities. But THE BEAST is missing one key element: the power of kick after each punch. Movies like these are not just about the family/love bond, but also seek violence. The title is violent but not the content. From many scenes I can see the actor is trying to catch breath which is something you don't see in Liam Neeson's. BTW the soundtrack where his past is described is nice, trying to find the title of the song lol.In general, it's not bad but if you are looking for movies that can bring you excitement or help you shake off chose from reality then you may want to choose another one."}, {"id": 5, "text": "The movie has a good beginning and the Beast character is perfect. But then the plot becomes really slow, the action is slow, the hero looses his strength and falls in serious danger. It is not clear the intention of the movie: an action movie, a family/love movie, both of the them ? Well in my opinion none of them had success. Finally with its rhytms movie is too long (I risked to fall asleep). But Ludovico Di Martino has really good possibilities (scenes, lights, actors), so c'mon let show them."}, {"id": 6, "text": "This movie was absolutely one of the worst movies i have seen. This movie was bad in all areas starting from actors."}, {"id": 7, "text": "Do not fall for stupid reviews. This is an amazing movie. A short, crisp and meaningful plot. People expected this guy to fight like a superhuman. But the fact is that he had PTSD. He had panic attacks. Director took care if that fact really well. This was justified well during his fist fights. He was tired but did a father's job. A beautiful message conveyed in this movie."}, {"id": 8, "text": "Do not listen to bad reviews from people who are used to super heros. Our hero was a special forces Capten with a difficult past, full of tortures. Now, away from all of that he is trying to get by, fighting his demons through drug medication. He is alienated from his family (son and wife) but his little daughter loves him greately. One time, when going to see their father, the two kids stop at a burger house. The son didn't want to go to his father's house. Instead, he meets with sone friends there and, suddenly, his sister is kidnapped. Then, their dad goes hunting, trying to find his daughter. In a few words, this is not another Taken movie. Our hero can be hurt, hit and lose. But he stands again to continue fighting. He has a brutal past, but that doesn't make him invicible. That's what's great in this movie. The vulnerability of the character. Last but not least, the movie is also very emotional, especially in the end, when son and father bond again. Don't miss it"}, {"id": 9, "text": "I thought this was absolutely amazing. You can see that Leonidas struggles with PTSD on a daily basis, but you can see the deep love and affection he has for his daughter and family. He is very quiet and says almost nothing, but somehow you know what he's thinking. The action scenes were also very good, with the occasional flashback. All in all, I think this movie is very underrated and deserves a much higher score."}, {"id": 10, "text": "That Italian flick tries something already used and overused by the US film industry: a former Special Forces member suffering of post traumatic disorder and whose daughter was abducted. I expected something new from this European film, especially released on Netflix, I expected something daring, more brutal, gritty, why not nasty, disgusting, disturbing. But directing and acting are more than OK though."}, {"id": 11, "text": "Acting is a little worse than you'd expect in your typical bad B action movie. Like first time acting gig for an athlete bad. Think Rhonda Roussey in Expendables X. Or Worse than Chuck Norris when he started way back when. Script and tone are outdated. Cartoonishly written. Fight scenes are very amateurish and outright slow. Unexciting. Made for TV.Why is this trending on Netflix?"}, {"id": 12, "text": "This movie is so bad on so many levels that I actually had to come here and comment on it. Seriously Netflix?!"}, {"id": 13, "text": "One of the worst action movies made. Don't waste your time. This is like a C-flic...like poorly made and directed. Unbelievable in more ways than countable. Just a constant eye sore. Better off watching twilight"}, {"id": 14, "text": "The director is trying to make an action thriller with actors in a lot of pain and emotional music. Only the music lives up to something. The plot is lazy and illogical. The hero and his ex wife actually act well but so much of the story is ridiculously unbelievable. Ex elite soldier for thirty years who's physique hardly scares a chess player, no matter how many fake scars and tattoos. He's taking anti depressants to be able to socialise with family. Apparently they're so strong that the elite soldier forgets how to fight now and then and takes a beating by drug addicts and random hooligans even when his and his little daughter's lives are in danger as if adrenaline doesn't exist. Plot holes en masse. How did he get an ambulance when knocked out in the gangster house? Fight scenes are choreographed from the 80-s. Music and some decent acting saved this movie from a 1. Director needs to get back to school. Even the last Taken movie is better than this soup. If you want to watch a really good movie on the same theme then watch Extraction with Hemsworth who's fight scenes are incredible and most realistic in any movie I've seen."}, {"id": 15, "text": "Yeah, an Italian version of Taken, but on a kind of stupid and guttural level. The fight scenes are pretty basic and sophomoric, and you have to wonder why the bad guys just don't shoot our hero instead of waiting to be punched out by him, one by one.There's some decent filmmaking here, they obviously had a budget, they just needed to spend more on a better script and fight choreographer. They left it open for a sequel, aye, hope it's better than this."}, {"id": 16, "text": "Netflix produces and Italian version of Taken but they succeed to make The worst taken ever!"}, {"id": 17, "text": "I think: very good acting from the bearded actor. I like Warner Bros, because I like Warner Bros Finland, I gather I must somehow like Warner Bros Italy also. and they usually produce quality, no matter if it's films or documents."}, {"id": 18, "text": "They had no script, and just keep making up as they filmed. A special forces soldier that can't fight, policemen that can't shoot and are easy fooled. Bad choreography in the two or three action scenes."}, {"id": 19, "text": "Think italian taken with a hint of italian Rambo...but a hell of a lot worse than that...once it gets started, the action doesn't relent, and so there isn't enough of a pause to ponder how much this movie borrows from the action movies of the last quarter century. Not that it matters anyway it's just blatantly obvious...the acting is HORRID, the plot...omg, my nephew Timmy is 4 year old with down syndrome, he would have done a far better job. Just AVOID like plague and do something more productive with your time, groom your cat, watch paint dry, anything."}, {"id": 20, "text": "The best part about this is that the main character isnt perfect, he gets shot, stabbed, severely beaten, gets out of breath, drowned and at one point flatlines on the way to hospital after a lengthy fight scene, which is more than i can say for most other action movie protagonists that single shot fight scene was also pretty neatyou are worthless if you didnt think this was good youre even more worthless if you thought it was just italian version of taken go die i hate you leave this placeEDIT: hey do u guys think its weird that a lot of the negative review accounts were made around 2017 and this is the only movie theyve rated really makes u think"}, {"id": 21, "text": "Can understand why people say it's similar to taken but don't get turned off by that, just give it a watch and it does pull you in..."}, {"id": 22, "text": "All the comments here about the leads poor fighting skills - in the real world people don't fight like Jason Bourne and John Wick, fighting is thuggish and brutal, with little finesse and the character is called the Beast for Pete's sake. But when you've been raised on a diet of sterile Hollywood pap of the past few decades then it's understandable that you think fighting should be stylised, clinical and frankly boring. This film was by no means perfect, but it is a solid 6."}, {"id": 23, "text": "Bad performance and simple plot. Unbelivable outcomes. Slow and poor action. Stupid polices. One man against everything like superman but without credibility. No waste your precious time."}, {"id": 24, "text": "Not a bad Italian action film, a simple story. The main credible actor, the rest a little less. enough for the attempt"}, {"id": 25, "text": "La Belva is a stylishly-made-but-ultimately-generic actioner with a father-saves-daughter plot that's been done to death. Leonida Riva is an ex-army veteran suffering from PTSD and has partially disconnected himself from his wife and children. When his little daughter gets kidnapped, he revives the beast inside of him to get her back. A film that goes the 'Taken' route with slightly more layered characters, La Belva's strength lies in its set-pieces. Though there's nothing we haven't already seen, there's some beauty in the staging of a car chase or a good ol' fashioned fist-fight.As in the case of action thrillers, fallacies (Riva infiltrates places with ease) in continuity and logic are conveniently ignored. The climactic finale gets over even before it begins; the weakest of all. Fabrizio Gifuni's rugged, tough-man act is befitting the film's plot, while the rest of the cast is adequate. La Belva offers nothing new to the genre, but as an action-movie fanatic, it didn't put me to sleep either."}, {"id": 26, "text": "If you don't mind the casual violence and nudity, there is a great story here. Fabrizio is seeing red and he steals a car to save a young lady in distress. Apparently it takes copious amounts of cocaine to pump him up like the Hulk (the Beast). He even robs a drag queen of her goods at a gas station. He a lovable vigilante that has a death wish IMHO. What do you think of the violent maniac saving your life on the streets? Oh well! I believe in Pax and Benevolence.....altruism is the name of my game, (and also my superhero too!). Cheers! Murf"}, {"id": 27, "text": "Waiting for your treatment at the dentist is more exciting than this no plot, no idea movie. Honestly, nobody's going to give you the time back you have invested watching this. Go and meet friends, drink a beer at your local bar, argue with your husband or wife.. every action will be more meaningful than watching that movie!"}, {"id": 28, "text": "Ignore the reviews from the kids raised on superhero movies who think the hero is a bad fighter. These people have never been in a fight in their life and think flashy moves, CGI and quippy one-liners are how it goes down. The hero is a badass who holds back nothing as a desperate father doing what it takes to protect his family. The fighting is far more realistic to anyone who has actually experienced one and the pacing is great for events that take place in a single night. For my money one of the best movies of 2020 and a superb example of the hero dad genre."}, {"id": 29, "text": "Fabrizio Gifuni is the Italian Liam Neeson in this kidnapped-daughter-rescue-revenge plot. What starts off as an intriguing genre flick quickly dwindles into a low-energy, blood-soaked mess, interspersed with the occasional slow-motion montage, backed by an F-list soundtrack. I'd rather watch Taken 3 again."}, {"id": 30, "text": "Starts promisingly with interesting character and dynamics but is ruined by the simple fact none of the film's action would be possible if it were not for ridiculous and implausible police officers. It is inconceivable that police could be that dumb and inept and therefore very difficult to take the rest of the film seriously. It is a shame because actually the character of Leo is interesting and well acted. I disagree with some reviews who think it would have been improved by a younger actor more capable in the fight sequences. The truth is that the fight choreography is pretty second rate, but the ageing commando no longer at the peak of his form is more powerful in his desperate search. It tries to put a newish twist on an old idea and might have succeeded. Sadly it didn't."}, {"id": 31, "text": "Special forces guys don't punch you in the face when they're fighting. Money from a drug deal isn't handed over in nightclubs. Hoodlums don't refer to drugs as 'stuff'These is just three examples of the usual mistakes when making a movie like this that take you completely out of the drama. And this was only 25 mins in.Why not get an army guy to advise on actual disabling techniques. Surely showing money changing hands in a club, upon reflection, would be obvious in its unrealism. And we don't need to be told that's it's drugs they're doing...we can see.A bit more time revisiting the story amending these less believable moments would've helped, though in general terms, we've seen this film done a lot better, many times."}, {"id": 32, "text": "I had sort of high hopes for this movie, a sort of cheap Taken style film but alas it cam across as a just above average b movie style of Taken. The unarmed combat scenes were to slow to effective. The main actor was good I hope he does more movies like this but at a better pace when it comes to the fight scenes. Someone mentioned that Scott Adkins should have done this, NO, Adkins last few movies have been dreadful, so that's a big no from me. Give it one watch and it's forgettable, only one watch mind you. A five star rating and I so wanted to give it a higher rating but it just fell short."}, {"id": 33, "text": "I was expecting The Beast to be something like the Italian version of Liam Neeson's Taken trilogy, but it eventually turned out to be a much more serious and somewhat more credible crime thriller. The story was relatively slow-paced and straightforward, but it did have a few surprising moments. The protagonist proved to be a pretty realistic representation of a traumatized individual and the villains were pitted against him as equals who were actually able to physically hurt him, rather than allowing him to kill them within a matter of seconds. The setting was a gloomy and relatively compact one, with the protagonist having to find and rescue his kidnapped daughter within the limits of his hometown in the middle of a drizzly winter. He eventually managed to do so by using his observational skills and asking an old friend for a little bit of assistance. However, it has to be emphasized that he was frequently lucky enough to discover the right pieces of evidence and information at the right time, which provided the movie with quite a few coincidences of the kind that not every viewer will see as entirely realistic."}, {"id": 34, "text": "I enjoyed the movie. Lots of action, some suspense, and a little twist of the ages old story between good and evil, with its shades gray."}, {"id": 35, "text": "Good action flick, brutal fight scenes, enjoyed the movie's darkness and at time sadness, strong ending."}, {"id": 36, "text": "I really like this movie. Great tension. Great acting, great rythm! 10/10"}, {"id": 37, "text": "One of the worst films I've seen. Goodness knows why I sat through it. A script full of holes, and I've seen better acting in school plays. Please don't waste your time."}, {"id": 38, "text": "They say there is nothing like Mama Bear (I think they say that, but you know what I mean in any case) ... well get a hold of Papa Bear(d)! He ain't playing around either. Seemingly unstoppable - or is he? One thing is for sure, he aims for the throat and he goes right for the target. No distractions and alll that other stuff police has to worry about.Which of course make him a target for the police too. A very down and dirty movie ... gritty and unapologetic! With a main performance that is quite mesmerizing to say the least. If that sounds like something you can agree and watch, than look no further. So can you dig it? And can you stomach it?"}, {"id": 39, "text": "This movie is an Italian 'Taken', except bad action, extreme plot holes, very lazy writing, with many scenes (i.e. most) being deus ex machina with something unrealistic happening at the last split second. No character depth, with many roles as stereotypical as possible without any hint of originality.Cartoonish, over the top bad guy..check Brooding teenager for no reason...check Dumbest cops ever...check Hero should be dead multiple times but not...check People appear exactly where they need to to propel plot without explaining how they got there...check."}, {"id": 40, "text": "HOW DOES A MOVIE THIS BAD ACTUALLY GET MADE? ONE OF THE WORST MOVIES I HAVE EVER SEEN."}, {"id": 41, "text": "Should call as the weird luck dude or worse fighter or I get beaten, or retard looking orger."}, {"id": 42, "text": "11/28/2029 Not a bad movie but far from a great one too. Reasonably enjoyable, never exciting and zero suspense. The 5.4 IMDb stars is on target. A one time only movie. The following are titles of two of the already posted reviews. They describe this movie the best. 1. Not bad but nothing that we haven't seen before! 2. Slow Mo Action / Plot gaps &amp; mess. Dismiss the 9 and 10 scores, they're wrong. Bon Appetit'"}, {"id": 43, "text": "It's like a cheaper and incomplete version of Taken trilogy. Misleading title. Boring. Terrible storyline. Don't bother."}, {"id": 44, "text": "I just wanna say that I expected much more from a dude that was in special forces for 30 years, dude can barely fight 1v1s, we didn't even get that feeling where this guy should literally be invincible taking into account that he has all that experience and even in a gunfight my guy cant aim in the head from 5 meters pathetic imo. In general the story is nothing new but kind of promising in the beginning, but just goes downhill by being slow paced and this guy getting beaten up in every scene we literally see lol. Average movie don't really recommend it honestly, if you watch it don't except much from it"}, {"id": 45, "text": "The subject of the film and the script are very cool, but the actors' game 5/10 could have been made with a better cast and the hero himself could have more spectacular moves overall rating 6/10"}, {"id": 46, "text": "The guy gets beaten all the time; lands up in hospital but does not tell the cops about the bad guy because he wants to get slightly better and hunt himself - what about the precious time lost looking for his daughter. Boring movie with the lead actor being a dud and the action scenes, nothing to write home about. Avoid!"}, {"id": 47, "text": "I doubt if anyone can watch this movie about a 30 year of service Special Forces Captain, who has to overcome his own demons to rescue his very young daughter, without any reference to Liam Neesom's 'Taken' trifecta.La Belva isn't as good a fighter as Neesom but does a reasonable job and has plenty of fights, not always winning, and sometimes getting the tar knocked out of him; however he recovers and just keeps on going and going.This movie will never win an Oscar, but for 90 minutes of fisticuffs entertainment, it is well worth a look, and I give it 6/10."}, {"id": 48, "text": "Never seen an action star take this much of a beating! I thought he was one of the kidnappers the way he was carrying on! 0 rewatch value 1 and done"}, {"id": 49, "text": "Dreadful movie with poor storyline and even worse acting.Clearly a very low budget movie."}, {"id": 50, "text": "Imagine a action movie where an elite special forces team is almost eradicated by a few Al Queda types and the main character, a 30 year special forces veteran of multiple campaigns, show zero fighting skills and almost gets beat up by a 130 lb druggie. That's La Belva. I tried very, very hard to like this movie, but, it's impossible. The script is awful, the fight sequences are laughable and the plot holes are maddening.This is one of the worst movies of 2020."}, {"id": 51, "text": "Bad movie do they really have to show Arabs are bad why ?? That was not needed and the movie is not related to the name too"}, {"id": 52, "text": "Follows the path of pretty much every revenge movie after Taken, there's a PTSD twist but it's done poorly. The script makes no sense and there are plot holes visible from space (shipyard scene, wtf?). Usually these faults are compensated with gritty action scenes in these kind of movies, but apart from the chase sequence in the beginning, the action is really wonky. The fight choreography is horrible, you can clearly see haymakers missing by a mile and knife fights look like karate class exhibitions at the local mall. And you get to witness all this mess in slow motion, 1990's style. So in summary, it's like Taken but shot in 1990's straight to video style."}, {"id": 53, "text": "Bad scenario, bad acting, so bad it becomes funny from time to time (the 'let's play angry boss' moment is wtf). Action scenes seem staged and played by a 6 year old kid and characters are so transparent and dull. Trust me, I am easy to satisfy but this one is terrible. I just don't understand how it can be so well positioned on the Netflix charts. If such a crappy movie can make it, any producer can do it. There is cash to make here"}, {"id": 54, "text": "Messy action and lots of blood! I would say after watching it that is quite empty the whole story, many questions and lots o predictable things,nothing original! Kidnapping is a scary movie always for me, however this movie I believe tried but failed for many reasons. The main character was quite good though!"}, {"id": 55, "text": "5 for the movie plot only. The action scenes were beyond underwhelming. It looked so fake as if this was a 2000's and under movie. Being that it's 2020 they should have brought it more with the action scenes. The suspense and anxiousness I had for the final face off quickly died when I saw how poorly put together the fights were. Like, so slow motion. So, anticipated."}, {"id": 56, "text": "I am Italian, and I am always happy when I see one of our products well made and this The Beast is a well made product, it certainly takes its cue from taken with Liam Neeson, but it is not a defect, indeed, it is an advantage. The cast is great, the action scenes are very well shot and the violence is raw and real. It is not a masterpiece of course, but it certainly deserves a higher rating, but unfortunately the kids of today are drooling for filth like the various idiotic cinecomics of marvel, the three hundredth sequel to that fast &amp; furious trash and various crap."}, {"id": 57, "text": "My review of the film can be explained in a single scene of this film. A good 7 minutes of heavy breathing with strangely timed music before the world's slowest fight scene decides to occur. Walking downstairs while the music slows down, being hit by people that go limp as the fight correographer asked them to, with the final guy firing 4 shots, watching a painful 3 seconds of the main actor walking towards him then getting disarmed. Good movie to enjoy how bad it is"}, {"id": 58, "text": "The slowmotion car chase was already enough for me to stop watching this taken rip-off. Lot's of high rpm sounds to make it sound fast. It just looks ridiculous. Don't waste your time on this."}, {"id": 59, "text": "I have copied the review of another because i totally agree with it: This movie was absolutely one of the worst movies i have seen. This movie was bad in all areas starting from actors."}, {"id": 60, "text": "Its a low budget movie that tried to mimic Taken. Worth watching on Netflix during covid times but surely not a theater release."}, {"id": 61, "text": "It's alright to watch one time just a father trying to rescue his daughter. I honestly liked it except for the fighting scenes it looked unprofessional."}, {"id": 62, "text": "A pretty blatant rip off of the Liam Neeson movie TAKEN.It wasn't horrendous by any means but just doesn't have any substance to it. The acting is fairly good and it is quite well shot. Reading subtitles means you may miss some of the movie but it's not a deal breaker, I appreciate not everyone speaks English.A good attempt but not a patch on TAKEN which I have watched several times and unlike this, will probably watch again for my Liam Neeson fix."}, {"id": 63, "text": "Action starts immediately...but he can't fight as mean as he looks. Why these rich people deal with poor junkies to kidnap a kid is beyond me. It's a bit disappointing to me."}, {"id": 64, "text": "An action thriller. Remember Relentless Search? This is the Italian version with his like Liam Nesson. It is about an ex-military man who fights with his demons from the past and goes looking for his daughter when she is kidnapped. The ending predictable like all of its kind. Quality. Entertaining, it is a safe formula. It is not something that has not been seen before. Performances to the new. Good effects, good shots. A greater tone of violence, that they are well carried, beheaded and blood in excess. Slightly naked but cared for. Nice to spend the afternoon."}, {"id": 65, "text": "If only they had added I have a particular set of skills... it might have been better.Netflix advertises this film well showing Fabrizio Gifuni as a tough, no nonsense, 'get the job done' ex-military father who is central to the movie. Sadly though, the film didn't meet the hope or expectations I had for it.The good and the bad: When the end graphic 'La Belva' (The Beast) is better than the movie, you know something went wrong.From a broad view the story is fine, even if it has been told many times: A young family member is kidnapped leaving the father to get them back.Fabrizio Gifuni almost looks the part, grizzled with an over the top beard. However, for a man who supposedly spent 30 years in special forces he is a scrawnyStemming from the last point, the only relevance I can see in learning he was in special forces for 30 years was to give the impression he has a 'particular set of skills which make men like him dangerous to people who might kidnap his daughter'. However, he doesn't display any more skill than a determined father who can handle himself.The film fails to develop the characters leaving the viewer not caring much for them. For example, we don't learn much about the young girl who is kidnapped other than her big brother leaves her eating chips at a table where, predictably, it all goes wrong.Typical to the Italian stereotype, the film has great hype but no substance.The negatives could go on, but it would be like shooting fish in a barrel (i.e. easy).La Belva (2020) is not a film I will remember, and much like Sabotage (2014) this review will be the only reminder I once saw it."}, {"id": 66, "text": "The Beast as the title translates, doesn't really ring true.Akin to films like Taken (which is also implausible) the primary issue with this film is one of realism. The key protagonist is apparently a highly skilled, special forces operative. Yet his situational awareness is poor, as is his judgement. Of course, we are told he has PTSD. Even so, that level of experience becomes instinctive, so this is a thin excuse.He blunders into multiple hostile situations. His combat skills look more like those of a simplistic street fighter. They lack polish and precision. No one with that kind of background would go in unarmed, either. A hammer, a box cutter, kitchen knife, or even a crow bar, can make a huge difference.Just as improbable, his adversaries leave him for dead at one point, rather than finishing him off. All this after he proves he is at the least a tangible, if disorganised, threat.Acting by contrast, is excellent. The main character is believable but he's let down by a script that fails to seriously ask how a soldier with this degree of training and experience, would really perform in this kind of scenario.The outcome is a film that's more or less watchable but for anyone with any real training, it offer's up far too many yeah right' moments to be convincing.5/10 from me."}, {"id": 67, "text": "The Beast has taken glaring inspirations from acclaimed works in the past. Meanwhile indecently disregarding its intrinsic identity! Hence, a formulaic demeanor hindering the overall execution.A Daughter in Jeopardy, A Venturesome Father, one Crime Boss/Syndicate. Sounds familiar, Isn't it? Akin to Liam Neeson starrer Taken; the resemblance here is highly prominent. Albeit I don't despise recitation of corresponding storylines, but I utterly hate the ignorance shown by makers when it comes to acknowledge any creative inputs.Technically it would suffice. Cinematography is filled with enough buoyancy alongside a radiant imagery. A conforming Soundscore with uncouth song selections; Which I find oddly interesting.Characters are shabbily written, therefore actors were unable to deliver conclusively. Despite giving all their earnest efforts! A redundant &amp; painstakingly slow screenplay failing to provide any sort of support in that matter! The writing has struggled with its own dilemmas. With pretentious attributes all over; the Action playing the second fiddle, and undue Drama getting the utmost importance. Leaving a subsequent taste of resentment."}, {"id": 68, "text": "The movie is watchable and actors are decent in performance. Especially the main character who looks true enough when PTSD is getting over him.However..Battle and action scenes are less than poor. From the way people holding their guns (no trained person would do it like this) to the point fighting scenes are taking place looking slow , similar to a training pace.A person who is supposed to have such a long time in special forces as described , should at least have a certain fighting style and pattern , quite distinctive from average persons or even thugs.All in all, good effort in plot and acting...but failed huge when it comes to battle/fight choreography. In an action movie this should be a pro+ and not a con-movie to my opinion is a 6 to 6.5. Watchable but nothing more than that."}, {"id": 69, "text": "I saw the trailer on Netflix and immediately realized this was not gonna be high on action, but the plot looked interesting and i was hoping they saved the best scenes for outside the trailer. My cousin and me didn't knew what to watch so we picked this.First of all this is an Italian movie, so obviously i am not expecting US budget, especially as DTV or Direct to Netflix (i think?) but sometimes peoples do miracles with small budgets.The story like i said looked interesting and it was, i mean its easy to root for a dad going to save his daughter from sex trafficker. Sadly if you expect a Taken style movie, you will have your hopes shattered.Despite being a former spec ops commander, and being called The Beast, outside looking the part the main character never show much of it. The fight scenes are sluggish, he never make good military style decisions or show badass training, he just look like a regular slightly built above average dad who happen to hit the gym. Worst is most of the time he does not even bother to take weapons, even basic ones like knives or such, with him to give himself a fighting chance. Without going into spoilers there is a lot of plot conveniance too.So yeah the movie is a bit boring, yet somewhat maybe because its a story easy to get into, i still was in it, and wanted to see what would happen next. So thats why i am giving him the average rating of 5.I just wished the hero would had been more badass, with more action. I don't regret having watched it but will certainly don't watch it again."}], "reviews_amount": 70}