{"name": "The Crying Steppe", "titleId": "tt11434772", "reviews": [{"id": 0, "text": "Watched this film recently, I was filled with so many different emotions. It is a very heavy film but it is important for us to remember our past and accept it so the same mistakes won't be made in a future. It is a miracle what a film company can do on a power of will and raw determination without the financial support from the government, just so the people could know and remember what their ancestors went through for them."}, {"id": 1, "text": "The film touches on historically important topics of the Kazakh steppes. Shows all the harsh truth. Each story, each frame is filled with a touching drama. Although the film looks cheap from the technical point of view, its meaning and importance is much higher."}, {"id": 2, "text": "👍👍👍👍Very, very good film! Dramatic story about the tragedy of Kazakh people in XXth century"}, {"id": 3, "text": "Cried all night watching this film. It touched my heart, my soul, the core of my being. A true masterpiece! I really hope this film will win an international award such as Oscars and bring international recognition to the Kazakh genocide!"}, {"id": 4, "text": "The film shows the real history of our ancestors, the history of our people, our ancestors does not leave us indifferent! what they experienced is simply beyond words ,,,, 😞 We must know and remember our history!"}, {"id": 5, "text": "Recommend to watch it for every person. Best drama ever."}, {"id": 6, "text": "Powerful movie! I recommend this film to anyone who cares about the history of humanity. It is a real story tragedy which was lasting for 2 decades all over the world. I wonder how those nations survived and even have their own independent countries. Now back to the film, how on the earth is it possible to shoot and produce such a coloristic and passionate film with the budget of only 2 millions?? This is a secret I want to find out about! Bravo to the producers and everyone who worked on the film, you can undoubtedly tell the enormous amount of work and love to what they do. Applaud you guys!"}, {"id": 7, "text": "Watched this film couple of times. Very important subject and great acting. Well done to the cast and crew."}, {"id": 8, "text": "Film is amazing! Watched with sister, 100% recommendation 👏🏽"}, {"id": 9, "text": "Finally a film that tells a true story about the famine in Kazakhstan. The creators of the film have done a great job to show the horrible and tragic events that our grandparents had to go through. My grandmother always told me stories about the famine and thank you to the creators for such an incredible work!"}, {"id": 10, "text": "Very powerful film. Recommend to watch it. Great acting, very well directed and ghe story is very touching"}, {"id": 11, "text": "A very moving film, thank you for the work you've done. The whole family cried while watching ..."}, {"id": 12, "text": "This is a wonderful, worthy film, I vote for Kazakhstan."}, {"id": 13, "text": "Best Kazakh film I've ever watched. I accurately shows the horrible tragedy that happened in Kazakhstan during the famine. We watched with the whole family and couldn't stop crying. This film makes you think how grateful we are to live in a peaceful country!"}, {"id": 14, "text": "Well done guys!!! Would have more such films. So that young people know their history and appreciate what they inherited from our ancestors"}, {"id": 15, "text": "What a wonderfully movie! I watched in one breath! watched and roared over the film!"}, {"id": 16, "text": "What an acting game! Oh my goodness! It's fine!!! Awakens a sense of patriotism, watching the film you begin to understand what our people have not seen."}, {"id": 17, "text": "In the western world, there is very little knowledge of the 20th century struggles that the Kazakh people suffered at the hands of the Red Army and a terrible drought, so this remarkable film is not only an absorbing epic drama but an enlightening history lesson. How wonderful that a very talented and determined Kazakh woman writer director has managed to make it in difficult circumstances without access to any European support. The film is a natural for the festival circuit and it is hoped that as many people as possible will manage to see it, enjoy it, and learn."}, {"id": 18, "text": "A very frank film about those years about the hunger strike, about how our people, the great Kazakh people, suffered. I think the film deserves the best award."}, {"id": 19, "text": "The very good films! the film is very touching description of the fate of the lives of people of hard times"}, {"id": 20, "text": "This movie about my homeland / country - Qazaqstan!"}, {"id": 21, "text": "I've heard about it from my grandmother, but never thought that it was that bad, however I recommend to all Kazakhs! Allah bless them all!"}, {"id": 22, "text": "Happy that I came across this, good job to everyone who participated!"}, {"id": 23, "text": "This work is very beautiful and moving. It is impossible to forget this terrible event in our history, not to grieve and cry for our ancestors and brothers and sisters. Through this film, we understood the story of the Famine and touched our hearts. Thank you to everyone who took part in the film."}, {"id": 24, "text": "Very nice movie. Worthy of an Oscar. The whole world should know about the genocidal policy of the Bolsheviks against the Kazakh people. May the land of my noble ancestors, where the narrow road was slippery, rest!"}, {"id": 25, "text": "I am proud of my country! A great movie! All at the highest level!"}, {"id": 26, "text": "Super 👍👍👍👍👍👍👍 👍👍👍👍👍👍👍👍 😭😭😭😭😭😭😭"}, {"id": 27, "text": "So, this drama is one of films - what i like in this year. This is looks like a Metal Gear Solid and this is sounds like a Metal Gear Solid"}, {"id": 28, "text": "Best of the best, great film worthy of an oscar. I am proud that we have such talented people"}, {"id": 29, "text": "It is realistic film! It was in history of last life of Kazakh people, when 3 million lives have been lost in the famine and repression of communists!"}, {"id": 30, "text": "Best of the best! Very nice movie. Only forward. The genocide of that time must be shown to the whole world. The truth must be revealed. There is no genocide in Kazakhstan."}, {"id": 31, "text": "The film shows the story of the Kazakh people in the era of famine. It's a very cool work, based on real events. I think the film is worthy of Oscar🏆🏆🏆"}, {"id": 32, "text": "The film shows the story of the Kazakh people in the era of famine. It's a very cool work, based on real events. I think the film is worthy of Oscar🏆🏆🏆"}, {"id": 33, "text": "The film is based on the real events. This is an untold story of century old colonization of Kazakhstan. After many years of struggle, Kazakhs have been fighting for its independence for a long time. It is impossible to watch film without tears. The Kazakhs fought with the bare hands, against well-armed Russians, fought only with one strength of spirit. Such stories are certainly very impressive. Mass battle scenes are very brutal and bloody, but the scale of filming is simply amazing! The gloomy landscapes of the steppes and the delightful soundtrack complete each other. Battle scenes make you not only shudder, but also sympathize with the actors, relive the events with them! The film describes a crime against humanity, and the immoral behavior of the colonialists. The film features one of the most memorable scenes in the world cinema history, when the hungry wolves were chasing mother with her kids, the mother faces a difficult dilemma between her childrens, choice of life."}, {"id": 34, "text": "True Soviet power story about an attempt to kill the Kazakh people"}, {"id": 35, "text": "We were waiting for this kind of movie for a long time. People need know the story. Thank you for authors!"}, {"id": 36, "text": "Movie is really touched me. Will watch it someday again."}, {"id": 37, "text": "It is a good film to come back to the history of the difficult period of time in the Kazakh people. How to survive in the difficult situation, without food and strong weather conditions? We can't imagine it but we can watch it here."}, {"id": 38, "text": "Goloschekin was well aware of the situation in the Kazakh steppes through his envoys. O. Zhandosov, who visited Sarysu district on a special assignment, gave the following information: While visiting the villages, I came across corpses that had not been buried for decades ... Women endure poverty and hunger. Men are immediately discouraged. Depressed people eat whatever they can get their hands on. The bones are collected and boiled dozens of times to connect the heart. Semi-processed hides can also be replaced by food. I met a few people who ate dog meat and did not hide it. On the way from the tenth village, I saw two teenagers from a deserted Japan. In the 5th village, a woman with heavy legs, half-swollen from hunger, approached me and asked me to shoot her with a dog.The Holoshchekin genocide left Kazakhstanis, first of all, the Kazakh people, hungry and refugees. This was the result of the Bolshevik experiment - a mother complaining, a child crying, the Kazakh steppe darkened and stinking."}, {"id": 39, "text": "The best movie ever. It is about our Kazakh's history! It is about truth! It is about Russia's violence!"}, {"id": 40, "text": "Creative success to you. Keep making films like this😍"}, {"id": 41, "text": "The film is very exciting. We sat in the same breath. The actors performed at the highest level 😍 Big applause 👏👏👏👏"}, {"id": 42, "text": "The best movie I've ever watched so far.. heartbreaking and it shows true stories about that awful times in Kazakhstan.. my great grandmother lost her 9 kids in that Holocaust... thank you!"}, {"id": 43, "text": "Thanks to the creators of the film, the picture really deserves all the nominations and awards.this is a terrible part of the history of the people, which everyone should know and remember. Poor long-suffering people, they suffered the same hardships and losses. There are not enough words to express the full range of emotions and feelings that I experience after seeing this picture.praise be to Allah, the lord of the worlds that we and our children do not know what hunger, cold and war mean.Today, on the Independence Day of the Republic of Kazakhstan🇰🇿💖, I wish you a peaceful sky, harmony and prosperity!🌺"}], "reviews_amount": 44}