{"name": "Pets United", "titleId": "tt11276598", "reviews": [{"id": 0, "text": "This movie is just awful. Like, not offensive or anything. Theres nothing in there i would not want my kids to see. Its just bad. It feels like somebody fed the twenty most popular kids movies on Netflix to a computer and asked an algorithm to write a script. Then it was edited and retold by my five year old. And then the voice acting was done by whoever was available at the local community college. Cliche tropes is one thing, but this one is done with no charm, character, emotion, nothing. The story is somehow both standard cliche tropes AND makes no sense. The pacing is slow so there is no excitement, the characters are flat so you really dont care about anything one way or another.Its just plain bad."}, {"id": 1, "text": "It kept the kids quiet for 1h29mins . Who cares about the plot dialogue etc. its all about keeping the kids busy while you drink 😉"}, {"id": 2, "text": "This movie has absolutely no redeeming moments. No good parts, the most boring and useless hour and a half you'll ever spend. Watching paint dry or grass grow would be a better use of time. What Rodger leaves in front of the door to distract the robot doorman sums this movie up exactly."}, {"id": 3, "text": "The worst animation I've seen in a long time. Story line is rubbish. Voice actors really didn't try."}, {"id": 4, "text": "I made a profile so I could review this movie and tell you how bad it is. The closest thing to a highlight is the time a robotic police officer attempts to read a stray dog it's right in a supermarket that the dog is shopping in, but that sentences is funnier than the scene."}, {"id": 5, "text": "Not sure why this was made...graphics are good...story is truly awful"}, {"id": 6, "text": "The entire plot could be explained in a few sentences. It should really be a 5-10 minute animated short and even then it would be unimaginative.The animation looks good in stills but in motion it's awful. The editing is just bad. Nothing feels smooth or natural. None of the dialogue is interesting at all.If I gave netflix budget animation tools to your average high school level writers and designers you would get this movie. Even then I would give them a C-."}, {"id": 7, "text": "It made me think of all of my life's bad decisions as I watched this with my girls and seeing this movie will make telling them where babies come from and that only liars say that Santa isn't real so much easier for me.The Foley Artist must have had 1/2 of the budget after the animators and puke bag makers took th other half.**Spoiler Alert** * *see above TL:DR Go learn how to smoke or whisper to polar bears."}, {"id": 8, "text": "It's just bad. The dialog is forced. Voice acting is terrible. Story is worse."}, {"id": 9, "text": "Waste of time and money. Unites all popular topics in one whole unlogical and boring film. Pets animations moves lack reality and consistency. Film full of senseless brutality and cheap humor. I don't recommend it."}, {"id": 10, "text": "If you mush The Secret Life of Pets and Next Gen together, you get this... The plot outline is virtually completely ripped of from Next Gen, and the troupe of walkabout pets should incite familiarity with Secret Life.... But it doesn't work. At all. It just doesn't make sense. The Rip-off is too obvious and the Pet-angle has no merit in the plotline... It's like the Scary Movie franchise (... that surfed the tail of the succes of Scream), but with Animation. ... Set your Whelm-o-meter on under..."}, {"id": 11, "text": "All have been said I'm all other reviews. This movie is terrible , I mean crazy bad. No new ideas , no excitement, my kids are bored like watching a closed tv, and I guess there are more excitement on a dark screen than this movie.If you saw no animation movie from the past decade you might find kind of interesting ideas, but theses are all stolen from real great movies.Dont waist your time."}, {"id": 12, "text": "This film is so terrible, I just don't know where to start. Its a bit like some home made youtube animation thats been made feature length. The kids gave up quite quickly. I was getting increasingly annoyed that something this bad somehow was released publicly, but thankfully the kids turned it off!"}, {"id": 13, "text": "So, all previous reviews, I hate to say, are spot on. This was the worst scripted animated movie I have ever seen! Even the Wallace &amp; Grommit movies have better scripts than this! Even the movie where you have to be quiet, or the monster are going to eat you had a better script! The graphics are the only thing that made me endure sitting through this, with my 6 year old daughter, and even then it was hard work!"}, {"id": 14, "text": "Incredible waiste of time indeed. Pretty bad movie, bad animation, bad quality, bad jokes."}, {"id": 15, "text": "From start to finish this animation drags out every cliche with the least dynamic musical score I have ever heard. There is actually no story at all, just a pointless sequence of vacuous scenes that repeat over and over again. My son didn't laugh once or show any emotion whatsoever. I will never get that time back. It wasted our precious friday cinema night. Avoid completely."}, {"id": 16, "text": "Do not, I repeat, DO NOT! Watch this movie!!! This has been an waste of time for me and my family!"}, {"id": 17, "text": "Never want myself nor my family or even anyone I slightly care for to watch this trash movie ever again. After watching I just feel brain dead and frustrated."}, {"id": 18, "text": "I hope this ones makes the no 1 on the worst movie list"}, {"id": 19, "text": "The dialogues, seperate scenes, storyline and 'message' are all terribly on the nose. There's very few genuine moments or emotions.There's nothing new or remotely exciting about the whole thing. And the cherry on top for me was the propaganda for keeping big cats in cages in zoos. Joe Exotic, was this you?"}, {"id": 20, "text": "These reviews are hillarious - Most adults hate kids stuff anyway but kids love this stuff, you know pets and robots what could go wrong? most western 13 yr olds are stuck playing GTA 5 or fortnite instead of reading so 5/10 stars because hey it keeps the kids busy for an hour and a half i guess."}, {"id": 21, "text": "First off, movies have ratings for a reason...TV-Y7 means its not really meant for kids under 7. So all these posts about hiw this movie isn't suitable for their 2 year old..well duh...it says its not. Anyways, on to the movie...its a decent story with decent acting. It could be better but, I have seen far worse. It has a good lesson for kids about not judging others. Give it a try.. I mean..its not like you can't stop it and put something else on."}, {"id": 22, "text": "I don't know why all the negative reviews. It looks like a concerted anti Netflix campaign. It's a kids film and as such it kept my 10yo happy. It's not breaking any boundaries and the animation is not bad. It's not Pixar but it's no where near as bad as some reviews are saying. The story is simple but it is a kids film. I would have given it 7 stars based on my daughters enjoyment but I'm giving it 10 to try to counteract all the undeserved 1 stars and reviews which is obviously some sort of campaign against Netflix."}, {"id": 23, "text": "I put it on for my 2 year old because she loves The Secret Life of Pets. She had no interest in it from the beginning. Besides that, there are robots that throw knives at pets, a lot of violence and inappropriate language. Not recommended for children, especially young ones."}, {"id": 24, "text": "My son is 3 and loves this movies we have been watching on repeat for days"}, {"id": 25, "text": "Bad voice acting, and not funny at all. Kids watched only because they didnt want to go to bed!"}, {"id": 26, "text": "20 minutes in and I'm baffled by the repetitive negative reviews. Seems like some snob Karen's got offended and got thier bookclub together to rag on the movie, just look at the vernacular they use in their reviews to see what I mean. Finished the movie in full, Watched on a 4k tv, saw now frame cuts, haven't heard any inappropriate language, decent animation, just seems like a silly kids movie. Not for your 2 year old... it is rated Y7, go read your kid a book or play with them. If you aren't actually watching it may be hard to follow the story. Giggled and laughed during the movie, easy to follow plot, definitely rags on rich snobs, touches on the hardships some face in life and calls out for the unity for the 99% against the 1%.Spoilers: 1) No one dies 2) Bad animals singing is supposed to be bad 3) Isn't a musical"}, {"id": 27, "text": "Uh oh, Netflix, this is a huge step down for you. The animation is trash, and the story makes no sense. And A robot with a British accent? Sorry, this is a stinker."}, {"id": 28, "text": "I'm a big fan of all the animated movies - right from the cheering cartoon characters in late 80s and 90s to more advanced animated movies in the recent era. There have been some average titles in the animation segment but nothing could beat this...forget about the plot and characters, it doesn't even feels like a 2020 animated movie by looking at its poor animation graphics. Please don't waster your time on this one!"}, {"id": 29, "text": "My 10 yr old is usually able to watch _anything_, as she likes new cartoons no matter how bad they are - but this one was really something else.netflix doing such chinese productions is abusing any limits of sanity. it was horrible."}, {"id": 30, "text": "This is my first review here. I have to warn you about this film. It's really the worst there is. It's not even worth an ironic view. Don't waste your time."}, {"id": 31, "text": "There is nothing good here. Nothing. The animation is bad. The world is lifeless. The voices are really, really terrible. Nothing makes sense in the movie. It's terrible. It's garbage. It's so bad, it's actually offensive."}, {"id": 32, "text": "Just bad. Both a 10 and a 40 year old agree it's so bad"}, {"id": 33, "text": "With Netflix's budget, one would think they could come up with even a half-way decent movie. Instead, we got Pets United. Trading on the Secret Life of Pets font and animation style, you start off thinking this will be a fun ride. 10 minutes in, you realize the acting, dialogue, and story are truly a useless waste of time. I want this 90 minutes of my family time back.I made my account specifically to warm other parents about this movie."}, {"id": 34, "text": "A very poor mixture of Secret Lives of Pets, Toy Story and Robots. I'm still trying to work out what animals are actually in this. The only likeable thing about the movie is Bob the Baymax clone from Big Hero 6. I'm still expecting Wall-E to pop up...No story, no characters, no music score and no acting. Other than that, it's not too bad for my 7 year old."}, {"id": 35, "text": "Animation was good, other than that a waste of 90 minutes."}, {"id": 36, "text": "My family of 5 watched it. Only one made it to the end. Everyone else fell asleep."}, {"id": 37, "text": "I have never written a movie review before in my life but I felt a sense of obligation to do so in this case because the movie is REALLY, no....I mean REALLY, horrible. I'd get into details but I've already lost too much time. To remain honest in the review, I will say that my 7 year old seemed to like it, we agreed to disagree!!!!"}, {"id": 38, "text": "The storyline is awful. Wait does it have one? The acting is terrible The animation is awful"}, {"id": 39, "text": "Not a good plot, no good graphics, no emotion. I Just saw it for the favour of my daughter"}, {"id": 40, "text": "I watched this with my 6 year old son and we didn't even finish it. The voice actors were terrible. It felt like it was written by a 2nd grader. The story line was all over the place and so boring. There were zero climactic points whatsoever and it just dragged out. I've have dental visits that were more exciting. If you're having a hard time falling asleep, then this is the movie for you because you'll be knocked out in no time"}, {"id": 41, "text": "It's like who ever created this googled what's popular in 2020 threw all the words in a hat and said f*#k it we can make a movie out of that"}, {"id": 42, "text": "Not a single funny moment. Just painful viewing. Avoid"}, {"id": 43, "text": "So bad...so very bad. Too many things wrong to list. Just imagine the computer program that made that one Dire Straits video watched Secret Life of Pets, drank rail vodka, and vomited this film into existence."}, {"id": 44, "text": "Kids liked it. I fell asleep. Made me realize how good Pixar really is."}, {"id": 45, "text": "Seriously garbage movie wouldn't recommend to anyone."}, {"id": 46, "text": "The animation is decent, the story is ok, I agree its not pushing any boundaries, but its far from the worst animated film I've ever seen. I may be slightly biased as my two year old has watched every day, sometimes up to 3 times a day since its been on Netflix, she loves it."}, {"id": 47, "text": "Disclaimer: did not complete viewing.Deeply disappointing from the first minute. It's... hideous. The animation is choppy, the main characters' faces are flat (no life to them at all), and right off the bat both the story and the voice acting is woefully inadequate. Hard pass."}, {"id": 48, "text": "I don't know why most of the reviews is negative!! It was a good movie, not garbage!!"}, {"id": 49, "text": "My son watched the whole thing without distraction, he loved and didn't keep popping up for other stuff. The bit I saw was fine. Not sure why all the horrible reviews"}, {"id": 50, "text": "Wow i have never seen a worst steaming pile of hot garbage in my life. i wanted to like the two main characters so bad but i just could not connect with any aspect of this movie.There was no understanding of the laws of physics, not to mention some characters ability to speed up and slow down time, the story line was non existent, the acting was worthless and the animation while it did make for some cute looking pets i will never understand what was wrong with that red panda.This movie was just painful to watch."}, {"id": 51, "text": "Myself and my 3 and 7 year old both loved this movie! Not sure what the terrible reviews are for!"}, {"id": 52, "text": "This movie is a great example of why we can't let China influence our culture. This is the WORST animated movie I've ever seen by a large margin. No emotion, no storyline, no sense of adventure, no nothing. It felt very sterile and just lacking anything that resembles it being written by human beings. Wish I saw these reviews before wasting my time."}, {"id": 53, "text": "Everyone says it's a bad movie but my daughters and I liked it. It was pretty good. It had funny parts and emotional parts."}, {"id": 54, "text": "Cheap Chinese /German animated kids film, awful story, really young children may like the animation but the dreadful dialogue will definitely send them to sleep"}, {"id": 55, "text": "This is Just plain bad the only intresting thing in this movie is the logo but also too generic"}, {"id": 56, "text": "There's some good moments in movie, but in most of parts im just confused, that dog keeps saying, Hm..., It's just boring, DON'T WATCH"}, {"id": 57, "text": "This is not one of those it's so bad it's good movies. It's just a bad movie. Neither of my kids (4/5) managed to make it to the end, and I regret forcing myself to sit through the entire film."}, {"id": 58, "text": "As an adult who loves cliche kids movies, this was really really bad. I'm one who does their best to finish movies I start so I finished it and I couldn't wait for it to be over... If it wasn't for the underlying bad storyline of the dog finding his owner in the end I would have quit long before the ending. They couldn't even give the bad guy the redeeming quality of changing when he found their long lost dog. They just made him a robot and turned him off. Didn't even have a satisfying ending, it just just kind of stopped. I'm being honest here. Don't watch this unless you want to waste and hour and a half of your life. I regret my decision."}, {"id": 59, "text": "Has to be THE worst animated movie I've ever seen. I'd hoped it would be fun, light-hearted. Nope. I've only seen/heard of one of these actors. Did they find the rest in a acting class? And just HOW many times can characters say, Huh?in the first ten minutes? I doubt if this could hold the attention of a small child. 🤦‍♀️"}, {"id": 60, "text": "OK. As an adult that loves clever kids movies with adult humor... Pixar, Disney, etc. This isn't it. 4 stars means my 7 yo liked it but I was bored and unimpressed. So I evened out the rating. Young kids movie only. The title looked like a spinoff of secret life of pets, so I expected better. Overall would have been a decent daytime movie from 1999"}, {"id": 61, "text": "Well I've finally done it, watched the worst movie in the universe. its got the same damn plot(except for the villain's) which is people meet become friends and take down bad guy. but that's not it, the villain is no doubt about it Ultron's lame sibling. basically Ultron wants world peace, so he tries to kill all living things. and to back him up he's got a robot army. sound familiar? also some of his robots include the spider robot, which was in the Incredibles and looked the same as the one in this movie, but also star wars, it didn't look the same but it was in it. If you did watch this movie, you would find a whole truckload and more of bad logic, things that don't make sense at all, and plot holes. There are so many that I'm not even going to talk about them. if I did then this review would longer than the college dictionary."}, {"id": 62, "text": "If someone watched Big Hero 6 or The Incredibles. The little robot reminds me of Baymax and the octa-legged robot reminds me of Syndrome's robot. The hyena is somewhat a copy of the Lion King hyenas. Good fur animation it has on the spa scene. Well done you chinese CGI filmmakers! And, if someone saw the CGI 2005 film Robots, various scenes reminds me of that film.Me and my 11 year-old brother we loved so much this movie. Somewhat awesome.I would recommend this movie to furries!Edit: That white cat and that blue dog loving together at the end are a lovely relationship and i'll ship them! They are very cute!!!!"}, {"id": 63, "text": "This movie is AWESOME, it's kinda reminds me of Oliver and companyRoger is a street smart mutt like dodgerBelle is a pampered but feisty female siamese cat who is the second in command of the group, she is rogers love interest.Sophie is a giant Bush pig who is in love with WalterWalter is a brown male pug who is Sophie's love interestRonaldo is a male poodle who is obsessed over his image and tries to hit on BelleWhile I feel this movie is going to get a lot of HATE, I think it's a great movie even if it seems short"}, {"id": 64, "text": "A cross between 'the secret life of pets' and 'I robot', I really liked this film. Proper storyline and likeable characters 👏"}, {"id": 65, "text": "The Secret Life Of Pets meets... any of those sci-fi dystopias in which machines take over. It has distinct characters with good design, slapsticky action, some genuine humor, and a bit of heart. Yes, it's awkward, odd, has some off-putting elements but for an animated movie premiering in the US on Netflix it's pretty good."}, {"id": 66, "text": "I honestly can't believe i watched this tripe. Excellent animation (all done in China), marred by a terrible script (all done in America) with terrible voice actors (i couldn't even be bothered to look them up) AVOID!!! (and if you have kids make them avoid also) so many stereotypes it's untrue. What a waste of talent. (I.e The Chinese animators) Absolutely awful film."}, {"id": 67, "text": "I can't even write a proper review for this movie, it's so bad that words cannot describe what I'm feeling. I almost want you to watch it so you can feel my pain. DO NOT WASTE UR TIME! You will not get it back."}, {"id": 68, "text": "*SPOILER ALERT*Everyone is saying how awful this movie is. However I think it was a good movie with a good story. At some point in human existence, I bet this could really happen. No exciting heartfelt moments? What about when Roger turned out to be stealing for other homeless animals? Or being reunited with his long lost owner?"}, {"id": 69, "text": "Ok, maybe not hate them, but I really had to take a moment and think about how much I wanted to keep contributing to their college fund. Fortunately, they were redeemed when they would rather take a bath and go to bed at 7 pm, instead of the usual whining about wanting to watch the rest of a movie and not go to sleep yet. Such a garbage movie."}, {"id": 70, "text": "My 8 year old liked it, but he's easily entertained. It was hard for me to watch. Very slow, the pacing was off and the dialogue seemed written by an 8 year old - maybe that's why he liked it so much. The music, sound effects, voice acting... all of it was terrible. It was just plain boring."}, {"id": 71, "text": "Bad animation for 2019, bad writing, bad acting, bad pacing. And even some bad language for little ones, so don't even use as a distraction. Avoid this."}, {"id": 72, "text": "I would defiantly recommend for younger kids maybe 4-9 because it was a very basic story line and it was funny. Defiantly great for a movie night with young kids so they can click with the story more."}, {"id": 73, "text": "Found it incredibly boring. It didn't capture the attention of my 7 year old either. Also, it was uncomfortable to watch, superficial and had some pretty over the top stereotypes. Just not what you'd expect from a modern day movie."}, {"id": 74, "text": "Okay... What's the meaning of this movie supposed to be? There's a storyline but it goes like A-Z and comes back to C then go to P and run back to A. It's pure rubbish, you'll find a few positive reviews but last don't consider them.. ignore this as much as possible.. Not suitable for kids, not suitable for adults, not suitable for anyone."}, {"id": 75, "text": "Al lone group of survivors in a shopping mall is onder attack of a brainless hord of.....service robots.Cant agree or disagree with the bad reviews. My 9y/o liked it. For the 6y/o was a bit to much right before bed time....but it's a 7+ movie so that was expected.A see right trough story. The Dutch version had ok voice acting(can't judge the English myself)Your basic cute/funny pets interaction. Nice for a couch moment on a rainy day."}, {"id": 76, "text": "The animation is the best part, however, it is noticably below your average animated film. Nothing really seems to be happening on screen. Expect your mind to wonder off with bordom. Younger kids will like it."}, {"id": 77, "text": "My 2 grandsons watched the 7 year old was ok with it not to interested in it though. The 4 year old said it was to scary for him."}, {"id": 78, "text": "What a complete waste of time! Everything is bad about this movie"}, {"id": 79, "text": "Bad story didn't make any sense the acting is not that much better. It my be ok for your 8 year old but definitely not a film for the whole family. What a waste of my time please read some of the reviews before you give up your time to this terable film. The best part about this film is when it finished."}, {"id": 80, "text": "Kids will probably still enjoy this movie, just don't make the mistake of watching it with them. My 9 year old laughed a few times and said she liked it. But to put that in context, she also claims Back to the Future Part II is a superior movie to Part I. Pets United has an unoriginal story with boring characters. Its parts seem to be lifted from many of the great animations of the last 20 years, but with all the cleverness removed. Imagine a 4th grader just watched Wall-E, The Secret Life of Pets, and Zootopia, and then sat down and wrote an animated movie draft. The result would be Pets United."}, {"id": 81, "text": "This was so hard to watch with the kids. Super awkward musical interludes, story was terrible. Action sequences silent. Random cuts. Kids said had some funny parts. Kept them entertained. But don't hold your breath."}, {"id": 82, "text": "I'm not a movie critic, I don't know technical stuff about film making or animation and I'm not up on the latest releases. That said, I watch ALOT of animated stuff due to kids age 4 &amp; 6. I therefore feel qualified to comment on this pile of... animation. That's really what it is. There is a very loose plot, voice artists sound very stiff with very poorly scripted material. Jokes, were there jokes? I usually watch animation for the jokes. Animation wasn't great, clearly on a budget. The film is still on as I write this, I'm so bored I've decided to review it!! My first ever review!! All this being said, the kids are enjoying it, well the 6 yr old is, the 4yr old has fallen asleep."}, {"id": 83, "text": "Only thing that's slightly good is the quality of the rendering. But that creates an expectation of a good movie, but it isn't. It's like they kept all clippings from the edit room of some great animation movies and blindly patched them together. Only reason for existanxe: as an example for how to make a bad animation movie. Double thumbs down 👎 👎"}, {"id": 84, "text": "Stray dogs are a major problem and should be euthanised. The dog in this movie was a thief and a menace, clearly what he needs is a bullet. Wish we had robots to clean up disgusting strays."}, {"id": 85, "text": "Never play this garbage film. Never. Please. Never play this garbage film. Never. Please."}, {"id": 86, "text": "If the storyline doesn't confuse you the random insertion of characters definitely will. Really not sure why it was pets and robots. One or the other might have been interesting. The result is a mish mash of bad dialogue, poor content, dull voice overs and a keen desire to switch the whole thing off and watch anything else. Even paint drying seems like time better spent."}, {"id": 87, "text": "In my family, we have seen almost every animated movie there is, so our eyes and ears are used to a certain level of experience and this movie has failed to get to that min level.. if you are like me it would not take you more than 10 minutes to realize you are wasting your time watching it."}, {"id": 88, "text": "I've got 4 kids from 3-13 and not even one of them liked the movie. The dialogue was clunky, and boring. The storyline slow and predictable. We really tried to like it. But alas it sucked."}, {"id": 89, "text": "My husband put this on for our kids, and I walked in and the first sentence I hear is that's a hell of a crew you got there and that's just the tip of the foulness. We ended up shutting it off. Unless you would like your children's cursing vocabulary expanded (or created), DO NOT LET YOUR CHILD WATCH. How this is okay with Netflix for child viewing is beyond me."}, {"id": 90, "text": "This is the best animated film to ever be created. The random musical breaks? The plot holes? The animation? This movie is truly a treasure and it is way ahead of our time. Not only does the main character, Roger, have a touching storyline with his new best friend, Bob, but there are many entertaining side characters with diverse interests, personalities, as well as species. It feels like a dream. There are some incredible one liners, and the rap done by the three zoo animals is brilliant. In fact, all the songs featured in this movie are incredibly catchy and fun for everyone. This movie is family friendly, very inspiring, and a great watch. Maybe it's because my roommate and I are depressed college students, or maybe it's because this film is truly the best animated film of the decade. Either way, I recommend giving this movie a watch."}, {"id": 91, "text": "I lost interest after a few minutes. The kids seemed to enjoy it though. James Corden voices Bob the Robot right? Why is it cast someone else..proper soundslime JC"}, {"id": 92, "text": "I think that Ronaldo Dog is Cristiano Ronaldo 🙄 Its a decent film"}, {"id": 93, "text": "My Grandchildren, who are aged 4 &amp; 5 loved the film, it was sad in parts and I heard them laughing at other scenes, so all in all a successful movie. Don't take any notice of Bosscain, he's obviously too immature to appreciate the film and it's philosophical message."}, {"id": 94, "text": "Worth a watch. Few things could be better, but overall enjoyable. My 5 year old who isn't a fan of movies watched it the whole way through abs said he really liked it."}, {"id": 95, "text": "Well all I can say is this is one of the worst animations I have seen in a long time.To begin with the voice actors have no other emotion other than read as if they reading a book or maybe they thought they were all the robots. How they got Natalie dormer to sign on I don't know, she must have just been killed off on thrones and thought she wouldn't have got another job like all the other deaths off that show. Don't even get me started with the Ronaldo character and his voice that is just ridiculous.Then the actual animation itself is pretty poor and would expect this as an early 2000 cartoon film.As for the story that is just ridiculous, the story boarding meeting must have been a free for all, they must have gone we like secret life of pets, wall-e, big hero 6 and bolt and then I am legend and thrown it all together and well it is just a big mess.The song with the crocodile, tiger and hyena has to be said is awful.If you can don't bother watching this with your kids as it is no fun nor entertaining."}, {"id": 96, "text": "Something obviously went very, very, very wrong during the making of this computer animated movie. The only theory I have that might explain its general failure to entertain is the fact that it was a co-production between three very different countries - China, Germany, and the UK. With three different cultures working on the same project, it seems that it couldn't be fine tuned to be satisfying to one (or any) culture.The movie fails in two big ways. First, there is the script. It is an utter mess. There are many things that are not explained, character development is usually near zero, and there is obvious padding. The second misstep is that it is directed in a manner that is pretty much free of passion and enthusiasm. Things plod along EXTREMELY slowly, and when there is a scene of action or suspense, the movie is remarkably casual and unexciting. Even the music score throughout is held back so much that you hardly register it in your mind.In fairness to the movie, I will admit that I wasn't unsatisfied by its visual presentation. While the movie didn't have a Hollywood budget, the movie looks fairly colorful and detailed. But even with an acceptable look, the rest of the movie is so tiresome and badly handled that it was a real struggle for me to watch the movie completely to the end. I think even young children will get some sort of feeling that the movie is being held back in many key areas, so even they should not be subjected to watching it."}, {"id": 97, "text": "For me to stop and review something? It's preventing others from wasting precious time.Premise is rock bottom - I mean so empty that I'm questioning a cartoon.Pets, with their people, live in a robot town. That's it. That's the whole thing. Why?My 4 year-old daughter will watch YouTube all day long. It could be Russians doing Frozen. It could be Elsa in German. It could be rich kids opening toys. I can watch some of those.It's like someone in Europe randomly chose several Youtube videos, added some Tom and Jerry, put them in a mixer and shook them up.I feel like the movie should have a disclaimer at the end (didn't get that far), If you like this movie, you were not paying attention."}, {"id": 98, "text": "As a stark hater of movies like Dolittle(2019) and generally a very cynical and unpleasant person, I was positively surprised by this movie. I mean, it looked half-baked at first, as if something was wrong, but then I just remembered my childhood and realized... damn, there is actually a thing called a cartoon for children. As in - a cartoon for the actual children. All the teletubbies and stuff like that. And that's perfectly okay, we've all been through that age. To see a full-sized movie(and not another cheap TV show), rather well-animated, and, despite all the grunts - surprisingly well-voiced, not to mention not devoid of a soundtrack - it's refreshing. After all the propaganda of Zootopia, after all the cringe of Frozen, after the literal ADD bait of Dolittle - a nice and kind cartoon for the very youngest... It's a good addition to any family collection. I mean, at least this movie is useful. It's actually harmless. For all the violence, collateral damage and whatnot - it's nothing compared to what you shmucks have probably been raised on, like Tom'n'Jerry. Sure, it could maybe be a little less... on the nose, but, again, it's all intentional. And really well voiced, these actors could really star in bigger pictures. And I wouldn't mind seeing more animations like this. Everything is better than Cloudy with a Chance of Meatballs. Ugh...Ranking up there with Dolittle for some of the worst child movies ever. Why? Because there are pretentiously stupid movies. They try to be... silly. For the sake of... some circus effect or something. THAT is actually dumb, clown-level dumb. Movies like this one, on the other hand, are honestly stupid. Because they aren't meant for us adults, they are meant for the kids, who literally don't and can't know better. You don't need to pretend to be dumb for them, you don't need to pretend to be silly. You just need simplicity. And, hell, when this simplicity is better animated than Sesame Street - I think it's production budget well-spent.And, seriously, I don't understand the complaints about voice actors here. I have recently watched Stardog and Turbocat, and while I wouldn't specifically criticize the actors there(seeing as some were pretty much the production crew), the budget and the editing quality were actually low, so much that you could hear the difference of the rooms or placement to the mic. THAT is low quality voice track. Objectively. Which is weird, because the animation there was better. Different priorities, I suppose. But here - you have a rich assortment of characters, personalities, stereotypes and even some singing. Actual singing, not a 30 year old sings in a sound booth while we are supposed to believe that a 18 year old girl wants to let it go. How is that bad? Sure, there are a few mistakes, like slightly misaligned grunts(first ten or so minutes are almost entirely grunts, and, somehow, even these grunts are damn well timed, Captain Marvel could learn some character from them) early on, but eventually, when the dialogues themselves begin - it goes fairly smooth. Yes, the animation is a bit ... short on the human part. I mean, you have a problem when your robots have more facial expressions than humans, but that's hardly a huge issue. Once again, with a budget of a Netflix stream flick - it, by definition, isn't supposed to compete with the pinnacles of Hollywood technology.If your child feels like they want to see something more intelligent by the age of 7 - great. By all means. Be the good adult and show them a world of cartoons with some deeper meaning, it's good to start young. If they like Minions, Dolittle and... I don't know, Zootopia more - then... Sure. They may not be the brightest bulbs in the sky, but at least they can smell the budget. Just make sure they keep paying for it and everyone will be happy. But if your child is actually young, that preschool age when kids usually start cursing, learn about drugs and alcohol, family abuse and violence, let's be honest, we all get exposed to that world that early and no amount of modern fake internet controls is going to change that. So, if your child is that age - then this cartoon should be a fresh change from... well, everything I described in the previous sentence. We don't all watch Sesame Street our entire lives. But it was made by humans. Not Nvidia AI. And it was made for humans. Of a very specific and short age. And there is nothing wrong with that.And... if someone wants catch me on a bias or self-contradiction, I mean, if I hate movies like those Meatballs or Dolittle, but like this one... Like I said - pretentiousness. And budget. They all matter. When you spend a fortune to make a purposefully silly and cringy movie - you... are going to be judged thusly. Just like Superman doesn't work outside of comics, simply doesn't, physically and logically(and Captain Marvel only proves that), the purposeful silliness can maybe be forgiven in an honest and sharp parody movie, where it has place, purpose and it doesn't cost too much. But, for me, the bigger picture I see, the higher expectations I have. It's like in our real life... we can be silly and cheap at school, but if you try that stuff in a board meeting... ahem. So, yes, if this movie was any bigger - it would probably be The Secret Life of Pets. With all the consequences. And, potentially, benefits. But, in its own budget league, and its own target audience - this movie works well. It is actually safe to watch, with no racial, national, political, religious or gender propaganda that modern day G-rated schlock is filled with to occupy the adults. In fact, there are a few of moments that probably only adults would understand, and even those moments are well-toned. So, yes, it's not perfect, perhaps I was a bit generous with the 7\\10, it's more of a 5\\10, but there are far too many 1\\10 trolls here, and I don't troll with 10\\10, so 7\\10 is a sound compromise. Which isn't entirely undeserved. I hope your kids would... or could... enjoy it. Even if you don't."}], "reviews_amount": 99}