{"name": "Books of Blood", "titleId": "tt11242218", "reviews": [{"id": 0, "text": "It is based on Books of Blood by Clive Barker and the second film adaptation after Book of Blood (2009). But this time they made into an anthology and the end result is good. I enjoyed this one n so far this one is the best horror of this Halloween season.The best part about this one is that it moves at a steady pace, it has twists n turns, the lighting is amazingly done, nothing is shot in the dark, no annoying flickering lights, there r few good jump scares and the end very satisfying."}, {"id": 1, "text": "This is the first time ive seen mysophonia referenced in a film. Both my husband and i experience it; him with mouth noises and me with water noises, and it was a realistic portrayal of how overwhelming it can be. This anthology was an unexpected find and I'm glad we gave it a go. The actings great, the stories are engaging and varied and it wasn't predictable. I know clive barkers books are visceral and complex and I certainly understand why some fans would feel short changed, but it's worth taking a look"}, {"id": 2, "text": "What shines through is that it seems to be made for TV .. but not like Game of Thrones or so ... but made for early evening TV ... in the early 2000s or sort. It never dares to go all the way. It hints at it .. it shows potential - but it backs off.I actually liked the first story (and conclusion) .. it was kind of powerful. Scenes, images and ideas were well done - and it was a nice, sad tragedy. The other stories however felts like re-tales of older stories. They were not nearly as well done and seemed much, much cheaper - both in creativity and cinematography.For a full length suspense/horror movie, i can only give it a low score though. The stories are not good enough - they are not intertwined cleverly .. and they never exceed a rather low budget TV format."}, {"id": 3, "text": "If you're looking for a constant jumpscares fest, this is not for you. Books of Blood delivers a slow burn anthology with decent acting. Some of the stories are a little drawn out and could've done with some trimming. The pacing is where this movie suffers but it is definitely worth watching."}, {"id": 4, "text": "This is a collection of some nice scary stories. I liked the acting in general. Special effects, background music, and sound effects were awesome. In summary, if you are searching for a good quality scary movie, I recommend watching this movie."}, {"id": 5, "text": "Ok let's get this out the way first. The Books of Blood by Barker have never been equalled since publication. They are also almost impossible to translate into film. Most of their horror derives from an existential terror of something beyond our understanding. From the grisly horror of Rawhead Rex to the sublime In the Hills, the Cities all of the separate stories spin us around in search of a tether we never find. This is a pretty good adaptation of a series of books that defy translation into something as safe as cinema. There are moments of horror and some dread. I can feel Barker behind it but it just can't reproduce the terrible beauty if the writing. Nothing ever did. Hellraiser was close because Barker was still in that mindset when he directed it. This is good. The Miles sequence is the most faithful if transposed and altered. But i enjoyed it and just want to read the stories again. Do yourself a favor. Go find them and read them too. It's quite an experience. Good luck"}, {"id": 6, "text": "I'm not sure why this has so many bad reviews. I really liked it. The first two stories are better than the last, but I never found myself bored (which is saying something when you watch every horror movie and TV show you can find and nearly half of them bore you). I liked the first adaptation of Clive Barker's Books of Blood and I like this one too. If you're looking for pure gore or jump scares, this isn't the movie for you, but if you're looking for something creepy and unnerving, I would recommend this one."}, {"id": 7, "text": "To be brief, this is just another middling, bland horror movie served up by Hulu as a Halloween drop. There's a little flavor here, but overall, it's a forgettable bite from an unremarkable meal."}, {"id": 8, "text": "I can save you some time: if you want to watch this story told well, watch 2009's Book of Blood. It's better in every regard: more faithful to the source, more creative, more nuanced, better performed, visually superior... it's simply - possibly objectively - better. This new version is anemic and clumsy by comparison.The only thing it contains that its predecessor doesn't is a single story which, while not terrible, is more of a distraction than an enhancement and which also, as far as I can discover, isn't actually adapted from a story out of the titular books.Just don't bother with this version unless you've already seen its predecessor and are morbidly curious."}, {"id": 9, "text": "I'm a sucker for a horror anthology whether good or cheesy, but this one treads a fine line. Three interconnected stories that all start off almost blandly acted and poorly written, but as the stories unfold, the insanity starts to ramp up. It interweaves human monsters with ghostly ones and the result is some very unsettling content. I also like that the visionaries for this film didn't rely heavily on CGI, and added a heavy dose of practical effects, cinematography and good editing to naturally disturb me. Learning that this is based off the work of Clive Barker, it makes so much more sense as it feels like a dark poetic nightmare from the 80's. Where the film falls short is the over-extension of one story, a loosely threaded connection and failure to captivate the audience out the gate with something truly compelling. Otherwise it was a good watch."}, {"id": 10, "text": "If you've gone through all of the Shudder and Halloween titles you can find, every time something new pops up it usually incites two emotions- excitement and skepticism. Most of the modern horror is a complete let down. And with the rare exception (Snatch, Crash) most tie-in movies are even worse. This is a little gem, though. You won't be able to tie together the stories, and you wont' figure out what the book of blood is. This isn't very horror like, but it does have a little gore and some disturbing revelations. It's a bit different than most, but with just enough traditional Clive Barker elements to keep the viewer satisfied. If you're looking for something new this Halloween, look no further than Books of Blood."}, {"id": 11, "text": "Flat characters. Poorly written. And full of lame jump scares and cliches. Hulus Books of Blood is far from the creepy brilliance that is the Clive Barker books. Skip and better watch Hellbound again."}, {"id": 12, "text": "This movie has nothing new to offer. It borrows lots of ideas from much better movies and does nothing fresh or inventive with them. There is ONE interesting twist near the end that I actually thought was clever, but it would have served much better in the middle of the movie to keep people even mildly interested. There's just no reason to sit through nearly two hours of reheated leftovers to see one spark of creativity.This movie is so unoriginal it even stole its music from Willy Wonka. Just skip it and pick anything else."}, {"id": 13, "text": "What a snoozefest. The first story is alright, but after that...What were they thinking? Don't waste your time with this. Hulu, stick to acquiring films from other studios instead of making your own. This is just embarrassing."}, {"id": 14, "text": "Just excruciatingly awful, nonsensical and cringey. I'd have turned it off within the first 20 minutes, but I had to sit through it with the mother. 😩"}, {"id": 15, "text": "Nothing new horror wise. However, the first story goes on and on and is not well acted and takes up over half the film. The second story is much better acted and scripted, Anna Friel should have played the lead in the first story as Britt Robertson is not a strong enough actor, but that's the least of the problems. The problem is you need to watch to get the twist at the end and most will give up, I almost did but was too lethargic. As for the story running through well it is there just to link so it is what it is. In the end, after nothing has really happened you realize you've wasted over an hour and a half for a nice twist but is it really worth it? NO"}, {"id": 16, "text": "Title pretty much says it all. nothing interesting or especially remarkable about this run-of-the-mill horror anthology. bland cinematography, boring digital effects, lackluster wraparound tale. acting is serviceable i suppose, though the characters are given little to work with in the writing department. might satisfy bored horror junkies in search of a middle-of-the-road 100 minute romp, but that's about it. look elsewhere for your spooktober needs."}, {"id": 17, "text": "Don't waste your time. The stories aren't that great and one that should have been shorter, is twice as long as the other stories. They don't tangle organically either. There are 3 different stories where characters make an appearance across the story lines. Not scary or too creepy either."}, {"id": 18, "text": "I don't like it when movies try to tell a story and it fails to. It's like abstract art - it tries to represent or convey something that isn't there. By the way I don't like abstract art or when things are subject to anyone's interpretation or if one's guess is as good as another -- or when a critic feels more entitled to give meaning to something that is void or non-existent."}, {"id": 19, "text": "I found the three intersecting tales riveting and disturbing. I may have to read the Clive Barker books - but part of me is saying, No, don't do it. The movie starts with the murder of a bookseller, then to a grieving psych professor, and then to a runaway with mental issues. The movie is rated TV-MA for language and gore. There is a lot of gore."}, {"id": 20, "text": "It´s a B-Movie that i wished i never watched, my girlfriend &amp; i never fall asleep during movie night but during this movie we did just that."}, {"id": 21, "text": "Sigh....I remember thinking to myself when I was about 20min into the first story how much this reminded me of those cheap, poorly done TV movies you see around Halloween. You know, those ones that pass off as horror but are so severely edited, or restricted by the TV censors that nothing in it is really remotely horrific or frightening. THIS is one of those films, and THEN after looking deeply I find out that it IS indeed a TV movie lol. I will have to be more diligent checking that out in the future. First anthology was absolutely ridiculous, so poorly written and acted I thought WHAT IS THIS supposed to be about? It was so fragmented, the second story was loosely based on the actual Book of Blood MOVIE that I saw a few years ago, you know, the REAL movie! The last anthology I couldn't have cared less at that point, a short, thrown together attempt at connecting all the stories. DO YOURSELF a favour and watch the actual MOVIE Book of Blood....leave this film for TV. The only treat in this Halloween film was getting to see Rafi Gavron's bottom, the rest of it was all trick."}, {"id": 22, "text": "Sadly it's a tale from the 90's crypt keeper series only too long and drawn out and I didn't get the hilarious dialogue at the end from the keeper! Very disappointing! Please don't waist your time!"}, {"id": 23, "text": "The standalone movies that are based on Book of Blood stories are much better, not perfect but gives room to tell the story. The major issue is with this movie it lacks any Clive Barker stories it is a new story not from the books.The first tale is the worse even the last it just never made sense and the lack of any scares and morbid stories that would scare you shtless such as Book of Blood story Dread what makes it also not enjoyable if you enjoy Clive Barker books."}, {"id": 24, "text": "Books of Blood was just another crappy cliched jumpscare filled so called horror film that wasnt scary or suspensful at all and it proved to be a waste of time and space to me.Story was very messy during entire runtime and none of the stories were interesting or captivating at all .Scares were also laughable and i just coudnt take them seriously ,i just had to laugh at them how lame and uninspired they looked like.Characters were also poorly written and even if the director wanted to make them somewhat interesting,he failed big time to me in that aspect,ending was also poor and uninspired,Books of Blood was yet another weak horror film"}, {"id": 25, "text": "I loved it. Every aspect of it. Acting, atmosphere, setup, storytelling, everything. It fits perfectly all together.For me personally, one of the best horrors of 2020.I highly recommend it."}, {"id": 26, "text": "This movie was one of the most brilliant movies I've ever seen! And horrifying as well! It was incredibly different than the same, predictable horror films that continue to come out. There also wasn't one point in the film that I became bored or uninterested! 10 out of freaking 10!!!!"}, {"id": 27, "text": "So many complaints but I really enjoyed it. I took away one point for not really summing things up well. I did want to know what's up with Evil Jenna. And what was the ultimate goal of collecting all those bodies (I know she said something about keeping family close and healing people but eh - still confused). This made me want to get the Book of Blood original. Barker is about to make more money. From people who didn't like it and from people who did like it. Good money decision on him and his Teams behalf. Bravo."}, {"id": 28, "text": "Clive Barker is still the master at balancing horror, suspense and gore."}, {"id": 29, "text": "I liked each story in this movie even with some lacks between here and there, like when Jenna asked her boyfriend to jump and kill himself, they didn't explain or convince me why she did that and she's being mentally ill is not enough for me. regardless of that I favored some things that happened in the movie like how Miles's mother took her ''revenge'' on Sam, and how his play become real and the dead made him the actual book to tell their stories in that was pretty cool and the breakdown of Jenna when she saw her drowings after she woke up from a coma that really get to me. For the most part the movie did not disappoint me, good acting with some good scares(not all of them, some were really predictable). It works if you're planning to watch it during Holloween season."}, {"id": 30, "text": "It's atmospheric, the visuals were pleasant, there's not that much horror or suspense, and the stories are quite predictable, but still a good watch.I have no idea why they decided to write the Book of Blood in, I mean, this could've worked as an anthology of spooky Halloween stories, why not.The stories themselves are somewhat disconnected and sometimes the script takes big stretches just to make those connections, but the ending was cool and overall it didn't feel like a waste of time.It's far from being perfect, and some of the details they've put it make no sense, but I can still recommend this as a spooky Halloween anthology (like Soulbound, or maybe VHS), clearly not as a horror with suspense or an interesting story."}, {"id": 31, "text": "I bet most of these people haven't even finished the film. Yes, the movie does start a little slow &amp; dull but it picks up about halfway through. Acting was decent, nothing to complain about. Special effects looked great! Give it a try!"}, {"id": 32, "text": "Ok its a b-horror movie. But the way those two story's was crossed,amazed. Good work. And a little Creepy."}, {"id": 33, "text": "Reading Barker's original Books of Blood books were like being let in on the great secret of death, truly pulling back the curtain to see how the parts worked. Watching this, though, was like kicking a broken jukebox hoping to get one more play out of it. Don't waste your time."}, {"id": 34, "text": "The middle was actually not bad at all but surrounded by it was nothing but teenage angst and drama. The first half-hour is very hard to get through. You really love to hate her and I only wish her ending was worse."}, {"id": 35, "text": "I mean it's pretty bland, and certainly could not be called a horror, more a bloody thriller. The plot is weak and the direction is unsubtle but yet Britt Robertson manages to make this eminently watchable. I've long been a fan of Robertson and she does not disappoint, I can't imagine why she is not in more block busters cos she always delivers a fine performance. not the best movie in the world, but Robertson brings a great performance to it and makes it very enjoyable."}, {"id": 36, "text": "This film did have potential, but, was awful. Poor acting and terrible continuity. 1 hour 45 min I will never get back. Anna Friel must be scrapping the barrel now doing a film like this. Final word : depressing experience"}, {"id": 37, "text": "Books Of Blood for Clive Barker fans will be disappointed. You'd better off reading a book again than watching this movie. The cinematography was all right though, but to have three different stories that are somewhat connected to each other just doesn't work for me. I just don't really like short stories as there is just not time enough to make it suspenseful and interesting. The acting was okay from most of the cast. I wasn't a big fan of the performance of Britt Robertson, thought she was rather annoying to watch then enjoyable. In conclusion, even if the horror parts weren't bad the plot of the movie was just not satisfying, a disappointment to me."}, {"id": 38, "text": "Most Horror movies made up of short stories fail terribly but I thought this worked really well. I don't think it will really scare anyone, but then how many horror movies do. The acting was first rate, the direction and sound, fine, and it moved along at a good pace. Well done, would recommend to anyone."}, {"id": 39, "text": "I was not a large fan of the movie but did find myself watching the entire thing. This is a one time watch for me, nothing I'd enjoy watching again. Three interesting stories all tied into one. Not bad but also not great."}, {"id": 40, "text": "Good movie to watch for especially I am big fan of clive Barker movies a nice horror movie with a suspense in it very well made."}, {"id": 41, "text": "When I know it's comprise of 3 stories, my first reaction is uggggh... normally these kinds of movie are bad and just lame and put all 'horror' in one to feed different audience appetite. But this one is an exception. At least I'm convinced."}, {"id": 42, "text": "It's not exactly a very scary movie. But it was a bit different from average horror flicks. Best thing about this movie is the suspense. Had me guessing where it was going throughout the whole movie. Definitely worth watching specially since this has been a bad year for horror movies."}, {"id": 43, "text": "This film start a people sitting on the rocking chair, and a man Bennett killing a people at the library scene! As turnout, this film is about Bennett and Steve team up to retrieve the so called Book Of Blood! Entire film full of boring conversation, and annoying overuse scene! Such as, overuse of the jump scare scene, overuse of the eating scene, overuse of the drinking scene, overuse of the checking mouth scene, overuse of the blackout scene, and overuse of the disgusting effect scene! Make the film unwatchable! Barely intense scene is, a bunch of ghost writing on Simon's body! At the end, we found out the Book Of Blood actually is the blood writings on Simon's body! That's it! Wasting time to watch!"}, {"id": 44, "text": ".5 out of 5 stars.Books of Blood is a horror anthology film with a few collection of stories put together that may either disturb you or bore you to death. I however, found the film to be one of the worst horror films ever. Every anthology story was boring. Slow moving. The script had forgettable characters that was difficult to care for. It lacked the thrills and scares. The acting was dull. The direction is tedious. Definitely a film that is worth skipping."}, {"id": 45, "text": "Maybe I ended up enjoying it because I haven't heard of or read Clive Barker that most people seem to be complaining about on here. I thought it ended up being a great gem of a movie as I have been sifting through horror movies daily for October. All 3 stories had compelling storytelling. There was a lot of fun, creepy imagery (the eyes in the vent for example). Everyone was strong in their acting and it completely kept my interest. Overall it was a great find for a spooky flick in this October time."}, {"id": 46, "text": "If you can make it through the first story, which is a boring mishmash of psychotic episodes and people chewing loudly, then congrats...but there is no ultimate payoff to any of this."}, {"id": 47, "text": "Has alot of potential. Only problem is the editing. Either it's so quite you can't hear anything or its so loud your scrambling to find the remote. Not worth the hassle of adjusting the volume every 2 minutes."}, {"id": 48, "text": "This isn't really like jumpscare type of movie, it's more idk disturbing and overall macabre"}, {"id": 49, "text": "The production consists of two stories loosely connected by a third tale where two hitmen/debt collectors are looking for the title book. The first tale is about a dowdy Jenna (Britt Robertson0 who is off her medication. She doesn't like noise. She runs away from home and winds up at a B&amp;B run by a friendly couple, maybe too nice. In the second story, Simon (Rafi Gavron) convinces a professional skeptic he can talk to her dead son Miles.The stories had nice Clive Barker twists and endings. Well done on the slow build up.Guide: F-wprd, sex, Make butt nudity."}, {"id": 50, "text": "Based on Books of Blood by Clive Barker, this is an anthology series on Hulu and it's one of the better times I've had this holiday season.The pacing is good, it has good twists and turns, the lighting is great, there are some solid jump scares, and the end very satisfying."}, {"id": 51, "text": "I thought i was gonna watch some halloween special from hulu, but boy it turned out to be something interesting and deep. don't mess with death, guys."}, {"id": 52, "text": "I loved the movie very much. More than one but all of the interrelated stories were also very good."}, {"id": 53, "text": "Long stories heading nowhere and they are not scary. its a papercut not a serious scare. not worth your time."}, {"id": 54, "text": "If you suffer from Misophonia, as I do you may cringe a bit, whilst hitting the mute button early on in the movie, apart from that, it's watchable, but nothing to write home about."}, {"id": 55, "text": "I think I just wasted my precious time, so save your time people and pass this one, its so awful."}, {"id": 56, "text": "I found the film interesting but some of the characters are annoying. This is like Tales from the Crypt. As I watched each short stories I tried to figure out how they fit together.It is decent and the ending is ok. It is sort of how I thought it may end. My review is written with the same enthusiasm as this film!"}, {"id": 57, "text": "I've read The Books of Blood and I think this is much, much better than any other movies made from the content. Acting was good and the stories were interwoven in a clever way without making it dumb. Would definitely recommend to any Clive Barker fan."}, {"id": 58, "text": "I love it. Maybe it is not 10. But it is a good movie, I enjoyed it. Stories are well connected, the film is well made it."}, {"id": 59, "text": "I don't know why the name of Clive Barker is in there..."}, {"id": 60, "text": "It started out super strong with a great first story. The rest were just not entertaining and priory executed! Good movie though!"}, {"id": 61, "text": "I practically lost my mind with excitement when I stumbled upon the trailer for this film. As stated before, I'm a huge Clive Barker fanatic, and I've long waited for a proper film adaptation of his Books Of Blood series. However, it quickly came apparent to me why I had not heard buzz of this film before now. Simply put, this is because it's not really meant to be a feature film at all. Apparently, Barker and TV veteran Brannon Baga had planned an entire mini-series with Hulu, which probably would've been the best way to tell the many stories contained within the series. But, due to Covid, this series never came to fruition. So the three stories contained in this film were simply meshed together into one flick. This would be fine, expect for the absolutely baffling and infuriating realization that two of these three stories are not even remotely based on stories from the actual Books Of Blood, or anything else Barker has ever written. I can't for the life of me understand the reasoning behind this, and sadly, these stories bear no resemblance to anything Barker would pen.The middle story, the actual frame for the Books Of Blood series itself, is the only true Barker story here. It's the best one as well, although it's very short, most likely because it was intended to simply be the first episode. The other two stories are strange, nonsensical tales, the longest of which stars Britt Robertson, and truly makes not one lick of sense. The three stories intertwine in the end, but this one is always given the most attention, and it's entirely unwarranted, as the tale is weak, senseless and can't decide on a tone for it's life. So all together, this is a jumbled mess of a film, that is decently directed and certainly has it's moments. However, in the end, it's just another disappointment for Barker fans. This is two lackluster, forgettable adaptations of the Books Of Blood. At this rate, I'm afraid we'll never have the adaptation that dear Clive deserves."}, {"id": 62, "text": "Books of Blood Directed by Brannon Braga. Written by Brannon Braga and Adam SimonBooks of Blood are three short stories woven together into one film, anthology style. They come from the mind of Clive Barker. This is what drew me in naturally. I enjoy the good Clive Barker movies, you know the ones and I've read quite a few of his books. I dig it. I'm on board with this flick. I'm curious.Like all anthology films, not every story is at the same level. The story of Jenna is really interesting visually and creepy and the story of Miles is really good as well. Bennett is the weak link but it's also the shortest. I got into the stories themselves but the problem with them is that is they are drawn out.When you think Clive Barker, you usually think wild and imaginative gore and kinky driven sexual situations. Books of Blood is not that. It feels a bit flat in regards to the visuals with the exception of two sections. Once you find out what is happening in the B&amp;B and when the psychic meets the dead. These two moments bring out what modern filmmaking could accomplish with Clive Barker's work. The visuals have to be there. The mood has to be there. I would even wager that the dread needs to be there as well.There is only a small amount of that present in these stories. The movie drops you right down into the first story and gets you intrigued by this special book. You're wondering what in the world is going on. I was ready for the ride and the first story manages to continue that. It ratchets up the tension with some misdirection and some really solid acting from Britt Robertson. It is suitably weird and creepy.The second tale felt a little more familiar and it was the one that also felt shortened and could have benefitted immensely from some character development. It really lives for one moment. If you see this movie, then you will know the one I speak of. That moment makes the story worthwhile in my humble opinion.It's a very hit and miss movie. I did some digging on it and read that it was intended to be a series. It had that vibe. I could have been on board watching a Books of Blood series. But alas it was not to be. We have to settle for this movie. This kind of flat and bland adaptation is really not worth it. It drains all of the life of the stories but at the same time allows tiny bits of it back to infuriate you.I give this one a C."}, {"id": 63, "text": "A lifetime of horror movies and books, amongst other genres has probably made me somewhat cynical/jaded when it comes to wanting originality or even to be shocked, so I had some hopes for BoB. I did enjoy reading these stories so much, many years ago and found the 2009 version superior to this drivel, but it also has Anna Friel in it, so that's a death knell in itself.This offering is shot in TVMovierama and is so lacklustre in its presentation and execution that I lost interest 15 minutes into the first story, so by the time it was Friel's turn I'd started writing my review, because it's just dross but will see it through to the end, because I'd specifically set aside the time in the hope it was going to live up to my memories of Clive Barker and his great storytelling.I would have preferred a few more shorter tales that were interlinked, that'd certainly show more flair, but that's probably asking for too much. Then again sitting all through this was was a bit too much also, which is why I gave it 3/10 as that was more a slap on the back for my own personal endurance than anything else.Seeing the end credits explained in part why it was so crappy, Brannon Braga and Seth MacFarlane had their hands in this and Horror really isn't their bag, so should really leave this genre alone...for all of our sakes!"}, {"id": 64, "text": "If your in for gory horror, and sneeking ghosts and tales from the dead..i shall admit that 3% of the playtime, i saw out the window instead of the screen, should tell a bit about the powerbuildup of horror . considering that i'm a grumpy old man that grew up with beta 2000 and betamax and vhs video horror.they have made this story of three interconnected/vowen stories to scare the heck out of me, and with a helpfull hand of well made and effectfull choice of musical score, and an extremely knockout kickbox of sound effects, along with well made visual effects, combined with a valid location setup and production design. the only minus that draws it into a 9 stars are the playlength.so my codeword is ''retrospectiveness'', and if your fainthearted or do have a voulnerable psykie then stay away, if youre curious and want to like the ghostly ridden horror genre its a nice place to start. many reviewers will sack this film due to incoherence in the plot, but its not. so take my advice and have a look.its a recommend"}, {"id": 65, "text": "Avoid this one. I am a seasoned horror movie fan and have been watching horror movies for the last four decades. I have not only seen horror but diverse movies within this genre. Clive Barker's Hellraiser was based on his The Hellbound Heart novella and it was my second Clive Barker film which I saw in my adulthood. I watched all subsequent sequels of Hellraiser. I had watched Nightbreed earlier than Hellraiser.The reason for my late viewing of Hellraiser was that when I was in my pre-teens and went to the video library, my dad forbade me to rent it because of the gory graphic poster of Pinhead holding the puzzle box in his outstretched hands. So later when I was in my mid-twenties I got another chance to watch it and all of the sequels. I also saw Candyman and its subsequent sequels, Lord Of Illusions and Rawhead Rex along with Underworld. Then I saw the 2009 adaptation of Barker's Books Of Blood. THIS movie is better than the 2020 adaptation.I don't want to delve deep into the 2020 version but it is basically borrowing some themes from Barker's collection and patching them roughly in the form of a makeshift film. This is the WORST film I have ever seen and I was very disappointed. If you have seen all the above Clive Barker movies/adaptations, then give this 2020 version a skip."}, {"id": 66, "text": "Books of Blood is based on the works of UK writer Clive Barker.There' s a certain symmetry and maturity to the characters, that suggest's this film's screenplay is based on the work of a capable author. That said, as is often the case, a lot can get lost in translation, from book to screen.Having read two of Barkers books but not the works this film is based upon, I know his writing is often complex and intricate. You get the sense of the underlying work in this film but unsurprisingly, it feels incomplete.That's not to say this is a bad horror film. The characters are, for the most part, developed enough to offer moderate insight into their motivations. In addition, its intersecting tales have a tidy symmetry once the conclusion has been reachedPacing is decent, scares are more of the gruesome variety than the jump scare's you find in films like Friday 13th. There's also a lot of creativity on offer, that taps into and blends, familiar horror tropes.In summary, I'd say this is a reasonable watch. Yes it does feel like something is missing. That said, enough horror fundamentals are on offer, I feel, to satisfy most fans of the genre, like myself.6/10"}, {"id": 67, "text": "As I sat down to watch the 2020 movie Books of Blood I wasn't aware that it was a horror anthology. And as much as I love horror, there is a tendency of anthologies set within the horror genre of being somewhat less than mediocre.However, I must admit that Books of Blood was a much welcomed addition to the horror anthologies, because this was actually a rather enjoyable collection of stories that proved to be nicely interwoven with one another in a satisfactory manner.And I am astounded to find out that the stories told in Books of Blood apparently are based on Clive Barker writings. That is just very interesting and cool actually.The stories were quite different in their contents, so chances are high that you will find something suitable for your particular tastes and preferences. I enjoyed all three tales, however, I found the one with the bed &amp; breakfast to be the most enjoyable and interesting.The acting in the three stories was good, generally speaking for everyone involved. I was definitely content with the performances that were put on, and they had a good ensemble of casted actors and actresses to bring the various characters to life on the screen.I will say that Books of Blood is definitely a horror anthology that is well-worth taking the time to sit down and watch if you get the chance to do so. I was more than genuinely entertained by what writers Adam Simon and Brannon Braga managed to present with this anthology.My rating of Books of Blood is a six out of ten stars."}, {"id": 68, "text": "Supposedly, there are three stories. But it's hard to actually count them because of the strange way that Books of Blood is structured. We start in what looks like an interstitial, jump to an unrelated (and rather long) first story, jump to a second shorter story without spending any time on the apparent interstitial, then go back to the interstitial, make the most half-assed attempt possible to tie in the first story, discover that the interstitial wasn't an interstitial at all but is instead a short second chapter of the second story, and then return to the already over-long first story for its second chapter.I know. That's confusing. BoB really only has two stories in two parts each, and the structure screws with the pacing. It's better to know going into it. Anthology structures are arbitrary conventions, as is the convention to have a single act or three, never two. But those conventions help the viewer manage their expectations. BoB is experimental in this sense, but it's an experiment that, unfortunately, doesn't work out.Beyond that? This is typical direct-to-streaming horror fare. A little better than Sci-Fi channel schlock, a little worse than late night Cinemax. Much of the horror is old-trope body horror, eyes sewn shut kind of cliches that were tired even in the days of Alice in Chains. The second story isn't bad, but the first story dominates the running time and is not good.This is a horror movie, actual horror rather than just PG-13 pretend, and it's watchable, but there's not a lot that can be said in its favor past that. Exhausted all of your other horror options? In that case, BoB is forgettable, but it'll do for a popcorn night."}, {"id": 69, "text": "Trying to collect on a payment, a thug receives word of a special book that would pay off his clients' debts and sets off in search of it, where several of the fabled stories are told.The Good Stor(ies): None.The Bad Stor(ies): Jenna-Reeling over a past tragedy, a woman moves into her old home with her parents only for her nervous behavior to get on their nerves and threatening to have her kicked out. Fed up with their lifestyle and judgement, she heads out on her own but comes to find the people she chooses to stay with are harboring secrets of their own and can't be trusted. There isn't much to this one at first. The opening intro here gives us no clue about the girl or her problems, only that there is one and several casual throwaway lines don't help matters since nothing we get here makes any sense as to what problems she might have. The constant gags with the headphones drowning out the noise of the outside world do lead to some tense moments at times but even those are squandered on predictable jump-scares and white-noise static substituting for something else entirely. With no real scares involving her stay with the friendly couple she stays with resulting in a dreary pace that goes on way too long without much of anything happening, by the time it does the interest is gone and it just feels too little too late.Miles-Trying to move on with her life, a scientist comes across a man who claims to have supernatural powers enabling him to talk to the dead and allow her to talk with her dead son. After thinking he's the real deal, a revelation comes to pass that enables her to turn the table on him once and for all. This effort was absolutely dreadful and had very little to like about it. What that is constitutes the idea of her son coming back into her life through the mysterious stranger and his powers, which is a dark idea in concept but is so mishandled here that it doesn't really register at all. Their borderline incestual relationship comes out of nowhere and has very little build-up which makes it quite unnatural, while the lethargic pacing makes the scenes of her lecturing and studies about his condition just unbearably bland. The revelations made here cause all interest and care to drop out of this making the final outcome just come across as expected rather than cathartic, rendering this one just plain dull and nearly unwatchable.Bennett-Learning about the location of a fabled book, a man and his friend set out to the site of its owner. When he arrives and learns of its true purpose of existence, he realizes too late that his fate has been sealed and he's doomed himself into a different path than he expected. There's almost nothing to this one. The attempt to bridge all the stories is tedious and painfully inept, there's no suspense or scares at all and the cheesy gore effects are lame. Overall, the end result is just a pointless exercise that should've never been filmed with how badly and unusable this entry is.Rated Unrated/R: Graphic Language, Graphic Violence and Male Rear Nudity."}], "reviews_amount": 70}