{"name": "Indoo Ki Jawani", "titleId": "tt11112526", "reviews": [{"id": 0, "text": "Lame dialogues. Bad storyline. Mediocre acting. Too predictable."}, {"id": 1, "text": "Fully disappointed no story line, wrost screenplay, acting going to another level means acting is average...."}, {"id": 2, "text": "Worst storyline which don't make any sense and very bad acting"}, {"id": 3, "text": "Nothing to write about this movie. Everyone is overacting in this movie."}, {"id": 4, "text": "One of the worst movie of the year. I am just wondering how producers get courage to make such movies. If any one want to take revenge advice the to watch the movie"}, {"id": 5, "text": "When I saw the trailer I actually was looking forward to the movie but literally 10 minutes into it I understood that any/all watchable parts of the film have been stuffed into the trailer and there is nothing...literally nothing else humorous in this boring and farcical film...avoid it like the corona ..with a mask if needed !!!"}, {"id": 6, "text": "This movie is a combination of bad acting, bad script. Simply put, it's a pile of decayed garbage."}, {"id": 7, "text": "Now a days bollywood become abusing females the title itself indicate how cheap the movie and decorating pakistani agent a innocent this the hypocrasy of bollywood therfore we called it is isi or dawoodwood. movie full of nonsense things promoting lovejihad"}, {"id": 8, "text": "So the girl is a desperate hindustani ladki looking for sex while the guy is a kind hearted allah sent pakistani who is being targeted for his nationality and faith! Predictable story line as it preaches to love thy neighbor even if he is hell bent on destroying you through thousand cuts. No novelty in the story line@ boring to the T. Difficult to survive the entire length of this movie."}, {"id": 9, "text": "I also have friends, but we don't always discuss about sex. Mallika Dua and Kiara Advani's half scenes are all about discussion of sex. Story is average, a better comedy would have helped it but nonsense comedy is what you all will see. Kiara Advani has done a lot of overacting. Why Aditya Seal chose such a disastrous film? Can Bollywood only give such disastrous roles to newcomers ?My recommendation: Please stay safe at home and save money and don't watch it in theatres, not even on Telegram as it will only waste your time."}, {"id": 10, "text": "A good message with brilliant acting from Kiara. Good fun watch with nice humor."}, {"id": 11, "text": "Do not waste 3.5 hours of your time on this mindless waste of cinema."}, {"id": 12, "text": "Worst movie of the year. Don't waste your time. Sleeping is better than watching this movie. Worthless and meaningless concept. No comedy, no romance, only bakwaas 👎👎👎"}, {"id": 13, "text": "Kiara has done great work in this movie. Every one should once watch this movie."}, {"id": 14, "text": "Save ur time for other important things, kiara advani is specifically irritating and annoying."}, {"id": 15, "text": "This is an intresting movie with awesome thrilling scenes it makes us to see the full movie. It is the best movie that i have seen"}, {"id": 16, "text": "Seems interesting and comedy centric adventures movie"}, {"id": 17, "text": "The movie is like more deadly pandemic than covid19. If you want to survive, please maintain the distance from this propakistani movie as much as you can.. just an another attempt of bollywood to malign Indian and vocal for pakistanis.. these bollywood pigs never realized that what kind of anti social activities they are doing by making these kind of films.. totally time waste.. regretting my decision to watch this in theatre.. thanks God for I am still alive.."}, {"id": 18, "text": "Awesome movie it is very interesting to watch i suggest u this movie. Fantastic movie 🍿🍿🍿🍿"}, {"id": 19, "text": "Kachra type of movie...After watching this movie I started having headache and weaknesh...just disgusting...There should be option to get back my money...I wasted my llife,time and money..."}, {"id": 20, "text": "Good message movie. Happy ending. Really enjoyed the movie"}, {"id": 21, "text": "Please do not waste your time on this movie. No story no concept. Jokes do not even make you laugh at all! Dialogues are even worse! Why was this project green lit? Acting even worse.."}, {"id": 22, "text": "Worst film I have ever seen please don't waste your money and on this film please.."}, {"id": 23, "text": "Indoo Gupta is a hot chick. All uncles / boys residing in her locality perennially lust after her. On her friend's suggestion, she invites a man home for a one-night stand but is shocked to discover that he has a Pakistani passport. So who exactly is this man? Whats he doing in our country? Is he a terrorist? #IndooKiJawani started off well and I hoped to get entertained. Regrettably this never happened. Kiara n Aditya are decent performers but the direction is puerile. Running time needs to be reduced by 20 minutes. Rating 1.5/5."}, {"id": 24, "text": "Avoid watching this waste of time. Bollywood is gutter. #Justice"}, {"id": 25, "text": "Worst movie plz dont waste your money bollywood again hurt our sentiments"}, {"id": 26, "text": "One of the most horrible movies ever.... avoid if you can"}, {"id": 27, "text": "Listed among the worst movies of 2020...!!! Overrated actress Kiara and boring story...waste of money and time..."}, {"id": 28, "text": "According to this movie Pak is the best country and Hindu males are worst. Communal anti India propaganda"}, {"id": 29, "text": "Worst movie in 2020. Boycott Bollywood. This is no brain movie."}, {"id": 30, "text": "Ms. Advani can't act that's for sure. C grade cast who got nothing much to offer. Certain telewood old actors were wasted."}, {"id": 31, "text": "Bollywood is a sinking ship without creativity. vulgarity on the name of creativity. why praising pakistan while there were so many other nations. boring, jokes dont make u laugh."}, {"id": 32, "text": "Pathetic meaningless cheap movie.Kiara is little bit overrated I think.She should only act kabir singh type movie which she hasn't so much dialogue."}, {"id": 33, "text": "A very good comedy drama movie with different concept. Set in Ghaziabad, the movie revolves around Indoo and her social life, which later turn out to a chaos. well directed, good photography, soothing music makes it a good watch. Kiara enacts girl next door pretty well."}, {"id": 34, "text": "It's funny how Kiara thinks, she's the best actress on earth just because her previous films were blockbuster 😄. Kiara should be welcomed to Ananya Academy of Over acting ka dukhaan."}, {"id": 35, "text": "I will say one thing for this movie what the hell is this? This movie is promoting 'love jihad' and showing Pakistani people in good image. Absolutely unapriciated and worst acting. Script and plot is also dull totally. This movie is good for nothing. The last word for this movie go to hell for stupid acting and worst script."}, {"id": 36, "text": "By far the most horrible movie i have ever seen, mediocre acting and strory. Please save some time by not watching this mess"}, {"id": 37, "text": "Interested to know ...What the makers of this garbage were smoking ."}, {"id": 38, "text": "If she continued with even one such movie, then I'm sure she'll be one of flop actresses of bollywood who blew their carrier by their worst movie choices."}, {"id": 39, "text": "For god sake stop this fake love for Pakistan &amp; showing India in bad light"}, {"id": 40, "text": "Very unintelligent content, bad acting, tasteless and inappropriate jokes. As per this movie young men and women are only looking for physical intimacy all the time and they have no other work to do in life. While movie attempts to break certain stereotypes, it actually creates and promotes some other stereotypes which is more dangerous. All in all a very bad movie."}, {"id": 41, "text": "Waste of time and money. Don't know why such idiotic movie is created and why Kiara has accepted such idiotic script!!!"}, {"id": 42, "text": "IF U WANT TO WATCH SOFT P0RN Then THIS MOVIE IS FOR YOU ."}, {"id": 43, "text": "Bad acting, senseless story and cringe worthy scenes."}, {"id": 44, "text": "A classic example of why bollywood has retired into its comfort cacoon shell. It doesn't want innovation, nor ideas but stick itself to the same idea of misogyny, portraying Indians as bad, an over obsession with Pakistani and their so called righteousness that its almost laughable now, but it still passes off through the filter of Bollywood industry. The over use of sex discussion between Kiara and others make us think, how much deprived of sex and romance are we as collective indian that it always has been placed in our entertainment industry for more than 40 years. And that too, when we are a country of more than 1.3 billion people. Even after ignoring all the erotic and hogwashing elements, the movie still falls flat on the surface due to lack of story, unfunny and totally cringy jokes, and no actual plot whatsoever. The only suggestion I can give to bollywood is: If you have so much money to waste on, then why not donate it instead, so that atleast it can be put to a good use."}, {"id": 45, "text": "Sorry I can't find anything worse 😔😂 Pathetic film. Wish there was a refund option."}, {"id": 46, "text": "I waste my money to watch a nonsense film this movie has no comedy no nothing I request you all don't waste your money to watch it"}, {"id": 47, "text": "Mast movie . I love aditya he is so cute and malika dua she is a bomb"}], "reviews_amount": 48}