{"name": "A Werewolf in England", "titleId": "tt11924476", "reviews": [{"id": 0, "text": "Had good hopes for this movie when i saw the stills and premise for it, but the acting is below avarage and the werewolfs themself move like they are constantly trying to swat off flies.. although its a low budget movie i was very dissapointed in the lack of movement in the heads.. very easy to see its just a helmet without any mouth movements at all :("}, {"id": 1, "text": "The people that gave this movie a good review are actually part of the production. No one in their right mind would endorse this movie. dont watch it"}, {"id": 2, "text": "I think it's a waste of money to create a movie with amateur actors. Even their special effects are no near as good as the old movie back in 1981 with An American Werewolf in London. If you enjoy the blood and glory stuffs no matter how bad they can act, it may be for you."}, {"id": 3, "text": "Save your time and money! One of the worse films I've ever seen. My 3 year old could act better than anyone in this god awful film."}, {"id": 4, "text": "Ive seen lots of werewolf films over years ill say this is in the worst list the film series The Howling was better than this"}, {"id": 5, "text": "This writing is terrible. The acting is abysmal. I can't believe I wasted my time and money on this. Here's a lesson for everyone involved, don't do horror, actually get a credible script writer involved. And get enough funding to get some credible actors, Jane was particularly bad."}, {"id": 6, "text": "I had high hopes for this, and although they weren't dashed they did get tested. First off the werewolves, they could have been decently menacing if they hadn't fallen into the old trap of aimlessly pawing fresh air pretending to be vicious animals, my cat waits, paws you and draws blood instantly, she doesn't wave her arms around like she's backing a truck into a side street, and yes, although looking the part the werewolves are in fact crap. Not as crap as some creatures I have watched recently, and given this film leans heavily in the comedy direction that can be forgiven. Speaking of the comedy element there are some truly laugh out loud moments, albeit with a few lifted straight from other films but who cares, funny is funny. All in all I liked this, there are holes to be picked and it gets a bit farcical at times but there's love and effort been poured into it and it shows, give it a go one dark night."}, {"id": 7, "text": "Let's get one thing straight - to any reviews complaining about this movie's effects or writing, you're missing the point!Director Charlie Steeds and the folks at Dark Temple Films have created a proper old-school monster movie that (for genre fans like me) was a blast from start to finish. It's obviously been made with love. Plenty of nods to classic werwolf pics, and horror in general. Brilliant music, great to see homemade sfx, and some nice performances.Another awesome addition to the Dark Temple collection; what's next, Mr Steeds?"}, {"id": 8, "text": "Total rubbish....it was a comedy horror....not mentioned on the Dvd...i would never have bought otherwise.....not even funny, just stupid...stick to dog soldiers...."}, {"id": 9, "text": "If movies like the Evil Dead series and The Fearless Vampire Killers are your cup of tea then you need to see this film. I'm personally glad t see films like this are still being made in the 21st century. It is a clever mixture of slapstick humor and practical effects and acting so serious that it is hilarious. The werewolf costumes are top-notch (on par with The Howling series) but won't scare anyone over the age of five. That, too, may be deliberate-the werewolves look ridiculous because the idea of werewolves is, in and of itself, ridiculous-but I could be overthinking and giving the production crew too much credit. The acting is silly, like a highschool play. Overall the film feels very theatrical. It's fun, it's silly (maybe a little TOO silly in parts) and it's not for everyone."}, {"id": 10, "text": "No words can describe it , if you got a lot of time and you couldn't find anything else to do , I'd highly recommend not to watch it"}, {"id": 11, "text": "Rubbish werewolf film from beginning to end.the money could have been put to much better use than making this garbage."}, {"id": 12, "text": "I love a werewolf movie and have seen my share of bad werewolves over the years but this film takes the prize. The werewolves alone are laughable enough, inexplicably both mincing about and moving as if there were walking on a bouncy castle. However, the production values are also abysmal with most of the cast appearing to be wearing fancy dress costumes, wobbly sets, absurd acting, in fact there is very little to commend this film. It has moments of intentional comedy but mostly it's just very, very poor."}, {"id": 13, "text": "Micro budget British tongue-in-cheek werewolf horror with a retro vibe from Dark Temple Motion Pictures.A Parish Councillor escorts a murderer (who killed a man he claimed was a creature) and seeks refuge at a country Inn and before you know if they're under threat from the psychopathic Inn Keepers making an offering to the local werewolves on a Blood moon.Clearly the production values were restricted by the budget but the script is really witty, the film score on point and the actors all do a great job."}, {"id": 14, "text": "Don't waste your time. This movie was brutal. I don't usually do reviews but the fact this had a 6 is outrageous."}, {"id": 15, "text": "I know that the title I used is a bit worn out. Don't waste your time, I will never get this time I wasted back etc. But it is true. Sometimes you feel like a total idiot watching this sort of crap and try to give it some merit. No merit whatsoever. No acting, no script, no special effects besides hundreds of candles which somebody must have had a full time job keeping them alight. This movie, for lack of a better word, failed not because of a low budget,l but a complete lack of talent. If this is the highlight of the creativity the makers of this rubbish can come up with they better look for another occupation. Maybe get a job in a fast food chain."}, {"id": 16, "text": "Deliberately campy, but without redeeming qualities whatsoever. Mesmerizing like a train wreck. This film was written and directed by the mind of a 13 year old.There's no tribute to past werewolf films, as I've read in another review. There's no salvation from comedy or parody as in the original Evil Dead, as I also read.I waited and watched, to no avail. Put a silver bullet in it already.Here's a spoiler alert for you, werewolf diarrhea. 'Nuff said."}, {"id": 17, "text": "I'm a real fan of werewolf movies but have been so disappointed by recent rubbish CGI attempts, in which you hardly see the monster.This film pleasantly surprised me and the live action werewolves were terrific. It's corny at times but also has some great gory effects.Not sure what some of the negative reviewers on this thread were expecting as this had an old school hammer horror feel from the beginning. If I had one criticism it would be that I'm not really a fan of comedy horror but it's definitely worth a watch."}, {"id": 18, "text": "Very funny and never a dull moment. The werewolves weren't bad either. Just good old British entertainment from beginning to end."}, {"id": 19, "text": "This movie is in the style of old Hammer House of Horror movies that were so popular in the 70's and preceding decades. It's funny, bloody and downright disgusting at times! (Poop, blood and farts abound) No special effects as such but if it's a blood soaked comedy you're after, this movie is for you!"}, {"id": 20, "text": "I get the point. This is a homage to poor hammer movies . Hammer had a charm and were efficient and professional. This is trying to hard to be rubbish.Worst acting ever....crap monster and zero tension."}, {"id": 21, "text": "I thought this film was really funny, I literally belly laughed, I also squirmed in the gory bits too. There's no point comparing it to the classics. I thought the actors portrayed their characters really well. Bearing in mind this film is a low budget film I think the director &amp; crew etc have pulled it off really well, I think it makes it funnier and entertaining to watch. I recommend watching the out takes and listen to the Directors commentary before making your own judgement, I was really quite fascinated by the whole tale of events. If this is what's achieved on a low budget I can't wait to see what they can do on a big budget. I'm now going to watch the other films by this talented Director."}, {"id": 22, "text": "Worst movie ever. I'm cross I actually paid £5 to rent this. It was like a student produced this with their friends in a garage. And his gran did the special effects. Please stop making movies."}, {"id": 23, "text": "Not a horror. Not a comedy. This movie is a total joke. Bad acting, bad costumes, ridiculous werewolves."}, {"id": 24, "text": "As a big fan of old horror movies this is such a retro throwback in the best way. Crazy characters, nonstop action, buckets of blood and gore - everyone looks like they're having a great time, and so did I watching it! It's amazing what Charlie Steeds does with small budgets. Glad to have this in my collection!"}, {"id": 25, "text": "I didn't watch the previews, but I saw it added to the app I watch movies on and the poster looked cool, so I decided to watch it. I don't know why, but I was kinda expecting more from it. Its very B. Corny, kinda funny and kinda stupid. It definitely wasn't the worst movie I've ever seen by any stretch, though. A lot of other werewolf comedy-horror films are sorta heavy on gore, but this movie isn't. That was part of the reason it was just kinda meh for me. It's very mild in that department. From the start I was thinking it was kinda stupid, but not stupid enough to stop watching. You might have the same feelings if you flip it on, where its not the best but you still wanna see it through. I'm on a middle ground with it. I wouldn't say not to watch it, but if you don't, you're not missing out on a real must see movie. That sounds kinda mean to the directors and I'm not trying to be, but its just my personal criticism."}, {"id": 26, "text": "When this movie began I thought I was really going to like it, as a comedy, not a horror film. It's billed as horror but it's not. There were lines delivered by the 2 leads that were LOL funny. The problem is it very quickly lost momentum and dissolved into slapstick that was too repetitive to work. Once the characters stopped talking and the supposed action took place, the movie stopped working, it wasn't in any way horror, or scary or suspenseful. It reminded me of a dinner theatre production, you might laugh a few times, chuckle a little but it's just too amateurish to work. The budget was obviously low which is a shame because the cast played their parts well, Tim Cartwright was excellent and Reece Connolly was extremely appealing. The movie is slightly charming with the effort that seems to have been made, it just needed more of the excellent writing that opened the picture. If you are expecting any type of Werewolf horror, this is not it, but if you feel like seeing a slight British farce about bumbling fools fighting off werewolves, this is cute."}, {"id": 27, "text": "A Werewolf in England Its upbeat and funny, but also dark and deeply unsettling and so scary. The transformation sequences are impressive and will absolutely make your skin crawl with fear.T his is so far the best werewolf movie ever made!!!Also beware of the moon. i hope it comes out on blu ray/4k."}, {"id": 28, "text": "There is nothing about this that is good, the script, the acting, the directing all bad but the film is much better than the sum of its parts!!! Even the werewolves who look like something from early 70s Doctor Who help tie this together"}, {"id": 29, "text": "Worth the money spent laughing at how bad it was so can't fully complain"}, {"id": 30, "text": "We enjoyed this a lot even though the name and dvd cover are very misleading. There's more than one werewolf, and it's set entirely in a spooky old hotel! Still was a fun popcorn movie with lots of funny bits, slapstick moments, lots of blood guts and other yucky stuff. Reminded my partner of Braindead. I thought Carry On Screaming! Definitely worth a watch."}, {"id": 31, "text": "First off I have nothing to do with this production team. I genuinely loved this one. For an indie film this was really good. Dont judge on the Hollywood films and take time to look at the scale of cast and crew. It is small scale which makes this even more impressive. I felt they captured the style of a good British hammer horror well. It is all about the writing and acting and not all about the cgi which is a plus. I enjoyed watching this. The setting was very atmospheric and the set dressing was well done. There was a good level of humour which was maintained throughout. I was really impressed with the music not too intrusive and it really enhanced the scenes. The actors did a great job. The script, pacing and humour were a success. The werewolves although not top notch did fit in with the feel of the overall look of the film. I personally loved the wolves. I recommend this one."}, {"id": 32, "text": "This movie doesn't. Not sure why it's classed as horror only, definitely a comedy with horror elements. So much more could have been done with the comedy, but the movie is very watchable. However, some parts just fell a little flat and didn't seem to gel with the earlier part of the movie. Good effort by all."}, {"id": 33, "text": "Great entertainment, ticks all the right boxes, not to be taken too seriously, it's hard for independent film makers to create high production and special effects on minuscule budgets but this film doesn't need them! Looking forward to a sequel, let's hope Charlie Steeds doesn't disappoint us!"}, {"id": 34, "text": "Really fun, gross out horror comedy with impressive werewolf costumes. You can tell it's low-budget, but that's part of it. Feels like a straight-to-video b-movie from the 60s / 70s, full of blood, sex, and sound effects. Very different to some of this director's other stuff (saw the barge people over lockdown and checked out Winterskin a few nights ago). Give it a go if you like your horror homegrown and schlocky!"}, {"id": 35, "text": "People hoping for a high budget werewolf film that is serious in tone will be disappointed with this, but if you're looking for some gory horror comedy with wacky characters, daft dialogue and silly werewolves shenanigans, then this is a laugh riot. Barely a dull minute. Very entertaining"}, {"id": 36, "text": "Kind of had everything I want from a werewolf film, made me laugh and some good kills. No Hollywood blockbuster obviously ha ha"}, {"id": 37, "text": "Having read the reviews, I felt compelled to write one. Unfortunately, I do think the cast and crew have been writing the reviews (the good ones) because ultimately, there is no way this film could be given a 7/8/9/10 out of 10. It's just too poor. I feel for all the people involved that spent a lot of time and effort on it, although judging by the quality, I'm not sure there was much of either of those things put in to this film. The VFX are bad, I mean really bad. You can tell there was no budget for this. The concept isn't original, it's just a copy, which is my people are comparing it to the 'classics' if you want to do something that's on a shoe string budget at least nail the concept, make it original. There's plenty of great low budget horrors that have been made that are great. Money shouldn't be your limitation. To the actors involved, really consider what's being offered to you, don't just take anything, maybe look at this directors history, everything being reviewed as 2/3/4 out of 10? Maybe give it a miss. This film won't have done you any favours, I appreciate it must be a hard industry, but let's face it you aren't going to be adding this one to your showreel. Saying no and doing nothing is sometimes better than doing something badly."}, {"id": 38, "text": "Well, the movie was branded as the best werewolf movie in years, and I must admit that I was definitely intrigued and had some hopes for this movie when I sat down to watch it. But the best werewolf movie in years, nah, not so much.A Werewolf in England was watchable, for sure, but this was hardly an outstanding werewolf movie, much less the best in years. The movie was adequately entertaining, but I must admit that I sat with a 'was that really it' sensation as the movie came to an end.The storyline in the movie was fairly okay. Sure, it was straight forward and offering no surprises or plot twists at all, so it was a bit on the generic side, and you knew exactly what would happened long before it happened, so writer and director Charlie Steeds wasn't exactly going out all the way here, but instead playing it way too safe.As for the acting in the movie, well I will say that the actors and actresses performed well enough, given the limitations imposed upon them with the script and the very bland and often pointless characters they had to work with. Yeah, many of the characters were just so mundane that you didn't even remember their names, much less cared a bit about their fate and what not.The effects in A Werewolf in England were adequate, and the werewolf costumes were definitely nice to look at, but the gait that they walked with was just unbearable to look at, and it just made it all the more comical to look at that it added to the thrill or excitement.All in all, A Werewolf in England is a watchable movie, but just don't get your hopes up for it, because this was very bland and mediocre movie. I am rating it a five out of ten stars. This was by no means a particularly outstanding or memorable werewolf movie, nor was it a movie that I fancy sitting down to watch a second time, as it just didn't have the contents to support a second viewing."}, {"id": 39, "text": "Horrace Raycraft is an unpleasant man, and Cartwright's performance makes it more so, but somehow it ends up working to the movie's overall benefit.The character is snappish and unsympathetic, but he also pops off the screen far more than most horror heroes of the '30s, and after so many years of sad, mopey sorts being terrified of fighting these legendary beasts, it's bracing to encounter a character so direct and intelligent about dealing with this hideous wolfen-curse on the countryside.The film makes a point of clarifying that werewolves instinctively desire to destroy what they love most in human life, but there's enough meanness that there's a little tension underlying the savagery. And that, in turn, deepens the character arc throughout the slender but impressively dense 84-minute feature: the film tracks Raycrafts commitment to beating this smug, nasty pack of Werewolves while taming the animal within.The Hogwoods made for a very dastardly duo indeed, adding a lot to the general vibe."}, {"id": 40, "text": "By the second half I was literally on fire - AND asleep and lucidly dreaming in hell.I have been trying to gain entry to dante's inferno for some time ,and this film took me a good step closer.This covid lockdown nightmare is a walk in the park compared to this.I speak on good authority as a massive fan of an american movie (yet I am from walsall uk) and anything with ozzy osbourne in it.last time I signed into imdb was to commend 'Ratcatcher' by Lynne Ramsay when she was in hospital bless her and she replied to inform me from her bed that the music during the rats on the moon scene is indeed carl orff.I reckon 'A werewolf in England' is a classic - and heads up to the composer Simone Cilio.Tim Cartwright steals the show in this for me - what delivery! what absolute convincingly slapstick balls - he made it for me - I would have been quite happy to watch an entire 3 hours of him in a Ken Russell and hats off to the director Charlie Steeds for creating that feel from the start with a hammer horror edge to it.Good work guys!! I'm off women at the moment,being a repressed composer in the midst of a reconstruction of some kind of real life depiction of a hieronymus bosch version of heaven and hell but they were all beautiful and fantastic.Thank you! couldn't have released it at a better time either,darkest england - in the autumn - with bell book and candle.I say - the brits rock and every rock should roll!"}, {"id": 41, "text": "This was a chance purchase in a supermarket: the cover art evokes An American Werewolf in London and quotes Dog Soldiers, but the film resembles neither. From the opening scene, in which the horses refuse to go on because of an approaching storm and the parish councillor, prisoner and coachman are forced to seek shelter in a lonely inn (what could possibly go wrong?), the plot, or lack thereof, is reassuringly Hammeresque.The budget was obviously tiny and the cast are unknowns (well, unknown to me), but this is a film made with love that does not take itself too seriously. Tim Cartwright as the Councillor clearly has stage experience and his determined performance carries the film. The splendidly named Barrington de la Roche deserves a special mention for an over the top turn as a sinister inkeeper, who resembles a kind of demented Alan Rickman. The younger female cast are all easy on the eye, and I particularly liked Jessica Alonso's feisty Minnie.The werewolf costumes are ridiculous, but all film werewolves looked silly (apart from the understated 1935 Werewolf of London) until The Company of Wolves came along, and even that was constrained by its budget. The sets are cheap, the costumes haphazard, evoking no particular era (the councillor looks like he's on the way to Whitby Goth weekend), and the whole effect is as if the local amateur dramatic society filmed a performance of Grand Guignol. They had fun, I had fun, and the gore was not realistic enough to be unpleasant. By the end, I actually cared about some of the characters, which puts this film above most generic modern horror movies involving screaming teens.I was sufficiently entertained to order another Charlie Steeds film, and hope for more from Dark Temple. Sadly, I have no connection with anyone involved in making the picture."}], "reviews_amount": 42}