{"name": "Atkan Chatkan", "titleId": "tt12969078", "reviews": [{"id": 0, "text": "This movie is must watch movie, music and direction is awesome. Movie has perfect message to give Live your dream. Very Inspirational story.Verdict Must watch"}, {"id": 1, "text": "Very good story so beautifully picterized music so good very nice movie to see with family and also inspiring story"}, {"id": 2, "text": "This movie deserve Oscar , better than slumdog millionaire"}, {"id": 3, "text": "Congratulations to Shivhare for making a movie with kids and making his own story come live."}, {"id": 4, "text": "Must watch movie, the performance was outstanding."}, {"id": 5, "text": "Congratulations Atakn chatakn team. You all did very well. I saw this movie 2 times and I really want to see it another time.. thank you director sir for this wonderful movie."}, {"id": 6, "text": "I'm obliged to Vishakhaji and Soumyaji. Its not that my daughter Aayesha(Lata) is there but its a best implementation of story in kids hearts and so as in film and knowledge of attraction points at all steps of shoot, tend all kids to give best which was required for film, situations and songs. I loved a lot and request all to see this movie and give best reviews what you feel about it to support these kids to grow ahead. God bless all attached with Atkan Chatkan. Dreamit..Liveit.."}, {"id": 7, "text": "I really appreciate the screenplay. After a long time there has been a movie that you can see with family."}, {"id": 8, "text": "After a long time we watched a good film. Best wishes to all Including Director, writer, producer, They introduced us to a good cinema...."}, {"id": 9, "text": "If music makes your soul happy, Atkan Chatkan cannot be missed. It's a heartfelt ode to friendship and resounding belief in our dreams.Direction &amp; Cinematography 👌🏻👌🏻👌🏻👌🏻👌🏻"}, {"id": 10, "text": "Among lots of depressing dark content's suffocation on OTT platform these days, here is Fresh Air with Inspiring story and Musical treat to Ear... And performances of all the Child Artists are Marvelous..It needs courage to make such a film.Kudos to Director and Producer."}, {"id": 11, "text": "Superb &amp; must watch movie, Inspiring for kids, story line is very clear, written by director, all the cast done well done job specially kids, Will really inspire your kids Must watch👍"}, {"id": 12, "text": "Congratulations to director Shiv Hare for giving such an inspirational story. The best thing is that Guddu chose to work rather than beg and he inspired his friends also to work. Excellent direction waiting for some more inspirational projects from you."}, {"id": 13, "text": "Amazing and Fabulous nice can't express in some Words .Thank You"}, {"id": 14, "text": "Worth watching. Movie is very sweet . Directions could be more good. Still best ott release in recent times."}, {"id": 15, "text": "Just simply superb.. excellent story , screenplay &amp; out of the box music."}, {"id": 16, "text": "A perfect Inspirational tale of 5 kids achieving so many things without having proper resources....Music By Sivamani ji Makes the music Vast And Beautiful ....a must watch Movie"}, {"id": 17, "text": "The story of Guddu and his friends chuttan, madhave and the gang of street musicians is an inspiring tale of music, friendship and determination, the music by drums shivamani is soothing and it takes you back to your childhood."}, {"id": 18, "text": "This is a super awesome movie, with a descent message.. I believe its an Oscar Material.Had there been one super star the movie could have HIT the Box office like Taare Zameen Par ."}, {"id": 19, "text": "The situation at home and if you want to learn, you can learn is well shown in this film"}, {"id": 20, "text": "Films that give some good points and teachings to children"}, {"id": 21, "text": "The first time I saw such a movie, I am very happy with the sound of the instrument..and like acting vishu"}, {"id": 22, "text": "This movie made me truly cry..this is the real raw film.society need this type of film .....great job🙏🙏🙏🙏"}, {"id": 23, "text": "A Very beautiful clean &amp; clear musical movie with a good plot n direction, acted very well by every characters. AR's music 🎶 was mesmerizing"}, {"id": 24, "text": "Beautifully directed inspirational movie. Good acting kids."}, {"id": 25, "text": "What a movie,awesome, inspirational. Shiv Hare Sir,you did well... awesome. Great Work Sir,Hats off...Now I am waiting for your next movie"}, {"id": 26, "text": "So exciting movie for kids .. we all enjoyed watching. It's a must watch film"}, {"id": 27, "text": "All characters are very good. Superb movie and superb work done by whole team."}, {"id": 28, "text": "It is a beautiful movie very inspirational and to enjoy with the family with a cast of wonderful actors."}, {"id": 29, "text": "Never seen such a lovely and honest film...Everything is so simply perfect ...It strikes a chord beautifully ..Wonderful portrayal of childhood emotions. Great story ...Superb direction ...Amazing music and wonderful cast makes it a must watch family film. 10 out of 10"}, {"id": 30, "text": "Life never has been a bed of roses but with hope and courage, one can overcome all the difficulties in one's life. That's why it is said, 'hope is the only thing stronger than fear.' 'Atkan Chatkan' establishes this principle strongly and positively. Moreover, this film keep alive the hope for good cinema too. Kudos to Shiv Hare and the team. !"}, {"id": 31, "text": "Appealing story line which make us believe that dreams come true irrespective of struggle and lack of opportunities. If we believe in our self then anything can be possible."}, {"id": 32, "text": "Great story!! A must see movie especially in these hard times."}, {"id": 33, "text": "NORTH To SOUTH....I really love this movie. Excellent story and cast.All the very best for all of u."}, {"id": 34, "text": "The Story of Atkan Chatkan movie is very interesting and admirable. Work of all the child actors is very praiseworthy . The passion of all of them towards their work can be seen easily at every second of the movie. A Meritorious work of art"}, {"id": 35, "text": "This movie deserves to be watched only bcoz of the amazing acting skill put forward by the kid casts. Music is also absolutely fantastic after all AR Rahman's magical touch exist. Direction could have been improved. Movie is stretched beyond 2 hours unnecessarily. It would have been better if it was like 90 minutes long. But it's still decent and outperforming if compared to scum directed by Karan Johar."}, {"id": 36, "text": "A nice storytelling with a subtle message exubering immense positivity."}, {"id": 37, "text": "Watched such a fantastic movie after long time. Good story."}, {"id": 38, "text": "Amazing to watch such a master piece. Loved everyone's performance. Very organic story."}, {"id": 39, "text": "Such a beautiful movie cudnt skip a single part....Its a must watch but yeah sit with a tissue paper you will definitely cry with joy ❤❤"}, {"id": 40, "text": "Heart touching story.. I saw this movie with my family and friends and I must say it's a wonderful movie.."}, {"id": 41, "text": "Awesome. Must watch. Everyone should go for this. An interesting film."}, {"id": 42, "text": "What a masterpiece. Outstanding music.Hats off to Director Shivhare for great direction. Legendary Amitabh Bachchan sir given his voice for such a beautiful song Daata Shakti De. Whatelse we need. Thumps up."}, {"id": 43, "text": "Should definitely watch great direction and the picturization of movie is nice."}, {"id": 44, "text": "A must watch, story of talent getting its right place despite all odds."}, {"id": 45, "text": "Good to see the real emotions. Good to watch. Best movie"}, {"id": 46, "text": "Such movies are made once in a decade .what an entertainer it is, with great performances!! Direction,cinematography, story &amp; screenplay par excellence.Hats off to director #iamshivhare &amp; team. Great work #atkanchatkanteam"}, {"id": 47, "text": "That boy is world's best competition winner lydian nadhaswaram. Nice musical journey."}, {"id": 48, "text": "You can be whoever you want to be. This film teaches this. Dream and be excited to achieve it. One day those dreams will definitely come true."}, {"id": 49, "text": "The movie revolves are aspirations, dreams of this beautiful bunch of talented kids. A completely musical story worth watching."}, {"id": 50, "text": "This is my first review for any kind of movies. So you can watching this. Thank you team Atkan Chatkan  ❤❤❤"}, {"id": 51, "text": "Very beautiful movie 100% recommended...beautiful cast ..beautiful story and beautiful movie"}, {"id": 52, "text": "The concept and storyline is quite relatable to most of us. It shows the journey and struggle of those who try to do something different from rest of the world. Must watch this movie!!"}, {"id": 53, "text": "Excellent movie and music , story line is fabulous ..especially kids enjoyed it ..."}, {"id": 54, "text": "Incredible story and music , our hearty congratulations to entire team...."}, {"id": 55, "text": "Hello everyone I came across this incredible story that I would like to tell you all. It is a story of a little boy named Guddu, as little as you &amp; me... he had little hands &amp; little feet but had big challenges to face. But hey that was no problem... you know why he had a big big heart &amp; a fabulous musical talent... Let's celebrate the movie 'Atkan Chatkan' ...well done Shivamani sir and Shiv Hare , Lydian and Ruthra UNNIKRISHNAN"}, {"id": 56, "text": "Outstanding performances and great screenplay. Overall a must watch!"}, {"id": 57, "text": "The movie is too good ..! Motivational and I was in tears.. must watch guys.. Story of kids achieving their dreams :) Get inspired and get going towards your dreams."}, {"id": 58, "text": "Really a great movie with a lot of great acting and emotions."}, {"id": 59, "text": "Inspirational movie with great music by Shiva Anna"}, {"id": 60, "text": "Amazing movie....must watch...one of the finest films..Story is just fabulous..it may touch the heart .. It is very thoughtfuly directed,the actors have acted very well ... I loved every bit of it,the songs, story line , screen ply everything was upto the mark...A must watch movie Atkan chatkan .."}, {"id": 61, "text": "Atlkan Chatkan is a musical that will take you on a rhythmic journey of hope and dreams.Specially the soundtracks are amazing, brilliant composition by Mr. Shivamani must watch.. film"}, {"id": 62, "text": "Very nice movie Enjoyed it Ending could have been better"}, {"id": 63, "text": "Tanmay Chaturvedi is totally fraud in his real life. Vo online music classes ke liye amount leta aur classes nahi karata hai,sirf daily bahane karta hai, mujhse 2 months ke advance me paise manga, maine vishwas kar ke rs5000 de diye, 14 classes ke liye, lakin 2 months me sirf 4 classes hi karaye, wo bhi bahut peechhe pad kar,. First class sirf 10 mins ,ki karaiye , baki classes bhi 30 mins ki hi karayi,. Ab na hi phone uthata hai aur na hi koi reply karta hai, He is totally fraud , don't watch his movie, Only fraud person"}, {"id": 64, "text": "This movie is one of the best movie produced by Hindi Cinema. And i wish this one gets nominated for Oscar and wins the same. Best part about this movie is that somewhere in your life, you have faced each and every character of this movie. You can relate yourself to a child who has gone through sweet and bitter time. Or you can relate yourself. Personally i liked two best scenes in the movie: 1. Ballon ko usaki spelling aati hai. 2. the kitni aawazein sunayi di.3 climax is the best all the song ...so versatile and amazing recommend each and every individual to watch this movie at least once in their lifetime."}, {"id": 65, "text": "Wow, Cinema at its best Thank you Shiv Hare for making this movie...Brilliant work from all actors specially the kid.Hats off Lokaa production !I seriously could not believe we could make movies like this i hope people at the Board whoever sends movie for Oscars send this one ...at least this one has a slight chance .Atkan Chatkan will sweep all awards there is this year.Best movie i think in last 15-16 years and till Lokaa production makes another one."}, {"id": 66, "text": "Such a wonderful film..What a superb Direction...awesome script ...beautifully explore...rich frame...soft n ultimate music...great act by each n every character...specially the leading kids...A must watch film...motivational film for kids and youngseter as well.Highly recommend"}, {"id": 67, "text": "Soulful movie with inspiration, motivation, dream &amp; passion...so versatile music i never heard in any children film till now...what a song narr ho all childhood memories i recall when i was in school...meri maa i cried while listening this, mann tu ...honestly no enough words to express.....its very good, amazing cinema ....good luck team"}, {"id": 68, "text": "You will not regret watching it. Songs and music direction were good. Storyline was also good. But it was a bit dramatic. Some scenes were stretched. But can definitely be watched."}, {"id": 69, "text": "Its a insipring story of guddu and her team which set an example of success against of bad situations"}, {"id": 70, "text": "Music, story all are fantastic . Simple and beautiful story"}, {"id": 71, "text": "Beautiful movie...everyone should watch..child actors do their best performance"}, {"id": 72, "text": "Review By Kamal KAn excellent direction, beautiful narration and an emotional ending. This movie deserves the best of applause. The director has done an out of the world job. At no point in the movie does he overshadow the kid. The best thing I love about the movie is the facial expressions of Kid. This kid is a genius and has filled life into the role of a music lover. Movie is so perfect, doting mom, lovable sister and a bad dad. The manifestation of problems has been toned beautifully and the way the kid is dreamed to get out the problems is artistic. Missing this movie would be a blunder."}, {"id": 73, "text": "The story was nice and the direction was much better took different locations and best expressions out from artist's hearts specially from Kids, songs by celebs and a competition of best music lover students shown in movie was also attractive. Motive to support poor kids and encourage them to grow with studies and their hobbies/abilities to develop ahead is a nice thought should have in all our hearts. Love to art doesn't relying on any prize or trophy but it's a gift by God never stop to grow and which's a respectful thinking."}, {"id": 74, "text": "Very simple easy going light hatred movie. Direction and learning was good."}, {"id": 75, "text": "AmazingNarr ho na niraash karo mann ko,Narr ho na niraash karo mann ko,Kuch kaam karo kuch kaam karoJag me rahke nij naam karo..."}, {"id": 76, "text": "I am still overwhelmed after the show has long ended. It's has been an enriching roller coaster ride back to my childhood days. The emotions of the child artiste in the movie has left a big impression in me.He is truly amazing to say the least (the real hero of the movie). Lydian Nadshwaram did amazing part of this movie... &amp; the songs 🎵🎵🎵🎧 Wowwwwww"}, {"id": 77, "text": "Well, some films are bad, some are good. Some films are great, some are superb. But there are a handful of films that come once in a while to create a new landmark in the history of Cinema. They are above of those mere 'good' 'great' adjectives and the only way to describe them is by telling the person Go and see for yourself! Atkan Chatkan is among those rare &amp; remarkable film that may change your life once you see it.So I'm not going to spend anymore words describing how brilliant the movie is and how you may end up crying not in sadness but in joy instead, the only thing I can say is watching AC is mandatory regardless of whoever you are and whatever you do you will relate with this masterpiece."}, {"id": 78, "text": "Bollywood has always been deprived of such movies. Shiv Hare, a talented director, a movie which is a bit different, and does it brilliantly. The movie starts with story of 10 year old, kid, guddu. Lydian Nadshwaram has played a role of a boy who is very poor and his father is bad. But his bit different than others and his mind always hear music in everything, very creative. The flow of movie is just awesome. It is full of emotions. Though the movie is about a kid, it is meant to be watched by parents along with their children. I think this movie certainly deserves a spot in IMDb top 100. Also after so many years, a Bollywood movie has given hope for an Oscar."}, {"id": 79, "text": "Nice movie... good story,direction,music,perfect casting."}, {"id": 80, "text": "Very nice movie for children.Must watch.It is a family Movies."}, {"id": 81, "text": "Very nice inspiring movie, family film ...Sabko dekhna chahiye...Telegram ji thank you"}, {"id": 82, "text": "Good flim very wonderful family moive must watch ...its very commen but authentic rare story."}, {"id": 83, "text": "Great story and direction......This type of movie with simple but beautiful story need to be encouraged. Especially the direction......wow....what a direction.....Hats off.....Acting too....simple but powerful performance!!!?"}, {"id": 84, "text": "While the seriousness of the effort was evident in the film by the characters. Brilliant!"}, {"id": 85, "text": "The two-hour-fifteen-minute film is directed by Shiva Hare. Worth watching!"}, {"id": 86, "text": "The scattered brown, dirty-skinned faces of the children in the Attakkan chatkan leave nothing to the imagination."}, {"id": 87, "text": "Have to go through, really get down on your destiny. And when everything seems lost, it is saved."}, {"id": 88, "text": "He stumbles his way to a group of other street children and they form a band using all the street paraphernalia paraphernalia - broken pipes, plastic drums, etc."}, {"id": 89, "text": "In the opening sequence, they hear the sound of adulteration in a brass pot, wheat bran, finger ring on a glass of glass in a paan shop."}, {"id": 90, "text": "He works at a tea stall, but lives a life devoted to the pursuit of music."}, {"id": 91, "text": "Throw in a talented teacher who has a heart of gold. Lovely!"}, {"id": 92, "text": "Children are happy to watch, even if they have to relive dialogues that are unrelated to this decade."}, {"id": 93, "text": "Atkan Chatkan, a phrase in Hindi, often used for alliterative purposes, is believed to lend a young, lively vibe."}, {"id": 94, "text": "Listen to 'AR Rahman's best' on your choice of music player. It's amazing too."}, {"id": 95, "text": "The film being presented by AR Rahman, expectations were high at the end of the musical, but even one cannot miss a humble kitty ."}, {"id": 96, "text": "Lydian Nadaswaram must play the role of a contestant, which he tries his best."}, {"id": 97, "text": "Lydian Nadaswaram, who plays Guddu, is a talented pianist in real life."}, {"id": 98, "text": "Atkan Chatkan drives home the point that nothing can stop you from realising your dream, if you have the will and the skill."}, {"id": 99, "text": "The kids are a delight to watch, even if they have to regurgitate dialogues that don't belong to this decade."}, {"id": 100, "text": "The film is neither zestful nor happy. I really loved the mix version of all the emotions"}, {"id": 101, "text": "Atkan Chatkan, a phrase in Hindi, which is often used for alliteration purposes, is supposed to lend a zesty, youthful vibe."}, {"id": 102, "text": "Give Atkan Chatkan a miss. Listen to 'the best of AR Rahman' on your choice of music player instead."}, {"id": 103, "text": "The expectations were high on the musical end, but even there one cannot recall even one hummable ditty."}, {"id": 104, "text": "One of the most refreshing shows that I've watched in recent times. Wonderful!"}, {"id": 105, "text": "This film is a light-hearted thriller film. It is very enjoyable and entertaining. It also has inspiring factors."}, {"id": 106, "text": "Cinematography is decent. I liked the execution which is just perfect according to the plot."}, {"id": 107, "text": "This film gives me so much relaxation. One of the best films I have ever watched."}, {"id": 108, "text": "It is an amazing film with little heart humour and awesome acting. Enjoyed it!"}, {"id": 109, "text": "I am amazed by the simplicity of boy's approach towards acting. The film is realistic and the actors are entertaining."}, {"id": 110, "text": "This film is a great success to Zee 5. Keep making such kind of simple and realistic film."}, {"id": 111, "text": "In this film, we have witnessed how acting skills can overtake the story. This film is amazing and fun to watch."}, {"id": 112, "text": "I just watched the film and I really appreciate it, a very simple story but touches the heart."}, {"id": 113, "text": "One of the best rural life they have picturized and amazing plot with portraying the characters."}, {"id": 114, "text": "What a simple film! It is very simple but it has magic which holds you to watch till the end."}, {"id": 115, "text": "This is what India loves to watch. The plot is amazing and very well executed. Brilliant concept!"}, {"id": 116, "text": "It is a masterpiece. Great story writing, dialogue delivery and performances by the semble cast."}, {"id": 117, "text": "It is so relatable and on point. I absolutely loved the film. I wish they come up with the second part too."}, {"id": 118, "text": "Such a beautiful story. A good family watch. We need such stories where the entire family can sit and enjoy. The well done entire team."}, {"id": 119, "text": "I just finished watching the film. It is a lovely piece of art and very well done by the story writers and artists."}, {"id": 120, "text": "Must watch This #MasterPiece ! So these day I am constantly on a lookout for 'offbeat ' movies from Bollywood , and never disappointed to what i unearth every time ! With lot of will I am trying to resist the mainstream commercial Bollywood tatti and with such lovely movies around I am glad to stick my will.Had #AtkanChatkan been made by big banners like Dharma productions , it would have been called the 'High School musical of India ' ... This is the true and real talent made on relatively low marketing budgets ..guys it's viewers and public like us who can make such underdog and quality movies a commercial success , help spread the word with power of social media !!!Thank you ZEE5 Premium , #ShivHare Sonu Nigam A.R. Rahman #ShivaMani Shivamani for giving us such an Wonderful piece of ART !"}, {"id": 121, "text": "Fantastic movie with full of suspense. Full of dream, hope and compassion"}, {"id": 122, "text": "Atkan Chatkan is the film which is all about music and that's the reason music lovers shouldn't miss this film at all. All 4 child actors were very good in the film. And If you don't know who the lead child actor is, just search 'Lydian Nadhaswaram' on Youtube, you'll be amazed.Now, the film started very well but so many cliché moments appeared in the 2nd half, let the film a little bit down. But, I think the film is made specially for the children and I'm sure they will enjoy every bit of it."}, {"id": 123, "text": "BOLLYWOOD LOOK HOW TO MAKE MOVIES MUSIC WITH A MESSAGE. ALL BOLLYWOOD STAR COPING OLD MOVIE OR SOUTH INDIAN MOVIES"}, {"id": 124, "text": "What a film...guys must watch content with all for all ... Amazinggggggg"}, {"id": 125, "text": "Such a brilliant cinema...i realy appreciate everyone's who's work in this amazing piece of art."}, {"id": 126, "text": "I love you mr. Director to make this Innocent Masterpiece...and hugs and lot of kisses to all the cute kids"}, {"id": 127, "text": "I rarely watch film ...but because of my kids sometimes i sit with them and watch their content...and surprisingly i glued with it till end with tear in my eyes ...its simply beautiful inspiring movie...happy to see it"}, {"id": 128, "text": "Such a emotional movie ... Everyone is different and justice with thair characters... Lyrics are superb, director done a 👌👌👌job and other kids specially mother father was apt ...lot to say but overall such a cute journey...jhansi visual is wow ...no one shown jhansi this way ...great great great"}, {"id": 129, "text": "Guys ...whattttt the film ... Anyone should not miss ...such a cute content and Lydian steal the show completely...and mr. Director i love you waiting for your next creation"}, {"id": 130, "text": "Industry should promote this kind of neet cinema to our future (children) dil khush ho gya ... Congratulations dear makers"}, {"id": 131, "text": "I was Just surfing ott for my kid and i come across Atkan Chatkan ...such a beautiful inspiring movie ...even i saw it till end and realized what a wonderful movie but sad part i was don't know about it ... People its for all age group great cinema ...10/10 for all department...good luck"}, {"id": 132, "text": "Awesome movie and fantastic action by everyone. Gripping engaging storyline based on kids passion on music. There's a bit emotion towards the end."}, {"id": 133, "text": "A very special film to watch who they think there is no hope in life... For them this movie is a learning lesson. Very inspiring , loving , musical film and very well written and directed film. It's delight to watch and Atkan Chattan is must watch film. Congratulations director - Shiv Hare"}, {"id": 134, "text": "Bhaut hi adbhut And very good movies Great looking Great work And great messejs"}, {"id": 135, "text": "OMG! The film is out finally. Planning to binge-watch it as I was eagerly waiting for this one."}, {"id": 136, "text": "One of the finest films so far made on real rural strugglers of India. Every actor feels real."}, {"id": 137, "text": "This is such an outstanding film. I just loved it. I liked each character and loved the storyline."}, {"id": 138, "text": "This is one of the amazing films. The characters are so realistic in their roles."}, {"id": 139, "text": "I watch the entire film and wow! The writing and acting of all the characters were sublime."}, {"id": 140, "text": "I just binge-watched this film. A real gem discovered by Zee5.One of the best character this man has played."}, {"id": 141, "text": "Action films are hard to make as it's isn't easily make your viewers tuned. But this film has nailed it."}, {"id": 142, "text": "Zee 5 never ever disappointed me and here again a crime thriller with a whole new twist of a crazy lover is so amazing."}, {"id": 143, "text": "I can re-watch this movie over and over again. It is such a heart touching crime thriller with the perfect crisp."}, {"id": 144, "text": "Every scene makes you want to watch more and more as every scene has a new twist to it. Mindblowing performances are given."}, {"id": 145, "text": "The fact that every emotion is displayed so beautifully will make you feel that you are in the play. Great work is done by actors."}, {"id": 146, "text": "This film is so much more rather just about love and emotions. Interesting!"}, {"id": 147, "text": "The film promises to give goosebumps and adventures to the watchers. It gave me and I loved it."}, {"id": 148, "text": "The decency and purity of the content are noticeable. It is a family watch! Truly loved the film."}, {"id": 149, "text": "Wonderful movie and well expressed I must say. Such contents should be made more on love stories."}, {"id": 150, "text": "It is a very intensive thought of how the boy goes to any extent to save his love from danger. Beautiful!"}, {"id": 151, "text": "The plot is amazing as well as the star cast. Above all the emotions, the bitter truth is depicted."}, {"id": 152, "text": "I think the writer is genius because I like the way he has plot the concept so beautifully. Good job!"}, {"id": 153, "text": "I found the story is very inquisitive and all the viewers must have loved it to the fullest."}, {"id": 154, "text": "Zee5 really have featured and launched the most amazing love story so far now. Loved it."}, {"id": 155, "text": "The film highlights how situations where emotions and anxieties of the lovers lead them alone."}, {"id": 156, "text": "This film has featured a unique love story which is centred on the theme that love is against all."}, {"id": 157, "text": "What a beautiful story! I got emotional in the end. This film touched my heart. I can re-watch it."}, {"id": 158, "text": "This film reminded of my first love who fought for me just because he loved me. I truly loved the film."}, {"id": 159, "text": "This film has the most eye-opening story. It has thrill, action, drama, emotions and beautiful love."}, {"id": 160, "text": "Weaving together elements of unpredictable scenarios boost the confidence they had in their love."}, {"id": 161, "text": "In some of the scenes, loyalty of their love has been put to test which I think they have passed."}, {"id": 162, "text": "This film gave me goosebumps. The scenes are quite intensive and drive your attention constantly."}, {"id": 163, "text": "The concept is immensely heart touching and absolutely commendable. I really liked it."}, {"id": 164, "text": "The story touched my heart. Shalini has acted tremendously well along with all the actors."}, {"id": 165, "text": "OMG! I am so happy they fought so hard but also sad to know that they couldn't be together in the end."}, {"id": 166, "text": "I think this film utterly speaks for today's generation where there is a respect for love."}, {"id": 167, "text": "It is a masterpiece. The film is very interesting as it is a crime thriller and attracts youth."}, {"id": 168, "text": "Tons of appreciations to the entire cast and crew, also the directors and producers to bring out such a masterpiece."}, {"id": 169, "text": "I really loved the moments they spent together, hanging out and that beautiful song just got me tears."}, {"id": 170, "text": "It's perfect! I found it very intense filled with a rollercoaster of emotions and love till the end."}, {"id": 171, "text": "The film filled with adventures scenes and cons of the negative people around"}, {"id": 172, "text": "This film is quite fun to watch, it gets very emotional in the end though but you'll love it."}, {"id": 173, "text": "I want everyone to see this amazing film which gives us a powerful message in the end. Awesome!"}, {"id": 174, "text": "This film has covered all the important and current topics which are relevant to many of us."}, {"id": 175, "text": "Zee5 is loaded with such inspiring contents and we have another one. This is definitely a hit."}, {"id": 176, "text": "I loved the concept and its execution in the film. The directors and crew have worked good."}, {"id": 177, "text": "Brilliant concept! It is very simple but it has magic which holds you to watch till the end."}, {"id": 178, "text": "Dialogue delivery and performances by the semble cast. The plot is amazing and very well executed. Brilliant concept!"}, {"id": 179, "text": "The writing and acting of all the characters were sublime. I watch the entire"}, {"id": 180, "text": "Action films are hard to make as it's isn't easily make your viewers tuned."}, {"id": 181, "text": "A real gem discovered by Zee5. One of the best character these boys has played."}, {"id": 182, "text": "Watching this feels real. I just binge-watched this film. The concept is beautiful."}, {"id": 183, "text": "So natural and real. am happy that I decided to watch this film. Totally enjoyed it."}, {"id": 184, "text": "I was waiting for the film to get released ever since I watched the trailer."}, {"id": 185, "text": "This film is too mysterious. The delivery of the film is very smooth, natural and realistic."}, {"id": 186, "text": "It shook me to the core, chills and gave me goosebumps on the content."}, {"id": 187, "text": "All the characters make you laugh and lets you enjoy the movie. Good concept!"}, {"id": 188, "text": "The plot is really amazing. Very well executed and I must say that the actors have fantastically acted."}, {"id": 189, "text": "Stellar performances! If somebody is looking out for new content and inspiring one, this suits perfectly."}, {"id": 190, "text": "I loved it! This film definitely has raised the bars of entertainment."}, {"id": 191, "text": "The film is beautifully structured and absolutely relatable. Awesome!"}, {"id": 192, "text": "Your entire family and get entertained. Lots of love and respect for this film."}, {"id": 193, "text": "Each and every moment is beautifully placed. I really appreciate the fine line between melodrama and reality."}, {"id": 194, "text": "Something I noticed is quite natural and authentic. Whenever I watch such a masterpiece."}, {"id": 195, "text": "Too much entertainment and a great concept. the film is relevant to so many real gangs."}, {"id": 196, "text": "The characters are brilliant and their performances will entertain you to their maximum."}, {"id": 197, "text": "It's a great film, in fact, it's a must-watch film because it has everything you expect for a perfect show."}, {"id": 198, "text": "The dialogues and punchlines are on point. Enjoyed to the fullest. The film has delivere This film was one of the powerful films I have seen lately. The actors were really good."}, {"id": 199, "text": "I have never been so entertained. The film has captured my attention."}, {"id": 200, "text": "I am definitely recommending this film to my friends. What a film it was! So real!"}, {"id": 201, "text": "I am definitely recommending this film to my friends. This is something extraordinary."}, {"id": 202, "text": "I can never regret to watch the film. The film truly deserves to be a hit with tons of appreciation."}, {"id": 203, "text": "I totally had fun watching this film. I watched the film with my family and it was a great time."}, {"id": 204, "text": "There is something in this film that's so enduring and lovely."}, {"id": 205, "text": "The film was so enjoyable to watch. I genuinely liked the concept."}, {"id": 206, "text": "The characters look are strong. I have seen an awesome film so far."}, {"id": 207, "text": "Such a simple and really powerful one. Its is inspiring and a very light film."}, {"id": 208, "text": "It is warm and nice to spare some time to watch this film. Awesome!"}, {"id": 209, "text": "Super entertaining and fun to watch. Good job! Binge watched the film."}, {"id": 210, "text": "I am in love with this film. Everyone has acted so well. So raw and real."}, {"id": 211, "text": "A must watch. This film is quite easy going and is loaded with simple dilemmas."}, {"id": 212, "text": "No huge political drama and no romanticizing of rural India. Well done Zee5!"}, {"id": 213, "text": "The film looks quite promising. The actors are very talented. Beautiful!"}, {"id": 214, "text": "What a concept! It is a film based on people who value love."}, {"id": 215, "text": "Have done some unthinkable and brilliant creativity on the story of the film."}, {"id": 216, "text": "What a fabulous film! The team have done some unthinkable and brilliant creativity on the story of the film."}, {"id": 217, "text": "I think it's an epic film to watch. I decided to watch this film in a one time go. This is so interesting!"}, {"id": 218, "text": "What a film! I am really happy we have such good directors to produce a masterpiece."}, {"id": 219, "text": "I am absolutely in love with the ideology behind the concept. Awaiting!"}, {"id": 220, "text": "I thoroughly enjoy these kinds of film and this looks thrilling too. Wonderful!"}, {"id": 221, "text": "I love such dark concepts. they have tried to covey the two process of the crime."}, {"id": 222, "text": "The story seems to be very heart-wrenching and personalities they have portrayed in the film."}, {"id": 223, "text": "The vision of the film is really good. I am amazed to see how fearless, bold and strong story."}, {"id": 224, "text": "Goosebumps! This film has set an example of a perfect film of a perfect concept."}, {"id": 225, "text": "The cast is rarest of the rare. The film is quite adventurous and it's a crime thriller. Great one!"}, {"id": 226, "text": "Thrilling! It's a masterpiece. They have given some stellar performances in the film. Great job!"}, {"id": 227, "text": "This film is quite inquisitive. Great job to the directors and the actors who contributed to the film."}, {"id": 228, "text": "I have so much love for this film. This film definitely gives you too many surprises. Nice!"}, {"id": 229, "text": "The idea is brilliant and it's execution too. The film is about the war between good and evil."}, {"id": 230, "text": ". I will definitely binge-watch this film. Super excited! What an incredible concept one must have thought!"}, {"id": 231, "text": "It's a blast! I am in love with the idea of the film. This film is going to save my quarantine."}, {"id": 232, "text": "I am falling short of words to express how I felt watching this. I was surprised!"}, {"id": 233, "text": "A film with such great actors and through their content this film is already nailing in it."}, {"id": 234, "text": "Very few dare to bring out the reality through their content a full packed hit film."}, {"id": 235, "text": "It holds a very realistic and authentic story which has clearly seen that the film."}, {"id": 236, "text": "It was very pleasant to watch the film and has the vision to portray and convey to us. Superb!"}, {"id": 237, "text": "I think this show will drive millions crazy and I am in love with the concept."}, {"id": 238, "text": "I am in love with the concept that reflects the culture and creative and innovative concepts."}, {"id": 239, "text": "This film raises the respect we have for the love we hold onto. Good job!"}, {"id": 240, "text": "The execution of such difficulties in a precise manner is a victory. Truly amazing!"}, {"id": 241, "text": "I am loving how these boy battle and deal with challenges of crime coming across."}, {"id": 242, "text": "I have watched this film like a thousand times and still counting. It's a feeling of satisfying the film is beautiful."}, {"id": 243, "text": "I have never been so satisfied with watching the film. Mind-blowing! I loved it."}, {"id": 244, "text": "We needed such kinds of film to be launched for the youth and it has. Brilliant!"}, {"id": 245, "text": "I just watched it and I think this one is especially for the youth. What a thought!"}, {"id": 246, "text": "I must say that by the glimpse we figure out how interesting the film is."}, {"id": 247, "text": "This film is based on crime and identifying crime process is difficult for the Suri."}, {"id": 248, "text": "Everybody is loving it. The film is surely a hidden gem. I loved it."}, {"id": 249, "text": "I am stirred to watch this film because I know it's a blockbuster already."}, {"id": 250, "text": "This film is one of them. Superb! It's launched and I think it's thrilling. Amazing!"}, {"id": 251, "text": "Also very inspiring at the same time. I really like the contents which are real and based on reality."}, {"id": 252, "text": "By watching this I feel the film is very intensive and have presented a masterpiece."}, {"id": 253, "text": "It feels amazing to watch all these brilliant actors sharing one screen very inspiring at the same time."}, {"id": 254, "text": "I'm happy that finally the film has been launched. The film is super amazing and exciting."}, {"id": 255, "text": "I think this film deserves awards and tons of appreciation. The entire cast team is wonderful."}, {"id": 256, "text": "It has drama, thrill, crime, mystery and I think it will bring too many surprises."}, {"id": 257, "text": "I loved the whole idea of the concept. The film is based on mysterious and drama."}, {"id": 258, "text": "This film has given us the source to know about it better. This is definitely going in my watchlist."}, {"id": 259, "text": "The cast performing their excellence on the screen. This film connects us to love to fight against injustice."}, {"id": 260, "text": "It's an iconic story that reflects their honesty and loyalty. I was very happy to watch it."}, {"id": 261, "text": "Good job! This film has some realism and I think it will be an eye-opening show."}, {"id": 262, "text": "Super excited! I shared the film with my friends and now we will watch it together."}, {"id": 263, "text": "One of the best of the film is that they have kept as real and authentic as they could."}, {"id": 264, "text": "All the actors are extremely talented. I am thrilled by the concept. Very interesting!"}, {"id": 265, "text": "I was very excited about the launch of the film and now it's out. Lovely!"}, {"id": 266, "text": "I could see such hardworking and supremely talented actors. Loved the film."}, {"id": 267, "text": "I was eagerly waiting for this one and finally, I watched it. Loved this one."}, {"id": 268, "text": "Good job! You become more matured when you watch such interesting films."}, {"id": 269, "text": "I prefer watching such films as I love drama, action and crime thriller based films."}, {"id": 270, "text": "Also, I got goosebumps on in the end. Share it and support these amazingly talented actors."}, {"id": 271, "text": "I just watched the film and it was so much fun to watch. I think we all should watch this film."}, {"id": 272, "text": "I found the film quite interesting. The film turns into an emotional roller coaster ride."}, {"id": 273, "text": "Eye-catching! Proper pinch of drama and realism. proper execution of every character and an amazing screenplay."}, {"id": 274, "text": "Not really a fan of crime thrillers but the watching the trailer got me here. this is something rare crime thriller that I am looking forward to starting with."}, {"id": 275, "text": "Mind did not wander anywhere else even for a second while watching this indulging crime thriller and that is a sign as good play."}, {"id": 276, "text": "This film talks about cruelty and love at the same time and their interrelations as well. I had a great time."}, {"id": 277, "text": "The director concentrated more on the script with an engaging screenplay, it would have been a different ball game altogether"}, {"id": 278, "text": "Most of the artists are new and unknown faces but their acts seem like they are natural actors."}, {"id": 279, "text": "The writers have gone over the top in giving out some great lines to the actors cast and the delivery of every line is precise and perfect."}, {"id": 280, "text": "As far as I know this very unusual concept but this is also something that you would want to watch over and over again."}, {"id": 281, "text": "I just watched the film and I really appreciate it, a very simple story but touches the heart and can relate its characters to real life."}, {"id": 282, "text": "One of the best rural life they have picturized and amazing plot with portraying the struggle of writers."}, {"id": 283, "text": "What a simple film! It is very simple but it has magic which holds you to watch till the end."}, {"id": 284, "text": "This is what India loves to watch. The plot is amazing and very well executed. Brilliant concept!"}, {"id": 285, "text": "I am in love with all the characters. Suri was played brilliantly. Thank you for the soothing entertainment."}, {"id": 286, "text": "I just finished watching the film. It is a lovely piece of art and very well done by the story writers and artists."}, {"id": 287, "text": "OMG! The trailer is out finally. Planning to binge-watch it as I was eagerly waiting for this one."}, {"id": 288, "text": "One of the finest films so far made on real rural strugglers of India. Every actor feels real."}, {"id": 289, "text": "This is such an outstanding film. I just loved it. I liked each character and loved the storyline."}, {"id": 290, "text": "While the seriousness of the effort was evident in the film by the characters. Brilliant!"}, {"id": 291, "text": "The two-hour-fifteen-minute film is directed by Shiva Hare. Worth watching!"}, {"id": 292, "text": "The scattered brown, dirty-skinned faces of the children in the Attakkan chatkan leave nothing to the imagination."}, {"id": 293, "text": "Have to go through, really get down on your destiny. And when everything seems lost, it is saved."}, {"id": 294, "text": "He stumbles his way to a group of other street children and they form a band using all the street paraphernalia paraphernalia - broken pipes, plastic drums, etc."}, {"id": 295, "text": "In the opening sequence, they hear the sound of adulteration in a brass pot, wheat bran, finger ring on a glass of glass in a paan shop."}, {"id": 296, "text": "He works at a tea stall, but lives a life devoted to the pursuit of music."}, {"id": 297, "text": "Attakan Chakan is the story of Guddu's raga-dar-daulat, a gifted child who is an absent mother and an alcoholic father."}, {"id": 298, "text": "The twist takes place in the first half of the film, but you yet cannot predict the second half."}, {"id": 299, "text": "Throw in a talented teacher who has a heart of gold. Lovely!"}, {"id": 300, "text": "A prestigious music competition is on the card, and Raggy Bunch is planted to win it for the school."}, {"id": 301, "text": "Guddu and his band are 'discovered' by the principal of Tansen College in Jhansi, where the film is set up."}, {"id": 302, "text": "Children are happy to watch, even if they have to relive dialogues that are unrelated to this decade."}, {"id": 303, "text": "The film is encouraging and happy. The viewer finds absolute peace in the film."}, {"id": 304, "text": "Atkan Chatkan, a phrase in Hindi, often used for alliterative purposes, is believed to lend a young, lively vibe."}, {"id": 305, "text": "Listen to 'AR Rahman's best' on your choice of music player. It's amazing too."}, {"id": 306, "text": "The film being presented by AR Rahman, expectations were high at the end of the musical, but even one cannot miss a humble kitty ."}, {"id": 307, "text": "The percussion-heavy score, Dholakia, Shivamani, courtesy, is lost in the mellow screenplay."}, {"id": 308, "text": "Lydian Nadaswaram must play the role of a contestant, which he tries his best."}, {"id": 309, "text": "Lydian Nadaswaram, who plays Guddu, is a talented pianist in real life."}, {"id": 310, "text": "His co-stars Sachin Chaudhary, Yash Rane, Tamanna Dipak, Aayesha and Vindhara also gave a good performance."}, {"id": 311, "text": "Lydian Nadhaswaram is a talented singer/musician in real life, and his talent is presented well on screen."}, {"id": 312, "text": "This film has tried to potray kids face to make their dreams come true, it has been subtle over the top."}, {"id": 313, "text": "It's filled with action and intensity and there's too much drama."}, {"id": 314, "text": "By adding drama and exclusivee characters, the plot seems amazing and real."}, {"id": 315, "text": "The writing is amazing. The concept speaks the reality based on authenticity."}, {"id": 316, "text": "The writers, Shiv Hare and Aadesh Raathi had a simple and powerful story to tell."}, {"id": 317, "text": "Inspirational stories sound good, but they aren't always easy to execute."}, {"id": 318, "text": "This story screams for some inspiration and also gives too much drama."}, {"id": 319, "text": "The film depicts its theme with beauty and perfection and the soundtracks are worth listening to as well."}, {"id": 320, "text": "The film has its fair share of flaws due to its predictable and repetitive storyline but this does stop it from being an engaging watch overall."}, {"id": 321, "text": "He is a pianist and throughout the film, he carries his role with grace and perfection."}, {"id": 322, "text": "The main character, Guddu, played by Lydian Nadhaswaram, is a gifted musician in real life."}, {"id": 323, "text": "It is produced by A.R. Rahman and Vishakha Singh.It is produced"}, {"id": 324, "text": "Directed by Shiv Hare, the film stars Lydian Nadhaswaram, Sachin Chaudhary, Madhav, Yash Rane, and Tamanna Dipak."}, {"id": 325, "text": "Atkan Chatkan premiered on 5th September 2020 on Zee5."}, {"id": 326, "text": "You have a fair idea about the conclusion but you still carry on because of a cast that is worth watching."}, {"id": 327, "text": "I found it a very heart touching, funny and realistic film. I totally had fun watching this film."}, {"id": 328, "text": "I want to appreciate more the authenticity of the landscape a rightful portrayal of the characters."}, {"id": 329, "text": "I watched the film with my family and it was a great time as the film was so enjoyable to watch."}, {"id": 330, "text": "There is something in this film that's so enduring and lovely. The characters look are strong."}, {"id": 331, "text": "I genuinely liked the concept. Its is inspiring and a very light film. Awesome!"}, {"id": 332, "text": "I have seen an awesome film so far. Such a simple and really powerful one."}, {"id": 333, "text": "Binge watched the film. Everyone has acted so well. It is warm and nice to spare some time to watch this film."}, {"id": 334, "text": "The film follows the age-old Bollywood formula i.e., rags to riches."}, {"id": 335, "text": "The film beautifully depicted and there is a certain amount of pain that has been associated with the aspirations of the poor."}, {"id": 336, "text": "The film does induce pain and sadness at certain points."}, {"id": 337, "text": "Along with a society that only beats you down by belittling your dreams."}, {"id": 338, "text": "What it is to grow up without a mother and with an alcoholic father."}, {"id": 339, "text": "Atkan Chatkan plays a good role at triggering that emotion. Lovely!"}, {"id": 340, "text": "So raw and real. I am in love with this film. Super entertaining and fun to watch. Good job!"}, {"id": 341, "text": "What a fun movie to watch. I absolutely loved the idea, concept and the visualisation of the film."}, {"id": 342, "text": "It is an epic movie. The concept is very heart touching. I truly enjoyed it."}, {"id": 343, "text": "Along with being a super hit inspirational and a motivational movie, it is emotional too. Superb!"}, {"id": 344, "text": "This is definitely going in my next watchlist. Thankyou Zee5 for saving my quarantine. Keep creating such contents."}, {"id": 345, "text": "This film is a masterpiece. Very well executed and the concept is very relatable to the people"}, {"id": 346, "text": "An extraordinary one! Stellar performances and an intense film with such talented actors. Good work!"}, {"id": 347, "text": "The entire team has put some real efforts to impact such a great and inspiring film out there."}, {"id": 348, "text": "These men make everything so realistic that you can't believe it's a film on the screen going on. Awesome!"}, {"id": 349, "text": "I am speechless. What a film! What a concept! Zee 5 has done some fabulous job here."}, {"id": 350, "text": "I can watch this on repeat. The song is brilliant and I absolutely loved the concept they have executed."}, {"id": 351, "text": "This film has definitely inspired many of us. The idealogy behind the concept is amazing."}, {"id": 352, "text": "I was very excited to watch this amazing cast to perform their excellence on the screen."}, {"id": 353, "text": "The best thing about the film is that it unfolds all the truths of a common man which becomes more relatable and interesting to watch."}, {"id": 354, "text": "The concept is portrayed and conveyed so well that actually many of us would want some more of it. Great concept!"}, {"id": 355, "text": "Zee 5 never disappoints its audience. What an inspiring film! I would recommend everyone around me to watch this film."}, {"id": 356, "text": "The trailer is brilliant itself that it gives you a feeling to watch the film. I am excited about the film after watching the trailer."}, {"id": 357, "text": "This movie gives absolute peace to my heart watching these boys giving brilliant and stellar performances."}, {"id": 358, "text": "One of the finest films of Zee 5. It is kicking off the hitbox. Awesome!"}, {"id": 359, "text": "The concept is really beautiful and it was very necessary to speak on. It is also portrayed well."}, {"id": 360, "text": "All the boys look stunning. They look strong and amazing together. I totally loved their roles."}, {"id": 361, "text": "Zee5 always come up with interesting contents and films to watch. And now I must a masterpiece has arrived."}, {"id": 362, "text": "This is a film which you can watch with your friends and get entertained. Loved it!"}, {"id": 363, "text": "It's a hit. Superhit one. Full packed entertainment, drama, thrill and mysterious film."}, {"id": 364, "text": "The concept is really good and beautiful. The plot is amazing along with its execution of the film."}, {"id": 365, "text": "The content is precise and much needed. The actors performed well. It's a package of a hit."}, {"id": 366, "text": "Outstanding! This film is a good watch for me. The concept seems organic and natural."}, {"id": 367, "text": "I like the fact that how hot and stunning the boys look. The film itself is a powerful one."}, {"id": 368, "text": "Quite intensive I must say. What suspense they have held all the way! Gets more and more interesting."}, {"id": 369, "text": "The film is excellent. The plot is good. The actors are perfect. In short, it's a perfect 2-hour watch."}, {"id": 370, "text": "I could see such hardworking and supremely talented actors performing so well. Loved the film."}, {"id": 371, "text": "I just came here for Vidyut as he has rocked in the film. His acting skills were on point."}, {"id": 372, "text": "OMG! Ever since I watched the trailer I was eagerly waiting for this one and finally, I watched it."}, {"id": 373, "text": "I prefer watching such films as I love drama, action and crime thriller based films. Loved this one."}, {"id": 374, "text": "I think we all should watch this film, share it and support these amazingly talented actors."}, {"id": 375, "text": "You become more matured when you watch such interesting and high level of films. Good job!"}, {"id": 376, "text": "I just watched the film and it was so much fun to watch. Also, I got goosebumps on in the end."}, {"id": 377, "text": "The film turns into an emotional roller coaster ride after a few scenes which seems amazing."}, {"id": 378, "text": "I found the film quite interesting. Its has everything a perfect viewer could expect for. Great one!"}, {"id": 379, "text": "The storyline of the film is on the point. It is not even less or more, it's just perfect. Good job to the team."}, {"id": 380, "text": "Masterpiece! I was crying the whole time while watching this movie"}, {"id": 381, "text": "This movie shows the reality of society. Do watch this movie and support it, the whole cast has done a great job."}, {"id": 382, "text": "Just watched the movie really awesome and it is very emotional."}, {"id": 383, "text": "When a movie can tear up your eye and give you goosebumps you know it is something real."}, {"id": 384, "text": "Being a student I have related to this movie a lot and couldn't stop myself from recommending this to all my friends."}, {"id": 385, "text": "The story of this movie is similar to the life story of 'Govind Jaiswal'. he is an IAS officer."}, {"id": 386, "text": "This is how real students and their parents look like. I recommend people watch this movie over Bollywood drama films."}, {"id": 387, "text": "This type of movies deserves appreciation and awards. No drama pure realistic movie."}, {"id": 388, "text": "Pure hard work, talent and brilliant actors. Real movie and real story loved it!"}, {"id": 389, "text": "I think the acting of the child is too good he has given his 100% in making this movie a blockbuster."}, {"id": 390, "text": "Beautiful! The act, performance, execution, screenplay everything is just done beautifully!"}, {"id": 391, "text": "Each and every scene is so indulging. Every scene increases curiosity to know what will happen further."}, {"id": 392, "text": "This is unusual and unique. Every bit of the movie makes you want to watch more and more. Amazing!"}, {"id": 393, "text": "We cannot unlike the real-life story, especially when it is portrayed in such a beautiful way to us. Loved the work!"}, {"id": 394, "text": "The bitter truths are revealed in an unharmed way. The writers have done amazing work and execution is perfect."}, {"id": 395, "text": "We need more of such content in our society not only for youth but also for the elderly people to know more about our society."}, {"id": 396, "text": "It is distorting to know the inequality in our society. This movie has done great work in putting light on such issues."}, {"id": 397, "text": "I loved the intention behind this movie and I'm sure that intention has reached each one of us who has watched it."}, {"id": 398, "text": "I think the cast is just perfect. Each actor has a perfect role to play and that makes the movie best."}, {"id": 399, "text": "I feel so sad at the same time motivated every time I watch this movie. It's truly amazing."}, {"id": 400, "text": "I cannot recommend this movie more. I think it is one of the best content on Zee5."}, {"id": 401, "text": "This movie showcases the hard truth of our system and it is amusing to see the harsh reality."}, {"id": 402, "text": "This movie has left me numb. I never thought people have to struggle so much just to education which is their right."}, {"id": 403, "text": "A true motivation booster. I cried by the end of the movie. Mindblowing performances are given."}, {"id": 404, "text": "I m too picky with the kind of movies I watch and I must say this is one of my rare picks. I loved the movie."}, {"id": 405, "text": "It is so eye-catching. I could not take my eyes off even for a minute, I was hooked at one place all the time."}, {"id": 406, "text": "The background music in the movie is amazing. it has done a good job in making the movie so indulging."}, {"id": 407, "text": "Heart winning stellar performances are given by everyone. the storyline is great with great scripting and mindblowing directory."}, {"id": 408, "text": "Kudos to entire cast and crew. Everyone has done a great job in making the movie truly award deserving!"}, {"id": 409, "text": "Every one being played by the system will relate to this movie at a high level. This movie has done a great job!"}, {"id": 410, "text": "This movie tells us about the bad education system of our society. This was something to focus on and it is done I'm so happy."}, {"id": 411, "text": "Absolutely amazing! I really did not expect this movie to turn out this great but now that I have watched it, I can say it is a blockbuster."}, {"id": 412, "text": "The emotions are hit to another level in this movie. Especially if you are a student you will feel it to the core."}, {"id": 413, "text": "The kind of talent the boy has in the movie is rare yet goes unrecognised by society. This breaks my heart."}, {"id": 414, "text": "I assure you that you won't be disappointed. No second thought guys go ahead and watch it you're going to love it!"}, {"id": 415, "text": "I am soo glad I decided to watch this movie. My weekend couldn't have been better."}, {"id": 416, "text": "The truth behind the ugly system of our society has been revealed in this movie and that makes it a hit."}, {"id": 417, "text": "We need more of such movies for our upcoming future kids. This movie reveals the truth."}, {"id": 418, "text": "I have always had a heart for motivating movies and the fact that it is a real-life story that has made this movie my favourite one."}, {"id": 419, "text": "I didn't expect this movie to be that great earlier when I watched the trailer but gave it a shot anyway and I am soo happy that I watched it."}, {"id": 420, "text": "If you are looking for motivation then this is it. This movie will make you want to work hard for your goals to come true."}, {"id": 421, "text": "A great job was done at performing every role by every individual. The ease in acting and its smoothness can be seen."}, {"id": 422, "text": "Every movie on Zee5 has got something special in it and this movie sets the level too high for every other movie out there."}, {"id": 423, "text": "The way every character has been appreciated in the movie is just amazing. I loved watching this and now I am going to watch it with my family."}, {"id": 424, "text": "How can you not like this movie? It is perfect with a great storyline and dialogue delivery."}, {"id": 425, "text": "Great work! Entire cast and team have done a great job in making the movie the gem it is."}, {"id": 426, "text": "I am not a fan of movies. I love reading motivational books but this movie has made me fond of movies now. Loved it."}, {"id": 427, "text": "The feeling after watching the film is undescribable. it touches to the core and makes you feel so motivated."}, {"id": 428, "text": "The film brings forth the fundamental conflicts between class, language and education in India, and makes some pertinent observations."}, {"id": 429, "text": "I am falling short of words to express how I felt watching this. I was surprised!"}, {"id": 430, "text": "A film with such great actors and through their content this film is already nailing in it."}, {"id": 431, "text": "Atkan Chatkan portrays that deftly. It reflected all kinds of emotions."}, {"id": 432, "text": "Sometimes, the cost of your dreams is your childhood and you grow up way too fast with the vices of society."}, {"id": 433, "text": "The film depicts its theme with beauty and perfection and the soundtracks are worth listening to as well."}, {"id": 434, "text": "The film has its fair share of flaws due to its predictable and repetitive storyline but this does stop it from being an engaging watch overall."}, {"id": 435, "text": "He is a pianist and throughout the film, he carries his role with grace and perfection."}, {"id": 436, "text": "The main character, Guddu, played by Lydian Nadhaswaram, is a gifted musician in real life."}, {"id": 437, "text": "It is produced by A.R. Rahman and Vishakha Singh.wow wow wo wo wo"}, {"id": 438, "text": "Directed by Shiv Hare, the film stars Lydian Nadhaswaram, Sachin Chaudhary, Madhav, Yash Rane, and Tamanna Dipak."}, {"id": 439, "text": "Atkan Chatkan premiered on 5th September 2020 on Zee5."}, {"id": 440, "text": "You have a fair idea about the conclusion but you still carry on because of a cast that is worth watching."}, {"id": 441, "text": "The film follows the age-old Bollywood formula i.e., rags to riches."}, {"id": 442, "text": "The film beautifully depicted and there is a certain amount of pain that has been associated with the aspirations of the poor."}, {"id": 443, "text": "The film does induce pain and sadness at certain points."}, {"id": 444, "text": "Along with a society that only beats you down by belittling your dreams."}, {"id": 445, "text": "What it is to grow up without a mother and with an alcoholic father."}, {"id": 446, "text": "Atkan Chatkan plays a good role at triggering that emotion. Lovely!"}, {"id": 447, "text": "Seeing kids going through pain just because they lack the resources and privileges is always hurtful."}, {"id": 448, "text": "To be a musician you need will and talent, not expensive instruments."}, {"id": 449, "text": "You just need to hear the music carefully and carries this forward too."}, {"id": 450, "text": "The movie starts with giving out the message that everything has music to it."}, {"id": 451, "text": "Eventually, they get a big opportunity to prove themselves and they come up as winners."}, {"id": 452, "text": "With these instruments, they perform on the streets to collect the bare minimum amount to survive."}, {"id": 453, "text": "As the story progresses Guddu, with his friends, forms a small band where they have replicas of expensive instruments made out of scrap."}, {"id": 454, "text": "Atkann Chatkan revolves around the life of Guddu, a poor boy who works at a tea stall and is a music enthusiast."}, {"id": 455, "text": "They witness the talent they had previously shunned or not taken seriously."}, {"id": 456, "text": "The film leads to a climax where somehow every single cast member shows up miraculously enough ."}, {"id": 457, "text": "Instead, it adds a bunch of rich brats at school to play spoilsport."}, {"id": 458, "text": "Amitabh Bachchan's famous baritone pops up to pitch in a bhajan for a scene that wouldn't feel so out of place in the 1980s."}, {"id": 459, "text": "A good half of the melodrama is dedicated to chronicling his travails."}, {"id": 460, "text": "In order to train them, he ropes in a good-natured teacher in dire need of a job. Superb!"}, {"id": 461, "text": "Even as his alcoholic father loafs about and mother is mysteriously missing."}, {"id": 462, "text": "Somewhere in small town Uttar Pradesh, Guddu does all kinds of odd jobs to take care of his home and younger sister."}, {"id": 463, "text": "She senses an opportunity for his institute to win a competition on an inter-state level."}, {"id": 464, "text": "It becomes the focus of a flashback after his adult self receives a novel dedicated to him and his hardships"}, {"id": 465, "text": "A music school's principal catches a glimpse of their unusual talent."}, {"id": 466, "text": "News snippets scattering the opening credits already establish the successful outcome of Guddu's fate."}, {"id": 467, "text": "The film meanders into the second half, attempting to work crisis torn adults into the mix."}, {"id": 468, "text": "It sucesses to dwell on the many dramatic plot points spread throughout the narrative."}, {"id": 469, "text": "The film stops short of being a musical journey par excellence."}, {"id": 470, "text": "Its unique background composition that relies heavily on percussion makes Atkan Chatkan an interesting watch."}, {"id": 471, "text": "The scene where Guddu and his little sister listen to the different sounds they hear as they fall asleep."}, {"id": 472, "text": "Atkan Chatkan does have its high points. I absolutely enjoyed watchinf it."}, {"id": 473, "text": "Acting may not be his strongest suit, but he is confident enough to rise to the challenge and puts on a solid show as Guddu."}, {"id": 474, "text": "Lydian Nadhaswaram, the boy wonder pianist, plays the role of an aspiring percussionist with maturity."}, {"id": 475, "text": "Drums Sivamani's musical score is as impressive as one can expect in a musical feature."}, {"id": 476, "text": "But there are hurdles to jump before success can come to them."}, {"id": 477, "text": "They produce beats out of anything they touch and this brings them into the limelight."}, {"id": 478, "text": "A sequence of events bring the four of them together; the quartet find their sync in music."}, {"id": 479, "text": "Lydian Nadhaswaram makes a solid debut and 'Drums' Sivamani's soul-lifting tunes are worth checking out."}, {"id": 480, "text": "Atkan Chatkan is also marketed in a new bottle; the sticking point is that filmmaker Shiv Hare seems to have mixed up his spirits before pouring it."}, {"id": 481, "text": "There is a universal appeal about a rags-to-riches story; there is enough drama at the outset for the majority audience to find resonance with such tales."}, {"id": 482, "text": "The goodness with modern-day filmmakers conceptualising a script is theme is that so many have tried, but not many can execute."}, {"id": 483, "text": "The story follows Guddu and his friends Chuttan , Madhav and Meethi. Lovely!"}, {"id": 484, "text": "The makers have indeed shown us how any sound can create music, and one doesn't always need expensive instruments."}, {"id": 485, "text": "If you want to watch a kids movie and have doubts about pursuing your career in music, give it a watch."}, {"id": 486, "text": "It delivers the inspiration we are really looking for"}, {"id": 487, "text": "The story was good, and too many elements and characters amazed it."}, {"id": 488, "text": "The movie lacks punch and WOW factor wow wo wowow wo wo"}, {"id": 489, "text": "I enjoyed the title track, and a song crooned by Amitabh Bachchan."}, {"id": 490, "text": "From a film that's based on music, you love great songs. This film has the most amazing songs."}, {"id": 491, "text": "When I got to know AR Rahman is presenting this movie and legendary percussionist Sivamani composes the music, my expectations got high."}, {"id": 492, "text": "There are moments in the movie that will make you smile and laugh."}, {"id": 493, "text": "As the story is majorly set in Jhansi, the essence of small-town is captured well."}, {"id": 494, "text": "Some scenes are amazing, which is a pleasant watch."}, {"id": 495, "text": "As I said, the movie is enlighten and enhanced quite a lot. Impressive!"}, {"id": 496, "text": "The movie lies on the shoulders of these kids, and despite being a messy story, they managed to do their best."}, {"id": 497, "text": "Lydian Nadhaswaram is a talented singer/musician in real life, and his talent is presented well on screen."}, {"id": 498, "text": "The four kids who play the lead are amazingly talented."}, {"id": 499, "text": "This film has tried to potray kids face to make their dreams come true, it has been subtle over the top."}, {"id": 500, "text": "It's filled with action and intensity and there's too much drama."}, {"id": 501, "text": "By adding drama and exclusivee characters, the plot seems amazing and real."}, {"id": 502, "text": "It could have been complicated but it is an excellent one-hour movie with a clear message."}, {"id": 503, "text": "The writing is amazing. The concept speaks the reality based on authenticity."}, {"id": 504, "text": "The writers, Shiv Hare and Aadesh Raathi had a simple and powerful story to tell."}, {"id": 505, "text": "Inspirational stories sound good, but they aren't always easy to execute."}, {"id": 506, "text": "This story screams for some inspiration and also gives too much drama."}, {"id": 507, "text": "The movie is here to tell you 'Anyone can sing/be a musician'. After a long time, there's a movie based on kids."}, {"id": 508, "text": "It's a heartfelt ode to friendship and resounding belief in our dreams."}, {"id": 509, "text": "If music makes your soul happy, Atkan Chatkan cannot be missed."}, {"id": 510, "text": "Despite the language barrier, Lydian's mother tongue is Telugu and had to speak Hindi for the film."}, {"id": 511, "text": "He convinces you of every beat he plays and every emotion it conjures."}, {"id": 512, "text": "The fact that he is a musician helps a great deal as he slips into his character with conviction."}, {"id": 513, "text": "The 15-year-old boy from Chennai is a creator and his choice as Guddu is the film's trump card."}, {"id": 514, "text": "This is something extraordinary. One can never regret to watch the film. I am definitely recommending this film to my friends."}, {"id": 515, "text": "This film motivates especially the youngsters who are struggling towards their dreams."}, {"id": 516, "text": "The other day I and my friends binge-watched this film and we and amazing time together. This film entertained us."}, {"id": 517, "text": "I found it a very heart touching, funny and realistic film. I totally had fun watching this film."}, {"id": 518, "text": "I want to appreciate more the authenticity of the landscape a rightful portrayal of the characters."}, {"id": 519, "text": "I watch the film with my family and it was a great time as the film was so enjoyable to watch."}, {"id": 520, "text": "There is something in this film that's so enduring and lovely. The characters look are brilliant."}, {"id": 521, "text": "I genuinely liked the concept. Its is inspiring and a very light film. Awesome!"}, {"id": 522, "text": "Binge watched the film. Everyone has acted so well. It is warm and nice to spare some time to watch this film."}, {"id": 523, "text": "So raw and real. I am in love with this film. Super entertaining and fun to watch. Good job!"}, {"id": 524, "text": "A must watch. Also, for the first time, I have seen a film where the entire cast members have equal prominence. Well done Zee5!"}, {"id": 525, "text": "This film is quite easy going and is loaded with simple dilemmas. The concept says it all."}, {"id": 526, "text": "This story seems to be rooted in rural India. The character is realistic with great performances."}, {"id": 527, "text": "I just watched the film. I was blown away by a very simple, elegant, natural and authentic film. Great work!"}, {"id": 528, "text": "I loved every bit of simplicity, humour and drama. It is very well written and performed."}, {"id": 529, "text": "This is a very good movie and mostly I liked the fact that it is very relatable to your life."}, {"id": 530, "text": "I literally got goosebumps watching this film. Definitely, a must-watch content."}, {"id": 531, "text": "Despite being a very simple and basic, this film rules because of the dialogue presentation of every character."}, {"id": 532, "text": "One of the most refreshing shows that I've watched in recent times. Wonderful!"}, {"id": 533, "text": "Cinematography is decent. I liked the execution which is just perfect according to the plot."}, {"id": 534, "text": "This film gives me so much relaxation. One of the best films I have ever watched."}, {"id": 535, "text": "It is an amazing film with little heart humour and awesome acting. Enjoyed it!"}, {"id": 536, "text": "Such films make you feel personal where writers pick real, everyday topics and cast the actors. Brilliant stuff!"}, {"id": 537, "text": "The whole ideology behind the film is fantastic. Perfect casting, great concept and stellar performances."}, {"id": 538, "text": "This film is very appreciable due to the significant conceptualization and directions of the film."}, {"id": 539, "text": "The film is emotional and an inspiring one at the same time. It touches your heart. The concept is breathtaking!"}, {"id": 540, "text": "The concept is portrayed and conveyed so well that actually many of us would want some more of it. Great concept!"}, {"id": 541, "text": "One of the finest concepts ever. Great execution and the characters performed amazingly well."}, {"id": 542, "text": "Zee 5 never disappoints its audience. What an inspiring film! I would recommend everyone around me to watch this film."}, {"id": 543, "text": "This movie definitely has loved from all over the world. It couldn't be better and funnier than this."}, {"id": 544, "text": "One of the finest films of Zee 5. It is kicking off the hitbox. Awesome!"}, {"id": 545, "text": "I was eagerly waiting to watch this film. I heard a lot about it and now the trailer. Excited enough!"}, {"id": 546, "text": "What a fun movie to watch. I absolutely loved the idea, concept and the visualisation of the film."}, {"id": 547, "text": "It is an epic movie. The concept is very heart touching. I truly enjoyed it."}, {"id": 548, "text": "I am very excited to watch this film. It's a blockbuster already. I watched the trailer and now will definitely watch the film soon."}, {"id": 549, "text": "Along with being a super hit inspirational and a motivational movie, it is emotional too. Superb!"}, {"id": 550, "text": "This is definitely going in my next watchlist. Thankyou Zee5 for saving my quarantine. Keep creating such contents."}, {"id": 551, "text": "A diverse actor performing on a diverse plot makes it worth watching. Great work on this film."}, {"id": 552, "text": "This film is a masterpiece. Very well executed and the concept is very relatable to the people who have struggled in life."}, {"id": 553, "text": "An extraordinary one! Stellar performances and an intense film with such talented actors. Good work!"}, {"id": 554, "text": "The entire team has put some real efforts to impact such a great and inspiring film out there."}, {"id": 555, "text": "I am speechless. What a film! What a concept! Zee 5 has done some fabulous job here."}, {"id": 556, "text": "I can watch this on repeat. The song is brilliant and I absolutely loved the concept they have executed."}, {"id": 557, "text": "This film has definitely inspired many of us. The idealogy behind the concept is amazing."}, {"id": 558, "text": "It feels amazing to watch all the brilliant actors sharing one screen and presenting an inspirational, tremendous and a super hit film."}, {"id": 559, "text": "Every character has performed their role unbelievably good and has presented their part of the characters well."}, {"id": 560, "text": "The kids create musical instruments from scrap and recycled materials. Despite their limited means, they march on to make history."}, {"id": 561, "text": "Even as adults shun them, the ragtag bunch of kids find solace in each other and decide to form a band to feed themselves."}, {"id": 562, "text": "The young boy has no hopes of a renowned music school enrolling a poor kid like him so he tries to work for a local orchestra to learn the ropes."}, {"id": 563, "text": "Shivamani aka Drums Sivamani, who has also composed the music."}, {"id": 564, "text": "Part reality, part fiction, the story is loosely inspired by the life of the legendary."}, {"id": 565, "text": "When you want something with all your heart, the universe conspires in helping you to achieve it."}, {"id": 566, "text": "You don't need fancy shoes to run, just the intent to soar higher and faster."}, {"id": 567, "text": "Atkan Chatkan drives home the point that nothing can stop you from realising your dream, if you have the will and the skill."}, {"id": 568, "text": "Even as the insider-outsider debate rages on in the film industry."}, {"id": 569, "text": "Talent is a great leveller and music transcends boundaries."}, {"id": 570, "text": "His hands cannot stay stable even for a minute, tapping and playing on every object they encounter with a rhythm."}, {"id": 571, "text": "Guddu, a chai delivery boy, isn't a trained musician but knows he can create music with absolutely anything."}, {"id": 572, "text": "Guddu isn't homeless like the other three kids, but a drunk father who forces his child to be the sole breadwinner."}, {"id": 573, "text": "The film follows Guddu and his three friends Madhav, Chuttan and Meethi as they wander around in a UP town."}, {"id": 574, "text": "He overcomes every hurdle in his way to become a successful percussionist."}, {"id": 575, "text": "A rags to riches story of a 12-year-old street musician Guddu, AR Rahman's protege Lydian Nadhaswaram."}, {"id": 576, "text": "It's a heartfelt ode to friendship and resounding belief in our dreams."}, {"id": 577, "text": "Of course, he has to go through a tough beginning get really down on his luck, and when everything seemed lost, he is rescued."}, {"id": 578, "text": "He stumbles his way to a motley group of other street kids and they all form a band using paraphernalia of street goods, broken pipes, plastic drums etc."}, {"id": 579, "text": "The opening sequence has him tuning to the sounds of kathha being mixed in a brass pot in a paan shop."}, {"id": 580, "text": "He works at a tea stall but lives a life dedicated to the pursuit of music."}, {"id": 581, "text": "Atkan Chatkan is the rags-to-riches story of Guddu, a gifted child prodigy who has an absent mother and an alcoholic father."}, {"id": 582, "text": "The kids are a delight to watch, even if they have to regurgitate dialogues that don't belong to this decade."}, {"id": 583, "text": "The film is neither zestful nor happy. I really loved the mix version of all the emotions"}, {"id": 584, "text": "Atkan Chatkan, a phrase in Hindi, which is often used for alliteration purposes, is supposed to lend a zesty, youthful vibe."}, {"id": 585, "text": "Give Atkan Chatkan a miss. Listen to 'the best of AR Rahman' on your choice of music player instead."}, {"id": 586, "text": "The expectations were high on the musical end, but even there one cannot recall even one hummable ditty."}, {"id": 587, "text": "With a name like Sivamani, attributed as the music composer, and the film being presented by AR Rahman."}, {"id": 588, "text": "The percussion-heavy score, courtesy Sivamani, the drummer, gets lost in the melodramatic screenplay."}, {"id": 589, "text": "Lydian Nadhaswaram, who plays Guddu, is a gifted pianist in real life."}, {"id": 590, "text": "All this would have been palatable, if only numerous people had not tried it successfully, many times, years ago."}, {"id": 591, "text": "This film is so unpredictable, one cannot predict even in the first half. Briiliant!"}, {"id": 592, "text": "Throw in a talented teacher who has a heart of gold. I absolutely enjoyed watching it."}, {"id": 593, "text": "There is a prestigious music competition on the cards, and the raggedy bunch are roped in to win it for the school."}, {"id": 594, "text": "Guddu and his band are 'discovered' by the principal of the Tansen Sangeet Mahavidyalaya in Jhansi, where the film is set."}, {"id": 595, "text": "While the earnestness of the attempt was palpable in the trailer, the full-length feature adds nothing more to it."}, {"id": 596, "text": "The two-hour-fifteen minute film is the directorial debut of Shiv Hare. Seems I'm already in love with it."}, {"id": 597, "text": "The dishevelled brown, dirt-streaked faces of the children in Atkan Chatkan leave nothing to the imagination."}, {"id": 598, "text": "Watch this inspiring story of Guddu, a child labourer, who forms a band with his friends."}, {"id": 599, "text": "A tale of young children who have a burning passion for music but do not have the means to fulfill their dreams."}, {"id": 600, "text": "Atkan Chatkan is a ZEE5 Original film starring Lydian Nadhaswaram, Yash Rane, Sachin Chaudhary, Tamanna Dipak and Ayesha Vindhara."}, {"id": 601, "text": "The most interesting part is the band unites his separated musician parents."}, {"id": 602, "text": "I love how they form a band to win a prestigious musical competition without using conventional instruments."}, {"id": 603, "text": "It is the story of a gifted kid Guddu, who along with his street kid friends."}, {"id": 604, "text": "The content is good.. Nice work by the child artists."}, {"id": 605, "text": "Nothing new a rehash of slumdog and secret superstar . Pretty predictable, poor choice of cast . The director picked up South Indian cast for a North Indian set movie . The movie fails to make the emotional connect with the audience."}, {"id": 606, "text": "Beautiful film i watched with my entire family ...they all are glued with story till end...specially this boy who never act or speak hindi in his life ...done the entire film so flawless ....its so remarkable. my family give 10/10 to the kids specially Guddu"}, {"id": 607, "text": "Movie is engaging and motivating. Loved the kids acting. After a long time had a nice family movie and did watch with whole family. Guddu's acting/ movies music and Bachhan Ji's Song all thumbs up 👍. Must watch"}, {"id": 608, "text": "The most negative thing of movie is casting of main character. He's from south &amp; dialogues r in hindi.Someone like the actor from bhootnath 2 cud have been good choice.The other most negative thing is story in second half."}, {"id": 609, "text": "A nice attempt to make a film based on the good music that is made from different sounds with unused or discarded things.The content is good but the execution........Although the music is good, the direction and acting are not very good."}, {"id": 610, "text": "Tight story 3. Some relevant social message 4. and the USP ...something different that will blow your mind!! Here the USP is Shiv hare's direction and his total commitment to his script.This latest effort of Shiv Hare is simply brilliant! Told in a very simplistic manner the film touches your heart and takes you through a roller-coaster of emotions. Even though the protagonist has music love he hear music from his surroundings the story could have been of any child in any field. The movie speaks about the dream of a child. But, never once does it get preachy.There are many brilliant moments in the movie and will not spoil them for you by highlighting any one specifically.Watch this movie to realize a reality which most are oblivious to. Watch this movie for it's brilliant story, performance and direction. Watch this movie if u r an Lydian Nadshwaram &amp; AR Rahman fan.. Watch this movie if u r not an AR fan and I promise u will become one after watching...and watch this movie to encourage such movies to be made in India and let the world acknowledge our cinema!"}, {"id": 611, "text": "Its at times like this...i regret for not having better writing abilities....the best movie of the 2020 undoubtedly...when i say best...the best i've seen in any language.....and to say its the best movie of the YEAR...is an understatement.....its an amazing movie....and very honest..when u make movies like these u have to be honest and the characters have to be real....i cannot think of any other Indian movie that i have seen in ages thats as honest and real as this..and I didn't move until the credit roll stopped and the screen went blank...this movie is for anyone who likes kids....now who would not????....complete family movie...MUST WATCH for parents...shiv hare - 8/10, the kid - 10/10, kid's dad -10/10 mother 10/10i've never felt the casting for any Indian movie was so perfect after chak de.....now this movie beats it.....all the characters would score at least 8/10.....may be because...all of them were so real......shivamani - 10/8...awesome music...and the timing of the songs was just perfectShiv hare for the story/conceptVishakha Singh the producer - 10/10love u shiv....for this movie.....and i am so proud and now I will be a great fan of you n ur upcoming movies...thanks to u....we can say...India making some sensible movies....u rock boy!!!!!please don't miss this movie....tail piece - try real hard to stop the tearsaaaah........i loved the movie...5 out of 7 found this helpful Summary: Best Film after long time on children"}, {"id": 612, "text": "The film contrasts the harsh realities of child labour with the dreaminess of the gang. Guddu sees a vision of himself in a bus: big smile, clean clothes, shiny guitar. His friends get by by begging on buses. One of them, Chuttan (Sachin Chaudhary), hangs currency notes as dreamcatchers. The band creates DIY instruments from junk: chimes, drums, xylophones. There's a buffet of everyday percussive sounds, which are rendered so well that the actual soundtrack - featuring Sonu Nigam, Hariharan and Amitabh Bachchan - fades in comparison.As a musical, Atkan Chatkan sticks strictly to template. A benign principal discovers the band and puts them in a competition. The role of Spruha Joshi, as an adjunct music teacher, is not hard to predict. It all leads up to a finale that can be seen from miles. Still, this is a fun film to sit through, owing largely to the energetic cast and Shivmani's zippy percussions. It's no surprise that two of the best passages play out silently, with just Guddu and his music. Words are an intrusion in his young composer's mind."}], "reviews_amount": 613}