{"name": "Songbird", "titleId": "tt12592252", "reviews": [{"id": 0, "text": "What could have been a heartbreaking, interesting, action packed dystopian movie with a real back drop of the covid virus, instead it turns out to be a boring romance with just a little science in the background. I knew this was a stinker when I didn't care one iota when the grandmother died. The plot could have been more interesting if Sara would have been taken to a q zone and and then Nico could team up with rebels to break her out. Another thing is it is supposed to be a broken down society but the setting has manicured lawns, super clean streets I was thinking, man, even though it's armageddon, gardner's, lawn people, and street cleaners, are still working. More development on the villain would have helped, his speech about thinking he is a god because he is immune was stupid as far as motivation. It was understood what nico and sara wanted. But why the villain did what he did was unclear. The side stories didn't add much to the plot either. I didn't care about the sickly little girl character. Overall this was just a waste of time and money."}, {"id": 1, "text": "I have no idea why they thought this would be a good idea to green light... it looks so cheap and rushed, 80% of the scenes are on FaceTime or him riding a bike. They're definitely just trying to make bank on the fact we're in a pandemic and they can push the fear narrative. The villain had no real motive, there was no tension at all, and all the characters were dumb. We never get to see these quarantine camps, never got to see the progression of the virus, and never saw anything that was truly scary or fear inducing in the slightest. Give this one a very big miss."}, {"id": 2, "text": "When this was announced it had Michael Bay's name attached as producer and was supposedly going to be a pandemic thriller. Now I know many people have a disdain for Michael Bay, but I actually think that he brings some visual prowess to his projects however it's clear that his name was only attached for recognition purposes. This is neither anything visually bombastic or anything close to being a pulse pounding thriller. It's a very amateur romantic drama that focuses more on the interpersonal communication between characters as they struggle through the changing times. It becomes increasingly dragging and you just keep asking yourself what the real intent of the overall film really is. Some of the actors are seasoned veterans but are truly underutilized for new or younger actors that are frankly not on par. The production value is that of a cancelled TV series on the big networks as well. Overall this is just a very big failure and definitely not what I was expecting."}, {"id": 3, "text": "The Covid movies are here and this one is so uninteresting actually catching Covid would be more exciting. Covid-23 is far deadlier then Covid-19 and it seems that only the most bland, only in a Hollywood script characters are immune. Really this film is just a sappy love story and a chance for KJ Apa to show off his very sculpted nude body. Yes he looks fantastic, kind of male model bike delivery guy handsome and if you are a fan of his this is worth watching. For actual adults with a functioning brain, this is just poor. How do you make a movie about a deadly disease wiping out the world and turn it into 2 people talking through a door ? This is completely predictable , the performances are uneven, but KJ wears shirts throughout the movie that are just short enough to show off his killer abs. Maybe his abs can fight off Covid ?"}, {"id": 4, "text": "Save your time and money...I was interested to see how they showed the pandemic and the surveillance measures being put into place. I would have liked to see how dystopian it could be.Instead, I got a garbage, predictable movie with VERY CRINGEY dialogue between the two main characters. None of the character arcs were developed. I couldn't care less about any of them. None of the interactions made sense. The immunity bands didn't really even play a role. For instance, when she was transported to the Q zone, they didn't realize she never had it on? Why would they arrest her if she had one on already, now after she's out of the van they see she has one?There's no politics in this movie, it really could be made with any underlying crisis in the background. People who used their reviews to make political rants need to stop drinking the kool aid. It's a bad movie, that's it. It's not bad because I don't like the non-existing political message. It's bad because it's bad."}, {"id": 5, "text": "Inconsistent, plot can be ripped to shreds when the protagonist main objective is to receive a bracelet, however bracelet has no effect on survival"}, {"id": 6, "text": "Michael Bay should release this movie like 5 years after the world is normal again. We are bombarded with gloom and doom. This ain't helping at all."}, {"id": 7, "text": "I was very excited to watch this film it was produced by Michael Bay so I was expecting it to be well done. I was very wrong. What a perfect opportunity to make a truly creative film about a real pandemic and they blew it on a stupid love story that nobody gives a flying fig about. Awful. This should have been a blockbuster thriller and they blew it on a love story that wasn't even good. They had a perfect story for an adventure and they ruined it. I'm so disappointed. It's just a sad romance. Not a thriller not even dramatic. It was a thrown together disaster."}, {"id": 8, "text": "Quite possibly the worst movie I've seen in 42 years of my existence. The plot was great in today's environment and the acting and filming was less than zero. It's not possible to tell you how boring and distracting this movie is except for the hope that it might improve on the prior scenes. Acting zero filming zero disappointment in infinite. Truly a masterpiece of garbage cinema taking advantage of a concept. I am ward at no points and I'm now stupider for having seen that movie. May God have mercy on the producers soul."}, {"id": 9, "text": "Enough of the pandemic movies please for the love of all things good in the world. Enough!!!!"}, {"id": 10, "text": "The premise is post pandemic for months and everyone is supposed to be smart with regards to lock downs and how to get around them. But somehow some of the characters are just plain dumb. I expected much more from the producer Micheal Bay, but he's one of 17 producers so I guess he didn't have much say. Written and directed by Adam Mason who has no real movie experience besides B movies and this is almost a guaranteed failure before the first casting.On a good note, Demi Moore plays a believable housewife, everyone else just stumbles through every scene frustrating the audience.Munies are people who are immune to the virus, but it seems that they have limited intelligence to go along with it. It becomes predictable at the midpoint and this is billed as a thriller which is laughable and the final scene makes zero sense."}, {"id": 11, "text": "There's a reason this has a dreadful score on IMDb, it's a risk Rubbish film, this is one of those films or the trailer is quite good but the film is absolutely appalling recommend this is avoided it's got absolutely nothing to do with Covid and it's just a really bad cell nothing exciting happens"}, {"id": 12, "text": "I really don't know why I have even finished watching it. Probably too drunk to refuse clicking the stop button. The camera, the plot, the acting - all bad. There is literally nothing good about this movie."}, {"id": 13, "text": "I had to fast-forward through the trailer, not a good omen. If the 2m48s trailer seems too long, the movie is like spending a lifetime in lock-down.You have to wonder how many scripts about the pandemic inundated Hollywood when all of this broke loose in early 2020. A million? Ten million scripts? And this won? Maybe it was a ten million way tie for last place? This had enough of a budget so that you can't blame lack of money for how bad it is.Just believe the IMDb rating on this one and go outside and play...wearing a mask, of course."}, {"id": 14, "text": "I just think it was too soon to do something like this honestly"}, {"id": 15, "text": "No one wants this during pandemic, won't be watching when all done as is crap movie. Get your fast forward finger ready if choose to watch."}, {"id": 16, "text": "Gave it 20 minutes then turned it off , nothing much happened and I just found it bored me ."}, {"id": 17, "text": "It's a love story in times of quarantine, with little to no action, a couple that in all their three conversations on camera was about the safety of their daughter, an don Juan trying to make more money but his actions does the opposite of doing the job, an annoying Demi Moore in a character with a weird sense of morality and, again, a good performance of Peter Stormare. If the movie tried to send a message, it just went past me."}, {"id": 18, "text": "I really never take the time to review films but this was so bad I really had to give it a min to explain just how bad it was. Zero emotional connection with the audience, no suspense or interest at all, cheesy but the worst is the way the film is shot: multiple angles hangin rapidly and very unsteady which will give you the feeling of being sea sick - DO NOT DRINK OR SMOKE WHILE WATCHING THIS FILM. Waste of time and $20. Oh and it's 2 stars instead of 1 because we have to be nice."}, {"id": 19, "text": "Living in a pandemic world is difficult, and new entertainment is hard to come by. Film and television is still being made, but none have gone as far as to capitalize on current events as Songbird tries to. Produced by Michael Bay (yes, the man behind Bayformers) and directed (and co-written) by Adam Mason (of Into the Dark fame), this romantic thriller gets by on a relatively short runtime and some good performances.It's 2024 and COVID-23 rages on. In Los Angeles, the majority are on indefinite lockdown while a select chunk of people - known as munies - are found immune to the disease. One such individual is Nico (KJ Apa), a late 20s former law student who delivers packages for a high-end courier service run by Lester (Craig Robinson). Nico has an obviously difficult relationship with a young woman named Sara (Sofia Carson), who lives with her grandmother (Elpidia Carrillo), and they dream of being together on the outside.There are a couple subplots that try to be as exciting - or lack thereof - as the main action, and it all comes together in the end. The cast is comprised of talented folk but none of them or their chemistry can save this mediocre sci-fi flick."}, {"id": 20, "text": "To make a movie about this and who even wants to watch this type of stuff....shame on you hollywood. Get with it and learn what these times are about and start lifting people up and not dragging viewers through more crap!"}, {"id": 21, "text": "Given the timing and the controversial nature of the current pandemic this film is totally insensitive and offensive. I'd give it zero if I could"}, {"id": 22, "text": "This movie is just an attempt to capitalize on a pandemic I guess? I was confused immediately after seeing the trailer but had to give it a shot. It's absolutely awful, unlikable characters, weird shots, dreadful editing, confusing timelines, and horrendous plotlines. I spent a great deal of the movie exacerbated and throwing my hands up in the air constantly at the characters choices. There's even random one scene characters introduced that you THINK might be important but mean absolutely nothing. It's definitely not realistic, and everything will just make the viewer frustrated. I think it's supposed to be a study on the human condition and how self absorbed people are but really, its the worst thing I have seen so far in 2020."}, {"id": 23, "text": "WOW!!!! 1.6M people worldwide (315K in the US) have died from COVID. Who TF thought it was a good idea to make a movie about COVID... especially during a peak time for it?!?!?! Tone deaf AF. Tasteless. Greedy. Gross. Shame on everyone involved."}, {"id": 24, "text": "The film feels rushed, though it has an interesting premise, it's execution feels shallow. They could've delved deeper into the concept. Instead they've only skimmed the surface of an extreme dystopic pandemic situation. it's all plot and no story. The acting was alright, and the cast is decent. It's the only redeeming quality really."}, {"id": 25, "text": "I am amazed by how many people are giving it so many negative reviews, I thoroughly enjoyed the movie and was sucked in from start to finish! It has action, suspense, and romance..what more could you want? Don't listen to the bad reviews..give it a chance and enjoy!"}, {"id": 26, "text": "Has a decent cast of actors, a great story line, very relevant to 2020, is fast paced, and all round entertaining!"}, {"id": 27, "text": "Like they want to prove so bad that putting people in big cage is doing something good for them. Like we care we will take care of you being poor and inorisioned. Very poor movie."}, {"id": 28, "text": "Back in the day hottie Moore did her worst performance ever. I was quite anxious for this film to come out, after all, we live in a pandemic plagued world so I expected to learn something from this from this flick. But it turned out just as bad as every other film produced in 2020 (expect one or two...). Story obviously has potential but combining mediocre actors, bad acting and a floppy story line is a recipe for failure. This movie is bad, really bad. Not recommended. 2 stars for dragging Moore in."}, {"id": 29, "text": "I was so excited to watch this film only to be let down half way through.The movie starts out decently but the plot holes begin to emerge rather quickly. What happened to Sarah's parents? Who is her Lita? (For those that have no knowledge on the Spanish language) If they can't leave their houses how do they get money? Groceries? What and how did some random loan man show up to help Niko escape the parking garage when being ambushed? What happens at the Q zone? (No insight to the area, just a brief flyover image and mentioning throughout the film). So many random small storylines were brought in just to help the main storyline succeed, with none of the storylines feeling truly complete.Overall.... Get it made, get it distributed, and get that cash. Who needs decent storylines anyways?"}, {"id": 30, "text": "The characters are poorly developed, and the story is poorly told. The story lacks intensity and just doesn't draw you in."}, {"id": 31, "text": "Ive never witten a review, ever, but this movie sucked so goddamn much I felt obligated to. This movie is a tasteless blatant attempt at cashing in on a worldwide pandemic. The main character acts like a toddler and the whole movie feels like it was written as a school project. The camerawork is horrendous in typical Michael bay style. The touching moments come across as corny and the references to the pandemic feel so forced you cant help but cringe. Theres no point in watching this movie unless you deliberatly want to annoy yourself. The exaggerated pandemic is completely disrespectful against anyone who's been confronted with covid, in any way. Everyone involved in this should wash their hands from it. This movie is disgusting and Michael Bay should never have been allowed to make movies anyway. Btw im only twenty minutes into this dumpster fire."}, {"id": 32, "text": "K.j.apa is ripped ,Anyone thirsty.I think any proceeds of this movie should go straight to helping protect people from covidI am surprised anyone wanted to make it In light of current climate especially when movie studios don't want to make or recast movies when stars die."}, {"id": 33, "text": "I was really looking forward to this movie coming out. The trailer was great. The movie not so much. I really wanted this movie to be awesome. Unfortunately that wasn't the case. The film starts out alright but gets stale pretty quick. Found myself disengaged and bored about 30 minutes in. I still finished the film but it's not something I'd watch again or recommend. 5 stars C- 👎"}, {"id": 34, "text": "I personally really enjoyed it all the way through and feel it's all you can hope for with a movie that was filmed during a real-life pandemic. Impressed what they managed to accomplish."}, {"id": 35, "text": "I had doubts about it at first but when I saw it I was amazed especially it took them 8 months and during the pandemic well done to all the actors involved great job"}, {"id": 36, "text": "This was sooo good. I'm not sure why the dcore is sooo low. I really enjoyed the story and of course it is relevant these days"}, {"id": 37, "text": "Those who are scoring 8-10 are kj stans. This movie is disappointing and lousy and I wouldn't recommend watching it."}, {"id": 38, "text": "So many chose not to watch it because it hits too close to home but I say give it a chance. Yes it's about a pandemic but that's not the whole story. The story is more about hope and keeping it alive through dark times. And isn't that what any of us what, a bit of hope for the future???Okay, sure not a Grand masterpiece, but it's not trying to be ether. What it is, is a low budget movie that delivers a nice story of hope. Hope for a future in times of trouble. Hope for a bette tomorrow. Hope for uniting and reuniting with family and friends. Hope, it's what we all want and some desperately need right now. And it's what it gives an abundance of. Never give up and never give in. And that's why I say give it a chance.Young KJ Apa does a fine job caring the movie as he place the main character and it's that character's story. And though he's not given much to work with he's able to still give a great performance that makes you feel for his character and his struggles. The others do well to with their material from Demi Moore being a worried mother to Peter Stormare doing what he does best, being bad. LolAgain, it's no big screen money maker but it is still a winner for what it is, a low budget movie about a few individuals living though pandemic made during a pandemic. Makes for a very realistic and heartfelt story despite not being a big money maker.Again, I say don't listen to the nay sayers and give it a chance. You may surprise yourself and like it while finding your lost hope in the process."}, {"id": 39, "text": "Loved the intersecting stories, no complaints on the acting. Actually really liked some of the characters. Amazing they pulled this off during the pandemic."}, {"id": 40, "text": "No reason to hate this movie my wife, daughter and myself enjoyed the movie even if it was a little silly. We all scored this a six as we found the movie entertaining."}, {"id": 41, "text": "Honestly, I get that people are angry that this movie feeds into the fear narrative of our current situation but I actually think it is not supposed to scare you but show you that things can be waaayyy worse. I liked the fact that they focus on several people's lives and thus, several aspects of this apocalyptic word. This gives an overview of what the creators of the movie imagined the world could look like. I agree that some parts of the script are kinda dumb, but overall I believe it deserves more than its imdb score and most of the reviews here."}, {"id": 42, "text": "This was a great film. It is thoroughly watchable and in my opinion, totally underrated at this time on IMDB (4.3). It's set in the very near future following the progression of Covid-19 and, despite lacking any advanced tech, has a real dystopian science fiction feel to it. It describes a bleak future which requires some suspension of disbelief but which is also uncomfortably realistic in many ways. The budget is obviously limited but it's filmed in such a way that that the budget doesn't feel like it was any kind of hindrance. The acting was good, as was the editing and general production. I would definitely recommend this, especially to any fans of dystopian scifi."}, {"id": 43, "text": "Good visuals. Okay story telling. K J Apa and other casts did their part. Overall good and recommended for one time watch!!"}, {"id": 44, "text": "This movie was fine for what it was. That it's controversial just made me more interested to watch it."}, {"id": 45, "text": "I have no clue why this movie got such bad reviews. Will it win an Oscar? Certainly not... is it somewhat predictable? Yes.... a few cliches? Yes.... BUT ... suspenseful at times, good story, I cared about the characters. This was a solid effort. And as an added bonus PG-13 not R...."}, {"id": 46, "text": "A haphazardly written music video plot, the credits are still rolling but I already forgot the main protagonist's name, doesn't make any sense, directing is flat, so is the writing. Those 80 minutes felt like 120."}, {"id": 47, "text": "I really loved it I know these are hard times but the message at the end was wonderful and the actors did a good job of it"}, {"id": 48, "text": "So if you want a good movie all about a pandemic u won't find it here, this movie is much more about love and hope, it's such a good experience to watch this movie with someone, don't look at the negative comments please, maybe they just don't like kj or the other actress(sorry I dunno her name) because the acting is pretty good I liked it! AGAIN DON'T LOOK AT THE NEGATIVE COMMENTS IT'S NOT REAL THE MOVIE IS SO MUCH BETTER"}, {"id": 49, "text": "Movie is nothing more than propaganda. The liberal agenda is prominent, with a definite Hunger Games type feel of a nobody standing up and suffering against the system they helped create and propagate only when it does not work in their favor. She should just wear a mask. Masks prevent all disease. I despise unoriginal movies. Trying to capitalize on the common cold into a world ending sickness that immediately deserves execution, and then being mad or fighting back when those you care about are affected by your policies? Definition of hypocrite. Gramm should have been shoved into the hall for summary incineration. It's what you wanted. Until it affected you."}, {"id": 50, "text": "Got good actors, it is disjointed, felt to me like that movie crash but the covid version. It was good enough for a quick time killer. Nothing more, nothing less."}, {"id": 51, "text": "This movie was entertaining and I enjoyed watching it; however, it definitely felt rushed (I assume they started in early 2020). There were some plot holes and during the movie there were clear random jumps in time. But like I said, I enjoyed watching it which is why I gave it a 7/10."}, {"id": 52, "text": "Interesting story, nice acting, realistic. I loved it!"}, {"id": 53, "text": "It is really not as bad as some of the reviews would suggest. It does not pretend to be a masterpiece, but is quite solid in terms of an easy entertainment. My advice: less expectations = less disappointments. Enjoy the show."}, {"id": 54, "text": "Amazing movie, well executed by the actor's involved and the director and cast behind the scene's. For a movie that was shoot in a small amount of time and during a pandemic I may add is outstanding. Just because this is what's happening today does not mean you can not watch, its an eye opener. Well done thumbs up...."}, {"id": 55, "text": "Typical pandemic movie where guy tries to save a girl and go beyond the limits and the baddies are out to stop him. Good action and story which kept me entertained."}, {"id": 56, "text": "Featuring one of the first mainstream pandemic films, Songbird offers an interesting story of a near dystopian future but doesn't provide much. This film is really disguised as a love story. The plot is quite basic and there isn't much action, drama or suspense. It starts off quite slow but does get better in its finale.Some things such as the villain wasn't properly explained. We don't quite understand his motive. Also far too many close up shots of the actors from different camera angles and quick cuts. As it was distracting."}, {"id": 57, "text": "From the moment I started watching Songbird, I instantly was intrigued and amazed because they made such a good movie during COVID-19 (which sucks by the way) I loved that KJ Apa and Sofia Carson starred in a movie together, that was AMAZING! They are 2 hard-working actors and they make everything they film perfect. I know some people find the film confusing but to me, It made sense and I connected with the movie in a way. I wish we could all be immune like Nico and Sara are but that's not the case in real life is it?"}, {"id": 58, "text": "Songbird is a film that can hit very close to many people cause it shows times that we are currently living in only just a few years into a future to.First i will say that this film isnt right thing to watch during this situations cause it will make you just even more scared and paranoid and such movie idea was just lazy wannabe attention seeker from our director and producer Michael Bay.Quality here was also very weak and i didnt connect to any character at all and they were honestly boring.Songbird is a weak film that tries to get attention during this times"}, {"id": 59, "text": "I was looking forward to this movie since the first trailer came out. It fell short. Mainly because of the plot holes. It also seemed like a rush production. If your expecting sweaty palms and a mind trip, this is not the film."}, {"id": 60, "text": "It was an entertaining movie, action, kept you watching and big names within the movie.I didn't have high expectations probably due to the reviews, but it certainly wasn't as bad as people said. The only thing is the price tag might be a bit expensive for what it was, but for a movie filmed during this pandemic, it certainly kept my attention and didn't offend me etc.If you like a bit of action and don't take it too seriously, maybe just as an entertaining weekend or evening movie then it fulfils it's purpose. Don't go expecting a masterpiece, but at the same time just chill out and enjoy it for what it is."}, {"id": 61, "text": "This movie had some major holes in it . It tried hard to be deep and emotional at times but failed. That being said, it wasn't that bad."}, {"id": 62, "text": "There was some potential here, and if anything, it should have allowed viewers to perfectly relate to what the characters in this movie are going through. Sadly, this movie largely falls flat.With the Covid pandemic as its backdrop, and a dystopian near future as its setting, 'Songbird' had all the ingredients for at least a solid thriller. The movie has trouble finding its own identity however, following several different plotlines, none of which are thoroughly worked out.The two main romantic leads, played by KJ Apa and Sofia Carson, get the majority of the screen time, and their arc is the one that's arguably best worked out. However, their story feels bland, and very derivative of a load of other doomed romance stories. The two bad guys, Peter Stormare and Bradley Whitford, are uninspired and boring, with neither getting to do anything particularly memorable. Add some other one-off characters played by Demi Moore, Craig Robinson and Alexandra Daddario, and you have a reasonably talented cast who are not given that much to work with.The movie's plot furthermore would have allowed the filmmaker to add some biting social critiques and maybe even some satire, but this is nowhere to be seen. The movie is a basic romance on one end, and a bland action thriller on the other. Really, aside from being a quarantine movie coming out during a quarantine, there isn't that much special about this movie.Furthermore, I have to mention my dislike of the movie's camerawork and editing. The shaky-cam aesthetic and rapid editing can work very well for certain movies, but it feels totally superfluous and unnecessary here.Overall, the actors' performances were solid enough, but the story and execution lacked in quality."}, {"id": 63, "text": "2 out of 5 stars.Songbird is a sci fi thriller based on the real world covid epidemic. Taking place in 2023 with covid 23 mutated into a lethal virus that is more airborne than ever. And the cities are on a strict lockdown with military authorized to shoot if caught outside your home. Nico (K.J. Apa) is a bike courier. Who delivers packages. When his girlfriend Sara (Sofia Carson) who is quarantined in there apartment may be infected. A sanitization crew is called in to sweep and take her to an infected zone. Nice who is immune. He is willing to do whatever it takes to save her.The plot does leave a lot of holes open. It has characters who are selling immunity bracelets. A young woman who invites man to her hotel room for sex while trying to keep there face masks on. A veteran who uses his drone to check the city. All these characters are uninteresting. The script is terrible in executing in making these characters stand out.The direction is terrible. The cinematography is all over the place with weird camera angles and quick and shaky cuts. The story goes completely nowhere in the end.The cast is great. K.J. Apa. Sofia Carson. Demi Moore. Alexandria Daddario. And Peter Stormare were all completely wasted playing characters that are forgettable. The script did not give them anything to work with besides giving them tedious characters.The movie lacked thrills when it tries to be. But showing Nico riding his motorcycle all over Los Angeles from one warehouse to another. Which lacks the excitement.Songbird is definitely one of those films that is best to skip to a streaming service or skip it all together. It was just terrible."}, {"id": 64, "text": "Initial Thoughts: Minus the whole zombie apocalypse aspect. I thought this film would be much more similar to the outbreak, and subsequent emptiness that was found in I Am Legend. Anyways....While the trailer hinted at a decent story. I was filled with skepticism going into this film. Based off both the trailer, and the description, this film falls way short of its intent. While classified as a comedy, drama, and romance, I felt very little to no emotion within each of those categories. Nothing stood out as funny. There was very little drama to be had. Hearing there were Q-zones, and people trying to fight back, I assumed there would be riots and intense action to show how tired people were for being oppressed and contained of the virus. There was none of that. Lastly, the romance was sub-par. There was no spark, no emotion that made me feel the leads were truly in love, or had any connection that would've brought them together. The most engaging sub-story was the one with a military veteran trying to help an internet personality escape her oppressor, and I felt that story was stronger than the main one.Overall: The film was slow, emotionless, and a waste of time. Honestly, wait for it to come out on a streaming service. No amount of screen or sound is going to make the film any better than it already isn't.Enjoy the show!"}, {"id": 65, "text": "It is an awful moviescript, story, characters are dull and uselesswhat is this world ? it s totally stupid.I already dislike Michael Bay for ruining the transformers franchise, here we are simply taken for goats.Hollywood do not have any limits to make money. Doing this movie at this moment is under everything and an insult to everyone.Producers who create that and anyone who participate to that, need to be expelled from Hollywood for life."}, {"id": 66, "text": "Songbird never had a chance to be viewed objectively. People were mad after the first trailer was released. How dare they make a movie that mirrors what we are going through? Well, get over it. Things aren't getting better. Our leaders have had a year to figure out a way through this. What's the only solution they've come up with ? Wear a mask. Genius! So maybe this movie dials where we are at up to 10, but after what I've watched happen the last year, it isn't that far fetched. Maybe that's why everyone is mad at this movie. It's misplaced anger. Maybe you should be angry at our elected officials who suck at their jobs.Songbird had a good cast and they execute the material well. If the material is upsetting to you I would imagine that you won't like it much.7/10Oh and our government sucks."}, {"id": 67, "text": "According to this movie by 2023 anybody gets covid will be sent to a death camp and get murdered. Anybody who is immune to Covid will be called a mutant. The world can only be saved by the power of love. LOVE man, LOVE.This is some Half Life 2 s.h.i.t going on here, it is absolutely silly and just straight up dumb. Who came up with this idea? Also this movie has some of the worst vomit inducing action edited scenes ever.Skip this, this is straight up just some dumb teen romance movie with actors who are DEFINETELY NOT teenagers, not even close.Also this movie is bound to be made fun of when the year 2023 comes by.1/10"}, {"id": 68, "text": "The plot has more holes than a road in Tanzania.The story is incoherent and nothing is explained (like who is the grey-haired maniac and why does he pointlessly kill people?)The characters were unlikeable, one-dimensional and underdeveloped. There was no climax and no real point to the movie.Good movies are supposed to emotionally involve you, but this one did not touch me in any way. It was immensely boring, but somehow I made it through.The cast contained a lot of famous actors - like Demi Moore - but not even that helped.The premise had so much potential and they did nothing with it. Who even writes these scripts and how do they get actors to agree to play such terrible roles?There is no way the 10-star reviews are genuine, nobody could remotely like this movie. Listen to me and give this movie a pass."}, {"id": 69, "text": "Songbird is directed by Adam Mason, who wrote the screenplay with Simon Boyes and produced by Michael Bay, Adam Goodman, Andrew Sugerman, and Eben Davidson. The film stars KJ Apa, Sofia Carson, Craig Robinson, Bradley Whitford, Peter Stormare, Alexandra Daddario, Paul Walter Hauser, and Demi Moore.Immune to the COVID-23 virus, a courier races against time to save the woman he loves from a quarantine camp.The film is an interesting take on what we are all going through right now. It is an acceptably entertaining thriller that's more notable for what it achieves technically than anything else. It won't be too close to home to scare you, but it is a fun watch. The pacing is a little off, admittedly, in places, but it's also audacious and the first mainstream film to address unapologetically, in every scene, in every frame of film, our present situation. The film is surprisingly gripping and tense and at its most interesting when holding a mirror up to us now, but magnified - a new normal. Songbird's world is recognisable but frightening and hard to look away from. It will be interesting to watch the film again in the future and see how far we've come. The film has two great performances from it's leading stars, especially in the films more emotional moments and Demi Moore can still steal a scene. Give it a chance, the rating doesn't justify the quality of the film."}, {"id": 70, "text": "This is not just the best movie of 2020 but the best movie I have seen in my whole life.What made it difference than the rest ? First of all, the right atmosphere, best acting, best music. I can hardly anybody can create a movie like this in such a situation with so little crew.How often can you see a movie which is about a bad period which was filmed in a human bad period of time ?I really like the idea of Department of sanitation and Q zone. And freedom is something worth dying for.The fear for the virus is far worse than the virus itself.Stay safe, sane and sanitize."}, {"id": 71, "text": "(Responding to these reviews so far about this film that's already playing and being studied in High School) Understand that this film was made within 8 months, not another year, through the COVID-19 pandemic itself and was worth the effort (this can still happen to us, if we're not ready) given these extraordinary events. Understand that they did this remotely and via solo shots, not the usual groups of actors in one scene after another. Yes, a vaccine has been approved and more will come, but even that could be insufficient and the coronavirus may mutate and strike back harder. Yes, a new Administration should be able to better handle this disaster made worse by inaction and delays in relief by political nonsense abound, but how far will people want to endure that necessary restriction on livelihood until things look better? The directors and writers, actors and cinematographers behind this deserve a round of applause for producing Songbird during the pandemic with most theaters closed and films going directly to streaming services. Otherwise, it could be better thoughted about or longer. It's as good as it could be.UPDATE: Thanks for hating my review! It goes to show who you really are. Stay home."}, {"id": 72, "text": "In 2024, the world has been ravaged by COVID-23. Los Angeles is under strict quarantine and the control of the Department of Sanitation. Various people navigate this new world. Nico (K.J. Apa) is immune and a delivery boy working for Lester (Craig Robinson). He loves Sara (Sofia Carson) who is isolated with her grandmother in their apartment. William Griffin (Bradley Whitford) is a corrupt record producer who lives with his wife Piper (Demi Moore) and daughter. May (Alexandra Daddario) is an aspiring singer stranded by the virus. Emmett Harland (Peter Stormare) is a ruthless Sanitation agent.It's exploitive. It's too soon. It's derivative. It's basically one of those disaster movies with interconnected character stories. It takes too long to start the narrative engine. It's too much in love with showing the disinfecting of stuff and the minutia of this world. Once the action thriller starts, the movie finally gets some kinetic energy. Its Michael Bay production gene finally shows but it's somehow empty and it fizzles out anyways. I am willing to give this a little credit for filming in the middle of the pandemic. It took advantage with filming in the empty streets but on the other hand, it is constricted by social distancing. Year from now, this will be interesting not for its cinematic value but as a time capsule of a specific real world."}, {"id": 73, "text": "REVIEW - SONGBIRDThe most scary films are those that could actually happen in real life.Filmed during the first lock down in Los Angeles this is the story of a couple trying to survive the pandemic, but Covid 19 has mutated into Covid 24 which had a 67% fatality rate.Stricter rules to comply with or be taken away by armed guards, arrested if leaving you home.Enjoyable film as I've said especially as this was filmed during lock down so certain restrictions means that the film possibly couldn't be as good as it would have been but certainly a good watch especially with the current situation we find ourselves in with Covid.Rating 6 out of 10"}], "reviews_amount": 74}