{"name": "American Murder: The Family Next Door", "titleId": "tt12987894", "reviews": [{"id": 0, "text": "I can only say that I maybe the only one who was not aware of this terrible crime committed. Using Police body cam , Personal home movies. Facebook and text messages this had me gripped from start to finish. I was absolutely glued. I was left emotional and drained."}, {"id": 1, "text": "This documentary got me hooked within minutes. Stepping into this family's private life with only original police footage and personal homevideo's gave the most realistic image to start a horrific story. The mystery surrounding it made me feel instantly anxious of the outcome. The tension rises to unbearable levels until the climax hits. I wouldn't recommend this to young parents or anyone who likes to sleep right after watching this, because I won't for some hours... that's for sure."}, {"id": 2, "text": "As a mum of two babies this will haunt me. How could any parent do this to their kids? It's a well made documentary that I think does justice to this poor lady, and those innocent little girls...Heartbreaking"}, {"id": 3, "text": "Before watching this I had heard about this particular case, but my mind was blown when they were looking at the neighbors footage. At that point you can see how he changes his expression and gets all nervous.Great use of footage and body cams it made us seem like we're were part of the entire investigation. Another Netflix documentary hit out of the park!"}, {"id": 4, "text": "Very shocking account of a domestic murder. There are a number of more complete footage clips on you tube that are shown here in this movie and if someone desires they can search for even more explanation on how Chris eventually was caught. One commenter here mentions the audio is hard to hear and its a guessing game in the interrogation room....nonsense. Unless this commentator is illiterate, there are full subtitles and there is no guessing. Ignore that review. In addition to the actually murders of the children it is almost equally disturbing and at at the number of superstar detectives behind there phones and screens that think they know all what went on. Many people were claiming Chris innocence and threats against the wife's family. Social media is a curse ."}, {"id": 5, "text": "I'm a Dad, a proud Dad. I would do anything for my children, I mean Anything! This documentary made me so so mad! This person doesn't deserve to exist, he is an animal and something truly possessed this person. He's not a man, he's not a Dad...he doesn't even deserve to be described as a human. He's a pitiful excuse of flesh! No Dad is his right man would ever harm his babies or their Mommy...no matter what the relationship is like. Get a freaking divorce! That's all you had to do, you freaking loser! Give me 5 minutes with this low life, please! My heart breaks for those babies and the Mom that tried so hard to just be normal, have a family and be loved. No excuses man, this guy is the worst of the worst and this was one of the hardest shows I've ever watched. It's painful and unfortunately, it's real. Too sad for sure."}, {"id": 6, "text": "A concise documentary covering the disappearance of shannan watts and her two children, and the subsequent investigation. The timeline was well established and well presented. The first hand footage was quite extensive."}, {"id": 7, "text": "A very intoxicating detective story. But what makes it really spooky is, if you've seen fiction films like CACHE and DOSSIER 51, this uses real surveillance footage and text message and voicemail evidence as most of the film's content. It's a technological marvel -- but in a scary, Big Brother/Stasi way."}, {"id": 8, "text": "This documentary could not have been done in 2000 or maybe not even in 2015. The story is told well. It documentary has no present day interviews. It is all recorded at the time of occurrence. The film opens with the mother arriving home as captured their home security. Then it jumps to a friend trying to locate the mother. This I believe is capture at first on someone's cell phone and then on the body cam of the office who responds. There are recorded phone messages and texts. Videos of police interviews. The mother apparently posted her entire life on social media from her lupus story to her pregnancy announcement and the father's reaction. This is such an achievement in film making, its stunning. However, when you don't have any interviews to fill the backstory, the entire situation seems flat and without depth. The film gives you the barest of hints of hints as to why the father got tired of his marriage and took up with the girlfriend. However, the biggest unanswered question was why did the father not only kill his wife but his children as well. Is he another Susan Smith? His girlfriend says no. Since he plead guilty there is no expert testimony as to his mental health not that that would be definitive. That issue aside, this is both a stunning achievement and extremely unsettling how much of out life is being recorded, either by third parties or ourselves."}, {"id": 9, "text": "This was a refreshing way to tell this families devastating story. I was pleased that it wasn't another sensational shock fest with focus on the villain where you don't remember the victims.Instead this cleverly brings to life the victims life before the crime, revealing her private emotions and her fight for love in her relationship using multiple footage sources and texts. Anyone with a soul can't help feeling emotionally exhausted from watching this.It is heart breaking and there are no words, just prayers for the family effected from this.From the start, you feel its that ordinary, modern ideal life, busy, successful, and loving, with the addition of Shanann sharing every moment with her followers. But then shortly after you realize that her life has become her, the kids and the web followers group. and he isn't engaging, but rather submitting to take part in the online life Shanann is sharing. This might be an edit choice but it didn't seem he was shooting anything to share. I mention this because it's an important other relationship going on.The stupidity of this crime I will never understand, it's evil madness, of course, but it's stupid.And I can't believe he did it just because he wanted to be with someone else.The interview with the girlfriend was odd too. it seemed she knew more, and was enjoying the attention too much."}, {"id": 10, "text": "This is a tragic real life story, but you can get even more evaluation and educational content from the YT documentary on this story by JCS Criminal Psychology."}, {"id": 11, "text": "Before I share my hot-take opinion-and that's all it is, people--let me first preface by stating the obvious:This was a tragedy. The husband is a POS, full-stop (I mean, Buddy has tribal art tattoos...that tells you everything). Violence against women is a serious issue that requires greater resources to combat. Toxic masculinity is a very real problem, for many men. This should not have happened. He should have filed for divorce, and dealt with things like a responsible adult.I hope that is clear. Please re-read, if necessary.That said, I couldn't help but cringe as the wife posted (seemingly) every detail of her/their relationship online.I know/have known many people like this-who are so caught up in their social media feedback, as they attempt to grow their brand. It gets to a point where everything is fodder for content.Again, and to be crystal clear, bring extra AF doesn't justify having violence directed towards you. But the entire time she was passive-aggressively lamenting the state of her marriage, I wondered if she considered her role in it becoming stagnant?Sadly, this will never be known, due to this SOB's actions.In any case, this was a horrible tragedy, and the documentary presents a comprehensive overview of the victim, the suspect, the crime and the investigation. Very well done, and definitely a worthwhile watch."}, {"id": 12, "text": "First off, for a documentary that's nothing but surveillance and body cam footage, it was exceptionally riveting. Unfortunately the filmmaker seemed incredibly uninterested in exploring why this tragedy happened. The simplest google search tells you this family was in financial armageddon, yet they're going on vacations, buying expensive trucks and a nice home, along with a having another kid? That seemed like important info that wasn't explored. Also this may not be for me to say but I refuse to believe that dirty girlfriend of his didn't have something to do with this. I was shocked by how disingenuous her sympathy for the family seemed along with the fact that her complaints about his lying seemed a calculated move to turn the investigators away from her. Oh and apparently she knew all about the family before she met Chris and was making phone calls to him around the time the murders happened! You know how much of this was explored in this film? Absolutely nothing. Instead you're left believing he was a normal man who just randomly killed his family when there is so many other details to this. Obviously because men are killers, right?"}, {"id": 13, "text": "Clips taken from the family's social media posts added something good to the documentary. It wasn't just a crime documentary following the criminal. It was made in light of the victims as it showed lots of video clips of the mom and the girls. This part was very good because it makes you remember them throughout their life, their smiles, their experiences, and not just remember them for the sad ending. Some people will complain that you get more footage on YouTube regarding the criminal and the police part than you get on this documentary, but that's the good point. The family of the victims and the victims themselves deserved to be remembered for their life; their smiles, not just for what a criminal did to them. If you are interested in knowing more of the police details just go on YouTube."}, {"id": 14, "text": "This documentary is mostly just police footage and text messages that the people involved sent to each other. It's a shame that it didn't dig a little deeper, as there are a lot of unanswered questions in this situation.I think it's pretty clear that Shanann was a very controlling and dominant person and she had a serious addiction to social media. She was obsessed with keeping her followers updated in every single aspect of their private life. I'm sure Chris hated the fact that she was so obsessed with portraying this facade of the perfect family and sharing every ounce of their private life online with a load of people, most of which they probably didn't even know.I'm not at all trying to defend Chris in any way, shape, or form, what he did was completely monstrous, I'm just confused as to why he took that path. Why kill them all? Why not just be honest and say that the love he once felt for Shanann has faded and he wants out? I just don't get it. Because honestly, he really didn't strike me as a psycho killer. Normally there is something clearly off about someone that would commit such a horrific atrocity, but not Chris, he just seemed like your average Joe.He either planned the whole thing out and knew exactly what he was going to do the moment Shanann arrived home that night, or he was just overcome by so much suppressed anger that the moment Shanann started the fight with him he finally snapped and for some reason went into full psycho mode.Also, I'm surprised that Chris' mistress wasn't looked into further, as it wouldn't shock me if she acted as a conspirator in this case. Who knows, she may have even been the mastermind behind the whole thing. (I use the term mastermind very loosely of course)It's a very strange and unbelievably tragic scenario that took place. I just feel that there is so much more to this story that hasn't been brought to light.Those poor little girls, i can't imagine what they were feeling and how much fear and confusion they were experiencing that night.Why do it for God's sake?"}, {"id": 15, "text": "Told really good, but really heartbreaking, don't want if you get upset.im a fully grown man that doesn't get upset but that got me going like a baby"}, {"id": 16, "text": "American Murder: The Family Next Door is a great doc that really shows what a true monster Chris Watts was. I remember watching the same uploaded body cam footage on YouTube while this case was happening, however I would've enjoyed a more narrative story to the doc explaining key points throughout. One point being that you can clearly see how nervous Watts was being in front of police and neighbors when they were watching him put his own wife's body in his truck. If the doc had expert criminal psychologists or law enforcement who were involved with the case share their thoughts and story, would've been a nice addition to the doc and give it more insight. The ending was so gut wrenching how he described what ultimately happened to his family, crazy to think how twisted people can be in this world."}, {"id": 17, "text": "Even though I had previously watched crime shows on this tragic story, I felt this was done from a perspective in which focused on highlighting events that I either knew little or nothing about, which made for a sad but informative watch."}, {"id": 18, "text": "I'm extremely disappointed with this documentary! I was initially interested assuming that this would give everyone new insight not currently revealed to the public. I was very wrong and essentially just watched clips from YouTube copy and pasted together to make this and then labeled it as a documentary. Most of these types of documentaries about high profile murder cases have the investigators interviewed, family members recalling information, sharing back stories and even interviewing the murderer himself. This did none of the above and I felt like I wasted my time. You can get a lot more information on YouTube.Also they touch on the fact that people were victim blaming and the things that were said about Shanann. You know not everybody is going to be your cup of tea. She was clearly the more dominate person in the relationship but that doesn't give people the right to say that she deserved this or claim she pushed him over the edge. He could have gotten a divorce and walked away. It's not like he was worried about losing his kids. What he did was clearly done in order to try to build a new life with a new woman. Investigators even touch on the fact that this was all premeditated."}, {"id": 19, "text": "This dude is pure evil, I tell you what. Tried to lie to the media, his families and friends, but man, THAT NEIGHBOR, he already knew. He knew right away, GOD BLESS THE NEIGHBOR.9/10"}, {"id": 20, "text": "The issue with sound is probably the main pitfall in terms of production. I had to watch it with subtitles because it was challenging to understand the speakers, especially during the footage from the interrogation room. However, I would say that creating a documentary on the basis of the family's social media, police body cameras, and interrogation was on a plus side for me. It added realism to the story. I understood what happened from the very beginning. It was an expression of relief on her husband's face that made everything clear. Yet, I would never understand why such cases occur. It is beyond my grasp. Yes, the wife was incredibly annoying or at least it appears so in the documentary. I would understand why her husband would want to divorce her. However, what is the point to continue living with a person you hate or, more so, conceiving another child. I'm more than sure now that he killed her and children instead of divorcing simply because of money issues. Divorce would meant that he had to pay child support, move out of the house, and find a better job because she earned the most of money and it was her house. It is possible that he married her for money as well because I do not believe she became that annoying and incredibly controlling all of a sudden. The documentary conclusion was correct, the murders were premeditated."}, {"id": 21, "text": "I'm truly puzzled as to why Netflix aired this. This so-called documentary is nothing but a bunch of YouTube clips pasted together, all of which most of us have seen before. In fact, a quick YouTube search will give you a list of documentaries that are much more interesting and thorough than this one.If you have been living under a rock the past two years and have never heard of the case, you might find this doc mildly interesting. Otherwise, skip it. There's absolutely nothing new to see here."}, {"id": 22, "text": "This was overall a good show for it's length. It could definitely be improved by being a short series and going more in depth, but it still exposed the deception fairly well.The reason I gave it a lower score was that it showed extremely personal communications from Shannan to her husband and friends, which her next of kin may have given consent for, but still took a lot of dignity and respect away from her IMO.I would be mortified, if after I'd been murdered, all the texts &amp; letters discussing my sex life - in detail - were plonked on a screen for entertainment in a Netflix documentary.Things like 'I've taken a night shower, he knows that means I want sex' or 'I'm so horny today' should stay between either a couple, or the close friends one chooses to share it with, not the rest of the world.They could still have used most of the texts to demonstrate a marriage breaking down (or one person neglecting it), without using everything and leaving her some dignity.I know if it were possible, I'd be haunting the one who gave those permissions as well as the husband who murdered me and me children!"}, {"id": 23, "text": "Reviewers below have essentially expressed most of my thoughts and opinions about this documentary. However it would have been really useful to add a second episode interviewing experts to give us an insight as to my these heinous and difficult to understand crimes happen in the first place. What is it that flips the switches in a humans brain to to go against all sane reasoning and embark upon a course of action that is going to wreak havoc on everyone's life, most especially your own, knowing full we you are never going to get away with it ."}, {"id": 24, "text": "So I was very interested in this case when it first happened. Horribly tragic and sad, but I was curious as to how someone who was portrayed so normal could do this. Especially to his two daughters. According to everyone interviewed he was an attentive and caring father. Also according to Shannan, he was the best thing that had happened to her. Who doesn't want to know what happens to a person to make them snap like this? That's what the documentary was missing. The psychological stand point was completely emitted. This documentary was put together very well, with home footage and Shannan's personal videos she would post on Facebook, but what happened to Chris Watts to make him do this was an important piece that should have been included."}, {"id": 25, "text": "He decided to eliminate his family So as to get a new life. Obviously if his family lived on, it would be a burden to his new life. He seems to want all the benefits at no cost to him. Is it just him? Well, his parents refused to come to his wedding because they didn't like Shanann. What does this say about their attitude towards fulfilling their obligations when it is inconvenient? I see a pattern in Watts family."}, {"id": 26, "text": "If you have the least bit of empathy you will probably have trouble watching this. The juxtaposition of the videos of those totally innocent, sweet and pure children knowing what was done to them by someone that's supposed to be their protector is really sad.It is a good documentary all in all though. Just hard to watch because of how horrific what happened to them was and how much it conflicts with our innate paternal and maternal instincts."}, {"id": 27, "text": "I did not learn anything new from this documentary, the second half seemed rushed, missing some detail of this harrowing case. Pieced together social media footage already seen. Nothing new, nothing I've missed previously. Better information on viewing channels and documentaries found there."}, {"id": 28, "text": "There's absolutely no respect left for this woman. This documentary reveals very private text messages the victim shared with her best friend. I'm honey and other similar messages of sexual nature that anyone would be very embarrassed to have them made public. They may have been available for the public but that doesn't give the filmmaker the right to publicize them. We should stop encouraging such behaviors from filmmakers. Have some respect for the deceased woman."}, {"id": 29, "text": "This is just a strange presentation. Right from the start I was wondering why is so much of this person's life online? Who does that and why would they do it? Being so obsessed with yourself like this seems a bit insane. I could not finish watching this show because I could not bring myself to care very much at all about people who need to document their mundane lives to this extent. I am sorry for the targedy that unfolds for these people and sorry for the self-obsession that modern people seem to have for their own images, doing nothing and going nowhere, in such detail."}, {"id": 30, "text": "Very compelling with how much shanaan shared her family life on facebook, and the bodycam footage of the day she went missing.pretty much took it at face value until the little blurb about domestic violence in the credits (which isn't totally accurate).30 seconds on google tells me the other woman was interested in the husband 6 months before they met.seems like there is a whole segment of the story missing. particularly regarding motive."}, {"id": 31, "text": "This was a great documentary despite its horrific and shocking results. The reviews are making my blood boil. Many are quick to accuse Shanaan of putting too much of her life online, as if that was some excuse to murder her and her children, or that she was a narcissistic shrew that drove him to it. Fact is, she had an at-home business and her social media presence was essential to that. You gain followers by offering insights into your life, and she must have picked up on that because she was quite successful at it. No, what I got from it was that he was a narcissist who was incredibly insecure, was determined to get into an affair with a younger woman, and planned this horrific crime well in advance because he is a weak waste of life. Sorry the very real statistics about men being domestic abusers and murderers so much more often than women have apparently made so many male reviewers cry. But they are just numbers- it's very easy to count murders and demographics. The numbers are real, not really sorry about that."}, {"id": 32, "text": "As someone who has been obsessed with this case for a few years now, I was extremely disappointed in this Netflix special. Now if you never saw the ABC 20/20 special called The Devil in Disguise and only watched the Netflix one you may enjoy it but holy crap is it a disservice to the story. I couldn't believe how sloppy the editing was in this Netflix one. The 20/20 special's storytelling and pacing is above and beyond this and if you haven't seen it I am begging you to GOOGLE Chris Watts 20/20 and click the link to watch the FULL EPISODE called The Devil in Disguise and if you've already watched the Netflix special do it as well and you will see the difference between professionals putting together a special vs what seems like amateurs."}, {"id": 33, "text": "Parents who murder their children and partners are most often menNetflix did a lauzy job on collecting youtube videos that everybody has seen already just to point out in the end that ALL men are evil.using crime this horrible just to tell us your view on the world how all men are evil is sickening me. you have no honor in your work and you are not afraid even to abuse act this horrifying"}, {"id": 34, "text": "What a crime, so horrible... Really great documentary, showed multiple perspectives and in depth account of the murders. But by the end, before the credits, some text came up. The text pretty much attacked the male gender for being murderers. I understand that most domestic killings is by men, but it didn't add anything to the documentary we just saw, all it did was make me as a male feel like i was like Chris and that males are bad people....and for what."}, {"id": 35, "text": "Don't get me wrong, the husband is 💯 the one responsible for this tragedy. But can we as a society just stop justifying cheating with a married person with kids by believing  that they are separating? They're not. You know it. If you're banging a married man/woman with kids, you're GARBAGE just like they are. And, it encourages their craziness to do stuff like this."}, {"id": 36, "text": "I am stunned by this horrific murder documentary. How can a man murder his own beautiful family. This is not an act of a man. He's a monster :@"}, {"id": 37, "text": "The documentary is a simple assemble of videos. An editing work, nothing else. At the end there are some statistics about how men are killers and a shame for human kind. This beast should burn in hell, if there is one, or at least in prison every day until he dies but violence is not a male thing it is about apsychological profile. I guess the director, female, hates men and puts the statistics to show how bad men are. The new feminism wants all women to be lesbian and wants to portray men as evil. Like men killing their wives and children is usual while women are like angels brought into this terrible world. Men who mistreat their women or children are like rubbish, period, exactly the same as women who do so. If you want to know this case in depth I recommend Dr. Phil's podcast about it."}, {"id": 38, "text": "The whole thing is videos (home videos, interrogation, etc) and no one actually discussing the case or what they were like as people etc. I would have liked a bit more of that, as I've already seen/heard all of these videos on a podcast and online. But it was still gripping and interesting. It needs an update mentioning his mattress written from jail. Also, people saying the wife was a bad person...her husband was cheating on her. He was likely a sociopath. And you think she was being 'mean' to him? There was a reason for that! I'm sure there was more to him than what's shown on camera."}, {"id": 39, "text": "I have watched a far lot of depressing true crime documentaries to be nothing surprised of anymore. But this was different. Especially that 10 minute video in the interrogation room.You know who's the culprit and who's the victim. But you somewhere hope that the outcome of the case is different especially the way events took place.It's depressing and dark. Not for the faint hearted. Will shake your beliefs on things you are firm on."}, {"id": 40, "text": "This documentary was amazing and heartbreaking. The amount of video and evidence that was left behind and collected was incredible. The film did a great job showing the good and ugly of both sides. While I found myself seeing how a perfect family was molded on social media, behind the scenes showed otherwise. I highly recommend this movie."}, {"id": 41, "text": "This documentary is very interesting to say the least. American murder: The family next door, is about the Watts family and how a murder occurred. The case is so unexpected which makes the documentary exiting and makes people want to see what happens next. The documentary has recent clips and videos of the discussions of what happened during this murder as this case occurred in 2018.I would very much recommend this documentary"}, {"id": 42, "text": "The way this documentary is put together is truly fantastic considering the awful nature of it.You almost forget it's real life.The body cam and the interview room footage is first class. The way he has to come clean to his dad is heartbreaking for his dad.The allure of a new life drove a father and husband to the brink and he has to live with it now for the rest of his life."}, {"id": 43, "text": "I'll probably be thinking about this one for a while after finishing it, and I imagine you probably will too. It's very well done, hooks you from the beginning, and leaves you just... affected."}, {"id": 44, "text": "The body cam footage and texts make it compelling and interesting, but you don't really gain any insight into why he did it as opposed to just leaving. It's very surface reconstruction, which is good in a way, as it sticks to the facts, but there is something missing and by the end you feel it. You don't really feel that the event is explained in a satisfying way. I can see how she is super annoying though. Obviously no one ever deserves to be physically hurt or killed, but it's important to note if you try to de-ball a man or make him feel little, especially over time in a long marriage or relationship, a rage will potentially build up that can be dangerous. Make a person feel like they are nothing and have no power, and eventually one day they might show you that they do, with tragic results all around. Physical harm is never justified, but that doesn't mean it's not important to find out what led to it, so that it can be avoided in the future."}, {"id": 45, "text": "The movie documentary is well made, but painful to watch. Lessons in real life on these days."}, {"id": 46, "text": "As many says - it's hard to rate this. It's a true story, and a horrible one at that. It's a cautionary tale - Don't ever think that you truly know someone. No matter how close you are. I like the aspect of being able to observe the criminal's behaviour. From faking innocence until the confession. He couldn't even fake tears in the beginning, only cried once caught as a liar. I was surprised at the inclusion of some very personal text messages, the ones between Shanann and her friend. I guess they wanted to show as much as possible that she was a normal person - which I was already convinced of. I feel like something is lacking within the story... A sign that he truly was sorry. I don't buy his crying, most likely he's sorry because he got caught. May he rot in prison. I hope Shanann and the children have peace."}, {"id": 47, "text": "I did not have any information about this case or story, before seeing this documentary. I like how this was put together and how it all unfolded with it's terrible truth. Do not google the case and just watch it.A must watch for true crime lovers. A really sad, heartfelt and unfair story, leaving you angry and thoughtful. See it on a day or night when you are not having a bad day or night. It might make you feel sick to your stomach.9/10"}, {"id": 48, "text": "Yet again a human beats evil to do evil things. I think I will never forget this."}, {"id": 49, "text": "The whole thing is just YouTube clips we have all seen over and over."}, {"id": 50, "text": "I followed the case when it happened and it is truly a heartbreaking one. It always haunted me how a seemingly perfect family like the Watts could end up like this and this gave me a little insight into what and where went wrong. Chris is a horrible person and what he's done is unforgivable but after seeing this, I can kinda see why he snapped. Shanan was a horrible, controlling person who drove her man crazy. TBH I don't blame Chris for having an affair and for wanting to leave her wife but i just can't understand why murdering his family seemed like an easier option or his only way out?Anyway, tragic story, great docu."}, {"id": 51, "text": "The clips and footage on YouTube leading up to Chris watts arrest are far more interesting than this soap opera documentary. Producer Jenny poppywell seems to think it was ok showing private messages from Shannon watts to her friends and family I just found it uncouth and degenerate just like the rest of Jenny poppywells work l. This is a very lazy and boring documentary so I would advise everyone to get to YouTube and check the Chris watts footage on there"}, {"id": 52, "text": "A more concise and thorough story can be found on YouTube. Nothing new or informative here. It felt like one long trailer for an actual movie that was never aired."}, {"id": 53, "text": "For me it was too much unnecessary home video material of the mom and children. Sure it's good to see some of it to get more emotional for their death but the makers of this documentary left so much out. I would've liked to see more of the mistress, more of who he really was (interviews with his friends/family) and more of how the police worked on this case. It was also a bit difficult to keep up with the timeliness."}, {"id": 54, "text": "Or maybe not ... because I do feel the movie gives us the answer and resolution. On the other hand I read that people are not sure. And in the times that we live, I do understand that sentiment too. Who to believe? Especially when the prosecutors seem to lead witnesses to make certain statements? Not an easy movie to watch in general, though I almost thought this was a mockumentary ... but apparently this actually happened.When it comes to found footage (a genre in general I'm not really fond of), we live in a society where this is more than possible now. Everybody films everythinng ... well that's an exaggeration, but you catch my drift. The people involved and the way this is edited is quite well done. Holding up the suspense and revealing certain things just the right moment. Also giving you the option to make up your own mind about the people involved. Not for the faint hearted by the way ..."}, {"id": 55, "text": "I've never cried watching at a documentary. The sickest mind is always so near to the victims. I'm so sorry."}, {"id": 56, "text": "This documentary is very well done. I was familiar with the case and actually had watched the police interviews before seeing this. This documentary does a great job at including background information. It shows what a charming/sweet lady Shanan was and I thought the documentary really respected her. I have no idea how or why Chris did what he did and unfortunately this documentary leaves that question open."}, {"id": 57, "text": "Of course I'm going to speak about the direction and editing, because the case itself is heart-breaking, I think I shed some tears (I'm a 38 year old male) since I have a 5 y.o. daughter and there are some things I can't believe the human being can be capable of, I'm out of words.But the editing is amazing, luckily they have the police footage and the documentary is really well organized. So the work here is 10/10, congrats to the director and all the crew that put this together, amazing work."}, {"id": 58, "text": "This is just a mash up of clips shown on the news or Facebook. Nothing about this is a documentary, looks like something a kid made as a last minute project. Just searched a topic then put a bunch of videos made by someone else into a movie"}, {"id": 59, "text": "Most of the footage in this has been used to better effect in the YouTube documentaries. At least they had some analytical narration in those. The fresh idea to focus on the victims ended up feeling far more exploitative than if they had just followed Chris; it felt very dark following the mother toward her final day. The only new insights for me were their texts detailing a troubled marriage and the confession of the secret girlfriend. Watch the JCS Criminal Psychology YouTube doc on Chris Watts for far better and more coherent coverage."}, {"id": 60, "text": "This is a very bad man! Absolutely disgusting! Hard to watch!"}, {"id": 61, "text": "What was an otherwise perfectly made documentary, ended up with a totally garbage ending marquee straight up MAN shaming. Irresponsible sexist nonsense. Are we just supposed to believe the show SNAPPED doesnt exist showing women are also fully capable of domestic violence? I shouldnt even have to bring this garbage up in the first place."}, {"id": 62, "text": "As far as true crime documentaries go, this was very good, especially with everything actually recorded at the time and using text messages and social media posts to show that current period.That said, it was extremely upsetting and possibly one of the most evil and cold blooded murders that I've ever heard about. I knew nothing about the story beforehand and hadn't heard about this on the news. To be honest it made me sick to my stomach and deeply affected me long after watching.Netflix really need to add a content warning to that documentary that it involves a horrific crime involving young children. It's not shown, but listening to what was done was sickening."}, {"id": 63, "text": "This is a modern true crime story, showing footage from police bodycams, social media videos, phone texts, and well-placed subtitles to help bring the tale to an incredible crescendo.I watch a lot of documentaries and this was the first to impress me with such technical features. It's not there for the sake of being cutting edge either. It was all very well placed to draw the viewer in.The story is brutal and emotional, and will keep you guessing until the end. This is 21st century crime reporting - absolutely magnificent."}, {"id": 64, "text": "Even if he confessed, that MAN should have gotten the DEATH PENALTY and should be executed as immediate as possible. there are a lot of men who go through DIVORCE and child support....the worst thing he could have done is left their lives and not to be heard of ever again, no need to kill specially the CHILDREN.... but the DOG suffered too as he will be forced into a new home.so sad in all levels...."}, {"id": 65, "text": "So so sad. He had it all all he had to do was divorce her"}, {"id": 66, "text": "Hey great idea, so you have an exclusive? well no not really but it's cheap programming. We just spend a couple of hours on Youtube splice some clips together and hopefully our stupid audience won't realise they have seen it all before. Great idea, here's a $100 go and make that film. Seriously there's much better content on YT including prison interviews, if you are at all interested in this case skip this and head over there."}, {"id": 67, "text": "The story is outright heart wrenching. At a time of such racial inequality, this monstrous criminal receives such good treatment by cops. The story is also made appealing by highlighting a perfect all-American white family. If the perpetrator and family were black, not only would there have been no movie, but also, the cops would beat a confession out him, and get him to hang.The movie show how well white criminals are treated. Check out When They See Us for what happens to black innocents."}, {"id": 68, "text": "It was so sad and shocking. I can't believe he murdered his baby girls. I don't understand how you can do this as a parent and i don't understand why he murdered them."}, {"id": 69, "text": "It's like watching paranormal activity (for the cinematography) but it's REAL! Wow!"}, {"id": 70, "text": "Amazing amount of high quality police, Facebook and CCTV video footage went into making this sad and heart breaking documentary. It is compelling viewing as the story unfolds."}, {"id": 71, "text": "Let me start by saying that this is a tragic case, one that, being a parent, I will never understand. Having the mental ability to kill is statistically low, even lower when you look at the victims. This is clearly the first element of what I find sad; that three children and their mother had their lives ended.There are many reviews complaining that this is a mashup of internet clips, and that people already knew all the detail. I didn't, as I am one of the few who refuses to have social media accounts or spend my time trawling through YouTube.What this documentary serves to do is set out the details of the crime using clips from the police, mainstream media and social media. This highlights the impact of social media on people's lives and in all likelihood their mental state, and this is the second part I find sad.In an attempt to appear to have the perfect life, one that she had been craving from childhood, Shanann felt that she had to engage an audience on social media. She had clearly worked to develop what she had and wanted to appear perfect; perfect house; perfect family; perfect life. Watts wanted to do the same, but in a slightly different way - having the hot girlfriend; the athletic physique. It is sad that they felt they had to present themselves in a perfect way when clearly all was not perfect. I would argue that you have social media to blame for this.It is well worth a watch, and I've not seen anything done in this format before. I would now like to see a follow up from a psychological viewpoint to examine the motive.Have to hand it to the neighbour - he'd clocked the guy in the first 10mins of the show."}, {"id": 72, "text": "This will stay with me for a long time. Those 2 beautiful little angels deserved better. I thought it was very strange that Shannan shared every thought of her marriage with her friend by text but that's no reason for lifting a finger to harm anyone so I'm not victim blaming by saying that. He just seemed empty and devoid of all feeling. She seemed very concerned with constantly filming everything. Very weird relationship. But the worst part is the heartbreak of her family and their daughter and grandchildren being taken from them forever. I hope he rots in hell."}, {"id": 73, "text": "Shanann deserves to tell her side of the story, and through this, you will see her, and her daughters Bella and Celeste, as real people who through no fault of their own became victims of a madman. This is a must watch for any American. I felt so much viewing it, especially a sense of loss at the lovely lives that were literally smothered. It tells a common story of betrayal and infidelity, a marriage in rapid decline. It shows the love of friends and family for Shannan and Bella and Celeste, and the toll it took on them to have to live through this awful ordeal. In particular, it is well paced and deeply informative without narrating what's going on. I came out of it feeling something unique. I just want everyone to see this."}, {"id": 74, "text": "It's a fairly basic true crime mystery...but my God, the personal access, shocking details and masterful editing make it one of the most well-told of the over-crowded sub-genre."}, {"id": 75, "text": "I've never seen a documentary like this before. It lays out the case but instead of the usual and tired format of crime documentraies these days, it doesn't conduct any present day interviews or sensationalize the story with a movie trailer style voice over. No. This is far more elegant than that. This lets you focus instead on the humans in this story over procedure and gory details. If you have any shred of empathy you will be crying by the end. Those that want more details about the crime itself or the coward that commited these evil acts go scrape the dregs on the internet. The bloodthirsty chat about the condition of the bodies or the conspiracy theories can be found in awful crime books about this case and on You Tube. Watch this instead if you want to underatand the truth. She loved him and he wanted a new life. This is the conclusion his simple mind came to."}, {"id": 76, "text": "This is a story I remember reading about when it first happened back in 2018. It's very sad and tragic, the documentary had me hooked from start to finish.RIP Shannon, CeCe and Bella.I hope this man hears his daughters in prison everyday.Saddening for everyone involved, also for Nicole Kessinger, the mistress, whom got lied to and I feel like got a lot of hate for no reason."}, {"id": 77, "text": "I'm glad they made a documentary about this crime. It does appear to be accurate from what I've read in numerous news articles. It's very sad that divorce was not an option in his mind. I'm watching this already knowing the outcome, so appreciate all the extra footage they put in. The facebook photos, text messages and family comments were all helpful to further my understanding of how this sad unnecessary murder happened."}, {"id": 78, "text": "Imagine you're from the 1950s and this documentary is sent back in time and is your only glimpse of 70 years into the future. Hell, even by 2000s' standards this is incredibly Orwellian or Kafkaesque.A lot of critics here have rightly pointed out this is a lazy documentary. And it is, but that's the beauty of it. That a narrative can be weaved ENTIRELY from police footage, voluntary social media posts, and candid text messages, is in some respects a sad indictment on our narcissistic and paranoid society - the urge to micromanage our lives and image, overshare and over-surveil. No talking heads, no traditional narration, scant journalism, little legwork.Chris Watts is a monster. However that does not tell the whole story. Another interesting narrative touched on, but not quite fully fleshed out in the documentary, is masculinity in the 2010s-20s. The juggle that is entirely inconsistent with what we were taught by our fathers and grandfathers. The balancing act of being a doting husband while also retaining your 'manhood' and not being insecure about it. The reason why new media such as the Joe Rogan Podcast is popular with disaffected young men aged 18-35.There is almost no doubt that Chris felt strongly demasculated through his toxic marriage. That is not an excuse to murder your family, but is a topic that warrants further investigation. One could argue if he plead 'not guilty' he would have done a better service to society at large - to be probed on the 'why' ... why you would opt to murder your kids and not just get a divorce.I did not feel offended by the 'facts' towards the end - they were quietly dismantled by another review entitled Reciprocal? here. From a pure 'true crime documentary' point of view, this film probably sucks. You can find deeper investigation on YouTube, and if you're familiar with the case (I wasn't) this might offer nothing new. However, as a time-stamp commentary on our modern society, it does a good job."}, {"id": 79, "text": "Editing is the winner of this movie. They simply took videos from police cams, home cams, cellphones, news etc, and combined them into one film. The facts are simple and you will understand immediately what is going to happen next and if you take note of any piece of inforamtion you will even know how it's going to end (a bit of detective skills or by watching many movie thrillers). It's one of those movies that you will never forget, it's shocking because evil may exist within those who looks normal and live totally normal life without any record or signs of violance or any disturbance or disorder, up until the moment they turn into monsters, and it can happen just like that."}, {"id": 80, "text": "The story and crime aside - I found it obnoxiously made and that it never really gets off the ground."}, {"id": 81, "text": "You wont believe it till you see it. it could in fact happen to every family. there are no excuse for these crimes, and i think its well sentenced.productionwise its based on newscast and police body cam, which means terrible visual and sound quality, and views from the cams in the interrogation room. here the sound quality is so bad that it becomes a guessing game whats said . the story is also spiced up with textmessaging in the time before the murders, also built around the victims camera blogging activities via social platform are used.its a crime with wide percussions, its like all the others of this docu genre, but have a look it fells deep into your sole."}, {"id": 82, "text": "This documentary is nothing new, everything was in papers already. I understand, this documentary is trying to get sympathy for victims, instead of looking for WHY answers. There were no mention about family finances ( they were in huge debt (100k) and basically losing their house with excessive spending and only Chris working as main breadwinner and third child on the way. Shanann came across as nagging, controlling and abusive person. Constantly airing dirty laundry to everyone, recording everything and putting everything private on display to others,even to unknown ones. She wanted to live posh lifestyle she could not afford. And pretend to be successful, which she wasn't. I do believe all those factors contributed to killings. The biggest victims of this toxic relationship were little girls,killing those girls was awful, just evil."}, {"id": 83, "text": "Can you imagine every bit of your life being broadcast on fb . Every single thing and complaining to the ppl that watch about your husband . And letting strangers know everything that goes on in your life .Guaranteed That she has 1000 plus ppl on there and imagine always being recorded and called out on all your short comings. F that. You should've just left dude."}, {"id": 84, "text": "Let me just say...These 2 were not meant to be together. Their personalities are total opposite. The only sad part is that these kiddos got mixed in the craziness. Many don't want to admit it but there are many families out there, just like this family...Just like this couple. You have the wife that records everything. She lives on Facebook. That's her whole life, social media. It became obsessive/compulsive. She was very obsessive and dominate. She likes to be the boss. She loved being in control and that fed her ego. A lot of men do not like being on social media all the time. You can look at Chris' face and tell that he went along with everything just for her. He was afraid of her because of who she was...her personality. Another thing, Shannan exhibited compulsive texting when it comes to friends. Constantly texting her friends about her spouse. I'm sure her friends had their own life. She was constantly disturbing her friends life about the fact that she's getting no sex. Shannan was a lot to deal with. Now Chris...He seemed like a quiet, nerdy guy. He seemed like a push over. He did whatever Shannan wanted him too. He was sooo unhappy in the marriage. Then he looked elsewhere for love like most men do...Instead of facing his wife and walking away. He couldn't do it because of how afraid he was of her and how she would drive him nuts if he left. Shannan would've destroyed him. Again instead of him leaving, he lost it. He thought that getting rid of her, would prevent any hell that he was going to receive if he walked away calmly. Shannan knew this was her 2nd marriage. She thought dominating him and controlling him was going to keep him there. It only caused him to not like her and pushed him to cheat. He was looking for an out. Unfortunately, he did things the wrong way. I believe he killed her while she was sleeping. I don't believe he had the guts to take her while she was awake. She was that powerful and he was that afraid of her. My advice to married couples going through it. Leave!!! Get out!!! Do not harm anyone!! Have the strength to walk away and coparent. It's hard leaving a marriage but life will still be great after you leave. Don't worry about what people think, just get out. Don't allow a spouse to scare you. Get out!! Shannan knew that he had someone else. This was her 2nd marriage and she lives her life through social media...so she wasn't going down without a fight inspite her wrong doings as well. She wasn't going to let him go easy and it made her angry that she was losing the control she always had... Women accept if your marriage is done. Let him go... if not things end up just like this. People have to know when to let go..."}, {"id": 85, "text": "A true-crime documentary far more chilling, yet also emotionally affecting than works of this type generally tend to be."}, {"id": 86, "text": "Update from 10/09/2020 . The original review was posted at 10/01/2020, but for some reason it was deleted without warning or notification. I don't see how it may violate any of websites rules.This documentary about a horrific murder makes you ask a question - What makes a decent and normal human man (on the surface) to murder his entire family? The movie focuses on the victim, her social media posts, her friends etc. I believe the message of this movie is incorrect and possibly even misleading and destructive as it portrays potentially ALL men as potential killers and all women as good hearted victims. While there can't be any excuse about the murder of children, thus making the punishment adequate and appropriate, there are a lot of questions about what lead to that horrific outcome. First of all, the psychological profile of Chris (the killer). It's obvious that he has a weak will, works some mediocre blue colored job, too much depends emotionally on his parents and has heaps of inner issues. He is basically a servant in his own house, where his wife (the victim), focused almost entirely on her blogs, work and children while he is the one who absolutely accepts her ruling and it's basically a Matriarch household. The wife (victim) checks his every purchase, always puts herself upfront, lives a full life by having a lot of friends, flights, studies and highly active virtual presence on social media. Cares only about her feelings and emotions and by her own admission, likes the things to be done a certain way, belittles him and in a bad relationship with her in-laws, who are very important to him. Essentially it paints the picture of a very narcissistic and controlling woman, while the husband lives a submissive life. It's no surprise that while she's not there and no emotional influx from her towards the husband (and no, I don't think that her attempts are actual attempts to fix their problems, but instead they look more as an attempts to justify her life choices), he chose to start an affair with another woman. That is where it gets problematic. As he's obviously a pleaser and enabler, his instinct is to please the other target of his affection. At that point something is starting to go horribly wrong, as that particular instinct overcomes his other male instincts as to be a protector to his children, and he goes all the way. It's not a case of affect or insanity. It's just something that made him forget all the norms and go full blown psychopath all the way, right until the investigation, where he returned to his normal self. Therefore, something is missing from that documentary. That particular trigger that is not mentioned anywhere, and I personally believe that there is more to that story then is shown to us. In conclusion, in my personal opinion, the message of the movie is to point a danger of all men being killers (just watch the end credits), therefore that specific trigger, should it exist must come whether from his girlfriend or his wife, as it fits that awful mind puzzle. He was not born like this from the beginning, but something happened that made him commit this horrific crime. He is obviously guilty and he should pay for what he did, but there must be another factor who should be investigated and taken into a consideration."}, {"id": 87, "text": "White, check Male, check American flag shirt, checkOnly show the .000001%, and we can make them think the opposite is true, Agent Smith."}, {"id": 88, "text": "To the race baiting chap in the reviews on here who's comparing the treatment of this fellow to those poor black souls of the Central Park 5 who were treated so badly, you do realise that police employ different tactics to ensure the optimum outcome. In this case by being overly gentle with the suspect the crime was solved with a favourable result. Also I'd imagine, and this is purely based on my experience with police, most want to get a productive outcome from an investigation and are not solely motivated by racism, homophobia or some other bigoted point of view."}, {"id": 89, "text": "In my opinion it was nice seeing this type of documentary. And before reading the negative reviews, ask yourself: what is this documentary trying to teach us? It does not provide full details about the case. But you need to remember who's telling the story. This is not told by investigators. This is not supposed to tell about their financial struggles and expensive trips. Or what led up to the kill. It just tells the tragic story and shows raw footage.After watching this movie I learned that this man was cold blooded. This teached me that far more men kill their partner. This teached me that some people seem like they're normal when indeed they're insane. This also teached me that this woman was trying to save this marriage. It showed a woman with a strong opinion and love for her family. She was no quitter. And in my opinion he knew. She wasn't going to let go easily. Everyone talking about narcism and whatever... it's not what this is about. Are y'all trying to justify his triggering?I can't imagine being there with them in real life.. as a friend, relative or police. I watched this in my room, feeling like I was there in the background watching, and it broke my heart. dumping those kids ALIVE showed me, that psychopats do let go easily. For such a small thing as another female. I am against death penalty but honestly... this man freaks me out. I could not fall asleep at night knowing I just dumped my kids alive in a tank. Knowing this man sleeps and didn't shed a tear before he knew the show was over for him kind of changed my mind about death penalty. What a waste of air he is to say the least. My mother heart cries and I find peace in knowing their're atleast resting in peace now. Great documentary,"}, {"id": 90, "text": "There must have been quite a few people that were watching back in 2018, when the police cam footage and interrogation videos were being released almost on a daily basis. If you were one of those people, there is nothing new here. In fact, this documentary comes across as rushed. There's masses of footage available online, if you want to take this story further.Saying that, Watts is a sick individual and never deserves to be released.I don't think there's a day goes by when this case doesn't come in to my head.Horrific, to say the absolute least."}, {"id": 91, "text": "A better Netflix crime story. Why? Because it's only the real footage or news stories that's used in the film. It's not filled with people being interviewed talking about the event from the past which just pads the runtime. It works better and keeps you invested with body cams and real police interviews. Nothing is staged. It's all real."}, {"id": 92, "text": "It was very nice documentary but it's so sad that's it really happened. How a person can be that monster to take his childs and wife's life. That's so disturbing to know that those people exist on this planet. The only positive thing in this case was that this creeper didn't get away with those murders."}, {"id": 93, "text": "Still Can't understand how could he do that! He's got a wonderful beautiful wife and 2 angels. Watching the movie gives you the feeling that he loved his daughters! That's creepy. We heard a lot of stories about husband killing his wife, but this one is totally different. It breaks your heart."}, {"id": 94, "text": "I know everything is real footage and the story is horrifying and usually netflix documentaries are great but the this one was very boring. I guess it is a matter of taste though, but I was the only family member who watched this to the end, while I was checking the news on my phone."}, {"id": 95, "text": "Very well done Comprehensive Documentary. Hard to watch, cause most of us know the way it ends....But you get a Glimpse into their life. As it unraveled....just as you get to know the victims, it humanizes them, and puts feelings and emotions to what is the most horrific crime One can imagine."}, {"id": 96, "text": "I knew the story and was still shaken to the core. You want out, get a divorce For god's sake why kill the wife and precious babies, throw them away like garbage. What a vicious monster."}, {"id": 97, "text": "Shocking, heard breaking, very well edited original footage from police body cam, door bells &amp; other security systems. Hear breaking, I think I was in tears and motionless even after turning my TV off."}, {"id": 98, "text": "This documentary made me realize that cameras are everywhere, you need a best friend who will blow the whistle when you vanish, Chris Watts is just T.R.A.S.H and get divorced coz murder will get you time. And also the background story was new insights to a story that I thought has just been well covered. Very sad and draining... Seriously get divorced!!!"}, {"id": 99, "text": "What a sad story, but a brilliant composed documentary. In an age everything has been done before it's great to see a new and innovative way of telling a story - and it's this originality that makes this stand out for me - in a way that had me hooked from the very beginning. What a heartbreaking story that I don't recall from the news."}, {"id": 100, "text": "...lurks in the hearts of men.In this case, we found out. The evil that allowed this guy to murder not only his wife, but two toddlers. Wow. That's just mind-boggling.This is the story of a controlling and dominating woman who wanted the perfect life, she wanted her husband to be a very specific way, and she criticized him constantly and told him he wasn't man enough, didn't have the balls, etc. To her credit, towards the end she did start to realize how she was treating him and apparently was trying to reconcile her own behavior and make things work. I seriously doubt, however, that she would really have gone as far as it would take (and do what the average person would do) and truly change.Unfortunately for her, she never realized until it was too late the kind of person she had married. It's easy to say she pushed him too far, and we'll never know what their last conversation was like. But he had it in him to do unspeakable things.As for the death penalty, I can't know what it's like to face life in prison, but if I had done something that horrible I wouldn't want to live. How could she have known what he was capable of? It's horrific."}, {"id": 101, "text": "Living outside USA, I had not heard of the sad story of of this family before. When I saw it on Netflix, I thought it was just another crime docuseries... After seeing it last night, I can't shake of the sadness it left inside me.***spoiler alert*** Above all, I think what hits you essentially is that the person you let your guard down to the most, you trust the most can do such a crazy thing. Everytime he came up with a story (1- only the cheating, 2- the murder of wife but not the kids, 3- the frenzy that led to all killings and finally 4- admitting of the planned murder.) I tried to understand his psyche... But of course, not possible. Mental health is so seriously underrated. What follows this question is: What was he like before? How did the people closest to him describe him? Did anyone mention anyting odd? Probably there were articles and other content on this online, maybe those could be included in the closure part of the film. ***end of spoilers*** The fact that the whole film consists of real footage, adds up to the creep factor. I found the editing to be most effective. Kudos...If you like the genre AND you can stand the disturbance, watch it.As a fan of the genre, I think I regret watching it. Bacause I just can't get it out of my mind... I am truly, truly sorry for those two angelic kids and their mother, may them rest in peace."}, {"id": 102, "text": "Assuming all the footage and chat conversation are true without any fake and remade ones, it's kinda enjoyable and shocking for what been seen. It's real murder scene been show on screen. Also know if worry someone close to you go to harm you, leave with a trace. The intention of the murder kinda creepy to me."}, {"id": 103, "text": "I found that this played more as a film than a documentary. It was very powerful, and great in the sense that it focused almost entirely on the victims and did not glamorise, or seek in anyway to tell the story of, the murderer. It was particularly painful to see how the memory of Shanann was tainted by the murderer's lies and cowardice and while at first I couldn't understand what was unique about this documentary, by the end I understood it was a tribute to Shanann, Bella and Celeste rather than just another murder documentary."}, {"id": 104, "text": "Netflix flashes this movie up to me as I signed on. I started watching it thinking there was some twist of a plot lie, the girlfriend did .it. What is the value of making a movie like this. It's a terrible movie about a terrible situation. Why would you make it. I can't believe I watched it. To the end. If Netflix flashes another movie like this at me I will cancel my account. Simply horrible movie."}, {"id": 105, "text": "I found this documentary overwhelmingly compulsive viewing. So much so that, in spite of the harrowing and distressing subject matter, I watched it three times on the same day.This is an exposé of a psychopath, offering some insight into how their minds work. But it also has much to say about the current state of society, and the effect it can have on human relationships. Here is an 83-minute movie which is entirely composed of police videos, CCTV footage, text messages and Facebook posts: a whole life, a series of lies and four tragic (and arguably avoidable) deaths, most of which were available for public exposure and scrutiny from the very beginning.As much as anything else, the movie serves as an indictment of the internet and social media age, where everything we do, think and feel is recorded for public consumption.The underlying irony of this all is that if Shanann hadn't been using Facebook in the first place, she would never have met Chris Watts. She would never have borne his children. She wouldn't have died in so tragic and horrible a way. And neither would they.Let this serve as a warning to all of you who love to portray your 'perfect' lives on social media platforms.This is the truth behind the lies. The grim reality behind all of the smiles for the cameras."}, {"id": 106, "text": "This whole family is disfunctional. Starting from Shanann, Chris and those 2 poor little girls. I don't know what could be the reason, but those girls weren't happy and healthy. Mother cared more for Facebook and to portray this fake picture of happy perfect family. Chris was so unhappy in this marriage, you can tell. He was a patetic coward who decided to do an absolutely worst thing. He could just walk away and got a divorce. Shanann was 24/7 online, talking about her most private things to people online instead of actually doing something. I guess they weren't good match from the start, she was desperate for any man even if he was psycho. So sad. Poor girls they suffered so much.... They should be alive, all three girls and unborn baby...."}, {"id": 107, "text": "It's a wonder why this documentary was ever made. The case is just so open and shut that it's obvious from the very start who has committed the crimes. Don't get me wrong what happened to Shanann and her children was truly horrible but I don't see the need for their story to be broadcast all over the world."}, {"id": 108, "text": "First off as others have said, the format of this documentary is incredible. You don't just hear someone telling you the story, you see the exact moments. Practically everything other than the murders themselves are presented on screen. It is a truly devastating experience.That being said, Netflix is starting to become questionable with the honesty of their storytelling (i.e. Tiger King). The film leads you to believe Shanann is an emotionally abusive wife and that Chris is just conflicted by the emasculation he feels, which feels ethically wrong and disingenuous by the end. As another reviewer mentioned, information presented is incomplete: no acknowledgment of some very important details of the case that are just a Google search or scroll away. There are no explorations into WHY this happened, or where this monster came from either. In that sense, it fails in the most basic metric of documentary storytelling.The film is finally transparent in its conclusion at the very end, which beyond being insulting, is painfully lazy. Men. That's why. Just men. Chris isn't the only one, men do this because they're men and they're bad. Really? That's the takeaway here?"}, {"id": 109, "text": "This is a fascinating and heartbreaking case which frankly is not done justice in this documentary. If you truly are interested in the grim details of the Watts family there are many very well-produced YouTube videos on the subject that are much more in-depth than this doc. There's nothing new in this piece and isn't worth the time."}, {"id": 110, "text": "I watched the whole documentary, start to finish, and I still couldn't you why he did what he did. He never actually admits to killing the kids. I mean if I watched the documentary I should know but this is 90 mins of the victim texting her friends and not really about the crime"}, {"id": 111, "text": "The film ends by people calling the wife a b#@$&amp; and narcissist. They gloss over the fact Chris Watts callously describes strangling his wife and her giving birth after death. Why didn't they mention that part? Would that detail cause the viewers to come to grips with the reality of this man's actions? He tried to strangle his children to death. He thought they were dead but they woke up later and that's the reason he put them in the tanks. To make sure they would never wake up again. Why did they not mention this detail? The film shows the wife being irritated with her clearly mentally unsound, brain dead husband. This films delivery clearly shows how our culture encourages violence against women. When the neighbors tell the police the husband is acting suspicious and he NEVER LOADS IN HIS TOOLS (he was loading his family's corpses into his truck). They had video evidence of him leaving the crime scene. Yet there officer dismisses the neighbor's concerns, because white men in America get away with murder."}, {"id": 112, "text": "I can't unsee what I've just seen. I thought it was a well made documentary and had me hooked from the start...but...I just wish somebody had warned me. As a parent, it has left me feeling so sick and so sad. That poor family. Those poor girls. The worst part? The hour drive with them and he still went ahead with it. Sickening."}, {"id": 113, "text": "I have to admit to knowing a lot about the Watts murders before this documentary, having watched hours of police bodycam and interivew footage on YouTube, as well as courtroom testimonies and the memorial service. This case shook me when I heard about it, especially with all the Facebook videos Shannan made, and all the pictures of Bella &amp; Cece, you felt like you knew them to a degree. This hits differently when all the footage is compiled together in chronological order, particularly footage of Chris and the girls because you'll see someone who appears to be a great dad making happy memories with his children. Absolutely chilling, it does not feel like some anonymous tragic case you read about. They seem like normal likeable people. My heart breaks for Shannan's family who loved her so much."}, {"id": 114, "text": "I had seen some of the footage of the husband's interrogation so I knew a bit about the case but watched so I could learn more about the victims. I am glad there was a focus on Shanan and her beautiful children.A few facts about domestic violence in the USA are shared. I just wish they had been interspersed throughout the documentary and more information shared."}, {"id": 115, "text": "My heart cries for the events. This documentary was well made, although in times it felt little bit unfinished. Not so much it would bother tho. Very haunting and captivating to watch. I see some complaints about using so much material that is already in social media platforms, but you know, not all of us use them. At first I expected to hear interviews, or crime scene reconstructions, acting etc typical crime doc stuff, but I must say that I liked this kind of stripped document. Not too much explaining, no added drama, just those real videos and some messages that explained enough about what is happening."}, {"id": 116, "text": "I have to agree with rws_20's review. The whole documentary lacked something and seemed to be put together quickly and without a lot of love and thought. It is a tragic story but to throw together about 1 hour of phone/bodycam/social media footage with little or no narration made the whole experience for me not a pleasant one. It is at least 30 minutes way too long. Pity it was such a bland experience as Netflix usually produces some high quality TV Movies/Movies/Documentaries. I did watch a much more riveting version of this story which I think was made by the crime and investigation channel. I was sorely disappointed in this version."}, {"id": 117, "text": "HEARTBREAKING (I cried). I never knew these details. Horrifying story. This kind of documentary is far scarier than any horror film I've ever seen. It's so hard to watch. The problem is WHY? Chris Watts why? What's in your mind?"}, {"id": 118, "text": "Well made. Cannot really comment on acting as it was based on actual footage. It was sad to see how the events of the story unravelled.One thing that the documentary failed to reflect upon is the role of the mistress. Until a divorce takes place, no matter what the situation is, two people are still legally married and in such circumstances, I have no clue why a girl would want to be someone's mistress. Irrespective of race, religion, and gender, CHEATING is morally wrong. Even when something is legally allowed it does not necessarily mean it is a cool thing, for example CHEATING or extra marital affairs. We at times fail to abide by ethical guidelines. Strong morals are absolutely mandatory for both males and females.And for the man himself, I am simply at a loss to comment about anything."}, {"id": 119, "text": "On one hade I think it's important to raise awareness about violence against women and to see evidence of real monsters living among us. On the other hand... isn't it taking cinema a bit too far? Aren't we creating a new genre that it's main appeal is murder? Are people watching it to be shocked or because it's a thriller but real? To be honest I watched it after reading a good review on my local news app. And I felt sick to my stomach after watching it. I couldn't even watch to the very end. And than I asked myself why I watched it? And I really don't know why. But I'm kind of ashamed that I did."}, {"id": 120, "text": "Somehow, because it was new on Netflix and a long crime documentary, I couldn't wait to see this as soon as it was released. Sadly, it's very clear from the cute home video opening and police body-cam videos how this will all turn out. Absolutely sickening.By the way, if you're expecting a search for the mysterious kidnapper or killer, cool forensic technology, clever clues, maybe Tom Bevel's blood splatter analysis, forget about it. Nothing forensic here. Hurry along, because there's nothing to see but relentless police questioning.If you've watched Dateline, you've seen all the narratives like this before. Save some time, turn this thing off after 15 minutes. Because you know what the ending will be. What's more, the ultimate resolution is more stomach churning than In Cold Blood."}, {"id": 121, "text": "The victims family helped with footage for this documentary. They stay as respectful as possible while giving the bones of what happened. Interrogation footage before arrest and interview after in prison help give details omitted on you tube. This case has more twists and trims than a movie and ten times as heartbreaking."}, {"id": 122, "text": "The whole documentary is chronological &amp; consists of only original footage (starting with recordings of her friend texting her and then looking for her, police recordings of him and ending with the sentencing)although i have seen most of the footage and the topic being familiar - it leaves you with an interesting feeling of knowing but not knowing him. it's strange because the docu enables you to watch his demeanour and actions and I ended up being intimately pulled into it but left again with the psychological question mark (&amp; a sense, yet again that everyone is capable to do anything.)(i was relieved there were no re enactments or commentaries from nancy grace)if you're a fan of 'the staircase' and the like.. this is for you!"}, {"id": 123, "text": "I don't know what to say expect that this isn't for the weak at heart. I don't get emotional usually with docs but I did with this at the end when the second daughter said Daddy No heart breaking to say the least. How can any parent do this to his/her children.They're up in heaven now, in a better place."}, {"id": 124, "text": "The wife seemed really needy and irritating not that it's an excuse to kill her mind"}, {"id": 125, "text": "God bless their pure souls and torture his demonic one"}, {"id": 126, "text": "I'm not sure why I wasted my time. Maybe if you like true life crime."}, {"id": 127, "text": "I don't know what to say but this Great plot, interesting point of views, and totally recommended you guys watching this."}, {"id": 128, "text": "Good documentary, scary how normal some people can be and yet do this horrible things."}, {"id": 129, "text": "A documentary production, in which the events are told in good quality, can be viewed. There's a lot to say. Why such a murder chain instead of a divorce? And two kids. Shame."}, {"id": 130, "text": "I didn't learn anything new from watching this documentary. I was expecting some new clips or interviews, but it was the same stuff I can find on YouTube."}, {"id": 131, "text": "Watching this movie made me cry it's so heartbreaking, I've been following up since it happen in 2018 and still till this day I can't believe that he did this to his family. To be honest I think he's a coward and not even considered as a man. It's just sad. Like what kind of Father just kills their family doesn't make sense all because he was with another woman. All you had to do was divorce her. Who cares if the mother said you will never see your daughters again that's just her talking with anger at that moment but doesn't mean she meant it. It's poor lame of excuse for what he did. Theirs no denying that. Not only that he could've packed his stuff and left and never returned. Could've wrote a letter and just left and had the baby sitter watch the kids. Anything you know. Didn't have to end this way. It's just so sad that he acted so strange and all and she could've ended it way before but she was in love with him regardless you know she kept trying and never gave up. Poor babies as well they didn't deserve to go thru that or the mother while she was pregnant. It's crazy how some of these woman wrote love letters to this disgusting father that did the crime and how they are on his side and all this. Nonsense. Open your eyes woman and stop thinking it's ok what he did. It's horrible. I also blame the mistress for all this happening why was she messing with a man who's MARRIED why keep talking to him while he was married like she's not that bright either. Who messes with a married man and searches stuff online of wedding dresses and Amber Frey online a week before. They should've investigated her more. I felt like she had something to do with it."}, {"id": 132, "text": "It's so absurd the motive of the crimes that makes me feel punch all the face of the murderer till it explodes. And people in jail with him wanted to do this too (you coward!) so they moved him to another jail! This really piss me off. The murderer is senseless and spechless. 1:25hs can't explain many questions. Really unbelieveable what may be right in your side."}, {"id": 133, "text": "Minute 7:13 you can see one girl playing at the room, seconds later you see her again. Mmmmmm??? 🤷‍♂️ I don't know Rick rhia documentary looks fake to me."}, {"id": 134, "text": "This documentry is a very hard watch for many people ,but to me it wasnt so hard,mostly because i get used to read and watch about bad staff around the world so nothing surprised me or shocked me in this murdering case.Was this documentry sad,well to me it was of course ,cause we are watching a sick man killing his family over a stupid reason,and that would effect every normal person,but i must admit that way how was everything here wasnt on level as i was expecting it will be,i had some problem of understanding what people were saying and story pacing was little to noisy and off,in end this was one watchable documentry"}, {"id": 135, "text": "The story, which is of course unfortunately true, is simply horrible and sad. It feels morally questionable to make some sort of entertainment out of this story. As a viewer, I was left feeling as though the journey was unnecessarily long in order to be somewhat captivating / entertaining. The few pieces of evidence presented at the end of the film where so obvious that the case could have been solved and closed almost immediately. The twists and turns a viewer might expect aren't there, and you're left just feeling sickened. The involvement of children in this story is just heartbreaking. The stats at the end feel like an attempt to find a moral purpose. I would have liked a more in-depth investigation of the psychological factors as to how and why someone would do this. In my opinion this all felt wrong and in bad taste."}, {"id": 136, "text": "I was expecting much more than texts messages and body cams. 5 stars is a generous rating."}, {"id": 137, "text": "I play a lot of horror games and watch a lot of horror movies, none of them gave me nightmares exept this documentary. I keep dreaming of the little girl with her little blanket asking her dad why she killed him for the last few days... thanks Netflix"}, {"id": 138, "text": "This is one of the most tragic crimes in history with the killer the most evil person I have ever seen. He is up there with Bundy and the absolute worst of evil beings. The neighbours are the most switched on people you could possibly want living next door. They deserve a medal. This documentary is excellently done with real life police cam and more. Police and others are tuned in to separating normal behaviour from weird and thank god they have this awareness. A very interesting documentary with the shock factor rising up like sewage from a bust main."}, {"id": 139, "text": "Like 80-90% of the footage used in the first half hr I watched on YouTube. So if you don't have Netflix, you can look up a 40 min video on YouTube and watch the same footage. Honestly thought it'd be really unseen footage."}, {"id": 140, "text": "I saw this about a year ago, maybe not exact this but it is very similar. Was hyped until I saw it was about Shanan and her daughters.Gruesome crime."}, {"id": 141, "text": "It's kind of amazing how the modern digital life is so extensively documented that a clever team of editors can take your social media accounts and the videos off your phone and make a fairly comprehensive movie of your life even after you've gone. That's what happened here; the production team assembled a detailed accounting of the lives of a family that experienced an unspeakable tragedy. By the end of the film you have a sense that you know these people, which is also part of the problem: the more you find yourself caring, the harder it will be to keep watching.I really struggled with the foregone conclusion that was the lives of this family. Some things are so horrible my brain just doesn't want to accept them. I watched the movie in fits, drawn on by morbid curiosity but forced to continuously stop by some childish part of my brain that believed that if I simply stopped watching then somehow the remaining unseen events of the film would be trapped in a time bubble that couldn't proceed until I did. If only life worked that way. I never did make it to the very end of the movie because I just never want to hear the full detail of certain events.The movie is well made, but painful to watch. I'll admit to a certain amount of tears, and a sincere wish that I'd never heard of the Watts family. I will never understand why certain people fought to remove the application of the death penalty; if I had those memories floating around my skull, I would think death would be my best friend. Instead I'll just hope certain people are around for a long, long time, getting visited every single damn day by others who know what this person did to kids."}, {"id": 142, "text": "Other than stitching up vignettes in a chronological order, this documentary offers barely any new insight to the Watts familicide. It has been nearly two years since his incarceration and there are no recent interviews with the killer or family members.The story plays like an episode of Air Crash Investigation (minus the investigation) - multiple failures must occur to precipitate the ultimate catastrophe. Chris stalks Shanann on Facebook. Shanann agrees to meet but would repeatedly rebuff Chris' advances. But why? Best guess would be her feelings of inadequacy about herself and her lupus. She finally succumbs to his charm and agrees to marry him. But Chris' family fails to attend his wedding because Cindy, his mother, does not approve of Shanann and does not want to lose her son to her. What does this say of Cindy? It would take a deeply narcissistic person to make her son's wedding about her and sabotage her son's happiness.According to the neighbours, Chris Watts is a subdued man. In his text messages to his wife, we see a man whose words do not reflect his actions. This is a man so accustomed to putting on a performance that he probably does not have a coherent sense of self because he has dedicated his life to appeasing everyone around him, not least his mother. According to Shanann's friends, she is bossy; in other words, she is a control freak. This is consistent with her anxious and validation-seeking personality. She massively over-reacts while at her in-laws despite an already tenuous relationship with Cindy. Her text messages to her friends and husband also do not paint a portrait of someone with healthy emotional regulation. Despite all of her protestations via text messages and hand-written letters to her husband detailing her anguish, she seems incapable of having face-to-face discussions with him without flying off the handle. This was a couple in dire need of relationship counselling and the basics of effective interpersonal communication.Nothing can bring back Shanann and the kids. Just as the lessons of air crashes have made air travel safer and prevented more lives lost unnecessarily to air crashes, these tragedies hopefully serve as cautionary tales to couples in toxic or unfulfilling relationships. Get help as soon as issues arise. Most of all, do not flog a dead horse. Sometimes the best thing to do is simply to walk away calmly with dignity."}, {"id": 143, "text": "Usually I absolutely despise spoilers, but 'American Murder: The Family Next Door' is actually one time I would recommend knowing the final result of before going in. I had this spoiled for me before watching and ultimately actually ended up being happy that it happened. The reason for this is that the most fascinating part of this documentary was watching the killer's movements throughout the runtime. Watching how they acted knowing full well what they'd done. It's one thing to watch a guilty character in a movie move about, but a whole other watching a real life person do it.This documentary was captivating from start to finish. It's unlike any documentary I've seen before in the sense that it contains zero current interviews. All the footage is from police body-cams, surveillance footage, interview room footage and Facebook footage. It almost feels like a real movie in that sense. I understand why not many documentaries are lucky enough to have this much footage available to them, but if they do they should absolutely always use it.This is a heart-breaking story. The details of the crime are absolutely devastating. It's not an easy watch. It is proof that pure evil does exist in this world sadly. It is a very well-made documentary though and well worth your time to watch it. I highly recommend this one."}, {"id": 144, "text": "This is a very intriguing and interesting case. Mainly because it is virtually impossible to understand why Chris Watts did what he did or how he thought he was going to get away with it.This film is almost redundant because of the sheer amount of information freely available on the 'net. I have gone through the whole CBI case file and transcribed the whole series of interviews just in an effort to understand what made this man tick and I'm still none the wiser. Chris Just comes across as the really nice bloke next door.Seriously wtf? This has to be one of the most stupidest, illogical and heartless crimes in history. I will never in a million years understand why he felt the need to do what he did. Never. Not only because it was just so callous but because there was no way he was getting away with it. Unless he really was that stupid.I could understand if Shan'ann was having the affair and was going to leave Chris and take the kids. I could understand that Chris might be devastated and committed murder out of despair. But that's not what happened. All he had to do was say goodbye and get a divorce.The film is ruined somewhat by the End statements highlighting how most family killers are male. I felt this unnecessary. Women also kill their children and partners. It doesn't matter if more men do it. It's not the sex that determines but their mental state. Don't witch-hunt men. Witch hunt psychopaths."}, {"id": 145, "text": "The documentary is about what , sadly, appears to be a typical young American family.There is a huge amount of footage from social media that the wife has narcissistically recorded. The husband is the strong silent type, in fact a neighbor comments he never talks. The wife on the other hand......She has literally mountains of footage of her and her beautiful daughters  and loquaciously rambles about every mundane thing they do, from making cookies to, just sitting around complementing each other. Eerily, she has an extremely enthusiastic smile pressed on to her face , almost as though she is smiling sardonically. at one point, she smiled so wide I feared the sides of her mouth were actually going to tear, like a surgical dehiscence gone awry . At first, I thought it was fake footage or a spoof, the Waiting for Gufffman movie, where they are doing a take off on a murder investigation. However, it turns out that they are all too real (or are they.........?)..... Early on the wife is described as bossy, and she boasts about how the husband has to do the dishes. Our current social milieu is such that the man in the relationship is suppose to gladly take on the hard and unplesant work, and the woman is suppose to do the fun part. Caveat- more than half our marraiges fail .I'm the hi strung one in the relationship  she say hes a great guy to put up with me ....She seemed to spend a lot of her time worrying about the way things looked, and not the way things felt, for her, her kids.......her husband.........She gave the impression she was the director of this movie that was her life, forgetting that the actors in the piece were real people, her partner and her kids. Tragically, her husband didn't do the right thing and leave her, instead he reacted to our environments message that a man can't abandon his family , so he commited a henious and unimaginable act. What we should all ask ourselves - is this what we want the typical American family to be ?.. is there something wrong with a society that produces this ?.... At the end they point out that most partners who kill their partner and kids are male . They fail to mention that most parents who killl their kids are female."}, {"id": 146, "text": "This is certainly a weird story. The guy seems like a loving husband until he goes bonkers. He gets himself in shape, finds a dumb floozy and then kills his wife and two kids.The thing is, the wife was a complete head case and drove him to doing it. (Bear with me, I'll come back around to this)She's a needy shrew like you've never seen or heard before who wants to control his every move and nothing he does is ever right with her. As if that's not enough she constantly tells her girlfriends her most personal things and humiliates her husband left and right. The woman was not a likeable person.She was shrew like no other. She absolutely drove him to killing her.BUT -- here's what never gets answered -- why didnt he just divorce her? The film tried to suggest it was premeditated but I'm not so sure. It seems more likely that she came home drunk at 2am that morning and started another fight with him and he snapped. On the other hand, if that was the case, why was there no marks on him? The woman's father thinks he did it when she was asleep. Hmmm.And then there's the kids. How on earth does a loving father (and there is plenty of video evidence the crazy mother took to prove this) kill two small children unless he's a monster?It's a psychologically unsatisfying ending. Yes, it's good he got caught, and we can see the motivation but once again, why not divorce unless it was just int eh heat of the moment.It wasnt until after he killed her that he started making plans t cover it up. And he didnt have a lot of time to do that since the wife had an equally crazy girlfriend who kept calling her ever 10 minutes 6 hours after she dropped her off from the night out and than called the police a few hours later.It's a sad disturbing story that leaves some important questions unanswered.Too bad teh producers didnt bother to interview the killer. He's in prison for life. Why didnt they reach out to him. Maybe he would shed some real light on the situation."}, {"id": 147, "text": "There is a clear difference when you watch a scripted movie, or even something as insane as Netflix's Tiger King, there is some entertainment to be had there.True crime documentaries like this, are not entertaining, are not enjoyable to watch, but yet these stories need to be told.Like The Trials of Gabriel Fernandez, Athlete A and other heart wrenching documentaries, Netflix has been able to dive deep into real stories that are not pleasant to watch, or even hear about, but we need to hear about it, learn from them. It is astounding to see how evil a person can be to harm their loved ones, but to not speak about these horrendous crimes serves no purpose beyond pretending the world is good, that people are good, and that is a lie.In an ideal world such heinous crimes would not exist, and there would not be horrible stories to be told."}, {"id": 148, "text": "I would like to offer a different perspective. I work in the social services, where one of my specialization is domestic violence. I have also done academic research in the field of domestic violence (or rather intimate partner violence). Most people are surprised - perhaps because of what we're told by the media - to learn that intimate partner violence is gender balanced, on the victim side as well as on the perpetrator side. Very often it is also reciprocal.There is not a handful or a dozen academic studies about this. There are literally hundreds of peer reviewed studies (see for example Fiebert 2013 for a summary) showing this. The real question is why we in the social services - as well as other public institutions like the police - are so bad at identifying male victims and female perpetrators.The portrayal of Shanann in this documentary is a textbook example of a perpetrator of intimate partner violence. Obsessed, controlling, and seeking to distance her partner from his own family. Textbook. As a former victim of intimate partner violence I recognized this dynamic clearly in this documentary. And I have to say that I reacted in a similar way to Chris. No, I didn't murder my ex, but I recognize the shutting down of emotions and retreating from intimacy.This of course does not excuse him murdering his wife, and especially not his children. But if the roles had been reversed there are a surprising amount of studies which would have described her as asserting herself. No, that is not a joke (see for example Dixon &amp; Graham-Kevan 2011 for a discussion).That said, the documentary was pretty flat."}, {"id": 149, "text": "One of the strongest and most powerful docs I've seen this year. You should watch it, but it'll stick to your head in a very jarring, uncomfortable and sad way. At first, I was a bit skeptical about the idea that the whole documentary was made using only Facebook videos and photos, police videos etc.But that turned out to be very shocking and gripped me really fast, making it a even more interesting experience, if you will.This led me to a terrifying conclusion about family, life, work, and my neighborhood, and that is that even if you actually think you know someone really well, there's something about them, that will (eventually) shock you. In a positive, or negative way, but on most cases, in a very negative way.Cuddle your dog, hug your children, say I love you to the person that stick to you even at the worst moments. Before it's too late. And for those who still are not married or are single at the moment, when the time comes, be yourself, always. Be loyal, passionate, and if you things aren't working out, try to fix them. If you can't, there's always ways you could make them even worst. So if needed, walk away. Respect each other. Love each other."}, {"id": 150, "text": "As I'm not from the US, this story was completely unknown to me. However, it has been in the top 10 viewed on Netflix in the Netherlands for a few days now, so I decided to give it a go.The fact that there is so much footage to piece together their lives in the last few days is mind-boggling to me, but this makes the documentary interesting to watch as well since everything is real and not subjective from interviews with relatives or something. Shanann didn't come off as very likable to me, although this of course does not excuse Chris' behaviour in any way. I'm curious if he never gave a better explanation for why he did what he did. Ending the documentary by saying it's mostly men who harm their families is a bit too easy, I had a feeling that his girlfriend was not as innocent as she was portrayed.All in all an interesting watch, but I feel bits and pieces are missing whether this is done on purpose or because simply not everything can be known about peoples lives unless you're living them."}, {"id": 151, "text": "This case will stay with me forever. I don't know exactly what makes it so compelling, but maybe it's Shanann's social media presence that makes us feel like we know her as a neighbor and friend. It is just so unfathomable how this guy could actually go through wiping out not ONLY his wife, but his own two daughters in the space of hours, and act like nothing was out of the ordinary. There was another case same year,- Kelsey Berreth in Woodland Park, CO. Her fiance Patrick Frazee, bludgeoned her to death in her condo with their infant daughter in back bedroom. He had been trying to get another girlfriend to do the job for him. I compare him to Chris Watts.. I've been reading how an ex-girlfriend described him, of the mind games he would play with her, and how he was thought of as so charming, laid back, nice guy. Very eerily similar to Chris Watts. It seems these psychopaths are all about control. They see their children as property that they are entitled to, that belongs soley to them. Patrick Frazee was upset that Kelsey wanted full custody of their daughter, and wanted to move away from him, closer to Pueblo where she worked as a pilot instructor. He plotted to kill her, then finally did it himself. I think that's what set Chris off the night he killed Shanann. He knew she would take the kids away from him, and to him that was giving her control over him, his life, his property. Psychopaths can't have that. They would rather kill than give up their control over their property. True, he could have just divorced. But, Shanann would take the kids, which meant the ultimate failure to him. It's strange, but to them it makes sense. I think that's the main reason he did what he did."}, {"id": 152, "text": "Okay, they clearly had trouble prior to this six week vacation that Shanaan took, but none of that was really explored, other than people mentioning that Shanaan was bossy (aka an insufferable nag.)This documentary was incomplete as it never went into the fact that is mentioned in other documentaries and news articles that Chris had hookups with men and his mistress had googled things about other killers' mistresses and writing a book before the investigation was even complete. It never touched on the fact that Shanaan was in an MLM and they were having serious financial troubles, and that Chris wasn't happy that Shanaan was pregnant again.Shanaan and Chris both suck and were crazy. Obviously, he's worse because he's a murderer and a cheater, but Shanaan seemed to have very inappropriate boundaries with her friends and family.Moral of the story, don't marry crazy."}, {"id": 153, "text": "This documentary hit Netflix a few weeks ago to quite a lot of fanfare and I have now had the chance to watch American Murder: The Family Next Door and here is my review for it. The premise of the doc is that in 2018 a normal mother and two young children disappeared and the doc tells the story into what happened.Now the things I thought that was good about this documentary, first I really liked that the footage used was all authentic tapes from the situation involved. It wasn't like some Docs that have high production values and try to recreate certain aspects, it feels very real and very raw and disturbing which it is clearly going for so it does its job well.Also, sometimes I feel like they like to make documentaries about anything these days but this was truly shocking, I am not going to go into too much depth as to what happens but it is one of those things that you will thinking about long after you have watched it, it just manages to stick into your mind.Usually I find documentaries that are only 90 minutes long to suffer from a lack of detail but this film doesn't suffer from that. If anything it suffers from the opposite, maybe it just takes a little too long to go into all the details keeping you waiting but it does still do it well enough.Overall, this documentary is truly disturbing and chilling and at around 90 minutes is a short watch so I would highly recommend it, especially if you are a fan of documentaries like this."}, {"id": 154, "text": "The story itself is awful and the murderer deserves his three life sentences. If you are not aware of the story you will find it shocking that someone could do that to their own family.That aside this is possibly the worst documentary I have ever seen. Put together as a series of clips from social media posts, police cameras etc and screen displayed texts it doesn't hang together, with no voiceover to carry the main story thread, it fails to explain anything new and doesn't explore the unanswered questions like why would someone post some of those family videos online when they are utterly mundane, why did the girlfriend not get challenged more when she seems to have been in the husband's life well before the crime and showed no remorse for the wife and children murdered. What about the background to a family in financial ruin and yet still spends like crazy.But worst of all is the anti-men statements at the end. Domestic violence may well be carried out predominantly by men but does that mean a woman who kills her husband and children or who even batters them regularly isn't as bad as a man doing it?"}, {"id": 155, "text": "All I can say is wow, a very, very, VERY compelling Movie, for a number of reasons.First, it is very contemporary, majority of the materials they used like the Pictures, Videos, even private Conversations were taken from Soeial Media Accounts, especially Facebook.This gives the Viewers get a very good idea or insight of how the People involved really were in their Private Lives. Second is that it is a pretty effective Thriller also in that we really don't know what really happened until near the very end of the Movie when the complete confession is made.Third is the nature of the Crime itself. It is just unbelievably shocking that anybody could ever do it. The perpetrator is either incredibly stupi*, or just plain insane that such a Crime to be committed.Absolutely shocking. No wonder it is creating a lot of buzz, a lot of word of mouth recommendation. A Must See for me."}, {"id": 156, "text": "Things I liked were the stylistic choices made for this doco. Showing the story from first hand accounts, not through news footage or trial by media resources. Personal videos, police bodycam and interview processes were predominantly used which meant the story was not lost amongst unnecessary side stories. I didn't like the text messages though as for some reason they made it out like they were occurring while we were watching the doco and included self correcting errors in these messages. These messages were sent years ago without the knowledge of self correction errors! As a person who lives outside of the U.S., I had no knowledge of the crime and was surprised by the outcome. The doco did leave me with more questions that they could have answered easily and the end credits were disconnected to the story somewhat due them being just blatant statements. I know due to being a crime buff that the statements are mostly true but not completely. For example, in a case like this one, usually the perpetrator commits suicide, but that wasn't mentioned. Overall, solid doco that's not too long and doesn't contain superficial side stories and let's the crime speak and unfold for itself."}, {"id": 157, "text": "09/30/2020 The murderer in this film is emotionally empty inside, devoid of all things necessary to be a human being. His premeditated slaughter of those who loved him the most defines his being. All of his words in this film were self serving lies, his goal? A new irresponsible life, FREE from his false commitments made to his children, his wife, his extended family and the $ecurity of a home belonging to his wife. By his actions he has clearly proven his truth - He has NO human value, so why does he still get to live after being convicted of killing others? If any of the innocents in this film were members your family, would you want to know that until he dies of old age, every day he will be fed, clothed, protected by law enforcement from those seeking revenge, free to watch tv, free to socialize with other like minded inhuman beings, housed by the state and going to sleep each night in a soft warm bed while his victims are forever doomed to a cold dark box down in the earth. Who speaks for them regarding his lack of punishment? His right to life ended the very second that he decided to kill the first member of his family so why is he still alive?"}, {"id": 158, "text": "STAR RATING: ***** Saturday Night **** Friday Night *** Friday Morning ** Sunday Night * Monday MorningIn 2018, in Colorado, Shanan Watts and her two young daughters Bella and Celeste went missing, causing her best friend Nickole to phone the police. Reporting to the home she shared with husband Chris, without a warrant to enter, they asked his permission to come in, where Chris tried to convince them that Shanan had taken the kids and run out on him after an argument. But as the disappearance went on, and events became more suspicious, a sinister truth emerged, as Chris's affair with a woman named Nichol came to light, and after failing a polygraph test, he was arrested and later convicted of the murder of his wife and daughters, pleading guilty to avoid the death penalty.As human beings, collectively we must all have become depressingly desensitized to the evil and depravity some among us can stoop to, but that doesn't mean on the (thankfully) rare occasions that such events happen, they don't still have the power to make us doubt our faith in humanity, such as the case of Chris Watts, which made headline news around the world two years ago, and which this documentary from Jenny Popplewell explores, though thankfully not in a trashy or exploitative way, with sensitivity for those left behind to pick up the pieces.At first glance, I was preparing to tuck myself in for the long run, as it looked like yet another of those long winded, eleven or so part documentary series Netflix is known for, often covering admittedly interesting subjects, but which they're just overloaded with, to the point of saturation, but alas it's actually a one off, brief little effort, that simply relays the timeline of events, from the disappearance of the mother and children, through to the revelation of their fates, without going in to any great depth, such as any talking heads delivering any inside detail, which ends up robbing it of some more lasting impact.It's a naturally horrifying true life story, of unspeakable evil and depravity, and nothing in Popplewell's presentation dilutes any of the gravity of that, but by pretty much just charting the course of how it all unfolded, without providing any insight into the background dynamics, it doesn't do true justice to this latest indictment of the 'American' dream. ***"}, {"id": 159, "text": "On my way to see this on Netflix and I got distracted by Schitt's Creek and 5 episodes later, I finally made it to the American Murder: The Family Next Door.Most notable thing about this movie was I remember watching this live, or close enough. People on YouTube were already putting all the videos, evidence and theories in Videos that weekend in 2018 and it was so interesting to practically follow the case live.So, I learned and seen 85% of the footage in this documentary more than 2 years ago. But it was fine for a recap (though I remembered everything, down to the polygraph lady) and I thoroughly enjoyed the remaining 15% footage...AND outcome. Of course, I never heard what happened back then and until today, I had completely forgotten about the case.Basically, it's a real-life Gone Girl of sorts, but it does NOT take too long for the cops to narrow their suspect list down when they're working the case of missing &amp; pregnant Shanann Watts and her two very young daughters. At first, happy husband Chris states he went to work and during the day sometime, his wife and daughters were either abducted out of their peaceful neighborhood's home or she left him and took the kids as well. But, is his recollection the correct story of her and their children's whereabouts?It's not a bad documentary, it's just so str8 to the point, I see it might have been hard to fill all 80 minutes of it. As a matter of fact, I would've like to seen a little but more. But, what they presented was just fine. And it couldn't have been easy to get permission for all the pieces (video/texts/footage) so I respect them.My biggest gripe and this isn't a criticism so much if I'm wrong, but it felt like the focus was so heavily on wife and husband, Shanann and Chris, that it's hard to feel for what happened to the kids. Not to mention she was pregnant at the time of her disappearance. This documentary almost makes you forget about those 2½ kids.***Final thoughts: Trust no one! Not One Neighbor! Don't be that neighbor videoed for the Local 5 o'clock who says, Oh, he was so sweet, so quiet, I can't even imagine he'd do that! Everyone's a Suspect! And Can Be a Criminal!And that was my only paranoid moment. Thank you."}, {"id": 160, "text": "If you think this film is good I feel bad for you because you have obviously never seen a well made movie. This is absolutely nothing but a HORRIBLE mash up of Youtube videos. There is nothing new presented, no facts, no interviews nadda. Go on Youtube and you will find WAY more interesting videos with more content and you will Easily see this was just really badly made mix of their videos passed off as a documentary.THAT BEING SAID... the police who interviewed Chris also did a very bad job it was so obvious they were playing the sympathy card to get him to talk and even GAVE Chris a plausible way out by VICTIM BLAMING Shannon which was disgusting and of course he took advantage of it. Secondly police clearly set Chris up by letting him talk to his dad knowing the cameras were rolling and they would be watching because again in the Youtube videos which show much more and better content the police come in just as Chris confessed and he was talking to his dad about laywers... I'm NOT justifying what Chris did because it was EVIL and MONSTROUS but if he tries to say police coerced him he just might have a case. Kuddos to the neighbor and Shannons friend for coming forward for the victims. Regardless of how piss poor it was made its a very very sad story. I'm glad justice was done but Shannon, Bella, Celeste and the baby are still gone and we will never truly know why. And I still want to know his logic about putting his own children in an OIL WELL but NOT Shannon. Anyways of you live under a rock and haven't heard of the story its worth a watch but again go to YOUTUBE because there is much more and valuable information there."}, {"id": 161, "text": "How do you rate a real life story as horrible and tragic as this one? I don't know. I honestly don't know how I feel about this documentary! It's barely been 2 years since this awful thing happened and already they've made a doc about it! I mean I guess they got Shanann's family's approval but all I think this does is draw more sick and twisted women into sending this psychopath more letters, since that's of course already happening, some women are just that fu***ing sick! But how do you rate something like this? Of course I've already watched videos and documentaries about this on YT so I know every aspect of this story but I still kinda wanted to see how they'd do it on Netflix since they often do documentaries fairly good. This one though hits you right in the freaking gut! What this sorry excuse for a human did is unthinkable, unimaginable and something you really only hope to see in movies, not real life!!! The whole world knows about this case I would think, I live in Iceland and I heard about it so I don't really understand the need for a documentary on Netflix. To me it's just giving this piece of s**t more attention than he ever deserves. This is someone who should not be put to death, this man should suffer for the rest of his life in a cage, but sadly he won't, even if he'll be in prison for the rest of his life, which I'm really hoping he will, he still gets meals done for him, he gets letters from sick women, he gets to breath the air we breath when he should be rotting in solitary for the rest of his miserable life. I hadn't watched 10 minutes of this doc when I already had tears in my eyes seeing that woman and those babies and knowing what he did to them, so so brutal it can't even be put into words how he killed his daughters!!! And hearing Shanann saying he's the best thing that's ever happened to me and hearing her family say nice things to him at their wedding, I mean wow! How is this possible? how can you seemingly love someone for this long, love your kids and seem from all perspective as a normal and good guy and then go and brutally and senselessly slaughter your entire family FOR NO GOD DAMN reason other than he wanted a new life with his homewrecking mistress!??!?????? Have people not heard about this thing called DIVORCE!? Would that have been to much of a hassle for him? I'll never understand this, of course since I'm a sane human with empathy while he's a narcissistic self serving psychopath. This is a good documentary, I will say that but you can get basically all this info from varies YT videos so choose for yourself. Rest in peace beautiful family, the unborn Nico included! My heart breaks for them and for their family."}, {"id": 162, "text": "Removing the horrific content for a moment and focusing on the documentary, as that's what imdb is supposed to be for and not a social media comment board.Having a collection of clips removed from commentary or analysis might be a fresh approach but in the context of a complex and unimaginable crime such as this, it is far from appropriate. There is no analysis. No background of the people involved. No interviews with any of the people involved, psychologists, investigators, nothing. For that reason you cannot even call this a documentary. It's very thin. A documentary should reveal, not cloud.A unforgivable and completely avoidable technical error was the lack of subtitles in all of the police interview scenes. The dialog was barely comprehendible. Personally I could make out about 40% of it. If ever footage required subtitles, it was this one.Instead the director is far more interested in providing flashy emoji recreated comment graphics from text messages. The director to me, feels inexperienced. Even immature.The closing graphics are sexist and not accurate. Yes partner related death is mostly caused by men. Children are sadly murdered by both genders in equal amounts. In some areas, the mothers are more likely to do it. You can research yourself and find this out. Look up women's prisons. You can access the information of why their inmates are incarcerated. I looked up one and found that over half of the women there was due to the fact that they had murdered their children. The director's comments was sexist. The comment 'virtually , always' shows you the lack of maturity involved. Feelings isn't fact.I was left feeling perplexed and frustrated. If this is what passes for a documentary today then it's a pretty sad representation of what passes for one."}], "reviews_amount": 163}