{"name": "Thambi", "titleId": "tt12553190", "reviews": [{"id": 0, "text": "The first half of the movie is so average and gave a feel like below average movie but, after interval block it had totally changed because of the superb twists and turns. Karthi,Sathyaraj and jo had given a decent and beautiful role in this film.One time watchable,book the tickets and go and watch with your family"}, {"id": 1, "text": "Thrilling roller coaster! Screenplay &amp; BGM plays the major part. Karthi &amp; Sathyaraj - takes the movie to the next level. must watch!"}, {"id": 2, "text": "Good movie , nice screenplay ,2nd half twist is unexpected, all actors well played with their roles, Karthi jothika well played, my rating 4/5 for this movie, nice cinematography worthy watch in theatre"}, {"id": 3, "text": "Good movie... twist and thrill ! Feel the Drishyam in the movie.... recommended to watch!!! Rating 7.5 to 8...!"}, {"id": 4, "text": "This is one film which leaves you guessing till the end and every guess you make is almost always wrong. That's what makes a good thriller film."}, {"id": 5, "text": "Though the story doesn't move too much up until then interval block, the first half is very much enjoyable with Karthi's humorous mannerisms. The internal block presents a couple of twists which sets the tone for the second half, which is a mix of emotions and twists and is very much engaging. The performances of Karthi, Jyothika and Sathyaraj form the main pillars of the movie along with the brother-sister emotions and the well-executed screenplay. Definitely a worth watch in theatre."}, {"id": 6, "text": "Awesom movie. Worth money. Sure entertainer. The thrill begins from Interval and keeps the pace throughout then."}, {"id": 7, "text": "An entertainment roller coaster of a thriller story with enough twists and turns till the end. I didn't expect anything from the movie in the name of Karthi or Jothika. Just started watching it as any movie on Netflix... and the movie did well till end. Its just that, unfortunately I read the Parental Guidance on IMDB before watching the movie which normally I do to watch with my kids, but that had a line of spoiler that made me guess the end twist a little earlier. So, please don't read it if you want to enjoy it through out and yes, there's nothing too much to worry to watch with Kids apart from the regular Indian movie fight violences and song glamours."}, {"id": 8, "text": "At first seeing the reviews I thought that the movie will be as good as papanasam which is director jeetu Joseph's own thriller movie but total disappointment. Story is so simple not that much thriller. Only plus point is karthi's acting. Jothika as usual over acting. If parvati character played by actress simran or sneha it would be better."}, {"id": 9, "text": "Mora views: Drama thriller combo Worked well in favour of directors expectation Certain scenes are very predictable Karthik as usual did a rogue character effortlessly, Jyotika portion is ok but underutilised her talent. One time watchable n worth spending money."}, {"id": 10, "text": "The plot and the presentation is very good though the unfolding of the plot is rushed through. Director has ensured to keep the audience engaged and it's worth watching"}, {"id": 11, "text": "Thambi is a good family-thriller with great performances by the cast and a well engaging second half.."}, {"id": 12, "text": "The movie was very thrilling and sentiment . Family audience can watch this movie. The cinema lovers also can watch this movie . Very very twisted"}, {"id": 13, "text": "This movie has got a medium rated first half of comedy and romance . Second half is good action thriller. Overall it is a mix of things."}, {"id": 14, "text": "Totally wasted unworthy movie ever.very boring"}, {"id": 15, "text": "A pure family drama with almost the same storyline as the director's last installment Drishyam with few changes in it, but on a high level the moral of the story stays the same. Drishyam worked well because it is a pure Malaya movie with casual scenes but Thambi is like mixing up a Malayalam's casual moviemaking with Tamil commercial masala sprayed on top of it which feels like nothing but crap because we've seen all these craps in so many older movies. There could've been some emotional bonding scenes which might've made it work at least for the family audiences but I think they omitted it just to avoid the mocks from the audience since it impacts the baseline of the story which breaks only in the end of the movie."}, {"id": 16, "text": "Acting on the part of everyone except for Sathyaraj are mediocre... The music is dull and the background score leaves a lot to be desired. The direction and editing is a bit messy as well and there are gaps and goof-ups that a good writer or director would have corrected... But, the movie works and keeps you engaged purely for its story line .. and when a movie comes under the banner of being a thriller and is able to throw a twist that most people would not have expected, then it surely does succeed to some extent :) Decent watch."}, {"id": 17, "text": "Yes the plot was not upto the mark but the twist in movie changes everything. A decent family movie."}, {"id": 18, "text": "Movies twist and turns are interesting but some scenes very unnecessary . acting of sathyaraj , Karthik and jyothika is powerful . background music is average. First half is slow could be better. Overall movie is good entertainer movie .twist and turns is plus point of movi."}, {"id": 19, "text": "Good thriller with many twists just watch and enjoy dont care about negative reviews those ppl have no taste about movies."}, {"id": 20, "text": "The idea of the movie is great, i was expecting a cliche climax but the plot twist was so good. Never expected that.But screenplay and direction kind of made the movie an average watch.I don't understand why the writer director Drishyam (a plot which is so twisted and so brilliant) failed to execute this story.This should've made in par or better than Drishyam. Bad luck for the audience."}, {"id": 21, "text": "Like another reviewer has already mentioned, I am also surprised by the relatively low IMDB rating (6.8) for this movie. In my opinion, Thambi is one of the best Tamil movies ever made. It has a gripping story and screenplay, plus really excellent performances from Karthi, Jyothika, Sathyaraj &amp; Sowcar Janaki. The first half is good, but it is in the second half with the various gripping twists annd turns, that this movie really comes to shape as a true edge-of-the-seat thriller.In fact, amongst Karthi's movies, I prefer Thambi over his other blockbuster Kaithi. Highly recommended to watch."}, {"id": 22, "text": "Karthi plays the male lead who comes home pretending to be Jyothika's brother. The audience will know the he's not her brother at the beginning itself and that's ofcourse not the unexpected part of the movie. First half may be a little slow compared to the second half. It's worth waiting for the second half as it's filled with full of senspense till the end of the movie. First half of the movie will surely not impress you, but second half will be better than expected. Jyothika's acting is really good, it's something you can expect from a senior actor. Sathyaraj has a played quite a good role. In a nutshell, you'll not regret watching this one."}, {"id": 23, "text": "Good Movie. Everybody acted very well in the movie. Songs were not needed in the movie. BGM in the movie was so good. The movie was interesting and thrilling but the movie was not so interesting and thrilling as Papanasam. This movie is one of the Best Tamil Thriller Movie and one of the Best Tamil Movie of 2019. Good Movie."}, {"id": 24, "text": "Good storyline and well paced. Definitely a watch !!"}, {"id": 25, "text": "The plot is pretty old - A fraud protagonist enters a family claiming he is the long lost brother they are looking for. There are lot of twists and turns behind this and keeps you hooked most of the time. Though the plot is racy and unpredictable, it lacks logic after the reveal and it keeps you wondering - Why?!?. It could have been much better flick had some small elements in the narration had been taken care of. A good entertaining watch in Netflix!!"}, {"id": 26, "text": "Again papanasam with a different narration.... first half is slow but comedy scenes worked well.... second half is good with some twists..."}, {"id": 27, "text": "Good mystery thriller movie..first half goes slow and 2nd half awesome...didnt expect those twists..songs and musics didnt impressed.overall worth to watch without over expections..."}, {"id": 28, "text": "As per our jeethu joseph film this movie also had a huge twist at the conclusion. This twist is not even predicted by anyone while watching this movie but not too much as Papanasam. Comparing to Papanasam this movie is less packaged twist. Worth a watch"}, {"id": 29, "text": "Karthi sathyraj nikila act super jythoika act improvement child cast acting screen play nice govind vasantha bgm perfect music melody level story 1half slow poison 2half expected level suspension climax fanatastic total FAMILY ENTERTAINED GOOD MOVIE 3.5/5"}, {"id": 30, "text": "Love the plot, but the movie travelled in a very slow phase, or something was really missing. Leads done their best, songs are ok. From 2nd half I see only Kaithi Karthik in face/reaction, etc. no change in make up, reaction, etc. overall a watchable action thriller but worth for 6/10."}, {"id": 31, "text": "Quite a thriller and worth watching. Songs were not necessary. Great script and screenplay."}, {"id": 32, "text": "Expectations were riding high on this Combo after Karthi's 'Kaidhi' and Jeethu Joseph's 'Drishyam', Writing should have much better with more engaging scenes. Cakewalk role for Jyothika, Karthi and Sathyaraj! 2nd half was quite engaging when compared to the dull 1st half. FINAL WORD - A Timepass Flick!"}, {"id": 33, "text": "Jeethu Joseph tries hard to retain the vibe of Drishyam/Papanasam in his latest outing, starring Karthi, Jyothika, Sathyaraj, and Nikhila Vimal. The effort is commendable, and Thambi indeed is a 'family thriller', but the thriller dots barely connect and the emotional dots do not connect at all. Yet, what keeps the film afloat are the casting choices and the manner in which Jeethu tries to pull off a rather far-fetched make-believe.It, however, fails in drawing great connects between the various members in the family, especially between brother and sister. Also, the placement of red-herrings is sometimes too evident in the screenplay. The first half is quite underwhelming with the prodigal son (or just a con-man?) returning to his home after 15 years and adjusting to the newfound surroundings. There are a number of song sequences, a by-the-numbers romantic angle that doesn't add meat to the central storyline, and a subplot that barely reveals character intentions.Things do get better in the second half, but at one point, you're subjected to fight sequence after fight sequence without any solid improvement in the plot. The murders in Thambi aren't covered up as phenomenally as the one in Drishyam was. And when the big twist comes around, one does tend to feel that the sole purpose of many earlier scenes was only to distract and deceive. The ensemble does a neat-to-serviceable job with their characters, with Sathyaraj the only one standing out. I also enjoyed Sowcar Janaki's presence in the movie.Thambi is no Papanasam or Parasite, I can tell you that. It's not a difficult film to sit through, but it could have been a lot (I mean A LOT!) better."}, {"id": 34, "text": "Director Jeethu Joseph is back again with his second Tamil film after Papanasam. The film is about Parvathy who is waiting for her long-lost brother. Then, enters Vicky, a trickster, posting as her brother for looting money from the family. The twists and turns after that forms the crux of the movie. So let's check out the plus and minus points of the movie.Plus :1) Performances - Every actor proves their experience in acting with their performances.2) Second half - Second half is filled with many twists which succeed as much as possible to be an edge-of-the-seat thriller.3) Stunts - The fight sequences are well choreographed even though some seems to be over-the-top.4) Unpredictable scenes - The unpredictability factor starts from the interval twist and carries till the climax.Minus :1) First half - More time in the first half is spent on exploring the characters which does not engage.2) Songs - None of the songs gives us the impact.3) Unwanted scenes - Some scenes were felt unwanted even though it does not disturb the flow of the movie.Overall, Thambi is a good family-thriller with great performances by the cast and a well engaging second half.Rating - 8/10"}, {"id": 35, "text": " Thambi Tamil movie.Mystery thriller with an extra dose of sentiments.MLA living with his wife and daughter, searching his son, who had disappeared, 15 years ago. A con man, from Goa, comes into the scene as his son, bringing happiness and brightness in that family.Story unfolds in first half, mostly as drama genre movie, to take us to an unexpected interval with a chilling suspense. Second half is in tune with thriller, with overtones of sentiments.Story and screenplay carefully crafted well and director Jeethu Joseph has presented well, yet another thriller. Compared to his previous outings like 'Memories', 'Drishyam' ...this thriller is not that intense.And these kinda story, we had seen in movies like 'Charithram' 1989 Malayalam, 'Imposter' 2012 English.... So this movie storyline maybe inspired or plagerized from the references.Camera work is superb to keep the suspense and tension intact.7 on 10 for this dragging thriller lasting 2 hours and 30 minutes.Karthi as the con man and Sathyaraj as the MLA, shone well in their respective performances.Well knitted presentation with unexpected twists and turns to keep the audience, guessing who is hero and villains are.Safe watch"}], "reviews_amount": 36}