{"name": "Close Encounters of the Fifth Kind", "titleId": "tt12108272", "reviews": [{"id": 0, "text": "Starts well then turns into an hour of him preaching for you to contact aliens before the evil government does and when you go online to learn how he just trys to sell his books and courses. If he meant what he preached for the reasons he gave, he wouldn't charge money. I guess that's how they get you. Felt letdown as unacknowledged was really good."}, {"id": 1, "text": "The ad to download his $10 app at the very end of this film really left a bad taste in my mouth. And really goes against everything he says he stands against. The black opp government programs keeping it a secret for their own financial gain. And how we need to bring this to light. And then asks us to pay for an app to be enlightened. Lolol. Wow! Is all I have to say. Ruins everything I was believing up until that very moment. What an idiot I am for going that far in the movie. He should be ashamed of himself. This is all BS. To make him money. Or else he would give the app for free. Dont be dumb and pay $10 to make this jackass rich off of our imaginations. Great work Greer"}, {"id": 2, "text": "I´ve been a big fan of The Disclosure Project, and when the film Unacknowledged was released, I watched with a kind of disappointment how it all drifted towards a quasi-spiritual personal mumbo jumbo project. It was, however, possible to ignore most of the embarrasing stuff and focus on the actual documentation parts pertaining UFOs. This time, Dr. Greer has gone completely off the rails. Babbling away about his own magic psychic abilities, a godlike power to summon and send away UFOs and aliens, and nutcase claims about his friends being assassinated because of what the know.It also turns out that the US gvmt almost routinely abduct people in Skunk Works built UFOs, where various disabled people act as aliens. This as a tool to manipulate nosy politicians etc. The subject of government funded projects for building precise copies of alien craft and tech is emphasized in the movie. Yet, everything Greer and his companions experiences, is the real thing. I guess Greer can tell because he sends his mind into the ships to check things out.It´s just too much to mention. I don´t know if Greer&amp;Co. does this only to make money of simpletons and loonies, or if it´s an actual insight into a completely twisted and delusional mind. Probably a mix of both.UFO phenomena in and of it self is mind blowing and exciting. The documentation is there, undenied. We are free to explore it in a constructive way. Sadly, Greer and his peers burns to the ground, with this one single travesty of a film, the credibility and curiosity having been carefully built up around UFOs over decades. What could have been a contribution to an open and interesting approach, is drowned by the ridiculous stream of words from the lawyer guy, and of course Greer´s banalities about meditation, consciousness and him self as a sort of christ; he is the chosen one, and we can only fully communicate with aliens through Greer as a proxy.Oddly enough, Greer also insists that UFOs need telepathic help from us to find where we are so they can show up when summoned. In the next sentence, Greer informs us that the UFO´s represent technologies and evolution maybe millions of years ahead of us. Still, they supposedly pilot their crafts personally, with control sticks etc, and need Greers help to find Blue Ridge mountain. Not a single time through this massive, uninterrupted or challenged Greer promotion video does anyone even hint to the possibility of UFO´s being some sort of drones, multi-dimensional visitors or other. Instead, they are obviously contained well within our old fashioned understanding of the universe and physics, blazing through space with speeds many times faster than the light, etc.One thing is for sure: anyone who in the future wants to discredit everything that has anything to do with extra terrestrial phenomenon, need only point to this documentary to win the arguments. Courtesy of Dr Greer and his annoying little sect. Sorry for any typos, not my native language."}, {"id": 3, "text": "Starts out interesting enough, then halfway through... BAM new age mumbo jumbo. If we just meditate then we can fly, and teleport, and dematerialize.So stupid."}, {"id": 4, "text": "If you can convince people to pay you a lot of money to buy your books, courses and then go meditate with you (to contact aliens!) then good for you. I respect cult leaders so much because I can't even begin to understand how they do it. That earns this documentary the second star ... If you can take money away from morons, do it all day everyday, it's good for evolution! This greer guy is doing us a service! (yes he is destroying every last bit of maybe in the minds of people skeptical about UFOs, but still, Kudos!)"}, {"id": 5, "text": "These people are OUT there. What a ridiculous wannabe documentary... Hard pass."}, {"id": 6, "text": "This documentary is a but of a leap of faith. Pretty cult like imo. Hey.. anyone else wonder why there hasn't been any UFO videos since smartphones came out? ;)"}, {"id": 7, "text": "Insane. Ridiculous. Gave it some stars for comedic value."}, {"id": 8, "text": "It was a good start, but when he went to meditation to Bring ships on it really lost me.All the photos at that point seem to be fakes. How can theyball be meditating AND seeing objects? Like then one producer of CE5 said.. I was drinking coffee and then saw the ships. Didnt know you could drink at the same time you are meditating at the same time seeing objects with a camera.The events, all the photos are on the ground and have random lights appear. With all the explanation of how good our technogy is to fake these things, I cannt bring myself to believe Rays of light at ground level are aliens. Thats just bonkers. The photos of actual Alien healers Looks just like a guy with a camera on himself.None of these show proof, just another form of could be, couldnt be. If it didnt cost 1000s of dollars to go out to these events, I would believe it more. Seems like a marketing scam. Like the other post said, random quotes and hoaxes that have been completely debunked are shown here as real. Lost a bit of respect for Greer."}, {"id": 9, "text": "With all due respect, I found this so outlandish and bombastic.If you want to believe, this might help. Hop on the confirmation bias train. Next stop, a UFO filled with friendly, intelligent aliens.If you're unsure what to believe, you'd have to be pretty...um... credulous for this to convince you of anything.If you're skeptical, don't even waste your time or money. Seriously. It wasn't entertaining."}, {"id": 10, "text": "The opening monologue states that the US military has admitted that alien craft exist. This is not correct. The US military have admitted that there are unidentified craft, the has been no official link to aliens. When the opening statement makes such a factual gaff, I was unable to continue with any degree of trust that anything being presented to me was based in fact.What a silly thing to do."}, {"id": 11, "text": "This movie is 'The Secret,' or 'What the Bleep is Going On,' from the early '00s, except with aliens. There wasn't much to it except for new age woo-woo centered around the belief in alien visitors. You have to suspend disbelief to get through this movie. It presented no new ideas or evidence to soften my skepticism.I suspect the only people who will enjoy this film will be true believers. If you're a skeptic of ufology, I'd recommend you pass on this one. It's a waste of time. If you want to watch an alien-themed work of fiction, watch Steven Spielberg's 1977 film Close Encounters of the Third Kind."}, {"id": 12, "text": "Same old Dr Greer here, Revealing NOTHING new, except his new ideas that are almost comical, don't waste your time here, all old material. Just scrapes in at 3/10."}, {"id": 13, "text": "Basically a tv ad made into a movie...at the end its buy buy buy...there is nothing new about UFOs..no mindblowing evidence of alien life..waste of almost 2 hrs"}, {"id": 14, "text": "Found his previous documentaries very interesting, I was looking forward to watching this new one. But this, this is a bunch of rubbish about meditation. A lot of vague nonsense and videos recorded with a Nokia 9610 so don't show anything yet. tall stories that they themselves take too seriously. Greer is lost his credibility with me!"}, {"id": 15, "text": "Biggest load of garbage I have watched for a while. these guys claim that the meditate tap into there conscious and then ufos appear in the far distance. so these ufos come all the way from another galaxy just to fly around in the far distance so they can capture them on camera. If this greer guy is so good then why doesn't he tap into his conscious and tell the Martian to come out of the ufo and come up and shake his hand."}, {"id": 16, "text": "Loved Close Encounters of the 3rd kind as a kid. This movie is nothing like it. Happy to engage in a little speculation and fantasy but this movie tries to be serious yet is so dumb and unscientific it hurts my brain. The tinfoil hat and conspiracy crowd will no doubt eat it up. Btw, preparing briefs for presidents is not the same thing as actually briefing presidents (no one grantedthis guy a meeting). Just because credible and intelligent people in positions of responsibility reject this nonsense doesn't make it a conspiracy."}, {"id": 17, "text": "So basically, sometime in the 1960s a whole bunch of people experimented with some pretty strong drugs. These people grew up to be normal looking adults, except there are some short-circuits in their brains. These lsd frazzled loonies are able to see lights and beings that nobody else can, all just by meditating in groups made up of numerous escaped patients....!! It's very hard to take any of this documentary seriously, the proof of these visitors seems to mainly consist of a few lights in the sky..."}, {"id": 18, "text": "I'm still amazed at the crap people buy into. This is an excellent example."}, {"id": 19, "text": "The first half is alot of redundancy from previous shows/documentarys. much filler video footage that has nothing to do with ufo's. some interesting footage, some fake footage (florida gulf breeze hoax and others).... and alot of 3rd hand so-called evidence. then comes the 2nd half....this is where, with this release - steven greer has lost all credibility.as usual - real solid evidence .... absolutely ZEROsame ole, same ole ... not worth a true believers time."}, {"id": 20, "text": "Any shred of evidence for thousands of claims made in the video ? NONE The docu starts with guilt tripping people for not being able to find a meaning to this chaotic universe. The amount of conspiracy theories in the land of the free is really frightening."}, {"id": 21, "text": "They fly with a speed we can't comprehend , they go to America and just crash or make a light show , you can record them just in low resolution . Almost all records are form cold-war period so a lot of prototype planes could get pass easily on the night sky like ufo's , nothing real or based on facts , when will get a clear image for an ufo maybe then will be one fact."}, {"id": 22, "text": "If your reading these then you already know what this documentary is about. If you don't then please watch the other Dr Greer informative films either before or after :)It was all that I expected it to be and more. I know for sure this man was placed on his platform for a reason and it is to HELP &amp; ASSIST us human beings! Well done 👍 and I cannot wait for more &amp; to dig into more CE5 contact information &amp; the community on the app!!Oh yeah good job with having the narrative of Jermey Piven 😊"}, {"id": 23, "text": "It's a pretty darn well made documentary but, sadly amidst allegations of Dr. Greer being labeled a fraud over some incident involving flares, my heart has sunk... I thought he was one of the good ones. It does make sense though, despite the respect I have for the hard work and effort he's put into the Disclosure project, I cant help but sigh and roll my eyes at his claims of making UFOs appear from willing them forth with his mind (how impressive!). I'm sorry, but I can only suspend my disbelief up to a certain point. I'm still a 100% believer in the existence of aliens and UFO's visiting earth, but I am unfortunately an abysmal 10% believer in Dr. Steven Greer. And it is for everything I have stated above that I cant in good conscience give this albeit, well made documentary a score higher than a 6. It was entertaining at least."}, {"id": 24, "text": "I have been waiting all my life for this documentary! This knowledge confirms what I have always deeply felt inside of me - he had never could decipher in my mind. So stimulating, intellectually as well as emotionally, this beautiful film is not just full of knowledge and affirmation, but also brings forward the undeniable power of thought. Excellent work Dr. Greer! Ny next move is to purchase the CE5 Contact app and get out there with the team in my area! 🙏🌏🙏"}, {"id": 25, "text": "The film was a bit hit and miss with no new ufo , alien information , its premise is your mind is your window to the universe and you can have outer body experiences and meet your friendly neighbour hood alien, as long as you are of good character who is open, honest and pure of thought , the best of the best ,eugenics comes to mind . From the off we get the lsd mk ultra music and it never ends through the picture , greer telling us endless stories of when he met royals ,people of power and intellect - new world order stuff, then you are sitting in a circle been preached to by the leader greer ,telling you its free to do , yeah if you buy the app or join the movement , or as is known a cult , he also had is thoughts on atip which he was right to do but, atip have a rock star front man , so he got a rockstar front man to make him cool , very childish stuff . Aliens,ufos are not what this film is about ,its about money , the con is on."}, {"id": 26, "text": "It's ok. Maybe if I was high or a seasoned super-sensitive meditator that understood all of what they were explaining, I might be able to relate. But...(I think) they stated that the government has craft that looks like/performs like UFOs. What if all (or, at least, some) of the things they saw was the aforementioned craft?? Regardless, I want to party with these cowboys..."}, {"id": 27, "text": "I tried to watch it with an open mind, yet he failed to show some hard evidence to silence my skepticism. Btw were there any actual reporters, not belonging to this cult, on site? Coz I'd love to be there at one of their sessions and watch from a distance, without being involved in their meditation. If I end up seeing and capturing on video these unexplained lights, I'd probably be impressed. Not that I'd immediately jump to the conclusion that we've been contacted by aliens! Rather I'd try the repeatability of the phenomenon and hence do a lot more proper scientific research. Until that happens, this 2 hour documentary deserves a 1/10."}, {"id": 28, "text": "The best documentary I've ever watched. It talks about finally what you can do to make a change. Things that work. Not just another speculation on UFO phenomenon showing bunch of videos. This movie goes beyond it. Not new for people who's been following Dr. Greer for years. A bomb for people that will see it for the first time. Group, study CE-5 protocols take on the secrecy, bypass the elite and make your own Et contact. Move forward to another level of civilization.If you can take it."}, {"id": 29, "text": "I was really excited before it started. But stupidity increased as the documentary progressed. Its perfectly possible for aliens to be multidimensional, but I am sure they're not just sitting in mountains looking at illusions. Even if any of it is true, there is zero scientific evidence presented."}, {"id": 30, "text": "Everything in this documentary is old news to anyone who has the ability to understand themselves and this world. If it comes off as mumbo jumbo then you are not paying attention to what he's saying and you are not ready to hear whats in it. Theres alot of shills on this website trying to discredit the whole feature before even getting a chance to see it.Don't listen. Watch for yourself and make an informed decision."}, {"id": 31, "text": "This film is a Tour De Force in insight, messaging, sounds, and visuals. Yet it barely addresses the EXTREME CREDIBILITY of Dr. Greer in establishing the authenticity of extraterrestrial life, and the generations-long extremely illegal cover-up surrounding it.Greer and Mazzola's earlier Unacknowledged is- by far- my favorite film of all time (and this coming from someone who thought about a month before seeing it that extraterrestrial life was a joke). Greer and Mazzola are geniuses, and the message of the movie is at least as valuable as cinema itself.There is no reasonable explanation except that Greer is exactly on target. (As one brief illustration, what exactly is the History Channel's subsequent Unidentified miniseries all about? It strikes me as a textbook misinformation spoof of the film, that accomplishes nothing except to attest that Greer was right all along.)With that as a backdrop, this film is the logical extension to Unacknowledged, as its lays out a practical solution to resolve the illegal cover-up (while changing the world, to put it mildly).Watch Unacknowledged and explore Dr. Greer's work for yourself, slowly and independently. Ask questions and let logic lead you to the answers.Imagine what it was like when the US won World War II. What would have been our natural inclinations? What were the associated risks?What happened to technology within the 20th century? Did the logical insights of Erwin Schrödinger and Max Planck decades ago just disappear for no reason?Why do we have a cartoonishly large military budget despite no apparent imminent threats? Doesn't common sense indicate that it would be better invested in diplomacy (prevention rather than remediation)?If we as Americans do not hold Washington accountable for what happens to our money, why would we not be held accountable for what may be done with it? And if Washington is too cowardly to achieve results, who is left but we the people ourselves, collaborating in unity? (Of course, being confined to our individual houses for the first time in decades just as the film premiered, which I'm sure is a complete coincidence.)This film is a mosaic of ingenuity in introducing insights for its viewers to pursue in greater detail (in conjunction with Greer's awesome reading list). Yet it definitely does not go as far as it could in addressing the illegal cover-up of the reality of extraterrestrials- because the theme of the film is the true solution to the situation, not more-of-the-same through endless conflict.Whether or not the media is receiving cash payments (as described in Unacknowledged) to keep this work below the radar, it is definitely a film that you deserve to see. Of course, if those responsible for the illegal cover-up thought about the situation more clearly, they would realize that Dr. Greer is their gift-of-a-lifetime to be readily forgiven as the cover-up imminently approaches its inevitable end."}, {"id": 32, "text": "My father was and my husband is an aerospace engineer. There are obviously and credibly documented unexplainable craft flying above our planet. That's a given, I have on good authority.This documentary was different than anything I've ever seen. Your mind must be open. Why wouldn't it be?Something is here. Who wouldn't want to know more?Watch, learn, contemplate and look into your way of thinking. What are you able to believe? It doesn't have to be everything presented here, but it will get you wondering..."}, {"id": 33, "text": "Whether you believe all this or not, this is a very good documentary to be introduced to this subject. I had never heard of ce 5 and didn't,t but the 9.99 app but it was certainly enlightening . I a happy that with all crazy in the world these people are finding peace."}, {"id": 34, "text": "I must admit, I have not watched Dr Greer's other documentary Unacknowledged, although I did watch Sirius about a year ago, and thought that was really good (8/10). This was a long, 2 hour documentary, and to be honest, I felt the whole 120 minutes of it! I was struggling to keep my intetest going.I am very open minded about the UFO phenomenon, and I do agree, that it is extremely likely that there are multiple other life forms out there. I have also watched many documentaries on the subject, over the years. The majority of this documentary however, is focused on deep meditation, and expanding our consciousness, to the point that we can communicate with these beings, including summoning the craft to come and appear in the sky for us, asking them not to go away, once they have started to go away and succeeding in them coming back (one example), and even asking for healing of deafness, which, apparently happened (one example). It just felt like these folks want to believe sooo much, that all this stuff happens, that they believe it does, every single time. I could recreate these effects with the birds in my garden! (Barring the deafness of course, but people get spontaneously better from serious medical conditions every day.....it's rare of course, but not unheard of). I don't know how to meditate, but if I sat in quiet contemplation for an hour, and asked for a Robin to appear on the fence, and a Robin did appear, that isn't some kind of supernatural force....I'm not communicating with the Robin. If he flew off, and I asked him to come back, and he did, that doesn't prove anything either. As an ex-Christian, I kind of felt that this belief in the power of being able to communicate with aliens, is very similar to belief in god. If you pray for something, and it happens, then if you have that faith, you believe that it's god that has answered your prayers. It can't possibly be any other reason, if you have that strong faith.I can't obviously explain the photos and videos of the lights in the sky or the lights around the group of people meditating, but that is also not absolute proof. I think this documentary would have been much better, had it been more scientific eg. If they had got scientists, ecologists, photography experts, astronomers etc in, to give their opinions as to what these lights could have been. They were gathered in a small group, out in the middle of the mountains and deserts, so i am assuming the US military fly in these remote areas every night. If you watch other current UFO documentaries, then it is claimed that the military now have the technology to simulate UFOs. I dated a US airforce guy decades ago, and even back then, he told me that the US airforce were technologically 20 years ahead of what the public were aware of, and that if the public knew about these things, it would blow their minds! Think how much more advanced things would be now a days! As to the lights on the ground, those photos were all taken on a relatively slow speed, so all you could see were trails of light. Many insects have eye shine, or phosphorescent abilities, and shots taken at a slower speed would produce the same results, of trails of light.I don't know. I could go on and on really. This just seemed to be a documentary specifically for those that would believe everything that was contained in it, without question. It was completely bias, without any counter arguments or discussion.The sweeping statement that all the animal mutilations and abductions were done by the military, was absolutely astounding! I had to rewind, to hear that again, as it was only said once, and wasn't covered again!! That is a massive subject for debate, and once again, absolutely no proof was given. That was the thing that really put me off, from then on, really. That in itself, could warrent many documentaries! That phenomena happens worldwide, not just in the States, and has been happening for decades!If you are open minded, but want a balanced documentary, with input from both sides of this topic, then this isn't the documentry for you, as it wasn't for me."}, {"id": 35, "text": "Guys, you just need to buy the app and we can bypass the elites and contact the aliens."}, {"id": 36, "text": "I have lost my respect for Dr Greer. I used to be a follower of his work and I have read everything that I could find of his work. BEWARE of his salespitch to $ELL his books and films and CE5 Trips. I have sent emails, texts and letters to Greer and his staff over the years, but I have yet to receive a response."}, {"id": 37, "text": "Starts out great but halfway through turns into a documentary less about science and more about spiritualism to the point at the end it feels as though they are trying to recruit you into a cult. And how can you discuss the existence of man made ufo technology without once mentioning Bob Lazarr?"}, {"id": 38, "text": "I have just watched the film. it is ok. it is good. i mean instead of watching some stupid superhero movies you should watch this."}, {"id": 39, "text": "I am a Greer fan, as I have been following him since 2001, and the Disclosure Project is very convincing. I enjoyed his recent film Uunacknowledged, so of course I had to see this.This is a film about the theory of collective consciousness, and how it is used to communicate with ETs (CE-5). I love the movie and have watched it three times. I find it inspiring, and to me, that is enough to say yes, it is a great film. I have been expanding my spirituality, so this helped shine science on what is happening in my brain.If you are looking for a convincing evidence documentary on the subject of UFOs, you will enjoy this, but the proof is not here.Watch Capturing the Light the story of Dorothy Izzatt. Now that is the best evidence."}, {"id": 40, "text": "CLOSE ENCOUNTERS OF THE FIFTH KIND - Dr. Steven Greer. My comment: Governments can no-longer politically, financially deny that we are not-alone...otherwise they will eventually loose to the public-sector who with economics, technology human-power will eventually get results either ET interaction that allows exchange of knowledge and technology to our favor! This advantage could easily take-over society and make powering governments irrelevant! The public-sector of investors with the correct strategies will use everything they can to benefit from this and everyone else of zealot ideology will be left-behind stuck on Earth....I don't mean now but in the near future. Remember that this is not occultist behavior as this word implies is to do so in secret, this is openly honest and everything declared and not hidden. They are trying to interpret what is needed to establish a communication with beings not of Earth that are 100,000 years more advanced than us, which means its an opinion! As-long as they know that? Because humans are predictable because we have all our lives been taught that we are not! I already know what the replies will be too this, and that is why you'll be ignored...some folks will be aggressive and other's will be at first rhetorical of semantics!"}, {"id": 41, "text": "After watching, I'm inspired. Earth changes are within us."}, {"id": 42, "text": "Many of the reviews of this title are negative, as if CIA agents are writing all this stuff)))) Do not listen to them - just watch the documentary and have your own mind ;) It's BRILLIANT!!"}, {"id": 43, "text": "What I don't understand is, if, like Greer says, the DNA altered humans are actually jealous of his freedom, why don't they just kill themselves? Then they'd be free of the burdens of the physical world. Right?"}, {"id": 44, "text": "Great documentary!! Watched it twice now and I'm going to watch it a lot of times more. It was lik taking first breaths for the first Tim in life. I think everyone must see this one (and other documentaires by Dr. Greer) so they can wake up and see what is going on in the world. Watch with open mind but alway stay critical and think for yourself. Wake up! Thank you so much Dr. Greer for everything you do to wake up the world. You make it a better place."}, {"id": 45, "text": "Whether you agree or not, you have to appreciate the work put into this, and yes, the risk these people take.When you have evidence of certain things, such as government declassified documents, and you still refuse to believe certain things, then that's on you, but do yourself a favor and don't make the attempt to ridicule others for what they believe."}, {"id": 46, "text": "This is one of stupidest documentary I ever saw."}, {"id": 47, "text": "This was incredible, my thoughts and intuitions confirmed, but also shocking to know how dangerous, destructive and manipulative the American government and media is, trying to convince us that Extraterrestrial are a threat to our civilisation, I was so angry to see that footage of any American air strike attack on a UFO, Who do they think they are putting humanity in danger like that, attacking an innocent craft knowing there intelligents and technology is far superior to ours, America trying to dominate space, like they try to dominate and rule the world, I believe these aliens have been visiting our planet for as long as humans have existed, surely if they were a threat they would of done something by now, instead they see us as these reckless dangerous damaged species, at war with each other, of course they aren't going to trust us. I appreciate Dr Greer's movement, to put the power in our hands, the people of this planet, to make sure acceptances and peaceful loving contact with Extraterrestrials is implemented, I certainly would, if I ever get the privilege of ever witnessing these incredible species, a space war is the last thing we need."}, {"id": 48, "text": "I've followed Steven Greer's work for some time. He's done a good job with his disclosure projects and has turned into the leading voice in the UFO field. He makes a lot of sense, is very good at articulating difficult concepts and is credible. Its an up to date look at the UFO phenomena and a very good one at that. Recommended if you believe we are not alone. Don't believe everything though as a few of his images have been debunked."}, {"id": 49, "text": "Love Dr Greer he seems so sincere. Such a compelling watch. Only reason I marked it down by one star was because the Audio Post Production is poor. As an audio professional I found it to be distracting. Pivens Voice Over is so quiet throughout."}, {"id": 50, "text": "This film is not for everyone but a very important document of our time in history the elite 1% don't want you to wake up to. Surveillance state is established upon us and I bet several negative comments here are paid CIA handymen too. This is a film everyone who are in pursue of raising their consciousness."}, {"id": 51, "text": "Some of the footage and information is good. But about 3/4th in it focuses on how to summon aliens through a methodology. The information ignores blatant questions like, How often does that work? Giving the sense that if you go out and do this (and publicly share that you've done it), you'll be talking to aliens.This documentary is really reaching to a far stance on our current cultured stance on aliens. It's really enveloping to watch with an open mind, but apply logic to it quickly dissolves the meaning it's trying to describe.It's just not true. Otherwise we'd all be summoning aliens every night. And if that's not the meaning this doc was trying to define, then why was it presented that way? This is, all most likely, to promote the author's book sales."}, {"id": 52, "text": "Extremely interesting non-religious documentary that dovetails with elements of every religion. One mind, one consciousness, that facilitates communication with other beings in the universe - a reality that's easy to comprehend, yet baffles most individuals and governments. The only negative is the few minutes at the beginning where they succumbed to some sort of political compulsion and digressed into baseless analogies that included the Pentagon Papers, Vietnam war, Iran-contra, and other totally irrelevant subjects (that had absolutely no contribution to the premise)."}, {"id": 53, "text": "If you're someone who meditates or are aware of Hindu, Buddhist scriptures then you might understand what is being discussed here. However if you're someone who only believes in the information given to the body by our 5 limited senses, then you may just dismiss this as fake. Definitely an eye opener."}, {"id": 54, "text": "I have seen Steven Greers previous movies and wasn't impressed. Waiting for disclosure wasn't my truth. But in this movie, he clearly shows the path of truth I can follow. Do it yourself! It remembered me what deep states of harmonious meditation can accomplish. Especially when done together in groups. Leave the fear behind, embrace the truth in compassion."}, {"id": 55, "text": "Whether you believe or not. You should watch this documentary."}, {"id": 56, "text": "No credible information, no facts, this guy is just another con artist praying on the weak and gullible.Time and time again we see the US Government dragged across the rocks for their conspiracies to control the world. I have news for all Americans, you don't control the world, you never will do.In other claims he uses language such as when I briefed the presidency like hes an insider on the payroll, the reality is he probably sent an email.He also claims ET's have technology millions of years in advance of ours im sure they might, but does somebody want to explain why they just fly around (mainly above America it seems) and make no contact, are they a bit shy?Apparently deep underground in the American deserts (but only in America remember!) There are space ships and dead ET's being hidden.So they fly around and crash sometimes and don't collect their dead, they just quietly observe us like an ant nest.RiiiiiiightSkip, skip and double skip this, maybe waste your money on a pyramid scheme, America loves those also."}, {"id": 57, "text": "Let me start this by saying, everyone has their own perception and opinion of things. Information is just that, what you do with it, is up to you. With that said, I have spent my entire life aware of the fact that there's something going on behind the curtain and that we're not alone. I have spent the last decade or so trying to make other people aware of it as well. Dr. Steven Greer's work is something I have been following for a some time now. In fact, I have a copy of every byte of media he has ever produced. This documentary is simply a must see for everyone on this planet...including those who don't want the rest of us to watch/wake-up. Perhaps all they need is a change in perspective to see that what they've been doing is in fact insanity. Perhaps, once you watch this...you'll realize, what you've been doing, is also in fact insanity. The simple truth is, once you know, you have an obligation to let others know...otherwise you are just as much a part of the problem. My motto is: If you are not a part of the solution, you are a part of the problem... The only way our species is going to evolve...is as one. If you don't believe in the power of thought...just search up what happens to random number generators during large public events."}, {"id": 58, "text": "Featuring the science of consciousness and the practice and results of CE-5, this is a perfect second follow-up for his movie Sirius, 2013 (after Unacknowledged, 2017). The mentioned official app for iOS and Android you can find under the name CE5 Contact. Here are the CE-5 protocols (from Kosta Makreas, former friend of his and cast member in Sirius, 2013):1. Do this ET Contact any time, anywhere that is convenient, comfortable and safe for you.2. Choose the place and the people you believe are compatible, respectful, and enthusiastic about this coordinated effort. You can also do this alone. NOTE: How you approach your CE-5 Experience is CRITICAL. If you have an attitude of fear, deep skepticism, hostility, close-mindedness ... chances are good you will fail at making contact. Bring your goodwill, love, joy and openness to the experience. The ETs will pick up on your noble positive vibrations.3. Link heart-to-heart with members in your group. Circulate the love energy (coherence).4. Imagine a sphere of love at the center of your circle with each of your hearts connected to it. Project this column of love energy high up into the sky as a brilliant vibrant beacon to our Star Friends.5. When you go into meditation, in your imagination link up heart-to-heart with all of the other Global ET Contact groups who are joining in all over the planet. -Then with love also include our Star Friends as you invite them and guide them to your location. -You can guide them to your location by projecting your consciousness out to them and visualizing how to travel from the location of our sun in our solar system to our Earth. -As you approach it in your imagination, zoom in closer and closer to your specific location on the surface. -Show (visualize) the images of where to find you to them!6. Mentally and with your heart, ASK our ET friends what you and we can do in cooperation with them to bring about a healing for our planet Earth. Invite them to take more of a part in our Human affairs, recognizing that it is nonetheless Humanity's responsibility to solve its problems - they need to be asked, from our point of free will.7. Remember that ET Contact can come in many forms. It may be a sighting of a Star Craft, a lucid dream, a telepathic message, a touch on the shoulder or knee, weird electrical phenomenon with communication devices or lights, and so much more."}, {"id": 59, "text": "To borrow from another tv show: 'I want to believe' - however this didn't help with that. I'd heard some of the debunking of Steven Greer beforehand but thought I'd give this a watch, even if just for entertainment value. The first 40ish minutes are reasonably interesting and there are some interesting theories (though perhaps people with scientific backgrounds would immediately dismiss). Beyond that however it just descends into rubbish. Some of the claims made relating to meditation/Buddhism etc are beyond laughable and almost insulting (and I say that from having in depth knowledge and experience of both). It then goes on to show a series of 'ufo' clips, most of which have been debunked as being Chinese lanterns etc.This is the first time I've seen Greer beyond the odd clip. Maybe he is telling the truth but to me he has no credibility, and the fact he is given such platforms is quite sad and worrying. I mean he talks about how he has briefed senior government officials and infers he's been privy to confidential meetings when actually he's never worked for the government. Yeh some might say 'that's because it's all secret' but to me theyre just obvious signs of a con. Reminds me a bit of nick pope who has made a career off of having worked in the UK ministry of defence, even though he was only an extremely junior employee who likely had zero access to anything interesting - at least though pop actually can claim some knowledge of how government works."}, {"id": 60, "text": "Greetings again from the darkness. Whether you're a believer or a skeptic, one must respect the dedication to the mission of Dr. Steven Greer. His documented research into extraterrestrial activity dates back more than 25 years, and he has briefed every president since Bill Clinton on the topic. This is the third documentary for Dr. Greer, including SIRIUS (2013) and UNACKNOWLEDGED (2017), the latter of which was directed by Michael Mazzola - also the director of this current film.Mr. Mazzola divides the film into 3 chapters: Blood and Treasure, The Crossing Point of Light, and A New World. However, the film's structure matters little, as this is mostly another opportunity for Dr. Greer to present his research, his beliefs, and allow others to comment. Dr. Greer is the founder of the Center for Study of Extra Terrestrial Intelligence (CSETI), and he was also behind the 1993 Disclosure Project, which persuaded the government to release previously classified documents pertaining to UFOs and extraterrestrials.Of course, Steven Spielberg's 1977 double Oscar winner CLOSE ENCOUNTERS OF THE THIRD KIND remains quite popular today, and the title to Mazzola's film refers to what CSETI categorizes as the 5th kind of alien encounter: proactive human communication with an extraterrestrial. In support of this, Dr. Green spends a good amount of time explaining his group events, where believers gather to experience these encounters. It's at this point where much of the film focuses on Universal consciousness (ESP, meditation, etc.). The parameters of pure heart and peace are said to be necessary for group meditation cohesion. It's very similar to the idea of attraction - if we think about something, that thing is more likely to appear or happen.A quote from a physicist opens the film, and numerous quotes are highlighted throughout courtesy of intellects, scientists, and spiritualists. Scientific analysis is provided and we hear from some brainy talking heads, including Dr. Edgar Mitchell, a former astronaut. Attorney Daniel Sheehan gets plenty of screen time as well, and does his part to fit right in with the line-up of articulate, knowledgeable experts who offer up their commentary. These are not the wild-eyed types we see on local news or lesser documentaries. These are folks with actual experience backed by video and photographic evidence.Dr. Greer asserts that since no human has ever been harmed, we can assume the extraterrestrials are not here to cause damage - an easily debated point. He also claims that these aliens are up to a billion years ahead of us, though he never explains the math on that. Actor Jeremy Piven seems an odd choice as narrator, given his propensity for roles as a fast-talking smart-aleck, but a montage of video from around the globe (the most recent from December 29, 2019) lends credence to Dr. Greer's claim that the collective conscience has a relationship to the physical world. He has also accepted that skeptics will always exist, and that he will be ridiculed for his work and beliefs. If nothing else, perhaps the film will open up a few minds to the possibility."}, {"id": 61, "text": "When I first heard of Dr. Steven Greer was back during the Disclosure Project and the AP News Conference with all of the government workers, military, engineers and so on to disclose information about UFO, ETs, EBEs, foreign technology and the governments knowledge of it all. It amazed me then to see someone actually bring a mass of people to expose and bring out the truth to the press and public and Dr. Steven Greer amazes me still. At first when I heard of the CE5 project I was very very skeptical. Truthfully it freaked me out and seemed out there and I knew it would bring Dr. Greer's reputation down to the everyday person, skeptic and the king of people who don't take the time to look into something and research it. After looking into what Dr. Greer was saying about CE5 protocol and researching using consciousness to communicate or remote view it's amazing how many scientists, scholars and governments already have been researching this and even using it. A lot of scientists say and have proof that the consciousness of a mass of people can and does effect random number generators. The US government started in the 60s a program for soldiers to use remote viewing and other consciousness related training. Military personnel have stated to be trained to use telepathy to communicate with EBE. It's amazing how much actual physical, 1st 2nd and 3rd hand knowledge and eye witness accounts, documentation(released by many governments_even the US with the Freedom of Information act) and many many many credible, well known, high ranking, public figures have stated the same. After researching everything and seeing that a lot of what Dr. Greer has stated and shown proof of has come out and come true it brought me back to understanding the CE5 protocol and not just being one of those people who are to worried to say something that might embarrass them or bruise there rediculous EGO's or just being called crazy and laughed at. I'm glad I research so when something like CE5 comes up and I get laughed at for saying I see truth in it but I can't fully believe it true until I do it and see it for myself, I am able to throw all kinds of evidence, documentation and studies done by scientists to back what I saw up and shut up the SHEEP who just say and do what they think is what will make people like them and what the TV, media and governments want. Whoops little rant. All in all I gave it 8 stars only because I haven't done or been to a CE5 session. I would love to do try it of observe it. Their is a lot of video and pictures evidence of the CE5 protocol working at least doing something strange at those sessions. All over YouTube, the internet and even TV shows all over the world people have gotten video and pictures evidence of something strange happening at the CE5 protocol sessions. The Florida session in the movie, that an earlier review said was obviously fake, I totally believe it was real. I see people that think like that and hope they stop being the SHEEP followers that the government and media want them to be. A lot of people say it was the flare booms from oil rigs. I worked on a 240' Offshore Supply Vessel supplying oil rigs. I've seen all kinds of oil rigs (stationary, jack-ups, semi submersible and drilling ship rigs) and all kinds of flare booms in all kinds of weather with light inversions and light refractions on the ocean and those lights are not in any way flare booms. From what I saw those lights are no way flare booms or ship or fisherman lights. The lights were way to high on the horizon and we're moving. I think that the CE5 protocol works and would love to take a serious crack at it. It's a great documentary headed by a person Dr. Steven Greer who I think has backed up most of the stuff he has said with hard evidence. As time passes and more things are released time keeps backing up Dr. Steven Greer and proving him right more and more. Its honestly scary and awesome at the same time. I hope people watch this with an open mind and take the time to listen and research and are open to learning about topics that are considered taboo and frowned upon like UFOlogy, the study and use of the consciousness, UFOs/UAPs and ETs/EBEs and maybe actually realize that something amazing is happening on and above our planet and it could be and probably is the most important and amazing thing to happen in human history and it NEEDS to come out to the world and maybe change our planet and civilization forever, for the better."}, {"id": 62, "text": "Belle Delphine and Bhad Babie should not have been in the intro, at all...Now that that's out of the way, This documentary could have been put together better, the transitioning of many scenes with clips and narrating is choppy. Like trying to focus on fishing while on a small boat on rough waters, you spend most of your time focusing on your balance. While interviewing Greer, instead of jumping back and forth between camera angles while he was mid sentence they should have kept the camera steady on him. This is a subject of depth. The brain has to be able to focus and quickly process the information that is being explained. The eye stimulation from scene cuts and camera angles is distracting. The music in the background should be lower or of different tempo. That did not help the fact that there were many times I had to rewind and listen again, sometimes a couple of times in order to understand what was being said. I had a lot of wait what moments.Regardless there is a lot of great information in the documentary that confirms a lot of what those who have a sense of this already know.I think it's funny they suggest Biden and Kamala would win to meet the narrative, well.... Though as intriguing as this meditative state into higher consciousness to be able to communicate intergalactically sounds, it was hard for me to accept the story about the guy who astral projected himself into a spacecraft. This is where I draw the line for myself. I watched it over and over trying to understand but I can't. I don't agree with Greer truly believing that this man physically crashed into and entered a spacecraft in our current space time continuum and then be able to dissect it and explain how it occured to the fellow. It just makes no sense to me.. but neither does Rainbow Body and apparently that is real. (if you don't know what is look it up and watch Tibetan Rainbow Body documentary on YT)Conclusion:The EGO of man is a dangerous, deadly thing. One has to look within themselves to heal from their past so that they are present and able to tune in and receive the information that is being taught by the universe, not our ego driven leaders.PEACE and LOVE Let's all meditate away COVID! It only takes 1%!Also LOL there is a CE5 APP!"}], "reviews_amount": 63}