{"name": "Mambo Man", "titleId": "tt12600214", "reviews": [{"id": 0, "text": "Among the best portrayals of the real Cuba. Excelent fotography, and the real cuban music"}, {"id": 1, "text": "I really liked the film for the photography and for the soundtracks that accompany the viewer during the film, it recreates the typical Cuban atmosphere. After seeing it, I understand the awards it has received and its nominations. Congratulations"}, {"id": 2, "text": "Mambo Man is beautifully filmed in rural Cuba. You can feel the music, smell the cigars and taste the food. It explores mans greed and his blindness. It is reflective and presents an authentic truth. The acting is absolutely first rate. I loved it."}, {"id": 3, "text": "I love the landscapes, the music and the performances!"}, {"id": 4, "text": "This movie is a true reflection of the Cuban reality. The music and the picture are Amazing. It brought a lot of memories to me and my family and we really enjoyed it. Thank you Mo for a beautiful movie."}, {"id": 5, "text": "It made me remember my childhood and my adolescence in Cuba, since I don't live there. I really liked seeing the landscapes and the wonderful performance of the actors. I recommend 100% this movie for anyone who wants to know my beautiful island of Cuba."}, {"id": 6, "text": "I await you with many wishes, because I know that your entire team put their soul in every detail."}, {"id": 7, "text": "Mambo Man is an enjoyable and unexpected film. I've never been to Cuba but it appears to show an authentic depiction of the country. Usually, when a film takes you to Cuba it takes you to Havana - but Mambo Man is set in a provincial town - what you might call the 'real Cuba'.Mambo Man follows a (true) chapter in the life story of local businessman and pillar of his community JC. I won't give any spoilers, but it takes some unexpected twists, and makes interesting commentary on the Cuban social and political scene along the way.Finally, as you might expect from a film co-directed by the owner of Latin music label Tumi Music - it's worth watching for the sound track alone!"}, {"id": 8, "text": "Very nice film, beautiful photograph that shows the beautiful island of Cuba, I hope you enjoy it like me !!!"}, {"id": 9, "text": "I love the way that movie show all the Cuban culture, its roots, and the landscapes, a good story for sure!"}, {"id": 10, "text": "Good music, real history very popular in the actual Cuba life. excelent fotography, I think it´s historic film becouse Cuba is change very quiq and this argument it´s woonderfull document of Cuba life........"}, {"id": 11, "text": "It is like living in Cuba for a while Really authentic. We all are a bit like Mambo man"}, {"id": 12, "text": "I didn't really know what to expect of this film so went to watch it quite blank.I was drawn to the characters and their different personalities immediately.they were very believable and you almost felt as if you were there.The film was very natural and the shots were nice and tidy, as a lot of foreign or arty films end up being too 'diffeent', this was easy to watch. as the plot became more complex the viewing was compelling and the director created suspense very well and built it up slowly.The actors were really great, adding to the story's realism. as we the audience started to try and piece the mysteries of the story you just had to keep watching. i recommend it, the location was really pretty too."}, {"id": 13, "text": "Enjoyed the film tremendously - Wonderful music throughout as well if you like Buena Vista social club this will be right up your alley. Perfect for a summer sunday afternoon"}, {"id": 14, "text": "What a great movie. The cuban music is definitely the best."}, {"id": 15, "text": "Feels good to se the beautiful side and culture of my country !! Just a nice and pleasant film that stirs the emotions by letting yourself fall in love with it"}, {"id": 16, "text": "I really liked this movie, it has for me the best actor in Cuba, Hector Noa. It is a beautiful drama, its music its people, it is Cuba and its culture. This movie already has 15 international awards and deserves many more. Mo Fini and Edesio are two very talented directors and they achieved an exclusive product on cinema with Cuban themes. Congratulations."}, {"id": 17, "text": "Very enjoyable experience, beautiful music, good acting, and excellent photography. Fresh representation of Cuban culture."}, {"id": 18, "text": "It is a spectacular movie. recreates a beautiful landscape of my country and that contagious music that many enjoy."}, {"id": 19, "text": "If you want to enjoy with the best cuban music, his landscapes and a really magnificent set of actors this the movie you have to see. His storyline based in a real history has been motive for more than 10th good deserved awards. This is a movie who invite you to see it and enjoy it."}, {"id": 20, "text": "A beautiful portrayal of the real cuba-stunning scenery and of course incredible music-loved it!!"}, {"id": 21, "text": "Mambo man is a wonderful movie, you can see that it was made with a lot of love, it has talented artists, a spectacular production !! fantastic music, I really love it !!! I ask you to keep making more movies like this !!! Blessings !!! Do not miss it friends!"}, {"id": 22, "text": "Honestly one of the best movies I'v ever seen depicting cuban countryside landscapes and music, yeah for sure the music is the best!! follow by the great cast.. Absolutely highly recommended!! Is a most see!!"}, {"id": 23, "text": "The Mambo Man movie is great. It has a very beautiful photograph, excellent locations, the Cuban countryside, its animals, the green of Cuba, but above all the music. The music is spectacular from the best traditions. Excellent."}, {"id": 24, "text": "We finished watching the movie and found it to be beautiful; the music, locations, and photography is spectacular."}, {"id": 25, "text": "We finished watching the movie and found it to be beautiful mainly the music location and photography which are spectacular"}, {"id": 26, "text": "I really had the feeling of being there in Cuba dancing and laughing with the characters. The music is amazing and the actors do a wonderful job. Bravo!"}, {"id": 27, "text": "Great music, best played loud and interesting insights in to everyday life in Cuba...enjoyed the scenery and just wanted desperately to stop him....scenes of family life were charming...Will watch it again soon."}, {"id": 28, "text": "Fun movie, showcasing several Cuban artists, gives you much needed joy in a very difficult 2020 year. That joy, intertwined with a narrative of con artists, of people trying to make ends meet, and a very pleasant high note in the final scene, makes for a very entertaining and endearing movie."}, {"id": 29, "text": "Mambo Man is an incredible Cuban flick! One not to be missed, especially for those of the Cuban culture. Relatable and a great family film.Mambo Man is about a Cuban named JC (Hector Noas) who is both a farmer and a music promoter, popular on the island for his music. When his friend, Roberto (David Parez), appears out of the blue with a business offer JC cannot refuse, JC is left scrambling to find fifty thousand dollars. Throughout the film we see JC and his family struggle with their everyday life. We see how poor the island is and posters of Fidel Castro, whether praising or fearing him. Throughout the film, Cuba is shown in its poverty-overcrowded, with residents looking for work for food and money. Mambo Man doesn't hide Cuba's flaws nor does it glorify the country, but rather shows the day-to-day life of the island's inhabitants.Another plus is the authenticity: the whole cast is Cuban and the movie is filmed in Cuba. (As a Cuban myself, I enjoyed seeing these shots of where my father grew up.) The entirety of Mambo Man is in Spanish with subtitles, with people rarely speaking English. At times, the subtitles do not match what the dialogue really says. Some lines are changed, sometimes phrases and expressions aren't included. Some of my favorite scenes are those that include music, especially traditional Cuban music made for dancing. The soundtrack includes wonderful songs that many Cubans can recognize. Mambo Man has incredible shots of the countryside of Cuba, too, such as JC's farmland, and when he and his chauffeur, David (Alejandro Palomino) drive through the city and countryside.Overall, the main plot of the film feels extremely rushed, and the not-so-needed scenes drag on for way too long. For example, at one point, JC's friend steals ten thousand dollars from him. We never meet his friend, Omar, so it seems odd to have a character who is pretty unrelated to the plot steal such a grand amount of money. Also, there are parts in the film where tourists visit JC's farm that are longer than necessary. It would have been much better to meet Omar rather than see tourists that have no effect on the storyline. In another example, JC's wife, Rita (Yudexi De La Torre Mesa) is angry with her husband about how much money he is risking, and then in her next scene she talks about how losing a huge sum of money is no big deal, and that family is what is important. We miss her character development, and it seems peculiar how in one scene she nags JC about almost losing their home and in the next she shrugs it off.The message of the film is that family is what matters most, not money, as JC learns towards the end. There are many uses of adult language; some shown in subtitles, and some not included but still said in Spanish. Heavy alcohol and tobacco depictions are shown as well.I give Mambo Man 3 out of 5 stars and recommend it for ages 14 to 18, plus adults. It premieres on virtual cinema on September 11, 2020.Reviewed by Heather S., KIDS FIRST! Film Critic."}, {"id": 30, "text": "Review of Mambo Man by Prisma ( Rome International Film Festival) June 2020 MAMBO MAN BY MO FINI AND EDESIO ALEJANDRO Posted at 09:10h in Reviews by prismaadminMambo Man is a film that can wrap viewers in a warm dreamy and nostalgic atmosphere. This happens immediately, from the very first minutes, when the guitar strings begin to vibrate and the magnificent, humble and ancient Cuban land is the protagonist of passionate shots. This film doesn't just tell a story, in fact. It is a kind of monument. A work destined to last potentially forever, because it is the expression of an entire culture, of an entire people. In fact, the history of JC mixes and spreads in the infinite branches of the history, music and people of Cuba. It is not an excuse to tell this country, but rather a symbol, which wishes to collect the legacy of a wonderful culture. And Mambo Man manages to communicate total, wide suggestions that seem to bring even the scent of that land to us. The film is played very well by its actors: real faces, framed with reverence and awareness. But there is another protagonist who in this film stands out for its majesty: music. The film, like Cuba itself, is crossed by vibrant, vivid compositions that have always expressed and collected the feelings of Cubans. Mo Fini and Edesio Alejandro, with inspiration and great inspiration, manage to extract beauty from the very material of this nation. There is no indiscreet aesthetic research, a spectacular photograph or dizzying camera movements. There is rather the mature and conscious gaze of two authors who want to represent Cuba, and the story of the protagonist, with truth and love. With this awareness, each shot conveys a charm superior to that of a good staging. This film, made with passion, penetrates the audience to the rhythm of music and tells us about a whole, small, precious universe, absorbing its beauty and misery. Mambo Man is a bit like Cuba: beautiful, kind and melancholic. Reseña de Mambo Man by Prisma (Festival Internacional de Cine de Roma) Junio 2020 MAMBO MAN BY MO FINI AND EDESIO ALEJANDRO Posted at 09:10h in Reviews by prismaadminMambo Man es una película que puede envolver a los espectadores en una cálida atmósfera soñadora y nostálgica. Esto sucede inmediatamente, desde los primeros minutos, cuando las cuerdas de la guitarra comienzan a vibrar y la magnífica, humilde y antigua tierra cubana es la protagonista de los disparos apasionados. Esta película no solo cuenta una historia, de hecho. Es una especie de monumento. Una obra destinada a durar para siempre, porque es la expresión de una cultura entera, de un pueblo entero. De hecho, la historia de JC se mezcla y se extiende en las ramas infinitas de la historia, la música y el pueblo de Cuba. No es una excusa para contarle a este país, sino más bien un símbolo, que desea recoger el legado de una cultura maravillosa. Y Mambo Man se las arregla para comunicar sugerencias totales y amplias que parecen traernos incluso el aroma de esa tierra.Sus actores interpretan muy bien la película: rostros reales, enmarcados con reverencia y conciencia. Pero hay otro protagonista que en esta película destaca por su majestuosidad: la música. La película, como la propia Cuba, está atravesada por composiciones vibrantes y vívidas que siempre han expresado y recogido los sentimientos de los cubanos. Mo Fini y Edesio Alejandro, con inspiración y gran inspiración, logran extraer la belleza del material de esta nación. No hay una investigación estética indiscreta, una fotografía espectacular o movimientos de cámara vertiginosos. Hay más bien la mirada madura y consciente de dos autores que quieren representar a Cuba, y la historia del protagonista, con verdad y amor. Con esta conciencia, cada disparo transmite un encanto superior al de una buena puesta en escena. Esta película, hecha con pasión, penetra al público al ritmo de la música y nos cuenta sobre un universo entero, pequeño y precioso, absorbiendo su belleza y miseria. Mambo Man es un poco como Cuba: hermoso, amable y melancólico."}], "reviews_amount": 31}