{"name": "Die by the Sword", "titleId": "tt12484058", "reviews": [{"id": 0, "text": "I really enjoyed the movie! I wish Ashley was in the movie a little longer than getting killed so fast. Jimmy and Ashley were so awesome! I would love to see them in more movies."}, {"id": 1, "text": "Movie was amazing my son and I loved it.I can not wait too watch it with my husband he.is going to love it."}, {"id": 2, "text": "I gave them a 10/10 because they are amazing people. The movie wasn't one in my genre but the actors and actresses did a great job!"}, {"id": 3, "text": "A must watch ! Get to know the actors and its makes the movie that much more enjoyable to watch."}, {"id": 4, "text": "I love this movie. Jimmy mooney was the best actor in the movie. I love his sense of humor an his acting. I've watch this movie so many times. I can't wait for part 2 to come out an any other movie he plays in. Jimmy Mooney is a great actor. Can't wait to see what else he stars in."}, {"id": 5, "text": "Love this movie great movie to watch with your family and friends or a date night movie"}, {"id": 6, "text": "Great movie! Must see! Jimmy Mooney rocks in this movie!"}, {"id": 7, "text": "Enjoyed this movie and Jimmy Moonies acting was awesome! Looking forward to next movie🙏🙏"}, {"id": 8, "text": "I absolutely loved the movie and time setting! My 2 boys also loved the movie they now try to act it out ahaha cant wait for a number 2!"}, {"id": 9, "text": "Jimmy monies is the best actor in the movie. I love his humor an his acting so much. I can't wait for die by the sword 2 to come out an anything else he stars in. I've watch his movie more then once an will watch every time I see it. I think he is the best actor in the movie. Everyone in my family lives him. Keep anything that he stars in coming. Love love him"}, {"id": 10, "text": "Great movie! Jimmy and Ashley Mooney are great actors!!! !! They really need to be in more movies!!!!!!!"}, {"id": 11, "text": "Die by the sword was a great movie Jimmy and Ashley Mooney did an excellent job in it really can't wait to see more movies like that"}, {"id": 12, "text": "I really love this movie and I can't wait for the second one to come this is a moive that I can watch over and over"}, {"id": 13, "text": "Jimmy Ashley and the rest of the gang are all amazing talented actors. This movie is a great hit!! I cannot wait for more content from jimmy!"}, {"id": 14, "text": "Jimmy an Ashley Mooney we're absolutely fantastic and are amazingly talented actors I can not wait until I seen them in other films this movie is a must see !! 10 out of 10 PLEASE GO WATCH"}, {"id": 15, "text": "I give this movie a 10 It's deserving great movie and great people! Let's show them support!"}, {"id": 16, "text": "Loved the movie! It was definitely worth watching and more people should watch it! Everyone in it did an amazing job! Can't wait for part 2 to come out! Mooney family rocks!! Love y'all!"}, {"id": 17, "text": "Jimmy and Ashley Mooney did an amazing job in this film. I can't wait to see the next one. It's cool to get to know actual people who are in movies. Great job y'all keep shining bright 😎. Much love (We need that next movie please)"}, {"id": 18, "text": "Absolutely amazing I can't believe how amazing those actors were felt like I was right there with them"}, {"id": 19, "text": "Jimmy and his wife Ashley are absolutely a blessing. I struggle with alot of depresssion but watching anything with them in it really heals my soul. They are a true blessing."}, {"id": 20, "text": "I usually watch city action. This is really good. I came to take a look to support the Mooney's now I have to see the outcome."}, {"id": 21, "text": "These 2 actors are so good and they are amazing people! Like one of the other reviews had stated I would of loved to see more of Ashley's character. I loved the movie 100 percent!"}, {"id": 22, "text": "This is my type of movie. The cast was awesome as was the story line. My Favorite actors are Jimmy Mooney and his wife Ashley . I would love to see them do a western movie."}, {"id": 23, "text": "Great movie jimmy I love it an so does my husband You guys are awesome people we love you an ashley"}, {"id": 24, "text": "Love the move sorry jimmy ashley is my favorite lol love you guys"}, {"id": 25, "text": "I love watching movies from midevil times, Jimmy and ashley Mooney did awesome in their acting! They really got into character and played their part!"}, {"id": 26, "text": "Favorite character Wulfric played by Jimmy Mooney. He must be a new actor. I'd say hes going places."}, {"id": 27, "text": "Yesss I absolutely loved the movie Ashlely an Jimmy Mooney are fantastic an amazing actors definitely wanna see a part 2 definitely worth the watch would live to see them on a series on Netflix much love an respect (cassielynn1986)"}, {"id": 28, "text": "Love love love the movie! Jimmy and Ashley Mooney were absolutely fantastic and so great to watch!! Would love to see both of them in more movies!! A+++ movie for sure!!!!"}, {"id": 29, "text": "Watch it 2x already really enjoyed it my 13 year old son loved it supporting Jimmy and Ashley Mooney great performances can't wait to see part 2....Job Well Done 👍👍👍👍👍👍"}, {"id": 30, "text": "Jimmy mooney and his wife Ashley are fantastically cast in these roles. Can't wait for part 2"}, {"id": 31, "text": "Jimmy Mooney is my daughters inspiration, he is an amazing actor and you will enjoy him in this movie! THIS IS A MUST WATCH!"}, {"id": 32, "text": "I loved it!!! I was unsure at first but I am so glad I watched!! These 2 need to be on more movies!!! Yall hit the jackpot getting them in it!!! Highly recommend!!!!!!!!"}, {"id": 33, "text": "Omg i loved this movie but why did Ashley have to get killed so early and Jimmy did an excellent job can't wait until die by the sword part 2...wished they were in more movies"}, {"id": 34, "text": "We love the movie cant wait to see another one.. We watches it two days. The first time was just us adults and then the whole family. My family enjoyes the movie and cant wait to see more."}, {"id": 35, "text": "I cannot wait for Die By The Sword 2!! I wish Ashley could have been in it longer but super awesome she was the intro for the move! Jimmy did amazing with his acting positions during the movie!! Love love love. 10 outta 10 recommend to anyone!!"}, {"id": 36, "text": "Jimmy and Ashley mooney are amazing people outside of this movie. In the film i definitely wish we could have seen more of Ashley and she wouldnt have died so quick but this was one film i sat all the way though and actually enjoyed."}], "reviews_amount": 37}