{"name": "Sonny Capone", "titleId": "tt12975804", "reviews": [{"id": 0, "text": "I feel really sorry for everyone involved in this... There is not much that can be said but it is truly awful...So bad I could only believe its a joke..a terrible,awful joke."}, {"id": 1, "text": "I don't know it was a serious attempt at film or satire. It's really really really terrible"}, {"id": 2, "text": "So why 2 stars ?, you may wonder. Sheer entertainment, but for all the wrong reasons. Acting, editing, props, mismatched locations and obviously, directing; the whole project is a disaster. But, even with my mouth agape with disbelief, I had great fun watching this. Yeah, I know, I need to get a life."}, {"id": 3, "text": "Think The Room but with no money and gangsters! If anything I laughed my head off at how terrible the film making, acting and writing is, so don't let low scores out you off. You will most definitely laugh, long as you know it's for the wrong reasons in this so called Crime thriller"}, {"id": 4, "text": "That's about all you'd get for the estimated budget of this negative budget movie. As for the current 1 positive review, it is obvious it's somebody connected to this steaming pile, that is probably a student project. Find a day job and go back to it. Movie making and acting is definitely not the forte of this cast and crew."}, {"id": 5, "text": "Acting, Editing, Accents and screenplay all horrendous don't watch"}, {"id": 6, "text": "This film is sooo bad, it's not even funny. I watched Naked Nuns With big Guns a few weeks ago, It was a masterpiece compared to this. This film Has no redeeming features."}, {"id": 7, "text": "Thought it was filmed in an iPhone or a comedy. Horrible if this is what the Italians and irish have to watch I feel for them."}, {"id": 8, "text": "In the first few minutes there was horrible camerawork and terrible acting; the narrator was also horrible at explaining the story. I thought this was just the beginning and I should give a shot since not everyone can act and maybe mistakes were made. But as I continued the acting never improved, neither did the cameras, storyline or scenes. I knew if this was how the first 30 mins was going to be, the rest will be exactly the same. So I just, I couldn't even though I am usually a look at the bright side type of person."}, {"id": 9, "text": "The best thing about this is reading the reviews...the only entertainment you'll get!"}, {"id": 10, "text": "Was one of the worst gangster films iv ever watched but watched to the end dont know why or how"}, {"id": 11, "text": "The depth of emotion, was truly staggering. Like a drunk porcupine wandering through a see of balloons. The sheer genius of itlaian mafiosos in Rome speaking with Irish accents was absolutely brilliant!!!"}, {"id": 12, "text": "Perhaps it is unfair to review a movie after only 20 minutes. But to be fair this was as much as I needed to see.I'm not impressed with what I see by then I tap out early. And there is a lot to be unimpressed with."}, {"id": 13, "text": "I've never laughed so hard for all the wrong reasons."}, {"id": 14, "text": "This must be a spoof and a bad one at that. Rented it and feel robbed. Acting terrible, sets and props awful, special effects makeup looks like it's been done by a hobbyist face painter. If it is a spoof it's not funny!!"}, {"id": 15, "text": "First time I seen this film , I taught it was a joke but on another viewing I really liked it strange but true"}, {"id": 16, "text": "Its not my usual kind of movie but in this case it is happy"}, {"id": 17, "text": "Was surprised we are working from home see this Movie on Amazon loved it ,,great murder scenes ,,"}, {"id": 18, "text": "The cheapest rubbish ever. It's like they filmed it on a new iphone and walked around the neighborhood and asked random people do you want to be in a film. The bar couldn't be any lower."}, {"id": 19, "text": "I have seen a lot of mafia film from way back, loved them all ,,agreed this is a low budget film , and I respect that fact , not every one has million in there back pocket ,, so as low budgets goes its Brill,happy camper ,,,,"}, {"id": 20, "text": "This was the worst used 20 mins of my life. I couldn't go on anymore, it was so bad, the acting was terrible, the storyline was terrible, I think you could watch TikTok skits and be more entertained than watching this. An half Irish guy as a mob boss, makes no sense at all, you have to be a full blooded Italian and a made man, this guy was literally a pleb nobody."}, {"id": 21, "text": "Sonny (Gerard Daly ) has an Italian mother (Maria Fiorentini ) and an Irish father who separated when he was a child. Raised in Rome he inherits the Godfather position from his uncle. When a son he didn't know he had in Ireland is killed (apparently conceived on a trip to visit his dad), Sonny vows revenge against the Irish gangsters.Apparently this is supposed to be a comedy or a spoof because it wasn't much of a crime story. It lacked the dialogue, swagger, and soundtrack of a comedy and relies strictly on plot which didn't carry the film.Guide: F-word. sex. brief nudity."}, {"id": 22, "text": "If you're not narrow minded and spoon fed on Hollywood blockbusters, like some of the ungrateful cry babies who posted reviews here, you might well enjoy this effort. It may look a bit cliche',-but it works and It's not pretentious, and it's even funny. I enjoyed this more than the last ten movies i watched; cinema releases included. If you liked 'Blood Car - you will like this as well."}, {"id": 23, "text": "One of, if not THE greatest mobster films of all time. Sonny Capone is a cinematic masterpiece from start to finish with it's brilliant pacing, brilliant performances and brilliant storytelling from the director Gerard Dalye. It's a film that is virtually flawless as there's not a single shot or edit that drags. There's nothing you could possibly change or clip from this final cut, you'd be hard pressed to nitpick anything wrong with this 90min classic. What makes Sonny Capone stand out from other gangster films is it's brutal portrayal of a life of crime, and nails every detail of the highs and lows in such a way that's cinematically stunning. So many iconic, quotable scenes make this one of the gangster films of all time."}, {"id": 24, "text": "Well, I assume it was not intended to be a comedy/parody but for the sake of everybody who worked on this movie I hope it was.. I could not stop laughing, after blinking my eyes and scratching my head for the first 3 minutes about what it was I was witnessing, I started to see the fun in it.. And yes there is a lot of fun to be got once you stop taking this movie for serious in any way. The acting, the venues, the plot...just hilarious..cult classic in the making"}, {"id": 25, "text": "I was really taken back by the amount of Violence ,, to no end ?I can see how people can be offended its a tad to far ,"}, {"id": 26, "text": "I run a boxing club in Dublin , one of the lads brought in this film,Ireally loved the characters called Drake and Co co , just wondering .will there be a part 2 ?"}, {"id": 27, "text": "Came across this film on line, at fist I was not sure what way to take it .. but as the film went on I could see what the Director was doing, he wanted this raw and that s what made it for me,,"}, {"id": 28, "text": "This tops it all , made my day , it restored my faith in Irish film makers"}, {"id": 29, "text": "I really liked this film lots of twists and turns , yes its a low budget but I am happy"}, {"id": 30, "text": "I love seeing people on smartphones and youtube existing in a film based in 1960s"}, {"id": 31, "text": "I found it to be great kills the boredom during lock down more entertaining than cardboard gangsters anyway"}], "reviews_amount": 32}