{"name": "Evil Eye", "titleId": "tt12882620", "reviews": [{"id": 0, "text": "... a man who's not good enough for my daughter. Listen to your heart or listen to your mother; poor old Pallavi gets into a right palaver once her mother recognises something wicked in the character of her new boyfriend that's all too familiar. An interesting spin on karma, fate, kismet as well as misogyny, abuse and control. Sarita Choudhury is amazing in the role of all mothers who cared, while Sunita Mani convincingly portrays all women, from all backgrounds, traversing their ethnicity, cultures and traditions to discover who they really are - you should too!"}, {"id": 1, "text": "The story started out pretty interesting then took a turn for the worse. I really hated the 2nd half &amp; ending... it had potential but went complete fantasy."}, {"id": 2, "text": "Mom's psycho ex-boyfriend is reincarnated into her daughters new boyfriend, and apparently he remembers everything from his past life 🤣. What was this guys problem? He was granted a new life, a chance to start all over. And all he thinks about is getting revenge on his Ex-girlfriend. What confuses me is why he takes 20 plus years to finally get revenge. Too many plot holes to mention. This movie was super corny. Especially the part where he finally reveals himself to the mother over the phone. So stupid lol those last couple scenes were ridiculous and ruined the movie. 4 stars from me"}, {"id": 3, "text": "Evil Eye was a movie that honestly cool idea and potential but unfortunetly it was starting to break apart even in second act and in end it was just another weak Blumhouse horror with a lousy plot twist that makes us laugh more then makes us scared and such staff is a very weak plot decision.Characters are fine but also towards end they become to become parts of cliched story that wasnt fresh at all.Rest of a movie was also very forgettable and not memorable ,it had some drama staff but that just effect me at all.Evil Eye was a film with a idea but that same idea was misused and misplaced somewhere in plot"}, {"id": 4, "text": "For those of us who expected a horror film, this was disappointing. It felt more like what you'd expect to see on Lifetime, NOT Blumhouse. The acting was really well done and I can't wait to see what the actors do in the future. As it is, this was just another rehashed idea full of cliches that had potential to be more but fell flat."}, {"id": 5, "text": "Intriguing movie that questions aspects of mother-daughter relationships, women and marriage, and the supernatural or madness. Slow build burn film that culminates with empowerment. Enchanting film that brings just a hint of fright to what ultimately is a domestic drama."}, {"id": 6, "text": "Decent story idea, but poorly executed... There really isn't much more to say. It's hard to find good movies to watch this year. Thanks covid!"}, {"id": 7, "text": "I had high hopes for this film and was invited to a special VIP premier for this film. It was definitely just a drama. I feel that, while an interesting story, it just took too long to get anywhere worthwhile. I just don't understand why this is placed under the horror genre. There is not much scary and there aren't those little nuggets that these types of drama/thrillers have that keep the audience engaged. While it could have been a home run, it was just a blooper to right field for a base hit."}, {"id": 8, "text": "This movie was like pulling teeth. What was an average length movie. Felt like hours. A good first 5 minutes. Then nothing but corny dialogue and bad acting til 1.20 then I turned it off. The camera shots and graffics were great! But that's it."}, {"id": 9, "text": "It is like a B grade movie . Only four to five actors of the count continue to appear in the entire film. Too much nonsense . Don't waste your time"}, {"id": 10, "text": "Evil Eye has the elements of a Lifetime movie, that includes the acting and dialogue. There's nothing horror about the film, but it could've been a scary movie, if done right. It had an interesting premise, but it fell flat. The story went into the worst possible direction. There was false suspense and felt so long, even though it was only an hour and a half. Also, the movie couldn't decide what tone it wanted to be. It's a shame, this film had so much potential..."}, {"id": 11, "text": "I enjoyed the movie a lot, especially as an American horror movie oriented around an Indian-American family. I don't think that there has been any American horror movie like that, at least not any popular ones.With that being said, the plot of this movie follows a predictable path. It's still fun to watch though. Sarita Choudhury keeps you engaged. Sunita Mani, not as much but not too bad either. Omar Maskati is okay but eh.Basically, if you're tryna get a quick horror movie fix in that isn't your usual small-town white family and jump scares. This is a good go-to."}, {"id": 12, "text": "Indian movies are such pathetic and full of crap..total waste of time!!!"}, {"id": 13, "text": "Not your usual formula of a scary movie; slow and unpredictable. Assume the low ratings are due to no scary 'jumps' and obvious plays. I was glued to the screen by Sarita Choudhury's performance."}, {"id": 14, "text": "The horror reviewers could perhaps extend their understanding of the genre. It was well acted and disturbing and so very Indian. Thank you."}, {"id": 15, "text": "Movie is very slow and boring. Story is very weak and nothing interesting. Also nothing horror in this movie. For 1 hr there is nothing in this movie. Usha s acting was very bad. Others are just ok."}, {"id": 16, "text": "This is just generic thriller done quite badly. It's really boring and feels a lot longer than 1,30 hours. Most of the movie people are just talking nonsense on the phone, it just doesn't have much going for it. Yeah and I don't understand why the Horror tag is there, it is just wrong."}, {"id": 17, "text": "This was bad, I fell asleep, woke up and turned it off! Skip this one unless you're in need of some sleep!"}, {"id": 18, "text": "This is a terrible, terrible film. Not only is the acting bad (apart from Sarita Chaudhry and her on-screen husband), but the plot is ridiculously silly and boring. The film description tells us that a mother believes that her daughter's boyfriend is the man who tried to kill her 30 years ago... That is literally the plot. There is not plot twist because it's in the description already. Where is the surprise? There is also no horror element. It's a drama. I'm so disappointed by Blumhouse as I usually love their films"}, {"id": 19, "text": "Evil Eye has a great concept, and is full of suspense. Nothing is given away too quickly, and the way the story unfolds is riveting. However, it seems like the creative team couldn't decide if they wanted to make a psychological thriller or a supernatural horror film, which makes it feel at times like you're watching two different movies. That being said, it is still enjoyable. The film dissects the overprotective mother trope, and doesn't play into stereotypes. I found the dialogue to be pretty realistic as well. The performances really make the thematic inconsistencies less jarring and more watchable. Omar Maskati gives an incredible performance in a very difficult role, and Sarita Choudhury is absolutely phenomenal, giving a very nuanced performance. This film isn't perfect, but it's definitely worth watching."}, {"id": 20, "text": "While the concept of the film was interesting and it starts out okay, the second and final acts leave lots and lots to be desired. Just bad writing trying to be a horror film and failing."}, {"id": 21, "text": "The maws a pure sare heid. Actual cba. Feel like my heids been nipped for the past hour and a half. No worth watching due to the severe pain and duress it puts you through. Don't understand why the daughter kept answering the phone when all her mum did was moan cause of that was me I'd have deffo patched it. Would have saved at least an hour of my time if she did.1/10 boring and takes about an hour to get to the point and the rest is angry phone calls. The End x"}, {"id": 22, "text": "The story of this movie is amazing. Acting is also good. Overall this movie shows us a different view."}, {"id": 23, "text": "OMG the story line was interesting but all went wrong with so many bad acting. Ugh that Palli character is awful ! Mom was good but the rest was just garbage. Two stars only for the mom."}, {"id": 24, "text": "It would have been more obvious if the mom had psychological issues. But the way this movie was set up it was very clear what the sense of this movie is."}, {"id": 25, "text": "Seriously if u want to waste your time then go on !"}, {"id": 26, "text": "I really like the actress who plays the mother And she has quite the difficult role to portray in this one. She has to walk a fine line and not be hated too much by the audience. There's of course only two options to this, either she's right or she isn't. I still think it's fairly obvious to what the movie leans on and what is going to be the reveal at the end.So as predictable as a movie can be. And yet due to the fine performances (even when they contradict themselves or their character motivations at time), but especially to a message delivered almost at the end of the movie (which is really important, especially to women), this really makes a dent. Of course everytime something good is being displayed, there is at least a bump in the road. At the very end, the message almost gets completely evaporated by a cliche - even if meant in good fun ... maybe they had to put it in (politically speaking), but it really was unnecessary to say the least"}, {"id": 27, "text": "A plenty of dialogues made me laugh. The acting was ok. They could have made it interesting and layered in so many ways. The climax was silly and nothing about this movie scared me. This concept is done to death in Hindi Cinema and now Indians overseas are trying to use it but they don't realize that it is a dated concept"}, {"id": 28, "text": "Why the heck do they speak English all the time? I mean, there is not reason for that."}, {"id": 29, "text": "I don't agree with the reincarnating part, but besides, this movie was a good surprise. If the new boyfriend was a distant relative of the former carrying some kind of curse, it would have been even better to watch. The idea of an actual being who can reincarnate to carry out black deeds is not scary but annoying. I actually thought that the movie was a good metaphor to expose domestic violence in a mystery story. By the way, the fighting scene is okay !"}, {"id": 30, "text": "By reading the reviews, I can tell if they were written by men or women. Men dislike this movie, it is a big F U to the patriarchy, and all future patriarchy regardless of nationality is seems. I agree that this is not traditional horror, but it is horrific just the same. Simple premise with some exceptional acting, the mother is very good. Worth a watch."}, {"id": 31, "text": "This is one of those movies that I'm not sorry I watched but I won't watch again. It wasn't a full on horror movie but it did a decent job at building some suspense. They did a good job building a story around the concept of reincarnation but it could have been darker. All in all I'd say if there's nothing else on you want to watch go ahead and give this a shot."}, {"id": 32, "text": "This is my second Blumhouse/Amazon Halloween movie and I'm 2 for 2. This fun little genre hybrid centers on a young Indian woman and her mom who suspects her daughter's new fiancee is the reincarnation of her evil dead lover. Approaching the material from the cultural standpoint gives it a new refreshing feel and that ending is pretty satisfying. Although it's never really scary it is creepy and suspenseful. And the movie is stacked with solid performances, creative cinematography and inspired direction.****/5"}, {"id": 33, "text": "Finally watched this movie last weekend. It is alright but not must watch. Frankly I felt like more of student film than professional project. Movie has portrayed intricacies of Indian mother-daughter relationship very nicely but has failed to develope obsessive problamatic personality of Sandeep convincingly. Hence his transformation from nice, goody goody boyfriend to that evil, obsssive person felt bit erratic. Acting from everyone is spot on and that is what makes this movie watchable. Also felt story of the movie doesn't grab you, there should have been little bit more element of suspense till last ten minutes of movie and movie should have ended on cliffhanger like was he or was he not reincarnation? At the end I feel there is nothing evil about this movie."}, {"id": 34, "text": "So this is one of those, killed came back in a different body to exact his revenge movies. We've seen this movie 1000 times before. It's just done with Indian actors. At least it is done in English.At the end, they throw a scene that the whole process will probably repeat itself, as we've also seen 1000 times.Really not the best telling ever and really was pretty damn bored by the end.3/10"}, {"id": 35, "text": "I love that this movie played out the way it did. It is an interesting angle. I was curious because the plot has us guessing for a long time.The warriors against any criticism of Indian culture are up in arms, take their ranting with a grain of salt. The movie is good. People who are vaguely familiar with unhealthy romantic relationships will enjoy the movie."}, {"id": 36, "text": "The movie has a plotline which is different from the rest of the horror films. The acting is good of all the cast. There could be more spooky, chilling or horror scenes. Its one time watchable though but for avid horror movie fans it will be a huge letdown. Watch this for the story. I felt a little bit of creepiness and wondering that there are always some other in our lives who in turn is so obessed with us."}, {"id": 37, "text": "Watered down below average clairvoyant movie gone wrong. Great job in boring the viewers to make a inept point!"}, {"id": 38, "text": "Such an interesting storyline with a great twist. Sarita Choudury's performance is fantastic! Great to see her have such a great character to play! Amazing actress."}, {"id": 39, "text": "Good concept, great writing about 'Karma' just watched this film last night,"}, {"id": 40, "text": "I'm a big fan of reincarnation movies, and when I saw the plot line, I immediately thought of a move that was made in the 1970's titled The Reincarnation of Peter Proud. But then I looked at the preview and it, didn't grab me at all. And if all of the reviews on here are true, then it would be worth my while to just shelve my curiosity and not bother watching it."}, {"id": 41, "text": "A killer insane overprotective mom never turned herself in for murder, because it is OK!! The dead jerk boyfriend came back aftet 30 years for his revenge. The story, idea and plot is very ego-religio centric. Actors did their job well. Direction is good too. But the basic ingredient of the story is baseless. Otherwise fictional movies should be graphically advance to accommodate fictional myth."}, {"id": 42, "text": "Really interesting idea here....I like the premise. And it started off well, but it never ever picked up. There was nothing horrifying or even thrilling about it. It was really flat, and the 'bad guy' is supposed to be this monstrous human being and I wanted to see more of that. There should have been more elements to this, some twists along the way but it was so bland. Like unseasoned food. The mother did a good job here with her acting and that was the best thing about this film."}, {"id": 43, "text": "I didn't realize Blumhouse was making Lifetime movies these days."}, {"id": 44, "text": "Its neither horror nor drama nor a proper thriller. Concept is also not new. Although performances by lead are good. If only the movie plot screenplay was made more intense it would be better. I wanted my heart to beat fast while watching it but it never happened once."}, {"id": 45, "text": "This is 90 minutes and it feels like triple that. There's nothing interesting that happens. It's not a horror, it's not a thriller, it's barely a drama. The best you can say about it is that it's seemingly shot on location."}, {"id": 46, "text": "This movie felt 6 hours long. It also felt like a Lifetime original movie and not a Blumhouse film. It was drawn out and dull with mediocre acting. There was no element of horror. Very disappointing. How convenient that she happened to meet the very guy her mother dated 30 years ago who was reincarnated.. Also the fact that her mother made the 20 hour flight to New Orleans from Delhi in like 6 hours was pretty impressive. Jeeze. I gave it a 4 because it wasn't the worst but it was not good."}, {"id": 47, "text": "2 out of 5 stars.Evil Eye is a bad horror film that lacks suspense and thrills and plays more like a paranoia relationship drama. An indian college girl meets an indian guy. They both fall for each other. The girls mother disapproves cause she has a weird feeling about the guy. While the guy does everything right. That they know of. But the mother has a past that haunts her until now.Plot is kind of boring. The direction lacks suspense and scares. It does get boring very fast with the girl and her mother disagreeing throughout about what they want.The direction is dull. The script is bland. The acting is decent. Just one of those forgettable thrillers with a twist that is predictable."}, {"id": 48, "text": "It's a great concept but way to slow to develop and not enough scares in it....like almost none....a drama? A thriller? Horror? Nope none of the above."}, {"id": 49, "text": "The storyline builds miniscule intrigue only to leave a bitter aftertaste of Bollywood logic. Skip."}, {"id": 50, "text": "The subject is started to getting old like marvel movies. we have 2 female heroes and a bad guy. put some 50 years of horror cliches with bad acting. i fast forwarded the whole movie and it was still too boring to watch. predictable ending but actually very fun one. so the guy will keep coming back to life and fornicate with the whole new generation of family tree. didnt dustin hoffman had that movie as a comedy?in the old times blumhouse was a creative horror maker, now just cliche same old same old"}, {"id": 51, "text": "Another dull, exaggerated and boring thriller; Evil Eye is cursed from beginning to end.In this thriller, a superstitious mother is convinced that her daughter's new boyfriend is the reincarnation of a man who tried to kill her in the past.How many times can your mother tell you a guy isn't good for you? For 90-minutes, that is literally all you hear, and does the daughter listen? Of course not. I appreciate that the entire cast, writer and directors are Indian and hats off to them, but common, give us something to rave about. A huge mess offering cliché after cliché, Evil Eye never seems original nor does it seem to take itself seriously. Here's hoping this review doesn't put the evil eye curse on my reviews.Follow @snobmedia for all reviews!"}, {"id": 52, "text": "For the people who didn't like it, maybe you didn't get the mother-daughter dynamic. But I enjoyed it and found the acting just fine among all the actors.I remembered the mother as being in Mississippi Marsala many years ago.I liked the story and that it switched back and forth between mother and daughter and we were able to glimpse some of India.I liked the blend of Indian culture contrasted with American and the blend between old and new traditions. There was a good balance of both. I like the way the daughter was portrayed as independent, yet she still had a bond to her mother. A very loving relationship.The father relationship to his wife and daughter was also good.The movie stood alone as a family drama about relationships and the modern and the old fashioned, between the new and the traditional and people loving each other and accepting each other's values.Spoilers ahead********************************And when mother and daughter teamed up to whoop his abusive a** that was extremely satisfying!Sorry guys!"}, {"id": 53, "text": "I feel like I just watched a movie written by my mother. It seems nowadays that every other movie is being called a horror film when this is very slightly a supernatural non-thrilling thriller. 90% of this movie is Indian melodrama with a very good performance from Sarita Choudhury as the mother concerned for her daughter's welfare. Not much really goes on and the fact that half the cast in in India and the other half is in America means we get endless scenes of actors talking into phones. It doesn't work and isn't all that interesting. There is no tension or suspense. When it does finally try to kick it up a notch, it does so in the most absurd ways. I am not sure who would find this entertaining but even as drama it doesn't work. The production values are high, although some of the dialogue, maybe due to the accents is a bit hard to understand. Overall though, I just don't understand why Hollywood churns out these uninteresting mislabeled films when independent filmmakers, on obviously smaller budgets, are turning out great stuff. This isn't even worth watching once."}, {"id": 54, "text": "'Evil Eye' is a multilayered thriller that explores themes such as misogyny, male entitlement, violence against women, and reincarnation. It's an interesting concept, but hardly milked to its full potential. The performances by Sarita Choudhury and Sunita Mani, portraying the mother and daughter respectively, will keep you glued to the screen even when nothing significant is happening. Eventually, the film is just another run-of-the-mill thriller whose parts are greater than its sum."}, {"id": 55, "text": "It's not really a horror, more of a thriller but leans more to drama. It was wonderful seeing a horror movie that isn't just a bunch of white people yelling in the woods."}, {"id": 56, "text": "It's like an episode of The Twilight Zone, but long and boring. It is not worth losing an hour and a half that cannot be recovered."}, {"id": 57, "text": "One just needed to appeal to their common sense and change the plot ever so slightly for the movie to be perfectly enjoyable. A potential 8* rated movie with good actors, fantastic atmosphere, nice setup is sitting at 4* because no one had the stomach to tell the truth.I feel so disappointed at the gross stupidity."}, {"id": 58, "text": "We can't escape our karma, although kismet would have made a better line.Pallavi (Sunita Mani) lives in New Orleans, her parents in Delhi. Her mother is haunted by memories of a past boyfriend. Long story short Pallavi meets the perfect man and mom thinks he is the reincarnation of the man who abused her.It takes a very long time for the story to develop and there are no Indian musical numbers or line dances as one expects in Bollywood. You know where the story is headed, to a final five minute climax scene that was not worth the wait. More drama than horror, mystery, or thriller.Guide: F-word. No sex or nudity."}, {"id": 59, "text": "The trailer to this is really good what made me watch it but it was really poorly constructed my husbands fell asleep because it was that boring the ending is so rush and cheap"}, {"id": 60, "text": "The concept here seemed good, and with the casting choices and Blumhouse banner, I expected it at worst to be a step above the usual evil boyfriend movies you might expect from the Lifetime Network or a similar channel. Unfortunately, this one is just extremely thin on plot and even thinner on suspense.A superstitious mom with a tragic past living in India very slowly becomes convinced for no legitimate reason that her daughter in the US has started dating a bad guy. Does he do anything to make us think she might be right? No. Not until the very last 10 minutes.Unlike most movies in this vein, the boyfriend doesn't act creepy or overly controlling or violent or jealous or whatever else you might expect. This lack of suspense makes the first 75% of the movie seem like just a boring romance with a crazy mom thrown in for kicks. The entire middle third of this movie drags on until finally, graciously, something happens. And then it's pretty much over except for a short wind-down followed by a predictable gotcha scene at the very end.This would have been much better as a segment in an anthology film or as a standalone short. It feels like they really had to pad it to make it feature length."}, {"id": 61, "text": "I gave this movie a 9 to counter all of the negative reviews. But I also gave it a 9 because it's a really good movie! I enjoyed every minute of it. I'm a mom and I completely get this movie, it's deep on so many levels! Loved the ending!"}, {"id": 62, "text": "Evil Eye 2020 15 Director: Elan Dessani and Rajeev Dassani Starring: Sarita Choudhury, Sunita Mani, Bernard White, Omar Maskati, etcOverall rating 41/100Evil eye is about an overprotective mother who believes that her daughters new boyfriend is a reincarnation of her ex husband who tried to kill her 30 years before. Evil eye had potential and interesting moments but sadly fell apart as the film progressed and just didn't work so let's get started.First of all there was interesting characters and concept, there was great cinematography and representation. The concept of having a mother who believes in the supernatural and things like horoscopes and linking that to her relationship with her daughter and how she finds love was really interesting to me and for the first half was well explored, the character of the mother was also really interesting due to this and that aspect of her character sticked throughout and worked for me. The cinematography was also fantastic, the rich colours linked to the Indian culture, and the repeated emphasis on the evil eye was really interesting and added tension whenever the symbol appeared. I also thought the representation was great, to have Indian directors and actors and set locations was great for me and the proper way for representation, the film went in depth with multiple Indian traditions and I found it very interesting and informative to get a glimpse of the different culture.However, my first few negatives would be the rushed background, questionable character decisions, lack of believable relationships and awkward dialogue. I thought that the movie did a bad job at the background for the mother character, if they had developed her past relationship with her ex husband more at the beginning they wouldn't of had to overuse the flashbacks as much throughout the movie which for me made the pacing fairly clunky, I also thought that their was a lack of believable relationships, I never truly believed a lot of the relationships, due to the poor relationship between the mother and daughter it was just very odd and didn't work for the movie to have such a lack of a mother and daughter relationship or a healthy one, even the relationship with the daughter and the boyfriend just never felt organic, it came across very awkward and forced. There was also a lot of questionable character decisions, some of the things the mother said and did was really bad and made her character come across as mentally unstable and just a bad person, I personally thought the movie went too far the mother and what she did making it come across very over the top, and making the daughter so easily controllable was also a bad decision for me because it became more and more difficult to connect with or care about her character. Finally I also found the dialogue to be very awkward and clunky, most of the dialogue within the movie was just very blunt and lacked depth, this just made It awkward to watch and didn't help toward connecting with any of the characters if the actors don't get good dialogue to deliver it makes the movie feel very clunky and off.My final few positives would be the dark tone, use of flashback and the character background. The movie executed a very dark tone, especially with the attention to detail of the psychological effects of abuse and it's antagonists were very uncomfortable with how controlling the character was which sadly can happen in real life, the movies use of flashbacks to establish character background and depth for the mother was also good, despite me having issues with the pacing of these, I still found them good in terms of them making you understand the mother and her reasoning behind being so concerned for her daughter.My final few negatives however would be the unclear and unrealistic plot points, tonal issues and bad ending. They made so many plot points in the movie unclear It really effected the impact of most of the plot, having the mother obsessed with her daughters boyfriend and thinking he is her ex husband was never clear as he was nothing like him or we never saw his actions mimic her ex husbands because any hint of this was gotten rid off in the dialogue to make the mother seem crazy it just didn't work, I also thought the movie had so many tonal issues in terms of the atmosphere it created with the relationships and what kind of genre it wanted to be and my answer is simple It didn't know, the movie was just tonally a mess. Finally the ending was very bad, the movie tried so hard to make the mother seem crazy and when it turns out she wasn't it just didn't tonally make sense and just made a lot of the movie pretty pointless, having the boyfriend be a reincarnation of someone else if executed right could have been interesting but it just didn't work for me at all.Overall despite an interesting premise and some interesting charcters with great representation, Evil Eye is a big mess that slowly falls apart as the movie goes on, tonally not knowing what it was and sadly just didn't work for a movie."}, {"id": 63, "text": "I liked the basic premise of the movie and how the Indian culture, beliefs, myths and other aspects were layered into the story but rhe execution on the horror standard, that Blumhouse is known for, fell way short of the mark. Usha &amp; Pallavi's characters are really strong just like their chemistry &amp; bond. It was really funny how the Indian aspects were peppered in like the upbeat songs, the dance sequences from movies, the inclusion of Arre!, Na? Etc in general parlance etc. However, it just didn't feel like a horror movie. It was executed poorly. Never even felt or heard the background music. Never got to know the significance of the Evil Eye that is so outrightly mentioned in the title. I had high hopes from this one and it just fell flat."}, {"id": 64, "text": "*ring Sarita Chaudhary (Homeland) and Executive Produced by Priyanka Chopra. Shot both in India &amp; USA with original dialogues in English &amp; dubbed in Hindi. I watched in English. A thriller with a good but predictable finish. Mainly Indian actors."}, {"id": 65, "text": "While the new crop of Blumhouse films barely feel like horror (most trend toward suspense, if we're being generous), I love seeing a bit more diversity and thoroughly enjoyed this as a family drama. The horror elements don't quite work, but if you think of it as a much better acted/filmed/produced Lifetime-style evil dude movie you'll have the correct expectations."}, {"id": 66, "text": "When i first heard about the Blumhouse TV project, and the four new movies that will be released in October, i was excited, since Blumhouse has a history of making mostly cool horror movies, with the most recent one being The Invisible Man. I saw the first three films: Black Box, The Lie and Nocturne, and i was hugely disappointed, but i guess they saved the worst for last with this one. First of all it feels like all four movies have been done by the same writer/ director. Even same running time: 1h :30 min. All have poor story, poor acting, poor everything. They all seem very rushed, without any depth whatsoever. In this one, it's basically about a mother and daughter talking over the phone for the most part of the film, like don't you have other stuff to do in your life??? The leading actress Sunita Mani who played the daughter, i liked her in the movie Save Yourselves, she was a lot of fun, here she's like another person, with too much makeup all the time, even when she's in bed sleeping!!! Mostly i feel bad for Blumhouse, cause this is definitely below their previous work, and if the next four films in this project with Amazon are anything like those films, then it's a big mistake to make them."}, {"id": 67, "text": "The title sums it up. I don't even have to say anything else.The beginning of the film isn't very interesting or engaging, then the twist becomes obvious and from there it's just 30 minutes of whatever.It really is a shame because the acting was good and the setting was interesting enough (it was nice to see the actor who played Rama-Kandra in the Matrix sequels).But the film itself (while short) felt like an eternity because there was just nothing to grab onto.Also, what is up with the ending? Is this a Marvel movie? Should I have waited for the post-credits scene?..."}, {"id": 68, "text": "Ok. Straying away from the reviews I've seen I actually didn't overly mind this film. It's average and here's why.My main issue I had with it was that the storyline itself just fell really flat. It was struggling to keep me engaged with the plot and characters and you could guess the ending half way into the film. The film is marketed wrong. I've seen this placed in horror. Do not watch this at all if you are intending on watching a horror genre film. It's more of a thriller/drama. The film could have gone down so many different avenues with the characters. For example we are introduced to her friends. Who we never see after the first 15 minutes. They could have been used in so many ways and added depth to a shallow plot.I still, however, didn't dislike the film. It entertained me somewhat and the performances weren't too bad either. If the plot was beefed up it could have been so much better. But yeah. 5/10, average."}, {"id": 69, "text": "Nothing is more scary than an overbearing mother. At least that is what Amazon Studios, who has partnered with thriller-maker Blumhouse Productions on an eight movie deal, believes. Their assessment is a good one even if not fully realized.In Evil Eye a superstitious mom burdens the desires of wedding bells and grandchildren smiles onto her unwed daughter who finally engages in a stable relationship. The twist arrives when the mother suspects the boyfriend is the reincarnation of the man who attempted to kill her 30 years ago. The movie is beautifully produced and has a most clever set up. Ultimately, that is all the movie encapsulates. With its long, familial discussions, Evil Eye would have worked better as an offbeat family comedy than billed as a deceptive horror.Usha (Sarita Choudhury) is a hopeful mother. She wants nothing but the best for her daughter Pallavi (Sunita Mani), even if that means mommy dearest must nudge her daughter into dating a proper Indian man. Sandeep (Omar Maskati) enters their lives and as Pallavi eventually warms to his cold eyes Usha sees something else. She is convinced this is the reincarnated essence of the man who attempted to kill her while eight months pregnant with Pallavi.Evil Eye dodges and weaves with the whole is-he-or-isn't-he mystery never building proper suspense. Any foreshadowing is entirely too light; the eventual resolution a shrug of acceptance rather than a sigh of relief. Written by Madhuri Shekar, who also wrote the Audible original the movie adapts from, Evil Eye mostly focuses on the trans-Atlantic conversations between Pallavi and Usha. Their relationship is a normal one, where the daughter is exasperated by yet loves her mother, while mom is desperately trying to warn her. Sandeep and his movements almost entirely stay in the background with any revelation (like - surprise! - an engagement!) breaking between their convos. Any of the horror, thrills, and even true mystery, comes too late in the game to warrant a roll of the dice.Directed by newcomers Elan and Rajeev Dassani, Evil Eye looks modern, sleek, and fun. Jumping between a non-touristy New Orleans to the mango-lassi colors of Delhi, the Dassani brothers establish location, routine, and family, using FaceTime as the ubiquitous deus ex machina. Likewise their camerawork is an artistic juxtaposition between intimate voyeurism and broad angles. Similar to the plot, the Dassanis appear to be more comfortable with light-hearted family fare rather than the mystery of the supernatural and grisly murder. Like many of their settings, the Dassanis favor the open and the airy, shying away from the dark and foreboding.All three principal family members - Usha, Pallavi, and patriarchal head Krishnan (Bernard White) - are enjoyable, relatable, and normal. Maskati's Omar is quiet and flat yet this might have been deliberate to keep the character understated. Understated, however, does not always equal compelling.While the familial concerns drive the narrative there is always the loaded pause of something more; deeper. The Dassanis seek to play in multiple genres yet never fully commit to any of those styles. Aspiring to a clean ending is a difficult task without first getting dirty. Evil Eye&lt; is an entertaining drama but an unsatisfying thriller."}, {"id": 70, "text": "I absolutely never think about the Bechdel test in a movie and whether or not said movie is passing said test. But in 'Evil Eye' I couldn't help but notice it failed it for basically the entire duration of the film. I'm not sure it even bothered me that much, it was just the first time I'd ever noticed it myself without someone else pointing it out in a review and me realising that it was true. That's how obvious it was. Also it didn't help that the film bored me stiff and I had a lot of time to contemplate things. This was not a good movie.This is meant to be a horror movie but it feels more like a romantic comedy (minus the comedy) for the duration of the runtime. I can't remember many horror movies taking this long to get to the point. And even then the point wasn't that good or interesting. I find it frustrating more than anything when one character knows something and the other characters don't believe them - especially when the thing is supernatural and there's no way it could possibly happen, but the main character can't understand why no one will believe them. It's just tedious.Almost the entire movie takes place in daylight, the characters are completely bland and the event the whole movie builds up to almost immediately fizzles out. This is one of the more generous 4/10 I have ever given. There's nothing good to see here."}], "reviews_amount": 71}