{"name": "The Porter: The Untold Story at Everest", "titleId": "tt12859806", "reviews": [{"id": 0, "text": "And it should be. Wow, this was amazing in so many ways. Thanks a lot for making this, and sharing it with us for free. I will make a full review some day. 10 out of 10 for me, worth every second, I didn't want it to end... P.S. the trailer and headers do not do this documentary any justice."}, {"id": 1, "text": "So often these nature trek docs take on a self-righteous tone, and The Porter rises above the pack in both its portrayal of porters and in the humble yet adventurous attitude of its other subject, Nate. While it rightly touches on the hardships of porter life, the highlight of this film is the joy, hospitality, and sense of humor of the porters and locals as Nate ascends Everest. Beautifully shot and endlessly inspiring."}, {"id": 2, "text": "What truly captivated me about this documentary was how raw it was. Not only was the quality of the footage incredible, but the storyline had me feeling as if I was right there with them.I found myself deeply invested in Nate's story and everyone that was introduced along the way. I also felt an emotional connection to the hardships and joy they felt throughout the journey.For anyone who is passionate about adventure, looking to learn something new, or wants to become transported into the Himalayas I highly recommend The Porter: The Untold Story at Everest. You won't be disappointed!"}, {"id": 3, "text": "Such a brilliant, informing, funny and awe inspiring film. To follow the journey in the documenting wasn't just entertaining but it was so well done it made you feel you had the pleasure of doing so.I've watched it a few times now and each time you pick up some new or a little one liner that you missed before.It's such a fantastic watch, it deserves nothing but success."}, {"id": 4, "text": "Having travelled across Spain, Belize, and Guatemala with Nate, I know him as the go-with-the-flow American who never has any qualms with anyone.A completely open mind and free spirit, Nate is a master of seizing opportunities that test the limits of the human body and mind.The Porter displays a phenomenal perspective from the Himalayas that few have seen before. Watching this documentary has me thinking of out of the box dreams within my grasp."}, {"id": 5, "text": "Nate takes on the audacious goal of emersion into the porter life. The film does an impressive job of documenting the daily life of the nepali people who carry loads up the trail to Mount Everest."}, {"id": 6, "text": "During my trek to Gokyo in 2019 I met Nate 2 times It was in the beginning of his experience as a porter Immediately he got me with enthusiasm The way he talked about the subject and his approach of the delicate subject showed me his compassion and integrity I saw this documentary a year later and was surprised about how he managed to get the right tone and sphere of the living in the Himalayan"}, {"id": 7, "text": "I found this film by accident and started to watch it without really thinking. But I was quickly drawn into the film. It is very subtle and understated, letting the sherpas and the scenery tell the story as Nate went through the same experiences as a group of sherpas taking equipment/suppliers to Everest basecamp for 'western' tourists.It was an incredible journey that shows us a side of Everest we never usually see."}, {"id": 8, "text": "The incredible footage and amazing voyage that Nate takes really helps bring the situation down to a somewhat relatable level. An average American putting himself in the shoes, actual shoes, of an impoverished/struggling class of people. It shows how incredibly difficult and dangerous the profession they're in to provide for their families. Foreigners come into their country and user their services, which I have no issue with, but the film exposes how they're seen as disposable and treated entirely unfairly. It causes you to think about how your actions do affect the people that you encounter even while traveling for a short period of time.There really isn't a personally produced film like it and it sets a new bar for the genre."}, {"id": 9, "text": "This is a powerful film that opened my eyes to an incredible injustice. Everyone should watch this film and spread Nate's message, hopefully leading to positive change."}, {"id": 10, "text": "Thank you for bringing light into this issue. This documentry clearly shows us about the unorganized accomodation and low salary rate for porters. I was really concerned about their health and safety, carrying that big load.With the clients as well, not everyone is in a situation of tipping hundred dollars for sure. In most circumstances, people have this mindset in Nepal that, white faces are rich and have a lot of money, which is obviously not always true.Hopefully, this will help to improve the current situation. Namaste🙏"}, {"id": 11, "text": "Nate takes the viewer into a side of climbing Everest arguably no other Westerners have ever seen, let alone filmed. An eye opening film and a must watch."}, {"id": 12, "text": "A fascinating film. An eyeopener. I knew nothing about the porter culture before viewing this film. I had my seventh grade World Geography students watch this film to complement our studies of South Asia. I had my advisees watch this film for inspiration during the early months of corona lockdown in spring 2020. It is definitely worth watching. Thank you for sharing your story and bringing attention to the struggles of porters."}, {"id": 13, "text": "A raw and unique look into the life of a sherpa. This film does a phenomenal job demonstrating some of the vastness of this life by allowing those who should be telling their story to tell it. Important lessons in privilege, empathy, and resilience wrapped up in a documentary that will hopefully be a catalyst for positive change throughout the region and industry. Enjoy and reflect"}, {"id": 14, "text": "A visceral and necessary testament to the power of the human spirit. The filmmaker's lust for life and quest for understanding are contagious. 10/10 would recommend to anyone who may need to zoom out on their life and take careful stock of the luxuries afforded to Westerners and how we might pay that privilege forward to rally behind a worthy cause and champion the rights of those who are deeply and wrongfully mired in an oppressive cycle of back-breaking labor and crippling poverty. If you require a worthy cause to rally behind, watch this film immediately."}, {"id": 15, "text": "Great subject matter done perfectly. Highly recommended. Not trying too hard to make a social statement - You see real people doing a real job and making the most of it. Personally I see people in it making it work and living with more joy in their lives that most of the people I am around. Great film that should be seen at all of the independent film festivals this year. Great first effort by Nate Menninger, congrats you did good with this one."}, {"id": 16, "text": "Absolutely amazing documentary. Good work Nate bhai"}, {"id": 17, "text": "So glad that we chanced upon The Porter on YouTube. It's a sensitive look at the lives of Everest's porters through the eyes of a young American man. It's heartwarming and real without being patronising. Thoroughly enjoyed it and would recommend to all."}, {"id": 18, "text": "The Porter is a compelling film. What begins as a first person story of a young American adventurer seeking another adventure quickly changes into an illuminating look at the life of the porters supporting Everest tourism."}, {"id": 19, "text": "Such a great movie/documentary. I wish the movie was longer, it's sooo good. Respect for the porters and especially Nathaniel for putting it all together."}, {"id": 20, "text": "This documentary opens your eyes to a whole different slope of the trials and tribulations the porters face everyday on Mount Everest. An incredible film, informational, moving, and beautifully filmed! Well done Nate!"}, {"id": 21, "text": "Everyone knows Sherpas. This is the story of Tamangs. Great job trying to experience their work first hand."}, {"id": 22, "text": "Best documentary featuring, behind the scenes of the hardship of the guys who really are one of the backbone of mountaineering and trekking. just one question in my mind, is the wage fair enough."}, {"id": 23, "text": "Never has anyone highlighted the lives of the Nepalese sherpas by being one of them. As an avid hiker, I found this documentary incredibly moving on many levels. It is a piece of art."}, {"id": 24, "text": "The documentary just caught me from the start, the way it shows the magnificent Nepalese people, the incredible and honest challenge Ned had undertaken, the harsh reality of the everyday life of a porter, but at the same time the positive way in which they do their work and hope for a better life for their families and the amazingly beautiful landscapes is really breathtaking. The message is clear, is inspiring, it makes you want to support ethic tourism and makes you want to visit these wonderful place, not as a regulsr tourist but to be embedded by the culture and meet these wonderful people. I was impressed!!!"}, {"id": 25, "text": "I thought this well made documentary. I was also amazed that people who spent $65,000 to go climb a mountain would also think it was ok to tip the person that hauled all their gear a measly $100."}, {"id": 26, "text": "Thank you for making this film. I was there almost 30 years ago, nothing has changed... The life is as harsh as it used to be. Thank you for showing Sherpas as human beings. Thank you for treating them as humans... especially for making them lough... Hope this movie would help them to get somewhat bigger fraction of what they should be earning..."}, {"id": 27, "text": "I sincerely hope this documentary changes the way support crews are treated (and compensated) for this kind of work.Truly a must see."}, {"id": 28, "text": "Great documentary. This journey is a bucket list activity for some. But the side of the story that Nate revealed showed ones daily grind. Gave me a great perspective!"}, {"id": 29, "text": "Nate shows us all that he is not afraid to push himself to the absolute limit to accomplish his goals. This film gives us an eye-opening look into the lifestyle of porters. It sheds light on the needs of that community through Nate's humbling journey. This is a must watch!"}, {"id": 30, "text": "I have done part of this trek last year. And, amidst the magnificent sceneries were the saddest and heartbreaking sights of porters with those heavy loads This film is so true!!! Its exactly how things are!!!Thank you for bringing light on those porters who, despite everything, still find things funny and are full with respect for the trekkers. Love it"}, {"id": 31, "text": "Prior to watching The Porter I had little to no knowledge regarding the life a porter lives. Nate's documentary exposes a devastating, yet true story of an industry filled with hardworking, underpaid employees.Not only was this documentary extremely well produced, but it has an honest mission behind the story.I am excited to see what Nate Mettinger will experience and expose next."}, {"id": 32, "text": "Really encompasses what life is on the way to Everest Base Camp for a porter. Extremely difficult, shows just how hearty the locals are for little pay."}, {"id": 33, "text": "It should be a crime that this documentary is free. This film shows parts of the lifestyle of Porters that I never would have thought to explore.This film is interesting, funny, heartbreaking, and heartwarming all at the same time. I'm definitely going to watch it again."}, {"id": 34, "text": "As a frequent visitor to the Himalayas since 1994, I've watched the trekking industry explode and seen both the good and the bad that accompanies it. The Tamang, Rai, and Sherpa community support the trekking industry and make it possible for foreigners to see the shear awesomeness of nature in relative comfort at amazing altitudes in a way that would simply not be possible on your own. ( Believe me Ive been trekking up to remote areas in Nepal, Tibet and India with no porters-it sucks.)This short film truly shows the perseverance and tenacity of the porters in an up close and in a personable way through Nathaniel's eyes. In my humble opinion, one of the strengths of the film is that it really adds to the dialogue that we need to be having about reforming the tourist industry in the Himalayas so that the cycle of poverty can begin to stop and the next generation of Nepali kids in these communities feel that they have a choice for their future. All in all, the film is great. The footage is inspiring and Nathaniel's gasp of the language really gives him an insider's view of the camderie accompanying the hard journey of the porters. I highly recommend this film. Thanks for making the film free and accessible."}], "reviews_amount": 35}