{"name": "Black Box", "titleId": "tt12298506", "reviews": [{"id": 0, "text": "I put an * because I was wide awake at 2:00am and I needed something to watch. I saw Blumhouse and I saw Phylicia Rashad and I thought ok, lets do.I was pulled in from the beginning and was interested in trying to figure out what was wrong with this guy. By the time the twist happened, I had figured out most of it, but I still couldn't turn away and wanted to see how it ended. I thought overall the movie was satisfying. If you're a perfectionist, I probably wouldn't bother with this because the writing was a little choppy and you might have to suspend disbelief to suspend disbelief, but it's really not a bad flick."}, {"id": 1, "text": "A good thriller movie with new story. But there is nothing horror in this movie. Movie is bit slow but not boring. Climax was not that good and could have been improved."}, {"id": 2, "text": "If you like Black Mirror you'll probably enjoy this. Wouldn't classify this as horror but more sci-fi, drama. The acting is superb."}, {"id": 3, "text": "A well acted and well cast movie with a good pace. Phylicia Rashad is a stand out and really helps the story along. It's difficult to write too much without giving away any spoilers and the minor mistakes in the plot consistency are easily overlooked as you want the story to continue.Not enough of a thinking movie or a thriller/mystery to get an 8 or 9 but a good watch in any case."}, {"id": 4, "text": "So apparently there's this guy who has some severe memory problems and he's somehow got custody of his daughter still. His little girl has to remind him of just about everything.So, he knows a neurologist, who connects him with another neurologist who wants to hook him up to some experimental therapy. To first access his memories through hypnosis, and then by hooking up some device she created, the Black Box.He starts seeing some weird stuff in his 'memories' . They make a point of stressing how he was NOT A FIGHTER.. Oh so come to find out, he's not even the father of the little girl. He's a different person entirely, who has been uploaded into a different body!Then when he goes to visit his REAL family....he comes across as quite the a$$. His former wife, conks him over the head.+1 Star for his wife conking him over the head....He's losing time. I think that his scientist mother has overwritten another guy's mind. And yeah that's what happened. OG dude is still in there. They are fighting for control over the mind and body.His memory coming back he has a choice. Preserve himself or the other guy. He remembers that he was an abusive husband. As opposed to the other guy who is really a good father.I thought the end was a bit too convenient. Convenient that the friend and little girl showed up just in time. The movie was okay. But still just okay.6/10"}, {"id": 5, "text": "It starts slow and confusing in the beginning. However, it is a good movie to watch. Ms. Rashad play some interesting characters."}, {"id": 6, "text": "2.5 out of 5 stars.Black Box plays like a boring episode of a Black Mirror episode. A father is suffering from an amnesia. After recovering from a car accident. That killed his wife. Now a widowed father with his daughter who tries to help with his memories. He visits a neuroscientist doctor who tries to put him in a machine to revisit his memories. Except he is unaware of these memories.It was a boring plot that was done before with the concept idea. The script and direction does not do anything new. The music score is tedious. The characters are forgettable. It lacks suspense and scares for a psychological horror film. There is a couple of twists which did not disappoint with the direction it goes. But it has been done before and better than this film."}, {"id": 7, "text": "A mediocre film, but a worthwhile reminder that when the ability to electronically preserve consciousness is perfected, it will mainly only be used by unethical psychopaths to preserve the consciousness of other unethical psychopaths; a pertinent milestone in the wickedness of humanity."}, {"id": 8, "text": "The only saving grace is Phyllicia Rashaad. Everything after that is all downhill . Not worth anyone's time."}, {"id": 9, "text": "This film made me fall asleep before it reached its conclusion. I could not side with the protagonist and the twist, as clever as it tried to be, I had a hunch. People can be cruel &amp; one's legacy is worth sacrificing their own ethics over.."}, {"id": 10, "text": "This film has the highest rating out of the 4 Amazon Blumhouse films. In my opinion it should have the lowest. I thought Black Box was boring and unentertaining. It was like a bad episode of Black Mirror. Around 45 minutes in I decided to turn it off. 👎👎"}, {"id": 11, "text": "This movie seemed like a student film with a budget. Just plain bland.."}, {"id": 12, "text": "Movie started out pretty good but by the end it just wasn't. The acting was pretty solid and the story was pretty good but the end just seemed forced somewhat."}, {"id": 13, "text": "Had promise, failed to deliver. Not a horror movie, more of a sci fi thriller. Think poor man's Jacob's Ladder and you're partially there. This is the kind of flick you'd expect to be dumped in theaters quietly in January without being screened for critics in an attempt to recoup some of the production expense. It'll pass the time but it won't be memorable."}, {"id": 14, "text": "This was a terrific thriller. There were some really endearing characters - relatable, sympathetic as well as the easy to hate type. The story was solid with ample twists to keep you wondering what the hell is going on! And a few scary moments that added nicely to the creepiness. The acting was really good - but of course it would be, Phylicia Rashad starred. I just loved it - the story was well written and thought out. It was really enjoyable and entertaining. Bravo to all involved. **SPOILER ALERT** This updated twist on the mad scientist story was excellent and unexpected. So what I didn't get the whole medical, techno how the good doctor made this happen. It was about the concept and the follow through that was so well done. Lastly, I couldn't help but to notice that many of the actors have African names. Yes! It is about time."}, {"id": 15, "text": "The whole cast is excellent the story though done before is excellent, it keeps you watching and you're never bored. It does its job, its entertaining!! Will watch it again. Add it to your list or better yet get some popcorn with extra butter and watch it!!!"}, {"id": 16, "text": "The acting by the lead was somewhat boxey and bland whereas the daughter (Amanda Christine) was excellent. It was predictable yet you needed to keep watching to see what would happen next. It was entertaing to watch some of the characters but script/storyline needed a bit more of a punch."}, {"id": 17, "text": "Great concept, great acting, and some pretty creepy scenes. Not a true original but still an excellent movie. Worth watching."}, {"id": 18, "text": "Great sci-fi psychological thriller. Kudos for the acting and the setup. Kept me entertained throughout.I'm taking two stars because personally I feel like the conclusion came bit early, like 25 minutes before the end.All in all great execution by the director and the cast. I recommend it."}, {"id": 19, "text": "I always enjoy a good battle of wills. This is a subconscious Luke vs Darth with the good guy winning in the end. A minor point no-one picked up on, Gary still had the address on his hand a day later. Not very hygienic for a Doctor."}, {"id": 20, "text": "Loved the actors in here. We all love us miss Phylicia Rashad!!! Great story that kept me guessing and genuinely interested until the end! The little girl in here is absolutely adorable and she stole the show. Super impressed with the originality of the story which gave me a lot of Get Out vibes which I loved. Good solid thriller horror!!!"}, {"id": 21, "text": "This movie is way different from Get Out just cos both movies are psychological thrillers and have a black lead don't mean they're the same. This movie was well written, well directed, well acted and has a great cast. Actors of all colors can give the same outstanding performances if given a well written script and a great director. Don't believe the negative reviews go see the movie yourself."}, {"id": 22, "text": "Great film! I would love to see more from this writer. Brilliant mad scientist film. It felt good to see a film in 2020 with substance, great acting, with a great twist and ending."}, {"id": 23, "text": "Just watch it without checking ouy the ratings. The current rating are not doing any justice to this."}, {"id": 24, "text": "It's slow in the beginning but if you give it time it pays off and Troy James {who I immediately recognized from Flash} is amazing to watch."}, {"id": 25, "text": "Really enjoyed this movie. Intriguing, great writing and acting. I can usually figure out plots and don't get surprised but this one kept me guessing."}, {"id": 26, "text": "Lots of plot holes in this. The explanation of the technology is not an explanation at all. It's like saying yes we found out a way to read people's futures from xrays with no further explanation 😆The doctors who's discovered this groundbreaking science always happens to be free. And I didn't really feel her character was realistic at all. The kid was cute but also unrealistic in how you'd behave when you lost your mum and your dad has amnesia. It was funny how the guys friend shut him down all the time when he was trying to make a point about what he saw.I enjoyed the movie a bit because I found it quite amusing towards the end.I think by the end there was nowhere else to go with it but unveil the things we guessed.Black mirror has interesting characters with explanations of potential technologies that massively stretch the imagination but are well executed so as to feel somehow possible and leave you pondering about what could be in the future ahead. This movie didn't provide that feeling at all."}, {"id": 27, "text": "First of all: Please dont expect a horror film. Its more Like a psychological sci-fi-thriller.The Idea of that one is very nice and had much potential. It reminds me of one of my Favoriten series: Black Mirror. If you like sci-fi, you could really enjoy this.But for me, it loses its drive in the middle and gets very predictable. Over all ill give it a average 5."}, {"id": 28, "text": "Saying that these 4 movies are horror is just wrong. They are more Sci-fi and drama. This was the better of the 4 from Amazon and Blumhouse. Mrs Huxible is a jerk in this."}, {"id": 29, "text": "This was a very predictable movie that has been done before and like many point out it could be a Black Mirror episode. It did have a little creep factor in the memories but it was far from a horror movie. Watchable but not memorable."}, {"id": 30, "text": "I was a bit sceptical based on the synopsis but it was a great movie, as I would expect from anything with the Blumhouse name attached to it. The one thing I thought was odd however, was that Phylicia Rashad (who I grew up loving as Clair Huxtable on the Cosby Show) played the a character covering for an abusive son. Was this on purpose? I really hope that it didn't connect with her relationship with Bill Cosby..."}, {"id": 31, "text": "One of the best thrillers that I've watched in a long time! Definitely a must see!!! Best thing to happen in 2020 thus far."}, {"id": 32, "text": "Black Box was a watchable film that had some good staff in it but it also had some weaker ones to,but lets begin with the good ones.Acting was good from pretty much everyone,our lead actor give a very good job and he had a very good chemistry with his daughter and their presance saved this film in a way.Story was survicable but nothing very fresh or new,idea was good but it has been seen in a better films then this one.Ending was also fine but it lacked a bigger impact and it lacked also a bigger shock valaue.In end Black Box was a watchable film but it didnt reached towards skies in full glory"}, {"id": 33, "text": "Excellent performances by every actor even the kid. This one is kept me edge of the seat multiple times. Story develops naturally with the characters and it will all pay off at the end. If you think you have seen this type of story before and you wouldn't like it then don't watch it. I'm someone who likes and seen many twilight zone episodes and i still throughly enjoyed this. This movie is under rated and definitely deserves to be rated higher than 6."}, {"id": 34, "text": "Black Box could easily have been an episode of Black Mirror, a compliment given the quality of that series.It's a slow burn until the big twist arrives mid-film and then things get much more interesting. Like Black Mirror, it touches on some heady topics along the way including loss, abuse, and the sense of self.At first I was turned off by lead actor Mamoudou Athie's performance which was so wooden to be a turn-off. But when you view his character from the perspective of the entire story, it makes sense.Blumhouse is clearly looking to branch out from its horror roots. Science fiction looks like a promising genre given the excellent Upgrade and The Invisible Man."}, {"id": 35, "text": "Proving that budget is merely one ingredient, and not the most important, this story is engaging, unpredictable, thrilling -- as good stories are. Well written, directed, and acted -- better than many dozens I've seen in many years. Drama, Sci-Fi, mystery...I rarely write reviews -- this one deserved the time and my recommendation."}, {"id": 36, "text": "I was about to give up on the movie because of the overly clicheed crackly sounds and creepy cracky character. Yes, it is justified, but they use it as a scary factor and it is not effective, it is only annoying.Also, this is not a horror, but an effective sci-fi suspense story.I wish they had solved crackly man with a dark shadow, would've been subtle and creepier."}, {"id": 37, "text": "This movie was unexpectedly good; really have to pay attention to what's going on. Definitely mysterious, heart-felt and creepy one! Actors did a great job!"}, {"id": 38, "text": "The movie feels like an extended episode of Black Mirror. The first twenty minutes was a bit slow and boring, in my opinion. The young daughter seems a bit too educated and mature for her age and the first 20 minutes mainly revolve around our main character Nolan, ava, and Gary. After meeting Dr Brooks, the movie will take you down an intricate maze of mysteries and discoveries that might have you questioning what's real and what's not.For a good 45-50 minutes, the movie had me entirely captivated. The ending is true blumhouse style which leaves you questioning and wanting more in a positive way.8/10. Solid mystery, thriller, but if you're looking for a horror movie, I'd pass on this one."}, {"id": 39, "text": "Trash not work the film it's printed on. Don't waste your time or money."}, {"id": 40, "text": "What can be salvaged and how far along has technology come? Are we able to help people with mind issues? And is this what the movie is about? Not so spoil anything, so I won't go into that. The thriller aspect of the movie works quite well. I don't think anyone can entirely guess where the movie will go, though I reckon many will at least smell something funny.Having said that, it still is a thrilling and surprising journey one can take with the movie. And one that is suspensful enough to work overall. Good acting, good shocks and a really decent movie we get. Nothing spectacular but more than stellar!"}, {"id": 41, "text": "The rating almost turned me off this movie. But with nothing better to do I have it a go. It was a solid phycological thriller, amazing acting and a good twist. Give it a go"}, {"id": 42, "text": "Intriguing and at times hair-raising; Black Box never thrills the way you'd want it to but offers an emotionally resonant story.In this thriller, after losing his wife and his memory in a car accident, a single father undergoes an experimental treatment that causes him to question who he really is.Mamoudou Athie is a terrific actor and his performance is haunting and raw. I did expect more from Black Box though, at times it felt like a cheap TV movie and the ending is really not satisfying. It's an interesting approach with a lot of character but never gets close to its full potential and that unfortunate. Altogether not a horrible thriller, it's worth a watch but don't expect to be blown away.Follow @snobmedia for all reviews!"}, {"id": 43, "text": "It wasn't very suspenseful and frankly, quite predictable, but it just works the way it is. They've done it well.Even the ending, while I'm not 100% satisfied with it, was still good, this was their artistic choice and I get it.The scientific element is a tough pill to swallow, but if you're open to it, it's fine.The only out of place thing was the way the daughter was written, she's a little too mature in her dialogue and actions, but other than that - it's a good watch."}, {"id": 44, "text": "This is the first movie in YEARS that has had me caring for the lead. A great movie, amazing performances!"}, {"id": 45, "text": "I loved it. To see Phylicia Rashad as mad scientist is a great role reversal for a gifted actor. Its a superb what if tale that says maybe we shouldn't do this, but I wish we could . This is an actor's movie with a good script and direction from Emmanuel Osei-Kuffour,Jr. and Stephen Herman. And guess what, very little violence or horror. This film would have starred other actors a decade ago. Its a testament to how far the industry has come. It's good 👍 film and well worth viewing for everyone!"}, {"id": 46, "text": "So I really liked this movie. It's the classic major plot twist concept, but I really enjoyed this permutation. It has a pretty good dynamic between the characters, and sets up a good sympathetic villain. I think this would have been almost better position as a sci fi, the horror aspect is more suspenseful than scary, but the movie does a great job of keeping your interest and the payoff is there. Definitely worth a quarantine watch"}, {"id": 47, "text": "This is a pretty tight little movie: the writing, acting and direction are all solid and explore interesting ideas around the ethics of memory and identity. I think where it misses is in the attempts to bring in horror elements / visuals. It's not that they're bad necessarily, it's just that they seem more like a marketing attempt than something necessary to the plot and I think the movie would have been better without them."}, {"id": 48, "text": "A movie built around actors who created believable characters who told a captivating story from start to eerie finish."}, {"id": 49, "text": "Very Good movie! You will notice the talents of Phylicia Rashad going to work full time in this fine slow burn, but effective movie. And, what a concept! This movie is a solid 8 stars, Great ending I thought! Satisfying."}, {"id": 50, "text": "Can see why it has the horror genre tag but only slightly. The backwards man is a scary concept especially in your own subconscious, and I couldn't look in places.The premise excited me. The actress who played Ava was the stand out (so cute!) The guy who played Gary also deserves praise.The twist took a moment to sink in and it could be a little confusing in placing, but that is to be expected with the plot. The ending was the one we all wanted and got the real Nolan back. Shame about Dr Brooks, even though she got fired she's still knocking around at the end trying to bring Thomas back."}, {"id": 51, "text": "Was going so well until the reveal came too early in the movie and it wasn't that great.Then the plot slowed down alot and it just got boring and predictable. The main actor had no on screen charisma and neither did any of the others. I just didn't care what happened to any of them. The little girl gave the best performance. The musak score was brutally basic and ill fitting.If you're really stuck and bored then go for a walk."}, {"id": 52, "text": "I truly enjoyed this movie. Original indeed and good acting as well."}, {"id": 53, "text": "Great movie, not a horror (i hate horror), more like a psychological thriller / sci-fi...but a darn good one! Great cast, great acting, great story. You could tell where it was going, but the emotional aspects of the movie made me wanna keep watching. So many different feeling, almost all understandable..you get the why. And its always good if you can almost sympathize with  the villain. Think I would watch it again in a year."}, {"id": 54, "text": "The film i was known to me with the plot, but still it was awesome to watch with the twist and turns with strong emotions to lead ahead and ahead and it ends well too, this film deserves the oscar, may be i am sounding so big but there are lot of take away with this film as a human values with love, care and responsibility with this so called technological world we live in too... thank you the makers for the best ride, hoping to get the deserving response from across the world. good work"}, {"id": 55, "text": "When a movie does what it says, it has to be acknowledged for it. This movie is not really a horror movie but it is a very good sci-fi, mystery, drama story. Good actors, good story, nice to watch."}, {"id": 56, "text": "Im not usually a sci-fi fan, but this solid film had me gripped. its a nifty little thriller with sci-fi mixed in. great acting and fantastic storyline. i think the idea came from karl pilkington to be fair - bryans brain!"}, {"id": 57, "text": "Everything justify be honest, I'm convinced by all the details of the story. I love the concept of the black mirror or so now called the black box. I think this movie bring a debate about the moral and technology vividly. Not only in theory, it brings up the impact on the new life that the technology leading to. Life end its way have its reason and human change it just be wrong. Really enjoy this movie, best sci fic in 2020."}, {"id": 58, "text": "I'm loving that we are starting to get more horror films with black leads ! I saw Phylicia Rashad and Blumhouse and that instantly reeled me in. The performances are fantastic, especially from the lead actor , the young girl , and Rashad. I see a lot of people saying it really isn't a horror movie . I disagree . Horror doesn't always have to be slasher killers or ghosts and demons . I think the idea of going inside our subconscious can be very horrifying . So this indeed portrayed horror for me. It also has some very creepy imagery and an excellent score . Overall good movie that i recommend"}, {"id": 59, "text": "It's a crazy movie not a horror. The story was great, good thriller."}, {"id": 60, "text": "Loved this film. Such a great way to intersect emotion with thriller/science fiction. Very well acted and directed. I shed a tear!"}, {"id": 61, "text": "I have to say, this is the best film I've seen related to the topic of losing a loved one, in a long time. I love how they explore loss from so many angles. We've got grieving husbands, wives, friends, mothers, and children. Then we even get to see how the dead feel about being dead which is fun.I did like the twist, a lot actually, and I really enjoyed how nothing felt forced. For a movie with so many momentum changes, plot twists and emotional elements, it still seemed to flow smoothly. I thought the acting was good. There were only a few moments that I thought were out of place.Oh and uh, no, it wasn't very scary. It was a little sci-fi but definitely not horrific. Kind of a thriller... *Spolier here*My favorite part of this film was the end, when the two fathers were together. When Thomas realized Nolan was the ghoul he'd been running from, I was so happy. I already knew of course, but I loved Thomas's reaction. I have to say I enjoyed this movie because it did reflect on two types of families, two types of fathers and how their families manage grieving. I loved it when Thomas really realized that he was the problem in his family and that Nolan's family loved and needed him. Not to make this a race thing, but seeing an awesome and loving African American father is fantastic in film, additionally seeing another African American father who now realizes the error of his ways is great. Of course, all families have these issues but it felt good for me to see the representation.Overall, this film was very good. I would recommend it."}, {"id": 62, "text": "Good acting really awful mother couldn't guess it all will watch again"}, {"id": 63, "text": "Great Movie!!! Check it out. I promise you won't be disappointed."}, {"id": 64, "text": "MIDPOINT PLOT SPOILER NOT ENDING. Nolan (Mamoudou Athie ) had a car accident and was in a coma for three days. Brain Dead. He comes out of it, but is not himself and can't adjust to his world. A doctor (Phylicia Rashad) at the hospital uses an experimental treatment, stimulating the subconsciousness Soon we discover this is yet another Hauser's Memory. Nolan struggles with the person inside of him.Interesting film. Well done.Guide: No F-word, sex, or nudity."}, {"id": 65, "text": "I absolutely love the reproducing memory bits! Black Box is a clever story about memory loss, trauma, and solving a few mysteries about experiences and why things are happening. Not sure why someone said it's not really a horror most definitely is! For drama/mystery/ horror fans I'd recommend this to anyone."}, {"id": 66, "text": "79, I thought I had it figured out within the first 20 minutes but then it went in a totally different direction. It thoroughly had my attention and I'm glad I watched it. Recommended."}, {"id": 67, "text": "I like this movie but I'm in LOVE with the Blumhouse business model; make high production value films with relatively unknown but fantastic actors and filmmakers and choose stories that are human dramas that can be made CHEAP CHEAP CHEAP. This movie like most of Blumhouse flicks was made for $5 million but you'd never know it by watching.Good film, really for everyone, a human story with sci-fi and horror elements. Not my fave movie this year by far, but very watchable and well made. Worth watching."}, {"id": 68, "text": "With nods to horror/science fiction/thriller movies like 'Total Recall,' 'Inception' (and that's not just because the main protagonist name is Nolan), and 'Get Out,' Emmanuel Osei-Kuffour Jr.'s 'Black Box' has potential but never quite gets off the ground. Osei-Kuffour Jr. ambitiously tries to fit in several thematic threads but none of them quite land. The performances, however, are uniformly strong, especially from Mamoudou Athie, Phylicia Rashad, and charming child actress Amanda Christine."}, {"id": 69, "text": "Great movie . Just when you think you got it figured out . Nope!"}, {"id": 70, "text": "Great actors, but the characters arent that memorable. Storyline is pretty good 3/4 of the movie. Interesting watch."}, {"id": 71, "text": "Great acting from the cast, especially the lead Mamoudou Athie and the young actress. The direction is adequate and fair for a low budget film, however the storyline though has no substance, could have been made as a short."}, {"id": 72, "text": "Very good movie. Didn't expect the ending. Great work! Look forward to seeing more from this director!"}, {"id": 73, "text": "It had potential. Black mirror type story. But all the actors were so bad lol."}, {"id": 74, "text": "I enjoyed it for what it is. A TV movie of black mirror or twilight zone vibes. The actress that plays Ava is outstanding, the whole cast is great, plot holds together. Just not a horror film."}, {"id": 75, "text": "Not horror, but had thrilling moments. The story was refreshing to see after watching many psychological films using the same formula. The momentum slowed down a bit after the climax, but I enjoyed the movie. This Black Mirror-esque film had me entertained and satisfied. Check it out."}, {"id": 76, "text": "The acting is good, but ultimately don't bother. I only watched as a Blumhouse production, but that is not enough to make this worthy of a hour and a half of your life. Even mine."}, {"id": 77, "text": "Definitely not your run of the mill ghost etc horror, but still super creepy. The sound of those broken bones alone sent chills up my spine. Tight pacing except for the first few scenes. The story left enough breadcrumbs for the viewer to follow. I definitely recommend. 2 points removed because, for some reason, the casting choice for the women and children was to have them be significantly lighter than the men, an annoying trend."}, {"id": 78, "text": "Beginning is nice. But it doesnt take too long to apprehend the plot and climax."}, {"id": 79, "text": "Black box 2020 15 Director: Emmanuel Osei Kuffour Starring: Mamoudou Athie, Phylicia Rashad, Amanda Christine, Tosin Morohunfola, Charmaine Bingwa, Troy James, Donald Elise Watkins etcOverall rating 97/100Black box is about a young man who got into a car crash and lost his wife and his memory, he is trying to have a better life and improve his memory for his daughter and family, so turns to a private specialists help to help him restore his memories but her dark intentions are soon revealed. Wow what a movie! I was truly surprised at how fantastic Black box was, there is so much good stuff to talk about here.My first few positives would be the interesting concept, real and unique relationships and likeable characters. And easy to connect with characters. The whole concept of implanting memories into a different human to me was really interesting and cleverly explored with genuine reasoning for this and compelling characters that we cared about. I also thought that the characters were real and had unique relationships making them easy to connect with. The movie had a very genuine and natural feel to it which I thought was great, the relationships were just like a normal day to day relationships for people watching so the movie felt very grounded which I loved, the relationship between the father and daughter was both unique and heart-warming but also heart-breaking, they had such a lovely bond and you could tell how close they were, but due to the fathers memory loss he just wasn't the same man he once was for his daughter, and to have her be so understanding and know what's going on was really interesting and well handled considering how young she was, due to this kind of relationship as well as the fathers relationship with his brother, it was so much easier to connect with their characters as they reflected real life issues and relationships.My next few positives would be the performances, cinematography, use of sound and Jumpscares. The performances in this movie all round were fantastic, Mamoudou Athie was absolutely fantastic in the lead role, he was charming and passionate and conveyed the characters condition in a believable and real way, the daughter played by Amanda Chrstine was also fantastic for a child actor she was just fantastic, had heaps of charm and charisma and delivered all of her scenes excellently, and a big shout out to Troy James for his role as the backwards man, his acrobatic/ contortionist abilities made the role terrifying and yet compelling to watch and he always does an excellent job in all of his roles. The cinematography here was also excellent, it was very unique and blended the beautiful landscapes and sets of the real world and contrasted it with the virtual reality world excellently for a very visually interesting movie. I also thought the use of sound was excellent, the usage of bones clicking and cracking created a very good uncomfortable tone thanks to Troy James, and the diegetic sound of the doctors voice when Nolan was in the different world was interesting and made you feel like you were part of the movie with his character, the use of sudden Jumpscares was also very effective, the movie didn't rely on Jumpscares because it didn't need to, but when they did have some they were executed very well and startled me on multiple occasions.My only two slight nitpicks would be the lack of detail to certain plot points and the slightly unsatisfying ending for the main character. There was just a slight lack of detail to Nolan's character that would have been nice to have a little bit more depth to it, little things like Nolan's job was only touched upon but never really felt significant, this is only me being slightly picky, I also wished they would of added slightly more to the end to make Nolan's character arc more satisfying, I wanted a little bit more of an emotional reunion between him and his daughter and a little bit more time spent on it, they had enough for it to be satisfying enough but a little bit more could have been added.My next few positives would be the balancing of tones, character background and emotional weight. I thought the movie balanced it's grounded and realistic tone with it's characters and relationships but also the very dark and scary tone of the imaginary world perfectly, neither were overused and balanced each other out very well, I also loved the character background despite the plot twist which we will talk about shortly the movie did a great job at making you understand the character and what Nolan's life was like before his accident that made you connect with his character and his relationships even more. The movie also had a surprising amount of emotional weight, due to how much I connected with the main character and his relationship with his daughter and brother I genuinely wanted him to be ok and to be able to be the man he used to be and when that payed off it was done extremely well and built up very well.My final few positives would be the plot twist, added stakes to the plot and the clever mystery about the reality of the plot and what was real. The movie did an absolutely excellent job at creating the mystery of what Nolan was thinking was real or not, I genuinely didn't know who was telling the truth so hats off to the movie for cleverly manipulating the audience and at least for me genuinely being confused as to what was going to happen, and on that note the plot twist was absolutely excellent and for me completely unexpected, the fact that the doctor implanted her dead sons memories into Nolan's brain, made the whole plot make sense as to why he was so different with his daughter, it was very cleverly done and added so much more stakes for the characters, and added to the well-executed dark tone.Overall despite just a couple of little nitpicks, black box is an absolutely fantastic movie, really taking me by surprise, balancing it's more grounded and realistic tone with genuine emotion and heartfelt relationships, with its surprisingly dark and uncomfortable tone for a perfect blend of the two."}, {"id": 80, "text": "More often than not I find my self irritated by unimaginative copycat movies. It's really annoying how +80% of the time you begin to watch a movie but you already know most of the story line and ending just because you've seen the same thing over and over with just different titles. I really enjoyed this one. And I even love the fact that it was an all African American main cast and no one robbed a store, sold drugs, carried a firearm, got arrested for being black or just any of the cliche stuff out there. Really, thank you for originality and an awesome story. Any critics say otherwise, pay no mind. This was totally awesome"}, {"id": 81, "text": "Acting was a bit weird. Story was good with too many flaws. A very expected ending. It was a one time watch"}, {"id": 82, "text": "I actually enjoyed this movie good story line, lousy location, Houston (aka filmed in New Orleans) decent acting (except for Ava) and the way the movie flowed. It's not a horror movie I would say, more of a Twilight Zone-esque episode stretched out to 101 minutes. Definitely watch it."}, {"id": 83, "text": "This is a great movie, with and all-Black lead cast...something rare in Sci-fi. It started slow, but the progression matches the lead character's (Nolan/Thomas) awakening. DEF a must-see for sci-fi fans."}, {"id": 84, "text": "There is little depth to this story, the black box is more akin to a magic box. There is little to no explanation as to how the technology was developed or works. The one brief description is clumsy and essentially a word salad of pseudo technical terms. It completely destroyed the storyline for me as it was not believable in any way."}, {"id": 85, "text": "Excellent exciting Sci fi with excellent acting. More movies like this please."}, {"id": 86, "text": "The plot of the film does not shine with originality. For an experienced viewer, the solution to the plot becomes clear already in the middle. In addition, almost one hundred percent Afro-American casting leaves a feeling of awkwardness and does not allow believing in the characters. Black neuropsychologists, black protagonist living in a posh house. White ppl plays only episodic roles. This is some kind of America from a parallel world, lol 😂. Or is it the new America? In addition, the film is shamelessly drawn out."}, {"id": 87, "text": "Cool movie, just lacking a good and original story line."}, {"id": 88, "text": "I watched to the 1:22 mark and then decided that it was too stupid to even finish. I am going to check out the other Blumhouse films because I saw someone on reddit say they were good, but this was a waste of time. I mean, think about how crappy a movie has to be for someone like to invest an hour and a half into, and then turn off right before the ending. It's just that uninteresting. I tried, I really tried.If you want a better Blumhouse movie, check out The Lie, and skip this one."}, {"id": 89, "text": "It tries to be clever and original but comes off as stale and the twists are telegraphed so much that I was calling the end of the story after 20 minutes. It's billed as a horror but other than the cracking noises and the contortionist character it has no real horror elements to it: no jump scares, no feeling of dread, no suspense building. The lead actor does a good job portraying the different characters though and is the only redeeming part of the film. We laughed at the final scene as it looks as if it's setting up for a sequel...hope not."}, {"id": 90, "text": "The movie starts very promising but in second half it looks dull and till the end you can find many unexplained plot holes and just because of this the movie seems like illogical and incomplete. Disappointed."}, {"id": 91, "text": "I see a lot of people relating this movie to Get Out but I strongly disagree. This movie has its own interesting storyline and very talented actors. I thought it was a very enjoyable movie. Is it as great as Get Out? No, but I don't see why comparing 2 good movies with different storylines. This movie had a lot of potential too."}, {"id": 92, "text": "Mais um filme de ficção EXCELENTE na Amazon. Não esperava nada e fui bem surpreendida. Another EXCELLENT fiction film on Amazon. I didn't expect anything and I was quite surprised.#movieslover #amazonprimevideo"}, {"id": 93, "text": "This movie has a good balance of horror and sci-fi that really keeps the audience and fans of this genre in their seats throughout the movie. It really reminds me of Black Mirror in a way and has been my favorite of the four Blumhouse movies added to Primevideo. 84/100"}, {"id": 94, "text": "This movie had it all! Drama, light horror, sci-fi, realism, intensity, emotions, ... etc. I think the movie fills the cup in my opinion! Well done performances and storyline! I'll definitely be recommending this film!"}, {"id": 95, "text": "I am a huge horror fan. I've seen 100s of horror movies. That being said, this is more of a suspense. Character build is really good. Loved the movie and ending."}, {"id": 96, "text": "Do not listen to what people write .. See it and judge for yourself .. You may be surprised"}, {"id": 97, "text": "A very good movie with a very good story. It brings many psychological and cognitive aspects which is very interesting !"}, {"id": 98, "text": "I wouldn't classify this movie as horror, but if you like Black Mirror series, you will like it. Interesting story as it deals with consciousness."}, {"id": 99, "text": "I watched half the trailer, it pressed a few of my horror/suspense buttons so stopped the trailer and I popped it on. The film wasn't quite what I expected, it was a hell of a lot better than I expected and took me places I never expected. I was completely hooked by it from start to finish, even the girlfriend got into it.I guessed a few of the twists and turns but even this didn't affect my enjoyment."}, {"id": 100, "text": "As far as I'm concerned, this movie deserve a 10 out of 10 as it is a REAL THRILLER and MYSTERIOUS.It is hard to write a critics without putting any spoilers and I won't do it.This movie is a MUST SEE because in my opinion, the plot is duly made and actors have done a great performance of acting.I was INTO this movie all along until the end which is awesome but I won't tell nothing much ;)Go to see it, you won't be disappointed ;)"}, {"id": 101, "text": "Child star Amanda Christine steals the spotlight from seasoned actors in this suspense thriller. Watchable but ending lacked depth."}, {"id": 102, "text": "I was unexpectedly impressed with this movie. A psychological thriller that doesn't depend solely on sex, foul language, political agendas and over-the-top special effects, how refreshing. Excellent acting as well. At first I thought the lead was not a good actor, especially compared to the actress playing his daughter, but then you realize at the end just what a good actor he is. The epilogue scene at the end was a little cliche but luckily didn't ruin the ending, which is so common with movies these days."}, {"id": 103, "text": "The little girl was too bossy and sassy for me, very annoying. I get where they were going with her character, but, it didn't really make her very likeable. Other than that, all the acting was solid, I liked the story, even if it did feel a little long in parts. The twisty crackling thing had me hiding my eyes! (but I'm a bit of a scaredy cat when it comes to that stuff) I liked that the characters behaved the way you would imagine people would, none of those moments where stupid decisions are being made and you want to yell at the screen. A little predictable but all in all a decent film."}, {"id": 104, "text": "I absolutely enjoyed this film from start to finish. If you want something suspenseful, then watch this movie. Give it a chance and it will provide you with lots of twists and turns! Cant go wrong with this one!"}, {"id": 105, "text": "I can honestly see why this got less than a 10 star from others, however I LOVE movies and I am the type of person that enjoys a story line and visual more than the editing and being a perfectionist about movies. I don't even think a real movie reviewer should be a perfectionist. Film is ART and ART is beyond perfect to the average eye, right? Anyway, Blumhouse gets me every time. I agree that it's not horror at all. Nothing scary about it. Just freaky. I LOVE the idea. Reminded me so much of Jordan Peeles Get Out except this time, the black mom used someone who she felt was already brain dead to bring back her son. Where as Get Out was strictly rich white people luring innocent and talented black men to their home, hypnotizing them and then transferring their white mind into the black body. I still can't get over how Fd up and highly capable that could be :-(. I love the main character and actually looked for more movies by him because he did such a good job. He does have another movie I recommend to you guys called Uncorked. Check it out!"}, {"id": 106, "text": "It's a recent trend but the three movies I've watched this year by this company have delivered. Looks like I saved the best for last. While the twists can be mildly suspected after a point, it doesn't give it away immediately and I love how many open ends and possibilities it leaves for the future without its typical cliffhangers. True art! I'm bowled over and looking forward to more from this genre.Skillful acting, the music plays well into the story, the cast is limited but every character is played naturally. The story flows well and conveys a lot of detail through smart direction choices."}, {"id": 107, "text": "Enjoyable sci fi cum yarn with elements of Ringu-esque horror , well acted with a largely unknown cast ( bar Phylicia Rashad), a slightly silly premise and an extraordinarily precocious and endearing child of the main protagonist. I'll give nothing away about the plot, but I found this movie surprisingly enjoyable."}, {"id": 108, "text": "I thought the movie was amazing and not sure how everyone says that they knew the twist that was coming. The little girl annoyed me slightly but I'm not a kid person so that's on me. However, she won me over in the end. I thought this movie was every bit as good as a huge movie premiere in a theater and I loved the sacrifice that was made in the end as redemption. The only thing I wish is that the two families blended. Also, not sure how you can take a brain dead person and heal him with memories when there still should be physical problems with that brain working at all. Other than that...loved it! Felicia Rashad is simply amazing and beautiful and both main, male actors did great !!"}, {"id": 109, "text": "Glad to find a lil twist on the normal horror films"}, {"id": 110, "text": "Black Box begins intriguingly - a single father suffering from amnesia tries to regain his memories through a tech-backed experiment. The dynamic between father (Mamoudou Athie) and daughter (a terrific Amanda Christine, the true star of the film) is warmly established. It takes about an hour before the big (predictable) twist arrives, and thereafter, Black Box descends into a heap of melodrama. I didn't find Black Box positioning itself in the horror genre except for the first time the Backwards Man (played to astounding effect by actor-contortionist Troy James) pops up. It's very clearly a psychological sci-fi thriller that focuses less on the sci-fi and more on familial bonding.The performances (from the all-black ensemble) are good enough to drive the film forward even during its melodramatic portions, with Amanda Christine being the standout performer, followed closely by Phylicia Rashad (as Dr. Brooks). The film has most elements of a Blumhouse production and blurry parallels to Jordan Peele's Get Out can be drawn. However, once the initial uneasiness recedes, Black Box is content being a little sappy in its proceedings. While I was never bored watching Black Box, I felt it could have been better."}, {"id": 111, "text": "I put it on last night on my phone while in bed, the tags of Sci-Fi, Mystery and Horror giving me hope that it will be something mind-boggling and a bit scary that will keep me on my toes.I was wrong, though. The movie started out OK, but later on became quite predictable and around the middle or right before, I already had figured out the mystery and the second half of the movie was rather boring.It doesn't help that at around 60% of the movie, I started falling asleep and left it to finish it the next day and it actually managed to feel even cheesier in some parts.The acting was for the most part OK, except for the protagonist's daughter that seemed way too mentally and emotionally mature for her age to the point where I started questioning is this a Horror or a Comedy/Parody.The rest of the movie was almost spot on, except that it was too predictable and not scary at all, if I started falling asleep while watching it alone in the dead of the night, it says how scary it is.Overall, I don't regret watching it, but I could've definitely watched some better and more rewarding Sci-Fi Mystery that I was originally looking for."}, {"id": 112, "text": "Although the title proves to be rather forgettable, Black Box is anything but. It's a unique and peculiar twisted vision from the likes of Blumhouse, which has a great premise, but doesn't always execute it as well as it could have. I'll start with this films flaws, for a number of reasons, this film ends up feeling a bit uneven. I won't spoil the whole twist of this film, you know a 'twist' is coming though as you watch it, and once it is revealed you can't help but feel a bit cheated out of the whole premise it set up. This alone accounts for the film feeling uneven for the last 1/3 or so, and also leads to a rather predictable finale which I knew almost exactly how it was going to play out. However, despite these flaws, the film does manage to capture the viewer's attention all the way throughout- by never giving up on the wonderfully mysterious and unsettling atmosphere it sets up from the very beginning. The acting is quite good, most notably from lead actor Mamoudou Athie, who provides a nearly incredible performance all the way throughout. Other standouts would include rising star Amanda Christine, Tosin Morohunfola, and Charmaine Bingwa. Phylicia Rashad's character feels a bit played out at times, as her character really serves no purpose other than a plot device, and a generic one at that. I enjoyed the cinematography in this flick, as well as the ominous tone and music it kept threw out. It never feels like more than one film, but you can't help but feel there was a far better way to tie this story together, rather than focus on something you truly aren't invested in, or even given much of a reason to. In the end, at its worst Black Box can be a bit of a structural mess, but its ideas and potential- as well as its phenomenal lead performances- lead this film to be quite enjoyable. It's an experience unlike any other, one you won't forget, but one you wish they would have spent just a little bit more thought on. My Rating: 7.25/10"}, {"id": 113, "text": "Black Box is the one of a first batch of movies made in partnership between Amazon Prime and Blumhouse productions, famed budget studio that specialises in making horror movies. Though by no means a bad film, I do wonder if that Blumhouse name might give people incorrect expectations about Black Box that may lead to disappointment.Six months after losing his wife in a car accident, Nolan (Mamoudou Athie) is struggling with memory issues related to the severe head trauma he received. This is impacting his ability to care for his daughter Ava (Amanda Christine), so he agrees to undertake an experimental therapy from leading specialist, Doctor Lillian Moore (Phylicia Rashad), which combines element of hypnosis and virtual reality. Exploring his own memories, Nolan comes under threat from an unrecognisable and barely human form.When I mention expectations, even in that synopsis it sounds like the movie is a horror film - and the character of backwards man, played by Troy James, who I've seen perform on The Flash, is certainly a creepy element. But beyond him, the film is more of a science fiction thriller, than it is a horror film - and that may disappoint some brought by the Blumhouse name. Away from that aspect, the film has the good sense to use its rather obvious twist well before the end, and then use that as an exploration point for the finale, rather than as the ending itself. That said, I thought overall the film was a little dull and struggled to full maintain my attention for the duration.However, it is the first feature for Writer/Director Emmanuel Osei-Kuffour and for screenwriter Stephen Herman and though, as I say, I thought the plotting was a little pedestrian, from a technical standpoint the film is pretty good. It often interesting to look at, and what visual effects the film has are nicely done. Mamoudou Athie is decent as the lead, a little bland at the start but that does begin to make sense as the film goes on.I have no massive regrets about watching it, but it was all just a little too mediocre to consider recommending it."}, {"id": 114, "text": "Really enjoyed the actors and some of the storyline. Somewhat of a different role for the great Phylicia Rashad (for those who have never seen her play the antagonist.) Had if it not been for them and the bits of clues they drop at the beginning, I probably would have stopped watching.Concept seemed to be a mixture of Get Out, Self/less and Replicas. The story is slow moving, but there are a few plot twists that make the slow pace more palatable, different and new.I would not categorize this movie as horror, because there was nothing really scary about it. It was more along the lines of mystery/sci-fi with a splash of suspense. In the words of my niece, It felt like a group of college film students came together to make a fan film inspired by their favorite movies, had all the equipment and actors they wanted, but did not have the experience to make it the film it could have been.The saving grace and the reason for the six star rating was that I could see the intention of the movie and Blumhouse's desire to do more than just straight horror. Maybe down the line with more practice, we can know them for more than the horror genre, but for now, if it ain't broke don't fix it."}, {"id": 115, "text": "REVIEW - BLACK BOXA guy looses his wife and memory after a car crash and tries to bring up his daughter alone, eventually the loss of his wife and memory gets too much so agrees to try and experimental treatment to try and recover his lost memories from his subconscious.Whilst undergoing treatment he sees memories which he believes are his until......What makes who you are? What if you had to question who you are / were?Interesting film which keeps you guessing until the reveal even then not knowing what will actually happen, thoroughly enjoyed this little science fiction film about..... no spoilers.Acting excellent, story interesting, one to watch.Rating 7 out of 10"}, {"id": 116, "text": "Oh my, this movie had a lot wrong with it.First problem is the fact, that this ridiculous story would of had been unbelievable and childish even in the 1980's. It's 2020 now, you can't just write this kind of nonsense and expect people to not laugh at you. Scifi is not magic.Then comes the boredom. It's an hour and a half movie but it felt like 3 hours, it was like watching paint dry. I mean most of the time nothing happens and even when something happens it's so bad you just wanna be somewhere else, just like the actors seem to.Yeah, the acting. These were awful, just total rubbish. But the braindamaged script didn't help probably. Who writes dialog that's mostly just Um, hm, I think..uh, um..hmm, wait..um, uh, I don't know, um..hmm, uh..um...?Even the sounds were done badly. The fx was way too loud and talking was too silent, not that one would lose much from not hearing all the Um, uh..hmm, oh um...Over all, not worth watching."}, {"id": 117, "text": "Black Box indubitably delivers big when it comes to the Psychological aspect. Meanwhile convincing performances &amp; a gripping narrative also helping up building much necessary tension &amp; suspense. Yet it somewhat faltered in the third act.The story commenced on a straightforward path. Without unnecessarily wasting time, it gets to the premise rather expeditiously. Successfully grabbing my attention right away. I was so intrigued by the idea, a captivating concept anyway. With a fairly modest allowance, they indeed had a decent showing in regards to the visual effects. Using all those to their advantage depending upon the set requirements in a particular scene.The Soundscore had a certain melancholic tone attached to it, which I very much adored. Though not absolutely fluent in all its practices, the cinematography looked insipid. Shaky movements, weirdly panned frames; it consequently exposed an amateurish work behind the lens.Another gripe of mine would be the third act. Sailing smoothly before, just when it was about to enter final phase; it took a turn for the worse. The sudden change in tonality, with a convoluted writing; it strides away from its designated path. Undermining its substantial quality underneath.Although the same can't be said about the performances. Quite contrary to its inferior technicalities, All of the acts, each one retaining prominence of their own. If I were to pick one, Amanda Christine as Ava would be my preference. Left quite an impression in that short span.Summing it all up, It was quite an emotional ride with a compelling concept in its core. A set of impressive performances only let down by inept writing. If only they managed to maintain its consistency throughout, the end result would have differ."}, {"id": 118, "text": "There are two things I really like it when science-fiction films do them. One, I like it when they are nice and easy to understand. Even just on the surface, so that you don't feel like you need a degree to understand them. It's fine to have some deep levels of complexity under the surface, but for those who just want to watch the film and enjoy it for what it is - at least on the first viewing - to have things simple enough is very important. And secondly, I love when science-fiction combines itself with horror. There aren't huge quantities of that here, but just enough.The lead actor in this movie has an amazingly soothing voice. I'm not sure if that counts for anything or not, I simply had to get it out of my system. He does a decent job of putting the movie on his back and having enough charisma to carry it through. But this isn't really a film about star-power, it's far more about the story.The film let's itself down a bit at the end. It all gets a little clunky and chopped together. Also I wouldn't have minded seeing it take a more daring and memorable direction at the end. There were plenty of ways it all could have played out and the way they went with just felt a little safe to me. I had a pretty good time with the movie all up though and would recommend giving it a look, but don't set the bar too high going in."}, {"id": 119, "text": "I liked this quite a bit more then I thought I would. Especially coming off the heels of Nocturne. While not great, there's definitely more of a heart to this movie. There's a bit of a father daughter thing going on that grounds this in a more relatable way. Plus, the horror in this is interwoven in the story in a way that works. I can't say it's really scary or unique, as it does rip a lot of ideas from other things. I like that this is more of a drama then a horror movie. However, around the halfway point it takes a turn. There's a big reveal that completely shifts the movie. The first half is about a man trying to remember his past like in a typical amnesia driven plot. Then it shifts into something else. Which may work for some but it kind of turned me off towards it. It took a sympathetic main character and turned him into someone horribly unlikeable. It doesn't ruin the movie because the writting is decent and the performances are really good. Those two things carry a lot of this strange Get Out inspired thing. Other then that, the father daughter relationship is quite nice. I wish that was more developed in the second half. Aside from that and the reveal at the midpoint, it's worth checking out."}, {"id": 120, "text": "This film definitely has some negatives I want to discuss, but I'll start with what it did well.The story is very unique and interesting, I personally haven't seen anything like it before and the twists and turns the plot had was great. I thought the characters in this were very likeable and shoutout to the daughter. I thought she did an excellent acting job.My main negative to this is that I feel like the film lacked a proper beginning. No backstory to the car crash or the characters. Felt like it was missing 10/15 minutes. If I hadn't read the bio on this I'd be way more confused. Although it was an interesting story I felt it fell a bit flat in areas. Long segments where little to nothing really happens of note.But on the whole I'm pretty pleased with my choice of film. Exceeded my expectations definitely. It's not a film that you will rave about or anything, but worth giving it an hour and 40 mins of your time."}, {"id": 121, "text": "Welcome to the Blumhouse is a collection of genre horror films, now curated by Amazon. The master horror director Jason Blum has combines traditional tropes with modern sensibilities. Something for everyone.Black Box has the creepy notion of transplanting brain waves to reconstruct consciousness from the dead to the living. The spine- tingling attraction is that while trying to create new life with old, (Mamoudou Athie as recently-comatose Nolan, aptly evoking thoughts of Christopher Nolan's memory-loss masterpiece, Memento), a new mind in a foreign body, a Frankensteinean doctor, Lillian (Phylicia Rashad) cannot expunge the errors of the previous life. She can't alter violent and dangerous traits residing in an active brain that may be quite a bit more macabre than the host.Yet, Black Box is a generally quiet scare, the best kind because it's the mind's memory that is orchestrating the imbalance, not a ghoulish scientist. In this case, she played the calming force on the Cosby Show, and ironically, we know what happened to Bill.However, Blumhouse is interested in family dynamics, the kind that turn a Thanksgiving feast into mayhem, at least figuratively, exploring the contradictions of love in all its potency. Blumhouse's Nocturne has the family mosaic in its complicated and sinister form.It's the early part of Black Box that has the most powerful ideas challenging the audience to like Nolan while disliking host Thomas. Similarly, Lillian manipulates Nolan's consciousness while the audience tries to figure out the good guys from the bad.It becomes a hot mess of identity and priorities. If our current election has your mind bent, then see Black Box to straighten it out when you realize that no human enterprise can be fully controlled or understood."}, {"id": 122, "text": "I've noticed a pattern of films with Black leads, and or majority black cast, seems to be reviewed much harsher than majority white films on here.For instance a commentor rated it a 5 and gave his review a title of too dark ... In reference to the the majority black cast-not the script. From his viewpoint, the idea of Black professionals made it ridiculous, unbelievable, etc. Because apparently they don't have Black professionals, doctors, etc.It's unfortunate when you're so small minded that a film with a majority black cast offends your senses, especially when there is next to none in existence - in spite of Blacks working in all professions(including the ones featured) , and not just the lower rungs of society as often portrayed via media.I was hesitant to read the reviews because I knew this was the type of vitriol I would see, but I was curious as to how others viewed the film. I like to hear other perspectives/insights and constructive criticisms.As for me, I thoroughly enjoyed it. The acting was great from all. The cast seemed very reminiscent to what I've experienced in life.The talented Phylicia Rashad was great. Her voice is so calming. This was definitely a different from previous roles I've seen her in. I enjoyed the twist. It was a good movie and worth the watch. By no means was it a horror movie though. Nor was it B grade type, or less interesting Black mirror episode. 🙄However, if you don't like Black people, you definitely won't like this movie, so skip it and save everyone from your racism- this isn't to say if you don't like this movie you're racist, but racist def won't like seeing successful Black people not being drug dealers/convicts/rapist and the usual stereotypes. I do find it interesting the number of reviews that felt a need to point out that its a majority Black cast.I enjoy movies no matter the racial makeup. I just finished one with an all Indian cast, Chinese before that, and Native American before that. They were all good to me. Honestly, I'm a bit bored with the all white (esp American whites) casts-kinda feeling overdone at this point."}], "reviews_amount": 123}