{"name": "My Octopus Teacher", "titleId": "tt12888462", "reviews": [{"id": 0, "text": "Everyone do yourself a favour and watch this beautiful documentary about Craig Foster and the wonderful relationship he had with an octopus. It highlights how highly intelligent these beautiful creatures are. I can't believe I cried over an Octopus"}, {"id": 1, "text": "As I sit here in my living room with the 'very unhealthy smoke' outside (from all the rampant PNW fires) I turned on Netflix and saw this Documentary. I thought Hmmm...that looks good. I was immersed from the get go. 23 minutes into it I paused it and had to text all my friends and tell them to watch it. I just put a post on Facebook to please watch this incredible film. It was one the THE very BEST documentaries I have ever watched. I always knew the octopus was smart but this film reminded me how smart. The bond between the octopus and filmmaker were beyond amazing. See this film now. And tell all your friends. There are important messages to take away from this documentary and we need to share those messages. We are part of this earth. Not just visitors. By the way, this is my first ever review. I felt compelled to write one after seeing this movie."}, {"id": 2, "text": "There's not much to say about this documentary type movie. It show cases an animal that's one of the most intelligent creatures we know and interacting with it, in its own environment. I was pretty shocked by how much personality the octopus showed, and intelligence. It gives you such a large level of empathy and love for a creature that's so alien looking compared to a regular pet (a dog or a cat).Definitely needed this in 2020. Would recommend this for anyone that enjoys the sea, or really, anyone."}, {"id": 3, "text": "What a beautiful film. Behind all the stunning imagery, emotion and story is the relentless discipline to dive every day for 5 years and then discover this bond over a year in freezing cold water. I have been to the kelp forest and gone into the water. To hold ones breath and be still to capture such astonishing beauty over such a long period of time is nothing but remarkable. In an age of staged nature films the simplicity and authenticity of the story is brilliant."}, {"id": 4, "text": "A truly touching story of two species connecting on a level that is unknown to most. Animals are the greatest teachers out there, and what a blessing it is to connect with such an extraordinary creature. This just goes to show no matter how unlikely the connection, love can exist in any form."}, {"id": 5, "text": "Loved everything about this amazing documentary. The manner in which the story unfolds keep you needing to see and learn more about this amazing creature and its relationship with the filmmaker.Brilliant !!"}, {"id": 6, "text": "This film redefines the documentary genre. The film touched me more than 99% of all films and was more exciting than the best thriller. You get a humility towards this world and everybody should have seen this film. At school it should become a compulsory subject."}, {"id": 7, "text": "Wow. No other words to say.If you're a film junkie like myself then you'll appreciate the time and effort that Pippa Ehrlich, James Reed, Craig Foster and everyone else put in to make this happen.I enjoyed it. Not my place to say where it could have been improved. It is what it is.Thank you."}, {"id": 8, "text": "Craig and team have created a magical world. Gives insight into the magical coastline off the western cape of South Africa. Stunning photography and videography and a beautiful thoughtful story about a man and his friend the octopus. I'm pretty sure some of the scenes have never been documented before and this contributes to science and understanding."}, {"id": 9, "text": "I just know I can't put into words how I feel about this movie, or even try to explain it. I literally cried over this. All I have to say is that it's a must. Such a beautiful story, such smart creatures."}, {"id": 10, "text": "This is the second documentary I have watched on the Octopus, but this one is more personal. We don't get to know the context except that human protagonist has gone through a period of crisis and goes back to one of his childhood occupations--underwater exploration. He doesn't set out to study the octopus, but is surprised by one in particular and in over a period of several days earns its trust. He learns something everyday right up to the end (and beyond). My title comes from the protagonist, Craig Foster who originally saw himself as visitor, but came to realize we all are part of nature. Beautiful and I mean beautiful cinematography and moodily appropriate music."}, {"id": 11, "text": "Wow. More than I was expecting. Had a tear in my eye by the end. Wow."}, {"id": 12, "text": "Beautiful images, heartbreaking story, and ...I will definitely never eat octopus again...."}, {"id": 13, "text": "I have never seen such an amazing film in my whole life. Nothing could distract me from being glued to this film. I never expected I would be hooked into the development of an animal human relationship. The Octopus has intelligence and and awareness seemingly to the level of a young child but in its own environment raised to superior intelligence. Well done Craig Foster for your insightful approach. Somehow it was meant to be you."}, {"id": 14, "text": "I watched this, and it is different from other documentaries because it is just a documentary about just one octopus and a man's relationship with it. It was hard to watch in some parts because he had to stay neutral and not interfere with nature, something I would find very hard to do. I have seen quite a few documentaries about the octopus, and they are extremely intelligent. They do not live very long, the female that is. The narrator and documentary maker is not a very excitable person, he is extremely mellow and relaxed, so if you are expecting a more Americanized type of documentary with a more rambunctious type of host/film maker than you probably won't enjoy his voice. I found it to be one of the most intimate documentaries that I have seen, and it really consumed my emotions."}, {"id": 15, "text": "This is one of those events in your life you just have to experience in order to understand the magnificence of the experience. I dont want to tell you about this movie. Because it didn't feel like one. It was an hour and a half underwater experience. I visited the underwater world and I was taken on a journey. I have two regrets, I wish I saw this on a movie screen in stead of at home and I wish I could have met the octopus. Blessings to the makers and the kelp forest. And now you close IMDb and immerse yourself..."}, {"id": 16, "text": "Phenomenal. This movie excites me that humans still have time and can integrate and live in harmony with the natural world. I am inspired to be more in tune with and more gentle with nature. Each person can find a teacher in their back-yard to learn from and to honour. &lt;3To producers and writers: A plea for more content like this! I want to see more uplifting, alternative and nature mindfulness content and less of the hollywood paradigm."}, {"id": 17, "text": "A really quite beautiful documentary that had me shed a tear or two..."}, {"id": 18, "text": "Takes you and Nature Documentaries to a Whole New Level"}, {"id": 19, "text": "This documentary literally saved me from the depths of depression and despair living under one of the most draconian lockdowns in the world in Victoria, Australia. It demonstrates how precious life is, in every shape and form. I dare anyone to indulge in calamari after viewing this heart wrenching relationship between this beautiful female octopus and this equally beautiful and compassionate, south African man. The cinematography is visually stunning, and his remarkable ability to capture the soul of this mesmerising octopus is truly amazing. If eyes are the window to the soul, then this octopus with her huge, expressive eyes will convince you. Her fight for survival, every single day of her short life, will give you strength, her relationship with the man will renew your faith in humanity, especially in this dark time. He entered her world, with such love and respect, unlike most humans who go to steal from, and destroy the oceans. The kelp forests took me away to a world l wanted to retreat to, a mystical world so different to the life we live on dry land. When she gives her life to reproduce, l challenge you not to shed a tear. Life changing for me, thankyou, beautiful south African man, l really needed this documentary right now"}, {"id": 20, "text": "What an amazing relationship between a sea creature and an amazing human being, nice distraction from the world around us at the moment 10 stars"}, {"id": 21, "text": "Honestly, I'll never look at an octopus again without feeling deep respect and love for a most wondrous and beautiful being. A must see for the world. With deepest respect. &lt;3"}, {"id": 22, "text": "First documentary to make me cry. Watching this was an emotional rollercoaster. Beyond amazing. So beautiful, mesmerizing and heartbreaking"}, {"id": 23, "text": "I've always held great admiration and wonder for wildlife films and although it's often frowned upon in some quarters when humans interact a little more closely, I found this to be an incredibly emotional, respectful and fascinating story.The Octopus Teacher is a beautiful tale of soul searching and unlikely friendship, combining an absorbing view on complex animal behaviour and how the natural world can humbly guide our perspective of life.The story is matched with stunning photography and sound. A real heart warmer."}, {"id": 24, "text": "I can't express in words the beauty of this documentary."}, {"id": 25, "text": "First of all, meow lady, if Craig had not been there, the process of her end of life would have been no different. Who are you to dictate what species is denied food? He interacted with a species, but at no point did he become a guardian. Think about balance, and not emotions.That said, one fascinating story that I enjoyed immensely.Oh, and the review that talks about making it with an animal? Grow up."}, {"id": 26, "text": "Best documentary ever. Its life changing. People should see this."}, {"id": 27, "text": "This should be required as part of every child's education. The connection between the environment and all that dwell therein seems to have been lost and Craig Foster was able to reconnect with himself and his son in an absolutely beautiful surround."}, {"id": 28, "text": "A mesmerising piece of cinematography. No bravado from the narrator, just a soft spoken man who embodies the gentleness he has received through being in nature. We might all want to take a page out of his book and get outside... this world needs it."}, {"id": 29, "text": "This film manages to incorporate narrative and stakes into an octopus documentary. That is no small feat. As a result, it becomes much more than just a National Geographic special. Just as the filmmaker built a relationship with this octopus, the viewer builds a relationship with both of them. The down side is that everything can feel a tad overdramatic at points - do we need another shot of Craig Foster staring deeply into the camera? It is far from perfect, but my kids watched this entire thing on the edge of their seats. It is a beautiful little tale."}, {"id": 30, "text": "Exemplary footage but misplaced trust. The filmmaker got many things out of the encounter including the trust of the octopus but didn't reciprocate the one way exchange rationalizing it was okay to watch its demise. Why couldn't he give back and try to chase off the shark to see if the bond might have been stronger. We think its okay when dolphins save humans from sharks or orcas, why not save creatures in turn?"}, {"id": 31, "text": "Amazing story.Amazing camera work and footage.Amazing story about a beautiful intellectual human/animal relationship that has the ability to entertain and emotionally move any viewer or audience.Watch it and you will never regret it!"}, {"id": 32, "text": "Cheap shots. Honestly, this is a fantastic film, when the octopus is on screen. But the problem, as many others have stated, is his lack of empathy. She came to trust this man and even possibly care for him. Yet when she's being picked apart? Nothing. Not a simple hold for comfort as she passes on; just this cold, unfeeling man, getting his camera in the right position for when the sharks come along.This film made me cry, but not because it was so touching; the relationship he had with the octopus. What made me cry was that this man interacted, interfered, and created this bond between himself and this octopus; only to stand idly by in her last moments of need.The film clearly established the fact that these creatures are highly intelligent. It makes it painfully obvious she feels things, such as when her arm is taken by a shark; what more how she can be shaken by such traumatic incidents. And yet, while she is withering away, feeling these scavengers picking at her flesh, he gets his camera in place to take a nice shot.What made me cry then? I'll tell you, it's the thought that she probably recognised him when he came into the ocean at night. She probably knew he was there while these fish were pecking at her body, slowly drifting away. What comfort she might've felt in that moment, only to be sadly disappointed watching her friend from afar, setting up his cameras and lights to get a nice shot.At one point in the film, he brings up the question: what is she thinking right now?So, he can clearly understand that she isn't a simple mollusk, filter feeding on the bottom of the ocean, but rather a complex being with more intricate emotions and cognition than average sea creatures. Yet, he films her wasting away. What if she was thinking he'd be there to hold her again, while dying? What if her thoughts were: I would like to die in the safety of my friend's arms?Well, she's not going to get that, because that would cause him to lose his money shot.At first I thought that maybe I was reading too deeply into these things, but then another thought arose, reminding me that I never originally cared so much for any octopuses. It was this film that taught me to care. It was this film that showed me there is an intelligence displayed by these creatures, and that bonds were possible between humans and mollusks.So, in one swift blow I was taught to care for these creatures, then (I wish just as swiftly) I was taught to prioritise money; getting the best shots, over being a genuine friend; no matter the species."}, {"id": 33, "text": "When this pandemic is over, I hope each and every one of us, finds the ability to do something to elevate the meaning of our lives and of those around us, including animals. As a sometimes overworked editor, I too have thought I never wanted to see an edit bay again. But when the universe chooses you to tell such an incredible story, you must. I hope to one day be able to tell stories such as this. We need more positivity in film and this doc delivers massively."}, {"id": 34, "text": "Just simply amazing and finding it rather romantic... Everything about it is very beautiful and something that I thought impossible to have such bond in the water life, especially with an octopus..."}, {"id": 35, "text": "At first I went away thinking it was a good documentary, looking at the life of such an interesting creature. However, something did not feel right about it. The octopus was interfered with and paid a painful price for this man to get some good footage. Next time just bring some bait to attract the sharks so you don't have to wait so long to get that good ending you wanted"}, {"id": 36, "text": "I love nature documentaries and this was no exception. It was a beautifully shot and informative documentary. I found Foster to be pretty self indulgent and trying to draw a metaphor for everything in his own life against the natural world of the octopus. It really was a one sided friendship where the octopus took a chance and let this man into her world. Foster was a little dramatic and truly seems to only care about the octopus in regards to his own life's purpose. I found myself screaming at the screen when he would not help his little friend in very dire circumstances. We rescue animals in nature all the time. I don't see why he thought his little friend should not be afforded any benefits from having a giant human advocate. Even the octopus' end -left to be ravaged by the nature surrounding it was too much for me. I know it's the 'circle of life' but under the pretense of him supposedly having formed a special loving bond with her- it really bothered me. He interfered with her natural habitat to make his video but would not interfere to save her. He is a rich self absorbed bore.Him aside- I've always been fascinated by the magic of octopuses. She does not disappoint with her quick mind, magic skills, and sweet curiosity. Hopefully this documentary will raise sensitivity and awareness towards these beautiful intelligent creatures and why they should be protected much in the same way we do with dolphins. The only reason I give this 5 stars instead of the 1 star (Foster deserves for his narcissism) is for raising awareness for octopuses."}, {"id": 37, "text": "As another reviewer rightly said, Craig is a brilliant film maker and a lousy friend.This is an incredibly moving story of a beautiful, highly intelligent creature who let a human into her world, only to have him watch her die a gruesomely slow death while he pontificates on his own struggles. To those (and Craig!) saying that this is nature and that he didn't want to interfere, the time to draw that line was before developing such a close relationship that she would leave her place of safety to go and cuddle up to him, certainly before she altered her natural behaviour and started using him as an assistant in her hunting and seeing him as a source of safety. At that point, his protestations of not wanting to interfere to preserve natural balance! are nothing more than a pathetic excuse for wanting a good shot of that heartbreaking final scene. The least he could have done after irrevocably altering her entire existence was give her a peaceful death.This is a brilliant film, made at the price of a wonderful creature's trust."}, {"id": 38, "text": "It was an amazing experience. I was impressed and cried at the same time"}, {"id": 39, "text": "Very deep and meaningful content here. Hard to shake this one off. I feel like I had an minor existential crisis after watching, if such things can be minor.Before watching, the title spoke to me and I'm thankful it did. The finest documentary I've seen in ages. I was opened minded and immediately fully engaged with the story until the end. It takes its hold!To be immersed, engaged and aware of your interactions with all things is a spell binding tale we can take tremendous cues from. What a gift to be reminded of our world's incredible complexity, and that we are only but a part.A brilliant film. Thank you."}, {"id": 40, "text": "The footage of the octopus is stunning and beautiful. Unfortunately, this man used the gorgeous creature to make himself the center of the story. Watch it on mute with some good music on."}, {"id": 41, "text": "Absolutely Brilliant. Exquisite footage, beautifully simple, fantastic edit, highly educational, amazing soundtrack and all brought through the lens of a true connection between a human and a very misunderstood creature of the sea. Highly recommend."}, {"id": 42, "text": "First of all, it took a while to comprehend the documentary was filmed in South Africa as it had a white South African male in it, and I thought they're all in Europe or Australia to mentally check-out of the nations problems they created.That aside, I simply can't believe the lengths the octopus went to to inform all of us of the man's character deficiencies.Not only did she gift him a veil of purpose through her trust and kinship so he could delude himself into validating his long periods of family desertion; I was utterly impressed by the commitment of this cephalopod to endure the friendship after he willingly watched her be mauled by a predator shark so that all could observe his lack of emotional availability and understanding of reciprocity in friendship - the same qualities she had in abundance.Later, as she lay dying of natural causes, I couldn't help but think a large portion of her last salient thoughts would be devoted to a re-assessment of their friendship as he sat there filming her still alive body being picked upon by scavengers and doing nothing about it.As her corpse was unceremoniously taken by a shark, I was struck by the misfortune a more fitting end didn't transpire - one where he was a pallbearer at her funeral so he could let her down one last time.I, for one, salute this cephalopod's sacrifice. Vale, my eight legged friend.Nice colour rendering though."}, {"id": 43, "text": "... There's this guy who laments not spending enough time with his son. So he decides (instead) to dive in the ocean everyday to spy on an octopus and make it his pet dog. Fascinating photography, sure. But who's taking all those shots of him, when he's ostensibly alone?I dunno. This felt cringeworthy in some places and I never cried. Except for the 90 minutes I spent wondering how many people have flocked to that very kelp forest only to destroy its entire ecosystem."}, {"id": 44, "text": "The only good thing about this Movie (Not a Documentary) is the beautiful images. Everything else is just made up by a guy who is in his mid life crises and in love with an Octopus. Everything Craig said about his relationship is made up... Would have been a really nice Documentary if we would have seen more from the Octopus and the way they live as they are really interesting, but could not lissen to another woord of what Craig had to tell us.. Very disappointing.. I would recommend to see it with the volume down and having some classic music in the background"}, {"id": 45, "text": "Star Treks prime directive comes to mind 'Dont interfere with anything... unless it makes for a good story'.Cry me a crocodile tear river! My Octopus Teacher really bugged me. I thought the filmmakers motivations were totally insincere and selfish. He goes into the octos territory, constantly. Stalks it after he forces it to move habitat, then plays with it, completely interfering with it and the organisms around it that it relies on to survive... but then says 'I can't interfere' when a shark attacks it or whatever. Seems like he was just doing whatever possible make a dramatic story at any cost. Not only that but he projects all of of his own issues on the octo, spend all his time anthropomorphizing it when he know little about them, and begins the film by talking about how his son needs his father then escapes into the ocean everyday!Netflix seems to be changing the definition of what a 'documentary' is and a lot of what they produce is exploitative, tabloidesque and (in the case of rubbish like Gwyneth Paltrows awful Goop series) dangerous.It looked nice tho, 3 stars for that. I would have been satisfied just watching the kelp forest washing about. Thankfully there are still filmmakers like David Attenborough out there."}, {"id": 46, "text": "Beautiful visuals make this worth watching, but the creepy guy's narration and back story are just painful. 85 minutes of self-indulgent rambling and nonsense made me want to hang myself! I could have learned as much by watching on silent and playing the radio in the background."}, {"id": 47, "text": "It was beautifully filmed but angering. You altered her world by being there. The way she hunted, showed herself, made her more vulnerable. Yet you sat by when she was hurt because of you, not helping. How can you say you were touched by a relationship of trust when you failed her everytime she needed you. You took advantage of her trust and didn't return it. You failed her."}, {"id": 48, "text": "I won't inflict the storyline on everyone all over again as it has now been covered many times but I felt a sense of betrayal at the end. During their friendship there were moments of great tenderness which bridged an abyss between two worlds that couldn't have been more different. Maybe the first time this has ever happened in the history of this earth. The beautiful moments when she reached out to him and felt secure on his arm or chest and then at the end when she needed him the most he watches her begin a night of being eaten alive by every nibbler in the sea! What kind of crap is that. Are we Capt Kirk now and the Starfleet Directive to never interfere? He goes back to his cozy beach house and feels sorry for himself. This film left me angry."}, {"id": 49, "text": "Beautifully filmed, interesting storyline, but I would never want Craig Foster for a friend. He is just a heartless documenter of events around him and he thinks in profits and kudos. I don't think he is capable of true friendship. Although he did display a hopeful moment of possible redemption when he tried feeding his ailing friend. Unless that was just playing to the camera too... Craig, FYI once you have penetrated that ecosystem, you are part of it. You ARE interfering just by being present. Just like the sharks were interfering by being present. But, my guess is you knew that already, because your excuse for not helping out your friend sounded silly and hollow, even to your own ears. You had a choice to make and you chose your craft over your friend. Enjoy the fruits of your decision. I see your admirers are many."}, {"id": 50, "text": "Good film and location as well as interesting story. Don't understand however how anyone filming a creature that they have befriended in a way is able to carry on filming while this creature is being attacked and not try to help. 'You don't want to interfere with nature'? Really? You are already interfering with nature by filming it, befriending it and luring it out of the safety. The least you can do is try to help when it's being attacked. But I guess this way you wouldn't get your footage and make profit eh? And just how self centred can you get comparing the physical and painful attack on this poor animal to your mental state?! Humans... never cease to disappoint.."}, {"id": 51, "text": "I liked it, but seriously dude you just let her get slowly get eaten, picked at by scavenger fish and sea stars for an entire day. How could you sleep if you really cared about it? Slowly being eaten, her flesh being torn off her throughout the night while you sleep comfortably in your bed? Until you came out the next day and a shark Finally came and ate her.. Seriously? You said you supposedly Loved that Octopus nut you let it suffer for so long. It's not stupid, if it used you to unknowingly help it catch lobster, it knew you could have helped it when all the animals were tearing at it.Also couldn't help but feel your family, especially your son needs you to be home more often and be present and there for him. Not you trying to fill some void in your life. ."}, {"id": 52, "text": "This might be the most incredible documentary ever done."}, {"id": 53, "text": "A man, his camera and a magical underwater oasis full of life, playfulness but also heartbreak. This is the best nature documentary I've seen since Planet Earth 2, but it's actually more than just a documentary, watch it and you'll understand."}, {"id": 54, "text": "Tender story of an amazing sea creature and his loving friend."}, {"id": 55, "text": "I don't understand why people are praising this dude. Craig is a privileged, self-centered, nauseating narrator, who gains the trust of an innocent creature, only to betray its trust in the end for a couple good shots. Pat yourself on the back, Craig. Octopus lives matter too."}, {"id": 56, "text": "Amazing story and beautiful filming. Should win many awards. I find both Craig Foster and the octopus equally fascinating!"}, {"id": 57, "text": "If you watch this documentary and haven't taking anything away from it, you are at a sad loss. We have all been touched by images of cute, sweet &amp; cuddly creatures, this is on a another level. It's speaks to your consciousness, your heart and your forces you to address what it means to be part of this planet. Must be the most thought provoking nature documentary out there at the moment, and I'm a hardcore Attenborough fan. I won't be eating calamari anytime soon, that's for sure! Please watch this documentary.Respect our earth and all that share it."}, {"id": 58, "text": "This is not a nature documentary. It's the personal project of a man who, following a midlife crisis, decides he can't work anymore and chooses to spend his time free diving instead. After a while, he realizes that it might be possible to monetize his activities by filming the local fauna and does just that. Because he's not a biologist, he adds some sappy, manipulative storytelling rather than informative narration to better sell the footage.To be honest, whether it is an act or not, I find the overly sensitive, self-centered and undependable nature of this man to be quite off putting, and his privileged life doesn't make for compelling storytelling. Octopuses, on the other hand, are naturally interesting creatures and there's plenty of close up footage of them going about their business, so in that sense it sort of balances out."}, {"id": 59, "text": "There's no denying this doc contains some of the most interesting and beautiful footage of kelp forests and octopus(es) ever captured. But it's simply the vanity project of an obnoxious man experiencing an existential crisis while possessing vast means. Viewers aren't granted even a minute reprieve from Craig Foster's overly polished prose delivered with an extremely exaggerated soft tone and full of forced reflections. Only 3 scenes show actual physical contact between him and the same octopus. If more instances of physical contact occurred, viewers surely would have been treated to that footage. There is no guarantee other scenes of an octopus generally going about its octopus life (playing, hunting, evading predators and eventually becoming prey at the end of its own life) contain the same animal. When nature documentaries focus on the narrative of a single animal, filmmakers generally manipulate viewers by editing footage of different animals of the same species together. I'm sure at least some of this trickery exists in My Octopus Teacher. It tramples the entire premise of the film while also casting doubt on its sincerity. Mostly, it makes Foster's non-stop narration all the more pompous, pretentious and self-aggrandizing."}, {"id": 60, "text": "Craig Foster, you may be a great filmmaker but you are a lousy friend. And whoever sees this will understand perfectly what I mean. Signed, the Octopus."}, {"id": 61, "text": "Very uninformative of the wildlife of the area. I personally didn't learn a thing on octopuses. The whole tone of the movie (because it's a movie and not in any way a documentary) is honestly very cringy and self-centred. The whole thing could have been condensed in the only relevant moment of interaction between the octopus and other animals. Amazing images though, I just wish the team had decided to bring someone with real knowledge of the biodiversity and the species of the area so we could leave that creepy stalky documentary a bit more informed on that seemingly unreal habitat."}, {"id": 62, "text": "Far from a big budget, globe-spanning wildlife documentary, My Octopus Teacher is incredibly impressive is a very different way. One man's personal journey is reflected in the life of an octopus that he discovers then observes and films every day for a year. It's fascinating to watch the bond between this unlikely pair grow and evolve. The candid and philosophical narration explores this relationship and relates this small, personal story to the larger cycle of nature and the wonder of the wild places of this earth."}, {"id": 63, "text": "As a freediver myself, often playing with octopuses, I really enjoyed this movie. Also, as a freediver, I must add that swimming with your snorkel in your mouth and taking very few safety measures (buddy system, breathe up between dives etc) are not good ways to introduce the masses to safe ways of diving under water on one breath. If I forego that mayor flaw, remains a beautiful and touching movie that highlights the unique nature of octopuses. Truly the dogs or social cats/parrots of the sea. Hopefully people will refrain from killing or eating them (as did I!) from now on. And hopefully people will also research further into Freediving basics than he did.. !"}, {"id": 64, "text": "A human befriends an octopus. The human turns out to be the monster."}, {"id": 65, "text": "If you forget about high quality shooting and apparently an expensive production, this story can be summed up: a depressed excitement seeking human stalks the octopus for another shot of adrenaline and a good story. He watched his friend beeing attacked by sharks and did nothing. He tried to cry a few times (his eyes were red, so I guess they put something in his eyes to make it look like crying). He befriended an octopus and then watch it being mauled by sharks with an excuse 'I can't interfer'. But he forgets that he already touched the being, established an emitional connection and bond. And after that he breaks the shell to try to feed her (?). So, he did interfer after the attack, which shows how slimely and inconsistant this creature is.Despite everything, the octo forgives this slimely being and teaches us that octopus has a bigger heart than some humans. Big love for octopus, there are higher being on this planet, and they are not (some) humans."}, {"id": 66, "text": "I really liked watching this and seeing the octopus go about its routines along with beautiful shots of jellies and other aquatic pedestrians. I have to admit that I dont like the guy who filmed this. IMO he tries to make everything about himself. Like him and the Octopus are besties then when it gets attacked he does nothing then goes home and is like thats my life i feel like im the one attacked and im missing a limb now and just some real creepo stuff. You know those people that everything has to be about them no matter whats happened to you they have to one up it? Watch it and tell me im wrong!! I made it through the entire thing but I got really nauseous watching this guy. His whole personality and the way he comes off just turned my stomach. Hes a real wierdo"}, {"id": 67, "text": "Great footage. Horrible storytelling. The protagonist stays purposely ambiguous about his past and somehow draws lessons that simply don't connect. At no point do you truly believe the friendship to be more than mere curisosity from the animal. It feels like watching someone's troubling hobby to get out of depression. Cringy experience."}, {"id": 68, "text": "So the diver/story teller builds this wonderful and deep relationship with an octopus, only to watch her being dismembered by a shark (not the variety you are imagining) that he could have easily fend off. Tragic and disturbing.To the filmmaker (WARNING! Harsh words) You are not a journalist covering a war conflict and reporting from the sidelines, you are a human being who built this wonderful relationship with a beautiful creature that followed you around, relaxed herself on your torso (and your heart if you noticed) and clamped on to your arm all the way to the surface, who stared at you with love and trust, who shared her beautiful home with you, and you watched her lose her arm to a shark, and being chewed. How is that possible? And how could you overlay this footage with emotional music when you just stood there motionless and emotionless filming her being dismembered?The fact that her arm fully regrew is a testament to HER resilience, despite YOUR ignorance and indifference to that tragic event.If it takes a tragic event for you to learn compassion (I'm assuming this is how you came up with the title My Octopus Teacher), then please stick to your family and leave the compassionate world be, until you learn compassion, and you can learn compassion by watching films about people care for animals. I have never had an animal or pet in my home, but I know to be compassionate towards them.Please stay out of the water, you don't belong in the ocean covering these wonderful animals. Just let them be. The world doesn't need to teach compassion by sacrificing.FYI octupuses/octopi are highly intelligent and smarter than dogs."}, {"id": 69, "text": "On the one hand it's a very interesting intimate look into the life of this one specific octopus and it's environment which makes you appreciate them so much more. Most of this you already know though if you've watched enough NatGeo.On the other it's told by this absolute clown of guy. He's talking about the best feeling in the world was engaging with the creature at one point. Meanwhile his wife and son are probably watching this thinking what about when your kid was born or when you were married or a million other things. They're also probably thinking you need to get over your mental breakdown and care about us as much as you do it or you're going to be divorced soon paying dearly.Then you have his delusional take on nature and needing to be removed from it. Hello, anyone home in there? You are an animal, you are already a part of nature, we are not removed from it existing outside of spacetime. You interacting with it is no different from the numerous species that are constantly interacting with each around the world since the beginning of life on the planet. He took only what he wanted with his interactions from the creature and cowered from those that were difficult. On several occasions he let it suffer when it was completely unnecessary to do so. He talked like he cared and mustered up some fake tears but talk is cheap. If I saw this guy on the street getting roughed up by a gang I would just keep walking. Sorry my man, I can't interfer that's just nature. Absolute clown!All in all it is worth watching for the nature segments, but you can honestly fast forward through his monologuing and self important babble when there is no nature on the screen."}, {"id": 70, "text": "The only thing the Octopus learned is that she shouldn't trust any human. The guy in the movie suggest that he have built an emotional relationship with an octopus but never tried to save her from sharks hunting her. So YES to the statement you made at the beginning of the movie: you are a terrible father and human if don't even try to protect your family. I hope you get eaten by sharks while your son is watching you but don't help you because, as you said, that's how nature is and one should not interfere !"}, {"id": 71, "text": "Highly contrived and at time excruciatingly boring. Made for the simple minded who will believe anything. Great underwater photography dressed up as a stupid story . Watch without sound."}, {"id": 72, "text": "Captivating, mesmerizing, heartfelt, with stunning photography! This movie has become a part of my heart forever. I was moved in ways I wouldn't have anticipated. A must watch!"}, {"id": 73, "text": "So incredibly beautiful. My heart is forever changed by her."}, {"id": 74, "text": "With such an odd title, I almost didn't click on it....the title is where my complaints end. It's simply amazing and totally worth the 90min investment. The footage is great, the music reminds me of some of the more tender arrangements from Arrival and Interstellar, and the story is an emotional rollercoaster that pulls you in from the start.I don't cry much, but this movie made it happen.Just watch it!"}, {"id": 75, "text": "An absolutely beautiful story that entwines our known world with the little understood lives of these amazing creatures."}, {"id": 76, "text": "Mr. Foster was perfectly happy to disturb the natural world when he befriended this animal. He encouraged the animal to trust him. He admits that he may have encouraged the animal to come out of its den. He touches it and is touched by it. He cradles it on his chest.So, why then, when his friend needed his help, did he fail to give it? Not once, but twice. He failed to save it from the shark and he failed to save it from being eaten by fish while still alive. Oh, you say, this is nature. It isn't nature for a human to befriend an animal for his own delight and then abandon it when it needs him. Friendship is not a spectator sport.Mr. Foster, shame on you."}, {"id": 77, "text": "Wonderful documentary that is both educational and inspiring. Using a mask allowed the filmmaker to better see the world around him and its beauty. Highly recommended!"}, {"id": 78, "text": "I Think everyone should watch this documentary. It isn't just visually stunning but, heartwarming and SO interesting watching the relationship between these two species. I have to admit, that guy not only showed some serious dedication, but also some serious B@lls to be in that water every day, all to visit his new friend. please watch, it is so nice."}, {"id": 79, "text": "Thank you. In sum, that's the message at the heart of this film and the heart of narrator/protagonist Craig Foster as he exults in the drama of his remarkable relationship with the aforementioned teacher, just off the coast of South Africa for a year. Equal parts feature film and documentary, it follows Foster's personal story, unfurling from hardened workaholic to open, perpetually curious man-child, much as his octopus friend, hyper-reticent by nature, opens herself to embrace him, literally. You've never seen anything quite like this. Thank you is the message at the heart of the film and Thank you is all I can say to Foster and friends for this jewel."}, {"id": 80, "text": "Incredibly beautiful, a movie, a poetry, a musical trip, a fairytale, all blended and flowing together, cried throughout the entire movie, so thankful for this experience, wow, just wow..."}, {"id": 81, "text": "Unreal, educational, moving... Made me inspired to be a better person. Wow!!"}, {"id": 82, "text": "This documentary lingered in me long time after I finished watching it. This is a beautiful piece of work. The story is so magical. Loved the way the story unfolded, taking us Into the this ncredible life story of an octopus and using that to reflect on life and existence. Lovely piece of work."}, {"id": 83, "text": "It is best film what I ever saw. I feel conection with nature and souls, I have some kind emotion inside of me. Thank you so much, I loved this octopus and I love too, forever 🙏"}, {"id": 84, "text": "A beautiful film confirming the intelligence of Octopuses as well as a magical examination of the Cape kelp forest ecosystem. The film wasn't profound but the human, mollusc relationship was an example of a magical moment that reveals a deeper meaning about our world and our existence within it."}, {"id": 85, "text": "The octopus is an amazing and intelligent creature. I did not realise that they had such short lives.This beautiful creature had the misfortune of encountering a creepy human.It appears that he spent his time making a video of the supposed friendship and trust the octopus had and of the uncaring demise he allowed it to have.Then, back in the studio, he added a self-serving story to pretend he was some kind of hero.Lovely shots. Beautiful sea life. Amazing octopus."}, {"id": 86, "text": "A man experiencing a mid life crisis depression develops an obsession with an octopus (while ignoring his own family). He has an extraordinary ability to tolerate cold water, hold his breath and swim around for extended periods, and then repeat it for over 300 days. The photography is extraordinary and there is much to learn about this amazing creature, the octopus, that is."}, {"id": 87, "text": "This story is not like most documentaries. It's a beautiful, touching, yet gripping observation of the ocean and its inhabitants. And I am picky. I have a very narrow window of enjoyable entertainment. I won't waste my time on gore, violence, war, profanity, stupidity, sex and sexism. So, I don't have many choices! But this one hit all the right buttons. It is beautifully filmed and unbelievably emotional for a fish flick! Do yourself a favor. Just watch it."}, {"id": 88, "text": "Beautiful, just beautiful. I needed something to remind me of my true self, the true meaning of my existence that I had forgotten so long ago. Human beings have lost deep connection with what is important, we take all beings for granted. This incredible octopus/human relationship is a wake up call to go back to our essence and reconnect with love in its purest form."}, {"id": 89, "text": "I have been interested in octopuses for quite a while. This is a beautiful study."}, {"id": 90, "text": "Who knew humans could hold their breath for that long? Who knew the bottom of the ocean was this wondrous? Who knew an octopus could befriend a human...in the wild? It is quite the adventure. Don't miss it."}, {"id": 91, "text": "An incredible film. Patience and empathy, a true masterpiece."}, {"id": 92, "text": "Trust. Love. Things the world needs more than anything else right now. This film is nothing short of amazing. There is no boundary between gods creatures."}, {"id": 93, "text": "Good lord that was an emotional journey. I'm not the person to get all mispy over a movie, but this hit me very hard. What a wonderful and harrowing relationship with wildlife. Very inspiring."}, {"id": 94, "text": "By Sy Montgomery is an excellent read for anyone who enjoyed this documentary!"}, {"id": 95, "text": "I could talk at length about the absolutely beautiful cinematography. This documentary is without a doubt visually stunning, however it's both Craigs growth, learning and understanding along with the wisdom of a new found world, and the emotions that new world evokes in the viewer, that makes this a 10/10.Some are less in favour of the personal, narrative types of nature/environmental documentaries, arguing against their lack of 'science' and overreach into sentimentality. But this is different. As we learn, the world of the Octopus, and that of the oceans, are so unknown to us. So much of what Craig discovered and provided a glimpse into was completely new. To connect, on an individual, sentient level is perhaps what we as humans have been missing out on.Fantastic work."}, {"id": 96, "text": "This seemingly rinky dink little show that you think is bound to be immediately forgotten in the vast video library of Netflix somehow turns out to be one of the most moving films of the year. A common octopus represents mother nature's otherworldly genius of evolution.It's incredibly sophisticated, right down to the filmmakers unwillingness to engage in anthropomorphology by declining to fix the subject with a silly name. The human doesn't interfere much with nature, even when it's in danger. The final scenes are downright haunting and it's incredibly educational about earth's amazing oceans.What better review is there than I'll never forget the film. Wow! Really? For a common octopus? Yup. All day long and then some. The filmmaker is obviously brilliant, but I understand now probably less so than than the octopus that gives the film its name."}, {"id": 97, "text": "Amazing scenes and such an amazing filmmaking. I wasn't expecting that at all. Must watch ! 10/10"}, {"id": 98, "text": "One of the most beautiful and meaningful films I have watched in a very long time. Such an important and timely message."}, {"id": 99, "text": "I was looking forward to seeing this, only to realize that everything DIES... Even the guys married life! All I heard during this movie was HIS VERSION... I thought, or I wanted to... in the preview it mentions his son, what a laugh!!!! He should have rewarded this beautiful creature who trusted him with security. Months of gaining trust from an amazing creature to repay it with no protection, it is WITHOUT DOUBT HIS FAULT!!!!"}, {"id": 100, "text": "The cinematography was amazing. The story was great. But some of the dialog was a bit forced and even bordered on creepy. My bet is that there were many different octopuses filmed and then for dramatic effect a story was made up about just one."}, {"id": 101, "text": "Earning trust, making friends with the octopus and then watching her get eaten. I didn't realize I was watching a rat in snorkeling gear until that moment."}, {"id": 102, "text": "This started out phenomenal in every way. Beautiful shots and the story unfolded so naturally. He kept calling the octopus his friend and said he felt a strong connection and wanted to see her every day. When sharks started hunting her in front of his very eyes he just let it happen to get a Juicy shot. Better to have no friends than a friend like that. He zoomed in and got all the gory details but did not dare intervene in nature. Ummm well if you did not want to intervene you would not have been having that octopus shake hands with you and going out of your way to form a connection. He just wanted to film the exciting shark attack. Honestly don't know how a person could spend months and months trying to make an animal trust them then stand back and watch that with the film rolling. Yuck"}, {"id": 103, "text": "Well photographed but sappy doco. Annoying central character."}, {"id": 104, "text": "It is a very long time indeed since I've seen a natural history documentary that enhanced understand in the way Craig Foster has evolved our understanding of this habitat and the Octopus in particular. As humans our ego leads us to believe we know so much but this proves that we know so little and worse than that devote so little time to the things that matter."}, {"id": 105, "text": "A beautiful movie. Craig's honesty and vulnerability with the audience is stunning and makes this a must watch."}, {"id": 106, "text": "What do we truly know of the debt in which the world's creatures are capable of. We know very little unless we have that special bond, trust and time. Many documentaries have given us so much information about multiple species that live among us but this blew me away. This isn't just another documentary with facts you could google from your phone. This is the unknown. Fascinating!"}, {"id": 107, "text": "This is a special film, and I am sure it will stay with me for a long time. More importantly, 'My Octopus Teacher' made me feel so intense for a living creature I never imagined in my entire life. That's the magic of storytelling, entertaining us, giving us a different perspective wrapped with a novel treatment we could have ever dreamt of.It is very obvious that the film is about an octopus from the name and the poster, me having absolute zero inclination towards sea life, nor the octopus, I had a tough choice to make on this film, thought for a while and with the least expectation, I chose to watch it.The film left with awe how could the makers conceived the narrative that would create an impact of such magnitude. The narrative solely dives on the shoulder of a female octopus and her relationship with a human being, Craig Foster. I'm sold to the plot, the moment the octopus reciprocates her trust to Craig, a beautifully emotional moment. The film unfolds the supreme level of intelligence and the social skills the octopus posses, it was an eye-opener for me. The film delves into the complete lifecycle that an octopus faces in the sea forest - Survival, Socializing, Deceiving, Playing, Mating, Hatching Eggs, and eventually death.The film is shot brilliantly, it's like - the shots wherein Craig dives into the sea to the piece of rock where this octopus used to stay hiding gets so emotional, that I just prayed for the octopus to return after she has been preyed by the deadly shark, that's the power of imagery, haunting yet emotional. The action sequences between the shark &amp; octopus, the octopus playing with fishes, she strategically preying on a crab, and many more sequences bring out the right dramatics, keeping us hooked whenever I get to a point, what's next?The hardest part is when we get to the climax, and the enlightening part of this film to realize that every living being in this nature shares the same feeling, to be loved, and to reciprocate love to others. The parting of the octopus after hatching eggs gets so painful unexpectedly, I wished this to continue forever. At this point, Craig does not interfere to save the octopus, and that's the beauty of this film to let nature deal with it.My Octopus Teacher - Highly Recommended! Everyone should watch to experience the beautiful feeling of being part of this nature."}, {"id": 108, "text": "The natural world never ceases to amaze. The relationship this fascinating creature has with a human is astonishing and magical to watch. The cinematography is breathtaking. A must see."}, {"id": 109, "text": "I can watch this documentary over and over again. It is a well done documentary! The story is simple, a struggling filmmaker takes a break in his career for self-reflection and finding a love for filmmaking again after grinding for decades. He decides to swim in the freezing ocean every day and stumbles upon a charismatic octopus and decides to visit her every day to see what happens. Watch the film to see what happens!"}, {"id": 110, "text": "Who said that humans are superior to other beings? The Lady Octopus of the film taught me some of the most important things of life through her life-lesson of only one year. Friendship, wisdom, pain, perseverance, solitude, reproduction, and then death. I watched the film a week ago, but her image and lessons are still lingering in my mind. The film's cinematography and music are also excellent. A truly spellbinding film."}, {"id": 111, "text": "As another reviewer wrote completely engrossing. At times I was on the edge of my seat....run! Beautiful cinematography. By the end I cared deeply about the little octopus without any anthropomorphization. A well spent 90 minutes."}, {"id": 112, "text": "This is an amazing documentary! It's a love story of a friendship between two completely differently species who find each other in the ocean. I'm fascinated by octopuses, and believe they are far more intelligent than we can comprehend; probably more intelligent than humans."}, {"id": 113, "text": "Kind of cephalopoderotic. He talks intimately about the way the octopi's tentacles have incredibly fine motor control, and can reach in the tightest of crevices. There's also a palpable moment of anguish and jealousy as he describes getting cucked by the Chad octopus.A bit over emotionally cued, and anecdotal to be taken as a serious or informative documentary."}, {"id": 114, "text": "Wow, so amazing, thank you to all involved in this stunning movie. so emotional, had me screaming no no no at one point, tears at another. what a wonderful experience to go live with and fall in love with an octopus. unbelievable but true, this movie deserves all the 10s that i note it has recieved."}, {"id": 115, "text": "A visual and emotional journey that leaves you moved by the connection between man and a beautiful and intelligent creature. In our fragile and beautiful world to have viewed this friendship that developed between Craig and his marine friend provides a perspective on how much we take for granted our natural world, which without, we as humans, would be lost. Simply outstanding in all respects."}, {"id": 116, "text": "This is a movie about a guy who becomes obsessed with an octopus while free diving near his coastal home. The point of the film is to demonstrate that octopus are intelligent creatures with feelings and thoughts and emotions. To that end, the film shows numerous instances where our lead, Craig Foster, engages with this octopus. In some instances, the octopus even swims to him and he cuddles it to his chest. Whether this is just instinctual behavior or actual attachment is probably up to each viewer to decide. But what is not subjective in any way is that Foster is a swimming, snorkling piece of feces. Despite expressing his deep emotional attachment to this octopus throughout the film, in the closing moments we see that the octopus is so famished from taking care of its young, that it is essentially helpless. Without food, it is basically left for dead. So, what does Foster do? He leaves it laying on the ocean floor while it gets slowly eaten alive by other fish. And I mean slowly. He films the carnage over a two day period before a shark finally takes the entire body. He claims he does this not to interfere with the circle of life, but he already did that by feeding the very same octopus when it was injured earlier in the film. The reality is that Foster had an opportunity to hold this friend of his and comfort it during its last moments on Earth. Instead, Foster simply swims overhead and films the ordeal so that he can have a tragic ending to this film. The irony is that the movie is supposed to be about appreciating nature and yet Foster exploits nature throughout. When he had a chance to truly give something back he became more spineless than the octopus he claims to have cared for.1/10 because bad people shouldn't be rewarded with good ratings."}, {"id": 117, "text": "Brilliant thought provoking warm sentimental and even courageous for a man to open his heart up to the world to show such a gorgeous and intimate relationship that taught him - and thank God and therefore the rest of us that some of the greatest lessons don't come from a book but from the natural world around us. Nothing and no being is by accident. I cried. I am so touched by the beautiful music, the photography, the story, the relationship and with the deep connection this man shared. Oscar worthy."}, {"id": 118, "text": "Full emotional spectrum. I cried, I laughed, I was amazed, I was happy and much more.. This is a beautiful story. I feel alive. Hands down."}, {"id": 119, "text": "If you like animais this is a must see. This documentary/movie is simply beautiful! I can't help to envy the connection that Craig has with that environment and with the octopus in particular. This is the definition of a pure connection."}, {"id": 120, "text": "The most touching, loving, intresting documentary i have ever seen. Thank you"}, {"id": 121, "text": "One simply has to see this. It is incredible from so many angles. Yes, it is a well shot nature documentary, but that is not the point. The point is that an Octopus can form a bond with a human, and has the empathy, intelligence and, can I say, love, to do it.Three days later I am thinking about this film as one of the most significant breakthroughs in our connection to nature that I have ever see."}, {"id": 122, "text": "What an amazing movie ! My husband an I cied like a baby. Such a beautifull story and what an extraordanary creature. I recommand you watch this movie !"}, {"id": 123, "text": "By just the title alone, you would think what a cheesy title, but by the end of the movie you completely understand that there is no other title that would be MORE appropriate for this movie. This movie gently draws you in with your subtle curiosity, then BAM, before you know it, you're HOOKED!! Exquisite narrating to accompany the intoxicating cinematography! A mans journey with the oceans most complex creature in its most raw form. Thank you for making this beautiful work of art! You can't help but be envious of the relationship he's made with this creature, not to want your very own 🐙 experience too! This is the BEST documentary I've seen in ages. *^*^*^*^*^*^*^*^ FYI... In response to all those people who are negative towards his reasoning: First of all, this was a documentary about the life of the octopus not how to interfere w/ nature, he conducted himself &amp; respected the creature to the T as an observer from afar. Secondly, NOBODY is qualified to comment on his relationship w/ his family or what he shares w/ them. What part of this movie needs microanalysis by unqualified people who just like to be mean, get over yourselves! I have no idea who this guy is, or what he's had to go through, but whatever it is, has led him to create and share a masterpiece.... Looks like it brought him closer w/ his son, I might add!!! ^*^*^*^*^*^*^*A sequel following the babies would be super cool... I'm just saying"}, {"id": 124, "text": "One of the best things, I have ever seen in my life.It made me smile, it made me cry, it made me think and it made me feel a part of the wild"}, {"id": 125, "text": "When I initially read what this was about I really didn't have high expectations however that changed after watching the first ten minutes and I loved this film. The cinematography, the way it is edited and generally just the tension and emotion in it makes it fantastic viewing and of course the life of the octopus is absolutely fascinating. Trust me if you enjoy nature programmes such as blue planet etc you will love this. Top marks to the filmmaker for the way this is shot and I expect it will get many more awards in time. It certainly should in my opinion."}, {"id": 126, "text": "Beautiful, emotive, truly captivating and one of the most incredible film documentaries I've ever seen. That clever, little octopus is mesmerising! Craig Foster's portrayal of his friendship with her is so moving, I defy anyone not to be completely in awe by the end. The way it's been shot and the musical score are also breathtaking. It'll stay with you for days afterwards."}, {"id": 127, "text": "The photography was really amazing; however, the story was somewhat annoying. I felt it was overly sappy and forced. I don't believe the guy really learned so much about life from an octopus. Watch for the underwater photography and just ignore the narration."}, {"id": 128, "text": "Beautiful cinematography and very interesting story, but IMHO the commentary suffers tremendously from the overwhelming use of incredible adjectives."}, {"id": 129, "text": "Not only is this is this a unique documentary but it also captures the environment of the ocean excellently with some pretty great cinematography. It follows the interesting relationship between this man and octopus in an even more intriguing way that held my attention throughout. I felt that the score was quite standard but used well. The narration was also well used and the pacing is quite good.I did feel like the last chase scene dragged on for a bit long near the end but that didn't affect my overall viewing too harshly. Anyway, this was a great and unique documentary that can be enjoyed by most."}, {"id": 130, "text": "Why anyone would not give this documentary ten stars is beyond me. Absolutely amazing!"}, {"id": 131, "text": "Seeing all the positive reviews compelled me to write a review too, as I thought the high marks are highly unrepresentative of the documentary. Essentially its 90 minutes of subjective narrative where very little new is learned and not much happens. Those who know even the smallest of bits of information about the wondrous phenomenon of the octopus will walk away with no new information, only that a depressed filmmaker apparently finds illumination through a relationship with an octopus. The idea is somewhat novel and romantic for sure, but, like the filmmaker himself when diving in the reef, he never really goes to any depths to convey anything interesting further than 'the octopus comes and touches my hand - she like me and i like her'. We are left with the promise of some sort of natural wisdom imprinted in this ancient and seemingly alien being, and - which needs to be said, some beautiful underwater shots, but that is about as far as we go on this journey and the 'lesson' is sadly exactly the one you imagine at the start of the documentary - choose life, nature good, embrace the world around you, be humble etc. Though through the lens of watching a personal story of a somewhat privileged white guy bummed out in a midlife crisis finding joy again by diving, relating to an octopus and through the animal finding a connection to the (natural) world, its not a bad thing in to have on in the background. Not great not terrible."}, {"id": 132, "text": "The Cinematography is stunning. Diving and following an animal every single day, man that needs a different level of dedication. What brings everything together is the story telling and the music. This documentary is a piece of art."}, {"id": 133, "text": "I like story,beauty of the sea,nature,the octopuss,the man who fell in love with her,the music and above all..the wise message"}, {"id": 134, "text": "Despite being an animal lover it never occurred to me that an octopus and human can also bond. The intelligence, curiosity and versatility of this octopus (and obviously all of them) is stunning; and the emotional bond formed between Craig Foster and this sensate creature is very touching. A rating of merely 10-stars is insufficient for this wonderful documentary."}, {"id": 135, "text": "I loved almost everything about this fascinating documentary,. I know I am being sentimental in my one disagreement about the filmmakers choice regarding the end of life scenes for his friend.I wish he would have helped his intelligent friend at the end of her life. Yes, I know that's nature, but you see him holding her and showing her affection in other parts of the film and the shark could have eaten her once she was dead, This wasn't just a wild creature that he didn't have a relationship with. Instead he stood by and let her be ripped apart. Wouldn't be so disturbing if he hadn't handled her before. These are super intelligent beings, as the documentary shows. If you read up on octopi, you will see just how intelligent these creatures are."}, {"id": 136, "text": "This is just beautiful filmmaking. Not many films bring out so many real emotions... I am honestly glad I have seen this. Thank you Craig Foster"}, {"id": 137, "text": "Absolutely superb. A must see for nature lovers and anyone with a curious and open heart. If for nothing else, then watch it for the incredible cinematography. This is a story you will recall with poignant memories. As much as anything, it is about a man's journey to heal, through mutual humility, trust, and kindness."}, {"id": 138, "text": "Most of the part is shot underwater. Every frame has something to offer. Cinematography and Sound editing are so amazing that it literally draws you in.This is so powerful that it can elevate you. You just don't watch it, you literally feel it, you empathize. A whole new world, may be seen before, yet not seen this way.Year long efforts and dedication transformed to this piece of Art. The runtime is optimal, all about continual flow of numerous emotions.A relaxing, colourful and must feel (use of word 'watch' would be sure underrating) experience!"}, {"id": 139, "text": "I don't normally watch documentaries, but this caught my interest after hearing and reading good things about it. It did manage to captivate me for its full length, which surprised me. It was fascinating to see the octopus behave and showing signs of learning and overall a pretty good intelligence. Most of the shots are good, but not all, for example there are some slow-motion parts which are clearly not shot at a framerate suitable for slowmotion. Furthermore, the story narrated througout the documentary was a bit too dramatic for my likes, it feels forced and over dramatic, especially the ending part. But then again, maybe I am just living my live with a different vision as this documentary tries to tell."}, {"id": 140, "text": "What an incredibly beautiful and touching documentary, it made me cry at least a couple of times. The author connected with a female octopus and observed her way of life and her feeding rituals for almost a year, free diving in the cold waters. It was very painful to watch how she tries to protect herself from the shark ( sharks in the ocean, of course ), how slowly she recovers after the shark attack or how she dies ( spoiler ). It's fascinating how smart she was and obviously intelligent, but most of all- how she wanted to connect with the author and wanted to play like a child. Just a beautiful documentary ! I'm going to watch everything this author has created ! He's a super sensitive and empathetic human being, we need more like him!"}, {"id": 141, "text": "Just an amazing documentary. The cinematography underwater blew me away. It was so touching to see the octopus seem to bond with the man. I bawled at the end, which I knew I would. That's the good and the bad of watching films about animals for me. I love to get a better understanding of their world but inevitably, reality sets in and we understand that living in the wild is tough. I highly recommend."}, {"id": 142, "text": "At first I was a bit skeptical about this documentary but it turned out to be one of the most meaningful experiences I've had this year, it's not just another movie about a friendship between humans and animals, it's a film that explores what it means to be alive, what it takes to survive and it tells this story in such an extraordinary way, the cinematography was excellent and it's probably one of the most beautiful films of the year, it is a documentary but it had so much more impact on me then mostly every other regular feature release.The friendship between this man and this octopus is wonderful, it really puts your live into perspective and tries to challenge you on this surrealistic experience, the imagery showcased in this film is terrifyingly beautiful, there's a sense of suspense that was delivered so well I was honestly on the edge of my seat and after all this journey I have to say I'm intrigued and interested in going for a swim with my fellow octopuses."}, {"id": 143, "text": "So touching i cried ! i got so emotional, thank you foster for this amazing documentary"}, {"id": 144, "text": "This documentary is beautifully shot.. this guy tells you this story and makes you feel like you are right there. I loved it and I think you will also. Looks amazing in 4K. And it's a little emotional to some degree... i this move doc is a 10"}, {"id": 145, "text": "I received a message on my phone saying Fabulous and as soon as I watched the documentary I have been immersed in this beautiful relationship between an human and a most intelligent animal. It brought tears in my eyes not only at the end but also by the so comprehensive Craig Foster about life."}, {"id": 146, "text": "One man's touching personal experience in an alien world where he encounters and befriends an octopus. An unforgettable film."}, {"id": 147, "text": "Wild life, nature... so much to learn about it. Don't miss this one lesson of a kind. Extremely sensitive, for those whose heart is deep."}, {"id": 148, "text": "The filmmaker takes a nearly year-long journey into the micro environment of the kelp forest in the sea immediately adjacent to his home. It's an emotional ride that explores our deep connection to the beings with whom we share our home planet."}, {"id": 149, "text": "Just see it. One of the most extraordinary and touching documentaries you will see."}, {"id": 150, "text": "I had goosebumps during most of the movie, and kept saying wow at how amazing not only the octopus is, but the entire underwater world."}, {"id": 151, "text": "This is a superb storytelling film, simple yet extremely effective in conveying the importance of nature in our lives. I was deeply moved and brought to tears. Bravo!"}, {"id": 152, "text": "Visually stunning and emotionally captivating. A must see"}, {"id": 153, "text": "This had the opportunity to be a boring naighmare - instead, it is one of the most spectacular, heart rending documentaries I have ever seen. The surprising connection between a man and octopus is riveting. You'll be in tears at the end."}, {"id": 154, "text": "Old or young this documentary will leave you amazed and touched. The lessons go far beyond the sea. I was eager for him to get back into water and very captivated with watching her life unfold on my tv screen. It is emotional and breathtaking. Hands down a must watch! 🐙🐙🐙🐙🐙"}, {"id": 155, "text": "Watch this documentary to see how important is to protect the nature!"}, {"id": 156, "text": "One of the best documentaries I've ever seen! The dedication of the filmmaker is incredible. I have a new appreciation for cephalopods, such wonderful animals."}, {"id": 157, "text": "A must watch documentary, very few made in this way taking you on a journey of what is truly important in life."}, {"id": 158, "text": "Fantastic, brilliant and poetic! Thank you for making this!"}, {"id": 159, "text": "I really enjoyed this deeply engaging film.I've been fascinated by octopuses for a long time, but it was a revelation to see one in such intimate detail - it's a biography, really, of the life of one octopus.Craig, the creator of the film, is engagingly open about his experience and brings the year to life as a sort of human / octopus symbiosis.It's so sad that they live such a shot time, they are so amazingly clever that it'd be wonderful to learn what they could be like if they lived several years."}, {"id": 160, "text": "What a beautiful story! 2020 is a year full of devastating disasters, many related to climate change, which shows how badly we have destroyed our planet. This documentary launched in this hardest time , healing our hearts and giving us hope. It reminds us again human must never forget the gentleness and respect toward nature. Every creature could be our teacher in life."}, {"id": 161, "text": "If you want to watch a film by a white South African privilege to dude who hands it off to his white South African privileged son this is the movie you can see period for me boring absolutely privileged. Disgusting"}, {"id": 162, "text": "Ok, Yeah it's a little heartwarming, and sappy. Your best experience of life was bonding with a Mollusk?? Gee dad, what about me? Great photography and visuals. This guy would do great in Liberal California...feelings."}, {"id": 163, "text": "It just feels incomplete. This is an extraordinary tale of a man and an octopus. The title alludes to lessons that he learnt during his 300-over days with the octopus before it meets its natural demise. The cinematography is unquestionable, the interactions between the man and the octopus beautiful, but where are the lessons?At the start of the documentary, Foster informs us that he needed to take a break after burning out with his work, so he returns to his childhood haunt to restore himself. He says that he has not had a decent night's sleep in two years and his relationship with his family is worsening. The only other human face we see is his son's and we perceive an improvement to the father-son relationship as the son later joins the father on his underwater excursions.Foster reveals near the end of the documentary that the takeaway lesson from the octopus is that humans belong in the water. Except we do not because humans cannot breathe underwater which he clearly demonstrated numerous times by having to surface at inopportune moments to take a breath during his filming. I was hoping for something more profound. He stated that all creatures are precious; I expected a paean to marine conservation. He noted the parallels between the octopus' life and his; I was waiting for a commentary about human existence and practicing gratitude instead of being swept away by society's pressures. He neither discloses the full nature of his personal crisis nor elaborates how his perception of life and his role in this world has changed. Otherwise it would have been 10/10."}, {"id": 164, "text": "Amazing story and cinematography. Pulls at the heart strings. Not sure what else to say?"}, {"id": 165, "text": "THIS IS AMAZING. YOU CAN'T SAY JUST A DOCUMENTARY, THIS IS EVERYTHING. YOU SHOULD DEFINITELY WATCH IT."}, {"id": 166, "text": "I just came here to check the reviews of it was something special I've just seen.This is something you must see!"}, {"id": 167, "text": "It was a very good documentary. Cinematography was often excellent. The director is clearly depressive, and was seeking to cure himself of his own depressiveness. His biggest clue was that through his experience with the octopus in the kelp forest he learned to feel that he belonged, and was not just a visitor. Evidently he was feeling quite isolated and alone in society, just a visitor, before he started this documentary. Some of his narrating is a little sappy, but overall well worth the watch. He captured some amazing footage of octopus behavior."}, {"id": 168, "text": "Slow, almost sensual, beautifully filmed. Fosters calm voice and the serene music adds up to a documentary that is a joy for the eyes and a blessing for the soul. The relationship between Foster and the octopus is as touching as the one between Joy Adamson and the lioness Elsa."}, {"id": 169, "text": "I was flicking through all the netflix options and finding nothing that I could watch before going to bed. My son insisted I watch Narcos the first season on the basis I l had enjoyed Better call Saul and Breaking Bad. I told him nothing violent before bed which really annoyed him. I came across this documentary and thought it would be a short typical David Attenborough type show. Well within 10 minutes my son had quit his gaming and he was hooked for the whole 90 minutes. If you need a shaft of light to penetrate your heart during this crazy pandemic this is it. Probably the best documentary I have ever seen. I have never given a 10 to anything before in my life on the basis that there is no room for improvement. In this case it absolutely deserves a 10"}, {"id": 170, "text": "Breathtaking and emotional. Visually spectacular and educational....."}, {"id": 171, "text": "Stunning visuals and a touching story. A true gift to see a side of the world rarely seen Recommend for the whole family."}, {"id": 172, "text": "This is one of the most beautiful films I've seen in my life. It brought me to tears, although made me feel joyful. It revealed to me the greatness and the kindness of Mother Nature. I felt embraced by the Earth with all the lessons included in the movie."}, {"id": 173, "text": "I am not a big fan of reviews as there are often spoilers. And, even without a spoilers, a positive or negative review can set expectations in my mind that affect how much I enjoy (or do not enjoy) the movie. However, when I saw today on IMDB that popularity was trending downward, I had to act. This move is so powerful and moving. It truly deserves an Oscar for Best Picture. That's right, I said Best Picture and not documentary. The reason i think it is Oscar (Best Picture) worthy is that it is so rich on many levels -- it is not just a study of what happened. I read one review that said it is the love story we all need (or have been waiting for?) or something like that. And I agree. In these most difficult times, good news and good feelings come so infrequently -- we NEED this movie. I hope that Craig Foster and the team that created this movie get lots of positive recognition for their efforts. They deserve it! So THANK YOU Craig Foster!!!"}, {"id": 174, "text": "It's a lovely story, made by an extremely talented documentarist. I loved it, even though I think it's just that - a story. I think he collected footage first, with a lot of octopi in them - maybe even the same one over and over, and then built a story around it. Otherwise, his daily 10-15 minutes would magically be the time slots in which the crucial elements of the story unfold. It's a way of telling people to look out and look after our oceans, in which he is so right. In my opinion, he uses this documentary to get the narrative across. In a lovely, touching way, telling people what they want to hear and giving them solace in trying times. I think it's remarkably done."}, {"id": 175, "text": "I saw this amazing movie and can't stop crying. Yes, I am a sentimental cow, and the movie exploited it wildly but for a good reason and with the right intentions. The premise is simple: boy meets girl - boy loses girl - boy finds girl. But for the money you're also getting a detective story, scary chases, deadly fights, interstellar vibe and amazing cameo appearances by various colorful characters. Oh, and it's a documentary. About my favorite creature. You can watch it with or without kids, for a romantic date or in a stoned crowd - it's still a winner. Just try watching it on the biggest screen possible. Definitely the movie of the year and one of the coolest movies I've ever seen."}, {"id": 176, "text": "I passed by this film/documentary a couple of times simply because of the the title - I dont know why, but I didnt really know what it was supposed to be. However, I am SO glad I eventually watched it. What a truly amazing and beautiful documentary. It gripped me from the start. It was stunningly filmed, beautifully narrated, so full of emotion - it made me smile and weep. These beautiful animals are so misunderstood and I would urge everyone, from children to grandparents to watch this masterpiece."}, {"id": 177, "text": "Amazing how invested Craig is into learning about the octopus. The footage is stunning, and the story is beautiful and inspiring."}, {"id": 178, "text": "An extraordinary and extremely moving film, a complete wonder. Never sen anything quite like it. So glad I've seen it."}, {"id": 179, "text": "With a little effort, work, trust, perseverance and love we can influence and educate and change the mindset of people to do amazing things in our and the lives of all creatures. The sad thing is these ,(good deeds) should a natural instinct."}, {"id": 180, "text": "Very toutching. Beautifill story and beautifully filmed."}, {"id": 181, "text": "Beautifully written story of a man who makes friends with an octopus in the wild. Never knew much about octopus's before and it was amazing to see it's life and how she lived and trusted this man. Not normally something I would watch but I highly enjoyed it"}, {"id": 182, "text": "I live in the town where this is filmed and until Blue Planet 2 I didnt realise we had Octopus in the kelp forests , I knew there were sharks but I digress.in the first minute you gain empathy for these beautiful extraordinary alien creatures.Visit South Africa !"}, {"id": 183, "text": "Thank you for making this. I see people writing bad reviews on here. I believe they are jealous that you can connect with a wild animal before they can even connect with another human. I'm very happy that this experience changed your life. I believe You've passed that on to many others as well."}, {"id": 184, "text": "Such a delicate piece of documentary that gently moves us with a deeply touching story on building connection with another 'strange' specie that is anti-social in nature. Instead of offering so many facts and numbers on the topic of marine animals and protection, this documentary dwells on the emotional depth of communication and natural progression between the tiniest animals and humans. It has a magnificent emotional impact on caring for the ocean lives in the water below our usual sights which we too often overlook, and sheds light on the micro-narratives and emotionality even between species normally perceived as incommunicable to one another. This documentary is heart-warming - unquestionably a piece of educational work for children to learn to inhabit each other and nature as a whole."}, {"id": 185, "text": "Beautifully filmed, this movie will bring you into life in the ocean and give you a newfound respect for it's creatures. I felt this is more than just a documentary, it explores life and has a deep sentimental message."}, {"id": 186, "text": "This film highlighted how the supposedly superior human being is so out of kilter with its habitat. A destructive force worshipping money, cars and synthetic materials and creating nothing near as beautiful as this amazing creature in harmony with her surroundings."}, {"id": 187, "text": "I'm completely and utterly in love with a common octopus who is anything but common. Must-see best (&amp; saddest) movie I've ever seen."}, {"id": 188, "text": "My Octopus Teacher was one great documentry film and if you are having a dilemma what to watch this one or Social Dilemma,i would recommend this one far more ,cause it has a great and sweet story in it that show us true beauty of life and nature and how animals are a very deep and smart creatures that deserve to live their full lifes and that we dont take that from them,Look of entire film is also very pretty and it had some very great visual scenes that were able to impress me with its beauty,My Octopus Teacher was one hell of great documentry and if you love animals you will enjoy this one"}, {"id": 189, "text": "Craig truly knows how to make one feel connected with another dimension of planet earth. It restores My faith in humanity. Thank you Craig, what an incredible documentary."}, {"id": 190, "text": "I like happy ends and i reslly would have liked the octopus to survive and who knows... leave the country, raise a family togehther with Craig... a part feom that one of the best films I have seen in the last years..."}, {"id": 191, "text": "A Non-Scientist, finds out new things about Octopus (unknown to science) while making a real friend. Amazingly genuine story telling and incredible photography. Felt really relaxed and uplifted after watching this genuine connections (literally too) between humans and nature. Well worth the 85 minutes"}, {"id": 192, "text": "Beautiful and deeply moving story of empathy between Craig Foster and his whip smart teacher."}, {"id": 193, "text": "Watched most of this movie last night. Pretty good. He kept referring to the octopus as she and I don't know how he knew the gender. I certainly didn't see him lift her tail to check. Anyway I watched most of it and he he kissed her (reminds me of a song). I became concerned that they were going to take the relationship too far. I had visions of a matrimonial ceremony in an underwater chapel and an ordained tuna pronouncing them husband and octopus."}, {"id": 194, "text": "I've been reading a lot about how smart octopuses are , about their 9 brains, their complex nervous system but then you see it on screen and it multiplies how amazing they are!! Cant say enough about how much you need to see this incredible work of natural art!! I've long believed that we underestimate the intelligence of animals this is again proof we need to quit judging , especially how smart we think we are and how smart other creatures are. I see everyday that we dont know anything!! Hats off to Netflix for allowing me to be part of this incredible journey!!!"}, {"id": 195, "text": "The film is about curiosity, the environment, sea life, animals (including the human animal), animal intelligence, friendship, evolution, persistence, family, physical fitness, education - and most of all - octopus. Minds are relatively blown. The cinema-photography is stunning, great background music; a technical feat of monumental proportions. And it's deeply emotional. I was pulled in. Never take the natural world for granted."}, {"id": 196, "text": "I have no words. This documentary and story is the most beautiful expression I have ever seen on the screen. It goes beyond everything. I feel privileged for having seen it, felt it, learned from it, and will watch it again and again and again.."}, {"id": 197, "text": "I am so glad that I decided to watch this film. It had such a profound effect on me that I don't really even know how to put into words. It has caused me to see the world in a new light. The film is absolutely gorgeous, visually, and it really makes you realize how truly beautiful and wondrous the ocean is and how this bizarre and magnificent world exists there, without most of us fully realizing it because it is something that most of us never really experience the way the main character does in this film. It is also an incredibly touching film and VERY well-made, in all possible ways. I don't want to risk giving out any spoilers or too much info, but please do watch this film. I honestly believe that it is one of those rare films that everyone should see and will perhaps end up an even better person because of it. As for Craig Foster... What a truly beautiful soul. The entire time I was watching this, I found myself wishing I could give him a hug and wishing that more people were like him. I think he represents what Man should be, in terms of harmony with the world around him, empathy and curiosity for the natural world. Thank you for making this documentary. :)"}, {"id": 198, "text": "I didn't expect that despite its documentary and natural part of the film, to be so emotional and intimate. The friendship feelings that were shared between the human being and the octopus, as a not very well known creature, makes it possible for new insights of the nature and our role there. You can see an octopus playing with fish only if you feel this octopus and start thinking as her. The same is with all the nature that is surrounding us. We need to fall in love with it, so that we fully understand it and feel compassionate about its suffering and fights. Amazing film! And...this is my first comment ever in IMDB."}, {"id": 199, "text": "Not sure what this poor guy's problem is. Every time he walks to or from the beach, he's in slow-motion. The documentary could've been 30 minutes shorter had the slow-mo moments been played normally.I gave this a 7 because the Octopus was adorable, and the seascapes were beautiful.Would've been a 10 if the editing had been better, and if the hypocrisy of this man hadn't ruined a good story."}, {"id": 200, "text": "Had myself and my partner in tears. Im a doctor and can say this is one of the most fascinating insights into life and death you will ever learn."}, {"id": 201, "text": "Stunning documentary.. at par with blue planet, our planet etc.. and time has come to switch to vegetarianism and stop exploiting the wild animals..."}, {"id": 202, "text": "Octopi are my favorite animals. Still I didn´t expect too much. I gave the documentary a go and was captivated from the very beginning. Beautifully shot and calmly narrated. It´s informative, exciting, even thrilling and very touching. Wonderful Hommage to the life of the main protagonist, female Octopus."}, {"id": 203, "text": "I created my IMDB account just to rate and review this.Mankind needs more people like Craig Foster and David Attenborough. These amazing people have a treasure of knowledge and first hand experience of life and nature.I wish I could meet them someday and learn more about their amazing experience.Thanks to these people and the technology, that we can get a glimpse of their incredible experience at the comfort of our living rooms while having cheesecake and coffee.This is a must watch and deserves a standing ovation.Thank you Craig Foster and Netflix."}, {"id": 204, "text": "An absolutely beautiful documentary, one of the best you will ever watch in your lifetime. I felt compelled to write a review as i feel it is well deserved."}, {"id": 205, "text": "Wow, got totally mesmerized by the gorgeous underwater scenes, then the bittersweet story of an unusual friendship between a diver and an octopus. Smart creatures they are and they can certainly teach us a lot. Cried at the end. I don't forget it anytime soon."}, {"id": 206, "text": "I read a few reviews and my advice is Just watch it If u like wildlife documentary wow Incredible story"}, {"id": 207, "text": "I've not enjoyed a movie more for many years. I laughed. I cried. I got goosebumps. My heart was warmed. Truely a fantastic film.Going to make a donation to Sea Change Project."}, {"id": 208, "text": "You will enrich your life by watching this amazing story of a man and his friend the octopus. Don't miss it. Five stars or two thumbs up; every measure."}, {"id": 209, "text": "It's my very first review about any film, movie or documentary. I just felt the need to share my emotions about this movie. My tears was streaming unexpectedly and couldn't stop for a while after it ended. True inspiration and motivation in those dark ages of humanity and the planet itself. The best love story I've ever watched."}, {"id": 210, "text": "I can't remember ever watching a documentary better than this one. I'm not even a person who pays much attention to the animal kingdom but I was mesmerized by My Octopus Teacher.The cinematography is first rate. Narration is engaging. The interaction between Craig Foster and the octopus was incredible.If there were scenes constructed to appear as a continuous single shot I could not perceive it.This is quite an accomplished project. Amazing.I've been telling my friends to watch this documentary."}, {"id": 211, "text": "Yes, this title fits perfectly into the documentary category but it's way beyond that specification. It is a story. A story between a man a sea creature or maybe an allegory about humankind and nature. Hence, it could be possible to classify it as a drama in all fairness. It is about the original story that unfolds in from of your eyes, it about some of the most beautiful photography I've ever seen, it is about peace of mind and emotional lessons. It is not just a simple tale about a man and his pet, it is an epic tale between two living beings, that ends with deep teaching. Come on, go ahead and watch it, bets are you wouldn't be disappointed. Go for it."}, {"id": 212, "text": "Quite possible one of the best and most beautiful film I have ever seen..."}, {"id": 213, "text": "Very pure in his thought and actions by Craig, his longing to go back to nature had shown him a great life experience he can cherish forever. Really how great to know about The Octopus and how great the life is all about. The nature dissolves all your worries if you believe you belong here and listen to it, if you don't feel that you will suffer, is something I take away from this epic documentary."}, {"id": 214, "text": "This is so beautiful. Anyone who is not deeply Touched has stone for a heart. I'd be very wary of anyone who can't see the beauty in this relationship to nature, and the massive awakening in this one person, and know this is what's needed to change our world for the better. We are in the 6th mass extinction event right now, but for the first time it is entirely due to human behavior. I am stunned by any negative reviews, but lack of empathy and ignorance, criticizing his ethical interactions, are why this movie is so needed. He does zero to alter her life. People Who are asleep and heartless are just that. Ignore them and see this movie!"}, {"id": 215, "text": "A beautiful documentary about a man venturing into the ocean to find a new path in life, and instead finding an amazing relationship with an octopus. I didn't know much about the octopus or its level of intellect before watching this, but thanks to Craig, I'll never look at them the same again. The cinematography is spectacular, and the storyline is captivating. You will be in awe at times and you will be in tears at times, this is a masterpiece."}, {"id": 216, "text": "This is my 1st review I've ever written. This film is remarkable in every way. The cinematography is top notch. Seeing the way the octupus bonds with Foster is truly heartwarming. I never realized how highly intelligent octupi really are. This documentary has given me a new found respect for an animal I knew nothing about at the time. I highly recommend watching it and you can see for yourself. As for the people that are mad about the ending.....do some research!!! Don't be lazy!! A female octupus dies a few days after her eggs hatch. She doesn't eat for 6 months. Foster couldn't have done anything for her."}, {"id": 217, "text": "What a beautiful, inspiring work. with respect for the power of nature, this film captures one of the most beautiful relationships I've seen. we have a lot to learn about this blue planet, and this film proves you never know who will teach you."}, {"id": 218, "text": "One of the most eye opening documentaries i've ever seen. The extraordinary quality and POV perspective instantly makes you part of the exploration of the mysteries of the ocean. And more importantly it makes you a witness to the strange but facinating relationship developing between diver and octopus. A must see."}, {"id": 219, "text": "I turned this movie on late in the evening, on the suggestion of a friend; I was not in the mood for a Attenborough nature doc, though I always like them. I was in more of a reality trash TV type of mood, but thought I'd see how it began. I needed to get up and do something, but couldn't leave the seat or the screen once the film started. I think about that man, that octopus, and all of the connections we develop, don't let develop, over-power, get over-powered by... and so much more everyday. I thank the filmmaker for his loving portrait - and expanding my world in a really unforeseen way. Just gorgeous. Thank you."}, {"id": 220, "text": "Truly amazing. Can't recommend enough this documentary. It is just mind blowing. Amazing footage and story."}, {"id": 221, "text": "I can't believe I am blubbering like a four year old over a relationship between a human and a octopus. Very moving story how a father reconnects with his son after developing an unlikely relationship with the ocean and one of its inhabitants. Beautifully shot great storyline. Highly recommended."}, {"id": 222, "text": "I am a huge fan of Documentaries and animal life period.. This documentary made me cry and feel this overwhelming feeling of happiness! Life is beautiful and to watch this man have a fascinating journey in the sea and get educated about the Octopus was priceless.. this was a brave and dedicated journey.. I am so grateful to be ale to watch it!! I highly recommend watching it.."}, {"id": 223, "text": "I'm not a nature/animal movie person and this just kept my eyes on the screen"}, {"id": 224, "text": "Sometimes one forgets how beautiful and intriguing nature can be. Without giving much away, this is a story about a man who meets an octopus in the wild and the two form an unusual bond. That's all I'll say as I don't wish to give any more away but what a beautiful and refreshing film with stunning imagery. One of the better films I've seen this year. Just awesome!"}, {"id": 225, "text": "I started this movie as a distraction while doing something else. I never got to do the something else because I was gripped from the get-go. I sat pretty much mesmerised throughout. So beautifully filmed that some scenes look like exquisite artworks. And to get to know this incredible creature through Craig's eyes, what a privilege. It makes us re-assess our disgusting belief that we are better or superior to any of the other creatures that inhabit this world. A very special experience that will linger for many years in my heart and mind."}, {"id": 226, "text": "I was completely moved by the passion and heartfelt emotion in this documentary. The music, the narration and the cinematography really blew me away. It was beautiful and enlightening, as well as educational. This bond between a man and an octopus tugs at your heart strings and you somehow get lost in the ocean underworld with the two of them. I felt like I was discovering these forests and landscapes and creatures along with the director. The octopus herself taught him so much, and in turn, taught all of us. It's both a nature documentary and a story of growth and love.......one that I will never forget. Bravo."}, {"id": 227, "text": "This is my first ever review on IMDB. This documentary is simply the best I have ever watched in my life. The soundtracks, the storytelling and the cinematography was captivating and breathtaking."}, {"id": 228, "text": "Absolutely brilliant. Everyone should watch &amp; learn how beautiful &amp; heartbreaking nature is."}, {"id": 229, "text": "I sat down to watch this only knowing very little information. What awaited me was an amazing journey into the ocean and made me rethink so many things about human and animal interactions. How they think.. how they feel..how they show affection.. and how they survive...I was an emotional mess so much when the octupus comforted Craig in the water as to say her final goodbye. My heart broke then and there and I could also hear the heartbreak in his voice too. This documentary changed my life so much, it put so much in to perspective and made me feel so many different emotions in a short amount of time. This is something I will want my future kids to see so they appreciate the ocean and the beautiful life it holds."}, {"id": 230, "text": "An amazing and unique story of a man needing a change in life getting it from an unlikely source. The footage is beautifully shot and the story is well told. It is amazing to watch the octopus and how it interacts with the story teller. Well worth the watch."}, {"id": 231, "text": "A serenely beautiful, heartfelt story. Thank you so much for sharing it with us. I had no idea octopus could saddle up a shark!!"}, {"id": 232, "text": "You must watch it! One of the best movies I ever saw..."}, {"id": 233, "text": "This documentary took my breath away, and I think it was the first time I cried, watching one. Wow... just wow."}, {"id": 234, "text": "Very well done. Very instructive and something new and fresh among all the stuff that we see these days.Thanks for the lessons."}, {"id": 235, "text": "I am vegeterian now. After watch this documentary. Everything is clear in the world. This is philosophy"}, {"id": 236, "text": "What an amazing documentary. I've never been so moved and touched with any nature film. So beautifully done, from the filming to the music.Must watch for sure."}, {"id": 237, "text": "I have been an octopus fan for years and was so excited when I saw the title while browsing Netflix. It exceeded my expectations and moved me to tears several times. I will watch this again and again."}, {"id": 238, "text": "Best of documentaries.😍😍😍😍😍😍😍😍😍😍😍😍😍😍"}, {"id": 239, "text": "I have twice listened to the audio only as my daily meditation - This documentary is beautiful and the gentleman who speaks about his experiences is so well spoken; his pleasant demeanor and voice allows for an imaginative experience. I was utterly satisfied just listening to this programs audio as part of my morning meditation -then I began to watch. This is my first review that feels more like a journal entry - but I feel compelled because I don't believe I have ever just listened to a show then watched a show that I planned to watch again before it was even finished. Gentle, moving and emotional FYI . After reading Soul of an Octopus I was hungry for something to move me in the same way . I never expected to find it outside of a book."}, {"id": 240, "text": "I don't remember ever having seen such a documentary before. It will move you. Beautifully executed aswell!"}, {"id": 241, "text": "I loved this. Uplifting and heartbreaking, it follows a life of an octopus and her relationship with a human. We can all learn something from this wonderful moment caught on film. Perhaps she (the octopus) can become a teacher to us all. Watch it, ignore any flaws, and just embrace this beautiful, intelligent animal as she goes about her short, yet meaningful, life."}, {"id": 242, "text": "Beautiful documentary about a man who spends a year of his life filming an octopus that lives near his home by the sea in South Africa. He learns about her behavior and becomes surprised just how intelligent she is. He watches her hunt, escape danger, regrow her limbs, and they even bond with one another and sort of become friends. This documentary helps the audience have an appreciation for marine biology and shows how human beings and other animals share this world. Good stuff."}, {"id": 243, "text": "I planned to have an early night but made the mistake of starting My Octopus Teacher. Unconventional in every sense of the word but a thrilling and captivating tale of an odd relationship struck between Octopus and Human. You will connect. Watch this"}, {"id": 244, "text": "BLOWN AWAY BY THIS! I have no idea how he filmed all of this so beautifully. So many never before seen moments. So much to learn and think about. All that said, it ALSO leaves you wanting more and wanting to be one with nature. Phenomenal!"}, {"id": 245, "text": "At first all I could think about was how does he hold his breath so long. But once you see the octopus, you stop thinking about that."}, {"id": 246, "text": "If you can make it through My Octopus Teacher without your jaw dropping in pure wonder or tears streaming down your cheeks, congratulations: you have a rock instead of a heart, and no soul. People throw around the word 'breathtaking' so much, but this gorgeous and incredibly moving documentary sucks the oxygen right out of your lungs. Sensational."}, {"id": 247, "text": "Absolutely stunning and exceptionally beautiful story what life should be about where we all are a part of our planet and every little or big life matters and are important."}, {"id": 248, "text": "I cried and cried so much! These animals are the most inteligent animals in the world. The whole story is beautiful and sad. Amazing documentary!"}, {"id": 249, "text": "This is a million miles away from the epic BBC nature docos we're familiar with: helicopter, close-up drone shots, motion-capture cameras, dozens of cameramen, and Sir David Attenborough's amazing commentary. But it's well done. Spectacularly, so, in my opinion. Such a simple premise: 1 man + 1 octopus + time - lots of time. No human has ever done this before, I'm sure. What unfolds is magical... an adult man who loves the sea meets and, incredibly, gets to know an octopus, female, just a few months old, and expected to live, at best, for 1 year. What unfolds is a story of connection, of recognition across species, of a lost man who finds meaning again in his life from a mollusc. Admittedly the most intelligent mollusc on the planet (equivalent, perhaps, to a dog). But hardly something you'd pitch to a Hollywood producer as a potential blockbuster. The result, however, is a drama... of meeting, of attraction, of mortal danger, of loss, and more. Quite simply, the most astonishing nature documentary I have ever seen."}, {"id": 250, "text": "I love this beautiful and wonderful documentary so much! Thanks Craig! Although I cried and heart broken as you!Please do not miss this touching documentary!"}, {"id": 251, "text": "A rare glimpse into the world of one of the most intelligent sea creatures on the planet. Wonderfully told by a film maker who created a bond with the octopus while at the same time staying removed from its daily life."}, {"id": 252, "text": "A moving, heartfelt documentary that gave an extraordinary insight into a majestic and intelligent creature!"}, {"id": 253, "text": "Fascinating and beautiful story that lures you into an unknown world."}, {"id": 254, "text": "I cant believe there are so many good reviews! This guy knows nothing about animals or nature, Please watch any BBC Earth documentary, specially the ones presented by David Attenborough."}, {"id": 255, "text": "As an animal behaviour student, I LOVED the respect he showed to the octopus, as well as the other creatures in the water. His restraint in his interactions, how he let nature take its' course, it was a relief and also a great lesson for those watching. Do not disturb animals in their environment!The imagery, the observations, what he was able to catch on camera leaves you in awe and inspires you to want to help protect this world. Beautifully captured, many life lessons taught along the way."}, {"id": 256, "text": "This has to be one of the sweetest and most beautiful documentary I have ever seen. Beautifully shot, this gorgeous little minimalist story is very touching. I will never look at an octopus the same way ever again and I hope people will stop eating precious and beautiful wild life.The only disappointment is that the director failed to save the octopus several times from danger. Yes he does say he didn't want to interfere with 'nature' but I would have personally at least try to scare off the sharks or the flesh eating little fish instead of keeping filming. I really found that hard to understand. I loved the little octopus."}, {"id": 257, "text": "What an experience! A must see to anyone who loves the ocean."}, {"id": 258, "text": "I really loved this. So moving and beautiful, with wonderful storytelling by Craig. The bond between the Octopus &amp; Craig is incredible to watch. Thank you for making this and I hope Craig if you read this, that you are feeling more hopeful in life, I know how it feels to go through burnout and I wish you nothing but the best!"}, {"id": 259, "text": "I have been scuba diving for years and taught for many of those. I have seen a few octopus over the years and never realized what a beautiful species that are. It was truly inspirational to watch the relationship unfold."}, {"id": 260, "text": "The title stopped me and without knowing what it was about because of my own love of octopi- I hit play. This is not your typical documentary, more a story of a person describing the life of a friend whom touched him deeply. The cinematography is beautiful and the story is heartwarming. A few places, I found myself tearing up with such a special story. I learned a few new things I did not know about octopi and was completely enchanted with the 'lady' of the film."}, {"id": 261, "text": "Hands down the best nature documentary I have ever seen, from first to last minute. Increadible relationship between an octopus and a human. I am never going to eat an animal again in my life! Thank you Craig for telling this story! And I really do hope you win a lot of prices for this one."}, {"id": 262, "text": "What a beautiful story about trust and friendship. It highlights just how out of touch we are with nature and forget to revel in its perfect balance. This documentary will lift your spirits up."}, {"id": 263, "text": "I'll not say anything about it just I had the best time in last 7 days watching this incredibly strong and powerful mind fresher."}, {"id": 264, "text": "Captivated from the very beginning of this true to life love story, I didn't even want to blink! Craig Foster, I wish there were more people like you in this world! This man was an incredible student and friend....not interfering with changing the life cycle of this animal and other sea creatures, but respectfully offering his compassionate attention and trust. Cinematography gorgeous... coupled with this brilliant sharing of Foster's experiences made me wish there would be a part 2!"}, {"id": 265, "text": "It is a magnificent shot documentary, that captures you from the first second. It's def. more than just another documentary about nature, it's about man and nature or the nature of man, besides the marvelous steam of life where other intelligent creatures lives. One of these we follow intimately.Whether there are some anthropomorphic biases inherent in the documentary, but of course, even though our narrator and human, def. starts thinking like an octopus, maybe the octopus also starts behaving more like a human.I adored this masterpiece. Highly recommendable."}, {"id": 266, "text": "If you'be spent any time snorkeling or diving you will love this extraordinary film. Great for older children. Some scary parts for younger kids when predatory sharks come around."}, {"id": 267, "text": "I was killing time and perusing the documentaries on Netflix and ran across this gem. It was very inspiring. I realized just how connected we can be to other species around us and not in a predatory way. Great film. Videography is quite impressive. Great job all those involved and a well deserved 10 stars."}, {"id": 268, "text": "This is one of, if not the best documentary I have ever watched. Who would of ever thought that it could be possible to bond with an octopus but Craig Foster did. There were moments when my heart was racing and moments when I couldn't help but shed a tear."}, {"id": 269, "text": "Being a documentaryaholic I've seen and been in awe of and educated by so, so many but this one really got me. Thanks so much to everyone involved in its making... I just had an hour and 25 minutes that I'll always remember... We'll done."}, {"id": 270, "text": "A wonderful emotional film that literally dives into another world. Brilliantly filmed and edited. The first film I have rated 10, this is a joy and a must watch."}, {"id": 271, "text": "This nature documentary sheds light on a seemingly alien world, a vast underwater ecosystem that seems so different from anything we can comprehend here on land. The star is, of course, the flick's eponymous Octopus, which forms a strong and apparently two-way bond with a diver who visits it every day for almost a year. This small creature is seriously amazing, with abilities you'd expect to see in a sci-fi film and an intelligence that far exceeds anything in its immediate surroundings. It's wonderful to see it up close, to naturally learn about (and from) it as the piece progresses. It becomes clear that the creature much more than most people gives it credit for. In general, 'My Octopus Teacher (2020)' is oddly compelling and emotionally affecting, actually feeling somewhat profound in places. It's the sort of thing you have to experience to fully understand. It makes you want to broaden your understanding of the amazingly unique living beings that share this planet with us. 7/10"}, {"id": 272, "text": "This is a very well made documentary. It is both informative and moving. Through Craig, we learn much about octopus lives and through his connection to the octopus we feel his compassion. It gives the viewer a new appreciation of the world in which we, and other animals live."}, {"id": 273, "text": "Completely engrossing from the moment this documentary begins. This is because of the octopus. As a consistent viewer of documentaries, I will put this right up there with the best I have ever seen. Highly recommended for all ages. It's a triumph."}, {"id": 274, "text": "I don't watch a lot of documentaries, but a friend highly recommended it so I gave it a shot. I'm so glad I did! The relationship between Craig Foster and the octopus highlights the amazing intelligence and exquisite design of this mollusk and even its apparent desire to have a relationship with Foster. The camera work is beautiful. There are plenty of views of dozens of other forms of sea life. It's easy to watch and your heart will be stirred as you find yourself caught up in the world of the octopus and Foster."}, {"id": 275, "text": "This beautiful, sensitive film provides profound insights. It explores the connections between human beings and other forms of life on our planet. I will never see an octopus quite the same way again after watching it! The film offers astonishing information about the consciousness and high intelligence of a marine creature that usually maintains few contacts with people. It presents an amazing and emotionally gripping account. Yet My Octopus Teacher also supplies a visually rich introduction to a stunning underwater environment. The photography captivates and enchants. This unique film will certainly win awards in the future. Its release is probably one of the best things to happen during 2020. Don't miss the opportunity to watch it now!"}, {"id": 276, "text": "This is a beautiful work of art and a testament to the magnificence of nature - our human connection to it and the need to cherish our time here as individuals and a race. His dedication and unexpected relationship with this wondrous creature borders on the sublime."}, {"id": 277, "text": "An incredibly moving insightful documentary, left me thinking about our place in the order of things what she taught me was to feel that you're part of this place, not a visitor I cried, and can't wait to watch this with my son's this weekend when they visit. An Octopus can teach all of us, when will we learn?"}, {"id": 278, "text": "Stunningly beautiful story... Takes your breath away.. Images filled with color and so is the story.."}, {"id": 279, "text": "A beautiful, tender documentary about the year a man spent following, understanding and building a relationship with an octopus off the Atlantic coast of South Africa. I have a natural aversion to sentimental, 'inspiring' documentaries - but this film deftly avoids the traps of this nature and settles for simply telling a story and allowing emotion to evolve. It's not a scientific study - though the man concerned does study and learn as the year progresses - it's instead a portrait of immersion in the world of another, and how that affects and changes us. The alien, exotic nature of the kelp forest is beautifully evoked by the excellent cinematography - though there's a tad too much slow-motion for me, which ends up slightly dulling its intended impact - and I must make special mention of the lovely, evocative score from (full disclosure) composers known personally to me. A lovely film."}, {"id": 280, "text": "Brilliant. Absolutely brilliant. Emotionally drawn in from the beginning. I fell in love with 'her', and Craig Foster. More words would diminish this. Watch it. You must."}, {"id": 281, "text": "Intimate memoir of a year in the life of a man and an octopus in the icy waters off the western cape of South Africa. A wildly successful nature photographer and filmmaker, Craig Foster experienced a personal crisis in meaning and purpose. To grapple with the anguish, Craig returned to his childhood home-a bungalow below the high tide mark. No longer able to 'do' more, he needed to 'be' more. So it was, he came to re-enter the marine world of his beloved South African kelp forest. After a period of acclimation, his boyhood passion for the natural world re-surfaced and his love of wildlife photography returned. Before long, he encountered a wild octopus and began a mutually-respectful relationship, documenting the most intimate, grueling, and uncanny events in the life of this unimaginable creature. I laughed and cried and white-knuckled scenes that left me asking how in the h*!! did he do that! But don't take my word for it, watch this 90-minute magical mystery tour and get a sneak peak at his research and storyboard process."}, {"id": 282, "text": "I have created IMDb account to give this film my 10 stars. Gentle and touching story wrapped in beautiful pictures of the nature in the ocean. Loved it!"}, {"id": 283, "text": "My family and I truly enjoyed this film. We learned a lot from this film.The moments caught on film were very extraordinary and it's amazing how incredibly smart the octopus is, as well as the emotions they have.Well documented. Thank you for sharing this experience with us all"}, {"id": 284, "text": "The most beautiful thing I saw this year. So pure. I cried every time she touched him. Omg it is so moving. Beautifully shot, narrated, everything is one great composition. Very inspiring story, makes you want to immediately jump into nearest water and explore, connect, be part of nature. So much that we can learn from this documentary and that mesmerizing octopus. I read many stories about how much octopuses are intelligent, and have many traits as humans, but this film sums up everything in such a wonderful way, it explains so much. Stories like these are necessary, especially now in this crazy year, to warm our hearts a little bit, to connect and remind us of how special and precious wild world really is. I will recommend this movie to everyone I know."}, {"id": 285, "text": "I watched this documentary with no pretense or expectation, actually just to kill some time!!! I was curious because the subject was a bit weird: a man and a Octopus friend??!!! I have to admit this is one of THE BEST documentary I've watched in years!!! Even though is not explicit it talks about everything important in life: friendship, family, clean environment, mental health, nature, relationship, life and death. I HIGHLY recommend to watch this documentary with your kids, other family members, friends, your pet... It shows how fragile this planet, life and nature is"}, {"id": 286, "text": "One of the best I've seen, there isn't much else to say... just hurry and see it !"}, {"id": 287, "text": "I have now watched this documentary 3 times and it actually is astonishing. The last time a documentary had my attention this much was Finding Sugarman that won the oscar that year. It is simply breathtaking and worthy of all the accolades it mat still get. Without a doubt in the top three documentaries i have ever watch... OSCAR WORTHY"}, {"id": 288, "text": "This documentary is just beautiful and reinforces the fact that we are part of our environment, not just onlookers. it's up to all of us to protect our planet. the soundtrack and photography are beautiful."}, {"id": 289, "text": "I don't recall ever responding to a documentary or really ever been inspired to. I'm former police, sheriff, fire, PI and para-military and have witnessed some pretty tough scenes.. here I set watching a doc about a man and his relationship with a octopus with tears in my eyes... I still have them while writing this the next day. There are lessons to be learned and realized from this, and mine I'm sure will last a lifetime. Well done and thank you so much for this project. Dr. Stephen R. Barnhart"}, {"id": 290, "text": "This is a story how a diver spent a year following a common octopus and later befriended her. In reality, this is a beautifully crafted video journal that has much deeper meaning, where no matter how different you are, you can find common bonds, only if you take the time to try to understand each other.It's beautifully narrated, great cinematography, music that greatly enhances the experience.Well done!"}, {"id": 291, "text": "If you want to see a nature or a just overall beautiful movie then you should watch this. At first I thought I wouldn't like it but it was amazing.10/10 I recommend this movie."}, {"id": 292, "text": "I have no words, only emotions. There are few true feel good movies. That this man, who admits he feels uncomfortable with people and his own son, learned from this creature to appreciate other humans, is to me what makes this movie a 9.5/10."}, {"id": 293, "text": "This documentary is absolutely, stunningly beautiful. I highly recommend it. I'm still affected emotionally, and think maybe I always will be. It's that good."}, {"id": 294, "text": "I can't say enough about this film. It Is a beautifully photographed and documented love story between a man and an octopus. There is so much humanity can learn from wild creatures...I am still speechless. Please watch this film."}, {"id": 295, "text": "I had been procrastinating to watch this ever since I noticed it on Netflix. I have never regretted procrastination so much ever in my life.This is a documentary as well as a biography of a tiny creature we dismiss as a elusive alien in the ocean. And although it is not as big and grand as BBC Planet Earth or other Attenborough documentaries it certainly stands as tall as them when it comes to story telling, editing, music and direction. This documentary makes you almost if not certainly cry for a nameless creature you only have known for 90 minutes.This has thrills, emotions, heart, bravery, excitement and action! By now if you're not convinced to watch this documentary, I don't know what to say. An absolute 10 out of 10."}, {"id": 296, "text": "Full of special moments. Makes you realise that as humans we are part of it all even though we've lost our way in some respects."}, {"id": 297, "text": "Watch this, just watch it, you'll be amazed. ....Cheers"}, {"id": 298, "text": "Everything is perfect in this film, including Directing, shooting and editing"}, {"id": 299, "text": "Caught me completely off guard and lead me into my favourite world."}, {"id": 300, "text": "I wish à friend like her But unfortly i Don't have that"}, {"id": 301, "text": "So Much emotion, simply the documentry i ever seen, wish i hade a squid like her"}, {"id": 302, "text": "I think this movie needs no introduction and no explanation - just do yourself a huge favor and sit down to watch it. I'm not big into nature documentaries, have pretty full on ADHD and get easily bored - this slow pace movie had me hooked. It's full of wonderful incredibly satisfying beauty, and is wholesome and lovely without being tacky, It left me with a warm feeling for a long long time after, and I found myself thinking about it for a while. Cannot recommend enough."}, {"id": 303, "text": "This was one of the the most beautiful documentary's I have ever watched. Totally beautiful Beyond anything. The kelp forest was stunning the corals were stunning, their world is majestic a beautiful. I fell in love with her as mush as he did she was a very special girl. Everything about his was spectacular, the format the idea !!! Superb!!!At the end I cried my eyes out. Like I have never done before it was totally and utterly heartbreaking. The most Wonderful love story between a Human and a mammal.I have sent this trailer to so many edging them to watch on Netflix.This should Win do many awards. The production on this is tremendous. Xxxxxx"}, {"id": 304, "text": "Strikingly beautiful look at a mysterious creature and the development of a fascinating human 'friendship' and the reminder that we have so much to learn from our animal 'cousins'."}, {"id": 305, "text": "And probably the only one featuring a human/invertebrate relationship. I've dived in kelp forests in Central Cali, with wetsuit and SCUBA, unlike the author. How he is able to enter the natural world and encounter it on its own terms is nothing short of amazing. A must see. Enjoy."}, {"id": 306, "text": "My Octopus Teacher affirms and promotes the interdependent web of all existence of which we are a part. Deep and beautiful."}, {"id": 307, "text": "Whenever my toddler daughter and I unwind and hang out before her bedtime on my bed, I like putting on a David Attenborough narrated documentary or something similar. This was so relaxing and enjoyable to watch. Also, extremely touching. Highly recommend."}, {"id": 308, "text": "This unique documentary about the friendship between a man and an octopus spoke directly to my heart. It reminded me of what an extraordinary planet this is and how lucky I am to experience it while it's still alive."}, {"id": 309, "text": "Cutest thing, documentaries about a friendship relationship, yes, friendship and teaching, between a man and an octopus, think of a cute thing, now multiply by the tentacles of the octopus, now we have the total cuteness of this documentary... Even half sad, and with a cutie at the end..."}, {"id": 310, "text": "If you like the natural world and nature in general, then you absolutely MUST watch this film! I've never seen anything quite like it. Not only does it brilliantly depict the wonders of the underwater kelp forest in all its glory, but it also is a very personal, emotional story about the bond between a human and a wild octopus, of all things. I was amazed and you will be too if you watch it!"}, {"id": 311, "text": "I've never seen this kind of nature documentary and full with love drama"}, {"id": 312, "text": "Such a moving documentary. Who new that a creature that you would never think about can create such emotion. So glad I watched this."}, {"id": 313, "text": "This is truly one of the best wildlife films I've seen in my life. Such a great amount of energy and love went into making of this masterpiece. Thank you so much for taking us to this journey."}, {"id": 314, "text": "This was fascinating and stunningly shot. Fell in love with both the Octopus, the story teller and the reef. It was magical, tears were free flowing."}, {"id": 315, "text": "Intriging, delicate resiliant, and fragile, like we are..."}, {"id": 316, "text": "Beautiful, Touching, and Educational. Worth sharing and repeat watching. Enjoyed very much."}, {"id": 317, "text": "This blew me away totally. Stunning, beautifully shot and full of empathy. Best nature documentary l have scene. And the Oscars goes to...."}, {"id": 318, "text": "I'm very grateful to the family member who recommended this unbelievably beautiful documentary. When I watched the trailer and began to tear up (something that has never happened), I knew that this was an extraordinary film. Few documentaries manage to bypass my watch list (where many good films have languished for years)- fortunately this one did.My Octopus Teacher is a about the connection that develops between two very different sentient beings: A human and an octopus. The film achieves what few documentaries can: Instead of remaining a mere viewer, you will become a participant in this intimate journey. The immersive and otherworldly cinematography is dazzling but never distracts from the narrative. I cannot recommend this film highly enough: Watch it!"}, {"id": 319, "text": "Never seen anything like this.just stunning and emotional,breath taking"}, {"id": 320, "text": "This is one of the best movies I've ever seen. It is utter perfection. That is all."}, {"id": 321, "text": "I knew this film was going to move me deeply. I could tell by watching the trailer! The film is just beautiful! It's hard to find words to describe how I'm feeling! The cinematography, the music, and even the sound of the narrator's voice puts you into a place so private that you sense you're being privy to something so intimate and extraordinary! It's like poetry in motion. I've never seen a film like this before! I consider it a rare gift!"}, {"id": 322, "text": "I loved this movie so much that I'm going to watch it again. This is a remarkable story unlike any other you will ever see. I was moved to tears during some of the scenes."}, {"id": 323, "text": "After watching this, I fell inlove with nature even more. Their connection is amazing 💗 A documentary film turned into a movie of extraordinary friendship."}, {"id": 324, "text": "This is not much of a review. Others have already said it. But this is one of the best things I have ever seen. Just watch it for yourself. It is profound and beautiful and moving. A fantastic accomplishment."}, {"id": 325, "text": "My first review ever, but this so beautifully done and yes, I too, wept over an octopus."}, {"id": 326, "text": "I have never written a review before but it it's fitting that this one would be the first. This is HANDS DOWN the best, most movingly beautiful nature documentary I have ever seen. The scenery is unmatched and the story of growth exceptional. I think anyone from 12-112 would throughly enjoy it and maybe come away with a new view of the world."}, {"id": 327, "text": "The photography is very beautiful. The story is very well carried. It is an absolutely relaxing film, that makes you appreciate nature and how we are all part of it. And, one learns about octopuses. Really, give yourself a treat and watch it."}, {"id": 328, "text": "What an amazing man, very emotional. This is a fabulous documentary."}, {"id": 329, "text": "I loved it. Beautiful images. Such an incredible story."}, {"id": 330, "text": "I just finished watching this at around 1AM by myself and was able to give it my full attention. It was easily one of the top 3 documentaries I've ever watched and certainly the most touching.Our narrator and freediving host searches for strength and purpose to continue on in life and in doing so learns deep lessons in unlikely places.My favorite thing about this documentary is the level of new scientific discovery that coincide with the narrators own emotional and universal development. I'm a sucker for anything that aims to prove our deep connection with the wild and the universe.This one struck a chord in my heart and had my eyes welling up at the beauty of life on a couple occasions. BravoElliott Osborne, 35, Chicago"}, {"id": 331, "text": "This is a documentary about a man who becomes obsessed with an octopus and documents its life.The sections on the octopus are very good. Both entertaining and informative. It is mesmerizing to see this strange animal in its natural habitat and the filmier does inject some life and drama into the proceedings.The areas focused on the octopus are great but there is only so much footage you can have of a creature that really does very little. This is broken up by the life of the documentary maker. This I found tedious and a bit self-indulgent. We mused for quite awhile wondering how his wife and child felt playing second-fiddle to a Cephalopod.Some very nice footage that could have been a lot shorter and I would have preferred without the repetitive voice-over about how the octopus had saved the producers life."}, {"id": 332, "text": "Gorgeous photography.If realism and information are desirable qualities in a nature documentary, this isn't a very good nature documentary.Because a fly crawls on me doesn't mean it has come to love and trust me. We see an octopus exhibiting instinctual behaviors. It feels around looking for food or danger. It becomes accustomed to the repeated presence of another animal, be it human or fish, and that presence doesn't trigger hiding behavior. It doesn't problem solve to cover itself in shells, that behavior has been programmed in the genes through evolution. The female doesn't 'sacrifice' herself for her children, that self-destruct behavior is, again, the result of evolutionary selection, most likely because of octopus cannibalistic behavior she would eat her young. If a particular gland is removed then she doesn't show that self-destruct behavior.It's all the projection of emotions of this nice, sensitive man. But I think it's better to see what is, not what we project."}, {"id": 333, "text": "This man spent months building a bond with an octopus, who reached out and demonstrated actual joy and affection upon seeing him... and then traded in that trust to get riveting footage of the octopus being mauled.... He said he *almost* felt like he should protect her, but that he wouldn't want to interfere with nature. You already interfered with nature by befriending this animal. If you bonded with a dog, would you just watch while the dog got brutalized, as the dog makes eye contact with you and runs up to you for help? This is the same thing. You had an understanding. The octopus used to rush up to him and actually hug him. After the betrayal, she never went up to touch him ever again. This creature was obviously bonded. She went out to spend time with him. She had her guard down in a way that she wouldn't have if she didn't have a (supposed) friend there. This was a beautiful and amazing connection, and you traded it in for interesting footage. Was it worth it?As he was discussing their connection, he kept reminding himself that she was only a mollusk. He is the mollusk. Is it really a revelation that animals can think and care and are worthy of value and consideration? He came so very close to getting the point. I hope it keeps him up at night. Congratulations; you got some great shots."}, {"id": 334, "text": "Firstly, yes the photography is pretty good, if a bit chaotic and seemingly using tank footage quite a lot.But, make no mistake this is an exploitation film from the start. The exploiter is the film maker. He is only interested in the shot. The octopus bonds with him and then nearly dies to a group of pyjama sharks at the start. This is not the same as watching zebra hunted on the Savannah.He watches on at the shark attack and then falsely (well maybe loss of earnings were a genuine worry) wrings his hands at what could have happened. At that point there are series of short scenes concerning how interested my son had become in the sea. Who would be fooled by this?The 'scientific papers the film maker purports to be the truth concerning the known intelligence of octopuses are rubbish. I did my environmental degree more than 20 years ago, it was known then about the importance of the CNS in their high levels of problem solving intelligence + Self-awareness. This was not an extraordinary octopus. It's the same octopus that many people are eating. They are highly complex and intelligent.People need a closer relationship with the natural world. We are in a terrible extinction crisis. This film with a different narrative could have contributed. Instead I only see exploitation.To the film maker, she wasn't special because YOU made her special. She was actually ordinary in respect to her species.I welcome a discussion with anybody associated with this film."}, {"id": 335, "text": "You mentioned before that on the edge of your seat moment happened..that you didn't Want to interfere with the cycle of life, You actually indeed did just buy interacting and establishing friendly communication and interaction. Although the film you have created, was/is very beautiful and educational.. You DID interfere with the cycle of life by showing up that day, that split-second, and in that moment... see if you weren't there that night Distracting her from hunting and staying camouflage she just might of reacted differently and maybe have gone elsewhere to keep that Precious items she lost without spoiling anything.. ughh, Do you not taking responsibility for that moment in her life that you most likely caused in the first place.. me furious! Seriously why didn't you HELP!?? Ughh,, considering Your presence alone might have caused different paths to be taken moments to be distracted fr. Next time you spend so much Time and attention to something to Prove you are not a threat and are friendly, follow through with being a that so called friend. .. protect defend and respect it as such.. Once again all time you have interfered with this octopus has caused it to change paths or go down the same path but different times.. So you're contradicting yourself when you say you didn't want to interfere with the cycle of life.. You could tell how when she was hurt she stared at you like why the hell didn't you help me type of luck eyes wide instead of stealthy like usual but it is what it is and ALL in ALL it's a beautiful film! octopuses are now my favorite animal."}, {"id": 336, "text": "I'll start with the good news: cinematography is indeed beautiful, I'm saying that as a long time fan of wildlife documentaries.The rest of the movie is utter garbage. First of all, it is very likely a lie. They must have captured all the footage within a couple of days and then added a twisted fanfic on top of it. Anybody who believes that thing is real is probably a flat-earther too.A middle-aged man stalking an octopus for weeks doesn't look like a healthy relationship at all - especially considering the tons of testimonies that can be easily understood as bad taste sexual jokes. Moreover, he broke the golden rule: LET NATURE FOLLOW ITS COURSE (yes, I'm talking about the clam).If you're looking for poetry, stay away from this atrocity. Go read some poetry. This movie is cringey at most. Or, whatever, watch it with no sound and subtitles while skipping the parts where the filmmaker is speaking. As i said before, the cinematography is nice.There are many excellent wildlife movies and documentaries out there, don't waste your time watching this crap."}, {"id": 337, "text": "Humans are the only species on earth that doesn't live in harmony with its surroundings. We've done almost everything we can to separate ourselves and perhaps we've lost our way as we tread rather clumsily and disturb fragile ecosystems.My Octopus Teacher is a very charming and educational look into what happens when a human willingly immerses themselves into the world of another creature, makes the effort to understand them, empathises with them totally, and is willing to live *their* way.So often, we are amazed by what animals can do, but if we actually took the time to listen, to observe, to immerse ourselves, we wouldn't be surprised at all by how magical and spectacular they are.This is a lovely story, easily relatable, beautifully shot and I freely admit that I cried near the end.Well done to the filmmaker and thank you for telling a critically important story that we all need to hear."}, {"id": 338, "text": "I watched this last night out of boredom, and within the first 10 minutes, I realized I was completely engrossed. I felt skeptical at first about the title and the concept, and now I fully understand the meaning behind it all.First of all the cinematography is stunning and the score created a mood that allows the viewer to feel every emotion shared between human and animal. The editing must have been a monumental task as there were probably countless hours of footage to pare down. What they came up with was a beautifully articulated story about life and what it means to truly understand an animal's world from it's point of view.Craig Foster is the man who discovers the octopus; at first she evokes his curiosity and desire to watch her activity. But it evolves into a complex and revelatory relationship of trust and loyalty. Craig free dives into the cold water daily, for hundreds of days, to see her and further develop their interaction. He has his own human struggles and diving brought him some peace. The octopus is known to be an intelligent creature, but we don't necessarily know it as an emotional creature, capable of more than survival. What unfolds before us is remarkable and almost a gift. Like many other posters here, I finished this film feeling I was a changed human being. In the middle of all that is happening in the world right now, this movie reminds me to appreciate the simplicity of just being alive, and to acknowledge the subtle moments of give and take between man and nature."}, {"id": 339, "text": "GRADE: B-THIS FILM IS RECOMMENDED.IN BRIEF: A man's strange fascination with a mollusk becomes an entertaining documentary.JIM'S REVIEW: Pet owners have always had a special bond with their animal friends. We tend to identify their behavior instinct as unconditional love and devoted companionship. We give them personifying traits to give us comfort and joy. (Although my sweet Zoey is the smartest and most loving of puppies!)Which brings us to the subject of this strange but diverting documentary, My Octopus Teacher. But more to its pupil, Craig Foster and his nearly year old obsession with his underwater buddy. Their bond is strange to say the most and slightly borderline off the deep end to say the least.Filmed off the coast of South Africa, the film follows their relationship from the beginnings of a beautiful friendship to its inevitable bye, bye octupi sign-off. The photography is stunning as it captures an underworld microcosm of life amid the ethereal world of color and light. Visually astonishing, we are transported to an unknown universe as student meets tutor. Their time together under the sea is quite riveting, but the words from Mr. Foster never reach the poetic beauty of his vision. His sentimental voiceover narration lacks, dare I say, depth, and with it comes an underlying desperation to impress and justify his risky and behavior told in his own words. (I kept wondering about his many night dives without scuba gear and his sometimes water-world jaunts alone. Granted he did have an assistant cameraman, Roger Horrocks, most of the time; yet my thoughts always came back to Mr. Foster's human world of isolation and his neglected son throughout most of the movie.) As the story unfurls, his observational actions become almost too obsessive, even if his footage of his alien friend is spellbinding in its beauty.The octopus itself is a fascinating subject and any moviegoer will be in awe of its survival instincts to camouflage its being and move so gracefully in its environs. We watch it evade attacks by sharks, go hunting as it systemically stalks its own prey, and communicate with Mr. Foster in his day-to-day marine biology studies.My Octopus Teacher, skillfully directed by Pippa Ehrich and James Reed, shows a different type of bromance that entertains in all of its curious oddity and sustained sense of wonder."}, {"id": 340, "text": "Ok, pictures are splendid, aquatic life is stunning and the story is an emotional rollercoaster. However after I watched this, and also during the viewing I had concerns about several things and this is why I am not giving this a 10. I will not spoil so I will not detail everything but I cannot help but wondering how much of this story is true. First if it is true, then this guy has serious psychological issues. He needed to find a purpose and meaning in his life so he became obsessed with an octopus. The fact the octopus touches him might have nothing to do with an imaginary friendship but rather with the guy's skin being warm. I believe the octopus was simply attracted to the warmth and did not care or even know about the guy at all. Then when the octopus gets in trouble I cannot help but wondering why the guy keeps filming and does nothing to help the animal. Hr could have but he did not, simply staring with his camera. So this is like he wants only to make pictures. This documentary looks insincere in the end, if you think about it and do not rely on the editing job to tell you what really happened. I think the guy is a good actor too. Feel free to believe what you want. Anyhow, this is worth watching, this is quite extraordinary to see an octopus in his natural habitat."}, {"id": 341, "text": "Ugh my entire (perfect) review just disappeared from accidentally touching something on my phone screen. Let's try this again.I am a lifelong fan of anything to do with the ocean and Marine life (yes that includes Finding Nemo). Adored Jacques Cousteau. The filmography in this doc is amazing. I don't want to say much else because to get the full impact, I believe you should view it without prejudice like I did.It is touching, beyond gorgeous, suspenseful, engaging, and important. It is slower paced, I promise you stay with it and you'll be greatly rewarded.I'm not entirely aware of how in the world this filmmaker filmed this but I'm so glad he did.Just Trust me, watch it.10 full gleaming stars, I would give it 100 if I could."}, {"id": 342, "text": "It feels to me that it's extremely rare nowadays to come across such inspiring, kind story of friendship - such as the one presented in this film. An unbelievable work was done by the director - which gave almost a year of his life to an unbelievably noble creature, while capturing all the best and worst moments of her short, heroic life on camera. Those unbelievably intimate moments of hardship, suffering, victory and happiness of such a noble creature - which are almost never captured on camera - where captured, literally for the first time, only thanks to this man, who decided to dedicate a year of his life, to living WITH this magnificent creature. This film makes one wonder, more than ever, how many of those incredible stories exist out there in the ocean (some of them are taking place right now) and how little and insignificant we and our problems are, even in the scope of out tiny planet. There's so much going on here, so many REAL events are happening around us, while we are dealing almost exclusively with OUR little and - in the grand scheme of things - absolutely meaningless problems. This world is so much bigger than us, and we take it for granted, while having the unbelievably selfish feeling that it's OURS. Nothing is ours, life is so very short and full of true wonder - don't waste it away."}, {"id": 343, "text": "2020 being the year it is, there doesn't seem to be anything odd about watching a documentary about a man who befriends and finds his life's purpose once more in the form of a friendship with a wild octopus.In what has to be one of the stranger documentaries to come our way in recent memories, Netflix's My Octopus Teacher is a quite literal title for its original release as directors Pippa Ehrlich and James Reed explore the intriguing mid-life crisis of fellow filmmaker and South African based nature lover Craig Foster whose chance encounter upon an octopus on one of his daily swims set him on a path of self-discovery and reawakening as he dedicates himself to studying and building a bond with this wild creature.At just over 80 minutes in length, Teacher draws about as much narrative juice as it can out of its rather confined and linear subject matters with the film broken down exclusively to Craig Foster narrating the story and his lessons from his kitchen table while footage he shot of his experiences making up a bulk of the action and while the film is no doubt hamstrung in parts by how much you can get out of such a true life story, there's also little doubt that the film features a number of heart warming moments as well as some incredible action shots of one of the worlds most misunderstood creatures.You don't run into many casual fans of the Octopus, an alien like creature that many discount as creepy critter from the deep but Teacher showcases a whole different side to the incredibly smart animal that seems to gain mutual benefit from its interaction with Foster and strikes up an undeniable bond with the likeable gentle giant as the two become more comfortable in each others presence and learn from each other as they spend more and more time together.It's unlikely that you walk away from Teacher with any lifelong lessons but if your going through a tough period, a tough day or just want to feel the love a little this is the perfect film to remedy those situations and a game-changer for any Octopus naysayers out there.Final Say -A simple yet effective documentary, My Octopus Teacher is the type of film you never knew would exist or perhaps didn't know you needed but its simple tale of friendship and acceptance makes for worthy viewing.3 shell shields out of 5"}, {"id": 344, "text": "This is a brilliant and empathic documentary about a man who finds an octopus off the shore of his family home. He is a diver and adventurer who documents his travels, so he naturally starts to document the female octopus he finds in the kelp forest along the shore.This is real life. He doesn't know much about octopuses but for over 324 days, every day, he travels out in to the water to document the life of this one female octopus.The change in his way of thinking, the way he views life, his transformation is shattering. His previous preconceived opinions and assumptions are destroyed by learning from the octopus which he finds has a very high intelligence. He is about to witness events which no other person had ever documented previously. He is shocked to learn so much from a creature which he thought was lesser being.I dislike having to say this, but if you do not find this documentary interesting, you are not empathic. The ending is so real and filled with emotion.This is in my top five for documentaries, of all time."}, {"id": 345, "text": "Wow, how to start! This is by far one of the most incredibly well crafted, scripted and emotive underwater documentaries I have ever seen. This tender little film, shot in just a small plot of kelp-covered-bottom in any odd place of Mother Earth around South Africa, at least not precisely in what we understand as a scuba diver's paradise, tells us so much about how the sea is source of all life and how is never too late to approach our origins with the right mentality, accepting that we are not mere onlookers but active participants. This story teaches us that there are still unusual ways to read something that is forgotten but that we carry inside, communicating with other forms of life as part of a very big organism in a perfectly balanced environment that took billions of years to forge.The stubborn will of this man, diving everyday in the cold to meet this modest and yet so smart creature reminds me of the good old years of Ives Cousteau and the passion he instilled in us for the sea, the great unknown.If you are one of those lucky people who grew up diving and still feel that you belong down there then you'll appreciate each and every second of this little gem."}, {"id": 346, "text": "This was literally the most stunning documentary I have ever had the pleasure to watch. My girlfriend had broken up with me because I kinda cheated on her or whatever and I was in a really emotional state. I went to her house to try to win her over but long story short we had agreed to spend this day together and say our goodbyes forever. She put on Netflix and she randomly picked this documentary (usually I pick what we watch but I let her pick cuz I didn't care what I watched I was just happy to be there). We had some acid that we had been holding on to for a special occasion and we took it a few hours before we put on Netflix. In my very emotional state of mind I started to watch this and I must say, it was a very soothing and comforting experience, and toward the end of the movie I almost felt a sense of relief, and I actually felt okay with having a new beginning in my life. This movie is literally about a guy following an octopus around for years, but Jesus Christ it's so relatable in so many ways. If you're going through anything, this will help you accept that everything ends at some point, and you may even feel a sense of relief take over. At least this was my experience."}, {"id": 347, "text": "This is an awesome &amp; one of a kind documentary about love &amp; connection between man and an octopus. A very gentle and heartwarming film that after watching you may realize a deep connection &amp; care to every living being in the world. It is a modern version of the man and the fox in the story of The Little Prince. This is a new perspective in knowing a wild octopus beyond her being a sea creature.I am so much interested in the Behind the Scene. I am so curious on how the filmmaker managed to have a wide coverage of the wildlife story especially the chasing scene between prey &amp; predators. The editing is almost seamless. Plus, it is very cinematic. The tone is very gentle &amp; peaceful just like being under water.I am inspired by the patient &amp; dedication of the filmmaker/diver in documenting their journey &amp; relationship at the deep of the sea in more than 300 days (everyday).This is a story of sacrifice, of friendship &amp; of love. This is a lesson of life. This is a meditation on the purpose &amp; significance of life.We are all part of the world &amp; not a visitor of any place."}, {"id": 348, "text": "This unusual documentary is about a man who befriends - to the extent possible outside of a Disney cartoon - a little octopus, and obsessively observes it through its life cycle.The underwater cinematography is just stunning, beautifully conveying a remarkable world of infinite color and variety.The movie manages to make us care a lot about this octopus, and the moments when it is in danger or sick are remarkably suspenseful. It's a movie that sucks you in.The one thing I didn't care for as much is the human protagonist. But this may not be fair. His narration is full of long pauses that make him seem ponderous and maybe pretentious, but it's hard to know if those are *his* pauses or the editor's pauses. Anyway, I got used it.Terrific movie you should definitely watch."}, {"id": 349, "text": "We are in a year (2020) where we face SUCH division among humans that we are at a loss. Empathy, love, kindness, generosity. They are sorely lacking during this god awful year.What this gem of a movie does is takes us away from it all and feeds our senses. The soundtrack is so soothing and beautiful. The visuals are absolutely incredible. The host has the most soothing voice and his documentary could never have been narrated by anyone else. But then there's this creature and we all fall in love with her.We all know how intelligent octopi are. This is no surprise. We've seen those videos where they manage to escape traps purposely set up to test their intelligence. But to watch the relationship, the awe, the love from a human who is going through some Deep Stuff, and to hear him tell how this little friend, that she changed him and she healed his soul.This is magic."}, {"id": 350, "text": "A lot of people say an octopus is like an alien. But the strange thing is, as you get closer to them, you realize that we're very similar in a lot of ways. Craig Foster, Founder of Sea Change ProjectA lot of people come to an undersea doc caring mainly for the spectacular cinemaphotography. Not so much here because the Netflix original, My Octopus Teacher, is all about the relationship between an invertebrate and a man--the photography helps rather than dominates.Herman Melville could have learned a thing or two from narrator and diver Craig Foster, whose gentle delivery draws you in the way his octopus love does. Melville could have minimized most of his delivery, whereas Foster and co-writer James Reed gently tell us about this lovely miniature wonder and her world in the simplest, most lyrical way.She soothes us with her daily routine (Foster spends almost a year observing her without scuba tank (a year is the lifespan of the Octopus). She coyly draws him in like a lover. If you have your Octopus knowledge only from Jules Verne, you be astonished how small she is and loving-at one point, Foster caresses her, revealing how small she is, and vulnerable. Yet, she trusts him as well she should. See this masterpiece just to witness him lovingly holding her.Foster adheres to the Star-Trek non-intervention mandate and watches how his beloved aqua woman is pursued by a hungry shark. Drama ensues with a slow-burning suspense most horror films would love to have.You are likely to experience the mental cleansing the narrator did as he lost his depression, connected with his son, and found his place in the natural world, and thus the human world, while he became more intimate with her and her small world:What she taught me was to feel... that you're part of this place, not a visitor. That's a huge difference. Foster"}, {"id": 351, "text": "What a great surprise!So many nice things about this documentary. First, it was built in a way you dive together with the narrator not only into the sea, but in his life, in the way he is thinking and how he is interpreting everything he is discoverying.From the homemade look to the steps you go with him together, day by day, discovering the life all around in such a fascinarting way.It definetely creates a strong connection between you, watching, the narrator, discovering, and the nature, so beatiful and perfect...And, to all the team envolved in this, just would like to say Thanks! You guys made a rich piece of art and a wolrd full of empty stuff."}, {"id": 352, "text": "My Octopus Teacher review My rating - 9/10 If you only watch one documentary this year I recommend that you to watch this one. It's beautifully filmed the undersea ocean filming is stunning it's like visiting another planet that tragically we're destroying with our rubbish. This vital world of coral reefs kelp forests where magnificent creatures sea creatures like the octopus inhabit. My Octopus Teacher is a 2020 Netflix Original documentary film directed by Pippa Ehrlich and James Reed. It stars only 2 characters Craig Foster a diver who also produced the film and an unnamed Octopus . The film captures a year Foster spent with a wild common octopus. Foster followed the octopus for most of the octopus's life. Craig Foster Director, and Producer and underwater diver filmed My Octopus teacher off the Southern most tip of the African coast in 2010 looking for answers to his mid life What's it all About  crisis. Craig Foster was diving, bare-chested, in bitterly cold waters off the southern-most tip of Africa when he saw her -- an octopus hiding under a cloak of shells and stones. Enchanted, by this magical under sea world in the giant kelp forests where he first comes into contact with the subject of this wonderful story a wild common female octopus . He began following this incredibly shy creature, trying to prove he wasn't a predator by staying very still in her presence. For weeks she evaded him: hiding in her den, camouflaging herself, or pushing her liquid body into the nearest crack to escape. And then, after 26 days of near obsessive wooing, she reached out and touched him. It reminded me of that moment in Steven Spielberg's E.T. but this moment is more emotional because it's real and rare ,two creatures totally alien to each other suppressing their fears of the unknown and trying to connect and learn from each other. One of my favourite parts of the film is Craig diving with his son and passing on his experience to his son as their relationship is mended by the fathers interactions with the Octopus that changes their lives. This is very special movie making and 1hour 25 minutes of bliss . The feature Documentary by Craig Foster,Pippa Erlich and James Reed is a must see ,it's beautiful ,it's emotional and the message is subtle it doesn't preach but it does enlighten and teach us that our animal and sea creatures are one of our most precious assets on earth and must be understood and protected."}, {"id": 353, "text": "Stumbled upon this doc, on Netflix. When I'm feeling a certain way (ie-stoned immaculate), I love putting on nature docs, and melting into my couch.There's something fascinating about life under water, and there's such an innocent curiosity to the human protagonist, that it really envelops the viewer in the surrounding environment. The cinematography is absolutely stunning, as well.Granted the edibles were pretty great, but once the interactions with the octopus began, I was fully immersed in this story.There were moments where I had tears streaming down my face. The beauty and the finite aspect to this world-both above and below the water, become glaringly apparent. At one point, I thought I was suffering an existential crisis, lol. There are many parallels to draw, from a life lived beneath the surface.Highly recommended to those who enjoy nature docs, personal stories of rebirth and edibles*.*optional, of course"}], "reviews_amount": 354}