{"name": "The Call", "titleId": "tt12971924", "reviews": [{"id": 0, "text": "Whoever rated this film a 10 was obviously paid to do so. Easily the worst movie I've seen in theaters. Hands down. No plot. Horrible acting. Absolutely horrid !!!!!"}, {"id": 1, "text": "Oh wow...like any horror fan I was really rooting for this one, with Mr Saw Tobin Bell and Mrs Insidious Lyn Shae, both in the same movie how could you go wrong? The script is the worse piece of garbage that ever existed. The only good thing about this movie is Lyn Shae's acting and she's not onscreen very much. Sadly, this was/is a terrible movie."}, {"id": 2, "text": "Besides a few creepy bits with Lin Shaye, the movie was pretty crap. No real story and boring."}, {"id": 3, "text": "Speaking slowly and having long pauses between sentences is not suspenseful or scary.The stupid make up is not scary.The ridiculous script, now that was scary. How someone thought that nonsense up and how it held a 6.9 rating at the time of my post is scary.The movie felt like it went for 400 hours, no exaggeration.Please avoid"}, {"id": 4, "text": "This seemed like a low budget Netflix movie with two known actors they hired in order to get more views. Not scary at all. Seemed like a bad teen movie. The ending was terrible."}, {"id": 5, "text": "If you are into loud, weird, not at all scary scary movies this is what you should watch. But if you want to watch an actual scary movie I would skip this one.The story was odd, to say the least. Why was it set in the 80's?!? That added nothing to it, but bad fashion choices. The whole storyline was pointless, as you found out in the end.The main character kills her own sister, blames an old lady, and gets away with it. Somehow this ruins the old lady's life and makes her evil and a witch? What bad police work! She literally kills her sister and dumps her and her bike in a creek with a path and no one ever finds her?What was the point of the Carnival? On going theme in the movie that is never explained. I thought it was going to be that her sister was killed there or something. But no!Also, parts of the movie were super blurry and dark. It was also super loud but that could had been the theatre's fault. Tons of pointless screaming. So I would skip this movie, but that is just my opinion."}, {"id": 6, "text": "Had to write a review for this, plz dont waste your time on this, yes the dude from Saw as is the creepy old lady from Insidious but thats just about it. The story sucks, direction is horrible and you will be stuck in meaningless moments which last for 10 minutes.Do yourself a favor and avoid it."}, {"id": 7, "text": "Whoever rated this film a 10 was obviously paid to do so. Easily the worst movie I've seen in theaters. Hands down. No plot. Horrible acting. Absolutely horrid !!!!!"}, {"id": 8, "text": "This movie couldn't be less interesting. It's so painful to sit through. I'm so glad I watched it at home and not in a theater."}, {"id": 9, "text": "This movie is one of the worst directed, worst written, and worst acted horror movies I have seen in awhile. Just skip it and find anything else. The ending, if u can even call it that, makes no sense, basically the movie just stops."}, {"id": 10, "text": "I watched it with my grown up kids (16 and 17 years) and after 30' I thought it will go in the good direction, but not. After the kids went into the house, to make the call it became worse. Bad acting, a lot of screaming, you see what the father of the 2 boys did to them when they were little but further no explanation, did they got to the back door or not. Zombie stuff.... The older sister killed her young sister but nobody find her body by just throwing it from the bridge ?? Nor her bike. Not worth to watch it !!"}, {"id": 11, "text": "There is no back story why the phone works or why the old lady is a ghost or whatever. They could of easily just show us that she was a witch or something. So there is magic phone and the ghost old lady that shows your past somehow and torments and kill you. ok? The best part was probably the new kid didn't do anything or know anything but the old lady killed him too? 1 star for visuals and 1 star for acting."}, {"id": 12, "text": "Really I was very choked with the story... how Lin shaye make this movie and this bad story I was expected more better film At least you can't know what they want to say Or what the director message"}, {"id": 13, "text": "Marked the horror branch called teenage horror in the 80's and 90's. some pranky loosers a girl and a newbie, harras their old neighbours to death, .how will this death affect the young ones, will there be a spiritual revenge.?well the playbook are already written for these storie, a mumbo jumbo of deranged mind and scary sounds and music, and staged and makeed up with demonish artifacts in a dark space so dark at times youll have to guess what happens and there arent any new stuff on the frontier, so voltage et co has flopped again.i guess it may scare some people like my wife and other superstitious people, but not the average horror fan.its morbid thinks the grumpy old man, a 3 will tell."}, {"id": 14, "text": "This started out okay and had me watching happily for 30 minutes thinking it was going to get good. I turned the trailer off because what I saw was enough to make me want to watch the film spoiler free. I kind of wish I stuck with the trailer and left it at that.Lin Shaye was great, but she usually is. Tobin Bell was.... Tobin Bell. When he made the initial phone call to the teenager I thought I had slipped into Saw for a moment. Might have been a better idea to try and do a different voice as opposed to remind me of what a fun horror film is actually about.Not entirely sure why this needed to be set in the 80s but, there you go. The cinematography was okay until it got to the part in the dream world (when they get stuck in the call). From here it got very red and dark with the same music going over and over. Clearly the director / writer / whatever is a fan of Nightmare On Elm Street (but without the talent of Wes Craven or subsequent people who got onboard to write / direct and produce those films... even the poor ones).Each teenager has a secret / nightmare to hide, each has their turn to face it. From here on in it gets confusing and just downright ridiculous with one of the worst endings I have seen for a long time.The only reason I gave it 2 stars was for Lin who, I guess, needed the money or owed the team behind this rubbish a favour. A shame, it had potential."}, {"id": 15, "text": "Great god, what was my wife thinking? She saw this trailer and showed me it. Sadly, I was on board. I never saw any of the Saw movies, but I recognized him from the movies as I did the old woman who played in the Insidious movies...huh. Two great horror actors playing in the same movie. How bad could it be? Dear god. The only thing that made me watch this garbage was that it was set back in the 80's...my teen years. The acting was okay and the kids really did deserve what they got and I know that horror movies rarely end happily, but this movie actually had me hoping for a rescue...a point where I face my past and I get to live. Unfortunately, it did not happen this way. I really hope you avoid this waste of time. It sucks. Peace."}, {"id": 16, "text": "Way too slow for 2020 horror movie! Retro style was OK but everyone seems bored just wait for the next scene so they can keep their flat full performance till the end. Nothing scary at all."}, {"id": 17, "text": "I liked the setting in the 80s. The characters were well cast, unfortunately they couldn't tear out the tired script. The plot was simple, but it took half an hour to get to the call. The carnival at the beginning, which later also plays a model role in the house, was completely out of place. It was not needed and only dragged the whole thing out. I guess after IT and similar movies carnivals are considered scary. The equipment of the house was confusing. Why the hell did this old couple have so many skulls, demon sculptures and the like standing around? If I understood the time of action correctly, maybe three years have passed since the girl's death and the present time. Before that it was a daycare for small children. Where did all these sinister things come from in such a short time? Of course it underlined the claim that the old woman was a witch, but it was meaningless. The sequences in the in-between world were mediocre and not really scary. A little blood in the face and some scars with make-up on them didn't really make it scary. The end of the movie was outrageous and crowned it all. The question still remains why the old lady felt so much hate for the newcomer. He was the only one who didn't throw any stones. So why call him twice to tie him up after he escaped the first time? I like Lin Shaye, she did a good acting job here too. Unfortunately she dies quite early and in between she only appears as a zombie. All in all time wasted."}, {"id": 18, "text": "No plot, not scary. No interesting characters. Just... don't."}, {"id": 19, "text": "Do yourself a favor, don't watch. There's no creativity, no scares, no real horror besides the presence of our Jigsaw's star and his Insidious's wife. Seriously, whoever made this movie might know how to operate a camera but can't disguise his/her lack of horror moviemaking skills. I wish i hadn't wasted my time on this movie. Actually, I very rarely take the time to write a review, if any, so you may guess how much lower than one star this movie deserves for a rating."}, {"id": 20, "text": "It should be a crime to get paid to bump up the star rating on a movie, like some of these reviewers have. Terrible script, very average acting (even the extras in the background of the carnival scene couldn't do a convincing job). DO NOT WASTE YOUR TIME!!!!!"}, {"id": 21, "text": "I watched this hoping it would be a good horror film. Wrong! It really fell flat early in the film. The acting by the teens was so plastic and was right out of the 80's. It was disappointing! Too bad because it seemed to have potential."}, {"id": 22, "text": "I am not young and I have never seen such a boring movie with the worst actors, dull, no acting, no script, no plot and nothing!Such a waste of time, I was fast forwarding during the whole time till I just closed it without watching the end, everything was so predictable and even my expectations were better!The same scene was repeated over and over and over, BORING!!! The only good thing about that movie is that I am writing a review for the 1st time because I am so damn angry!"}, {"id": 23, "text": "Don't listen to the previous review it was a decent enough film to keep you entertained I've seen alot worse"}, {"id": 24, "text": "Don't read the critics reviews! People who write about movies are critics. They are there to look for cinematography, does the story seem true, how could the director have done better, what they should've been filmed, the actors performance, and all that other crap. I am not interested in that; I'm interested in what people, like you and me, have to say about the film. The ones who truly enjoy horror films are the ones that make the best conclusions about whether this is enjoyable to see and if it will scare you. I am one of those people (I'm not a critic) who enjoyed the film completely. It scared me and I thoroughly enjoyed the time I spent watching the entire story play itself in front of me. A dark, sad story reminds of the you of the hateful &amp; spiteful people you always wished &amp; hoped got what they really deserved."}, {"id": 25, "text": "This film isn't too bad. It is not a horror gore fest, and it is more about the story of the characters than anything else.The acting is good, and the production (a la 1980s theme) is well executed.The ending is a bit weak, otherwise it is a reasonable watch."}, {"id": 26, "text": "I recommend you skip this one.This was an interesting idea. Pick up the phone and get sucked into your worst nightmares. Unfortunately this movie seemed less concern with plot and more with scoring maximum points on Horror Movie Bingo -well known horror actors -said actors doing something obviously reminiscent of their famous role -haunted lady doing crab walk -house using candles instead of electricity -characters making dumb choices -magically opening, closing, and sealing doors. The most impressive one was the front door boarded up - the characters were within earshot of it the entire time -screaming ghost lady in veil -creepy child saying, I kid you not, come play with me -carnivals (strangely, no obligatory clown) -monsters under the bed -you get out of the nightmare the same way you came in -bully (who is the softest bully in movie history) is that way because he was abused by his dadBeyond the heavy reliance on cliches, some of the plot was poorly edited (we are told the same story about who mrs. Cranston is, twice) or pointless (a fortune teller is introduced and never mentioned again). I also thought the acting was lame. The main character sees his girlfriend died in a car accident and just kind of...jogs over, sees her dead body, and just breathes heavily. No screaming, crying, trying to check her pulse, etc."}, {"id": 27, "text": "Christopher Michael Mitchell (Chester Rushing ) is the new kid in town. The real reason for the move is revealed late. Chris meets Tonya (Erin Sanders ) who he follows around because he is a male and she is not. They also hang out with Zack (Mike Manning) and his side kick brother Brett (Sloane Morgan Siegel ). They believe Edith Cranston (Lin Shaye) was responsible for the death of Tonya's sister a few years ago. They decide to throw stones at her house, again. Chris goes with but does not play. Lin Shaye kills herself and leaves the four kids money. All they have to do is stay on the phone for a minute, a phone at the end of a dimly lit hall.The film takes place in 1987 because cell phones have screwed up the genre. I liked the horror aspect of it. While not unique, it was freshly done and with Lin Shaye. I could not imagine a person more fitting for the role. I need her on my answering machine.Guide: F-word. No sex or nudity."}, {"id": 28, "text": "I do not recommend to watch this movie if you will buy this movie then you are just wasting your money not worth watching"}, {"id": 29, "text": "Horrible movie. Don't waste your time watching it like i did."}, {"id": 30, "text": "This film start with two school friends(Chris, and Tonya) talking to each other, and Chris back to his house having conversation with his mother scene! As turnout, this film is about an old woman Edith taking revenge on a group of friends(Chris, Tonya, Zack, and Brett), who accuse Edith murder Tonya's sister Laura, by luring them to play the calling game, and eventually bring them to the underworld to kill them! Entire film full of boring conversation, and super annoying overuse scene! Such as, overuse of the jump scare scene, overuse the calling names scene, overuse of the taking off the belt scene, overuse of the arguing scene, and overuse of the walking scene! Make the film unwatchable! Barely intense scene is, Chris shot at Edith's husband Edward to kill him! At the end, Chris asking Edith what she want? She say Vengeance! That's it! Completely wasting time to watch!"}, {"id": 31, "text": "It's apparently a sequel of the name of similar movie before. Again, proof it is so bad for sequel and this is just the worst kind. No clue what's going on the story but doesn't matter, it's not scary at all."}, {"id": 32, "text": "I promise you that you will regret the time you spent watching this. It's a terrible film, zero scares and zero entertainment. Avoid."}, {"id": 33, "text": "I've never been into horror movies. This one was an exception. It was more psychological than gory, and the issues it presented were very relatable. Good acting and a lot of heart."}, {"id": 34, "text": "Story was silly and cheesy. Acting was flawed. But the horror was there and it got intense at some times.I just hate it when they add this so called scary music; it's rather funny."}, {"id": 35, "text": "Horror movie. The cast combines a strong duo of Lin Shaye of the Insidious movies and Tobin Bell of the SAW movies in an interesting metaphysical horror movie. Unfortunately, they take a secondary role in the movie, while the main protagonists are young actors, which are not much experienced yet, not bad, but not top ones yet either. But quite good overall, with an unexpected twist at the end about who is the real bad guy in the whole story that started all these years, and generally a nice suggestion for all fans of the genre. But quite good overall, with an unexpected twist at the end about who is the real bad guy in the whole story that started all these years, and generally a nice suggestion for all fans of the genre."}, {"id": 36, "text": "Very simple. I love the story. I wish they will make a movie like this again. I don't know why people always want a high cost, extravaganza films but when you saw all of those past horror story films are almost the same! It just about on how you appreciate simple things and expensive things. I don't know why people always want A HIGH COST, A HIGH BUDGET but when you compared it to a low class movies are all the same! I don't know WHY HOW STUPID PEOPLE are surrounding in this WORLD, they ALWAYS WANT SOMETHING EXPENSIVE, VERY CREATIVE, VERY DECORATED. It's not about the BRAND OR WHATEVER! It's about the Actors and on HOW YOU UNDERSTAND, APPRECIATE THE FILM THAT YOU'RE WATCHING! If you always complained in your life and in this movie; I think you're the problem in this WORLD SOCIETY, because you're ridiculous and very discriminated at all. You seems always wrongs rather than seeing the GOOD ONE! Bit__!"}, {"id": 37, "text": "Loved it! Great actors and a superb storyline if your into the horror genre. Watch it"}, {"id": 38, "text": "Tobin Bell made this movie. Loved all his scenes with Lin Shaye."}, {"id": 39, "text": "I was reminded more of a Japanese horror than what we expect out of Hollywood. Much more about supernatural punishment than gore and guts.Pretty well acted, though I thought getting Tobin Bell was a mistake. I like his acting, but I feel he's so typecast as Jigsaw that it kind of detracts from the premise.I think everyone got what they deserved in the end, though the final act felt a bit rushed. Didn't care for the very final sting, but the movie was kind of refreshing compared to most other horror fare."}, {"id": 40, "text": "A great horror movie with big legends! Do yourself a favor and watch this!"}, {"id": 41, "text": "The film takes a while to develop, but when it does, the atmosphere is scary and suspenseful."}, {"id": 42, "text": "The concept was good.. But the protaganist has a weak mind.. Well, dont watch if you dont like horror movies with bad ending.."}, {"id": 43, "text": "I love it, actors are cool, well just end is not really what I wanted to see."}, {"id": 44, "text": "It's not a bad movie, the plot had promise but unfortunately, there's just not enough scares or gore.. Had this had more gore then it probably would have done better, the cast is good, some horror veterans but the lack of scare or gore means it fails as a horror."}, {"id": 45, "text": "I remebered 80's scary movies, good actors, good effect, good músic and good story.."}, {"id": 46, "text": "Not so good movie to watch very boring movie not too scary but pointless direction and casting is wasted the movie does not show any of true contents."}, {"id": 47, "text": "Totally understand why so many people rated 1 star! It's extremely slow and boring! I can't imagine it ended with a black tongue, and the whole story is just like a joke."}, {"id": 48, "text": "The general idea of the movie could have made for a great movie. Story progress and relevent character development were absent for so much of the movie, and the horror portion of the movie is only the last quarter of the run time."}, {"id": 49, "text": "Gave it a 3 cause of lin shayes great acting. Other than that theres nothing to this movie. Boring, doesnt make sense, just plain bad"}, {"id": 50, "text": "Wow, with 2 juggernauts of horror franchise in Lin Shaye (Insideous) &amp; Tobin Bell (Saw) you would think this would be a success. However, their namesakes are dragged through the mud in this train wrecker of a film.The film circles around a group of teenagers that bullies an elderly woman. Their actions lead to a tragedy... They have an opportunity to come into fortune if they agree to answer a phone call... This sounds weird but it is that basicMy problem with this film is that the scares are not remotely scary at all. Everything that happens can be predicted &amp; the ending is as clichéd as it gets."}, {"id": 51, "text": "Very bad movie. It's for kids only. I regret to saw it."}, {"id": 52, "text": "I'm assuming it was only set in the 80s so they could use a landline telephone? Othwerwise that era was totally pointless. Just like the film. Sounded like it had so much potential especially with a couple of the cast that are in it. It was all just one huge sloppy mess. Finished the film thinking what did I just watch??. Yeah it's that kind of film."}, {"id": 53, "text": "As horror movies fan, I am really sad that I can not give a negative rate for this movie."}, {"id": 54, "text": "This movie is so terrible I felt compelled to create an account just to write my first movie review. Very poor story, poor character building, bad acting and the attempted scares will insult your intelligence. All this with very dark scenery 100% of the time. This movie surely puts a stain on Lyn Shaye and Tobin Bell's acting career legacy."}, {"id": 55, "text": "I wanted so much to like this movie, I'm a huge Lin Shaye fan. Sadly it's not one of her best.Set in the 80s (presumably so they could centre the entire story around calls on a telephone with actual wires) this is simply a 'teens get into trouble after tormenting local old lady' movie. There's nothing new at all. The four teen (yeah right) leads are totally unlikeable, their acting is as wooden as it comes and not even Lin and Tobin Bell can save us from the sheer awfulness.In a nutshell: Three teens befriend a new teen who moves into their town. They are the typical cliche group of horror movie teens. The new weird guy (who seems to have the strangest skin on his face), the flirty girl, the tough guy and his little brother. You don't care about any of them, they're literally awful people. They visit a fair then decide to go and torment an old lady who flirty teen claims killed her little sister in her daycare business (if you don't see the obvious twist then you need better glasses) years earlier. They break the old lady's window, she confronts them and tells them she'll save them a seat in Hell. The old lady then commits suicide after telling her husband that she can no longer stand being blamed for the murder of the child. In the following weeks (could be months, the movie was that boring I was playing a game on my phone) the brats are invited back to the house, hearing that if they manage to endure a one minute phone call they will inherit a share of a small fortune, as instructed in old lady's will.The film then descends into utter stupidity, predictable storyline, typical horror cliches, dreadful dul acting from the teens and 'reveal' that a toddler could have worked out. It's awful. Not worth wasting an hour and a half of your life on. No redeeming features except Shaye's always great acting. Avoid."}, {"id": 56, "text": "Inspite of having horror veterans like Lin Shaye and Tobin Bell, the film is not at all interesting. It aint scary n has a lousy n ridiculous screenplay.Honesty, i got enticed into seeing this cos of the two veterans starring together in a horror film.Firstly the film takes almost 45 mins to pick up n then when the action starts, it gets filled with cliches, traumatized childhood, teenage secret, etc.It has the same lol demon/possessed fella doing hyper extension of the joints but this time the demon/possessed fella looked as if it were doing break dance movements. Why these demons/possessed fellas gotta do unnecessary hyper extention of joints is beyond me. Ther is unnecessary annoying screaming, unnecessary red color n one helluva lousy screenplay. The end is a big wtf."}, {"id": 57, "text": "What the heck is Lin Shay and Tobin Bell doing in this mess - Yes you guessed it, to give it that poster appeal to all the Saw and Insidious fans out there and really is shameful exploitation of us the viewers who will pay for this thinking it is going to be of the same level of cinematic excellence!Exceptionally good actors appearing in sub average nonsense like this; it seems they have joined the Ron Perlman, Lance Henriksen, Nik Cage and John Cusack brigade in the let us just take any old rubbish for a paycheque club - very sad!Do not get me wrong the acting for the main part is good and it had a good build up but the denouement and idea just fizzled like a wet, limp little firecracker. I did love the homage to the 80's with the old style John Carpenter'esque analogue synths in keeping with when the movie was supposed to be set and I didnt see a smartphone or tablet anywhere so they got the setting right and the premise had promise, so where did it all go wrong?Well, for a start there is no real horror, zero scares and crucially the idea behind the call was....well just a telephone call to the dead woman that really did not give us an oooh or an ahhh like movies like Saw or Final Destination did and so just followed the sad old tropes of budget bin horror basket movies of yesteryear and so it fails execrably in every way almost.I am not so harsh as to give it a 1/10 as many of the reviewers have as this means it is the worst movie you have ever seen and we have movies like the Bad Batch with Keanu Reeves for that and many others; the acting is good, it is well filmed and professionally made unlike a lot of the shaky cam, dreadful acting Netflix ordure pouring out of film schools these days, so I give this one a harsh but fair, harsh but fair...4/10 hatchets!"}, {"id": 58, "text": "Initially when I sat down to watch the 2020 movie titled The Call, I must admit that I was sort of having some hopes for the movie, as it had two horror icons on the cast list.Well, as it turned out then the storyline in The Call was definitely interesting enough, if it wasn't actually being original. However, the movie's writer, Patrick Stibbs, just didn't really manage to deliver where it mattered for a horror movie. Sure, I mean, the movie was watchable and sort of entertaining enough, but it just was way too bland and generic for my liking.And yeah, it was because of Tobin Bell and Lin Shaye, two iconic names, faces and voices in the horror genre, that I initially sat down to watch it. And I will say that they both definitely did spruce up the overall enjoyment of the movie.The acting was good for a movie such as this. It wasn't outstanding, but it was adequate enough. Perhaps it was because of the limitations of the script and the directorial hand of Timothy Woodward Jr. that sort of restrained the performers to fully give what they had.Visually, for a horror movie, then The Call just didn't deliver. I mean, the atmosphere in the house was interesting and lots of nice details to the house, but the otherworldly sequences were just too flaccid, and didn't really feel like being scenes of personal hell and anguish enough.The Call is the type of horror movie that came and went without as much as leaving a dent in the horror genre. I mean, I didn't even know about the movie before I had the chance to actually sit down and watch it. And having watched it now, I can honestly say that I highly doubt that I will ever be sitting down to watch The Call a second time.Perhaps if you are a newcomer to the horror genre, then you will find some proper entertainment in The Call, or even some spooky stuff and scenes. But for a seasoned horror veteran such as myself, this was but a stroll in the park.My rating of The Call lands on a very mediocre five out of ten stars."}, {"id": 59, "text": "I'm really glad Lyne Shaye's got a great pension doing these films, but she needs to pick more carefully.The Call is a messy, dragging bore of a film, with a superficially good soundtrack that after about 10 minutes starts to repeat &amp; sound really clumsy &amp; cheap in an attempt to give an 80's Electro vibe.Hasn't the poor old 1980's suffered enough, didn't Strange Things do this to death, let's see clueless styling &amp; makeup from another era now please, enough!After skipping through to an hour, I couldn't face much more of this boorish, drag, as it limped toward its meaningless, thrown together denouement, &amp; was happy when blackened toothed Shaye, finally got no answer!Disconnect your line, you have been warned."}, {"id": 60, "text": "5.5/10Is this movie the worst of 2020! No, is it a masterpiece?! No!Reviews are quite weird for this one, it is true the storyline is basic and seen may times but it was fun enough to keep me on my seat till the end.Pros: Cinematography is beautiful, loved the colour contrast and the aesthetic of it. Creep factor was there and present in every location set. Some of the acting is decent. Story is good enough to keep you entertained for an afternoon.Cons: Some of the actors just need to go back to acting school, makeup of the ghosts sometimes was a bit basic and amateurish. Predictable jumpscares. Rushed ending. And the storyline could be better, it felt this was the first draft of the script tbh.Not worthy to be seen in cinemas so I would suggest for anyone who wants to watch it to wait till it drops on streaming."}], "reviews_amount": 61}