{"name": "Surge", "titleId": "tt12694562", "reviews": [{"id": 0, "text": "Women are powerful and this documentary shows how hard candidates, volunteers, and staffers worked to get women to Congress in 2018. As a staffer in 2018, it made me tired reliving that moment. Ha! A lot of people don't know what goes into political campaigns, and this documentary covered three campaigns beautifully."}, {"id": 1, "text": "Be sure to give it a try for yourself! You will enjoy the movie. I am impressed with the way in which they were able to tie everything together to ensure that the viewer has an understanding of the journey of these 3 aspiring congress people. Please go into this film with an open mind and you will decide from there whether or not it's a worthy film. But I have to say that I did enjoy it and I have recommended it to my friends."}, {"id": 2, "text": "This documentary does an excellent job of illustrating momentum of the last few years and rapidly changing political landscape. Essential viewing for ANY critical thinker."}, {"id": 3, "text": "Every campaign has a story of trials and tribulations. I loved the stories of these three strong women who ran fearless campaigns."}, {"id": 4, "text": "Great documentary! This could not be more timely, it's amazing to hear about these women across America. Thank you for sharing this story!"}, {"id": 5, "text": "Is it a movement or just a moment? The filmmakers let you decide, and the book is still open on that question. Here's hoping that this tale of the 2018 congressional elections sparks more women to run for office. Congress has long been the bastion of old white men beholden to special interests. (Hey, I'm an old white man, and boy, do we need some new blood!) The subtext of the docu is this: Our country needs young, smart, strong, energetic women running for office...and winning. White women. Brown women. Black women. Then, it will be a movement and a much needed one. Thanks to the producers for bringing to life this inspiring and motivating documentary!"}, {"id": 6, "text": "Surge tells the story of the surge in women running for Congress in 2018 by following three women who did so. There are many powerful moments where it actually brought tears to my eyes because it was so moving. This documentary reveals that this surge was more than a moment in history. It was and still is a movement! I highly recommend Surge!"}, {"id": 7, "text": "To answer the question posed, Is this a moment or a movement? one need only look at the results of the 2018 mid-terms. Democratic women won seats at state and national levels unseen before. THIS IS DEFINITELY A MOVEMENT and we are not slowing down! The face of politics is changing, in large part because of the determination of women like those featured in Surge. In the words of the late Supreme Court Justice Ruth Bader Ginsburg, Women belong in all places where decisions are being made.Bravo! to the producers and all the crew involved in the making of this documentary. Excellent work! Expect the surge to continue, America. We will be heard."}, {"id": 8, "text": "Greatest film I've seen this year. Uplifting and inspirational! It's a MUST see"}, {"id": 9, "text": "SURGE is the story of three first-time female Congressional candidates. They ran for office as they no longer recognized the democracy we love, as it was being warped and twisted by the current administration. There is a time to live. A time to die. And a time to FIGHT."}, {"id": 10, "text": "Great movie. Something everyone should watch before casting their ballot this year. All the troll reviews on here prove the point, powerful/independent women threaten the conservative status quo and our key to a brighter future."}, {"id": 11, "text": "I loved 'Surge' to death. Everybody should watch. Totally inspiring."}, {"id": 12, "text": "Surge is the film everyone should watch now. It's relevant, inspiring and more important than ever. 10-stars."}, {"id": 13, "text": "SURGE is a must watch for those who want to understand the truth in politics and how woman are moving the needle."}, {"id": 14, "text": "Great film that follows three hopeful congresswomen. Of course grumpy white men are on here giving one star because... they feel threatened?I wonder how many sat through the film or just were irritated by the trailer. The film was emotionally gripping and was well worth the watch. I also liked that the majority of the crew were female as well. It's about time for women to take the wheel, Jesus is drunk."}, {"id": 15, "text": "Surge is a fabulous film that outlines why we all need to be engaged. Our voice matters. We need to stand behind the people we believe in -women in particular. In the wake of RBGs death, this movie has had a greater impact on me. If you want to make a difference, get involved, ask questions and engage with your local candidates. This is a great documentary sharing the story of 3 communities coming together to support their candidate and make a difference in everyone's future."}, {"id": 16, "text": "Love the story and the energy. After I watched it, I watched it again with my daughters."}, {"id": 17, "text": "An outstanding &amp; moving behind the scenes look at the 2018 political landscape in the US &amp; 3 fierce &amp; talented women who stepped up to run for Congress against the odds. Gratitude to the candidates who permitted the filmmakers access &amp; to the filmmakers who expertly weave together the important stories of these women &amp; their campaigns."}, {"id": 18, "text": "Surge is an inspiring movie about three female candidates for Congress in 2018. Beside the focus on the three women, the documentary also stresses the history of lack of female representation in Congress. A must see for all of us in this country."}, {"id": 19, "text": "SURGE is a portrait of determination and inspiration as 3 political newcomers take on establishment candidates and work tirelessly to make a difference. It shows that, despite the outcome, standing up for change and for what you believe in does matter!"}, {"id": 20, "text": "We all need to see this beautifully-shot, REAL look into what it means to run for office. Amid all the lies and obfuscation by the GOP, here is truth and honesty, from the perspective of four women who put it all on the line to save their communities and their nation. Stream it immediately!"}, {"id": 21, "text": "Amazing film that captures authentic moments on the journeys of three women running for office. It was moving, inspiring, and so beautifully done. Brought me to tears! Incredible timing with the election weeks away. Can't wait to share with as many people as I can."}, {"id": 22, "text": "I watch this with my family and thought it was a great look at what makes campaigns run and the incredible passion it takes to win. Even my picky middle school children loved it.Excellent documentary and very moving! Also it is so timely to understand what goes into a campaign.Highly recommend for families and great for all ages."}, {"id": 23, "text": "Important story that must be told. The challenges faced by women candidates as the work to reshape our democracy Into the vision created by our founding fathers is inspiring.Must watch television"}, {"id": 24, "text": "This documentary was very inspiring showing how determination and perseverance can make a difference."}, {"id": 25, "text": "More race/gender baiting identity politics. Whatever happened to the best PERSON for the job? It doesn't matter anymore."}, {"id": 26, "text": "What a wonderful exploration of what it takes to get to congress and the power of our democracy!"}, {"id": 27, "text": "This movie has been years in the making and not only has foresight but is incredibly accurate. the filmmakers did their homework and this is well worth the This movie has been years in the making and is well worth the watch. Watch with your sons and watch with your daughters. Here's to our democracy!"}, {"id": 28, "text": "White women, handily the largest voting block and ultimate decider of all US elections, casually co-opt black power first to glorify their stunning and brave resistance of the candidate they overwhelmingly voted for."}, {"id": 29, "text": "Watch and learn, times are changing, don't be afriad"}, {"id": 30, "text": "This is such a well-done, inspiring empowering movie that reminds us of how far we have come -- but how much work there is still left to do for women's empowerment, equality and representation in America. We are living in an unprecedented political moment and at a time where we know without question that women's leadership is better not only for women but for all people. Every woman, and every ally of a woman, has an obligation to watch this movie, learn about these women, and make the SURGE of women's candidacy for all levels of elected and corporate office a reality today and forever into the future. The time is NOW and Surge will show us the way -- do not miss this movie!!!!"}, {"id": 31, "text": "Exactly What We Need to Watch Right NowSURGE is a beautiful and inspiring film and exactly what America needs to be watching right now. In this dark and uncertain time, where everyone's anxiety is through the roof, SURGE will leave you feeling empowered and hopeful. It's about saving our democracy and not only the importance of women running for office, but about women getting behind women running for office. I truly loved this film! You'll be crying at the end."}, {"id": 32, "text": "This documentary gives an insider's view of what it takes to run for office. It's sobering, inspirational, thrilling and heartbreaking. A must-see for anyone interested in politics, but particularly anyone who supports electing more women to public office."}, {"id": 33, "text": "40 of the 40 ten star reviews are by new single use accounts using same phrasing. This shows you how much the makers value truth -- they have to shill the reviews."}, {"id": 34, "text": "Surge is an emotional roller coaster, as we cheer on three women taking on the establishment and running for office for the first time. Lauren Underwood, a registered nurse in Illinois who would become the youngest Black women in Congress; Jana Lynne Sanchez, a communications expert who nearly turned her Texan district blue; and Liz Watson, who juggled home life while running a tireless campaign against a rich and corrupt male incumbent. While not all the women win their races, they all win our hearts. Surge also shows us how far women have come in the century since gaining the right to vote, and how far women still have to go. This powerful documentary provides a civics lesson in how campaigns work and will inspire many more women to run for office."}, {"id": 35, "text": "Was so inspired by the women showcased in the film as well as by the filmmakers. It is clear we need more diverse leadership everywhere and no where more than in our government. I was rooting for all 3 candidates in the film so hard. Watching Lauren Underwood campaign with Joe Biden has special meaning now and made clear that watching electeds campaign all the way up and down the tickets is powerful and important. This film is incredibly enjoyable was well as important, loved it."}, {"id": 36, "text": "This documentary is a true template to grassroots candidates. There is no cutting-edge money's pouring in, these women ran because they believed in a better world for their communities.For any young person considering how to engage their voice, this is a great start. And I bet if you reached out to these people, they would be happy to give you a few pointers."}, {"id": 37, "text": "I was rooting for the 3 candidates throughout and was totally engaged. Great storytelling and inspiring - I will rewatch with my 11-year old daughter!"}, {"id": 38, "text": "No matter your political leanings, the inside look at the campaigns of these three female candidates fighting uphill battles is fascinating. The film offers real insights into all that goes into a political campaign. And the stories should inspire girls and women (and any audience member) to become more engaged politically, whether they run for office or not."}, {"id": 39, "text": "Anyone frustrated by US politics should see this to be reminded of what's possible when we activate and engage. Very watchable and well done."}, {"id": 40, "text": "Wonderful documentary highlighting the momentum of women candidates over the last few years... featuring three dedicated candidates. The filmmakers covered the candidate subjects with great care!"}, {"id": 41, "text": "If you want to know how hard these women worked to run their races and what inspired them to run for office, this is a great movie. It follows a few candidates through the entire election cycle and shows what kind of help they had and didn't have. Recommend for anyone who is curious about running for office!"}, {"id": 42, "text": "This film tracks three incredible women in their bids for Congress during the 2018 election cycle. It is an inspiring story of grit, resilience, and the power of the process regardless of the ultimate outcome. I've now watched it twice and would watch it again. It is a film that restores your faith in the democratic process and the value of hard work."}, {"id": 43, "text": "The future is female! Such a needed antidote to our current political climate under Trump."}, {"id": 44, "text": "Surge takes us behind the scenes of three political campaigns of women running for Congress -- the hard work, the passion and emotion, and the results. It's an inspiring look at what was the beginning of what we can hope will be a continued surge of women willing and brave enough to run for office. We can't make change if we're not in the game. The directors -- as well as the candidates -- did a great job at conveying that idea."}, {"id": 45, "text": "Finally, a film that made me feel like I can actually do something about the current political situation! I loved learning about the inner workings of political campaigns"}, {"id": 46, "text": "It is a insightful behind the scenes documentary of women running for congress. I am not knowledgeable or interested in politics, so I didn't get into it."}, {"id": 47, "text": "Surge (2020 release; 90 min.) is a documentary about the surge of women running for office following the shocking election of Trump in the 2016 elections. As the movie opens, we watch footage of the Women's March in January, 2017, a day after Trump is sworn in, in one of the largest marches ever in history. We then go to March 2017, as we are introduced to three Democratic women who are first time candidates for the US House of Representatives, all running against incumbent male Republicans: Jana Sanchez (in suburban Dallas), Lauren Underwood (in suburban Chicago), and Liz Watson (in Bloomington, IN). All three literally start from scratch, with no money and no name recognition. At this point we are 10 min. into the film.Couple of comments: this documentary is a labor of love from co-directors and producers Hannah Rosenzweig and Wendy Sachs. They spend 20 months on the road with these three candidates, and condense it into an hour and a half for our viewing pleasure. I admit I have never heard of any of these three candidates before seeing this film, and of course one of the things that make this enjoyable to watch is to see how it all would turn out (I predicted the correct outcome for two of the three candidates--no worries, I will not spoil). But besides enjoyable, this documentary is equally inspiring, and not just for women (to take solace that they can do this), but equally for men like myself who are tired of the current political landscape where Dear Leader in the White House sets the despicable tone for everyone else and furthermore is interested in only one thing: me! me! ME! Meanwhile Surge is not a 10/10 movie (like some many here rate it), nor is it a 1/10 movie (do you want to guess who rated this 1/10?), but somewhere in between. I rate it a solid 7/10.Surge premiered in September on Showtime and is now available on SHO On Demand (where I caught it recently) and other streaming services. If you are interested in the role of women in politics, or are simply wanting to be inspired by what these three candidates take on, I'd readily suggest you check this out and draw your own conclusion."}], "reviews_amount": 48}