{"name": "C U Soon", "titleId": "tt12677092", "reviews": [{"id": 0, "text": "The story is simply awesome, 97 mins will be your's worth watching for this movie. Fahadh Faasil gets the breakthrough of this thriller, mysterious and puzzled plot which involves the audience so depply into it. Director and producer's have made a good use of OTT platform and gave their best to convey the message to the viewers. Malayalam industry has tried something out of the box to present the whole plot in a virtual reality way and I believe they have been successful in doing this. Can't wait for the theatrical release.Ps: Please don't judge this movie by watching trailer, just directly watch this movie. That's why i didn't reveal the story."}, {"id": 1, "text": "Don't miss it..now switching to Malayalam cinema for sure"}, {"id": 2, "text": "This film is just an outstanding,perfect mystery thriller.One of the best movie in online platform.Fahad,Roshan and Darshana have done it really really well and their acting was just phenomenal.The plot,the concept,the directional wise was over the top.Probably this film will go on to international film fest.Hats off to the team of C U soon"}, {"id": 3, "text": "Everytime Malayalam film industry is proving why they are the best film industry right now. Hats off to them for creating such types of gems again and again. It's editing, BGM, screenplay are just extraordinary. What to say about acting when the names of Fahadh Faasil and Roshan Mathew are there. Darshana Rajendran also gives a very impactful performance. Rather than giving excuse of budget, every Film industry should learn from Malayalam Film Industry. Can be called better than 2018 film Searching, because the whole shooting of the film is done on this pandemic situation."}, {"id": 4, "text": "The movie directed and edited very nicely so that it will hold you for the entire duration.Movie is very gripping and well acted.Editor has done a fabulous job. Dont miss it."}, {"id": 5, "text": "I have created an account in IMDB just to write about this movie. It is an extra-ordinary movie siting a serious issue. This movie is a magic. I am not pointing out anyone specific here. But they just nailed it man. A must watch movie."}, {"id": 6, "text": "Never thought it would be so interesting to witness a movie which is shot just on an iphone and that too completely online.. Fahadh, Roshan and Darshana truly stole the show.. It's the actors and actresses which makes a movie thrilling not the equipments.... 🖤"}, {"id": 7, "text": "Great movie, shot in a very different way. Fahad nailed it.... great work guys"}, {"id": 8, "text": "Just watched it on Amazon Prime on the 'Thiruvonam' day from Denver, Colorado. Quite frankly it was so hard to switch off 'Searching' expectation. But, as the movie progressed , it got me glued to my seat and switch off that other movie's 'screenplay'. The story is very good (not perfect for the small plot holes etc) and the acting is excellent, starting of course with Fahad and others. PS: Must watch and enjoy the flow of the movie than trying to make sense of the format if you are not used to it. It is an experimental one and I am glad Malayalam movie industry jumped at it. MG"}, {"id": 9, "text": "Its a movie about vulnerability and survival instincts. Its also about strong women and how their willpower rescues themselves, and fellow humans from predators. It has subtle elements of respecting space, identity, love beyond all conflicts and the need for mutual respect. No over acting. No distractions. A direct reflection of reality, well acted by the director and his actors and equally well delivered by the crew behind. I tell you, none of your predictions will go right about the story; - primarily because actors of this movie does not seem to be selfish to change scripts for their advantage."}, {"id": 10, "text": "Watched the movie in amazon prime. Running time around 1 hour 38 minutes.Story is good as well as the direction. Roshan, Fahad and Darsana were awesome.It's a movie where we have to pay full attention. There were some things which were confusing and wasn't explained in the movie.Climax is something very different and movie conveys a socially relevant message.Verdict - Watch"}, {"id": 11, "text": "At this time, where cinemas are closed and people are left watching ott films old, new or from various languages and few makers are dumping their completed projects which were meant for theatrical release to ott clearly because they weren't confident enough whether it will receive well theatrically, comes fahad and mahesh narayanan with an original product made for ott completely shot during lockdown in an iphone. C u soon comes with many expectations and delivers it right. C u soon has a good story, gripping screenplay, superb performances from the 3 leads and brilliant virtual cinematography. The negative, I felt was that there are too much of video calling between characters which I found unrealistic because in real life people only go for video calling is for lengthy and casual conversations, one which people from abroad do with their loved ones. On the whole, c u soon is a must watch to see that how efficient malayalam cinema can be."}, {"id": 12, "text": "This movie was shot on an iphone during the pandemic, I find it very hard to believe because this movie is so beautiful. Hats off to the editor of this movie, he/she deserves an oscar for sure. Brilliantly paced movie, genius editing, almost made me forget the real message of the movie. Why are not more people talking about this movie ?"}, {"id": 13, "text": "Another GEM for the malayalam industry. The amount of bravery needed to venture into this untrodden terrain of film and making it a hit is EXTREMELY COMMENDABLE. The ACTING WAS AUTHENTIC AND RAW and each character was superbly portrayed by each actor but Darshana's performance in particular was top-notch. I felt almost like a character in the script due to the unique style that the film was shot in. I would recommend everyone to watch this not only to witness the CREATIVITY and UNIQUENESS of this film but also because it imparts a good message about the BENEFITS &amp; DANGERS OF SOCIAL MEDIA."}, {"id": 14, "text": "Malayalam film industry is evolving and this one is a great example. Wonderfully visualised movie. The first half was so gripping and second half was emotional. Performances were amazing. I often felt like I was a part of the movie and the characters were people I know. It's very engaging. Thanks for the experience."}, {"id": 15, "text": "I can't call C U Soon an original because this movie has a lot things similar with the Hollywood movie Searching which was superb. Still this is an original Malayalam movie and I love Malayalam directors trying out different experiments and coming off successfully. C U Soon has it's problems in script but still it makes us glued to the screen all the time. The performances were all good with Fahadh coming off top. This movie could have been better with a better script. I liked the movie with all it's traits and I recommend this to everyone to witness how Malayalam movies are game changer and one of the best movie industries in the world."}, {"id": 16, "text": "This will definitely bring big change in the way films are being made. Absolutely relevant theme and the whole team has performed excellently."}, {"id": 17, "text": "While watching this film it makes us fell thrilled . This film is good , it started from tinder to google duo, this film was good idea by fahad fassil and all other actors including Roshan mathew (jimmy kurian) and Darshana rajendran (Anu mol) had done best until the climax the secretes of of Anu makes us fell thrilled Finally I say its a best film after Dil bechara in this Lockdown"}, {"id": 18, "text": "I am a fan of Fahad . He mesmerises the audience with his brilliant acting. This movie has proved once again how brilliant he is.He has produced this movie and it's a good pic on OTT.The direction was brilliant and with a small thin story line he made us to sit before the TV for 90 minutes at a stretch. It is a must watch for all movie lovers..!!!"}, {"id": 19, "text": "It can so perfectly be called the movie of the generation. Fahad...man who can deliver emotions to the audience with ease.. spectacular performance. The movie holds us in its grip throughout its length. Hats off to the editing which does play a very valuable role in this picture!! Totally, a very different yet successful approach in the making. Kudos to the entire team!!! Well done!"}, {"id": 20, "text": "Without giving away too much content. I really enjoyed the movie on Prime. It is even better than Searching. Because we see much more videos with people and not only internet stuff. And more people paticipate in it. I was impressed by the storyline.I am Dutch, but i love foreign language movies. This is worth the watch!"}, {"id": 21, "text": "Was a bit sceptical when i watched the trailer . But the movie blow me off with the suspense and thriller. It is well shot and keeps you engaged throughout the story. Nice direction and the utilisation of the resources is just next level. Great idea and thinking behind it ."}, {"id": 22, "text": "What was surprising was, I was totally involved in the movie, without realising that I am using all my senses at once, reading, hearing, seeing and understanding. The storytelling was brilliant, the entire plot, the backgrounds of the characters, their emotions, their personalities were presented through the chat messages and their expressions as they were communicating through virtual medium. One of the best movies I saw recently, and equally proud of the crew to come up with this brilliant movie during the pandemic locked down when the entire world is at a standstill...."}, {"id": 23, "text": "First I thought it was fans spamming 10/10. But I was wrong. Please watch this movie. Worth it."}, {"id": 24, "text": "It's up to hollywood level . Short and interesting."}, {"id": 25, "text": "The sheer brilliance of this movie is the time during which it is shot. Due to covid pandemic when you are short of resources comming up with this kind of movie is a mater stroke. Surely if you have watched the english movie Searching you can see from where the movie making was inspired. However it's still quite captivating and interesting movie"}, {"id": 26, "text": "First of all congratulations for the successful experimental film. I never thought people would welcome this new type of film with this much fervour. The story was very engaging and fun ! Expecting the part 2 to be even better. All the best !"}, {"id": 27, "text": "One of the best film in Indian cinema totally different concept movie is like a video conversation but movie won't bored in single scene... every actor's done his job especially dharshana (anu Sebastian) nailed that role... music keep interesting.. technically very brilliant one the milestone of Indian cinema...very very low budget movie but unpredictable story not big twists but have some good turns in screenplay... totally a finest gripping thriller watchable with friends and family..."}, {"id": 28, "text": "A simple movie but very intelligent way of making during this pandemic situation"}, {"id": 29, "text": "Woow!! A well crafted film! Kudos to as usual Fahadh Faasil And Roshan Maathews. Darshana Rajeendran too have done a wonderful job. All the cast were so perfect Malayalam Film Industry is making us proud day by day. Proud Malayali"}, {"id": 30, "text": "Wow!! A completely unique and natural film.. Another Gem from Fahadh Faasil"}, {"id": 31, "text": "An absolute gem. Nothing like anything. This is India's answer to #Searching . This #FahadhFaasil #RoshanMatthew film is way more than it promises. Creativity at its best. The performances by every actor here is top notch with a story and screenplay that haunts you, stays with you, moves you and thrills you too. This movie has an extra character playing a pivotal role here and that is it's background score. Yes it is a Character here. The score is so perfect and unexpected. This was already a brilliant flick even with a mediocre score but they created a cherry on top. It will surely haunt you afterwards while the score will haunt you during the running time. Must Watch. This is the Indian Cinema I crave for. Felt like a giant leap. I would like to quote #BongJoonHo here Bong Joon Ho: Once you overcome the one inch tall barrier of subtitles, you will be introduced to so many more amazing films."}, {"id": 32, "text": "This movie has a lot of explaining to do. A lot of things that i got to know via comments and explanations on the internet.But these were not shown well in the movie. So most audience will be left with a lot of questions and gaps in what exactly happened towards the end."}, {"id": 33, "text": "A very good movie with good storyline with a very impressive way of conveying its content to viewers.."}, {"id": 34, "text": "One of the best movies of all time. Nice editing, liked the way the title was and crediys were shown. Acting was the best part."}, {"id": 35, "text": "This film is shot in lockdown. Everything seems awesome and also there is this wonderful usage of aspect ratio to differentiate between situations. Script, Acting, direction, lighting, cinematography everything is on point. Also from a budget standpoint, this film comes nowhere close to Bollywood big budget films but such a masterpiece. Budget doesn't matter. Other industries should learn from this film."}, {"id": 36, "text": "Creative Suspense thriller with strong social message. Well developed characters with empathy. Innovative filmmaking during Pandemic lockdown. Hollywood quality filmmaking."}, {"id": 37, "text": "Such a great movie with great content... Brilliant acting by everyone..."}, {"id": 38, "text": "#shotoniphone Production Quality Is Way Too Good Though This Film Is Made Within Few Months"}, {"id": 39, "text": "This is a milestone for malayalam film industry.Such a jaw-dropping thriller taken so beautifully. Engaging the viewer to every minute of the movie is the greatest achievement of the director . The plot is brilliant. Director wisely chose actors who can express a lot through their eyes. Deep dive into the virtual world with true emotions."}, {"id": 40, "text": "A total must watch. Great cinematography and a really gripping thriller without diluting suspense at any point and not a single cliche moment to make it predictable even the story is usual. Fahad n Roshan best cast to convey the emotional tension in the most accurate way without being overdone at all. Really loved it 💯"}, {"id": 41, "text": "An idea many of us might have thought could be done. But then couldn't quite visualize. I wonder whether this would make sense to people who are a generation behind. I didn't find many/ any deliberate attempts to convince. Aimed at a niche audience, Kudos to the film makers. The movie however felt light-hearted which I am not sure a good or bad thing. Should be brilliance, to show it in a non complex way. Actors were perfect. But needed more from the movie. I really wanted more of Saiju Kurupp."}, {"id": 42, "text": "Supercalifragilisticexpialidocious work...one of the best edits and sensational acting from the crew."}, {"id": 43, "text": "Brilliant writing great thriller and what a direction. The concept is so unique. Its at par with hollywood standards. Hatsoff to the entire cast and crew of the film. Faahad faasil and friends awesome job done. I think hindi film industry should learn film making techniques from you guys."}, {"id": 44, "text": "Very nice movie, it been trill watching throughout."}, {"id": 45, "text": "I have no words to describe the movie Simply Must watch movie ever Malyalam movies are best"}, {"id": 46, "text": "This Movie will make a new benchmark in filim making.As usual Malayalam movie made it in a classy way. Each and every character played excellent 👌 Fahad Brilliant again."}, {"id": 47, "text": "When I started to watch the movie , I'm engaged !!! And it was an awesome experience !!!! Dharshana !!! You are such a gem!"}, {"id": 48, "text": "Best use of quarantine virtual direction well made well directed"}, {"id": 49, "text": "Beautiful Beautiful Beautiful...beyond words. Love traverse through Soul and not through some dead skins. Anu's eyes speaks volumes when she speaks peeping through her quilt, as if that moment is her entire life...WoW"}, {"id": 50, "text": "This is a must watch movie, which is highlighting the current issues of online dating and also human trafficking."}, {"id": 51, "text": "A movie that filmed using an iPhone during this pandemic situation reveals some of hidden talent remains in film makers in india..... Just blowed up me on visuals created by the maker..... Definitely it worth watching movie on amazon.... It starts with the trilling situations eventually turned to emotions..... ... Awe"}, {"id": 52, "text": "This has certainly become the golden era of Malayalam Cinema since the 80s and 90s.What a Captivating thriller..Fahadh is on a different level altogether as usual. Roshan proving to be a topnotch critically acclaimed lead with each movies.But what surprised me the most was Darshana!..Wow,what an actress..She deserves to be among the likes of Paravthy,Nimisha etc. With the emergence of Ott platforms,so many people outside kerala is witnessing the underappreciated yet one of the best film industries in India with its simplicity,realism,content and cinematography..So happy to see others realising the huge potential of Malayalam Cinema.."}, {"id": 53, "text": "Fahad fasil is taking his acting level to next level , the way he acts with his eyes are so godamn good. he is the future of the indian cinema"}, {"id": 54, "text": "Outstanding movie from Start to End From Direction To Editing Mahesh Narayanan He done a good job Engaging Story"}, {"id": 55, "text": "It's worth watching every frame of this movie. It's a fantastic 100 min gripping tale. Take a bow Malayalam film industry. Fahadh as usual is best. And I am surprised by acting of Darshana. Worth watch"}, {"id": 56, "text": "Brilliantly done! Hats off to the crew! Loved everything about the movie!"}, {"id": 57, "text": "The way they have directed the film is outstanding. I am giving 10/10 rating for the situation they have shot this film under. And the performances were just too good. This is a clear example of a movie with good script and amazing actors doesn't need to be big budget movie."}, {"id": 58, "text": "What a movie...What an editing..What an acting by the lead actors..Guys just go for it with out a second thought.."}, {"id": 59, "text": "A great movie even I have adjusted with subtitles only but not even a single secound of the movie wasted ."}, {"id": 60, "text": "Watch &amp; subtitles are important to be followed if you are not fluent with Malayalam!"}, {"id": 61, "text": "I went in knowing it would be something very similar to the movie 'searching', and it was. However it also had it's own unique flair to it. The movie and its message is very heart touching, it brings light to a very important issue. The girl playing anu did an absolutely fantastic job!! fahad and roshan were great too. Kudos to the entire team 👏👏"}, {"id": 62, "text": "Great shots by giving a virtual reality. Lovely script!! Hats off"}, {"id": 63, "text": "What a movie....must watch guys..will keep you on the edge till the end.phewwwww."}, {"id": 64, "text": "Brilliant idea... wonderful execution... new age film making... thrilling... emotional... strong message... brilliant performances... hats off..."}, {"id": 65, "text": "A new and modern way of filming. Great to watch a fahad fasil movie after quite a long time. We know he brings his class with him in his movies.Great one to watch and even the topic they are dealing is quite unique and not covered in any other malayalam cinema. Overall a must watch movie!!!"}, {"id": 66, "text": "Stunned by the sheer brilliance of the movie and its intrigue. This is the third Roshan Matthew movie I have watched this year and I am in awe."}, {"id": 67, "text": "Regardless of a movie being a fiction or a non-fiction, if a movie can keep you engrossed for its entire duration then it surely is an achievement and thats what we viewers want.This movie does exactly that. A very good thriller with stellar performances from all the cast especially Fahad, Roshan and Darshana who keep you glued to the screen. Special appreciation to the director and the technical team for their effort. Glad to see that Malayalam movies are consistently proving to be a notch above the other Indian movies. Hi Fahad and Nasriya, you can be proud of making a very good movie that will be talked about in the coming days. Keep up the good work."}, {"id": 68, "text": "Why would a girl trapped in a prostitution racket, rarely able to access a phone, unable to contact the authorities, be spending time swiping on Tinder?? Who on earth decides to marry someone they met on tinder after a few days. Who on earth goes to sleep with their web cam on?"}, {"id": 69, "text": "Excellently placed thrilles , Fahaad's exceptional performance, just perfect... recommend to watch it . C U SOON will make you sweat"}, {"id": 70, "text": "A great experience by mahesh narayan and a great concept everybody was good"}, {"id": 71, "text": "A very good concept as the entered movie is shot on iPhone. It has a new flavor which will stay on your taste palate for a very long time. Fahadh Faasil is an amazing actor, he brings the beauty in this movie. Roshan Matthew and Darshana Rajendran were marvellous. It's a must watch for everyone. Perfect movie for Onam."}, {"id": 72, "text": "This Film deserves the utmost appreciation..like we say all attempts cant be perfect, but this one's a perfect one.. even if they had shot on indoors,its just awesome man 👌👌"}, {"id": 73, "text": "Awesome storyline with exceptional act from all the cast ."}, {"id": 74, "text": "This is 2020 and we have a lot of time to watch movies and series. Though I wished a lot that how I could have saved my time watching boring clichéd series and movies on Netflix. I was stupid to think Netflix produces better content than prime but I was proven wrong. I took my changes when my sis recommended this movie to me and I am like .. what the hell is this? It's terrifically good. Don't skip this one."}, {"id": 75, "text": "Please spend 1 and half hours to watch this beautifully made film. Hard-hitting"}, {"id": 76, "text": "Interesting plot, intriguing screenplay, realistic performances. some elements seem a bit forced but rest of the film is fine."}, {"id": 77, "text": "Its different. Once again Fahadh Faasil shows how brilliant he is in making movies"}, {"id": 78, "text": "The movie seems to be a blatant imitation of one made 2years ago. Aside from lacking originality, it is so badly acted with a script that seems to have been written by a teenager. The quality is similar to what would be produced for a high school film course. Where does Amazon find these low grade films?"}, {"id": 79, "text": "Till this day, I thought this was an original concept and a highly creative one. But after watching the movie Searching released in 2018, I lost all the respect for the creator. Similar concept, similar shots, similar editing. Thumbs down"}, {"id": 80, "text": "C U soon comes in a thriller mode but portrays the real life of single working women in abroad especially in the service industry. Loved it and Fahad fazils brilliant acting stood out even though it's been taken in mbl cam"}, {"id": 81, "text": "The movie starts with a good note and the flow was also good but coming to the climax there was lot of mess and leaves confused but can be accepted because this is the first movie shot like this"}, {"id": 82, "text": "This was my the first Malayalam movie that I watched. It kept me hooked throughout the film. The storyline of the movie was not uncommon but the way it was portrayed through the computer screen was very different. In my opinion the ending could have been more descriptive. I highly recommend this movie for self awareness and amount of thriller it holds."}, {"id": 83, "text": "It was a new experience ,watching a movie like this . Fahadh played his role flawlessly . But I wasn't happy with ending personally . Otherwise it an amazing movie to watch"}, {"id": 84, "text": "I watch this movie 10 minutes ago.I really loved this movie and it have a great moral story in ut. It have a chances to make bore when a film is full screen based story. But this movie nailed it. This movie is better than most of the movie which was released in this pandemic time. Should watch movie!!!"}, {"id": 85, "text": "Total refreshment after watching. Liked the way whole movie is brought in front. Never seen such earlier. This Fahadh is a different level altogether. I don't have much words to express for him. Rest all key characters played a fantastic job. I loved it. Background score simply added superb depth to the emotions."}, {"id": 86, "text": "Overrated for sure, it's not bad but unoriginal as well"}, {"id": 87, "text": "My heart is in my mouth after watching this movie what pace yaar I like this movie very much great work."}, {"id": 88, "text": "Earlier I was not sure but now I am sure that now I have a favourite Malayalee actor - Fahadh Faasil. &lt;3"}, {"id": 89, "text": "In this movie there is full use of technology. The whole movie have shot virtually."}, {"id": 90, "text": "New concept in direction and Completely different type of movie. The real hero in this movie is the director. It's a good thriller movie. There are limited characters and all have done great job."}, {"id": 91, "text": "India's first desktop film CU soon.Another great film from malayalam film industry. The are the real gamechangers of lndian cinima.l, after jellikattu,rip,trance&amp;nine the really proved that they can make back to back masterpieces.Fahad fazil, Darshana rajendran&amp;Roshan mathew do such a awesome performancs in this movie. And the director Mahesh narayan talent was proved again that he can make experimental and class film like take off.The techinical side of the film was superb especially editing and background music.Music dierctor Gopi sundar done ot classy like always.With this film another milestone is being added to malayalam film industry.As a tamilan happy to say that Malayalam cinima would take Indian cinima to international level."}, {"id": 92, "text": "Had high expectations - recommendation came from a friend who generally suggests good titles. The first 15 mins was a time waste - yes it was needed to build the plot, but could have been 5 mins. Almost half the movie is typing screen on hangout/ tinder - which tends to get boring at times. Innovation has been used at times with some humour in some of the conversations. The end was really disappointing. Fahadh was brilliant - that is the only saving grace."}, {"id": 93, "text": "Reviews are subjective and we all have varying POVs, emotional triggers and opinions. So all I'll say is I was initially uncertain at the beginning, but it quickly piqued my curiosity and turned to intrigue. This story kept me riveted and guessing. For me, it didn't disappoint and there's a glimmer of hope for the pair involved. Treat yourself. Unless you're totally brain dead or emotionally unavailable you should enjoy this movie easily."}, {"id": 94, "text": "We need more of such movies where the specific incident, buildup, formation of characters are the strengths. Good movie."}, {"id": 95, "text": "Very well written and a great watch. Everyone performed really well. Mahesh Narayanan really did a great job coming up with a script like this in the midst of covid."}, {"id": 96, "text": "This is creativity...Hats off to all behind this movie...When you have brilliance, nothing (not even corona) can stop you from making an interesting movie..."}, {"id": 97, "text": "C U Soon .. A Different Cinematic Experience .. I saw this movie on desktop as it is currently being release on Amazon prime. (In fact, it looks like it could have a better impact on the big screen.)Actually i dont know the language. But Coming under English subtitles, the movie made me forget to read them many times. That's the magic of the movie.Actors who acted only as needed.. Pleasant music ..Simple and worth watching"}, {"id": 98, "text": "Few minutes into the movie we can understand that it going to be a different Movie than regular type. Those who have seen searching,Profile , Unfriended can easily what kind of movie it is. Ofcourse Its a thriller but where it lacks is the rescue operation. It can be shown in more interesting way. Good could have been better. Its like a mixed package of above three movies I mentioned in making. Moreover it's like Indian version. . Story is good. Rest all okay. Watch it. Recommended"}, {"id": 99, "text": "Great virtual movie making style from Kerala !! Both lead Female and male actors did great job. FF is always best to watch. Dialogues delivery was fast to catch for me since I am not from Kerala. Movie with great message for people and creates awareness. Good to watch ! Enjoy the movie."}, {"id": 100, "text": "A contemporary filmmaking with use of latest technology + excellent acting + interesting screenplay + strong emotional story line.A must watch movie."}, {"id": 101, "text": "I liked how the movie was conceived and shot during the lock down in an impressively shot time span. I loved all the performances. I felt Fafa's acting/emoting was under done on purpose during the initial phases of the investigation. Maybe to create a feeling of contrast and emotional investment in the mystery after he stumbles upon some key truths. I felt towards the end of the movie there is something that Kevin leaves unsaid not just to the character Jimmy, but also to the audience as a whole. Maybe its only a personal hunch.The star of the movie is definitely Mahesh Narayanan. From what little I know about direction/editing/virtual cinematography I felt that he did an incredible job. This film would not have happened without the maverick that he is. Amazing job!While its impressive that he also wrote a story and screenplay that not just fit into the format of the movie but also discussed a social issue that emotionally tugs at the viewers heart, I felt that the flaws in the story still should not be overlooked. For example, how weak the villain is or how easily Kevin and Jimmy gets access to almost all the major evidences/truths without much hiccups, how Kevin's screen is almost always capturing his life/ his laptop camera is rarely switched off and how his laptop itself is bugged despite him being a cyber security expert etc Many crucial questions arises in the mind of the viewers, for instance, why did the villain strike a deal, instead of probably killing the threat after retrieving what belonged to him?Since it is a screen based movie, its imperative to understand that the viewers would scrutinize every little detail on the screen. So the fact that Kevin's screen has a sticky note with 'printf fibonnacci series' or there are typos in the news articles he reads in the movie should not be brushed off as minute details. This might miss the eyes of normal audience but still reduces the believability factor/verisimilitude to the ones who notice them. Spending a little bit more time on reviewing and re-editing both the script and the screens could have given us a more flawless work very close to a masterpiece.Hopefully, all or at least most of the loose ends in the movies will be resolved in the sequel where we get to know the characters and their backstories in a real life point of view. Waiting for the sequel for sure!"}, {"id": 102, "text": "This was one of its kind experimental movie which will eventually evolve to become a digital movie making process and main stream. It is a gripping movie In the first half, but was predictable in the second half with lack of clarity around the story telling and eventually ending up on a convincing note.Overall kudos to Fahad and team for a stellar performance and daring to take the audience to a next level"}, {"id": 103, "text": "A simple story line, gripping screenplay, fine editing and great performance by the actors will not make you think that it's shot in a iPhone."}, {"id": 104, "text": "A very good movie, shot excellently. Excellent use of technology and tools to shoot this while people stayed at their respective locations during Covid. Good concept, story line and execution. Fahadh owns the movie and Roshan Mathew pretty much nails his role.The standout scene for me is when Fahadh realises he needs the help of his colleague, but he had just blocked her a few mins back. He is thinking what to do and his face makes a slight change of expression. That expression was enough to tell us he was going to unblock her and apologize. He didn't even need to show us he was doing it. His change of expression clearly showed what he was going to do. That is some brilliant natural acting. If someone has missed this scene, watch it again."}, {"id": 105, "text": "C u soon.goes to show you dont need a 100 crore budget to conceptualize and execute a theme which revolves around the use,abuse , misuse of social media.literally everything occurs at the click.u cannot take your eyes of the screen.blink and u miss."}, {"id": 106, "text": "I was like how the hell can they shoot on phone... Ohh it might be one of those timepass movies they did in this lockdown. It just happened that I got to see someone talking about the movie on twitter... Was at home started watching it and I must say I was glued to the screen from beginning to end with the power performances by these power actors... Fahad is brilliant so are the other two. Only place I feltthe film was little loose is when she is coming back to India before roshan starts running at the airport to go to her terminal... Just before the run the those 7 minutes were little boring rest was one word brilliant"}, {"id": 107, "text": "Just go with the movie.. u will like the way of direction and awesome movie.. everyone acted best. this type of film we can expect from south only."}, {"id": 108, "text": "As this is a spoiler free review, so i won't discuss about the story but the movie was So thrilling, engrossing and emotionally charged up at the same time. Take a bow to the creator and all the actors especially the girl.Please don't miss this one, it's going to stay with you for a long long time...JUST AMAZING 👌👌👌👌C U SOON!"}, {"id": 109, "text": "C U soon is good movie and it shows true incidents that happen in our world. I really loved the type of shooting, you will understand it when you watch the movie. Hats off to Mahesh Narayanan and the entire crew"}, {"id": 110, "text": "A execellent movie and the director nailed the way he scripted it and he made a movie during this quarantine and gifted for us a quaratine gift..really speaking he sculpted it and gave a thriller experince and nail bitting screenplay..no execellent locations..no songs yet a classic performance of the screeplay and editing and within a phone He gave us everything ..He made us even in this period he can make a movie that too not an normal one and especially the climax gave the meaning of the narration..a must Watch thriller ..a good message for viewers"}, {"id": 111, "text": "Very nice movie, kept me interested throughout, this is my 2nd Malayalam movie, i recommend this even to those who don't understand the language."}, {"id": 112, "text": "---Mild spoilers---When watching the movie, I was totally engrossed and once the mystery is revealed, the reason also had be totally empathize with the character. But on 2nd thought, why would a victim create an account on Tinder and not contact the police or the relevant authorities, especially when that is what they eventually do. If they had not done that the whole movie would not have happened, so that forms the core of the story, which is flawed.Having said that the movie is definitely gripping, is very well acted, has a good screenplay and is edited well. The best part is the format in which it is presented."}, {"id": 113, "text": "Experimental and brave... I am impressed that someone actually got an idea like this to make such an amazing film during this pandemic."}, {"id": 114, "text": "The movie is completely virutal and most of the times you are only witnessing the laptop screen and not a perfectly framed picture. That is what makes this movie stand out and engages the viewers. The music and sound are just brilliant and most of the times the emotions are conveyed through them rather than the actors. A unique effort in cinema that deserves appreciation!!"}, {"id": 115, "text": "Loved most of the movie, the realistic plot line, casting, dialogues. The issue being addressed was so realistically presented. Audience could engage with the character and feel their emotions. There were few scenes where Roshan went a little overboard, and the acting felt a bit unnatural. But overall an amazing thriller to watch."}, {"id": 116, "text": "A fabulous work done in a completely different way. Experiment that gone beyond expectation..."}, {"id": 117, "text": "Loved it and Fahad you have done it again... Love ur new look... Loved Darshana..wat an acting....!!! Loved every inch of it... Was glued to the screen like watching sci-fi movies The best part is you have proved it even during lockdown. Love to Nazriya.... !! Am sure she's the backbone in the making... And Roshan... Never knew wen u shot in my college for ur first movie u would reach such heights !! Kudos to the whole team... And loved the title the most!!"}, {"id": 118, "text": "Malayalam cinema is really growing. C U Soon is a pure example of that. Really Loved this Film"}, {"id": 119, "text": "C U Soon proves that lockdown is just another opportunity for creative people. A well-crafted film with a bold script and good performances."}, {"id": 120, "text": "This entire thing is my personal experience, yours may differ and I accept that. Let me start by saying that 10-15 mins into the movie and I could see what was coming. A stellar performance by the 3 leading individuals in this screen-based movie - Fahadh, Roshan, and Darshana were emoting through nothing but their facial expressions. In a format where most of the scenes are limited to your upper body, the text messages, and the sound (boy, the sound is always greater than visuals), they did a great job. I never expected anything lesser from Fahadh because that dude is a genius. He has proved his excellence and what he's capable of doing on-screen through each of his performances. One better than the other, and I am glad that he took on this project and co-produced it with his wife. However, the plot is where the entire thing fell short. While the entire subject the movie focused on and well, reading the comments and reviews, I've noticed how more than most people could only focus on the moral issue of scamming people, especially needy young women in the name of job offers and decent pay by agents only to realize that they are being sold as flesh to others. This is something that people are familiar with and exists, yes. But I am shocked that people missed out on the fact that Kevin (Fahadh) who is a Computer/Cyber expert capable of hacking/intruding into people's privacy is persuaded into doing what they call a personal background check of Anumol Sebastian (Darshana). Even as this screen-based movie pans out into the moral issue I described above, Kevin's apology towards the end that I should have done a more thorough background check makes me wonder how the audience could be so tone-deaf to the harsh realities facing the virtual world. There was nothing thrilling about how this movie panned out for me. From the beginning to the end, we get to see privacy intrusion (which frankly I didn't notice in most reviews like a grave concern) to this moral issue. Frankly, I watched the movie in 3 sittings because there was no drive to this. A stellar performance for a weak storyline still doesn't make up for the weakness of the storyline. Again, my personal experience. P.S I have watched 4-5 screen based movies, the editing in this one is great for Indian standards. I wasn't expecting anything like Searching or Profile, but yeah, Searching is a fine Screen-based/Digital thriller. I am glad that C U Soon happened and that Malayalam Cinema is going beyond the conventional formats. Take a bow for this experiment. I have a lot more to say, but as I said, you can watch it for the performance, the screen-based format experience, and the editing. I think it could have been a whole lot better and I really wish more and more people spoke about two major issues this movie reflects. 1. Conning people in the name of jobs and subjecting them to a world of torture where they have no other option but to do it. 2. The intrusion of privacy - I am not saying they normalized that act, but seemed like the audience missed out on the same."}, {"id": 121, "text": "Hats off to this unique attempt by the director and the editor and as usual amazing acting done by all the actors, keeps you on the seat through out the movie, please go ahead and watch it."}, {"id": 122, "text": "The movie is simply amazing. It's very short compared to other Malayalam movies, but still we were kept engaged for the whole time. The character 'Anumol' was very heart-touching."}, {"id": 123, "text": "This is the second malayalam movie that i have watched after trance, Truly ,there is something special about this movie..the story has been knitted so beautifully that you will get along with the puzzle the characters indulge and will be actually wanting to know for the rest . Such an amazing acting by Fahath Faasil ..and other actors.. Wonderful experience of a movie to watched in a mobile phone.. While watching on phone , you would experience this os as a a video call happening between you and the characters in the movie. Hats off for the idea.."}, {"id": 124, "text": "You will be completely online for 1 hr 38 mins and you will be in video call with random strangers (Movie Characters).You are then travelling through their life(Remember only through social media calls).Then something strange will happen infront of you. You don't know what's happening there,You are just witness everything.one thing you can sense,you are in the middle of a mystery. Go and watch this movie to solve this mystery.Strange experiment and the outcome is awesome"}, {"id": 125, "text": "I wont talk specifically about what's in the film and and how brilliant acting by everyone is, and how it has all emotions, its thriller, its romantic its new-age, its social commentary, and, also political. Zooming out from this film and seeing the bigger picture what the cinema in South of India is trying to do. Its an brilliant effort there are film which are pushing the narratives, the story structure and the story worth listening and seeing. These films are beacon in the era of super expensive big budgeted films where actors are stars not actors (sadly). Watch it for the love of cinema, watch it to support good and worthy cinema, not industry. Its a craft not a manufacturing hub. And apologies for clubbing all the cinema of southern india. But they are truly coming out with good films."}, {"id": 126, "text": "An exciting movie by Mollywood. I am from Nepal but love Malayalam Movie most."}, {"id": 127, "text": "The best way to enjoy this enjoy is not thinking about the 2018 classic Searching while watching this movie. Yes the concept is same but the story is completely different. There is a very good social message at the end of C U Soon, something which is quite relevant and problematic in today's world. You'll be hooked to the movie from the first scene. Roshan, Darshana and especially Fahad were amazing in the movie. The the BGM is out of this world. Would've given it 10/10 but I felt the side story of Fahad with his boss was kind of forced and illogical. But, do not miss this gem!"}, {"id": 128, "text": "Another wonderful work of Fahad.. Roshan and Darshana were perfect. Kudoos to the entire team."}, {"id": 129, "text": "After you are done watching the movie, you will realize the story is very simple but it feels like a thriller because of the unique way it is shot. In fact the editing is the best part about the movie. They could have made story little more trickier in my opinion as story had all elements to make it a genuine thriller but nevertheless a entertaining one time watch."}, {"id": 130, "text": "Fahadh Faasil is the man to be remembered as KAMAL HASSAN of 90s Just now watched #C_U_SOON. No words. it was JUST AWESOME. A new novel way of making movie using technology via phones and virtual gadgets will be seen. Audience will witness a complete virtual world of real characters. Hats off to director Mahesh Narayanan for gripping tight screenplay. A film to be remembered for its technical brilliance... Just go and watch it for roller coaster ride!!"}, {"id": 131, "text": "Mahesh Narayanan has come with the Entirely Different concept, Concept which was Unexplored In Indian Cinema. Right from the starting of First half Mahesh left us thinking about the Darshana's Character, The editing and Screenplay of Movie was Brilliant. Fahadh was yet again Fantastic. Roshan and Darshana did a Terrific work. Gopi sundar's BGM was Lit !!"}, {"id": 132, "text": "'C U Soon' a film streaming on Amazon Prime. A thrilling experience and brilliant creative making during this pandemic situation. This shows the level of creative thinking in filmmaking.Malayalam film industry is always level ahead from all indian fim industry. Once again this movie proves that. Asusual @fahadfasil fantastic performance and @roshanmathew &amp; @darshanarajendran did well. #maheshnarayan direction and story writing superb."}, {"id": 133, "text": "Best experience in one of the best thrillers in cinema experience, and this was shot in iPhone. All the actors did good job. Must watch"}, {"id": 134, "text": "We have heard these stories in various news mediums, happening all around the world. Nothing new there, but the magic is screenplay and editing. It gives us a whole new experience of watching something fresh. Acting is top notch. Editing is seemless. They could have tried a different ending. Of course these issues doesn't give scope for improvisation. So they have sticked to reporting these issues and the effect on people and society. Overall a good film with good use of technology in screenplay and making familiar story look modern and sophisticated. Must watch!"}, {"id": 135, "text": "People who are talking about it being a milestone in the movie industry needs to watch the searching.. The way it is directed is a copy of the concept.. Nonetheless, acting has been great but stop banging your chest for it being something fresh."}, {"id": 136, "text": "Proud to be a malayalee. We can proudly say the height of malayalam movie reached international level. I think this is a first kind of movie like this in Indian cinema. All the characters are communicating in a virtual way and a better script which stitches all the virtual moments properly."}, {"id": 137, "text": "1. Expected more out of the movie's trailer. Was expecting a better gripping storyline. 2. The romance felt forced and lacked depth. 3. The plot is predictable. Weather - beaten subject. 4. Fahad's subplot felt unnecessary in many parts. 5. Once the reveal is done, the movie looses it's pace and becomes whatever one can guess.1. First of its kind Malayalam movie 2. Impeccable acting. 3. Amazing effort by the Director. 4. Good message. 5. Editing, cinematography, storytelling deserve applause."}, {"id": 138, "text": "Overated movie, much hyped, no content. Overated movie, much hyped, no content. Overated movie, much hyped, no content"}, {"id": 139, "text": "From love to freedom ..an edge to seat thriller..darshana ,roshan ,fahad perfect casting .."}, {"id": 140, "text": "There is always a confusion when you deside watching movies made in different platform, C U SOON has to be the best among this. The story is constantly moving forward with moments of tension. Fahadh and Roshan did a wonderful job to convey the heat of the situation."}, {"id": 141, "text": "A must watch ... Giving a very nice message with ingaging Screenplay"}, {"id": 142, "text": "Nothing to say. It's an amazing movie with variety concept. Uff what a brilliant performance from actors, music too. Hats off to whole crew. Feels proud of Malayalam Movie."}, {"id": 143, "text": "Have only seen a few movies shot in this format - Searching, of course, and the recently released Indian web series - The Gone Game, on Voot. The expectation for this movie was huge. And it was refreshing to see Fahadh promoting this across a pan Indian audience as well (see YouTube interview videos with prominent Bollywood critics).Coming to the movie, Fahadh completely owns the movie. It's so hard to see an actor, even though limited by this new medium, completely mesmerise you with his acting. I forgot about how the movie was shot or framed whenever he came on screen. Brilliant. The rest of the cast is okay. I was a bit let down by the movie cos I was hoping for a twist or a thriller genre. The movie has those elements, but goes down a different route in the end.Good watch, but a tad disappointed with the ending. But, that was just due to my personal expectation from the movie. Good watch."}, {"id": 144, "text": "#Review #OnamPremiere #CUSoon #AmazonPrime #MalayalamMovie #FahadhFaasil #SpoilerFree After the magnum opus that was Take Off, Mahesh Narayanan blows it out of the park again with the spine-tingling, compelling thriller that is C U Soon. Inspired heavily from the narrative style of films like Searching and Unfriended: Dark Web, the story moves forward primarily through Google Duo video calls and Face-time as a web-security expert searches far and wide for his cousins missing girlfriend. The nuance and subtlety driven into each character by the three brilliant leads-Fahadh, Roshan Mathew and Darshana Rajendran instantly buy you into the storyline. While Fahadh as usual captivates you with his eyes, Roshan conveys the urgency and desperation of his character with elan. However, it is Darshana Rajendran who steals the show as the initially timid 'Anumol' who becomes a well-fleshed out and awe-inspiring character towards the end. The fact that this film was conceived and shot completely at home, via iPhones and tablets during lockdown just goes to prove the adage from Johnny Flora If necessity is the Mother of Invention, than adversity must surely be the Father of Re-invention. Highly recommended."}, {"id": 145, "text": "Tldr; A webcam genre movie that is better than the sum of its parts, and was entertaining enough for the evening, but I would never watch it again, or recommend it.As far as the found-footage / webcam genre goes, I have maybe seen a couple dozen of these films. This is arguably the most illogical, inconsistent, utterly incomprehensible mess I have seen in this genre. It demands the viewer accept ludicrous premise after ludicrous premise (I am trying to write this to be general enough to avoid spoilers)...that all it takes to hack into a person's Internet accounts is a low quality JPEG image of the front of their wireless router.that these same people involved with this magical cyber security &amp; hacking, would use one-factor authentication, and leave their webcams on all the time with their social media account logged in, including while they sleep.that one person helping another person flee an abusive situation, would help the abuse victim change their phone number in order to hide from their abuser, and then go seek out the abuser to give them the victims updated phone number.that people who swipe as a match on an online dating app, would propose marriage to their families after a few days of chatting, and this wouldn't be called out as rash, reckless behaviour by the families involved.that people can have relationships, where they discuss, virtually nothing, ever, and seemingly purposely avoid talking about key plot points that are happening to them, for no reason whatsoever, other than to create unnecessary complications to the plot.To say you have to shut your brain off with this movie is an understatement. You practically have to feign ignorance of the laws of physics, let alone human nature, in order to make this movie comprehensible, let alone believable. The webcam / on screen framing is illogically inconsistent, the scripting borderline incomprehensible, and the musical scoring is so utterly incompetent, that it seems whoever scored it did not understand certain scenes either. All that being said, I'd be lying if I said I didn't find it entertaining. In fact, some of its flaws, and incompetent story telling, added to the experience for me, as I tried to figure out just what the frack I was *supposed* to think while watching this mess of a movie. It was particularly fast-paced for cinema from that part of the world, and it had some compelling moments, all the while seeming to be made with effort and intent. While I would never recommend this, if one were compelled to watch a Malayalam take on this genre, I wouldn't try to stop them. It was maddeningly incomprehensible, but compelling enough that I never once wanted to stop watching."}, {"id": 146, "text": "C U SOON (2020) MALAYALAM REVIEW #cusoon #cusoonreview #malayalammovie #review . . . 📜 Plot: Jimmy meets Anu on an online dating website and decides to marry her. Jimmy's mother entrusts his cousin Kevin to get details about Anu. Now its Kevin's turn to search for his cousin's fiancee who vanished without a trace, only to discover dark, shocking truths about her. . . . 👨‍⚖️ Review : If you have already watched Searching in the past, it obvious that you might have loved it and in your minds have set a standard of how desktop movies are made and should be made. Taking nothing from Director Mahesh Narayan, C U Soon is valiant effort in replicating the magic of this genre for Indian audience. The movie begins on love affair and slowly turns out to be an edge of seat thriller. The movie oscillates between desktop , mobile screens to inflict powerful story telling and has an intriguing screenplay and something indian audiences might have missed if they skipped searching.Fahadh is undoubtedly a gem of an actor and he needs no criticism, he is unflinching and outstanding. Robin Matthews as Jimmy has given his best performance yet on screen and i believe now that he has so much potential . He should definitely avoid being choked by making movies like choked. The star here is Darshana Rajendran, she is marvelous and so brilliant as Anu Mol. She has imparted her brilliance in Emotional scenes without flaws.Overall , C U Soon is a decent movie which you will engage in but wont be having a lasting impression on you. The Brilliant takeaways are the style of storytelling and editing. Was wishing the movie had a better storyline still. As Searching has raised a bar which is C U Soon wasn't even close to. . . 👍Goods : 1. Performances of each Actor 2. Screenplay and Editing . . 🔥 Final Rating : 7/10 . . ✅ Verdict : Not the Best out there, but is definitely worth a watch if you haven't experienced a desktop movie. . . Follow in Instagram for More : @RiteshReviews"}, {"id": 147, "text": "The Good: Bharat's (read: India's, because its Malayalam) first 'Screen Movie'. Surprisingly aesthetic work form the broader 'Found Footage' genre with negligible motion blur and good quality video all along. Appreciably short runtime considering desi standards. No time-gobbling music.The Mediocre: Engaging screenplay though the plot increasingly underwhelms with passing runtime. Minimal, subtle and largely ineffectual use of background score . Decent performances although Matthew's leaves one wanting for improvement.The Bad: A complete neglect of all aspects that make a good thriller. The background score is a real letdown, reducing the movie to a drama form the prospects of a nail-biter. Dismal and prodigal use of various characters. The film is utterly bereft of a crucial sinister prognostication which is usually a thickener for such a recipe.Overall: If you're a Malayalee and wish to watch something new in Mollywood, this is something you wouldn't exactly adore, but wouldn't frown at either."}, {"id": 148, "text": "For a movie marketed as a suspense thriller, this one had a forced romance subplot which makes it a nonsensical one. For the most part the mystery goes good. But once the suspense is revealed there are some glaring plot holes which are caused by the forced romance plot. It's as if they were trying to fill the time and make it past the one hour thirty minute mark. One of the characters seem to have time for romance even in life threatening situations.Once the reveal is done, the movie turns into something like an awareness campaign. The characters don't hold much value from that point onwards.Music is good. Acting too. Darshana Rajendran does all the heavy lifting along with Roshan Mathew. Fahadh is just there to get the hype going. His subplot was totally unnecessary. It was more or less a filler stuff.This can be watched for the format in which this is done. The computer screen format. They have made it in such a way that there's no logical inconsistencies caused due to the computer screen format which many of the films in this genre suffer from. Kudos to the team for doing it successfully.Overall it's just an average film which is a one time watch."}, {"id": 149, "text": "By the time you get familiar with all of the screens in c u soon (See You Soon), the plot does a somersault, runs a mile, and then stares at you from the distance. Even as you sit enchanted by a deadpan Fahadh Faasil's face as he clicks and presses on his Macintosh to get to the bottom of a mystery his cousin (Roshan Mathew) introduced to him, you wonder where the plot is really going. And if the inventive screeny filmmaking (at least for Malayalam cinema) isn't rapturing enough for you c u soon has many more surprises in store including the plot that constantly maintains its mystery, gives out thrills, and keeps you on the edge till the end, and Darshana Rajendran who steals the show with perhaps the most difficult role in the film.c u soon is a brilliant cinematic experiment and one that grows on and impresses you within the 100-minute time frame, which makes it nothing less than a feat in these trying times, regardless of what it reveals. Go and watch it right now on a small screen and don't bother dividing your attention. This one needs all of it. TN.And, oh, yeah, Fahadh Faasil Googles Google Maps at one point in the film and I lost it slightly."}, {"id": 150, "text": "C u soon directed, captured , framed , edited and produced by Mahesh Narayanan which is for 1 hour 38 minutes, shot during this pandemic. This movie was shot in iPhone in the lockdown from the months of May to July The cast , Fahadh Faazil , Roshan Mathew , Dharshana Rajendran and Amalda Liz . This movie revolves around the virtual lives of Jimmy ( Roshan Mathew) , Anu ( Dharshana) , Kevin (Fahadh Faazil) and few others . Jimmy and Anu Sebastian met in Tinder in which they chat and often meets in video call then they end up in serious relationship and later Kevin who is the cousin of Jimmy ( works in cyber crime) finds the details and bio of Anu and later Anu faces many problems with her father and goes missing , Jimmy gets caught by the Dubai Police and from here the movie moves with more intensity.As this movie is a virtual treat , it has a lot of extreme cuts, pan and zoom effects and high octane sequences. Almost three-fourth of the movie was screen recorded , the constant use of technology is on full display in the film, reminding us how much our lives are parked in the digital platform. Fahadh Faazil's acting was absolutely natural and engaging with the story. And Roshan Mathew's and Dharshana's acting was amazing in which it felt like they were really into the relationship, In the earlier films of Dharshana ( Kavan and Irumbuthirai) , her role was short and her performance was good but did not have much screen phase but in this C u soon she had a leading role and rocked the screen. As the movie started with the love portion it didn't affect much as typical love portions or the template ones. After 40 minutes , the movie has more intensities and lot of mysteries and twists which seeked and engaged the audience till end the movie."}, {"id": 151, "text": "C U Soon Movie: Mahesh Narayanan's Fahadh Faasil-Starrer On Amazon Prime, Made During The Pandemic. It's about two people meeting on Tinder and how that develops into something to an simple love where it then turns into serious relationship and then Jimmy(roshan mathew) notices injury on Anu's face, he think that it must have been her father ill-treating his daughter anu who is the girl in love with jimmy (darshana) later got missing , at this point the film takes on the form of a thriller, and here comes the jimmy who asks help with his cousin kevin thomas(fahadh faasil)who is an cyber security expert who involves in private chats in both and searches for the solution from UAE with his various computer knowledge and with cctv footage and find where she is ,where Narayanan's skills as a storyteller are impressive and he made the whole film in the computer screen and phone screens are placed in a way that they do make the film narrative much better and realistic.producer : fahadh faasil,nazriya nadeem."}, {"id": 152, "text": "NECESSITY IS THE MOTHER OF ALL INVENTIONS...... The 2020 Lockdown has brought about an instant and creative invention(actually....an evolution) in film making too....and as a testimony to this statement stands the new Malayalam movie C U SOON - directed by Mahesh Narayanan. It is a film that is completely virtual, video graphed using mobiles, laptops video-calls and other smart devices, by the various characters of the film. The movie falls under the category of drama, mystery and thriller.Who doesn't enjoy watching films.....but do all of us enjoy all films??? Today is a world filled with technology and gadgets...but are all of us message- savvy??? You need to be one, if you are watching this film without sub-titles, cause majority of the film is conveyed as Malayalam texts typed in English!!! Not something, that all age groups can follow, but still it keeps us engrossed..as the story is very well connected and smooth flowing.This film doesn't have any non-sensical concepts or actions....today...a lot of thriller films tend to have such unrelated or unexplained concepts....this is a huge plus point of this film. Highlights not just one...but quiet a few social messages based on various real life events/issues to the people about... foreign job scams, extent of hacking by accessing our social media account and problems with online matrimony apps.The editors, cinematographers and director of this film have done an exceptional job, as the film is virtual, having no ways of being physically present to set the shots. The video-grapher's being the caste itself...have done a good job. The movie only has a title song and background score....giving it a very realistic touch...another plus. (The films of today ...some not all, are now directed like that)So....if you are someone who enjoys realistic and social message films, with a touch of thrill in it...go for it...worth the 98 minutes of your time."}, {"id": 153, "text": "MOVIE: CU SOONLANGUAGE: MALAYALAMRUN TIME: 1h 38 minsCAST: FAHAAD FAASIL, ROSHAN MATHEW , DARSHANA RAJENDRANDIRECTOR: MAHESH NARAYANANSYNOPSIS: Jimmy Kurian and Anumol Sebastian, both based in the UAE, meet on a dating app. Soon their conversations shift to video calls and after an incident, they start living together. But things go out of control for Jimmy when Anu goes missing and he's taken to the police station, forcing his cousin and cyber security expert Kevin Thomas to discover some shocking truths about Anu through her data.REVIEW: Could any of you believe that a film with an extraordinary screenplay could be taken in this pandemic? But it is true and has happened due to the malayalam film industry. Before going into the review of the film I would like to give a kudos to the guy who has given the title CU SOON to this film. It relates to the story and as well as gives us hopes about the reopening of theatres indirectly.The film does not have any breathtaking aerial shots or camera movements but just has shots were actors are acting in front of their webcams and is still engaging.The first 20 minutes is pacy and introduces the characters Jimmy{Roshan Mathew} and Anumol Sebastian{Darshana}. Speaking about the acting of the lead actors, an amazing performance from all the three. Fahaad Faasil is amazing as an angry and irritated{ due to the untimely work timings} but still helpful Kevin Thomas. Roshan as a charming Jimmy kurian is amazing and Darshana as a cute lady named Anumol is excellent{both their perfomances were natural}.And also, technically the film is top notch, a great attempt by the technical team. I am not going to say anything about the story as it will become a great spoiler. So as I said, the positives of the film are the natural acting of the cast, the screenplay and the work of the technical team.But the problem is after a certain point of time we lose our patience due to the continuous display of chats and chrome tabs {but that can be forgiven as it is shot in the lockdown}.It is a great attempt by the team of CU SOON to give an amazing film in this pandemic and kudos to director Mahesh Narayanan{of Take Off fame} to take an initiative of writing a script at this time. On the whole it is an intersting experimental film with top notch performances and screenplay and deserves a watch.Rating:3.5/5"}, {"id": 154, "text": "I loved the movie, never felt bored. It is a must watch movie. The movie has been beautifully directed with limited resources and using technology at its best.The movie portrays a thrilling story about a man who fall in love with a girl through social media. But he is not aware of the problems faced by the girl. The rest of the story is about how he and his cousin try to unveil the mystery of the girl when she suddenly goes missing.It beautifully depicts the traps, pros and cons of today's virtual world. Though it is very difficult to direct a movie through computers , webcams and chats etc , that too during this pandemic period, the director has beautifully narrated the entire movie through computers, chats and mobile phone screens with characters visible through the camera of the devices.This movie stands unique of all other movies and it has proved that big budget is not required to make a successful film. Rather its just the director's capability , skills and creativity along with the support of the crew members that makes a successful film.I did not find any drawbacks in the film.Such films must definitely be appreciated for their efforts , hard work and creativity, in spite of this pandemic ."}, {"id": 155, "text": "The movie seemed to be conceived, and made in the light of the present circumstances of the pandemic which made the contemporaneous; not on the basis of the outbreak but the consequences; yes the lockdown, however thematically the storyline doesn't have anything to do with this similitude, but the makers decided to tell this story in a virtual setting. The movies touches some of the current affairs such as, virtual communication and the exposure to various messaging collaboration tools, questionability data/security, hacking, shady activities of some enigmatic NRI/upper class expats, victims of internationsl sex slavery, immigration legalities, and so on. A movie with a balanced mix of conventional/convincing and unconventional faces, regardless the outcome is praiseworthy. Viewers will certainly feel for a couple characters essentially Darshana, Saiju, Amalda and of course Fahad's performances are the take away. We all are watching this movie years after the release of VHS, Searching or unfriended, however watching a movie of similar backdrop in my mother tongue is a unique experience to be honest, apart from that there none much great about this movie. But a must watch !"}, {"id": 156, "text": "Malayalam Cinema yet again makes it a point that, good content is the key for any creation, and good content is not always directly proportional to the cost involved in making it. This film adds up to the promising yet challenging phase Malayalam Cinema is traversing, wherein not only the makers but also some of the mainstream lead actors are willing to experiment with Cinema.C U Soon is an experimental film, with multiple genres. The experimentation to build the characters, the plot in a virtual world has turned out very organic. The filmmaker placed all the characters at different locations and the intent to use the digital medium for the characters to communicate justifies it quite well.Once the characters are established, the digital screen does not distract the viewing experience, it comes out as true as any cinematic experience. Though there can be disagreements on this by elderly people as they may find it difficult to fathom the progression of the plot with a digital screen showing text interactions between characters and other technical operations performed on the PC/iMac to decipher the mystery.The overall experience was super gripping, the performances were rock solid by all the key characters, the central characters were relatable to the core. The other thing that worked for me was the background score, it just enhanced various moods of the film quite efficiently.After watching the trailer, I was expecting an out and out mysterious thriller, it's like the mystery element remains till the end rolling credits, never mind the makers obviously had better plans to deal with it, so no regrets on that aspect. The film progressively and maturedly drives into an uncomfortable zone and it manages to extract out a poignant experience leveling up the overall experience, than being just some gimmick experimentation with all the digital frames flopping around and all the twists &amp; turns devised into it.'C U Soon', available on Amazon Prime, is a film not be missed, let's embrace such creative experiments in Cinema, and let's appreciate, encourage the efforts invested by the artists, especially the makers, involved in it."}, {"id": 157, "text": "For those who love films, Malayalam movies has been the gold standard of movie making. Talented actors, storytellers, directors and DOPs have raised the benchmarks in the last decade or so, weaving in a natural lifelike method of stories that are easily identifiable. As the standards have grown, a breed of performers stand out such as Fahadh Faasil, Roshan Mathew, Dalquer Salman, Anna Ben, Soubin Shahir, Chemban Jose, all of whom have led the renaissance of a new era of film making.CU Soon takes the industry into the 21st century, with digital technologies and social media (both the positive and negative aspects of it) woven into the script as it's backbone. It touches on many aspects of modern living. The global aspirations of Indians, technology that connects, irrespective of geography, love and romance in today's world, human trafficking and exploitation and many more. But these flow into the narrative seamlessly and the entire cast is in terrific form to live up to the characters played by them. It's convincing with their little quirks and side stories that doesn't override the key plot.For those familiar with the Hollywood movie - The Searching, the visual representation of the film is quite similar where as audiences, we're watching the film through the filter of the characters screen. Thanks to COVID and social distancing, we all identify with living in a fishbowl and Mahesh Narayan (Story and Direction), makes good use of this style to make the most of the lockdown. Despite the constraints, the film does not drop the ball for a single second and one cannot take their eyes of the screen. At 1 hr, 38 mins, the movie is taut and well put together. Up to the half point of the movie, the suspense is kept on the knifes edge, and we're wondering on which direction will the story go, making conjectures in our own minds.Once the story starts unravelling, it still does not disappoint and holds its interest right till the very end, leaving behind a huge moral question for Roshan Mathew to answer and the audience roots I'm for it to be the right one.A great watch and kudos for the entire team for this and specially for Fahadh for backing this creative product."}, {"id": 158, "text": "The Malayalam film industry has a different style in choosing the backdrop as opposed to the C U Soon analysis routine. In Prime Video C U Soon movie, screenplay combines technology with a social problem in Kerala.Topics of the current generation, such as collecting information using web chat apps like Facebook, Google Hangout and Skype, are nicely displayed on the screen.The highlight of the film is the directing of the film through chatting between mobiles and computers.Adding suspense, mystery, and thriller to the story of why the two lovers fell in jail under unforeseen circumstances, the film takes the story to another level.The way the story is written, the way it is told in a way that is easily understood by today's youth is great.Also impressive is the way the suspense continues in the story to the end. The emotions in the characters are new as shown on the screen.Fahad Fazil, who is closer to the audience with films like Super Deluxe and Trance, once again put on an amazing performance.The emotionally charged acting through his eyes in the climax further impresses the fans.Roshan, who has gained fans with his negative shade in the Malayalam film Kapela, has impressed by playing a sympathetic role this time. Feel Good gets emotional with his actions not only in the scenes but also at crucial times.Darshana Rajendran Performance It has to be said that Iron Thirai fame Darshana Rajendran is alive in the role of Anu Sebastian.It must be said that it has done full justice to the role of telling the problem faced by Kerala young women.Feeling we have 'Run out of gas' emotionally with the help of a character who has less dialogue and more scope for emotions.Director Mahesh Narayan's talent is captivated by the heart-wrenching story of how young men and women get into trouble with the lure of taking jobs.The film is designed to add technology to a social problem and give a new feel to the audience.The film manages to impress not only the youth but also the family audience with no place for pornography.It very beautifully makes us aware of the fact that how technology has taken over our lives and some of us are already suffering from it. You should watch this film with English Subtitles."}, {"id": 159, "text": "In the pre-pandemic era, Searching, directed by Aneesh Chaganty, unknowingly set a tight, harrowing template for a thriller set in the online, digital world. Now, with our living, working, and private worlds upended as far as the vax can see, it's not just a pre-adult demographic that's exposed to the incessant stream of digipacks, but all of us as well. And that includes bank client officer Jimmy Kurian (Roshan Mathew), who, in the Malayalam movie C U Soon - which uses the same template, but takes it into a superbly distinctive journey of its own - based out of an apartment in Sharjah, swipes right on Tinder and falls for Anu Sebastian (Darshana Rajendran) swiftly and surely.Writer-editor director Mahesh Narayan (Take Off), also the virtual cinematographer for this project - a credit we'll be seeing more of, I suspect - having shot the entire movie on iPhones in apartments in Kochi during the pandemic - keeps his script tight and economical. Using all the icons that apps deploy - three blinking dots, to show, for example, if someone's typing - and online chatting techniques - typing, only to tap the clear option to rescind and rethink one's thoughts - the director radiates warmth and yearning in the budding romance between Anu and Jimmy. Those same icons and popping sounds ratchet up the tension later on in the movie. That Jimmy's impetuous and thinks from his bleating heart is established as he quickly sets up a video call with Anu, his mother in the US (Maala Parvathi), and cousin sister for them to meet Anu, also living in Sharjah. Under normal circs., all would have been okay. The catch here is that the couple hasn't met face-to-face, and Jimmy pops the nuptial proposal on said call. That something's amiss about Anu is apparent, but love is blind, and virtual love blind to any muted, worrisome signals pulsing across the network. It's a telling portrait of our times. As all of us slip in wearisome work and home routines and the only time we're stirred is while prepping for stir-fry veggies, we're all craving that long-forgotten touch, a dash of excitement, a breeze of adventure, and a surfeit of scenery change. Which is what makes us all vulnerable to online missteps and stumbles.Meanwhile, Jimmy's mother, Mary, wary of her son's sudden online handfasting, ropes in her nephew, maverick, and moody night-shift IT dredger in Kochi, Kevin (Fahad Faasil) to hack out more information about the girl. Kevin, struggling with his own relationship with team lead and lover Sanjana (Amalda Liz), scoffs at his cousin brother's latest amour. What he thinks of women and affairs of the heart is established as he and Sanjana spar over work and his ego. This angle, perhaps, is the only one in the movie that limps a little, but director Narayan moves the video calls and chats along at a snappy pace, so there's no time to ruminate as Jimmy gets into trouble, mysterious events circle around Anu, and it's up to Kevin to unravel and disentangle his cousin - and the family - from a rapidly disintegrating situation.Wound up tightly, C U Soon uncoils swiftly and effectively with director Narayan wearing his experienced and ace editor's hat, and in the process of expending its fraught energy, exposes a gutting and heartbreaking side of what so many women and job seekers from Kerala undergo in the Gulf countries even in these hyper-connected times of Facebook and Hangouts. And as Faasil's Kevin discovers the truth, his demeanor and façade changes and melts, the unspeakable horror that unfolds on his screen crushing his superbious shell. The actor - also co-producing the movie - plays Kevin with a studied and effective intensity that segues from disdain to genuine concern, his phiz a portmanteau of bubbling emotions. Fahadh Faasil is a joy and a treasure to behold and cherish at the cinema, and C U Soon cements his place at the thinking actor's marquee. Aided by Gopi Sundar's background score that swells and rouses in the romantic scenes a la Ilaiyaraaja and taps nervously elsewhere, the movie also has a very effective and sincere Roshan Mathew and a heartrending act by Darshana Rajendran raise their scenes to more than a digi-slick-and-click.Even if director Narayan ends the movie with a prayer for all of us to congregate at cinema halls soon, he wouldn't want you to, in the meantime, carelessly swipe and chat indiscreetly online. And even if you do, the movie's biggest hope is that you do what's right by the other person in the chat window."}, {"id": 160, "text": "With C U Soon, Mahesh Narayanan proves that he has plenty of interesting stories to tell, in interesting formats, about interesting characters. Taking the worldwide lockdown into account, Mahesh and his stunning set of actors (Fahad Fazil, Roshan Mathew, and Darshana Rajendran) pull off an effort that thrills, tugs at your heartstrings, and leaves you with one of the most satisfying film experiences in recent times.If you have watched films like 'Searching', 'Profile', or most recently 'Host', you'll be familiar with the subgenre. The proceedings unravel over different device screens (phones/laptops), telling a story that revolves around the virtual lives of the film's main (and supporting) characters. It begins as a simple scenario of meet-cute between Jimmy (Roshan) and Anu (Darshana) on a dating app and they vibe quickly. In a span of a week (and several video-calls &amp; chats later), Jimmy falls deeply in love with Anu and expresses his desire to marry her. However, Anu's background and digital presence remain shrouded in mystery.That's when Kevin (Fahad), Jimmy's cousin and a cybersecurity expert, makes his entry. Things escalate pretty quickly from there on and all of it is best enjoyed spoiler-free. This is Mahesh's second writing and directing feature (after a spectacular 'Take Off') and while the scale here is a lot smaller than that film, it's compellingly written and crafted. At a run-time of 98 minutes, the storytelling is crisp with no unwanted scenes. Performances-wise, Roshan is great, Fahad is exceptional as usual (his eyes, good lord, they're gifted!), but the top honors in C U Soon go to Darshana Rajendran who comes up with a tremendous feat that makes you feel immensely sorry for Anu.Being an ace editor, Mahesh makes exemplary cuts that smoothly transition from one device screen (and/or app) to another, revealing significant details in every scene. The climax is an emotional rollercoaster, one that works so well because of the lead actors and the way they've been written. This will, in all probability, be the best OTT Malayalam film until we get to set foot in a cinema hall again. A big thank you to Mahesh, Fahad, Roshan, Darshana, and the rest of the crew for satiating our cravings for good content, superb storytelling, and kickass performances."}, {"id": 161, "text": "'C U Soon' (2020) - A routine thriller done differentlyWatched this much talked about Malyalam film directed Mahesh Narayan yesterday.There is nothing new and the film treads the routine path of an average thrillers that are abundantly available on OTT platforms these days but, at the same time, scores very high in terms of digital technological innovation .The film, however, suffers due to its weak script. The very first shot begins with a chat on an online wedding web-site and smart viewer can well anticipate the events that would unfold later. And once the secrete is out in the open there is little scope for any character development due to steady deployment of computer screen shots all through the film. Needs to be appreciated, however, that there are no logical inconsistencies in the presentation.The innovative film-making format is laudable. Music too is appropriate. Direction ... mostly editing ... is fine. As for acting, Anu (Darshana Rajendran) does all the heavy lifting. Jimmy (Roshan Mathew) in the lead role is okay while Kevin (Fahadh Faasil) keeps the hype going.Incidentally, the film reminds me of Gustav Möller 2018 Danish film 'Guilty' which portrays the plight of a police officer's race against time when he receives a distress call from a kidnapped woman.This film can well be compared with 'C U Soon' since it's also a thriller and, though shot in a conventional manner with a single character siting in police control room, viewers are left to imagine events happening elsewhere virtually. The character of visible police officer and other non-visible characters &amp; events are brilliantly developed through creative script and dialogues. The suspense, thrills, twists and turns keep viewers glued to their seat stupefied and the moral dilemma in the end makes them ponder over the happenings for a long time after the film is over.C U Soon lacks such depth of content due to average script and limitation of the chosen medium. The movie appears shallow in that respect. Besides, with its small plot-line, the director seems to be trying to fill the time to make it past one and half hour mark. Also those not accustomed to fiddling with the computer and the digital gadgets may find it quite difficult to follow.My rating...For tech-savvy viewers with penchant for thrillers: 8 out 10 For art-house movie viewers: 5 out of 10 Rest: 3 out of 10Ram Tayade (Deshmukh) 4-9-2020"}, {"id": 162, "text": "It's wrong to call C U Soon an experimental cinema, instead it can be described as an Indian prototype of high quality, low budgeted future of independent cinema. Though Searching set the tone for this genre of cinema, C U Soon is not at all far behind in any way and nails it completely with its spectacular screenplay and an interesting storyline laced with mystery. C U Soon set entirely on computer screens and smartphones, the film follows a love smitten young man to becoming a victim of circumstances.The film mainly targets millennial audiences, who would be completely well versed all the computer and Internet jargon. C U Soon, produced by Nazriya Nazim and Fahadh Faasil, is a quickie that is quick to hit its stride and draw the viewer into its intriguing, dynamic virtual setting. It calls for absolute, uninterrupted concentration, which isn't, contrary to how it may sound, a dreary drill for the audience. The methods it uses instead enhance manifold the thrills that the folds of the mystery-laden tale hold.Full credit to director Mahesh Narayanan for going all out with the concept with a equally convincing screenplay. Though there are small logical loopholes, it can be overlooked, considering the venture. It was good to see Fahadh Faasil to his usual best after potboilers like Adhiran &amp; Trance. Darshana Rajendran too delivers a moving portrayal of Anumol, a girl of many shades.Overall, C U Soon would a very satisfying watch for audiences of all ages. Though non malayam speaking audiences would find it difficult in understanding line by line typed messages on screen initially, subtitles would eventually come into play and save the day. C U Soon is a great example of cinema of the future in India."}], "reviews_amount": 163}