{"name": "Trump Card", "titleId": "tt12109842", "reviews": [{"id": 0, "text": "Another great documentary. It didnt disappoint but it was shocking at times. Certain revelation about previous President I admit never heard of. Dinesh is a very talented teacher and story-teller. It takes an immigrant who gets to appreciate the country for its forgotten values by many who are born in it and take its freedoms for granted."}, {"id": 1, "text": "Dinesh D'Souza distorts and fulfills George Orwell's warnings in his worthless Trump Card.I suggest going and watching Dinesh D'Souza debate Matt Dillihunty. You can find the debate on YouTube."}, {"id": 2, "text": "Incredible movie highlighting the sick truth infecting our beautiful country. A must see for the entire family in order to ensure our children understand where we are and where we could end up if we decide to not pay attention and listen to the truth."}, {"id": 3, "text": "If you love your country this is a must see. This notion that free things will fall from the sky and rain down upon our heads for generations is a lie and a dangerous one. Socialism will destroy us if Americans do not rise up and stand against it. This movie wonderfully shows the agenda to usher in this dangerous ideology, and how we can prevent it and preserve the greatest nation in the world.Also, I'm 100% convinced the ratings of 1 are people who simply didn't watch. I've seen some really bad movies get 4s and 5s. There are people rating this low to drag it down and not even watching because so many have undiagnosed TDS."}, {"id": 4, "text": "Once again, Dinesh D'Sousa puts out a thought provoking movie that displays the left's true agenda - turn the USA into the USSA. The left will disagree with this movie (and this review) with all the facts presented. Why? Take it from Joe Biden himself. We don't believe in facts, we believe in truths. Welcome to the USSA if he wins. #Trump2020"}, {"id": 5, "text": "Finally, a movie that doesn't base itself on disproven conspiracy theories. MSNBC and CNN will not love it, neither will liberal supporters of Joe Biden - but, one consider the source when reading their obviously biased, so called objective reviews. As an undecided voter, I can honestly say the movie confirmed my suspicions about the press these past 4 years and has helped me decide who I will vote for."}, {"id": 6, "text": "As with most historical facts interpretation is up to the reader. This movie is no different. What Disouza attempts to claim as fact is many times opinion not based or backed by facts."}, {"id": 7, "text": "If you look at the score for this documentary (actually all of Dinesh's documentaries), you'll see they're always somewhere in the middle, between 4 and 6. And that's because everyone either gave it a 1, or a 10. Facts vs feelings. Conservatives vs Liberals, Red vs Blue. It's the same old story. And everyone has already made up their mind. Truth is, as good as this film is, it's probably not going to change anyone's mind. It holds to the old saying, if you're under 30 and don't vote Democrat, you don't have a heart. If you're over 30 and don't vote Republican, you don't have a brain. The outliers from either group are explained by the fact that some people grow up fast, some people never grow up."}, {"id": 8, "text": "Thankful to dinesh for stepping up and speaking the truth boldly in spite of attacks. The movie covered all important issues that is facing the country today."}, {"id": 9, "text": "An imagrant with fresh eyes (the creator of this documentary) takes an honest look at what is happening within the political and economic arena of America, highlighting much of the political corruption, madness and manipulation taking place. Every American who cares about their country should watch this. I found it very factual and it presents those facts not with spin but actual evidence and witness testimony."}, {"id": 10, "text": "Best documentary from Dinesh till date. Every American should watch and vote without fail. Democrats want to destroy America, time to wake up and reject career politicians."}, {"id": 11, "text": "If Dinesh D'Souza hadn't solidified his place in cinematic history--cinematic doing a lot of leg work here--as the worst documentary filmmaker of all time, this surely pushed his whatever remaining distance he needed to claim that title.I have forced myself to watch three other of D'Souza's films: Hillary's America, 2016: Obama's America, and Death of a Nation. These films relate to Trump Card by their propaganda like quality and immense failure from a filmmaking perspective, but this sets it apart by just how embarrassing it is.The film opens up with Dinesh D'Souza walking around America with the red flag of communism poorly photoshopped everywhere. Here, D'Souza makes the pitch of his film: that Trump needs to win reelection, otherwise socialism will take over America. What does D'Souza think democratic socialism is? Well, he thinks it's what democratic socialist George Orwell was warning people about when he wrote 1984.After that, we get what can only be described as fan-cam footage of Trump and then a reenactment of Trump calling D'Souza to offer him a pardon. For some reason, the voice actor for Trump sounds like a Trump impersonation from someone trying to mock him would sound like.When it finally delves into the documentary aspects of the film, just how lacking in credibility D'Souza is becomes incredibly apparent. He can't find a singular expert on anything; just a couple prominent conservative figures, some Twitter-famous conservative, his daughter, and a woman who claimed her organization True the Vote was investigated and harassed by the Obama Administration for being right-leaning (in truth, it was investigated for alleged voter suppression and fraud). The most bizarre interviewee being someone who claims to have information regarding Minnesota Congresswoman Ilhan Omar being connected to terrorists, yet instead of turning this information over to authorities he's elected to just tell Dinesh D'Souza about it.With no understanding of what he's talking about and relying on conservatives who are clearly unlearned in what they're talking about or just lying, Dinesh D'Souza has made his worst documentary to date. Possibly even the worst documentary ever made. I mean, in Death of a Nation, D'Souza at least got an actual historian to interview: D'Souza allegedly edited the clips to make the historian sound like he agreed with him, but at least it was an actual expert."}, {"id": 12, "text": "The mainstream media will do anything to stop this president. Thank you for producing a film that pulls back the curtain on what is really going on."}, {"id": 13, "text": "Those of us that prefer to skim the headlines and trust the government, may be shocked to find a siege is underway. The course of American history may be changed forever. If your a moderate, this movie is a must see. If your a conservative, this movie will confirm what you know. If your a liberal, you'll run to your safe space, waiving the race card. Dinesh plays a mean hand of political poker. Trump is Ace to the Socialist Joker."}, {"id": 14, "text": "Eye opening, informative, another great movie by Dinesh. MUST WATCH, the media won't tell you this."}, {"id": 15, "text": "I love D'Souza and will listen to waht he has to say, check it out"}, {"id": 16, "text": "Well made and another great documentary to add to Dinesh's win list. Appreciated learning some new things. Thanks to Dinesh and his family for their courage in uncovering and delivering much needed information to America."}, {"id": 17, "text": "This is nothing more than a communist-style propaganda film to glorify dear leader Donald Trump. If you love it, you will still love him when the film is over. If you hate him, it won't make you change your opinion of him (as hard as Dinesh tries to do so). Trump will definitely go down as the worst US president of all time, so I'd say this propaganda film will become a bit of a cultural artifact, sort of like the films of Leni Riefenstahl."}, {"id": 18, "text": "Dinesh covers an excellent mixture of hot button political topics backed with evidence you can easily look up and verify yourself. He points out issues and concerns many of us share with the current Democratic Party. Taking you on a history lesson around the globe to see how different political and governmental structures function. Dinesh from India and his wife Debbie from Venezuela offer an interesting contrast in the effects of socialism at different stages. By the end leaving the viewer with a greater understanding of world history, politics, religious institutions and the mindset of the Republican Party today."}, {"id": 19, "text": "Every American must watch this movie. Very well produced movie. It is such an eye opener &amp; thought provoking movie. This by far is the best work of Dinesh D'Souza."}, {"id": 20, "text": "In this short film Dinesh lays out how the forces of the liberal left are working toward the destruction of the United States. It's a chilling expose on how half the American people have been propagandized against their own country."}, {"id": 21, "text": "Dinesh covers an excellent mixture of hot button political topics backed with evidence you can easily look up and verify yourself. He points out issues and concerns many of us share about the current Democratic Party. Taking you on a history lesson around the globe to see how different political and governmental structures function. Dinesh from India and his wife Debbie from Venezuela offer an interesting contrast in the effects of socialism at different stages. Leaving the viewer with a greater understanding of world history, politics, religious institutions and the mindset of the Republican Party today."}, {"id": 22, "text": "Trump card is an accurate layout of American politics in 2020. Pop culture and media have been bought off and there are no one to push back on the insane ideas that are being pushed by the democrats today.Most democrats don't even understand what is going on. They think that the party today is still the JFK democrat party. The republican party has always been in support of American ideals and haven't departed from the notions that you are responsible for yourself and can do anything. The government won't hold you back.The democrats are still trying to convince people that free is an opinion and it should be easier. The fact is it is easy, as long as you are able. If you are not able, we still have that safety net. If you build a safety net for the whole society, who will want to do anything?"}, {"id": 23, "text": "Every Democrat and Trump hater should watch. Socialism geez careful what you wish for."}, {"id": 24, "text": "Excellent film, makes a lot of sense. If you watch it with an open mind you will understand it better. I highly recommend it"}, {"id": 25, "text": "This is so well done and a must watch! There are insidious forces in this country spreading lies and misinformation about America. The truth is that America is an amazing place blessed with many fortunes by God and is worth fighting for!"}, {"id": 26, "text": "I wish our media had a commitment to the truth. We have to look for it ourselves and thank God for Dinesh."}, {"id": 27, "text": "Before watching this film, I had low expectations as I thought it was another documentary. But right after the movie began, my interest grew exponentially. The film did not show any bias as the director interviewed different people of different backgrounds. The film highlighted how the mainstream media shows fake news and this is one point I liked. The part about radical Islam and Biden family's dealings with China and Iraq are the major high points(my favourite scenes). I also learnt how Mr Lincoln fought to stop slavery and free African Americans despite being a Republican. That scene touched my heart personally as the same African Americans along with radical leftists broke down the statue of Mr Lincoln during BLM protest. Overall, this film is the best documentary film ever and I look forward to watching it again! Congrats Dinesh!"}, {"id": 28, "text": "Documentary? Pure nonsense masquerading as an expose pushing further partisanship. D'Souza is just a right wing shill manipulating facts to suit his agenda. Confirmation bias for those who agree with him, misinformation for those unsure, and laughable propaganda for everyone else."}, {"id": 29, "text": "Perfect timing to release this movie. I hope this movie will be an eye opener for American Voters. Except American media, Democrats rest world is wishing Trump reelection. If Democrats win election, China will rule the world and new wars will start."}, {"id": 30, "text": "Superficial but factual. Get the point across. I'm French and I don't understand the mental degeneracy of so many Americans 1. that don't understand that the US is the greatest country that ever was, 2. that work to undermine and destroy unparalleled institutions. 3. that swallow the incessant garbage spewed by the main stream media."}, {"id": 31, "text": "Words can't describe the power of this film. Watch it and make your own conclusions."}, {"id": 32, "text": "Another Gem from Dinesh D'Souza. From the acclaimed film maker who brought you Hillary's America, Obama's America, and Death of a Nation, now comes Trump Card. Mr. D'Souza explains, in plain English, how the DemocRAT Party has become Bruce Willis in The Sixth Sense. The DemocRAT Party is walking around dead and very few people are aware of the fact. Once the African American community deserts the DemocRAT Party, the party will crumble like a house of cards. Truly, there is very little holding the DemocRAT Party together in 2020. Their demise is just a matter of time, and Mr. D'Souza shows it in this movie. This movie is for all freedom loving true Americans. Do yourself a favor and rent it today."}, {"id": 33, "text": "One of the most observant movies. I am sure liberals will get crazy after seeing this!"}, {"id": 34, "text": "Finally someone is exposing these crooks , they are literally selling us out to foreign countries.God bless America"}, {"id": 35, "text": "Historical journals are a study-able and a written documentary of our times. History is repeating itself as we live and breathe. Mr. D'Souza has encapsulated the why and how as to why we are in the most troubling times in AMERICAN History. Those with less than traditional lifestyles (LGBTQ), those who are fighting to keep their constituencies voting for them (Politicians), those who are un-American in work ethic and nature (Gen Z-ers who have been given participation medals for underperformance), the Media, the religion-less many, and those who are complainants in their own unsuccessful lives (Antifa, BLM, and etc.) embrace the Democratic Party. Much like the way The Mainspring of Human Progress documented the why and how as to America is the greatest country, Trump Card is the most concise narrative of what and why is wrong with the country and many of her citizens today. Watch to understand. But, from my standpoint, this is the why and how to these troubling times. Thanks Mr. D'Souza for your contribution and perspective."}, {"id": 36, "text": "Dinesh has been exposing corruption for years! Thank you for exposing the truth, God Bless you."}, {"id": 37, "text": "Watch. Listen. Learn. Vote.Socialism is not for winners."}, {"id": 38, "text": "I absolutely loved how inspiring Hillary's America was. That film gave us insight into the history of the Democrat party. Trump Card gives us insight to these new young Democrats who are being used to further the goals of the old guard. Great film!"}, {"id": 39, "text": "America is on the verge of collapse. Socialism will ruin it, like all other countries that have been degraded. Dinesh comes boldly as ever in this riviting motion picutre that is 100% professional and heart touching.I was concerned this movie would be overwhelmingly negative wreaking havoc on my mind but in the end I came out of this movie, American watching from India on work trip, feeling hopeful for America with Trump at the healm and the American voice standing strong.We must honor God, have moral values, work hard, and stick to the traditional values of USA to stay United. Dinesh had great interviews in this movie. The one muslim iman said they love the left because they are so foolish and help radical islam move forward. One man from Venezuela talked about socialism in his country made no sense. He said when he gave his son duties to watch all cattle on their farm he didn't care less. But when he gave his son 1 cow as a pet he relentlessly cared for it because it was his.Great job Dinesh! I'm in your home country India for work, and I already have a deep appreciation for your country India but thank you so much sir for all you are doing to help USA! You are a true American, loved and cherished!"}, {"id": 40, "text": "This is the most important election in the history of USA. Vote for Democrats will lead to Socialism in USA. Open borders, free healthcare for illegal immigrants. China will become world leader."}, {"id": 41, "text": "Everyone should see this film. It is truth and Americans need to fight against Socialism!!"}, {"id": 42, "text": "Great film on the unreported reality we are living in. A must see before the upcoming election."}, {"id": 43, "text": "This works as a propaganda fiction piece at best. It was uninspired and filled with too much false and misleading information to be considered a documentary."}, {"id": 44, "text": "What's funny about the negative reviews, is they claim lies and propaganda with not basis or proof outside of it being different than what they've heard in the past. I especially like the parallels in this film to Venezuela because what the far left continues to push, has a stark resemblance to what that country is going through and why people are starving, dying, and doing all they can to get out."}, {"id": 45, "text": "This is a MUST WATCH DOCUMENTARY movie if you want to understand what is going on today in our country.I had no idea what to expect and was so surprised to learn so much about Socialism, Barack Obama, Islam and the evil direction Socialists wants to take our country. We witnessed many brave Americans today standing up for the USA and details about how China has bought our government officials to influence the direction of the country . Blend in 1984 and I walked away disturbed but enlightened.Again, this is a MUST WATCH MOVIE."}, {"id": 46, "text": "It's a ton of points in a short amount of time. Completely captivating. A lot of people will hate this and say it's propaganda, but all the stories and facts check out."}, {"id": 47, "text": "Must watch, Live the movie great I factual I formation from start to finish. I see a bad review here. The person who wrote it must be, liberal, a liar or communist. Please watch it!"}, {"id": 48, "text": "This stuff doesn't even make sense so that only a complete fool would believe it."}, {"id": 49, "text": "This filmmaker is an alt right, conspiracy theories who plead guilty in 2014 to a felony charge of making an illegal contribution in the name of others for a republican candidate in NY!! He is one of many criminals trump has pardoned!! So, you think you are going to get truth &amp; facts out of this guy, NO!! He only pushes the pro trump narrative that WILL destroy the US!! He wants you to believe the nut job Qanon &amp; other alt right wackos!! Don't believe anything about democrats being socialist or any other nonsense these Nazis want you to believe!!"}, {"id": 50, "text": "Yea this dude is a fraud. The movie is a love letter to his favorite 45. Wouldn't recommend unless you need something to burn in a fire."}, {"id": 51, "text": "Lots of facts in this you won't find on msnbc or cnn... the only place you will find the proof behind this film are if you read actual court documents or find someone who will read then for you. The film could have been made a bit better, sticking to a classic documentary style. It mixes personal story a bit much. But that's not necessarily that bad."}, {"id": 52, "text": "I've followed Dinesh's work since he was in college. Loved Death of a Nation. Haven't seen the others. Knew most of the things in the movie, but there were a couple of insidious items that I wasn't aware of. Truth is power."}, {"id": 53, "text": "Everyone should watch this!! It was good to see the truth being told."}, {"id": 54, "text": "Dinesh is on point again with another truth filled documentary. Must watch if you LOVE the United States of America and love being free. Its a hard hitting documentary of what has been happening to America over years of democrats pushing their leftist and democratic socialist agenda while lying to the American people. It hits on the corruption with politicians, corruption in media, corruption in 3 and 4 letter agencies and the false narrative on climate change."}, {"id": 55, "text": "Honestly boring, I was expecting hardcode true and realizations, to be shock or at least controversy but nothing, is just 1 hour and a half of him guiding the people on the interviews to acommodate what he is trying to say"}, {"id": 56, "text": "Dinesh moved here because of socialism in his own country. He is a very good story teller and backs up his story with facts. This is a very good movie and may convince you Trump really is keeping USA from socialism. Because Trump is."}, {"id": 57, "text": "Either you live it or you hate it.. no one could meet in the middle these days and not be totally biased. The progressive left going to hate it and the conservatives right wing will love it that's how it goes! The left hate facts and when they get called out on it They turn to you and yell out and call facts lies??? It's a mindless attempt to try to convince these crazy Bernie' Crazy Nancy' Crooked Hilary and Sleepy Joe Biden supporters that President Donald Trump isn't the devil reincarnate.. so watch it and enjoy my Openminded friends."}, {"id": 58, "text": "The editing look like it was slapped together over the weekend just in time for presidential elections.. the propaganda is high in this one and the mood at times feels like your watching something that came out of a communist country. Really no fact check based and over dramatization, opinion based dramatization. He should of have just done a biography to show appreciation rather then making a fictional based documentary. The review scores (1 or 10) pretty much says it all this film stank."}, {"id": 59, "text": "The only reason this film has low ratings is because of the brainwashed left that this movie talks about. If you are a Democrat you need to watch this movie. If you are a Republican you need to watch this movie. If you are an independent you need to watch this movie. America needs to watch this movie."}, {"id": 60, "text": "Dinesh D'Souza is mixing up Socialism with Communism. Good that there are pro-Trump movies but why don´t try to be more nuanced. You don´t have to see this one, but if you do try to have a critical mind."}, {"id": 61, "text": "More Truth, a must watchShare with family and friends"}, {"id": 62, "text": "Nothing much here beyond what the title of the review describes.Talentless director. Poor lighting in many scenes. Amateur hour. Documentary? Not a chance. More like ostentatious redneck propaganda."}, {"id": 63, "text": "Think back and remember we always knew the corruption of Government, lifer politicians living off tax payers while scoring deals to fill the pockets of their friends, family ... and their own. Historically factual, currently evident. Power and greed fuels politicians. We always knew that and have said so for decades. So is there any question or surprise that when a non-politician comes in to flush them out ... THEY AND THEIR MINIONS GO INTO FULL ATTACK MODE!? Also, historically let us think, which political/economic model has always created the largest wealth and power divide? Socialism/Communism. We've always known this. This movie does well to open our eyes and remind us, of what we've always known but have been brainwashed to forget."}, {"id": 64, "text": "Doesn't matter where you are politically. This is just so badly done. It is hard to watch. Terrible acting and stuff is almost laughable. He really isn't very good at making a film."}, {"id": 65, "text": "This is mostly nonsense and revisionist history with an admittedly declared bias.Objectively there is some production value here (as in the camera work and editing of this garbage was good) so there is that.It is good fodder for the tinfoil hat crowd."}, {"id": 66, "text": "Director is off his nut. Ridiculous and full of nonsense."}, {"id": 67, "text": "So many Lies. All propaganda.useless. Not even if, like me, you want to see how the other side thinks"}, {"id": 68, "text": "This is simply an amazing documentary. So well structured and extremely smart. Breaks down pure facts and combines them with perfect conjecture but all with logical base points. Everyone involved in this masterful documentary should be proud. And honestly, every American should see this before they cast their vote in November."}, {"id": 69, "text": "When it's literally the same director who's literally put out several documentaries with a pro-Trump agenda. Ask yourself? Might this information be just a lil bit bias? And if it's drought with bias, is it all that factual? Or is it just ANOTHER movie designed to rally Trump's cult members? 🤔"}, {"id": 70, "text": "If your daughter came home and told you she was dating someone and then told you that he was a convicted felon, would you question his integrity and morals at first? Would you investigate him to make sure he's changed before possibly accepting him into your family? You should be doing the same with this convicted felon. And I'll tell you, he hasn't changed. He's a con artist through and through."}, {"id": 71, "text": "They way this was documented was bits and pieces without putting the whole true facts which makes republicans look good on film but bad in real life. I'm 100% sure everyone who gave an honest opinion and review with high stars or ratings would not like (Totally Under Control) and (UNFIT) Documentary. Watch all 3 then give your ratings and opinion both on film and documentary facts. Truth really hard to swallow as a republican supporter."}, {"id": 72, "text": "This was eye opening movie. All the different interviews like the one with the Muslim who was speaking the truth about why they vote liberal but don't really support the liberal ideas. He said conservatives have morals and values. Also all the corruption that is revealed."}, {"id": 73, "text": "No credible sources and unsubstantiated claims. All evidence is cherry picked. It is full of dog whistles and conspiracy theories. The fact that people believe this is unsettling and proves how weak minded Americans are becoming. It is unfortunate that Trump republicans think that Joe Biden, a watered down republican, is a socialist. A better title for this film would be 'red scare 2'. I would urge anyone who takes this seriously to look into what socialism is and what the policies of democratic politicians are. Orwell, who was an outspoken democratic socialist, would be disgusted by how his words have been twisted to fit the far right's agenda. It's interesting how adamant the right are that the left are destroying the country when it is controlled by far right politicians. (the senate, the presidency, and scotus). This documentary missed any opportunity to move people to the right by not including any facts or credible sources."}, {"id": 74, "text": "Agree it was shallow in substance but does stimulate the viewer to research these topics and does provide a good overview for people with limited attention spans. It does provide some understanding in why groups with opposite agendas collude together. Not easy to pack this many complex and controversial ideas into one film."}, {"id": 75, "text": "Don't let the lefties scare you away from this, it is an excellent documentary. Of course it's propaganda, any political film that's biased one way or the other is, however, it's definitely not fiction and should leave any Conservative or Republican unnerved at best. The reason the lefties don't like it is because it forces them to see what they don't want to see, forcing discomfort and second guessing."}, {"id": 76, "text": "Liberals will whine &amp; cry but facts are facts. Straightforward facts clearly presented. Make them cry again in 2020."}, {"id": 77, "text": "Conservative Speaking What a Great way to show the hardships of america Right now. After watching this im so much more in Love with America and Trump. Anyone who watchs this will be left knowing more about the Truth on what has Happened and happening with America Right now. 🇺🇸"}, {"id": 78, "text": "While I loathe biden bringing back the middle class destroying race dividing crime ridden obbama administration ideologies, worst in usa history, blaming asians is not only irresponsible, its a downright pathetic lie. add to that these societies do not have ANY of the social issues we have.. 18,000 murders /yr, drug overdoses every 15 minutes, sexual assaults every 45 minutes, 200-400 active serial killers at any given point in time according to the fbi (just to name a few) is that such a bad thing? corruption you say? LOL... look at Ohio right now!!! Detroit? Atlanta? NY? on and on and on Pick a city, any city, corruption is running rampant everywhere. FFS get a clue already and stop blaming everybody else... these are US of A issues and ONLY USA. We need a drastic reboot, from top to bottom, cause they way it is now aint working, never has and never will. until there is a native indian rightfully running this country, the entire thing is one big pathetic farce. we are now the laughing stock of the world. I am ashamed and embarrassed to be american. get a clue people"}, {"id": 79, "text": "I have noticed a significant difference in what the media portrays and what is actually happening. But I had no idea how far and deep it really was.Most people who watch this will be surprised with at least one or more details exposed in this film.You should always hear both sides before deciding who to condemn. Well I've heard alot from the other side. We all have.But no matter what side you think you are on and no matter what you have heard, you owe it to yourself to hear the other side of things."}, {"id": 80, "text": "Sure Dinesh has a clear bias in all of his movies. Sometimes it's hard to get by especially if you're programmed to believe your ideas are always right and the best ideas. If you can get away from the tribal programming the movie actually carries a clear message about capitalism/socialism and how Trump is serving as a modern day leader against evil/slavery. Really enjoyed the movie. 8/10"}, {"id": 81, "text": "I'd give this film zero stars if I could. A trumpism farce flop of a joke. This film is complete garbage."}, {"id": 82, "text": "Nothing new here. Just a rehash of all the conspiracy theories circulating on the internet."}, {"id": 83, "text": "If you want the Truth revealed in this day and age of False News, Government corruption &amp; the Leftest Agenda. Open your minds and research this information for yourself. 2 Tim 2:15 Study to show yourself approved to God, a workman that needs not to be ashamed, rightly dividing the word of truth."}, {"id": 84, "text": "First and most importantly the amount of Trump praise and admiration was overdone and saturated a lot of the film, but if you can make it through that aspect there is a lot of good information on the film. For those who are concerned about propaganda, there are a few points where they present unconfirmed information as facts but for the majority of the film they present verifiable information. If the production was better and the conversations felt natural flowing instead of being dominated by Dinesh, then this documentary would have gotten an extra star from me. And since this is a highly political film, I'll add that I'm not a particular fan of Trump and view a lot of his rhetoric as done in poor taste, but I do agree with a lot of the policies his administration has pushed. If you are able to watch the movie from an objective perspective you will appreciate it."}, {"id": 85, "text": "Wake up America! This movie will definitely open your eyes to the corruption!"}, {"id": 86, "text": "Well-thought-out, informative and eye-opening. D'Souza's, Trump Card is loaded with the truth. Socialism is evil in all of it's forms and must be stopped at all costs. Pay no mind to the haters (liberals) giving this a poor review out of spite or TDS. Watch it for yourself and then formulate your own opinion on it. Most importantly, make sure to get out and play your very own Trump Card at the polls!"}, {"id": 87, "text": "If you want a honest view of President Trump, Watch this. If you are not open to the truth then pass on this one."}, {"id": 88, "text": "In classic D'Souza style, the narrative is well constructed, fact-based, and filled with testimony. D'Souza declared many things I already knew, but his informative style is richly substantiated with great evidence. More evidence could have been included, but it would have made the narrative too long. Great authors/writers know when to stop. And D'Souza embodies that skill well."}, {"id": 89, "text": "The truth hurts and it's right in front of us. If we don't take our country back it will be destroyed by communism. 2+2=4 not what the state tells us it is."}, {"id": 90, "text": "This movie is must-see for every school and college! Most of Americans had never experienced socialism and underestimate the dangerous of it."}, {"id": 91, "text": "This is a great factual documentary about far left radical feminist equality seeking BLM Marxist communists a.k.a. Democrats. It is too bad that it is by a foreign entity, but we get it. The world admires US."}, {"id": 92, "text": "Dinesh D'Souza explains how Socialism is being implemented and how the media and our government targeted Trump and his allies. The filmography and symbolism was well done. If you're pro-Trump you will enjoy watching this. Those who suffer from TDS won't watch, they'll leave a 1 star review instead."}, {"id": 93, "text": "The Demonrats stole this election from our believed president. This movie should be shown in schools. The fact that the evil lying liberal media won't show you."}, {"id": 94, "text": "Well written and directs He documents the dangers and evil of Socialism."}, {"id": 95, "text": "You can take out trump in the movie and the movie still gives you the sad reality of what is happening. Wake up, doesn't matter what side you are on. American freedom is at stake."}, {"id": 96, "text": "To be honest, Trump Card didn't seem like a documentary. It is very very interesting..Felt like a story telling movie with all the events beautifully woven together without a moment of fullness.. Trust me, just watch it. You will be delighted."}, {"id": 97, "text": "So Good! A must watch!! Never hurts to view both sides of the aisle!!"}, {"id": 98, "text": "This is a treatise on the effects that TRUMP DERANGEMENT SYNDROME had on the leftists in the United States. Problem is... It's true! Watch it if you have not yet been brainwashed by the fake news media."}, {"id": 99, "text": "This is an amazing well documented account of the decline that is spreading across the USA right now. The socialist regime is intent on bringing this global warrior to its knees and it's people are simply so illiterate and controlled that they really are not aware. The self sanctimonious cockwombles of the left are hellbent on degradation as well as segregation and it is highlighted efficiently in this film !"}, {"id": 100, "text": "Trump Card is another documentary from Dinesh D'Souza for the 2020 United States Presidential Elections. In it,he tries to present arguments on why Americans must vote for Donald Trump,the incumbent and incompetent President of the United States who refuses to concede for two weeks after losing the election.Too bad that the so-called Trump Card will be played by Trump to hang on to the White House despite the fact that 24 out of 24 cases (so far as of this writing) has been dismissed at different courts at different states due to LACK OF EVIDENCE of election fraud.D'Souza presents the idea the nation is headed towards the direction of socialism which the Democratic Party adheres to. This was based on the book that he wrote entitled,United States of Socialism. He asserts that the Democrats are using various means to push the country closer into becoming a socialist state. He presents arguments such as gender politics, the destruction of capitalism, and of course the present status of the media, which is well known to the average American as fake news. He points them to the villainous Democrats such as Alexandria Ocasio-Cortez,who is known as A.O.C. , Ilhan Omar, and the likes.He also points to the direction that voting for President-elect Joe Biden or Democratic Party presidential candidate Bernie Sanders will put the country closer into becoming a socialist state.Let us discuss his arguments and present why they are completely false.Before we do that,one must take note of the manipulation of facts and biased interviews that D'Souza had to present his arguments.It was evident with the participation of business people like Alan Bender and right-wing advocates were there to make his case stronger.Too bad that the non-participation of political scientists makes his case a lot weaker especially with the credibility of his interviewees in great question.The first argument that was discussed was that the Democrats are placing the US to having it a socialist state. No question that the Democrats have promoted and pushed welfare system for the poor and the needy to obtain the lower class base. Senator Bernie Sanders,a self-proclaimed Socialist Democrat,made the bid for Presidency twice in 2016 and 2020.Unfortunately,he lost twice to centrist Democrats - Hillary Clinton in 2016 and Joe Biden in 2020. No question that socialism is not popular among Democratic Party. Besides,the top 1% rich and wealthy have strong hold of both Republicans and Democrats with the latter just providing a welfare for the poor. It is evident that the middle class does not have any representation in both parties. Added to that, one must also realize that Americans no longer have strong hold of their government for decades with manufacturing jobs being outsourced and off-shored to cheap-labor countries as the top 1% are increasing their wealth making lobby money easily affordable. Besides,they are already wealthier - the top 1% - compared to the 99% of the Americans. Although Trump did wage a trade war with China,too bad it led the US to a recession in January 2020 because of it. The corona virus pandemic only made it worse with the lockdowns and more than 30 million Americans getting unemployed.Another argument that he presents is the destruction of capitalism. No question that corporate elitists have strong hold of the politicians of both parties.Lobby money has full control of the government. In relation to his argument of fake news, one must realize that mainstream media is no longer fact-based but rather propaganda based. They are owned by corporations whether they are left-wing or right-wing. Besides, the media hides Wall Street's illegal activities, which should put an end to D'Souza's argument about the destruction of capitalism. Corporate media is the appropriate name for fake news. Even Fox News - a right-wing based network - is part of that together with numerous left-based network like MSNBC. Too bad that his argument about fake news when the focus provided towards Trump particularly his relationship with Stormy Daniels was an extremely poor argument. D'Souza tried to present a scandal that former President Obama is involved it.A sex scandal that is. Too bad that Trump has been involved in numerous sex cases way before he was involved in politics. He himself paid Daniels to keep his mouth shut during his 2016 run. In summary, news is all about profit rather than reporting facts towards the American public. Gone are the days when it is a reliable source of news.So overall,the documentary is a poor one that will only be appreciated by Republicans and hated by Democrats. But for the independent American thinker,it is not worth one's time. Evidently, the latest election result only proves that many Americans don't intend to play the Trump Card. But nevertheless, the Biden Card could probably a sequel to it."}, {"id": 101, "text": "I want to forget the content for a moment and just review this as Cinema. Of course this is not a work by FRONTLINE, or 60 MINUTES as a result there is little research into any opposing viewpoints, the only information you will receive here is the information from those espoused by the creators, so be aware that this work was not meant to be a Documentary.There is very poor editing, writing, cinematography, and was very obviously made on a shoe-string budget. In other words a serious cinematic work this is not, nor was it intended to Be. Stats by VOD Rental ( because of COVID and lack of interest by distributors, this film never made it into theaters ) show by the third week Trump Card had dropped sixth and eighth spot and falling since with a Rotten Tomato score 198/ 74 ).Perhaps the writing is the worst, quickly I become bored of the screaming at me to wake up and realize that America, our Lives, our Future are in peril, without actually telling me what that peril was!The word term Socialism is used extensively, however my mothers food subsidies, health care and social security are blatant socialism, so I was confused what the terror was supposed to be? More Unemployment Insurance, More Social Security, More Health Coverage, More Food Programs?Some have used the term Propaganda to define this work, and that is too Fascist a connotation, however Trump Card is an Info-Promo-Political-Advertisement, so the words Preaching To The Choir came to my mind. If you believe in this world view, then this Film will underscore everything you already adhere to, there is no new information here that could not be found on the net in minutes.If you do not believe in this worldview, then this Film is a fascinating ( albeit disturbing ) insight into the thought processes of people who DO believe this content. The sense of anger and fear permeates this work, and the individuals who created this material cater to this emotive content. So perhaps unintentionally this work IS a valid documentary, just not the one that the creators intended."}, {"id": 102, "text": "If you looked at the reviews, you're probably amused by most reviews being either a 1 or a 10. Neither of which indicate an aesthetic opinion but likely a political opinion. However, from a film perspective, the quality is great. But this film is about sending a message, a message about the threat of socialism. Unfortunately, that subject probably needs a part 2 to flesh out the details, but this film provides a dramatic introductory statement about the threat of socialism. And of course, Mr. D'Souza has written books on the subject if the reader cares to dig into the subject more.Quality 10 Message 9I gave the message a 9 because the subject had to be scaled down to fit in the small window of time. Of course it had to be scaled down, viewers couldn't handle a 3 hour movie. Whether you agree with D'Souza or not, there are mind-blowing revelations in this documentary that you won't want to miss. Clearly, anyone who says it's poo hasn't watched it or comprehended the message."}, {"id": 103, "text": "To say that Dinesh D Souza is an objective documentary filmmaker would be insane. He is the Republican version of Michael Moore. Whether you agree with his politics or not will determine if you like his films. Michael Moore sis alot more celebrated because he has the left wing view. His movies are entertaining and even funny but his claims hace been debunked over and over but the left loves him ao they ignore that.D' Souza gets either ignored or ridiculed. But rarely do the facts he presents get challenged. Mostnof hus claims you can verify yourself. Obviously, we are in an election year and millions will not even give this film the time of day. It is called Trump Card and it makes the case for him to get reelected but ut us more about how the media comtrols wjat peopke see as an important story and doesn't give the public the full story because of a particular narrative they want to push. That is what is scary. The media is free and should be a watch dog for everyone in power. Not just to protect who they agree with and destroy who they don't. Anyone with any sort of intellectual honesty can see the media is nowhere near objective now.This problem is bigger than Trump or any other candidate. And people who don't like him may not care that the medua and the government itself was trying to frame and sabotage him, but one day it could be done to someone they do care about.This film does preach to the choir a little too much, but it has points that should worry anyone, no matter what your politics are. You shouldn't be ok with media corruption just because you don't like someone's politics. Or ignore it because you agree with them.Grade: B-"}], "reviews_amount": 104}