{"name": "BomBhaat", "titleId": "tt12723616", "reviews": [{"id": 0, "text": "Nice movie,concept is different.Everyone must watch this movie"}, {"id": 1, "text": "Illogical movie. A very bad concept and no logic in the movie. Not much entertaining and too much boring."}, {"id": 2, "text": "Ignore reviews either good or bad this is good attempt telugu cinema so please encourage this type of telugu movies to get relief to old pattern FIRST WATCH THE MOVIE NEXT JUDGE THE MOVIE LAST COMMENT THE MOVIE"}, {"id": 3, "text": "It is very good movie and enjoyed. It's family movie and all together can watch. Good project work by entire team."}, {"id": 4, "text": "Pathetic story, even now a days short Films are better, Amazon is losing its reputation because of this kind of chillar, waste movie 🤢"}, {"id": 5, "text": "Nice work Chandini Chowdary &amp; priyadarshan keep it up"}, {"id": 6, "text": "Watch, if you want to have an evening with some genuine laughs"}, {"id": 7, "text": "Not a block buster movie. A one time watchable movie with friends. We have to appreciate the director for choosing a sci-fi movie as his debutant film. The major minus was concentrating on commercial elements in the movie. Due to more commercial elements, the flavour of sci-fi movie was missing. Major highlights was scenes between professor and Vicky. Those scenes are pure lit and emotionally connected to me."}, {"id": 8, "text": "Nice movie to watch with family members and great for time pass"}, {"id": 9, "text": "Not promising bad direction and screenplay and bad writing and music also bad . everything in this movie is bad .even actors are good actors but they are not acted good like in their previous movies .finally don't watch"}, {"id": 10, "text": "A clean classic sci-fi cult movie can be watched with entire family."}, {"id": 11, "text": "Happy to watch with all generations great work by the team congratssssss"}, {"id": 12, "text": "Nice 👌 movie , I enjoyed watching it. Chandini is beautiful."}, {"id": 13, "text": "Movie is good, I enjoyed alot and chandini's performance is good compared to her previous performance."}, {"id": 14, "text": "I watch very less telugu movie and don't understand but it made me and my family laugh. We enjoyed watching this movie . Very clean, good humor, comedy. awesome direction and screenplay and interesting plot twist. I would recommend ppl to watch this movie with family and have some genuine laughs."}, {"id": 15, "text": "Awesome Family Entertainer and Music Lover Songs. The BomBhaat Team had Nailed it and Cracked the Show... A Clean, Beautiful, Concept Oriented Movie suitable for everyone to watch and Enjoy... Great Job Guys 👍👍👍Rating for 5... Best Of the Best from my view... Production Line 4.5 🌟 Direction 4.5🌟 Cinematography 4🌟 Music 4🌟 Casting 4🌟 Songs 4.5🌟 Story Line 3.5🌟 Screenplay 3🌟 Dialogues 4🌟 Stunts 4🌟 Costume 3.5🌟 Make Up 4🌟 Comedy 3🌟 Background Score 2.5🌟"}, {"id": 16, "text": "10/10 Good entertaining movie, nicely connected. Kids enjoyed the robo and Director did his best to connect audience with story. Good experiment with movie and good message. Kudos and congratulations to the entire team members of movie"}, {"id": 17, "text": "A low Budget boring movie by another so called film director. Movie is boring from the beginning, no content. Bland movie with no content and dull performances and so on. Only positive thing is the Russian girls funny dubbing. Overall in two words Worst &amp; Boring."}, {"id": 18, "text": "Even 1 star is watse for this movie 0⭐0the worst movie ever I don't know why prime is releasing such a disgusting content"}, {"id": 19, "text": "The story is horrible , acting is decent but the whole thing is cringe Once I started watching it , I was waiting for it to end it's that CRINGE , also it copies many popular movie scenesFeels like a movie made by a school student a"}, {"id": 20, "text": "Movie was too good. Dialogues is so natural you will connect easily. Nice experiment by this team. Good job to movie team members."}, {"id": 21, "text": "Good movie everyone can watch this movie.😍😍😍😍😍😍😍"}, {"id": 22, "text": "As expected trailer was bad film is more bad Amazon prime? Don't you understand what you mean by a good film why do you pic all the worst content movie really very bad don't watch it"}, {"id": 23, "text": "Firstly i want to admit that i want to bow down to director for being able to bring some big character artists into board and get a good producer with this kind of a story and screenplay. Production values are top notch considering the market of the artists in the film but i have to admit i have some issues with your judgments.. I mean atleast during the process you should be knowing how bad this movie is going to end. I feel chandini chowdary got that feeling. Simran was rightly casted as robot.. That was the best casting in the movie. Waste of time. First one hour you will feel existential, you will try to get some patience and wait till the end in a hope that will this get any better. But it doesnt. It deteriorates eventually. Chandini and sushanth were ok but chandinis dubbing sucks.. I mean being a telugu girl she would have dubbed that but still i think she has lost faith in this film and stepped out after a while and they had to go for dubbing. Finally not even One Time Watchable. Please save your time and emotion."}, {"id": 24, "text": "Disappointing low-budget Sci-Fi film. Comedy is clean but not funny enough. Predictable story if you have seen trailer before. Background score in comedy doesn't sync and feels like you are watching some TV show or a TV serial. Most of the concepts are adapted like 'hero's life is full of unfortunes' from the film 'Lakkunnodu'. An action scene is directly copied from 'Iron Man 3'. On whole there isn't any positive parameter to make this film worth watching. Hope you don't waste your time like I did."}, {"id": 25, "text": "Congratulations to the whole team.. Movie concept is good and entertaining 😊"}, {"id": 26, "text": "New concept and entertaining movie acters gave their 100 percent efforts"}, {"id": 27, "text": "Truely a beautiful and unique concept, awesome direction and screenplay , interesting plot twist and unlimited fun. Tremendously great job done by the cast amd crew."}, {"id": 28, "text": "Good attempt, Slow narration, Goofy comedy. Film really good to watch. I wander why reviews are bad in other portal..."}, {"id": 29, "text": "Sloppy scenes,loud music...just unbearable to watch..also why does everyone talk in that accent??"}, {"id": 30, "text": "Yes, Bombhaat is no doubt the BEST thing that has happened to Telugu cinema in 2020. Other than 3 or 4 odd movies every movie that was released in 2020 including big banner films like V, Nishabdham, were all a disaster. So the Telugu Film Industry must honor these movies' (Bombhaat, Colour photo, Uma Maheshwara Ugra rupasya, etc) - Director, Producer and the team with a very Special Award. They all deserve it and they all helped the Telugu cinema to survive during this pandemic. Standing ovation to the entire Bombhaat team!!!!!!!!!!!!!!!!!!!!!!!!!!!!"}, {"id": 31, "text": "One of the best Telugu movies of 2020,engaging,surprising and entertaining!a must watch for all the movie lovers,it will not disappoint you"}, {"id": 32, "text": "What a headache, man... Zero logic, zero drama, zero story. The story revolves around (SPOILERS, if you care) an Artificial Intelligence machine, which is like made for some military or something, getting rejected or something, and then something-love-something. One thing, I guess, is that the writer/director watched too many superhero films, sat down next to the producer with 1kg cocaine, and wrote this on autopilot, where the cocaine artificial-intelligently decided to become the story-less script. After the impressive Chandini in Color Photo, her character here becomes the idiotic prop who has nothing to do. I will not go much into the film, because it is a waste of time. The story goes nowhere, the characters are idiotic and undeveloped, the comedy is chettha, and so on. The story doesn't live to its exciting title Bombhaat, instead, only becomes a Bomb, while we go  Haat!!! And walking away with a migraine."}, {"id": 33, "text": "Must watch movie. Comedy, story , music, direction, twists are super."}, {"id": 34, "text": "Good production values, great music, new theme and fun for kids too! Simran Sushanth and Priyadarshi totally rocked it!"}, {"id": 35, "text": "OMG! Indian movies making such a*&amp; kicking movies?? Hollywood -- Marvel, Disney, Warner bros --- you better watch out. BOMBHAAATT is coming to kick your :)"}, {"id": 36, "text": "Excellent screenplay, dialogs, music played its excellent job...This Science fiction movie can be watched along with family members....I congratulate the Producer, Director and the entire team of this movie."}, {"id": 37, "text": "Direction superb artist done fablous performance Loved to simran acting and chandini song chupanathi 👌🏻👌🏻👌🏻 over all children can enjoy the movie❤"}, {"id": 38, "text": "I dont watch lot of Telugu South indian movies, but after watchinf this movie i have become a huge fan of telugu productions. What a Marvelous movie Bombhaat was! Hats off to the Director and Producer for taking on such a challenging subject and executing it so nicely in such budget constraints. With sci-fi genre sky is the limit and with so many Hollywood hits already in this genre and quite a few in Indian cinemas attempting something like this is amazing. All the artists did a phenomenal job. Dialogues were so perfect. Music, songs, background score was on par of a Hollywood film. Special mention for the Editor, must have done some Hollywood movies. Overall, the Best movie I have seen in the recent years. please watch and judge yourself. Waiting for their sequel."}, {"id": 39, "text": "Movie is very much good. Nice thought how technology should be used. Unlike Shanker's Robo. Good Message. Good acting fab cinematography"}], "reviews_amount": 40}