{"name": "Comedy Couple", "titleId": "tt12758600", "reviews": [{"id": 0, "text": "Great movie.... very light hearted ... didn't took my interest off even for one second... SAQUIB. Is great in the movie as always 👍🏻👍🏻"}, {"id": 1, "text": "I feel fresh after watching 'Comedy Couple.' Great sense of humor and romantic too. Lie and Love both wins."}, {"id": 2, "text": "Shweta's performance was brilliant throughout the film. The chemistry of Zoya and Deep is fun to watch."}, {"id": 3, "text": "Amazing film, I just loved it. Really a nice movie. It is funny, interesting and romantic too."}, {"id": 4, "text": "Has some really good funny moments, very authentic story. No melodrama. It is such a simple and cute love story."}, {"id": 5, "text": "Acting was good. Chemistry between the actors is superb. The concept is fresh; I wish to watch the next part."}, {"id": 6, "text": "The acting done by Shweta and Saqib is just another level. it's just like they were real couples"}, {"id": 7, "text": "The stand up is quite funny and acting good by one and all specially Saqib. He looks cute and hot at the same time."}, {"id": 8, "text": "AMAZING fun weekend night watch, great chemistry between Saqib and Shweta. I Loved the role of Pooja Bedi too"}, {"id": 9, "text": "Good entertaining movie. Acting was also nice. Especially Shweta, she performs so well in different types of roles."}, {"id": 10, "text": "Deep was a predictable liar and Zoya was a predictable girlfriend. The ending was quite predictable too. Then also I loved it."}, {"id": 11, "text": "The songs were so cool. The settings in the movie were pertinent. Overall a good movie to watch and enjoy"}, {"id": 12, "text": "It's a good, refreshing movie with relatable characters. Both the leads have done a good job as the 'comedy couple'."}, {"id": 13, "text": "Swetha Basu Prasad's performance was good and she justified the role given to her best capacity in the film Comedy Couple."}, {"id": 14, "text": "Absolutely loved it. The chemistry and comedy in this film was superb. I really wish this was a series because I am craving more for it"}, {"id": 15, "text": "A fresh story, a glimpse of romance and funny story. I love the concept of the film Comedy Couple."}, {"id": 16, "text": "One should watch this Comedy Couple movie with their partner; it's really fun to enjoy this film."}, {"id": 17, "text": "Finally after a long time, I watched a decent humorous and romantic movie like Comedy couple."}, {"id": 18, "text": "The idea behind a husband wife as a standup comedian is great; the Comedy couple is creative and lovely."}, {"id": 19, "text": "I have been waiting for some comedy film for a long time. Must say it's worth watching a comedy couple on Zee5."}, {"id": 20, "text": "Fantastic comedy and dialogue. The Comedy Couple is sensitive and warm but refreshing and Fun to watch!"}, {"id": 21, "text": "Such fantastic acting after a long time, Comedy Couple is simple but entertaining and original."}, {"id": 22, "text": "Nachiket Samant directed a real and fresh concept. Just loved the idea of a comedy couple with sparkles of love."}, {"id": 23, "text": "The stand ups were shown quite believably. The storyline was quite relatable. I like the idea behind a comedy couple."}, {"id": 24, "text": "Comedy couple has such a unique story and packed with powerful performance 🎭 by fresh jodi of shweta and saquib..chemistry,comedy timings everything is just perfect.."}, {"id": 25, "text": "Just feeled love to watch such an UNIQUE Combination of Chemistry with the Comedy. Characters Nailed the Story."}, {"id": 26, "text": "I liked the edit work and the scene transitions. Strong punch of stand up comedy would make it more best but still it is good watch."}, {"id": 27, "text": "The trailer was really promising and hence will make people to watch in expections to see some good stand up comedyBut it is totally opposite there is no humour at all and they showed a ordinary love storywhen u have chosen such as a path then it should be dam hilariousthe movie was going on a very slow pace with unnecessary scenesSaqib and Shweta were good but they couldn't conclude a good showDon't expect any comedy"}, {"id": 28, "text": "If you are waiting to watch the film Comedy Couple, you should not. Watch it now, and enjoy the unlimited fun and love."}, {"id": 29, "text": "The performance of Deep and Zoya is so perfect; they have given her heart to every scene in the film Comedy Couple."}, {"id": 30, "text": "Highly recommended to watch this film, the direction, the creativity, the story, and the music was perfectly fitting at its place."}, {"id": 31, "text": "OH MY GOD! What an amazing series it is. I can't leave my seat while watching the film Comedy Couple."}, {"id": 32, "text": "Story is in its pace, the dialogue delivery is superb, and the romance, entertainment of the film are just wow."}, {"id": 33, "text": "I already called my friends and recommended them to watch this film of Comedy Couple, what an amazing story."}, {"id": 34, "text": "The editing part is so great, one can easily relate the story of Comedy Couple, but you can't miss the fun and romance."}, {"id": 35, "text": "Interesting one. I have never seen any movie, any concept like Comedy Couple ever. Enjoy this film."}, {"id": 36, "text": "Oh My God, such a beautiful story after a long decade. I have watched this film with my partner and I already liked it a lot."}, {"id": 37, "text": "A little twist with love and anger. Deep is a liar and Zoya has a loving character in the film Comedy Couple."}, {"id": 38, "text": "I really like this film called Comedy Couple do watch it guys. I enjoyed the full film, you will keep smiling."}, {"id": 39, "text": "Well done makers of Comedy Couple, you make it so crisp, to the point and not a boring series."}, {"id": 40, "text": "The direction and editing, in terms of understanding and grabbing the interest of the audience is so well-done in Comedy Couple."}, {"id": 41, "text": "WOW! I am speechless after watching Comedy Couple, amazing story, lovely direction and the visuals are totally up to the mark."}, {"id": 42, "text": "I didn't get bored at any moment in the film Comedy Couple. The scenes were so perfect and the story was so good."}, {"id": 43, "text": "This series is full of romance, love, lies and entertainment, which drives you crazy with the concept. Truly amazing!"}, {"id": 44, "text": "Full marks to the music directors and the story writers of Comedy Couple. I just loved it"}, {"id": 45, "text": "Average movie, new premise using standup, average execution. Has potential."}, {"id": 46, "text": "This rom-com focuses more on romance and less on comedy. The writing is mediocre, most of the stand-up punches fall flat, and humour beyond the stage is not that enjoyable.From the trailer, the plot renders freshness and looked promising but the movie is poorly executed. The makers are failed to deliver an endearing love story.Saqib Saleem and Shweta Basu Prasad deliver decent performances and they share watchable chemistry. Rajesh Tailang, Pranay Manchanda, and Jasmeet Singh Bhatia done justice to their supporting roles.Direction 2/5 Acting 2.5/5 Dialogues 2/5 Story 1.5/5 Screenplay 2/5"}, {"id": 47, "text": "Thought this would be something new but it was just the same cliched recycled love story you see in films. Not worth a watch."}, {"id": 48, "text": "Nothing amusing about two stand up comics who happen to be in love.limp listless bland and boring.2 stars"}, {"id": 49, "text": "Comedy movie I found myself refresh after watching this movie"}, {"id": 50, "text": "Comedy movie , kaafi comedyy. I love thi. Movie very muchh"}, {"id": 51, "text": "Comedy love based movie I like this movie very muchh"}, {"id": 52, "text": "Stand up is quite funny, love to watch this movieee Omg"}, {"id": 53, "text": "Oh my good , nice to watch this movie Very good movie Comedy"}, {"id": 54, "text": "Nice movie ,love go watch this movieWe will match many times"}, {"id": 55, "text": "Good refreshing movie , comedy , love story love to watch this movie"}, {"id": 56, "text": "Comedy .romatic , love story , nice to watch this movie ,youth type movie"}, {"id": 57, "text": "Great sense of humour and romantic Love to watch this movie"}, {"id": 58, "text": "The standup is quite funny , love to match this movie Saqib is very good"}, {"id": 59, "text": "Nice movie , comedy love to watch this , nice animation"}, {"id": 60, "text": "It was a hilarious show and really enjoyed the story line of the show."}, {"id": 61, "text": "I watched it on my friend's recommendation and it's di hilarious. Really enjoy ed the performance of both the actors"}, {"id": 62, "text": "This movie is really really really very good the chemistry between the characters is just wow! Must watch."}, {"id": 63, "text": "The movie is really amazing and very intresting...I watched it with my girlfriend and she loved it too"}, {"id": 64, "text": "Amazing to watch such a movie and I would recommend to my friends"}, {"id": 65, "text": "Great acting. Storyline revolves around day to day issues and how to handle them. It's overall a good and entertaining movie."}, {"id": 66, "text": "I love this movie...i would love to suggest this movie to my frndss..."}, {"id": 67, "text": "Acting is very good!!!! I loved alot!! Nd i would also recommend my friends nd my family 👌👌👌👌👌"}, {"id": 68, "text": "He is looking so good in this movie. Now I've a crush on him!!!😍😍😍😍😍😍"}, {"id": 69, "text": "It is an awesome movie and it's light to watch. It's good."}, {"id": 70, "text": "The actors were chosen perfectly according to the roles and their acting was fabulous."}, {"id": 71, "text": "It was worth watching and it was quite refreshing. Feeling light after watching this."}, {"id": 72, "text": "It was a nice movie and I would recommend to watch it."}, {"id": 73, "text": "Light and mood buster movie to binge on. Great plot and amazing cinematography,love to see more such in upcoming future"}, {"id": 74, "text": "Amazing and every couple should be like this and the story is nice"}, {"id": 75, "text": "The acting was super nice and on point. I, personally, loved acting if Pooja Bedi as Zoya's mom."}, {"id": 76, "text": "Although it's comedy movie but it was romantic and it was very neatly shown."}, {"id": 77, "text": "It's a nice and lovely movie. Worth watching, not a waste of time."}, {"id": 78, "text": "Live, Love, Laugh and that's the motto here. Loved the movie and the acting was amazing."}, {"id": 79, "text": "It's quite refreshing! Definitely not a waste of time."}, {"id": 80, "text": "Worth watching movie. The chemistry between the couple was awesome. Enjoyed it thoroughly❤"}, {"id": 81, "text": "Witty and funny is correct to describe this movie!!"}, {"id": 82, "text": "Loved it so much definitely gonna recommend my dear ones to watch this"}, {"id": 83, "text": "The movie is a great millennial love story and has a lovely concept. It is based on couples and their issues in today's world. It's a must watch"}, {"id": 84, "text": "Really fun to watch. Would recommend it to all my friends."}, {"id": 85, "text": "The movie is very impactful and is a completely new concept about relationship and it's issues. In the end love is what matters and this movie is a perfect example to that. Must watch"}, {"id": 86, "text": "I just love this movie... this is very cool comedy movie!!"}, {"id": 87, "text": "This movie is fabulous!! I loved it's a lot to!! I would love to recommend this movie to my friends and family..."}, {"id": 88, "text": "This movie is entertaining and with comedy. I recommend everyone to watch it"}, {"id": 89, "text": "It's super funny😂😂 The acting was on point and it was really nice!"}, {"id": 90, "text": "It's really funny and you won't be disappointed! Should watch this."}, {"id": 91, "text": "If you're having a bad mood then you must watch this!!"}, {"id": 92, "text": "Amazing movie . i loved it alottt...and i would recommend my friends and family to watch this movie .."}, {"id": 93, "text": "Really enjoyed the standup duo couple. Watched it after a friend's recommendation and I am glad I did."}, {"id": 94, "text": "This is such an amazing movie...I loved it!! I would love to recommend my friends too..!!"}, {"id": 95, "text": "Enjoyed the performance and story was new and interesting. Really enjoyed the jokes and the acting performances."}, {"id": 96, "text": "Really enjoyed this movie, heartwarming, nice flick during these depressed times. I would recommend this to everyone. Good watch"}, {"id": 97, "text": "Amazing flim, I just loved it . Fantastic comedy movie"}, {"id": 98, "text": "A whole live in couple lifestyle settled with stand-up comedy! It is beautiful, love and relationship captured in all 1.2 hours of movie. Really like the way it was all setup with up and downs in couples lifestyle while being competitive in there own life race. A complications of a couple's life with work and money! Beautiful cinematography and vibrant colors across the scenes. Love the use of lights!"}, {"id": 99, "text": "Amazing film, I just loved it. Really a nice movie. It is funny, interesting and romantic too."}, {"id": 100, "text": "It was fun to watch this. I loved everything about it."}, {"id": 101, "text": "Saqib Saleem is always my fav. He nailed it truly! Super Fun &amp; comedy"}, {"id": 102, "text": "Saqib is too good in this.... Acting was too good👏"}, {"id": 103, "text": "What a perfect rom com.. both the actors did great job..a must watch"}, {"id": 104, "text": "The Acting done by Shweta was natural &amp; fantastic.... Really enjoyed"}, {"id": 105, "text": "Not a fan of watching bollywood movies but ,it was worth of watching"}, {"id": 106, "text": "I've really enjoyed the movie. A movie with romance, comedy and drama. In my opinion,the movie was awesome.🔥"}, {"id": 107, "text": "This one's really beautiful. A great presentation of cinematography, acting and it's beautifully written. This is really new and fun to watch.If you're getting stuck with what to watch, then I'll recommend you to watch this one."}, {"id": 108, "text": "Amazing content, brilliant acting and the plot is beautiful. I really love watching rom-com, but this one is really worth watching."}, {"id": 109, "text": "This is just amazing and I want to see them again. What a chemistry !!! If you're want romance with comedy, then this is an amazing thing to start with!"}, {"id": 110, "text": "Acting was very good. The chemistry between actor and actress is so touching. Overall recommended to watch."}, {"id": 111, "text": "This is really amazing. I really enjoyed this movie. Come up with your popcorn and start watching it. I really loved this 💖💖"}, {"id": 112, "text": "It was such a fun movie to watch. Discovered a fresh movie after so long. Must watch!"}, {"id": 113, "text": "I had such a blast and fun time watching this light hearted movie. What a ride it was."}, {"id": 114, "text": "The chemistry between the lead is a delight to watch. I totally loved the movie. A must watch"}, {"id": 115, "text": "It was such a light hearted movie...totally loved it."}, {"id": 116, "text": "It's really funny and I really recommend that everyone should watch this!"}, {"id": 117, "text": "It's hilarious, I loved it! I recommend that you must watch this."}, {"id": 118, "text": "Nice movie. Must watch it.Shweta's role is incredible."}, {"id": 119, "text": "From now it is in my favourite list. Very funny scenes can't stop laughing."}, {"id": 120, "text": "A decent well made comedy entertainment and light hearted💓"}, {"id": 121, "text": "Loved the story...good movie would definitely recommend it uo my friends and family"}, {"id": 122, "text": "Amazing.. Such a good movie.Clean comedy nothing bad. I would recommend this movie to my friends and family"}, {"id": 123, "text": "Super Fun &amp; Comedy &amp; very well made simple film and perfect. Acting of all artists are decent"}, {"id": 124, "text": "Great comedy lines with a quite different story. Overall a good movie...."}, {"id": 125, "text": "Guys must watch movie.... awesome comedy... Amazing entertainment"}, {"id": 126, "text": "Really enjoyed the movie. Was quite entertaining and funny. I would recommended everyone to watch it at least once ."}, {"id": 127, "text": "So much fun in stand-up comedy and looking so cute. Entertainment and drama is also good..."}, {"id": 128, "text": "It's an entertaining movie which will make you laugh throughout... Overall it's an enjoyable &amp; fun movie to watch."}, {"id": 129, "text": "Movie is really very good... enjoyed a lot I recommend everybody to watch this movie for once. It is funny and plus entertaining"}, {"id": 130, "text": "Acting and direction gave this comedy romance a more beautiful shade. Entertaining. ❤"}, {"id": 131, "text": "Enjoyed a lot. From starting 2 end.both characters were gud."}, {"id": 132, "text": "Amazing movie...I loved it alott!!and I would recommend my friends and family to watch this movie..."}, {"id": 133, "text": "I think I wasted my time watching this. Just same old love story with an stand up comedian couple. Alot of cliché and clingy jokes. Don't watch it. Thank you."}, {"id": 134, "text": "This movie contain some laughs but overall it is a boring one time watching telefilm"}, {"id": 135, "text": "Wow, so real and relatable. The film is surrounded with all the situations which a young generation is facing"}, {"id": 136, "text": "I watched this film with my husband. Mostly he never liked a comedy film but he gave full rating for the film Comedy Couple"}, {"id": 137, "text": "Zohra, Rohan, and Mukesh have performed their part so well and they balance the story in the film. Good one"}, {"id": 138, "text": "Nachiket Samant has directed this film Comedy Couple which is worth watching. His direction of the film is innovative"}, {"id": 139, "text": "Amazing and Romantic story. I have seen something nice after a long period. The concept of the film is so unique."}, {"id": 140, "text": "Deep and Zoya looked so good together, they are the lead actors. The film Comedy Couple is super interesting"}, {"id": 141, "text": "Very familiar story of the film Comedy Couple. Every couple faces the same phase in their life"}, {"id": 142, "text": "Full entertainment, full on romance and yes of course full on fight. The Comedy Couple story is totally worth watching."}, {"id": 143, "text": "The dialogues are mixture of Hindi and English, which I like the most. It seemed so real when I was watching the film."}, {"id": 144, "text": "Mangesh Dhakde has given the background music in the film Comedy Couple; it worked with the theme of the story."}, {"id": 145, "text": "Comedy Couple is totally an uncommon story in comparison to Bollywood stories. Zee5 did a great job."}, {"id": 146, "text": "Comedy Couple is a great film. It is full of romance, fight, fun and entertainment. Loved it."}, {"id": 147, "text": "A couple lives together and they have fun. Hero is a liar and Heroine is sweet. I like the story of the film Comedy Couple."}, {"id": 148, "text": "Bikas Ranjan Mishra has written a good loving script, one can surely love it. The film Comedy Couple has a unique idea."}, {"id": 149, "text": "Fantastic Film! Saqib Saleem has multi characters in the film. This film is definitely a super hit."}, {"id": 150, "text": "Pooja Bedi has acted as mother of Shweta Basu Prasad. I love the connecting dots of mother and daughter in this film."}, {"id": 151, "text": "Don't miss the real entertainment. Deep and Zoya are the real Comedy Couple just like the name of the film."}, {"id": 152, "text": "Zee5 did the best thing for realizing the film Comedy Couple. I really like the film, the story and the direction."}, {"id": 153, "text": "Comedy Couple should be a hit. The actors should work on another film soon. I really like the film."}, {"id": 154, "text": "I love the film Comedy Couple. The plot and the story are totally at the place. Amazing concept and worth watching."}, {"id": 155, "text": "Amazing Story, beautifully presented by makers. Zoya and Deep looked so hot together. 10/10 for this film."}, {"id": 156, "text": "My wife loved this unique concept. She tried the role of Zoya. We did a lot of fun after watching this film Comedy Couple."}, {"id": 157, "text": "Zee5 you again nailed it by telecasting shows of different plots. I really like this film and recommend it to my friends."}, {"id": 158, "text": "The story is beautiful. I like all the songs of the film Comedy Couple. It is worth watching and refreshing."}, {"id": 159, "text": "This film by Nachiket Samant should be a blockbuster. I am giving full rating for this film Comedy Couple."}, {"id": 160, "text": "A couple as stand up comedians is a new concept. They are living together but not married. I loved the idea."}, {"id": 161, "text": "Deep and Zoya have a romantic chemistry in the film. The role of their parents is super cute. I love the story."}, {"id": 162, "text": "The film Comedy Couple is super nice and the actors' performances were super fantastic. No doubt this is a hit."}, {"id": 163, "text": "One should definitely watch this entertaining film Comedy Couple. I love the story and the show of the film."}, {"id": 164, "text": "We just loved the film. Deep looked so hot. Saqib Saleem just nailed it. He performed well in the film."}, {"id": 165, "text": "Super hit! This film Comedy Couple has already many fans. I haven't watched anything entertaining like this film."}, {"id": 166, "text": "Oh Wow! Everything in this film Comedy Couple is entertaining. The friends, the couple, the family, and the concept."}, {"id": 167, "text": "The film Comedy Couple should be a series. It just got over within 2hours. I am already missing this fun."}, {"id": 168, "text": "Shweta Basu Prasad played the role of an independent and a smart girl in the film. Nicely plotted."}, {"id": 169, "text": "I love the whole cast of the film Comedy Couple. The direction is perfect, the songs, the story and the concept is appreciated."}, {"id": 170, "text": "Deep and Zoya have a unique relationship, which I found very loving and interesting. The film should be a super hit."}, {"id": 171, "text": "I am feeling so fresh and wanted to watch more of the film Comedy Couple. What an amazing story and new concept."}, {"id": 172, "text": "Deep and Zoya fall in love and they are finding comedy in their relationship throughout the film. Watch this film, amazing one."}, {"id": 173, "text": "The film Comedy Couple has the story of two people who are pursuing stand-up comedy as a career in Delhi."}, {"id": 174, "text": "The makers should make the next part of Comedy Couple with the same lead actors. They have a lovely chemistry."}, {"id": 175, "text": "All the entertainment and all the emotions in the film Comedy Couple, I love it, the story and the climax is too good."}, {"id": 176, "text": "Nachiket Samant's film Comedy Couple is worth watching. I am recommending it to my friend to watch it soon."}, {"id": 177, "text": "Pooja Bedi, Ashish Verma, and Rajesh Tailang have balanced the story. Their acting and dialogue delivery was so good."}, {"id": 178, "text": "The first half Saqib Saleem didn't work much but in the second half he looked so hot, and performed well."}, {"id": 179, "text": "Deep has multi characters. He is a liar, he is also an emotional person and overall he acted in those roles perfectly."}, {"id": 180, "text": "Pooja Bedi and Shweta Basu Prasad looked so real in their roles. They played as mother and daughter which suit them."}, {"id": 181, "text": "I watched this film on Saturday and again I am going to watch it. I love the new concept of the film."}, {"id": 182, "text": "The film Comedy Couple is so nice, the love, the friendship, the fights and the relationship is so relatable."}, {"id": 183, "text": "The friendship of Pranay Manchanda and Saqib Saleem is very nice. I love their role together in the film."}, {"id": 184, "text": "Zoya is a lead role, performed by Shweta Basu Prasad; no doubt she is multi talented. Overall it's a good film."}, {"id": 185, "text": "The joke of gomutra is not good but the makers balanced it well with the storyline. Great work in the film."}, {"id": 186, "text": "Deep looked so scared when he was convincing his father about going to the office in the evening. Superb and total fun."}, {"id": 187, "text": "The dialogue delivery and the jokes timing was so accurate in the film. I love the lead actors and their role."}, {"id": 188, "text": "The punch lines and dialogues are too good of the film Comedy Couple. The script was written perfectly."}, {"id": 189, "text": "Zoya is fighting with her mother and explaining to her about Deep's and her standup comedy performance, it feels so real when you defend someone."}, {"id": 190, "text": "Zoya and Deep have a different and lovely chemistry. I really like this concept, something fresh and likable."}, {"id": 191, "text": "Zee5 subscription is actually worth taking. This comedy film Comedy Couple is something I can watch again and again."}, {"id": 192, "text": "Songs are too nice and so does the story of the film Comedy Couple. Nachiket Samant you are a real gem."}, {"id": 193, "text": "The film Comedy Couple has so many characters and they all did their job fantastically. I love the storyline."}, {"id": 194, "text": "Rohan looked so nice in the film; his acting is totally up to the mark. He is a real comedian and now an actor too."}, {"id": 195, "text": "Zoya and Deep have all the fun in the film. They love each other, they fight and they are stand up comedians."}, {"id": 196, "text": "Aadar Malik has played the role of Rohan, who acted like a shining star in the film apart from the lead actors."}, {"id": 197, "text": "A single mother Zohra Batra acting was so good with her daughter Zoya Batra. Their role has some real importance in the film."}, {"id": 198, "text": "The film Comedy Couple actors did fantastic work. The makers of the film have actually made something unique."}, {"id": 199, "text": "I am recommending each and everyone to watch this film. It is very entertaining and worth watching."}, {"id": 200, "text": "Shweta Basu Prasad is an independent and dominating girlfriend and Saqib Saleem is a liar. The story is too good."}, {"id": 201, "text": "Deep's Haryanvi accent goes so well in the film Comedy Couple. He is dealing with Zoya who handles him wisely."}, {"id": 202, "text": "Zoya looks so gorgeous and Deep is cute. Overall a beautiful film to watch. I just enjoyed the story."}, {"id": 203, "text": "Beautiful story and good direction. The film Comedy couple is full of fun and drama. Made my day."}, {"id": 204, "text": "The film Comedy Couple is superb fun. I love the new concept of a young couple, living together and managing their life."}, {"id": 205, "text": "The film Comedy Couple is totally fine. Zoya and Deep have so much on their plates and how they handled it, is worth watching."}, {"id": 206, "text": "So many problems with so much fun and romance. A couple can't expect less than that. The film Comedy Couple is a good one."}, {"id": 207, "text": "Zoya and Deep's personal and professional life have so many ups and downs. The story is smooth and interesting in the film Comedy Couple."}, {"id": 208, "text": "Deep Sharma (Saqib Saleem) and Zoya Batra (Shweta Basu Prasad) are superhit pair to work in other films too. Their fun was so real."}, {"id": 209, "text": "I just completed the movie and I am already missing the fun of Zoya and Deep. Lovely film."}, {"id": 210, "text": "The film Comedy Couple made my weekend so interesting. I like the story, the couple and the lovely songs."}, {"id": 211, "text": "I enjoyed watching this film with my husband. We both liked this film Comedy Couple a lot."}, {"id": 212, "text": "Comedy Couple is highly recommended to watch. Worth watching this film. Makers a big applause."}, {"id": 213, "text": "I can watch this film on repeat mode. Made my day, lighted my mood and I am still dreaming the story."}, {"id": 214, "text": "Saqib Saleem looked so hot, cute, funny and romantic in the film Comedy Couple. Zoya looked nice with him."}, {"id": 215, "text": "Zoya performed so well in the film. Shweta Basu Prasad did her job so perfectly in the film."}, {"id": 216, "text": "We all roommates watch this funny movie together. We laughed a lot and enjoyed the film Comedy Couple."}, {"id": 217, "text": "Zoya's attitude was so cool in the film. Sweta Prasad Basu performed so well in the film."}, {"id": 218, "text": "Highly recommended everyone. I love the chemistry of Zoya and Deep in the film. Pooja Bedi's acting is also nice."}, {"id": 219, "text": "Super funny movie based on a love story with all drama and fun. Do watch Comedy Couple."}, {"id": 220, "text": "Pure love story, full of lies, romance, fight and comedy. Comedy Couple should be a hit."}, {"id": 221, "text": "I should not watch this film alone. I wish I could watch it with my partner. We missed the fun."}, {"id": 222, "text": "Zoya and Deep is total fun. Pooja Bedi also did well in the film. Good story and actors did well with their roles."}, {"id": 223, "text": "I wish It should be a series. Makers do release the other part soon of the film Comedy Couple."}, {"id": 224, "text": "Entertainment, Entertainment, and Entertainment. The film Comedy couple is full of fun and excitement."}, {"id": 225, "text": "I am a comedian. I liked the concept of the film Comedy Couple. Now I am looking for the same partner."}, {"id": 226, "text": "A story of a couple who lives in Gurgaon and they do standup comedy. It is a real fun. Way to go makers."}, {"id": 227, "text": "What fun, I like the direction and story concept of Comedy Couple. One should watch it with their gf/bf."}, {"id": 228, "text": "Love the lies of Deep! Deep's role in the film Comedy Couple is funny, innocent and definitely a liar."}, {"id": 229, "text": "I love the chemistry of Saqib and Shweta Basu Prasad in the film Comedy Couple. One should watch it."}, {"id": 230, "text": "A loving, caring and funny story of Zoya and Deep. Must watch The film Comedy Couple."}, {"id": 231, "text": "Wow, so real and relatable. The film is surrounded with all the situations which a young generation is facing."}, {"id": 232, "text": "I watched this film with my husband. Mostly he never liked a comedy film but he gave full rating for the film Comedy Couple."}, {"id": 233, "text": "Zohra, Rohan, and Mukesh have performed their part so well and they balance the story in the film. Good one."}, {"id": 234, "text": "Nachiket Samant has directed this film Comedy Couple which is worth watching. His direction of the film is innovative."}, {"id": 235, "text": "Amazing and Romantic story. I have seen something nice after a long period. The concept of the film is so unique."}, {"id": 236, "text": "Deep and Zoya looked so good together, they are the lead actors. The film Comedy Couple is super interesting."}, {"id": 237, "text": "Shweta Basu Prasad has played the role of Zoya. I liked her. She has given her heart to her role in the film."}, {"id": 238, "text": "Very familiar story of the film Comedy Couple. Every couple faces the same phase in their life."}, {"id": 239, "text": "Full entertainment, full on romance and yes of course full on fight. The Comedy Couple story is totally worth watching."}, {"id": 240, "text": "Comedy Couple is a story which is so much relatable with today's life, their profession is something great and unique."}, {"id": 241, "text": "Deep and Zoya chemistry is full of fun. They are into a relationship but a phase comes when they want to get married."}, {"id": 242, "text": "The dialogues are mixture of Hindi and English, which I like the most. It seemed so real when I was watching the film."}, {"id": 243, "text": "Mangesh Dhakde has given the background music in the film Comedy Couple; it worked with the theme of the story."}, {"id": 244, "text": "Comedy Couple is totally an uncommon story in comparison to Bollywood stories. Zee5 did a great job."}, {"id": 245, "text": "Comedy Couple is a great film. It is full of romance, fight, fun and entertainment. Loved it."}, {"id": 246, "text": "A couple lives together and they have fun. Hero is a liar and Heroine is sweet. I like the story of the film Comedy Couple."}, {"id": 247, "text": "Bikas Ranjan Mishra has written a good loving script, one can surely love it. The film Comedy Couple has a unique idea."}, {"id": 248, "text": "So I don't usually write reviews for movies and this is my second review. (the first one I wrote for was Sui Dhaga - Made in India ---One of the best movies of Bollywood I have ever seen).And this one oh man such a waste of time .....The story was aweful. One of the worst movies with good (FAKE) rating I have ever seen. Really hoped ending would be good BUT it was the WORST of them all."}, {"id": 249, "text": "Started watching this movie for Adar malik's cameo . . But this movie is unexpectedly good. . . Give it a watch"}, {"id": 250, "text": "I actually like the scripting and plotting of dialogues. The concept of the film Comedy Couple as a whole is a super hit."}, {"id": 251, "text": "JUST AMAZING! I loved it. It is so interesting and entertaining. I loved all the actors and the concept of the film."}, {"id": 252, "text": "Worth the watch! Everybody should watch the film Comedy Couple. I love the sweet couple, their romance and their fun."}, {"id": 253, "text": "Such great performances. A Unique story and the actors did justice to their roles by performing it so extraordinary."}, {"id": 254, "text": "My friend and my family loved the film Comedy Couple, I have recommended them to watch it, and they loved the film."}, {"id": 255, "text": "Shweta Basu Prasad did a fantastic job in the film, she looked so gorgeous and she acted so well. Brilliant Job"}, {"id": 256, "text": "I loved it. I love the characters, their acting skills, their performances just wow. The Makers should get an award for it."}, {"id": 257, "text": "If you want to enjoy a romantic comedy film and you have no plans, Please watch the film Comedy Couple. It is really worth watching."}, {"id": 258, "text": "Full marks for the unique story, great cast, makers, songs, background music and the dialogues of the film COMEDY COUPLE."}, {"id": 259, "text": "Nachiket Samant you just nailed it. The visualization of this film Comedy Couple is super nice. Amazing work."}, {"id": 260, "text": "I saw the reviews and decided to watch which is totally worth watching. Zoya and Deep are like made for each other couple."}, {"id": 261, "text": "Wow! I have no words to express the feeling after watching the film Comedy Couple. I have already started recommending it."}, {"id": 262, "text": "The film Comedy Couple has just increased the number of viewers. Zee5 actually gained more fans after creating this film."}, {"id": 263, "text": "What a romance and comedy. This film is a must watch for those who need some relaxation. The actors and the story is totally worth watching."}, {"id": 264, "text": "Shweta Basu Prasad, you are looking so gorgeous in the role of Zoya. The film Comedy Couple must be lucky for you."}, {"id": 265, "text": "Pooja Bedi looked fabulous. Pranay Manchanda again nailed it in the film. The direction of the film Comedy Couple is superb."}, {"id": 266, "text": "The Haryanvi Dialogue of Deep is totally natural. Deep was the heart of the film and so does Zoya. Super Romantic film."}, {"id": 267, "text": "The punch lines and dialogues of Policewala are damn funny. I like their entry and exit in the film Comedy Couple."}, {"id": 268, "text": "The film Comedy Couple is surrounded with three major things i.e. Love, Friends, and Family with the hint of romance, fun and emotions."}, {"id": 269, "text": "Great Chemistry with lots of ups and downs moments. It's all about a love story of a young couple."}, {"id": 270, "text": "Shweta Basu Prasad did a great job. I love her acting skills. She is super talented and she showed it in the film."}, {"id": 271, "text": "No Matter what, stay together and love each other. I learnt this from the film Comedy Couple. Must watch the film."}, {"id": 272, "text": "What a great story line. The theme and background music is a perfect fit with the young couple story."}, {"id": 273, "text": "I love the work of all the actors of the film Comedy Couple. The makers really choose the best actors."}, {"id": 274, "text": "The film Comedy Couple is the one of the best films I have watched. Zee5 now has real stories to telecast. This film is superb and great."}, {"id": 275, "text": "I have watched Comedy Couple and was eagerly waiting to watch the next part. It is really worth waiting to watch Comedy Couple."}, {"id": 276, "text": "Saqib looks like a chocolate boy and his chilled expression suits the character of Deep tremendously."}, {"id": 277, "text": "I am not a fan of romantic comedy films, but now I am. Just watched Comedy Couple, really a great film."}, {"id": 278, "text": "The film Comedy Couple is in my favorite list for watching it again whenever I feel bored. I can watch it again and again."}, {"id": 279, "text": "The direction and the makers worked really hard. I have never seen such a beautiful story with great acting skills."}, {"id": 280, "text": "An Amazing and super romantic film. The lead actors looked so cool and their performance is also super nice."}, {"id": 281, "text": "The film Comedy Couple is surrounded with the love story, the friend circle and the family. SUPER HIT FILM"}, {"id": 282, "text": "What a real story. Deep and Zoya are totally a hot couple and they do all the fun together. I love this film a lot."}, {"id": 283, "text": "The film Comedy Couple is really unique. I love the story and the fun. Totally unexpected story and worth watching."}, {"id": 284, "text": "I have recommended many to watch the film Comedy Couple. The story concept is great and one should not miss it."}, {"id": 285, "text": "I appreciate the work of the director and makers. They did a wonderful job by making the film Comedy Couple."}, {"id": 286, "text": "I want to watch the film Comedy Couple again, although I know the story but no loss in watching it twice."}, {"id": 287, "text": "Nachiket Samant has an excellent talent of direction, the film Comedy Couple is beyond imagination."}, {"id": 288, "text": "I love the story idea, the concept is great. The theme was so smooth and totally mixed with the film Comedy Couple."}, {"id": 289, "text": "Saqib Saleem's acting is superb. I love the way he performed all the roles in the film Comedy Couple."}, {"id": 290, "text": "The film Comedy Couple is a must watch film, with great work by actors and a wonderful story. JUST WOW"}, {"id": 291, "text": "A film with a great idea, the cast, the makers and the story is breathtaking. I have already recommended my friends to watch it"}, {"id": 292, "text": "The film Comedy Couple is something you don't want to miss, if you want to enjoy the romance, the cuteness and the fun."}, {"id": 293, "text": "Shweta Basu Prasad, what a beautiful work she did. I want to praise the work of costume designers and makeup artists."}, {"id": 294, "text": "The background music and the theme just merged with the romantic and comedy story of the film, great idea and lovely story."}, {"id": 295, "text": "I watched the film Comedy Couple with my friends; we all love the story and theme of the film. Super Hit Film"}, {"id": 296, "text": "Zee5 did a wonderful job for releasing a great film like Comedy Couple. I loved the story and the characters of the film."}, {"id": 297, "text": "Saqib Saleem has done absolute fine work in the film Comedy Couple. His looks, dialogue delivery is natural."}, {"id": 298, "text": "I am in love with the acting of Zoya and Deep. Their chemistry is so hot and looks full of fun in the film Comedy Couple."}, {"id": 299, "text": "I love the film. The story line is perfect, the actors did a fantastic job and the visualization of the film Comedy Couple is great."}, {"id": 300, "text": "Shweta Basu Prasad and Saqib Saleem have done a fantastic job in the film Comedy Couple; their look is totally up to the mark."}, {"id": 301, "text": "Pranay Manchanda and Jasmeet Singh Bhatia are really great stars. I really appreciate their talent and work skills."}, {"id": 302, "text": "Don't miss the fun, the romance and the great chemistry between Zoya and Deep. Pooja Bedi also did well in the film."}, {"id": 303, "text": "Zoya's role is just wow in Comedy Couple; she looks so beautiful in the film. Highly recommended to each and every one."}, {"id": 304, "text": "What an awesome film, made my day. The film Comedy Couple is very interesting to watch."}, {"id": 305, "text": "Shweta Basu Prasad just nailed it by her looks, dressing and definitely her acting in the film Comedy Couple."}, {"id": 306, "text": "I can watch this film called Comedy Couple again and again, great work by the cast and makers."}, {"id": 307, "text": "If you are looking for romantic comedy, must watch Comedy Couple. You can't find anything better than it."}, {"id": 308, "text": "Show cast of the film Comedy Couple is beyond my imagination. The story line is perfect and the cast is rocking."}, {"id": 309, "text": "Pooja Bedi looks fantastic in a mother role; her eyes are showing her skills of acting in Comedy Couple."}, {"id": 310, "text": "I have already recommended my dear ones to watch this film Comedy Couple as soon as possible, Super Hit Film."}, {"id": 311, "text": "I didn't get bored while watching the full film Comedy Couple. I started admiring Zoya for her looks in the film."}, {"id": 312, "text": "The movie makers should take the credit for the interesting story, crisp dialogues and superb work of plotting the story."}, {"id": 313, "text": "Comedy Couple is really a nice movie. Full on entertainment with a romantic couple. I love the punch lines."}, {"id": 314, "text": "Every character of the film Comedy Couple has surprised me, by their work and the story. Excellent work!"}, {"id": 315, "text": "Shweta Basu Prasad acted as Zoya 'the girlfriend' a remarkable work by her. I am impressed with this film."}, {"id": 316, "text": "The film Comedy Couple OMG! The fun, romance, look and the attitude of the characters just nailed it."}, {"id": 317, "text": "I am already thinking about the next part of the film Comedy Couple, really a totally romantic comedy story."}, {"id": 318, "text": "I will give full rating to the screenplay, creativity, direction and the storyline of the film Comedy Couple."}, {"id": 319, "text": "The journey of Deep and Zoya is so relatable with the youths in the film, It attracts attention. Good Story!"}, {"id": 320, "text": "The romance, comedy and fun between the characters is well-connected in the film story. Highly Recommended"}, {"id": 321, "text": "The film Comedy Couple is actually recommended to watch, the direction of the film is super comedy and romantic."}, {"id": 322, "text": "I will give credit to Bikas Ranjan Mishra for the story; without a perfect story, you can't create a comedy romantic story."}, {"id": 323, "text": "The film Comedy Couple is nicely written and well plotted by the makers. The background music gives a nice base to the story."}, {"id": 324, "text": "Kya ye tumhe pata hai? Very emotional song and really heart touching song. I actually love the film Comedy Couple."}, {"id": 325, "text": "Saqib Saleem is just like a cool dude. His romance and comedy has the perfect balance in the film Comedy Couple."}, {"id": 326, "text": "Jasmeet Singh Bhatia is tremendous. The way he performed and his dialogue delivery, punchlines were just outstanding."}, {"id": 327, "text": "I was watching the film Comedy Couple and felt the freshness, by the background music and the romantic comedy story."}, {"id": 328, "text": "I am in love with Shweta Basu Prasad and the work with Saqib Saleem in the movie. I love her dresses."}, {"id": 329, "text": "Pooja Bedi and Pranay Manchanda maintained a good balance in the film; their work was valuable to watch."}, {"id": 330, "text": "An extraordinary work by the makers, screenplay, story, chemistry of the couple and the concept. I like the film Comedy Couple."}, {"id": 331, "text": "I wish another part of the film Comedy Couple should release great work by Deep and Zoya did so well."}, {"id": 332, "text": "Definitely not a boring film, Nachiket Samant cheers for the direction of the romantic comedy film Comedy Couple."}, {"id": 333, "text": "Overall great work by the actors. A pinch of romance with comedy, a sweet love story of Deep and Zoya in the movie."}, {"id": 334, "text": "Pranay Manchanda and Madhu Sachdeva work is phenomenal in the film Comedy Couple, strong characters, really impressive work."}, {"id": 335, "text": "The attitude of Zoya makes the movie more energetic, romantic, and represents a strong lady in the film Comedy Couple."}, {"id": 336, "text": "Shweta Basu Prasad looked so natural; her role justified the story well. A great chemistry between the couples in the film."}, {"id": 337, "text": "The direction was so clear and to the point in the film Comedy Couple. The makers have done a great job."}, {"id": 338, "text": "Pooja Bedi looked so fun and her acting is fantastic. The dialogue delivery and the expressions of Zohra Batra are perfect."}, {"id": 339, "text": "Saqib Saleem's look was fantastic, and he acted so well in the film. I watched him after such a long time."}, {"id": 340, "text": "Oh I just love this film. I like the story, the fun, and the romance of the couple. Deep and Zoya looked so good together."}, {"id": 341, "text": "Saqib Saleem is back with the new role like a comedian, funny, and felt good to watch him in this film."}, {"id": 342, "text": "The dialogues of the film Comedy Couple fit perfectly on the characters. I just like the way Shweta Basu Prasad acted."}, {"id": 343, "text": "What a romantic and a comedy film! I would recommend everyone around me to watch this film Comedy Couple."}, {"id": 344, "text": "The story writing is at pace, Deep is in full confidence, and Zoya supported the character so well in the film Comedy Couple."}, {"id": 345, "text": "The background music is just booming with the dialogues on stage, a romantic and comedy story with a smart plot."}, {"id": 346, "text": "The film Comedy Couple, loved the film, and suggested watching it to my friends, the ending is also well."}, {"id": 347, "text": "Deep and Zoya resemble a very young energetic couple, they look so sweet together and good work in the film.."}, {"id": 348, "text": "You can't get bored with this movie 'Comedy Couple' no matter how many times you have already watched it."}, {"id": 349, "text": "The film Comedy Couple is like a true story. The couples are in deep love and they manage all the situations of life together."}, {"id": 350, "text": "Saqib and Deep looked just like a real couple. I like their love story, they looked so great in the film"}, {"id": 351, "text": "Mind Blowing and Unique Film. I really enjoy this film and the story idea. The direction of the film is super nice."}, {"id": 352, "text": "Comedy Couple is a film to watch, if you want to enjoy all the romance, drama and fight. I Love all the cast of the film."}, {"id": 353, "text": "This film is awesome. Mind blowing story of Comedy Couple and one of the best in recent cinemas."}, {"id": 354, "text": "The story direction is on the point. Bikas Ranjan Mishra and Director Nachiket Samant should make more films like this."}, {"id": 355, "text": "This film is actually based on all the tantrums of today's couple. I like the story idea. The lead actors did so well."}, {"id": 356, "text": "I love the film, Deep and Zoya is just like a couple who passionately love each other and do all the fun."}, {"id": 357, "text": "Saqib Saleem was also very good in his screen time. Story was too good and the music is ok in Comedy Couple."}, {"id": 358, "text": "Comedy Couple is something out of the box and interesting with great direction, music, cinematography. Must watch the drama"}, {"id": 359, "text": "I love the story, the action, the characters and the fantastic performance of all the lead actors. Comedy Couple is a romantic film to watch."}, {"id": 360, "text": "Zee5 is totally worth watching. Comedy Couple is a superb film. The story and the background music are super hit."}, {"id": 361, "text": "It's an amazing choice of cast as the characters have been portrayed and also it's a unique movie. I am recommending everyone."}, {"id": 362, "text": "Acting was good. Chemistry between the actors is superb. Full of romance and a good story. Must watch this film."}, {"id": 363, "text": "It's fresh, it's unique. We haven't seen anything like Comedy Couple in Bollywood, it's too good. I love the story."}, {"id": 364, "text": "The energy, the charm, and the acting skills are too good. I love this concept and the film is so romantic."}, {"id": 365, "text": "It's a very good film, with great acting skills. Saqib Saleem was a show stealer with his hot look and acting."}, {"id": 366, "text": "The film is not only comedy but It is also so romantic. I love the way the lead actors performed. A hit film."}, {"id": 367, "text": "It shows the little life of stand up comedians and their side effects. The visuals and the background music of the comedy."}, {"id": 368, "text": "Comedy Couple is a super fantastic film. I love the action, the casting, music, acting, the performance, the camera, everything."}, {"id": 369, "text": "It is a simple realistic, Romance with a drama movie, which is surely going to entertain you. Wow the film is so nice."}, {"id": 370, "text": "All other supporting cast also acted well in this movie of Comedy Couple, but at last Shweta Basu Prasad steals the Show."}, {"id": 371, "text": "Amazing story. The film Comedy Couple is such a simple and cute love story. The young couple is so loving."}, {"id": 372, "text": "The Comedy Couple has some really good funny moments, very authentic stories. I love the film a lot."}, {"id": 373, "text": "Shweta Basu Prasad is just nailing the show. The film is too good and I loved the story too great. Loved it."}, {"id": 374, "text": "The film Comedy Couple is a super energetic film. Saqib Saleem and Shweta Basu Prasad looked so good together."}, {"id": 375, "text": "A superhit film to watch, it is all fun and refreshing. Pooja Bedi is a super nice movie. Amazing Film."}, {"id": 376, "text": "I already recommended my friends to watch this family. Deep and Zoya looked so cool together in the film."}, {"id": 377, "text": "Zoya's smile is killing. I love her acting skills in the film. The film Comedy Couple is a must watch film. Recommended to everyone."}, {"id": 378, "text": "Shweta Basu Prasad has a good attitude in the film. She looked so gorgeous and she did so well in the film."}, {"id": 379, "text": "Pranay Manchanda and Jasmeet Singh Bhatia have done so well in the film; their supporting role in the film is too good."}, {"id": 380, "text": "The Comedy Couple is totally a good attempt. It's a unique story of two young couples. Amazing story!"}, {"id": 381, "text": "Very smooth acting, good dialogues, light watch and funny film. It's a superhit and Saqib Saleem is totally natural with his skill."}, {"id": 382, "text": "The film is super entertainment. I love this story and the concept of the film. Shweta Basu Prasad just nailed it."}, {"id": 383, "text": "The film Comedy Couple is very entertaining. I must watch and enjoy this movie. Deep and Zoya are so good together."}, {"id": 384, "text": "WOW! I love this romantic and comedy film concept of Comedy Couple. Saqib Saleem is a real dude in the film."}, {"id": 385, "text": "Jasmeet Singh Bhatia added some extra energy to the film. Zoya and Deep were so funny in the whole film. Loved it."}, {"id": 386, "text": "Everyone should enjoy this romantic comedy film of Deep and Zoya. Siddhu punch lines are so nice to watch."}, {"id": 387, "text": "The young couple of the film is super cute. I love their acting skills, their looks and their dialogue delivery in this film."}, {"id": 388, "text": "Comedy Couple is a full entertaining film. One should definitely watch this film. I love the story and the background music."}, {"id": 389, "text": "Madhu Sachdeva and Pooja Bedi both acted as mother of Deep and Zoya, same role and different character. Super Fantastic."}, {"id": 390, "text": "Pranay Manchanda looked so cute and his acting skill is a total joy. He has used his all skills in the film Comedy Couple."}, {"id": 391, "text": "The story is super fun. The direction, the film and the story is so fine. A couple who are dealing with all the fun is really nice."}, {"id": 392, "text": "A great movie with some unique ideas. The lead actors are so cool and they enjoyed their role throughout the film."}, {"id": 393, "text": "Oh my God! I am already waiting for the next part of Comedy Couple. I love the acting skills of all the actors. The story is fantastic."}, {"id": 394, "text": "Wow! An amazing film, I am recommending everyone to watch the film as soon as possible. You can't miss the good story."}, {"id": 395, "text": "All the actors did great in this superb film. The direction of this film is much better than a normal film. Loved it."}, {"id": 396, "text": "Oh My God! I didn't expect that Comedy Couple would be so good. What a story, amazing concept. I just loved this film and the concept."}, {"id": 397, "text": "Socha Na tha is such a beautiful song of this film. The film is super fantastic and the story line is really good."}, {"id": 398, "text": "Pooja Bedi looked good in this film. Shweta Basu Prasad looked awesome in the film Comedy Couple."}, {"id": 399, "text": "Rajesh Tailang has a powerful voice and his dialogue delivery is wow. He is in a supporting role but I like him."}, {"id": 400, "text": "Comedy Couple is my favorite movie now, I like this unique concept of romantic-comedy film. Zoya and Deep much love."}, {"id": 401, "text": "Movie has a pattern of showing clips of Deep and Zoya in black and white background, which I like the most."}, {"id": 402, "text": "The couple's lives together, fight together cook together and perform together. It's a sweet story of a couple."}, {"id": 403, "text": "The attitude, dresses and performance of Zoya looked so beautiful. I love the songs, some are funny and some are emotional."}, {"id": 404, "text": "Pranay Manchanda is my favorite character of every movie. Now I started liking Saqib Saleem for his acting skills."}, {"id": 405, "text": "Friendship, love, care and fun of a young couple. It is a FANTASTIC film. Zoya looked so beautiful."}, {"id": 406, "text": "The film comedy couple is like enjoying a party. Lots of fun, romance, beautiful songs and also the background music is good."}, {"id": 407, "text": "A cute love story, balanced so well with friends. The comedy couple film has a new concept. It's a great movie."}, {"id": 408, "text": "Saqib Saleem's acting skill is so great and he nailed it in the film."}, {"id": 409, "text": "Pranay Manchanda again performed so fantastic in thRefreshing and Fun to watch!!! My girlfriend recommended that I watch this film and now I am recommending others to watch this film."}, {"id": 410, "text": "The film is about a cute couple, based on today's young generation. The film Comedy Couple is so nice. I like the fun."}, {"id": 411, "text": "Great beginning for both the artists, Good acting career ahead. The story is romantic, funny and fresh."}, {"id": 412, "text": "The film Comedy Couple is worth watching. I love the romantic-comedy story. This film is a total super hit."}, {"id": 413, "text": "The punch lines and the dialogue delivery are too good. Deep looked so hot, he is caring, funny and dramatic."}, {"id": 414, "text": "New concepts and great acting must watch. Pooja Bedi did well and also the lead actors of the film Comedy Couple."}, {"id": 415, "text": "This movie is awesome guys!!! Do watch it. Zee5 just won my heart by releasing such a beautiful story with full romance."}, {"id": 416, "text": "Just enjoyed the movie, both the lead actors are too good for their role. Such fantastic acting after a long time."}, {"id": 417, "text": "I love the comedy and romantic story of this film. Full on entertaining film and the story of the couple is so romantic."}, {"id": 418, "text": "Simple but entertaining and original story. Pooja Bedi worked well and the other supporting actors have good roles in the film."}, {"id": 419, "text": "Very interesting movie and I basically loved it. Shweta Basu Prasad performed her role so brilliantly in the film Comedy Couple."}, {"id": 420, "text": "Fantastic comedy and dialogues are too good; the story is sensitive and warm. Zoya and Deep are so cool with each-other."}, {"id": 421, "text": "Just outstanding, everyone is just awesome in this film. One should watch this film. I have already made my plans to watch this film soon."}, {"id": 422, "text": "Swetha Basu Prasad's performance was good and she justified the role brilliantly. Comedy Couple is highly recommended."}, {"id": 423, "text": "I really wish this film 'Comedy Couple' should be a series because I am craving more for it. The fun and romance is real."}, {"id": 424, "text": "Absolutely loved it, the chemistry and comedy in this film was superb. The lead actors worked so nicely in this film."}, {"id": 425, "text": "Finally after a long time, I watched a decent humorous and romantic movie. You can watch with your partner also its quite funny"}, {"id": 426, "text": "A super hit film. No one has ever made any film on this concept. We just love this film and are waiting for the next part."}, {"id": 427, "text": "Any couple can relate the fun of this film. What an amazing film. The songs are too nice, the comedy and the concept just superb."}, {"id": 428, "text": "Must watch this romantic-comedy film on Zee5. The story is totally refreshing. The lead actors have a cute chemistry."}, {"id": 429, "text": "Subha Rajput and Aadar Malik are the supporting actors but balanced the story so nicely. Comedy Couple is a romantic film."}, {"id": 430, "text": "We have never seen a romantic-comedy film. A good movie and all the actors looked so good in the film."}, {"id": 431, "text": "Comedy Couple is full of romance, love, fun and drama. The story and the background music is just perfect. LOVED IT."}, {"id": 432, "text": "Comedy Couple is based on romantic-comedy. I love the idea of the story. Well Done makers and lead actors."}, {"id": 433, "text": "The music and comedy is nice and the lead actors performed their roles perfectly. Different story and new concept."}, {"id": 434, "text": "Saqib Saleem and Shweta Basu Prasad's stand-up acts are a real treat to watch in this film. Comedy Couple is a lovely film."}, {"id": 435, "text": "Both Saqib Saleem and Shweta Basu Prasad look lovely together and perform well in their respective roles."}, {"id": 436, "text": "Director Nachiket Samant does a fine job. This film Comedy Couple should be a super hit. The lead actors did well."}, {"id": 437, "text": "Comedy Couple is a full on entertainer that's a refreshing take on romance and relationships."}, {"id": 438, "text": "Super fun! I watched this film called Comedy Couple. Full of refreshment, the story, the actors are so cool."}, {"id": 439, "text": "Zee5 has been a campaigner sorts of boring and average movies and webseries. One more joins the most. It isn't a funny rom com type films but a long sobbing yet sometimes soothing film on relationships more than comedy. Somehow a lot of people don't consume such things and would not even watch it. On the writing front nothing new, music is really good, felt Aadar Malik could have played the male protagonist rather than Shakib it would have looked more natural and real. But Sweta Basu Prasad has been making her presence felt and completely justifies her National award. It's a tiring one time watch and Zee5 could have brought in a comedian for a stand-up special than this but nevertheless it isn't killing so watching it won't kill you."}, {"id": 440, "text": "I can watch this on repeat, although now I know the story but it's worth it to watch Comedy Couple again to enjoy the fun."}, {"id": 441, "text": "The direction, scripting, and the storyboard are on its precise level of Comedy Couple, superb work and a romantic film."}, {"id": 442, "text": "The script of Comedy Couple is simply extraordinary and the execution of the entire series is on another level."}, {"id": 443, "text": "If you are feeling bored, you must watch Comedy Couple. You will be thrilled with the suspense of the series."}, {"id": 444, "text": "The film like Comedy Couple just added the value of Zee5 shows. I am happy that I have taken the subscription of Zee5."}, {"id": 445, "text": "Don't miss the real fun. Watch Comedy Couple as soon as possible. It is super interesting and funny."}, {"id": 446, "text": "Love is all about fun, fight and romance. Comedy Couple has all the concepts very clear and up to the mark."}, {"id": 447, "text": "Comedy Couple is one level up, the content, creativity, and the funny story are so perfect in this film."}, {"id": 448, "text": "The story of Comedy Couple is all revolving around three major things: Romance, lies and entertainment between the couple."}, {"id": 449, "text": "This fun and drama has set up an audience, people loved this film. I just loved the film, wow a real fun."}, {"id": 450, "text": "Lovely! All I can say is watching this film with your partner; it will really refresh your mood and heart."}, {"id": 451, "text": "Stand up comedians as a couple, a beautiful and unique way to present the film. Good work the team of Comedy Couple."}, {"id": 452, "text": "Comedy Couple is super cute, super fun and an adorable movie. It shows the chemistry of an unmarried couple."}, {"id": 453, "text": "A cute couple, a romantic story full of lies and fun. Comedy Couple is a super hit comedy film. Amazing."}, {"id": 454, "text": "Fantastic story concept, it brings such joy and freshness after watching this film. I loved it and I will watch it again with my wife."}, {"id": 455, "text": "I have planned to watch this film on the weekend but I really can't wait any longer. I already watched it."}, {"id": 456, "text": "My girlfriend forced me to watch this film Comedy Couple and now I know the reason, Amazing work."}, {"id": 457, "text": "I watched this film with my wife and now we are thinking of giving a shot to become stand up comedians."}, {"id": 458, "text": "Direction, acting and the story is superb in the film Comedy Couple. We are already waiting for the next part of the film."}, {"id": 459, "text": "Wow, an amazing film. The film Comedy Couple is so refreshing and loved the acting and storyline."}, {"id": 460, "text": "We need such lovely contents to be shown. It is so inspiring and makes you feel real. A beautiful one."}, {"id": 461, "text": "Comedy Couple is already a hit, this film has gathered so many positive views and we are expecting another part of this film."}, {"id": 462, "text": "Millions of viewers already. Deep's performance is absolutely fine. Comedy Couple has a great success."}, {"id": 463, "text": "A romantic story with so many funny concepts. I love watching it. Comedy Couple is already a superhit series."}, {"id": 464, "text": "Shweta Basu Prasad is a true gem. The makers of this film work really hard to bring such joy for viewers."}, {"id": 465, "text": "I enjoyed the film, the story, the direction and the concept. It is full of entertainment and the couples are actually comedians."}, {"id": 466, "text": "I have not seen any film based on this concept. Two stand up comedians are a real couple who stay together but not married.LOL"}, {"id": 467, "text": "The film Comedy Couple is fun. One should feel the fun. The makers did a wonderful job by creating this series."}, {"id": 468, "text": "My friend asked me to take the subscription of Zee5 and watch the film Comedy Couple. It is really worth watching."}, {"id": 469, "text": "I have already watched this film and am again watching it. I genuinely loved the concept and the romance."}, {"id": 470, "text": "Lots of entertainment and fun in this film. The story is about a cute couple and bang on. The lead actors look cute together."}, {"id": 471, "text": "I have no words to show my real feelings for this film; every single thing of this film is totally up to the mark."}, {"id": 472, "text": "This film gave me real entertainment throughout the whole story. There is a lot of fun and romance in the film Comedy Couple."}, {"id": 473, "text": "Zoya is expecting Deep to always tell the truth and Deep is a big time liar. He lied and here melodrama comes."}, {"id": 474, "text": "I am really impressed with the new type of story. It has all the fun, romance and so many lies. Fantastic"}, {"id": 475, "text": "The film Comedy Couple is fun to watch, I recommended my colleagues to watch this film on weekends."}, {"id": 476, "text": "An 'unmarried couple' in the city, they are kicked out of a rented apartment. They are not settled but kind of settled."}, {"id": 477, "text": "Nachiket Samant's film centers on a young stand-up couple in Gurgaon. I like this idea and Actors did a nice job in the film."}, {"id": 478, "text": "The film starts with fun, drama and turns out just like a couple's fight and melodrama. But I like the concept."}, {"id": 479, "text": "Pooja Bedi looks nice; I like her acting in the film. She should also try a lead role. Good Film and really fun."}, {"id": 480, "text": "The film Comedy Couple has a very unique concept of comedy couple based on lies, love and romance. Way to go."}, {"id": 481, "text": "I love the acting of Deep and Zoya, their roles were so good in Comedy Couple. Great Work."}, {"id": 482, "text": "We need such exceptional performances and mind blowing concepts in the cinema industry. Outstanding concept of Comedy Couple."}, {"id": 483, "text": "I am feeling overwhelmed. I watched this series of Comedy Couple with my family and we had a great time watching it."}, {"id": 484, "text": "I thoroughly enjoyed this show. This is one of the best shows I ever watched. Good job makers of Comedy Couple!"}, {"id": 485, "text": "The concept is tremendously good. I absolutely loved the ideology, innovation and creation of Zee5."}, {"id": 486, "text": "Lies, love and comedy are what talks about. The story revolves around all the characters and their romantic stories."}, {"id": 487, "text": "What a show! What a concept! Every single actor from this show is brilliant. Much love to the makers of Comedy Couple!"}, {"id": 488, "text": "I am in love with the scripting and plotting of dialogues. The concept of Comedy Couple as a whole is a super hit."}, {"id": 489, "text": "Wow! I loved it. It is so interesting and entertaining. I loved all the actors and the concepts of comedy and romance."}, {"id": 490, "text": "Nobody can ever get bored with this drama and interesting story. The story is romantic. Comedy Couple sets a benchmark."}, {"id": 491, "text": "Comedy Couple has all the drama, fun and romance. Zoya and Deep looked so funny and real in their roles."}, {"id": 492, "text": "After such a long time I have watched something really relaxing and relevant to the daily life story of youths."}, {"id": 493, "text": "This funny drama has set up a benchmark to many. Acting was superb, the story and concept was superbly presented."}, {"id": 494, "text": "Zee5 did an amazing job. I love the story idea of a comedy couple living together and fighting their battles."}, {"id": 495, "text": "Worth the watch! Everybody should watch this series of Comedy Couple. It helps you get refreshed.."}, {"id": 496, "text": "It's a masterpiece. The entire crew was brilliant. The concept is amazing. Overall, it is worth watching."}, {"id": 497, "text": "Comedy Couple deserves to be a hit. All the characters of Comedy Couple bring magic to their roles. Interesting!"}, {"id": 498, "text": "Such great performances. Brilliant funny story and the actors did justice to their roles by performing it so cutely."}, {"id": 499, "text": "A super hit film! I loved the story idea. It's a romantic and funny movie which will hit you straight to your heart."}, {"id": 500, "text": "This film Comedy Couple has portrayed love, romance, lies, comedy and fun extraordinarily. a perfect watch!"}, {"id": 501, "text": "Loved the entire show cast, their performances are out of the box. Good work team of Comedy Couple."}, {"id": 502, "text": "I really liked the role of Saqib as Deep. His presence builds up a strong comedic personality in Comedy Couple, loved his acting."}, {"id": 503, "text": "Romantic and beautiful. The concept of the film Comedy Couple looks fun to watch. This show inspires you in many ways."}, {"id": 504, "text": "Saqib looked so hot in his role of Deep, Comedy Couple has a great story and Deep's performance is totally up to the mark."}, {"id": 505, "text": "My friend and my family loved Comedy Couple, I have recommended them to watch it, and they loved the film."}, {"id": 506, "text": "Zoya's performance is superb. I like her energy, her acting, and her charm the whole time in Comedy Couple."}, {"id": 507, "text": "Comedy Couple this film should be a super hit. What an acting and story. Just Wow"}, {"id": 508, "text": "You should not miss a fun like Comedy Couple. Worth watching it. Zoya and Deep look cute together."}, {"id": 509, "text": "Fantastic Film. I enjoyed it and already recommended everyone in my circle to watch it."}, {"id": 510, "text": "Zoya looks so beautiful in the film and the tuning with Deep is super cute. A super hit comedy film."}, {"id": 511, "text": "I want to see more of the film, totally loving it so much. The film is funny and romantic."}, {"id": 512, "text": "Comedy Couple is romantic, loving and the lead actors' performance is totally fine in the film."}, {"id": 513, "text": "I watched the film with my family and then again I watched it alone. Good work actors and makers."}, {"id": 514, "text": "Awesome Movie totally made my weekend. It was really fun to see the film Comedy Couple."}, {"id": 515, "text": "I loved it. The makers did a fantastic job by making a movie like Comedy Couple."}, {"id": 516, "text": "Zoya didn't show up for her own marriage. Deep is cute, funny and liar. Lovely performance."}, {"id": 517, "text": "Couple living together and doing a comedy show. What else do you want with a Comedy Couple?"}, {"id": 518, "text": "The songs are melody. I love the story idea of a couple. Based on today's world stories."}, {"id": 519, "text": "Brilliant concept, funny, comedy, romantic and lovely work by actors. Comedy Couple is a must watch movie."}, {"id": 520, "text": "Comedy Couple is a must watch movie. I love the story, drama, comedy and romance."}, {"id": 521, "text": "What a lovely performance by Deep and Zoya. I want to see another movie of them just like Comedy Couple."}, {"id": 522, "text": "Comedy Couple is a perfect film for romantic and comedy story, the actors acted so well in it, and the direction is best."}, {"id": 523, "text": "This film has already made many fans, and I guess it is already popular. One should surely watch Comedy Couple."}, {"id": 524, "text": "If you have options like Comedy Couple, no one can ever get bored, even the lockdown will be so easy to handle."}, {"id": 525, "text": "Keep creating this type of comedy film, Zee5 should start telecasting more films just like Comedy Couple."}, {"id": 526, "text": "Comedy Couple has every fun which can be expected by a viewer, good team work of Comedy Couple. Superhit"}, {"id": 527, "text": "I will recommend everyone to watch Comedy Couple; you don't want to miss the fun, romance, and work of the actors."}, {"id": 528, "text": "I can't enjoy much, a story like this, and the direction of Comedy Couple is too good. It seems everything is so perfectly fit."}, {"id": 529, "text": "Shweta Basu Prasad is a versatile actress, and she proved it after working so greatly in the film Comedy Couple."}, {"id": 530, "text": "The most wonderful part of this film is to watch Zoya and Deep; they both look so elegant, and beautiful together."}, {"id": 531, "text": "Story is in its pace, the dialogue delivery is superb, and the movies are altogether fun. Concept of the movie is just wow."}, {"id": 532, "text": "WOW! I am speechless after watching Comedy Couple, amazing story, lovely direction and the visuals are totally up to the mark."}, {"id": 533, "text": "All the characters of Comedy Couple looked so cute, dashing and funny, a big applause to the makers."}, {"id": 534, "text": "I have added Shweta Basu Prasad in my fan list after watching her in Comedy Couple, she looks outstanding."}, {"id": 535, "text": "Every character of this film has some fear and they fight with their own fears. I like the story and the film."}, {"id": 536, "text": "Every character of this film has some fear and they fight with their own fears. I like the story and the film."}, {"id": 537, "text": "Comedy Couple director, Nachiket Samant has done a commendable job by screening the story in a way it should be. Fun"}, {"id": 538, "text": "If you want to enjoy some fun and you have no plans, Please watch Comedy Couple. It is really worth watching."}, {"id": 539, "text": "The makers of the Comedy Couple should get an award for creating a lovely and funny film. Must watch it."}, {"id": 540, "text": "Saqib Saleem is a great actor; I like his acting in Comedy Couple, great performance. He should work more for web series."}, {"id": 541, "text": "I love the story idea, the concept is great. The theme was so smooth and totally mixed with comedy and fun."}, {"id": 542, "text": "Love matters the most. No matter what happened. Deep is a liar but their romance is totally true. Loving the new concept."}, {"id": 543, "text": "I am recommending Comedy Couple to everyone. I am now a big fan of Zoya and Deep. They look so good together."}, {"id": 544, "text": "Comedy Couple is something you don't want to miss, if you want to enjoy the fun, the energy and cute romance."}, {"id": 545, "text": "I am in love with the acting of Zoya and Deep. Their chemistry is so hot and looks full of fun in Comedy Couple."}, {"id": 546, "text": "What an awesome film, made my day. The Comedy Couple movie is very interesting to watch."}, {"id": 547, "text": "If you are looking for romantic comedy, must watch Comedy Couple. You can't find anything better than it."}, {"id": 548, "text": "We need such contents to be shown. It is so romantic, loving and makes you feel real. A beautiful one."}, {"id": 549, "text": "I have already watched the film and am again watching it. I genuinely loved the concept of fun, romance and lies."}, {"id": 550, "text": "Comedy Couple is a must watch film, I wanted to see more of it. The makers have made something fresh and new."}, {"id": 551, "text": "There are also entertaining turns by Pooja Bedi, Rajesh Tailang and Jasmeet Singh Bhatia in the film Comedy Couple."}, {"id": 552, "text": "A hint of sad time and lots of funny memories, kicked out from the apartment and getting a new house. A good combination story."}, {"id": 553, "text": "Shweta Basu Prasad's fifth film this year and I love her acting skills and talents. She performed so well in different roles."}, {"id": 554, "text": "Their standup comedy and personal life struggle is fantastic. I love the role of Zoya and Deep in the film."}, {"id": 555, "text": "Full on comedy, full on romance and fight. A young couple lives together in a live in relationship. Funny film to watch."}, {"id": 556, "text": "I thoroughly enjoyed this show. This is one of the best shows I ever watched. Good job makers of Comedy Couple!"}, {"id": 557, "text": "Wow! I loved it. It is so interesting and entertaining. I loved all the actors and the concepts of comedy and romance."}, {"id": 558, "text": "As like all couples Zoya and Deep have lots of ups and downs. How they deal with the situation and enjoy their life is interesting to watch."}, {"id": 559, "text": "Comedy Couple is a blend of comedy, fun and lies. The lead actors have performed their role so nicely."}, {"id": 560, "text": "This show makes us realize the fun required in life and romance too. The concept is amazing and intensive."}, {"id": 561, "text": "Shweta Basu Prasad did a fantastic job in Comedy Couple, she looked so gorgeous and she acted well in the series."}, {"id": 562, "text": "Zoya's acting is superb and when she doesn't show up for her marriage, brings curiosity to the audience. Loved the idea."}, {"id": 563, "text": "Saqib was doing a comedy role but he looks like a hero in the film, romantic film and funny to watch."}, {"id": 564, "text": "The script (from a story by Bikas Ranjan Mishra and written by Raghav Raj Kakker and Kashyap Kapoor) is based on today's youth and their relationship."}, {"id": 565, "text": "Zoya looks gorgeous and she did so well in the film. Her role totally suits her in the film Comedy Couple."}, {"id": 566, "text": "Zoya got so angry when she found that Deep was lying from her also. They have a good tuning and a normal relationship in the film."}, {"id": 567, "text": "An unmarried couple who are living together and kicked out of their apartment for naughty behaviors. Good comedy in the film."}, {"id": 568, "text": "Zohra Bedi's role is played by Pooja bedi. I liked her performance in the film of Comedy Couple. Great film."}, {"id": 569, "text": "A comedy couple is really fun to watch. Amazing story line with simplicity. Good way to portray a normal life with comedy."}, {"id": 570, "text": "A profession based on lies and turned into Comedy. Good work by Saqib in the show; he did well in the movie."}, {"id": 571, "text": "Zee 5 never disappoints its audience. What an inspiring film! I would recommend everyone around me to watch this film."}, {"id": 572, "text": "This movie definitely has love from all over the world. It couldn't be better and funnier than this."}, {"id": 573, "text": "One of the finest concepts ever. Great execution and the characters performed amazingly well."}, {"id": 574, "text": "What a film! 'Comedy Couple' is a Hindi-drama comedy film filled with a variety of emotions and humor."}, {"id": 575, "text": "The direction, scripting, fun and the storyboard are on its precise level. Saqib and Shweta have nailed it."}, {"id": 576, "text": "'Comedy Couple' seems to be real, natural and one that engages the viewers to its peak. Great job!"}, {"id": 577, "text": "Awesome! This film is as funny as it could be and also so motivating especially for the new generation coming up."}, {"id": 578, "text": "What a film! 'Comedy Couple' is a Hindi-drama comedy film filled with a variety of emotions and humor."}, {"id": 579, "text": "What a fun movie to watch. I absolutely loved the idea, concept and the visualization of the film."}, {"id": 580, "text": "The jokes and the punch lines of the film are too good. Makes me laugh every time I love Zoya and Deep."}, {"id": 581, "text": "I am in love with the movie and the song'. It has the most calming and beautiful lyrics. Feels good to hear."}, {"id": 582, "text": "The direction, scripting, and the storyboard are on its precise level. Saqib Saleem has nailed it."}, {"id": 583, "text": "I absolutely loved the script. 'Comedy Couple' 'had the most accurate dialogues and heart touching songs."}, {"id": 584, "text": "It feels amazing to watch all the brilliant actors sharing one screen and presenting an inspirational, tremendous and a super hit film."}, {"id": 585, "text": "Zee 5 is loaded with such great and inspiring contents. Feels so good to have these films in our industry."}, {"id": 586, "text": "The makers of the comedy couple should release the next part with more humor and fun. A romantic and sweet comedy."}, {"id": 587, "text": "I want my partner to be a comedian. At Least he can make me laugh whenever he wants. Deep Sharma you looked so hot in the film."}, {"id": 588, "text": "It's all about a balance of personal and professional life. A comedian can have many problems and still they manage to make us laugh."}, {"id": 589, "text": "Shweta Basu Prasad and Saqib Saleem look like a perfect pair on the stage. They both did fantastic work in Comedy Couple."}, {"id": 590, "text": "Kya Yeh Tumhe Pata hai I love this song of comedy couple and already it is my ringtone."}, {"id": 591, "text": "Not a lengthy concept, Zoya and Deep is predictable but totally funny and romantic. They both did a great job."}, {"id": 592, "text": "I watched the trailer and loved the concept of a couple on stage for comedy. I watched this film with my girlfriend. We both liked it."}, {"id": 593, "text": "Youth is going to love this concept of romance and comedy. Its mind refreshing and full with fun."}, {"id": 594, "text": "Amazing movie, real mushy fun, great acting and direction. Zoya and Deep lots of love guys."}, {"id": 595, "text": "A New concept and great acting must be watched. I just love it. This movie is awesome."}, {"id": 596, "text": "Nice Movie, I had a fun time watching this sweet movie like Comedy Couple. I recommend everyone to enjoy the fun."}, {"id": 597, "text": "Aadaab is insult and other are freedom of expression. In jail with gandhiji is and drink n drive case jail are both are same. Need to more editing. What is in actor name bu the way."}, {"id": 598, "text": "Comedy Couple is a light breezy entertainer that's a refreshing take on romance and relationships. The story of the film is nothing to write home about however introducing stand-up comedy brings freshness to it. The film doesn't take itself too seriously and the light treatment works in its favour. The story about a live in comic couple who fall apart to eventually get back together stays afloat due to a decent dose of humor and crackling chemistry between the lead pair. Both Saqib Saleem and Shweta Basu Prasad look lovely together and perform well in their respective roles. Their stand-up acts are a treat to watch. Director Nachiket Samant does a fine job. Perhaps the music and comedy could have been better but the film remains consistently watchable due to a nice lead pair and a light-hearted treatment to the story. It's a welcome change with so many crime thrillers coming out on various OTT platforms. Streaming on Zee5 it can be watched once."}, {"id": 599, "text": "Don't look for reviews.. it's a very good movie &amp; entertaining one. All the stars has done their work superbly. It's a light hearted rom-com movie so don't expect it to be a laugh riot but still it makes you laugh so much at some point. Movie is entertaining &amp; if you come from an urban family or you understand urban jokes than just GO FOR IT."}, {"id": 600, "text": "This movie is not comedy at all... It is hurting religious sentiment of people... Such movies should be banned"}, {"id": 601, "text": "Finished watching Comedy couple and I absolutely loved it. It is billed as comedy and I did laugh out loud frequently but it is also a touching drama of relationship. It had a very sweet touch mixing the comedy and drama. It's not just a rom-com it's most certainly a rom-com-dram.I haven't seen a film so effortlessly balance all the three genres.The comedy couple uses witty humour, charming leads and socially important topics to give us the best rom-com film of the year so far. It perfectly portrays how one lie can destroy everything. This movie makes us realise how difficult it is for a stand up comedian to do comedy when they are sad. Saqib Saleem was fantastic as Deep Sharma. He played his part effortlessly. Saqib Saleem shines in his role. Can't stop gushing over his cuteness. He made me laugh and cry at the same time. He is an amazing actor Also loved Shweta Basu Prasad. Every actor in this film has done the most brilliant job.You can see Saqib grace the screen with his charming presence. Saqib Saleem and Shweta Basu Prasad's on-screen chemistry is unmissable. The funniest film shot in lockdown so far ."}, {"id": 602, "text": "Although the storyline is somewhat predictable, the cast gave very good performances from the leads all the way down to the smaller roles. Since we were playing close attention to the dialogues, we managed to catch several gems in the writing that had us smiling.It is not a comedy in thse sense of rolling-on-the-floor-laughing, it is very amusing to watch and the cast seems to be having a good time too.Kudos to everyone involved the making of the film."}, {"id": 603, "text": "Poor execution of a fantastic plot .... Unnecessary comedies which will make you to think why it was there .... Overall kuch samajh mein nahi aayega ... and based on outdated mockery of religious platforms"}, {"id": 604, "text": "A unique subject - love story of Stand up couples. The movie paces through sweet and funny moments, a perfect light heart drama. Well done to the makers."}, {"id": 605, "text": "Comedy couple Suppper cute rom-com..If u r a couple or have recently broke up u gonna love it even much mre..watch it out for d extremely talented Rangbaaz who has Crackdown all d hurdles and proving his talent one aftr d other - Saqib Salem.. D best part of d whole movie was him..even Shweta prasad ws also very good bt he ws unmatchable wid his performance full of cuteness and emotions!!!Der r several instances which r really amazing and make u fall in love wid d duo. Be it d gal proposing using a rubber band or d guy making ice coffee for her evryday bfr she wakes up!! Also sticking on to each other even after several months when u r falling apart is shown in a vry impressive way.D song 'Kya ye tumhe pata hai' is jst mind-blowing.. Released on zee5 premium!! Watch out"}, {"id": 606, "text": "This film full of comedy will entertain you completely. The director has brought the relationships of metropolitan life to the screen on the pretext of Deep and Zoya's story.Media and conservative ideology have also been attacked fiercely in the film. Taking up the theme of 'Go Mutra', the director in the film has also tried to satirize about 'freedom of expression'.In the 21st century, everyone claims to be modern, but when it comes to living in a live-in relationship of a boy and a girl, the high society and people who consider themselves very modern, also show their true colors. Huh. This is the focus of the entire story of this film.ZEE5's one-hour 55-minute comedy Couple is basically a film to attract the youth of the metros who find moments of laughter in the face of problems and tensions.Bikas Ranjan Mishra, Raghav Raj Kakkar, Kashyap Kapoor and Gaurav Sharma write and devlope the story of ZEE5 film Comedy Couple.Constant hiccups arise in this relationship and stability does not come easily. The comedy couple states that the two were raised in a completely different way. While Zoya is a self-sufficient girl made of a single mother (Pooja Bedi), Deep is a young man from a traditional Hindu family, who cannot rebel and adjust herself to the rites of childhood.The good part of the story is that in this, along with the couple, every effort has been made to bring out the changing political-social environment of the country. The film could have been tightened a bit.There are no chances of laughing out loud in the film, but Saqib and Shweta have handled the opportunities of stand-up comedy.A chemistry between Saqib and Shweta is fantastic. In particular, Shweta has flourished in the film beautifully and effectively.She is doing a consistently good job in the web world and this role of Zoya is noticeable.Pooja Bedi has returned to the entertainment world after nine years.Director Nachiket Samant has made Marathi films before this. This is his first Hindi film. Certainly, he retained the Metro feel of the story from beginning to end.He has given the two main characters of his film 'Comedy Couple' their separate zones. For this reason, the entire cast of the film 'Comedy Couple' is actually on its director Nachiket Samanta.ZEE5 film Comedy Couple's story keeps you feeling from beginning to end. The film could have been tightened a bit but this film will tickle the minds of the metro youth."}], "reviews_amount": 607}