{"name": "Smiley Face Killers", "titleId": "tt12757438", "reviews": [{"id": 0, "text": "Oh my god what an absolutely boring movie ! If you like seeing a guy ride a bike and look at his phone, then this is the movie for you !"}, {"id": 1, "text": "It got to the stage where I had to make a reference of the point at which something actually happened of any note. It's a 96 minute film and it took 64 minutes before anything remotely worth watching took place. In fact, of the entire runtime there is a sum total of around 1.5 minutes that are worth watching, and they take place in one short scene. How could anyone involved in this have sat through it and not realised how monumentally DULL it is?And why on earth pay Crispin Glover to play a role in which he doesn't say a single word and is so heavily made-up that it could literally be anyone?The two stars are solely for the one gory scene, as that is well done."}, {"id": 2, "text": "Based on true background information about a number of drownings found near places where there are smiley faces. This story centers on Jake (Ronen Rubinstein) who is stalked during the entire film. He is off his meds and has issues, so I didn't mind it when PLOT SPOILER they finally get him into the white van we have been seeing the entire film.Jake is boring and so is the film.Guide: F-word. sex. partial nudity."}, {"id": 3, "text": "I'm writing this what I think is an hour in... maybe ten. Nothing has happened. Devin got killed. Who's Devin? Does it matter? This should be the Sleepy Face Stalkers, not killers. If this was based on true events, I'm pretty sure everyone was bored to death."}, {"id": 4, "text": "There isn't a single aspect of this movie that works. It has some if the dullest shots ever seen on film, half of the movie is literally just people walking and acting confused. It's even a bigger disgrace that they dared to even remotely allude that the events depicted are based on a true story. If you plan on watching it just because of Crispin Glover, he's in the movie for like a minute and has no lines."}, {"id": 5, "text": "BORING! I'm halfway through the movie and nobody's even dead yet. The characters aren't interesting and it felt like watching paint dry. Heck, you know what, even watching paint dry is much better than this waste of time film!"}, {"id": 6, "text": "...and believe me, I've watched some bad ones.Watched this because it was a Lionsgate films and generally they are fine but what even was this.You take a premise of a well known spree of crimes and it becomes this boring mess.Could have been so much more. Forgettable."}, {"id": 7, "text": "This movie is not what the marketing shows. It's not a slasher. Having said that, I did enjoy this movie for what it was. Knowing already that it was written by Bret Easton Ellis tells me what I'm in for. It's very atmospheric with A sense of impending dread slowly closing in on the main character. I must admit that this movie is very disjointed. When the final act comes around you will swear you were watching a different movie. For a movie called The Smiley Face Killers, the killers are really only featured in it for the last 20 mins. The ending will leave you with more questions than answers. I recommend if you are into different types of horror other than the constant slasher death type. It's a slow burn 🔥 but the ending was worth it. Plus this movie is SUPER Homo-erotic. A lot of the first couple of acts reminded me of the tone of Nightmare on Elm street 2. There could be a lot to read into between the lines."}, {"id": 8, "text": "Ronen (Jake) does an amazing job in this movie! He's also in 9-1-1 Lonestar and he's fantastic"}, {"id": 9, "text": "Very loosely based on a true story which it managed to get all wrong, aswell as the casting who are Zzz listers at best. It's a poor film trying to do something different that has been done too many times before..and much better! A mess."}, {"id": 10, "text": "Is he crazy or not. Well I guess you will do like me and watch this good true events movie. Yes I recommend it. James Welch Henderson, Arkansas 12/11/2020"}, {"id": 11, "text": "The movie has a fresh subject and I liked the use of silence, only filled by some on point music choices. What I liked the most though is Ronen Rubinstein's performance, I found it majestic. He managed to represent depression and paranoia as it is in real life, showing us what people who have to deal with such mental illnesses have to deal with every single day . At some point he seeks for help, but doesn't get it back, or at least not in the way he needs it. And something I really appreciated was that his mental condition doesn't magically disappear through the movie, as it usually happens. Rubinstein can keep his mental health condition under control, not letting it slip away, always reminding us that Jake (his character) is really struggling with it. But now let's take a moment to talk about Ronen Rubinstein's facial expressions. This wasn't the first of Rubinstein's works I've seen and his facial expressions are always on point, whatever his role is. He demonstrates that he can master every single role he's given, and every situation without any problem. So, Kudos to Ronen Rubinstein for all of this!"}, {"id": 12, "text": "This is everything. Top tier Bret Easton Ellis. A striking return to form for director Tim Hunter. Crispin Glover using Lone Chaney's physical face distortion techniques. Not to mention a totally fun spin on the Smiley Face Killers Theory. Beautifully shot. Cool music. Tons of that Bret Ellis dread. This is a small genre treasure."}, {"id": 13, "text": "This was absolutely terrible and totally disappointing movie. boring, out of any point, bad screenplay, not good acting and so on. this 2 points for work and existence. I want my 90 minutes back! I think Ronen Rubinstein is much better than he was in it."}, {"id": 14, "text": "The fact that this movie was written by the same person who wrote The Canyons starring Lindsay Lohan, speaks volumes. Bret Easton Ellis is an author not a screenwriter. That's why the dialogue is atrocious, the story falls flat, and the actors were given such a bad script that the acting is unconvincing. I'll give the movie 3 stars for the gas station scene because that was the only enjoyable moment of the movie"}, {"id": 15, "text": "This film start with a goat been slaughtered, and the introduction of the main character Jake scene! As turnout, this film is about Jake need to survive from the killing of a bunch of cult member, who want his blood! Entire film full of boring conversation, and super annoying overuse scene! Such as, overuse of the main character take off his shirt scene, overuse of the riding bike scene, overuse of the walking scene, overuse of the driving scene, overuse of the staring scene, overuse of the partying scene, and overuse of the rain coat man at the background scene! Make the film unwatchable! Barely intense scene is, Jake been stabbed at the neck! At the end, Jake been killed! His friends been interviewed! That's it! Wasting time to watch!"}, {"id": 16, "text": "If you're expecting a slasher movie, with lots of killings, then this is not for you. However, if you want something different, that has never been done before, try it. The story most people have heard about: young men from universities around the US being found drowned and near the place they might have entered the water, grafittis of smiley faces. Theories of a group of serial killers on the loose and who have never been caught. With this background we have the story of one likely 'victim' of these killers, his daily life, problems with friends and girlfriend and we get to experience firsthand what it would be like to be stalked 24/7 (home invasions to mess with his things, phone messages 'the water wants you) until the rivetting climax scene ... and what a climax! A gas station confrontation that will surely be part of conversations about the genre in the future... And few other films have achieved such 'mood' and suspense with so many dark places where we know there's someone hiding and watching."}, {"id": 17, "text": "In France...how do you say.... Gar- Bahgh. Ripe and stinky Gar-Bahgh! I give it 2 stars for at least the film being in Focus."}, {"id": 18, "text": "If you've read Bret Easton Ellis' novels, especially: American Psycho, Glamorama, Lunar Park, The Informers, and Imperial Bedrooms; you'll enjoy and understand this film and have an appreciation for its transgressive story."}, {"id": 19, "text": "If you've read Bret Easton Ellis' novels; especially American Psycho, Glamorama, Lunar Park, The Informers, and Imperial Bedrooms; you'll understand this film and have appreciation for the film's transgressive story."}, {"id": 20, "text": "The film drags and draga for about 45 minutes before anything really happens, there is a lot of atmosphere and tension with no pay off, the characters are all monotone. Not a good horror movie and it barely qualifies as a slasher. Skip it, you'll feel better for it."}, {"id": 21, "text": "This movie don't have nothing going for it and the creature of this movie is trash for even putting it out now people to want to fight him lol"}, {"id": 22, "text": "The :-) killer is based on a true story it's very dark and very sinister where you think only one stalker but multiples.. almost like a Manson style killing Helter Skelter would have gave them a run for their money seamlessly a cult movie almost Loosely based on witchcraft or some demented wannabes..Jake Gram a good student but because he is off his meds all family and friends all start to trip saying  he is being different. He is being stalked and no one believes him.... if anyone knows really the true story it is not a happy movie or a happy ending I want to say these killers seek virgins but not accurately..heart breaking story..and I believe never solved..I give this movie eight star..good story and i actually felt bad for the guy..Worth a watch...and the acting is pretty good Ronen Rubinstein was believable and Crispin Glover freaked me out.."}, {"id": 23, "text": "Loved the artistic shots of the whole film. Ronen Rubinstein is PHENOMENAL. Plus they had Cody Simpson!"}, {"id": 24, "text": "First thing i want to say about this movie is--if the main character was a female this movie would ended differently--thats why movies like this are a joke just from reading the description of the movie--other than that the acting is pretty good especially by ronin rubinstein--you learn he has mental issues and begins to think he is being followed--and thats the type of movie this is--suspenseful--and different tone of movie than alotof people are used to--- and if its any consolation--you get to see him naked several times through the movie--he is one fine man for sure--but this movie as well as others label guys as the weak and other movies show the woemn are strong and can defeat godzilla if they had to--while the man stands do chance---this is one reason i gave it a low rating--as for the serial killers--if they exist-then they are just scared people afraid to confront things one on one --and did they kill these college guys because they were sexy hot strong guys--yes as i figure they were ugly and hated these men that look so nice-- and thats why seeing these strong jock type men arent so strong is a label that needs to change"}, {"id": 25, "text": "It's nothing short of excellent and a gripping watch"}, {"id": 26, "text": "Less than one star.... this movie was an absolute abomination. The best part of the movie was the beach party rave and the music to go with it. DO NOT WATCH THIS, I REPEAT DO NOT"}, {"id": 27, "text": "The thing about this movie is that the first hour or so of it is good-really creepy, really suspenseful-only for it to all fall apart at the end. It's as though the filmmakers suddenly realized they were running out of time, and so cut out the entire middle of the film they were trying to make. It's jarring, and ultimately boring: without some kind of bridge between the thriller aspect of the majority of the movie and the slasher aspect of the end, the climax seems weirdly disconnected, and thus somewhat dull. That said, the very end bit makes for at least a slightly more interesting ending."}, {"id": 28, "text": "Whilst I didn't know what to expect with this film (having not knowing much about the smiley face killings), I was quite underwhelmed by the end. The film did a good job of portraying the depth of mental health and how this manifests within someone's mind, but overall there wasn't much more than to it than that. Yes the film was a slow burner, bringing in themes of loneliness, misery and depression, but the ending just fell flat and left you hoping for something more. There was no explanation into the smiley face killers- who they are and why they're doing what they're doing - and thus the viewer doesn't really gain anything by the end - it just goes in a loop. Ronen is a good actor, but I think the storyline of this film didn't do him justice unfortunately. I felt as though you sit through the majority of the film hoping for some explosive ending, but nothing."}, {"id": 29, "text": "I went into this with high expectations. Written by Bret Easton Ellis, directed by Tim Hunter (The River's Edge), it has the pedigree of a solid thriller. It's more like a Lifetime movie with a little added violence. Slow, improbable, with throwaway characters and low rent dialogue, it is far from a must see but it's watchable."}, {"id": 30, "text": "With the knowledge that Bret Easton Ellis wrote and produced this film I had to see it posthaste. With his penchant for nihilistic narratives, violence and biting satire, Ellis is a favorite writer of mine so in that sense my opinion may be completely tainted by my fondness for this author and screenwriter.In the same sense I do undoubtedly posses a adoration for stalk and slash cinema so this film was right up my alley of ravaged bodies and rotting corpses.Adolescents, a cult that kills with abandon, gory visuals and an underlying sense of disillusionment as evidenced in the main character all collide to forge a slab of celluloid that was fun to watch and carefree.If you're perhaps looking for something that breaks the mould look elsewhere. If you are in the mood for a stylistic, well acted and savage piece of cinema then you have stumbled upon a gem."}, {"id": 31, "text": "Here's what I got from this movie;I think the director has a crush on lead actor Ronene Rubinstein. If he spent half the time focusing on the pacing and editing that he did on Rubinstein's six pack, I might've found something here worth watching.I think Crispin Glover had a car payment to make because he's in this movie for about seven minutes and then he's gone.This movie was 96 minutes long........ NO ONE DIES UNTIL THE 87 MINUTE MARK! I haven't been this bored with a movie since...... I DON'T REMEMBER EVER BEING THIS BORED WITH A MOVIE!In conclusion, Smiley Face Killers has exactly ONE positive as a movie. It would be perfect to show to prisoners you need to extract information from. Is Guantanamo Bay still a thing? If so, ship a copy to them asap!"}, {"id": 32, "text": "I really wanted to like this movie. Witn a description like about a handsome young soccer player, I understood it was going to be a vehicle to present a half to fully naked Ronen Rubinstein. Got it, no problem, but you can do that and have an engaging storyline. This one forgot that part.Two of my writing pet peeves were repeatedly exercised throughout this movie. The first, dialog that wanders around and takes 7 or 8 lines of exposition, when a good edit and trust in the actors could have got you there in 2 or 3. Show me someone is depressed, not have three characters tell him he's depressed. The second is when a character reflects back on some really important, life impacting thing that happened in the past, and then goes on to tell the impacted character about it. Generic example: Remember when your arm fell off that time? You were so scared and in pain. There was blood everywhere, and we had to go to the hospital and have it stitched back on. Pretty sure they'd remember all that, and it's kinda rude to spell out the pain to a friend like that. Again, needed another edit.Most of the rest was pretty cliche. Bloody gore for bloody gore's sake. Ended exactly the way I thought it would. And to all the gods in B movie heaven, a white panel van? Really?Actors unchallenged by lazy writing, barely make their way through a movie that could have been edited in half, but doing it on a low budget, brings me to a 4."}, {"id": 33, "text": "Like so many other horror/slasher films this starts with the usual, Based on true event' sort of disclaimer, but like many of those films goes way off the rails.This is a brutal horror/slasher film, that uses a theory of actual events that took place in the mid-West from the late '90s into the the 2010s. Close to 50 young men were found drowned throughout the area with reports that 'smiley face' graffiti was found near where the bodies were discovered. The theory of several former law enforcement officers and a forensic doctor (written about in 2008) was that these were actually murders committed by one or more serial killers. Dismissed by most professionals in the field the theory has nevertheless been popularized in books and 'true crime' shows.Here the location has been changed to Southern California and the number of 'mysterious' deaths more than doubled. A slow beginning, with some animal mutilation that might disturb some folks. The later murders are quite gruesome. I'm giving it a 6 out of ten, as there are some scary and intense scenes. However, it does seem to take a very long time getting started."}], "reviews_amount": 34}