{"name": "The Plot Against the President", "titleId": "tt12734800", "reviews": [{"id": 0, "text": "Absolutely baseless so called documentary. I do remember when we were fighting injustice and lies, now we defend it. We were fighting authoritarian regimes now we are creating one. This documentary is writing the story what they want you to think. It's not fact checked, it's imaginary. Friends talking about their friends how not friends trying to undermine them. You won't learn anything from it as from documentary, you might, however, watch it as comedy. It is created as a final try to win a presidency yet again, and probably it helped... He lost just by 6 million votes.There are so many better documentaries on Prime than this."}, {"id": 1, "text": "This is a documentary is a great example of alternative history. If you are a conspiracy junky, you might enjoy watching"}, {"id": 2, "text": "Disappointed in Amazon for putting this on prime video nothing but a bunch of crock. if you're gonna watch it do some research and get the true story. This I watched it again to digest all the conspiracy theories just for my own sake and I felt that my views and opinions haven't changed. This second view was after the 2020 election. Trump and the republicans have totally gone off the rails. Flint is suggesting martial law, 126 senators want to over tun the elections in four states and give them to Trump. If you believe all what this documentary has to offer I suggest you really need to get back to reality."}, {"id": 3, "text": "Conspiracy theories mixed up with a lot of epic music - a right wing propaganda."}, {"id": 4, "text": "The media has the capability to totally distort news by adding their opinions and creating half truths and calling it news. It is fascinating to watch them change the news to fit their agenda. But is is also very sad to see their manipulations."}, {"id": 5, "text": "If you're too young to remember the Senate Church committee, the inner working of the US intelligence agencies are unfamiliar to you.The most skilled at deception and false narratives, currently work (directly) for the media that inundates you on a daily basis.This is a must see to understand the full story of how the intelligence agencies moved against a sitting president, and nearly succeeded."}, {"id": 6, "text": ". . . have the gift of writing such unintended satire. I'll cut to the core. . . if you know anything at all about Devin Nunes, then you know that any storyline that posits the assumtion that he has any intelligence whatsover means you are been pranked--it makes no difference if it's a knowing or unwitting prankster at work, either way the result is the same. Subsequently, as satrire, this movie rates a solid 8 stars. But as a historical document, it rates a solid 0."}, {"id": 7, "text": "There are plenty of topnotch individuals speaking the truth candidly regardless of their personal feelings about Trump. We know Kash is not a Trump fan yet the truth is the truth regardless."}, {"id": 8, "text": "This documentary spelled out clearly in chronological order how attempts were made to overthrow the President.I'm amazed that after all this evidence, not a single person has been questioned or indicted regarding this coup attempt.To anyone dismissing this remember it's all fun and games when it's against someone you dislike but history tells us these things will quickly turn against someone you do like, then it won't be so entertaining."}, {"id": 9, "text": "The proof is out there today, the emails, the documents and memo's at the FBI all just now declassified for all to see! But Left leaning media will not cover Facts, it completely indicts Democrats and Partisan politics at the FBI &amp; CIA in the Public eye. DOJ indictments are yet to come!What is Most Tragic of all this is the Left in general, they know better, they deny the facts, are corrupt by their lack moral values thus playing a role in the support of political fraud, deceit and corruption!"}, {"id": 10, "text": "Whether one likes or dislikes the president it is pretty clear that there was a plot to overthrow him. The plot both failed and succeeded. It failed because the wrong presidential candidate got elected. It succeeded because it haunted the president for more than 3 years. Not only people who were behind the plot have not got punished but they were also able to persecute innocent people to cover for their deeds. Every American should at least watch this movie."}, {"id": 11, "text": "No doubt that with the advent of 24 hour news (infotainment) and the huge amount of money it garners, media is forced to seek ratings which creates a pandering to their audience (or spin). News sources are rated yearly by multiple sources local and abroad for their truth levels. It is known that popular infotainment channels spin.. BUTThe President doesn't need a plot against him. The man has made himself the most available President in history and that is his undoing. Not media. Because people can see him and hear him directly, people can hate him with no fear of spin being the cause. He put himself out there and most people don't like him, his behavior, or his policies."}, {"id": 12, "text": "The claims in documentary have been proven wrong multiple times by multiple intelligence agencies. If you enjoy seeing just how pathetic the Republican Party has become then this is a decent passer of time. If you're looking for factually based content this is not for you."}, {"id": 13, "text": "Just watched and then immediately shared with friends and family via texting. Very powerful and it's scary as hell to know that we may have never known had Trump not won and Devin Nunes and others had the guts to expose it."}, {"id": 14, "text": "I'm fairly apolitical, but it was with great difficulty that I made it through to the end of this. Previously discredited theories, moldy with age, have been reheated and dished up again for an uncritical audience who are hungry for this sort of thing. I noticed that Trump Tweeted 'Highly recommended' in response to it. To be honest, it would come as no surprise if I found out that he had funded and scripted this piece of arrant nonsense himself."}, {"id": 15, "text": "People are saying that this is the best movie ever made, better than Gone With The Wind and Finding Dory. We know come Award time that it will probably win 36 Oscars, probably more, who knows?! The fake news would have you all believe that this just incredible movie is nothing more than xenophobic, right wing drivel, paid for by redneck morons, Jesus Freaks and environmental terrorists. Not true, I've heard people say that everyone interviewed was tested, lie detector tested, many, many times, and everyone of them scored %100, maybe more, who knows?Look out for the sequel coming to celebrate our second term in The Reich, it's called... How I killed COVID. (One mans battle against The evil China/5g virus armed only with an AR-15, a 6 iron and A Bible(not necessarily his own). To be followed, by my third and final instalment, to be released to celebrate my third indefinite term which will be simply titled My Struggle.(Translated from German)This volume will be released in Russia,Saudi Arabia and North Korea under the title Trump: The Art Of The Steal"}, {"id": 16, "text": "John Brennan's handwritten notes about briefing Obama on about this certainly is coming back to bite them. The CIA, FBI and Obama Administration knew this was a made up work of fiction by the Clinton campaign from the very beginning. And that this was entirely a plot by Hillary to try and smear Trump before the election.This is hilarious that people are still trying to defend Clinton and Obama. This is some of the most evil and corrupt people America has ever seen and need to face the full punishment that is available.#StillYourPresent #FourMoreYears"}, {"id": 17, "text": "Not sure why people who haven't seen the movie are rating this poorly. I've watched 3 times and pick up on something new every time."}, {"id": 18, "text": "I thought I all caught up on this coup, but I learned just how egregious the treachery is and was. A must see, even if you think you know everything. I hope POTUS see this."}, {"id": 19, "text": "It is time for Americans to stir from their apathetic sleep and see what quality journalism has to offer. This should be shown during prime time on every network. It's not about entertainment, ratings, or agenda. It's about the truth, and we should crave it. We owe that much to our children and grandchildren."}, {"id": 20, "text": "The people who rated this documentary poorly clearly have been consuming too much Adam Shiff and CNN/MSNBC. Forget watching Fox forget the mainstream media sources. Do your own research and see that everything in this film was done with empirical evidence that was proven time and time again. You can tell the people who rated this poorly didn't even watch the documentary it's just their world bubble was bursted and anything orange man does or anyone involved is bad! Devin Nunez and his team especially Patel exposed the institutions were all told to blindly trust. Watch this documentary, research the information and you will be shocked and blown away. Put away your predisposed bias and give real information a chance. Left right center this should scare you."}, {"id": 21, "text": "Very well done documentary. It does a great job of uncovering the layers of misinformation and trickery in a fashion that is simple to digest for the viewer. Chilling account of how our nations most prized and fundamental federal institutions have been weaponized and brought under group think to conform to standards developed by partisan political parties which are used for their own advancements and not those of the American people."}, {"id": 22, "text": "The truth will be called a lie by those that who are afraid of the truth. Smith has been doing a great job at exposing the truth for 3 years now. As a former intel officer in counterintel, I have researched everything. This documentary comes close but does leave out other truths the public is not ready to know yet."}, {"id": 23, "text": "Politics at its worst.... then exposed. I hope that there are actionable consequences for those involved. Durham and new DOJ, Godspeed, just want the truth and then the consequences!"}, {"id": 24, "text": "The left wing of the country now uses the FBI, DOJ, and CIA to illegally destroy their enemies. This is the true story of the Obama administrations attempt to destroy Gen. Flynn and Donald Trump. The liberals infesting this site and citing a movie they haven't even seen are especially disturbing. Don't think it can't happen to you too."}, {"id": 25, "text": "I gave this film a ten because of it's importance and clarity and sincerity. I thought the movie flowed effortlessly. It helped me in connecting the historical events to the recent timeline. It provided explanations for many of the Why's that Americans must have. The people interviewed are credible and quite frankly, brave. The negative reviews that state this movie is propaganda indict themselves. To claim the movie is just propaganda without providing any reason why, assumes the readers are just too stupid to comprehend any counter points of specificity from the film. To sling insults without any mention of what exactly they claim are false comments in the film doesn't really constitute a review. In fact, it does more to support the veracity of this film. Everything reported in this film as fact has been proven. If it wasn't, the negative reviewers would have mentioned those falsehoods, agreed? Unless they didn't even watch the film. Instead, they would like to refer to you as, and these are just a few of the reviewers adjectives describing you, should you agree with the film or even watch it for that matter; insane, medicated, conspiracy theorist, ridiculous, to mention a few, so as to shame you for actually watching the film and forming your own opinion. But don't be offended by them. As you already know, fear motivates hate. Try watching the film with a Golden Rule perspective as a baseline, and then do some research and try to disprove one single thing in it that is mentioned as fact. Betcha can't."}, {"id": 26, "text": "This movie makes excellent points and presents evidence that the MSM won't or will frame in a dishonest way. Highly recommended."}, {"id": 27, "text": "The most important and well done documentaries of our time. Great story line and production value. A sober look at the events before and after the election of Donald Trump from the men and women who were there. It goes into great detail about the people who tried and continue to try, to take out Trump and how they do it. The film also exposes the unholy alliance of deep state political actors and world media outlets. It shines light on the men and women who fought against a coup of U.S. president and the price they paid. You will not believe what happened and that it happened in the US. Must watch."}, {"id": 28, "text": "This has got to be a joke! Sense when are political ad's made into movies?"}, {"id": 29, "text": "Viewers of Dan Bongino's videos will not be surprised by the facts brought to light in this documentary. It is nothing less than a political coup to oust an enemy of the Leftists and other swamp-dwellers and they are completely unapologetic about their lies. So desperate are they to oust President Trump that leaders you THOUGHT shared your views on love of this country are exposing themselves as just more members of the swamp. Seeing this in James Mattis broke my heart, but it shows just how deep this goes. The Bottom line is that you cannot ignore facts. The Left will lie, then lie about the lies...all supported by MSM, Twitter, Facebook and Google. My greatest fear is the hidden Radical Left have been entrenched so long and their agenda so advanced, President Trump may be unable to save this country. He was (is?) the last chance to work this out with any civility....but the Radicals are not civil. Portland was just a blip. I fear what's coming next will be catastrophe not seen in 150 years."}, {"id": 30, "text": "Devon Nunes as intelligence? As a California resident, the blatant lies &amp; violence provoking retoric is sickening. Anyone can splice facts together &amp; produce a documentary. Anyone else curious as to why the star of the show isn't listed in the credits? This man &amp; his flat out lying &amp; cheating has been voted out of office. Stop with the conspiracy theories! Enough is enough! Who doubts there is corruption in government? Not me."}, {"id": 31, "text": "I found this fascinating but at the same time rather sad that certain factions within the government deem themselves to be above everyone &amp; responsible to no-one! The hate that them combined with media to discredit genuine hardworking government officials is quiet frankly the most un-patriotic thing I have ever seen &amp; they all seriously need to be held accountable, just like they would've burned trump if they had found anything to do with Russia but they have nothing but never came out and said they had nothing either!"}, {"id": 32, "text": "I didn't really understand why they went after General Flynn. This film explains that as well as reveals what went on with the FISA warrant abuse and spying on the Trump campaign.The film reveals how malevolent and corrupt our govt is from Rep Schiff to the FBI to the CIA. They are rotten and maggot infested to the core. The things being done to ordinary citizens by these supposed trusted agencies is appalling and against the principles of this nation.It's like we're living under Stalin where people are having their lives ruined or are being railroaded into prison for their political views.I don't know how long our govt has been politicized, but it's disgusting. They arrested Roger Stone with SWAT and an amphibious team like he was a dangerous, violent cartel leader. All dramatically caught on tape for effect. Yet, Hunter Biden hasn't been arrested for his heinous sex crimes and the FBI has had solid evidence against him from Hunter's own laptop for a year."}, {"id": 33, "text": "And be scared out of your wits. This was an attempted coup on the duly elected President, chosen by we the people. Edward Snowden told you this was happening, but the dems took it to the next level. Corruption runs deep in America."}, {"id": 34, "text": "Having read some of Lee Smith's other books, I couldn't pass this up. This should be required viewing in the US today, as well as any other country where citizens may fear their government weaponizing the full force of the justice system and intelligence agencies against their fellow citizens for political gain. Someday I hope to see a sequel where the perpetrators of this treason are brought to justice."}, {"id": 35, "text": "Very interesting to find out the players behind all of the information and misinformation coming out of Washington DC and mainstream media."}, {"id": 36, "text": "This is a very well produced documentary featuring interviews from all the major players in the disgustingly corrupt attempt to oust the duly elected President of the United States.It goes through the whole episode in a linear, easy to follow narrative that lays out, time after time, how deceitful the Dems were and how complicit the Media was in pushing this steaming pile of BS.Well worth checking out."}, {"id": 37, "text": "Among all the lies spread every day of the past 4 years, this is a breeze of fresh air. I wish they had included more video clips of senate/congressional testimonies under the oath from the main bad actors (Comey, Strzok, Schiff, etc.) and had gone through more legal documents. I see a lot of reviews calling this right-wing propaganda, and including some of these proofs might have helped open the eyes of some of these reviewers. Although, honestly, I don't know how much hope is there for that. I would have liked to see some more on the bias of Judge Sulivan as well."}, {"id": 38, "text": "Devastating expose of the Swamp in action and a chronicling of the heroes who fight the good fight against the diabolical manipulation of a power hungry cabal. Make up your own mind, but only after you've seen The Plot Against the President."}, {"id": 39, "text": "The fact that this happened and no one has been held accountable is a shame. The fact that so many reviews pretend this is just propaganda is embarrassing as an American. If the truth matters even remotely to you, this is a must see. This must never happen again in our country."}, {"id": 40, "text": "I try and get perspective from all parties as much as possible. The American people received one sided information for 3 years from the media and unscrupulous politicians,this is not groundbreaking news. I had an idea that there wasn't much to the collusion via personal research, but had no idea how deep the lies ran until watching this movie. It was frustrating to say the least, having my eyes opening wider and wider with every insider's account of the Plot against a man who hadn't been in office a day. The movie is an excellent watch no matter what side you are on. It is a chilling insight of what can happen when the powers at be are fearful of losing, well.. power."}, {"id": 41, "text": "Oustanding Coup d'état Documentary on the greatest crime against the President of the United States, Donald Trump, and the American people. Excellent detailed reporting of the fabricated Steele dossier, rogue intelligence (FBI and various institutions) and deep state ops (including Rice, Clinton, Obama). Absolutely fabulous production of the truth about this deceitful Russiagate phenomenon! Cheers!"}, {"id": 42, "text": "Super interesting. Greatly enjoyed the movie. Definitely worth watching however you can. It's in depth, and very well put together."}, {"id": 43, "text": "Finally a true factual documentary of corruption at the highest levels of govt. The agencies that we depended on failed miserably and are wreaking with corruption. The media, as we know, might as well be a communist state run media. They are so afraid of Trump and all he did was expose what was already there. He will never drain the swamp during his time. The swamp is too deep, too dark, and too corrupt. The Democrats see a push for socialist/communist government. It's always been there but now they are exploiting their momentum. They know the more people that are tethered to the government, controlled by the government, need the government for sustenance, will always vote for them. This has never been about ethics and morals for the left, it's always about power and control. Every scheme they concocted has been proven a lie. It's the moderate Democrats and the Republicans that they are after, Trump is only in the way for now."}, {"id": 44, "text": "Only one indictment?Some need to go to jail here.A sad state of affairs for the USA."}, {"id": 45, "text": "The factual information within this documentary is terrifying. We must wake up and see how wrong this terrible corruption is. Such a well put-together video that I hope everyone sees and opens their minds to the scary facts we are facing in our amazing country."}, {"id": 46, "text": "Those giving this negative ratings and reviews are still controlled by the media propaganda they consumed for 3 years. Everything in this documentary is backed by documented evidence. As stated in the film, none of the 65 witnesses before the House Intelligence Committee testified the saw any evidence of coordination between any member of the Trump team and Russia. Furthermore, the president CrowdStrike testified they found no concrete evidence Russia or anyone else hacked the DNC to obtain the emails released by Wikileaks. Furthermore, we now know this hoax was started by Hillary Clinton. If you do not know that, change your news sources."}, {"id": 47, "text": "A MUST watch. Actual facts and evidence about what really happened with the Russia hoax and investigation that followed."}, {"id": 48, "text": "It should be illegal to call this steaming pile of lies a documentary."}, {"id": 49, "text": "This documentary shows how people in the government can manipulate the narrative they want to be shown to the public from the people they don't agreed with them. Have watched it several times and kudos to Representative Devin Nunes, et. al and to Amanda Milius in delivering this truthful documentary. Hopefully more documentaries like this will be out."}, {"id": 50, "text": "This should be a must view for anyone. I don't live in the USA; however, I feel what is shown is happening right throughout the west at the moment. The account shown is well put together and easy to understand. Surely in time those responsible for their actions should be prosecuted."}, {"id": 51, "text": "If these facts do not become well known, we are doomed as a country. Please watch.Extremely well done and riveting. Bravo to Devin Nunes.Best political documentary I have ever seen, unfortunately for our country."}, {"id": 52, "text": "You have to be slightly politically twisted to follow who did what when. What drove the chain of events to get us where we are today. In a nutshell Trump was not supposed to win under any circumstances. In hindsight the Democrats had 4 or even 8 years to groom a better successor and instead they bet all their money on a very flawed horse. Hence the 2016 miracle or disaster...depending on which side you are on. Trump winning exposed so much of the way America thinks and works. Normal people like us feel as though what happens in the upper echelons of Govt doesn't really affect us. We need to think again. We have given up so much control to our Govt and have allowed the Intelligence Agencies to tighten its noose on our freedoms. Trump will either go in 2020 or 2024. If its 2020 those Intel Agencies can and will claim victory. After that things will return to normal and all will be quiet and happy. Its simple really...all we have to do is work and obey. Oh yes, by the way, it can always get worse..."}, {"id": 53, "text": "This is a fictional tale of media scandal made presumably by people in the media? Unfortunately I must have tuned at the moments when Borat was cracking the jokes."}, {"id": 54, "text": "I don't know how this actually became rated as a documentary because it is full of conspiracy theories that have been proven false from the Republican Party itself.. The Senate intelligence committee published a report into Trump and debunked most of this movie which is mostly hearsay itself. The movie actually draws conclusions on almost no evidence or eyewitness accounts and draws on conclusions by hyper partisan politician."}, {"id": 55, "text": "Ignore all the 1 star ratings from obvious TDS radicalised democrat shills having their russia collusion narrative crushed yet again. This documentary really shines the light on what goes on behind the scenes of power and the public battle for narrative control at any cost. After seeing this it should scare everyone how fragile democracy really is.All it takes for evil to prevail is for good men to do nothing. Let it be known nobody was warned!"}, {"id": 56, "text": "From start to finish it's subjective,one sided , non contextual and pure speculation.There is nothing remotely passing as testable facts and has been produced for an audience of one person only.File under alex Jones related junk"}, {"id": 57, "text": "Supposed to clarify what really happened in the 2016 election, over alleged russian connections, insider inside insiders inside, crooked fbi bosses and protocols, dizzy dossiers, lured gop's or dpc's, where the cia and nsa and dic, and even pence making a pound against the most alleged poisounous of all, the general over all generals in charge of intelligence ,flynn... well then you must look somewhere else, cause this complicates the simplefact .if you like documentaries with 100's of different comments of halftruths, have a go, not for me the grumpy old man"}, {"id": 58, "text": "Title should have been The Fat Cheeto The Trump Presidency is and will forever be one big joke and so will this movie."}, {"id": 59, "text": "Whereas the impeachment hearings necessitated the presentation of evidence and subsequently found Donald Trump guilty only to be pardoned by the Republicans, this movie is little more than conjecture and provides little if any supporting evidence for the position it maintains. This movie is just another press conference except with editing, music, lighting and I'm sure in many cases a well-crafted script."}, {"id": 60, "text": "This was at the beginning of president trumps presidency. President trump never had a chance. This is Nixon era illegal activity but worse."}, {"id": 61, "text": "The Plot Against the President is a superb documentary exposé on the workings of the Deep State that sought to remove a duly elected president from office, using lies, fabrications, malfeasance in the legal arena, and complicity from a cowardly media.The range of individuals interviewed in the film offers first-hand evidence of eyewitnesses to the corruption of the FBI, DOJ, CIA, and other federal agencies that colluded in the Russian hoax.Like Lee Smith's exceedingly well-documented books, this film offers the historical record of the collapse of our democracy, wherein unelected officials attempted to undo an election. The true hero that emerges in the story is Congressman Devin Nunes, who was relentless in standing by the evidence and stood up to the establishment.Many jokes were made during the 2016 election when Donald Trump would make reference to the swamp of Washington, D.C. This superb film demonstrates just how deep the swamp has become."}, {"id": 62, "text": "More Reich Wing garbage. Look out for the boogie man. Scaring people with false claims isn't worth your time. I wouldn't expect anything less from these people."}, {"id": 63, "text": "Not a bit of this is true Devin Nunes contrived these alternative facts to muddy the public's perception of the impeachment of Trump for actively soliciting foreign interference in an American election. The actual facts were confirmed by a bi-partisan congressional commission, and concluded that Russia massively intervened in the 2016 presidential election. If you believe this hokum, you'll believe anything."}, {"id": 64, "text": "Seeing crap like this really makes me feel sorry for those 50% of Americans who are good, decent people (instead of the half that fall for propaganda and hatred).I am glad that I do not live in your country."}, {"id": 65, "text": "While the various tiny pieces of content are solid in and of themselves, I don't think they're stitched together into a clear story, although It might be fine for a viewer who already has a clear understanding of everything to see some people involved talking about it. The biggest criticism I have besides the lack of clarity was the unnecessary, distracting and counterproductive interview clips of some sort of shadowy hidden figure with a masked voice; the last thing this story needs is more anonymous sources."}, {"id": 66, "text": "True Story of How Congressman Devin Nunes Uncovered the Biggest Political Scandal in U.S. history."}, {"id": 67, "text": "If nothing else comes from Donald Trump's presidency, the fact that our mainstream media is an enemy of the people of immeasurable proportions is now undeniable. They've lost every shred of credibility at the expense of shining a bright spotlight on to their completely laughable bias.We, the people, are not buying your particular brand of obnoxious contempt, and you've sealed your own fate. Perhaps our journalisming 'betters' can learn to code, in light of their approaching unemployment- couldn't happen to a better bunch of malcontents."}, {"id": 68, "text": "All true Americans should watch this documentary. The truth behind the media lies.."}, {"id": 69, "text": "Great documentary. Shows how the deep state and the media were complicit in a attempted a coup. Puts all the pieces together very well. Including the railroading of General Flynn and setup of Roger Stone."}, {"id": 70, "text": "Everyone needs to see this. It should be required viewing. People really to need wake up and stop voting in corrupt and evil people like Joe Biden."}, {"id": 71, "text": "Let's be honest, liberals will never watch this documentary. Their hatred for Trump won't allow it. This documentary went into more detail of how the coup attempt took place. It was more than just destroying, bankrupting, and imprisonments. It was to remove a duly elected President and replace him with Hillary Clinton. They elaborated on a lot of things we knew already, now imagine what we don't. The filmography and symbolism was well done!"}, {"id": 72, "text": "Here is a well laid out explanation of how Obama , Clinton , conspired to to use illegal wiretaps ( worse than watergate ) before and during Trumps transition and well into his Presidency . It demonstrates the criminality of the FBI and deep state actors all under the Obama administration and Clinton campaign / DNC ."}, {"id": 73, "text": "I am not America, but the rating on this really shows the divide in America at this time. This clearly is a right wing documentary, but it doesn't necessary means everything in it is wrong, since left wing media had its fair share of propaganda too. You just have take it with a grain of salt and do your own research. Let's hope the next few months are peaceful and healing because a great nation like America does not need this right now."}, {"id": 74, "text": "Well put together. The news doesn't tell you the whole story."}, {"id": 75, "text": "I watched in Primevideo. So good , just make you understand what is really going on about the swamp in DC"}, {"id": 76, "text": "Very well done! Gives a lot of background and info on General Flynn I wasn't aware of until watching. Definitely recommend."}, {"id": 77, "text": "This documentary should be seen by every American citizen. The evil it exposes proves to me that Obama and his cronies will do anything to push their anti America agenda. They should all be in jail for a very long time."}, {"id": 78, "text": "It is so complicated to paint the picture of corruption but now it has gotten easier. Just send the link to anyone you love because our Country can not allow this to go without accountability. Big Government is the party of corruption and infiltrates both parties."}, {"id": 79, "text": "Only thing funnier than this drek are the legions of trumpers flooding the site with positive review. Kind of reminds me of the great battle in the comment section for Suing the Devil when the producers literally threatened to sue me for thinking the movie was bad."}, {"id": 80, "text": "This shows the insides of what's been truly going on behind the scenes. It's not perfect but at least they are letting these people talk for once without being shut down because of this reason or that reason."}, {"id": 81, "text": "Very well done documentary showing behind the scenes details. I guarantee that you will learn something."}, {"id": 82, "text": "Brilliant movie exposing the Hoax of the Russian interference with the US elections of 2016."}, {"id": 83, "text": "Very informative doc on how the transfer of power between presidents is achieved. All I can say is Holy Hell! I do not reccomend this for everyone. Once you have taken the truth pill, there is no going back. I was and am, greatly disturbed by what I learned. It has forever changed me.."}, {"id": 84, "text": "This just proves how blinded with hate democrats are. They came here to rate this poorly because they're blind with hate. Most of this is true. I can't say all. That's a little eh."}, {"id": 85, "text": "People that call this propaganda are ignorant... Enjoy your bliss while we face reality for you."}, {"id": 86, "text": "Not a documentary. It's a Bad attempt at Trump and family wanting to rewrite their version of US history. This is all it is. Trumps version. Very sad, actually, to see the length they went to try and brainwash the public with this unfounded garbage.You will only like it if you believe in conspiracy theories and Lizard people. Now the whole world knows what Donald and family have been up to for ALL of 2020 while the United States has been fighting to survive. Mr Trump put out a movie. Sorry. It doesn't work. And, again, Donald Trump is a LOSER on another front. No Oscar here Donald. You lose again.It's sad Donald Trump doesn't understand what art Film is, and he's using it to exploit Americans, again."}, {"id": 87, "text": "First Things First review is VERY informative. Those that are corrupt (both parties) and those that influenced the election, know the real truth. They are afraid. America is not divided as it is made to appear and only those that possibly had anything to do with the result of the election know this."}, {"id": 88, "text": "Anyone rating this a 1 clearly did not watch it. They obviously based it on pure emotion out of their hatred for the President. So let's get out of the way that I am an Independent. I have liberal, conservative, and moderate positions depending upon the subject.You know like MOST Americans.Now as I was watching this, Edward Snowden came to mind. This was precisely the type of thing he did not want to happen, sacrificing everything to prevent it. And here we have President who was clearly the victim of it. If they can do this to the President of the United States absolutely no one is immune. Doesn't matter the political affiliation, race, gender, religion, or ethnicity. That, more than anything else, should be the takeaway here. Once a Monster is created no one can control it. That means sooner or later it will be coming for you too.Pretending it did not occur, or cheering because it happened to someone you do not like is absolutely insane."}, {"id": 89, "text": "It says something about the state of the political landscape in America where this sort of documentary is believed by so many. Never before have so many half-truths and misinformation been pre3sented as fact without any actual receipts to back up their claims.There is plenty to like and believe about President Trump and feel that his policies are what you stand for and wish to support, but the baggage that comes with that are the lies and deceit which are being force fed and swallowed by a very vocal minority who believe they are the silent majority.This documentary exemplifies all that , and then some.I am not a democrat and have voted republican many more times than not so don't think all negative reviews are simply liberals lashing out. As I said, why focus on conspiracy theories such as this film does when time would be better spent expanding the conservative base with fact rather than fiction.What a waste of time, energy and money making this state film. This is expected in Russia or North Korea, sad state of affairs that this is happening now in America... But the kool-aid has been served, watch how many slurp it up."}, {"id": 90, "text": "Borrowing the Washington Post slogan, every American should see this documentary to gain perspective and greater understanding of the Russian collusion narrative devised and manufactured to undermine and impeach President Donald J Trump.Truth and justice were never served in that undertaking, and the cost paid by us all rocks the foundations of what makes America the greatest society in History.Regardless of ones' political views, the truth of who was involved, the money trail, disregard for ethics, and manipulation of disinformation by political leaders and a largely biased news media deserves illumination for our all sakes, lest our Democracy indeed fades away into darkness.Well-paced and avoiding tedium, this is a well-made documentary and is highly recommended viewing."}, {"id": 91, "text": "A complete typical expected story from people who are trying to make deep state real. These are supposed to be honourable people, elected to work for their constituency. This is a work of fiction, just like Pizzagate Quanon Fake News  an attack on an honourable president . Come on, In the last 4 years I have watched The Great United States of America become the complete unreliable, divided and selfish. We brits have a sense of humour but this is way beyond funny. It is sad that the once Leader of the free world is now the laughing stock of the world. It is sad to see. I thought we were screwed when Brexit and Boris were the headline, now you have not just your Orange Leader, the Republican Party leaders have ruined your reputation, health and your economy.All this from watching this Fiction programme. Imagine what we would get if I read the newspapers?This is basically Fox News stuff. Fiction, repetitive, skips basic details, plot not credible and just a programme to brown nose trumpDon't waste your time."}, {"id": 92, "text": "Look we all have our opinions. Some like Trump, some don't. And some really, really don't. For those people, the truth is what they claim it is. It's not reality though. For years the democrats touted the collusion narrative. Adam Schiff was on every media outlet making statements of real evidence existing against Trump and his campaign. However, when the Mueller report came out, that was proven to be a lie. A lie formed at the highest level of what is supposed to be the epicenter of our countries' core values. Truth, justice. We know for a fact that the DNC paid Fusion GPS to come up with lies in order to get a warrant to spy on our own people. We know this. It's not opinion. For years we put up with this crap. Nothing, nothing has been proven to be what they said it was. Not a damn thing.What's so troubling is that nearly half of America believed it without any evidence. The misinformation was so vast that some still believe it. Actually more than just some. Our country should be better than this. Our justice system should be better than this. What was done is pure and complete treason. No matter what your opinion on Trump is, you should want something better for America. No matter how much hate is in your heart, you should want something better. To rise above your own hate. To stop listening to mainstream media when they stop reporting and start propagating for a narrative. It's disgusting to my very core what these people have done and the only thing that might make me feel hopeful is some accountability. Just because you don't like someone that doesn't mean that you can take the law and bend it to your will in order to serve your ends. It doesn't mean that someone is a horrible person just because you don't like them. This film is one of the most important things that Americans could ever see in their lives."}, {"id": 93, "text": "Nothing new here, the lies are all too obvious. I found it hard to once again listen to debunked conspiracy theories put forth by partisan political hacks of questionable character associated with the Trump administration spinning and shifting blame to distract from their own wrongdoing (I've researched multiple sources on all of it). It's hard to believe any of this is fact as you would expect a documentary to document. So, I can say it is a propaganda film just like a Russian government film.The connectedness of the film at times too linking the different conspiracy theories just went off the rails and made no sense on the face of it and was hard to follow. At other times the use of buzz words and phrases once again sounded like perpetrators trying to keep their story straight.Finally, the film quality reminded me of a B rated film at best.I want to give the film a zero as it was a complete was a time."}, {"id": 94, "text": "Trump asked Russia's help to win the election on national TV. And they did. Who in their right mind asks another country to meddle in elections? Tyrants, dictators, madmen, ignorant and cheaters.We have this person who has been a con artist all his life. He cheats, he lies and he steals. He fails at all his business attempts. He breaks records of lies per day since fact checkers exist. He shares conspiration theories and throws accusation without any shred of evidence. All he is is a reality TV star. He sells a brand name, that's it.He hides his academic record and claims to be a genius. He hides his tax returns and claims to be a savy businessman and a billionaire.Just look at Trump's fake university. He charged 35,000$ per person after one conference and gave nothing to them. No course, no follow-up, no nothing. He got sued and was about to lose 400 millions but settled for 250 millions (even though he always said that he never settles when sued).He only ran for the election for the publicity. That's how he makes money. He did not think that he would win and had no interest in running the country. Even if he had lost the 2026 election, he still would have benefited greatly from the exposure. But he won (with way less vote than his opponent) and will be known as the worst president ever.He never cared about democracy and prefers to be friends with dictators from around the world than be friend with long time allies of the US like Canada, France and NATO.Those who rate this a 10 are Trumpists and/or conspirationists. No one who has a minimum of critical thinking skills would consider this heap of garbage information."}, {"id": 95, "text": "This documentary explained thoroughly the depth at which the Democrats, Hilary Clinton, and the DNC took to cover up their illegal spying on the Trump Campaign. But they didn't stop there. They used fake evidence and attacked innocent people to try and impeach a duly elected official.When government officials flat out say on News networks that the President of the United States of America has partaken in collusion with Russia and Ukraine throughout his presidency, wouldn't you want to see that evidence? I would. The left media outlets tell the American public they are the only ones who can read you classified documents. Why is that? Is that suspicious? I think so.My take on this documentary is that whenever an allegation or conspiracy is brought onto an individual or president, I want To see hard evidence and where that evidence was sourced from and if it was paid for or not. Real journalism is not stemmed from personal opinions, it stems from facts which were not produced by the democrats in any sense in this situation.I hope everyone has a chance to watch this documentary and has the ability to make their own judgement."}, {"id": 96, "text": "Director witnessed this first hand as she worked in State Department. I have followed this and everything since Kavanaugh Hearings. At first I was more liberal and not politically active at all. Didn't vote at all in 2016. I did my own research along the way, requiring long days (10 hours every day for 6 months). What I discovered, I had trouble believing. As a result of that Intense period researching, I have not been surprised once in last 2 -3 years.I realize that nothing will change opinions- you are on one side or the other. It's become a Pro-America vs Pro-Marxist (and more). But, some people who do not research are confused by what they are being told.The director states she did this so people will never forget. Hopefully, once the hysteria that has been induced purposely on our nation has calmed down, maybe we can unite against the real enemies. That is, if we still have a nation.God Bless"}, {"id": 97, "text": "I found this documentary by chance because it was not promoted at all upon its release. I get why the major media networks would ignore it. It is very much an indictment if the way that they have behaved in the last 4 years.It is a very straightforward documentary told from the point of view of congressman Devin Nunes. It chronicles his investigation of the various attempts to link the new Trump administration with collusion with Russia in the 2016 election. It also deals heavily with the framing of General Michael Flynn. The film contends that he was a threat to the intelligence community as the incoming National Security Advisor to the new president. It is pointed out by the very people involved how this man was railroaded and how the FBI obtained FISA warrants through lying and omission. The interviews are very straightforward and informative. It is truly disturbing that the beauracracy can wield the power to ruin someone and undermine a president. But the film takes big issue with the media. How the media was complicit in pushing the narrative of corruption and Russia collusion to hurt President Trump. The way that they took any story that would hurt the President and push it without caring if there was any evidence at all to support the allegations. It is truly disturbing to see a media that is supposed to be a watchdog of the government just push whatever narrative that would hurt a president they hated. I wish the film would have gone deeper and explored the story even more.I get that most people's opinions on this documentary will depend on their politics but it shouldn't. What seems to have been done here is criminal and shouldn't matter what party you support to see that this whole thing was corrupt and is the kind of thing that shouldn't happen in a free country. Anyone with intelectual honesty should be horrified.Not be ok with it because you don't like who won in 2016.Grade: B"}, {"id": 98, "text": "The Plot Against The President is a documentary made by a pro-Trump group to promote him in the 2020 elections.It has its opening scene wherein a peaceful transition of power has been taking place from former Republican Presidents Ronald Reagan, George H.W. Bush, George W. Bush and former Democrat Presidents Bill Clinton and Barack Obama. It presents its opening theme as the true hallmark of democracy which is the United States is proud of. Then,it presents an idea that there is a plot against President Donald Trump with regards to the Russian investigation which is an attempted coup against him.Fast forward four years later,we get to see Trump not wanting to concede despite the fact that 24 out of his 24 cases of electoral fraud (so far) have been dismissed at different courts at different states despite the fact that more than 3 weeks after the 2020 elections after President-elect Joe Biden won. No question that Trump's claim of electoral fraud has not shown on courts. What is worse is that with the corona virus pandemic going on that has resulted to 12.3 million Americans infected (so far) and more than 257,000 Americans(and increasing) dying from COVID-19 as well as more than 30 million Americans that have lost their jobs due to the economic lockdown.These events alone prove that it is Trump who is a threat against democracy of the United States and the peaceful transition of power. The viewer does not need to get past the first 10 minutes of the documentary to prove who indeed is the threat against democracy . Evidently,it is Trump himself is the threat of the hallmark of democracy.This alone disproves what the documentary is trying to present and the theories it is trying to promote."}, {"id": 99, "text": "It's a political documentary so there's not much in the way of facts that you can rely on. If the very same story was done by the other side, they would be equally convincing with their point of view.These backroom operatives literally hate each other and will do anything , say anything, lie and cheat and spread bad publicity, to get the results they want.Now, I look at the current story from the point of view of a lifelong socialist who grew up in poverty back in England. A person who had a justifiable chip on his shoulder because of the terrible inequity in English society.Bear with me for a little background before I get to the reviewSocialism was an honorable pursuit in those days because so many of the underclass were treated like beasts of burden. Feed them and water them and you don't have to do anything more.So, I was led to believe that a vote for Socialists would even the playing field, would ease the chains of poverty and develop a more just society.As it took a toehold we saw the introduction of HealthCare, Universal Education, Workplace Reform, Unemployment Insurance and Social Housing... all immeasurably good progressions.Then socialism lost its way; in taking away some of the necessities that are the individual's responsibilities and assuming them for the State, incentive was nullified. This was compounded by the socialist's inability to manage its reforms properly, tax income just gushed down the drains.They got so carried away with their anger at the monied classes that they expanded their programs to the point where it was more beneficial for some to stay at home and do nothing. Eventually you didn't even have to leave home to get your benefits.The biggest weakness was that their anger blinded them to things they could have learned from the capitalists.This picture became clearer as I grew older and realized that I would get nowhere in this life if I just sat on my ass and complained, so I did something about it.I got a good job with the Government with unionized protection, didn't like the way the Union was run, so ran for President and was voted in.It was this seminal moment in my life that I realized that the Union Organization was more cruel to its members in many aspects, than the Employer itself was.The executive were all driven by blind hate. The most radical of them were intractable nutters and after a couple of years of this I surfaced as an unapologetic right winger, they never forgave me for it.This background is just to lead you up to the side I fall on when it comes to reviewing this Doc.Even though I think President Trump and his backroom boys have played some dirty pool (and some of them are real scumbags), I am convinced that the Democrats (and the Press) have been unable to come to terms with his election and would do whatever it takes (legal or illegal) to discredit and unseat him.They are driven by that same blind hate that has driven them from the start and biggest casualty is the country as a whole.With this current sitting, the animosity overrides every decision and it comes through loud and clear in the movie.I really don't know who to believe, there's nobody got up on the lectern and provided a vision for the country or a set of beliefs we can aspire to.It's all he said, she said and a country without a compass."}, {"id": 100, "text": "All the 1 star reviews are incredibly suspect, and should be thrown out as well as the 10 star reviews. What the traitors are relying on, is that you, the general public don't care, or can't understand what happened. Ths documentary lays out step by step the logic and facts. (No hyperbole, no fiery ad-honimem attacks you see in the media and social media. Watch for yourself, decide for yourself, FACT CHECK for YOURSELF.Stunning, highly disturbing expose of the lack of oversight in the DOJ and FBI and how that was leveraged for political gain. The incredible power of FISA warrants and how that process was subverted- to spy- which resulted in zero criminal data, but contributed to one of the greatest hoaxes ever perpetuated on the government and the US people.If nothing else, watch to see just how stupid Obama, Rice, Comey, Schiff and others, think you, an American citizen are. The arrogance and narcissism of those people is laughable.This documentary is very well done."}], "reviews_amount": 101}