{"name": "Just Another Christmas", "titleId": "tt13354204", "reviews": [{"id": 0, "text": "I was expecting this movie to be better because of its trailer, but i still enjoyed it and can see myself rewatching it every couple years. This movie is simply the plot of Groundhogs Day and Click, mashed into one, so its entertaining enough to watch unfold. The main character overacts at times but the rest of the cast does a great job of balancing things out. Overall it is definitely a heart warming, feel good Christmas movie with a couple of chuckle out loud moments."}, {"id": 1, "text": "Fun comedy with a great emotional attachment. I will watch this each year. I enjoyed every part of this film. Thank you for making a new Christmas classic."}, {"id": 2, "text": "Far exceeded my expectations. More original and touching. Plus the 'timeloop'-thing is unlike you have seen in other films."}, {"id": 3, "text": "Fun movie. Yes, like Groundhogs Day. Good job dubbing Portuguese into English."}, {"id": 4, "text": "Yes, of course it's a bit silly? That's to expect from a Christmas comedy movie. But in relation to what could only been a 1,5 h of laughs it actually contains a lot of heart and a beautiful message. A great movie!"}, {"id": 5, "text": "I wasn't expecting a movie from Brazil to contain such a heartfelt holiday theme. It does start out with a family man, stuck in a rut, family problems, job pressures, etc. Universal themes all around. What it does is take a classic Christmas theme, combine it with a 'Ground Hog Day' theme and make a new classic. It has laughs and tears, what you'd expect from a holiday movie. It was a pleasant surprise that I was not expecting."}, {"id": 6, "text": "I was expecting another cliché time-looping movie. However, this title was much more than that. It is funny when it needs to be funny and heart-warming when it needs to be heart-warming. This might be one of the best Christmas movies of this decade and definitely one of the best Brazilian comedy movies of this century."}, {"id": 7, "text": "Ok, I wasn't expecting this at all. I thought it was gonna be another time-looping movie, but it's more than that. It's funny, touching and has a beautiful message. Very good Brazilian comedy!"}, {"id": 8, "text": "Although the really bad dubbing into English will annoy you at first, please stick with it as it does get so much better. You will laugh and you will cry ... ugly tears. Destined to be a Netflix-Classic"}, {"id": 9, "text": "A very fun brazilian comedy, bringing universal Christmas theme: family crisis, run for buy presents, family reunion... Like a Groundhog day, this film is super emotional, besides very comic. Enjoy it!"}, {"id": 10, "text": "Great message behind! Very funny too! You can watch this with your family!"}, {"id": 11, "text": "Maybe this is the best Leandro Hassum movie, the other movies I saw from him were very goofy and not touching but this one is surprising."}, {"id": 12, "text": "Such a nice movie to whatch with family. Good Brazilian production. We recommend"}, {"id": 13, "text": "A must watch if you like weird, funny, emotional movie😅😅"}, {"id": 14, "text": "This is a great movie. I loved it, yea it's dubbed maybe not the best dubbing I have heard but this is so good. I loved the twist and the comedy with some great drama. Sinker to the adam Sadler movie with the remote. But much better. It just did not go for laughs but had some heart. This would be a great remake movie for next year. I can see him Carey he has the chops to make this movie. As long as they keep everything that this is show has it would be a hit."}, {"id": 15, "text": "I think it's the first time I write something here..but this movie has something special...I don't know why but it moved me a lot..I laughed and I cried! Very special ❤"}, {"id": 16, "text": "I don't normally write reviews, but this movie has left me in tears and happy at the same time. It's the perfect Christmas movie, not the cheap silly comedies, but real life stories told via dad's character played by Leandro Hassum. It shows many funny and some sad truths what life throws at you over decades lived with your family and all the happiness and pain you get to experience with you kids. This move is absolute gem and I applause the writer, director and all actors for making it happen. Thank you"}, {"id": 17, "text": "Here is hot, very hot, summer hot. A lot of people in the street, market. We celebrate at night before, with family, friends. This film shows how it is... and how family is. And remember us that X-mas is more than food, is time to love and forgiven still u have time to."}, {"id": 18, "text": "At first I thought it would be some Christmas satire, but it was a film totally without Christmas cliché, it was taken with humor with real Christmas drama and family, where time may or may not change its essence."}, {"id": 19, "text": "Not much else to say. My kids think its funny - therefore i added an extra star."}, {"id": 20, "text": "Very fun, an almost faithful portrait of Brazilian families at Christmas, with good comedic moments, and some dramatic moments, all good in a film, rare in national films, balanced and balanced, there is no way not to be moved and not to love ..."}, {"id": 21, "text": "It was a bit irritating in the beginning but then I realized that it was not the movie but me soaked with the same type of production."}, {"id": 22, "text": "I gave it 20 minutes, but it was just a bunch of people screaming at each other. I am definitely not in the target group for this movie."}, {"id": 23, "text": "This movie felt like an imitation of 'Click' but with a Christmas theme. It is hysterical, unfunny but ultimately watchable as Leandro's performance is not too bad and the age characterization and make up are very good. But in the end it was exactly what I was expecting from Netflix's typical over the top hype: a blow out of proportion movie who has nothing special about it."}, {"id": 24, "text": "The worst movie i have ever seen in my live!! I want a refund for my lost time!! Waste of time!!"}, {"id": 25, "text": "I used to be a big fan of Hassum, specially when he was fat, and watched all his movies. Some great, some average, but this one...is the worst of them all ! Groundhog Day has a similar idea and is far more interesting. Not funny at all"}, {"id": 26, "text": "I really did not know what to expect going into this film. To be honest, I was a bit sceptical. Like another reviewer on here, I was expecting another unoriginal 'time-looping movie'. However, this one was much more than that. At the heart of this film is the dialogue, the interaction and exchanges between the family members at the Christmas family gathering/dinner. The dialogue is funny, but I also found myself relating to the various family dynamics; I could immediately connect with the film, that is. It reminded me a little of other classic Christmas movies such as Christmas Vacation in this regard. One thing I liked about this film was that it shifted gears (emotionally speaking) later in the movie, touching upon serious issues such as marriage/relationship problems and cancer. Though this is also one of the shortcomings of the script, the writer doesn't develop these more serious storylines enough, I thought. That said, I went from laughing out loud to shedding a tear or two. The acting was strong, I thought. It took me about 20 minutes or so to get used to the dad (played by Leandro Hassum), but once I did, I thought he was brilliant. The supporting cast too had a good, strong performance. Again, at the heart of the humour in this one was the family dynamics, dialogue and interactions between the supporting cast. Overall, this is a very good comedy, a nice new edition to Netflix's 2020 Christmas season lineup/collection."}, {"id": 27, "text": "The new movie on Netflix Tudo bem no Natal que vem is proof that Brazil can also make good Christmas movies. The movie tells a story about a man who hates Christmas and is tired of this Holiday because every year is always the same: there is always an uncle who is boring, a mother in law who is annoying and a brother in law who is frivolous. As a punishment from life, he starts to have amnesia and forgets what he has lived all the year, the only day he can remember is Christmas Eve. Due to this, he realizes how much of his life he is missing and how many people he can lose. It is a comedy movie so we can have fun watching, yet, we can also cry in some sad scenes. This movie makes us think about life, if we are living all the things we want, if we are enjoying the people, as much as we can. With a talented cast and a surprising script, this movie will definitely be successful on Netflix. This is the debut of actor Leandro Hassum on the platform. The movie has already been translated into four languages. With that, I can assure you that you will love the movie, have fun and cry at the same time. I hope Netflix makes other brazilian movies as good as this one."}, {"id": 28, "text": "'A Christmas Carol' meets 'Groundhog Dog'.'Just Another Christmas' doesn't do anything all that unique or overly refreshing, but it does certainly bring heart and humour. Leandro Hassum does a grand job as Jorge, his comedy background shines through. He is very much the star, but Elisa Pinheiro (Laura) is likeable too.I enjoyed seeing the premise unfold. They do it in a positive way, with the pacing pretty spot on. I will say I thought they'd go deeper into it, especially with how they change Jorge - other than just doing, basically, what the aforementioned Charles Dickens novella entails. It does, as is, create some touching moments though.I'd be rating it a notch higher if it had a bit more freshness and took a deeper dive, but there's absolutely no doubt it's a good film. Worth a watch, definitely."}, {"id": 29, "text": "A Brazilian Christmas comedy. It is about a man whose birthday is on the same day of movement and that is why the date is not to his liking, but when he dresses as a saint at the family dinner he suffers an accident having him wake up on the same day without remembering what happened in the year . Quality. Entertaining It can feel repetitive because it is all the same day but it is not like that, situations keep changing. Although it is not an original formula since we saw it on the day of your death or if I don't wake up it works. An adult comedy, although it may feel familiar, it has concepts more for adults than for children. Most organic and situational jokes, other slightly forced moments. Performances okay, nothing outstanding. Good makeup and hairstyles. Some moments of the photography and location badly achieved, but most are good. Talk about the importance of family and spending important dates with them, as well as the love of it and the time they spend. It only has an emotional moment but the film, through the main character, handles the family warmth very well. A good movie for the Christmas season."}, {"id": 30, "text": "Just Another Christmas is a Brazilian Christmas comedy. That premise alone had me intrigued. But it also had me worried. Such a big part of Christmas movies comes from the wintery and snowy environment. To my surprise, constant sunshine and t-shirt weather did very little to make this film feel any less Christmasy.The country of origin and the concept of the film are, without a doubt, the most notable things. Brazil certainly offers a very different environment for a Christmas story. Instead of worrying about being cold, the mass of people doing their Christmas shopping will make it unbearably hot. And there's absolutely no snow to worry about. As someone living in a country where snow is usually a part of the holiday, and something that I always hope for, I was a little worried about how much of the holiday spirit Just Another Christmas could capture. It did, at first, feel a little odd. Doing Christmas shopping in shorts and a t-shirt is such a foreign idea to me that it took a moment to adjust. But, as the film went along, I stopped minding it. As the movie reminds us, the real importance of the holiday is to spend time with those we love, not whether it's snowing or not, or whether we like the holiday.The concept of the story takes us on a journey that follows the same trope as movies like Groundhog Day, or Edge of Tomorrow. Jorge, our main character, is forced to live Christmas day over and over again until he realizes what Christmas is really about. To add another twist to the story, Jorge doesn't just live the same day over and over again. Instead, he forgets the whole year he has just lived, only to come back to his own self during the 25th of December. This change in the formula certainly added it's own flavour and made the concept feel fresh again. Accordingly, a big part of the movie, and the comedy, comes from Jorge trying to fix the mistakes that his other self made during the year. It is a rather entertaining formula that creates some great and funny moments. However, it does start to feel a little old around the middle of the film. It felt like the movie was starting to run out of ideas and the endless Christmas days started to feel quite samey, at least at times.However, at the end of it all, there is a worthwhile finale. It wasn't quite as impactful as I hoped, but it got the job done. As with all Christmas movies, the ending was a reminder of an important lesson. The one chosen for Just Another Christmas was the importance of family and making sure that we spend enough time with them. Perhaps not the most original one, but certainly an important one. And what made this film as enjoyable as it was, was the way we got that lesson at the end. Instead of the usual approach to realization and self-discovery, Just Another Christmas takes a new angle. One that is both entertaining, as well as refreshing. And if it weren't for the overuse of the concept and the somewhat hit and miss humour, this could've easily been even better than it was.Just Another Christmas certainly surprised me in a good way. Brazilian movies as a whole are a practically unknown genre to me, let alone Brazilian Christmas comedies. And against all my expectations, I ended up having a good time. It's as cheesy and predictable as you'd expect, but it's also fresh and unafraid to take a new approach to a genre that can often feel quite repetitive."}, {"id": 31, "text": "Just Another Christmas or Tudo bem no natal que vem, is another movie from Leandro Hassun and Paulo Cursino colaboration. The duo already gave us O Candidato Honesto series and Ate que a sorte nos separe. This Netflix movie is a pearl, not like a regular X-mas tale, but a brazilian X-Mas reality. No snow, Hot, really hot and the Rio's already legendary traffic jam with all the folks asking for cash or selling fruits or food for living. The film grabbed this reality, where Xmas has no snow and we shop in shorts on a 40C temperature outside while Xmas songs are playing everywhere. The idea for the movie is simply great, if you're a little hasty on your conclusions, you might see the plot as a groundhog day but as the film goes you see the issue is a little deeper and Jorge has amnesia from the other 364 days of the year. We forget those who are important for us, and by miracle we just remember them on xmas day, where all will be forgotten and the family will gather together to a meal and open gifts. Jorge shows to all of us that a busy life make us forget the important things in life... Family . You will laugh, you might cry on a movie that at the beginning seems like just another Christmas movie"}], "reviews_amount": 32}