{"name": "A California Christmas", "titleId": "tt13055780", "reviews": [{"id": 0, "text": "The real Manny is the star of the movie... he needs his own spinoff."}, {"id": 1, "text": "This was a believable film with some nice moments and good acting from the leads. It definitely isn't a Christmas film though."}, {"id": 2, "text": "Lebanon sensation with at 1 and top global too. very fun. Much to see more, as well both mannys!!"}, {"id": 3, "text": "Both actors played remarkably well with good connections, chemistry couple. Hope, inspiring, with a strong, courageous independent women who deals with loss but in a certain way try to calm herself and puts her effort for a joyful journey along with mother. The actors were amazing despite they are real couple in life. They were astonishing beautiful and lovely, sincere people.. Really good movie with a bit of Christmas but great romantic along with humour, adventure movie.Surely recommend"}, {"id": 4, "text": "Is number one here in sweden on netflix and such nice warm film like the weather also, has warmed up our cold Christmas! very nice and fun. american 'cow farms' different then europe"}, {"id": 5, "text": "The first 1/3 of this movie is terrible so be forewarned. If you can stick it out however, it gets much much better. It may not top any lists but it has heart in the second half. Not much Christmas though"}, {"id": 6, "text": "If one is looking for originality or strong holiday themes, look elsewhere. I tuned in because I like Josh Swickard. To his credit, he has admitted that the script was written by his wife/co-star in a couple of weeks. And, was filmed on her family's property during General Hospital's Covid-hiatus. With that caveat, I think that California Christmas is very watchable. It does not suffer the stiff blandness of a Hallmark movie. Josh, David del Rio and Ali Ashfar provided a good amount of comic relief. Lauren Swickard successfully threaded the fine line of being a fiercely independent woman who can ask for help when she needs it, as well as acknowledge appreciation for help she might not have initially wanted. Amanda Detmer also rose above what could have been considered an overly sentimental character."}, {"id": 7, "text": "This was a sweet unassuming movie that had a decent story, solid acting (the two leads are married in real life). In spite of some corny antics by the supporting cast I found it to be better than the critics have said. Some people complain that it isn't a Christmas movie but I don't agree. Check it out."}, {"id": 8, "text": "Gave a try to this after viewing at the top of netflix most watched in my country and even US for all week and it was better than thought. No to lots of Christmas but fun movie... great people. The little girl very cute. But moms to be to young, not realistic to have so old children. birth at 10-12 age? lol"}, {"id": 9, "text": "After the bad reviews, I watched this gr8 movie, very sample with nice story, a gr8 massage under Christmas vibes, and the most important is the chemistry between the actors, big like &lt;3"}, {"id": 10, "text": "The movie isn't perfect, but it's still fun to watch. It's a pretty standard story of a guy going into something for one reason and coming out IN LOVE...but it works. There's definitely a lot of holes and jumping around, but again, typical for this type of movie, so it works. Plus, the Swickard's might just be the two most beautiful people on the planet, so that helps I'm sure too. I recommend to all the wonderful couples out there this Christmas!"}, {"id": 11, "text": "Typicall Christmas movie but they haver some magical chemistry."}, {"id": 12, "text": "Going to be honest I don't like watching rom coms at all but the production here was awful and had a lot of awkward angles and transitions. The movie was predictable, would rate a 5/10 for effort tho."}, {"id": 13, "text": "They literally hung one string of lights up and called this a Christmas movie. That being said it was alright. The gratuitous shirtlessness was appreciated."}, {"id": 14, "text": "A classic cheesy romantic movie turned to be actually good. California Christmas is a heartwarming movie with a lighthearted plot. The lead actors (married in real life) did their job perfectly and they sure have an amazing on screen chemistry. Whole Christmas vibe keeps you delighted all the way through. Anyhow, it sure is a predictable one but is definitely enjoyable in it's own way."}, {"id": 15, "text": "If the acting skills were as good as their cuteness, this would be Oscar performances!! This will not bring you in a christmas mood, but it is very pleasant."}, {"id": 16, "text": "Kind of a Christams movie....More of a romantic drama with the typical predictable twist. Great acting. Enjoyed it. Make more please. Those with bad reviews, I would say... you would enjoy more movies keeping an open mind and not having any preformed ideas of what a movies should be before you watch it. This movie should be considered a good one based on the performances of the actors and not the film content. I get so tired of big names with terrible performances being headliners in crap movies. This was a great movie and us underrated."}, {"id": 17, "text": "A horrible movie that has nothing to do with Christmas except for a brief scene with a Christmas tree. A boring, predictable movie with foul language &amp; sexual situations. Not family entertainment."}, {"id": 18, "text": "I sat down with the family to watch a Christmas movie and what I got was a lemon. I guess netflix will put anything on their service now. I have seen better hallmark movies with better acting and storylines. This movie felt cheap, unoriginal, and lacked creativity. I would avoid any movie from these filmmakers going forward.And it wasn't even really a Christmas movie!"}, {"id": 19, "text": "Good movie to watch alone or with a significant other. Too much long kissing and certain scenes should have been cut sooner if it was intended as a family movie. Not the family Christmas movie I had expected. In fact almost no Christmas at all."}, {"id": 20, "text": "I wasn't expecting much from this title, but it was surprisingly good! Nice story, great characters, cute couple. I must say, though, that I was hoping to see more at the end... I wish I could see more of the happy ending... cause it had so much potencial, so that part was a bit frustrating. Anyway, I do recommend it! It is the kind of movie that reminds us that the best in life is yet to come..."}, {"id": 21, "text": "This movie was absolutely terrible. There were so many cliche tropes. The acting was awful. There was no natural flow of events. Truly terrible. The title is also very misleading. It seems like the title only serves to bait people into watching."}, {"id": 22, "text": "Make film Numbers 2!!! Cried like a baby. The story is perfect and this will make me invest in the vinery business."}, {"id": 23, "text": "Of the trailers and promos it looks like a hallmark movie. bland and predictable storyline. The actors do a phenomenal job however. Mostly all unknown but guaranteed these guys are gonna hit it big after."}, {"id": 24, "text": "I had insomnia early this morning and saw this in the brand new release que on netflix, and I thought it would put me right to sleep so I started watching. But I stayed up watching the whole thing and it's a really cute holiday/family film! Def worth checking out"}, {"id": 25, "text": "I didn't knew about this film until on its release date and I would just say that it was good and if you're a fan of rom-com you can add this to your list. Although there are a few flaws, like how everything suddenly just works out at the end. And also as its name suggests that it's a Christmas film, well it's not, there are no elements of Christmas until end. Overall, it's a good one-time watchable film."}, {"id": 26, "text": "A great film to watch with family. It has the look/feel of a Hallmark or Lifetime film but it's significantly better than typical LT/HM movies and I would know, I love that stuff. The leads had great chemistry, and several of the supporting actors were pretty good as well. Well written, clever, some great California scenery. If you are looking for a movie with Santa and elves keep looking - it's not that kind of film - but this is a fun touching film the whole family can enjoy"}, {"id": 27, "text": "I really enjoyed this movie. It really reminded me of a romance novel - and as a lover of romance novels I mean that as a high compliment. (I also enjoyed it as a small farmer. It came the closest of all the farm-based romance flicks to actually representing the reality of farm life and it's challenges and didn't denigrate farm life as something to laugh at. It wasn't perfect, but it came as close as I've seen on screen.)The chemistry between the leads was powerful, yet subtle. It wasn't insta-love or sheer lust. They learned to respect and care for each other. Definitely quite enjoyable!"}, {"id": 28, "text": "Great movie. Good acting. Sweet storyline . 2 great actors ."}, {"id": 29, "text": "Firstly I want to say that I found the idea to be pretty sensible and smart. We have the high-roller handsome protagonist meet the cute farm girl and they meet under less than ideal circumstances and like chickens cooped up in a hen all day we get a few eggs , some break here and there but what we are left with are edible and grow up to be other nice chickens. This was very nice. I particularly loved what she did with the lil' sister and the mother, it was kind and pulled at my heartstrings. I also loved the arc-over of both characters, I would of manipulated the discourse on a few occasions just a bit differently but overall I would highly recommend this for a really cool fun feel-good time story. Everyone involved should be very proud of themselves. Fine fine job! Pretty cool write!"}, {"id": 30, "text": "Netflix produced this, and like any Hallmark  type film, it's fun and predictable. But better acted than most. Just a fun little chick flick to enjoy during the holidays."}, {"id": 31, "text": "Predictable, boring and nothing like 'Christmas'. Umm, lets just say that its a film that you wouldn't wanna remember after watching it."}, {"id": 32, "text": "Without doubt, the greatest, most amazing, love filled, warmest Christmas Film of all time. If you imagine hot milk, it's warmer. Sweeter than Honey, and just as sticky."}, {"id": 33, "text": "So we are trapped in a spiral of these rom-com Christmas movies. Pretty much all the same, pretty people over come non existent problems to live happy ever after. We seem to spend most of our time not watching to movie , but trying to figure out the locations . Don't think we were paying attention , but at some point we started really enjoying this one . Yes both leads are incredibly good looking , and some how, even the acting improves during show ..but bottom line , out of ALL OF THESE we've watched this year, CALIFORNIA CHRISTMAS was one on better ones The characters are interesting, the story line is somewhat believable, there's even some natural chemistry between the two leads . Guess that's a good thing when i realized they're married in real life. but all in all.. fun movie , with amazingly naturally good look people , beautiful scenery, and the side cast was very entertaining..think most will be very pleasantly surprised. Look forward to viewing more collaborations between this husband and wife"}, {"id": 34, "text": "Glad found this movie. I like all the actors. Everyone played their own role nicely"}, {"id": 35, "text": "This film was absolutely beautiful. Moving, fantastic storyline, superb acting and reminds us of wha is really important again. Music, camera work, everything was just stunning. Natural, lovely cast. Renews your faith in humanity."}, {"id": 36, "text": "I loved this movie! It is a love story between an ailing mother and her two daughters as well as love story between the two main characters. I enjoyed the entire cast, the story Made me laugh and cry, and had a very poignant ending. It is innocent and has a clear message about how we live life, the choices we make and how love wins in the end. I don't want to give anything away, but if you like being entertained, don't mind laughing and crying, just watch for yourself...it is shot beautifully and was a lovely evening event!"}, {"id": 37, "text": "If you are in the mood for a christmas movie? Don't watch this one. It has got nothing to do with it. Besides that, it wasn't even a great feelgood movie. I didn't finish it."}, {"id": 38, "text": "This film is set in the run up to Christmas but don't expect a massively Christmassy film. Bit predictable in parts but overall a nice feel-good film"}, {"id": 39, "text": "Take it for what it is... don't overly criticise! Merry Christmas!!"}, {"id": 40, "text": "I saw the title of the movie and was like Oh interesting, somebody is celebrating their first Christmas in California, I started to watch the movie, and the movie seem more country, and romance themed over Christmas. It was easy for me to assume what happened and was a bit underwhelming in my opinion. If the movie was titled differently I would of never watched it however it did have a nice story to it and a dreamy place with some decent parts, If you're into romance you'll likely enjoy this movie"}, {"id": 41, "text": "I know everybody who watch this movie can easily predict what will happen next and next and next. But it is our human weakness to desire the two good looking people falling in love with each other, have some conflict, reconcile back bla bla bla. Enjoy the movie, dont think too much. Save it for Tenet."}, {"id": 42, "text": "After seeing this at number 1 on netflix for a couple of days I broke down and watched it with the fam. Glad I did, it's a fun tv movie my family and I enjoyed."}, {"id": 43, "text": "Had to watch and find out what all the hype was. So glad I did. What a lighthearted movie in the midst of this miserable pandemic. We loved it. Lauren and Josh Swickard are a delight to watch. Their scenes together pull you in to the story. Great chemistry. Reminds me of a young Goldie Hawn and Kurt Russell together. These two are gold. We want a sequel. Bravo to Lauren, the writer! The only downside, not very Christmasy. But loved it."}, {"id": 44, "text": "Very, very enjoyable Christmas romance. Great characters, really nice people, a good old fashioned storyline - set in lovely California. Lovely leads. How could you not like it?"}, {"id": 45, "text": "It's a basic script, however the actors had good chemistry and made the movie one of the better romantic Christmas films. Yes, it could've been a little more Christmassy but the film was short and delivered when it got to the 40 min mark. Predictable ending as with most Romance movies. it has some good comedic relief as well."}, {"id": 46, "text": "Just finishing watching this film and wishing that I hadn't started it. I'll never get that time back now! The film just didn't flow. It had no real end or start moments. The scenes merged into each other and we, the viewer, were expected to catch up on what was going on at every turn. Maybe that was my interpretation, but I was confused and bored!The two lead characters (obviously very much in love in real life) had good chemistry on screen and I did like the mother/daughter bond, but other than that - not quite sure what this film was - Christmas in the title!? Where does that fit in?Too many obvious and yawn out loud moments. Give it a break if you like great romantic comedies. But if you don't mind zoning out for a while and not caring about the characters or what is happening, this is your film."}, {"id": 47, "text": "Nobody likes to be lied to. Just like the main character in the movie, a farm girl deeply connects to the ranch she was brought up at. Big real estate developer is trying to purchase the ranch property. The prodigy son of the real estate developer pretends to be a ranch hand, living and falling for the farm girl. At the end of the day, wine made from grapes from the ranch saves it from getting sold to developer. Ultimately, the heir helps farm girl distribute the wine and save the ranch property."}, {"id": 48, "text": "Great movie. The two leads were awesome and I bet they enjoyed playing in this movie together since they are married."}, {"id": 49, "text": "Nice movie. Good actors. But not a Christmas Movie. It has almost none christmas scenes."}, {"id": 50, "text": "I loved this film! It was such a lovely romantic movie and I didn't realise the couple are together in real life, they had amazing chemistry so I wasn't surprised that they are together. Both gorgeous, and talented i don't understand why there are negative reviews? Sure it's not a cheesy Christmas movie as people mention, it's a romantic film and Christmas is included in the movie it's just not all revolved around it. I recommend it as the scenery is beautiful in California, all actors are cast perfectly and if you want to watch a nice film without violence watch this."}, {"id": 51, "text": "Not a fan of Christmas movies (don't judge) but this isn't a Christmas movie despite the title. Typical boy lies then falls in love and has to own up and make it all right. It was cute with out me wanting to fast forward too often."}, {"id": 52, "text": "No canadian accents here. Destitute family too dumb to realize they're on a wine gold mine. No snowmen, no Santas, no Christmas tree farms, if this is what Christmas in california is like, we're never going. Acting was decent for the genre. Nice montage."}, {"id": 53, "text": "Well... To be fair I went into this movie fully expecting it to be a half star affair, but wow this was actually cute. Literally none of the main characters in this movie are unbearable which is unheard of in this genre."}, {"id": 54, "text": "It is boring. The acting is so bad that it is so easy to disconnect from the movie. Terribly written, directed, and produced."}, {"id": 55, "text": "Nice to watch a feel good movie. I guess not all the writers are non thinkers and like to rehash old story lines. Very refreshing!"}, {"id": 56, "text": "After a nod from Ryan Seacrest and seeing this at #1 for three days on netflix, I decided to check this out. Glad I did, Ryan is right. Fun feel-good movie."}, {"id": 57, "text": "I thought it would be more of a Christmas type movie. Found it boring."}, {"id": 58, "text": "Wasn't expecting much when I saw this on Netflix, what I got was a lovely Christmas movie. Yes it's predictable but still well worth a watch. The two leads have amazing chemistry which was explained when I found out they're married in real life, Lauren swickard also wrote the film."}, {"id": 59, "text": "Really fun film, a little slow at first but picks up. great characters and chemistry. very feel good. But it's not really a Christmas movie - it takes place at Christmas time. Other than that it's fun and lighthearted - a nice break from all the stuff going on in the world"}, {"id": 60, "text": "Wow! Josh and Lauren are incredible together. They could not be more likable and that makes this movie a success. A sequel please."}, {"id": 61, "text": "A generic Christmas rom-com. It is about a man who is sent to evict some people from a farm and pretends to be a laborer and stays to work so he can subtly convince them to sell but falls in love. Quality. It is not something that has not been seen before. Loaded with situations and situations which makes it long and exasperating at times. Predictable situation and end like all of the genre. And the exact same romantic comedy scheme happens. Normal performances, nothing outstanding. A movie to spend the afternoon."}, {"id": 62, "text": "Normally for Netflix movie I do have a bottom expectations. even for this movie the plots already sounds really cliche and cringe, I still expected a bit of funny/warm and maybe just an average holiday movie for the Christmas Eve. But NOOOO, this is literally the WORST Netflix movie I have ever seen and probably the worst movie I have seen for the whole 2020 year. Great way to kill sometime and regret ever watching it. Basically just some good looking actor with horrible acting skills plus even worse plot. Final word, plz don't watch it unless u have nothing else to watch."}, {"id": 63, "text": "I believe the title is very misleading, apart from the deadline they have on Christmas and hanging of some lights this isn't a Christmas movie. It is just another normal movie. It was a pleasant movie, the plot was quite funny and interesting to see the main guy trying to figure out how to do anything on a farm. But, don't watch this during Christmas"}, {"id": 64, "text": "Netflix movies can be bad and there Christmas movies can be too. It's better then the hallmark quality but that's it. First off it's not really a Christmas movie. The plot is ok and the chemistry is great that's because the actors are married in real life. The plot is just boring it could of been better."}, {"id": 65, "text": "Couldn't get past the first 10 minutes. Might have helped if the makers had asked for an advisor with a cursory knowledge of dairy farming"}, {"id": 66, "text": "This was a great way to spend a couple of hours. Sweet movie. There are so many movies that rate higher that are dogs. To those people that say this wasn't a Christmas movie...uh, it's California, we don't have snow but we do have Christmas. The leads were gorgeous. The sidekicks were funny. Watch it, it's worth it."}, {"id": 67, "text": "Kept seeing this cheap little movie at the number one spot on netflix and figured since it's outdoing some serious content on that service I should finally break down and watch it, even though it didn't look like my kind of movie. It was good, very entertaining and a nice escape."}, {"id": 68, "text": "I don't typically go to cheesy Christmas movies for the quality of their acting, the script, or for them to have much of a plot other than everyone ends up happy at the end, but Jesus, this film was boring, but also, like, pick a lane. Mom dying of cancer, dad and fiance dead from a car accident, the farm is in foreclosure, they're selling baked goods to pay the bills, the main female character is psychotic (guns, unnecessary/explosive hostility). This movie was somehow both waaaaaaay too much and still boring.Do not recommend."}, {"id": 69, "text": "Watched with my spouse. There were several moments during this film where we were both speechless because of how stunningly awful the screenwriting and acting were. It is genuinely one of the worst films I have ever seen. Hands down in the bottom 10. And the director... he's clearly never actually been on a farm for more than 10 minutes, so the film is filled with bizarre nonsense like scenes with country folk having breakfast with shotguns on their laps, and the bizarre suggestion (a weird one, since the director is from Northern CA) that people from Sonoma are country bumpkins, which is clearly nonsense (unless country bumpkins are people who live in $10 million houses and vacation in Tahoe--they don't). The director's attempts to show his country creds were like getting lobotomized over and over again, and he needs to never, ever make a film set in the countryside ever again. The whole thing was just a total catastrophic mess. But, we laughed tons at how startlingly bad it was, so you should watch for that."}, {"id": 70, "text": "Netflix trending #1? This was a sad attempt of a holiday movie - bad screen shots, horrible songs/score, and the crappy text/font should tell you to walk away at the intro. But at 15 mins in watching a calf being born the wrong way only to have it magically flip and lay on the guys arm, clean and lively was all too much. And then to read the lead LD are married in real life! Guess they saved the romance and acting for off screen. Click away!"}, {"id": 71, "text": "I guess netflix just doesnt care anymore, this movie is terrible, worst movie I've ever seen on netflix."}, {"id": 72, "text": "With netflix putting out a ton of christmas movies, I have watched many of these and have stayed away from the rest because they looked too boring/unoriginal. I thought the acting in this movie was pretty good for a random christmas movie and I knew I picked up on some real life romantic vibes (the actors are married in real life) and it made it that much more enjoyable. I may have been a bit biased in that I am from california so could relate a bit to the character but truly an enjoyable watch!"}, {"id": 73, "text": "Possibly one of the worst films I've ever watched. If I could give a 0/10 rating, I would."}, {"id": 74, "text": "I despise the fact that Hollywood continues to make movies that they clearly know nothing about.Ranching/dairy farms/how people dress when they're in said places. You don't pull a calf with your bare hands and wash it off with water. That's what their mom does.Get it right. Stop with the cliches."}, {"id": 75, "text": "They're a couple in real life so it's a little awkward and cringe to watch. The lead actress although adorable her face never matches the mood of the scene it's very odd and makes you not get into the movie. I have tried to finish it 3 times and I keep turning it off. I really wanted to like it but it was really bad acting. The only shout out I have is for the real Manny, he was good and the lead actor in a different role, working with a different actress and script, maybe."}, {"id": 76, "text": "So funny a movie like this is number one on netflix all week but then I saw it, such a cute movie definitely want to see more like this. The little girl is so adorable"}, {"id": 77, "text": "What a way to end 2020 on a fabulous Christmas movie. I truly enjoyed watching the movie, thanks to Lauren and Josh swickard. They immediately bring the chemistry onscreen. The story is beautifully well written and directed. I highly recommend to binge watch the movie sometimes."}, {"id": 78, "text": "I don't why it's been rated so bad so to compensate for it, I've given it a 10. It's a wonderful love story albeit cliché it managed to bring freshness into the overused plot line. And the leads had a great chemistry.I recommend this movie for sure. :)"}, {"id": 79, "text": "I barely could watch it until the end, it consists only out of cliches, if it weren't so bad, it could be admired for putting every romcom Christmas cliche that ever existed together and made it a film. Seriously, this is bad."}, {"id": 80, "text": "You know how movie critics are all about the character development, and we normal people are all meh?Yeah. This movie literally compresses all of its character development into a single montage. It's incredible to see. I understand movies far more effectively now than I did before watching this.But...still. It's transparently awful. I wanted to like it in the way we like Hallmark cheesy romances. But...."}, {"id": 81, "text": "This was not a Christmas movie. I was expecting heart warming Christmas magic. There was nothing Christmas about it. And nothing good aside from the real Manny character."}, {"id": 82, "text": "The green screens in this movie are actually the worst. the cow birth scene? are they serious? and the male lead turned from snobbish misogynist to loving farm boy? no thanks!"}, {"id": 83, "text": "Okay, the acting was pretty bad. It felt very flat and obvious that they are just reading from a script. Especially the main girl, she is so monotone and has no emotions! I couldn't stand how stale she was. And where is the Christmas spirit? The only Christmas-y thing is that it's a several days before Christmas.But other than that, I wasn't expecting much from this except a simple cheesy movie to turn off my brain for a bit and enjoy. It isn't great, but definitely interesting enough to finish."}, {"id": 84, "text": "The title of this movie sounded good, but that's the only good thing about it. I thought I was going to be watching a movie about Christmas in California. Nope! This was a movie about a guy pretending to be a farmhand to try to buy a girl's farm. Of course he falls in love and finds a way to save the farm in the end. The movie was boring. The acting was ok. The girl has been in Lifetime movies and this movie was not as good as Lifetime movies. Some funny parts, but I'm glad I had other things to do in the background because I definitely would have fallen asleep during this snoozer."}, {"id": 85, "text": "Its nothing new under the sun, a pretty girl suffering great loss sitting on a pot gold, guy turns up, sweeps her off her feet but lies. The story and characters are so 2 dimensional thats its actually saves the movie. No need for questions digging or meaning. its a stereotypical out of the manual movie cliche, worth a watch if you want to rest your brain cells."}, {"id": 86, "text": "So, 20 mins in, the gorgeous lead male (the writer's husband) has been shirtless twice, covered in cow placenta, threatened with a gun...and I am actually unsure who get's the girl to provide the happy ending, the lead or the also quite handsome now platonic friend. I've endured a few Christmas romance films that provide none of these things. And who keeps the land? In its class, you could do worse."}, {"id": 87, "text": "So, she throws flour to her mother that she needs oxygen to breathe? Right 👍"}, {"id": 88, "text": "Ok...not sure where to start since this is beyond awful but the main message I want to leave you with: Imagine if the lead actors were ugly, then there would be literally nothing left in this movie."}, {"id": 89, "text": "THIS MOVIE WAS THE WORST MOVIE I HAVE SEEN IN A VERY LONG TIME!!!!!Number 1: The main girl character is extremely violent. All she wants to do is shoot the guy that is trying to buy her farm with a gun. LIKE WHAT!!!Number 2: I'm very confused with the storyline. Like there are so many sub plots, that you could make 5 movies out of this one movie. They never explain anything. I thought it would all tie together in the end, but it seems that I was wrong.Number 3: OMG THE ACTING HORRIBLE!!!! The best actor in the movie is the cow.🤦‍♀️Overall: DO NOT WASTE TWO HOURS OF YOUR DAY ON THIS MOVIE!!!!!"}, {"id": 90, "text": "Super cringey and had pretty much NOTHING to do with Christmas...?! Except for a clip of them putting up Christmas lights. Super boring too"}, {"id": 91, "text": "Not a trace of Christmas in this movie until the final scene."}, {"id": 92, "text": "Horrible female lead. She has a resting B face and I cannot stand watching her. Her character doesn't make sense and the actress is so bad at acting. The only good part of the movie is the handsome lead actor and the good cinematography."}, {"id": 93, "text": "Hang a couple of lights up and call it a Christmas movie."}, {"id": 94, "text": "California Christmas is a Netflix flick about a ranch is Napa that has been struggling to survive. The storyline was boring and very predictable about a wealthy conglomerate that wants to own the ranch during the week of Christmas. The rich guy ends up falling in love with the owner's daughter and as you can predict, they might end up happily ever after. This romantic comedy has no own actors it is just a B rated movie that it isn't worth your time. Skip this one."}, {"id": 95, "text": "An OK Christmas story, attractive cast, nice scenery. Acting, story, script and editing below average, too many plot holes and side stories that amount to nothing and just feel like time fillers.I couldn't really understand why the company wanted their land so much for a warehouse, no one explained it, it is in the middle of nowhere and didn't seem like a very accessible or centric area, I would think that land in wine country would be a bit expensive for a warehouse.I understand that the grapes are supposed to be important but they seem super neglected so I can't imagine how they made any wine out of them.Also, they had a picture of Manny, but for some reason they didn't realize that Joseph is not him although they look nothing alike, and even when the girl looked at the photo and realized Joseph is not Manny she didn't say anything and nothing happened, so you have a stranger in your house and you tell no one? didn't understand what was the point of that story line.Same for the Colin story line, is he her friend? he ex's friend? he likes her? one dimensional character that provides no added value to the story."}, {"id": 96, "text": "Hot trash, I cringed at every line. Netflix is becoming worse than Hallmark. When I sit down to watch a Netflix Christmas movie I'm expecting nothing spectacular, just an average, watchable film. On the other hand when I sit down to watch a Hallmark movie I know I will be getting an extremely cookie cutter movie where a white business person returns to their hometown and falls in love and then stays forever. THIS MOVIE IS WORSE THAN THAT. Please delete all evidence of this movie. (I made it halfway through the movie thanks to the only decent character, Manny, oh and Leo)"}, {"id": 97, "text": "This might be the worst movie I've watched. Really not a fan."}, {"id": 98, "text": "And not that compelling a romance either. A shame, Christmas might have saved it."}, {"id": 99, "text": "Ugh, awful script, awful acting, and clearly these people have never been to anything close to a working farm. The lack of effort from the writer and director is disappointing. Find something better to watch."}, {"id": 100, "text": "Callie and Joseph, the reel life lovers in A California Christmas are played by real life lovers, the married couple, Lorynn Swickard and Josh Swickard. The first we see of Josh Swickard are his rather skeletal toes, before we are introduced to the casanova caricature in one fell swoop, with legacy money running through his veins, and his vanity.READ THE FULL ARTICLE ON FILM COMPANION"}, {"id": 101, "text": "Next time make a movie which doesn't make people puke ? Plot = silly secret + weirdly optimistic ppl =&gt; secret revealed =&gt; ppl surprised =&gt; everything goes jolly!I mean really? come one at least try to do something ?"}, {"id": 102, "text": "No prominent actor, not funny and no interesting story Just a waste of time"}, {"id": 103, "text": "Corny acting. Unrealistic situations. Spoiled rich kid suddenly knows how to fix &amp; start a generator? Probably had never seen one before in his life. Doing farm chores? Not likely. I got to 50 minutes in, couldn't take any more. I like a good romantic flick, a romantic comedy, yeah, but this one is too corny to take."}, {"id": 104, "text": "I thought this was a decent movie. Like most films in this genre, the story draws on several clichés to move the narrative forward. The writer also draws on a very popular plot device, which is the use of deception and mistaken identity. This year alone, we have seen make-believe relationships (in Holidate, Midnight at the Magnolia, and Happiest Season), princess switches (in The Princess Switch: Switched Again), and fake bed and breakfast staff (in Five Star Christmas). In this film, we have a wealthy Casanova posing as a ranch hand (played by Josh Swickard) to get a financially struggling farmer to sell her family's land before Christmas (played by Lauren Swickard). The storyline is predictable, of course, as is much of this genre of film (i.e., the romance Christmas movie). Yet, I found myself pulled in by it. The story has a comforting familiarity (again, why particular plot devices are repeatedly used in this genre), some scenic Californian landscape, a struggling family farm, and the appeal of watching the chemistry develop (between the two attractive leads) on screen. I admit it worked on me. I found the movie engaging; I did not, e.g., grab for my iPad during the film (which often happens while watching romance Christmas movies). What makes this work on screen, of course, is the acting. The acting overall was great. What stood out for me was the performance of Lauren Swickard (playing Callie). She had a strong, yet tender, vibe to her performance, which worked well, I felt. Josh Swickard also had a strong performance. The strength of this film was their chemistry (which makes sense, given they are married in real life). We could see this develop and grow on screen as the story/movie progressed, which was, again, one of the appealing aspects of the movie, I thought. The supporting cast had a good performance. David Del Rio (playing Manny) and Ali Afshar's (playing Leo) performances made me laugh a little, and Amanda Detmer had a convincing performance as a terminally ill mother. Finally, I thought the music and music editing was good. A couple good songs in this one. There was one element that was a bit lacking: the Christmas in A California Christmas. This is not a very Christmassy movie, I am afraid."}, {"id": 105, "text": "If you by some miracle have binge-watched every TV Christmas movie made for the year 2020, you will undoubtedly stumble upon A California Christmas.While the cheesy title and cover-art suggest that it shouldn't be anything more than your typical Hallmark / Lifetime affair, this movie nevertheless managed to hold my attention throughout it's entire 2-hour run.The story itself is nothing new (rich bad boy falls in love with farm girl etc.), but there is a substantial budget thrown into the production of this movie, so it is very visually pleasing. It is a little too long for my taste, and there were a few cringe-worthy montages to remind us that this movie may have been targeted for a much younger audience.The best part of the movie is without a doubt the story between the mother and the daughters, but the movie took too long to get there. Netflix obviously tried to bank on the natural good looks of the two leads (there are plenty of suggestive, drawn out scenes in the beginning of the movie to convince the audience just how attractive the actors are), but I personally don't find either of them particularly memorable.As a warning to parents hoping to add this movie to their viewing list this coming Christmas: this movie is not intended for children. On top of the suggestive scenes already mentioned above, there are also a handful of love scenes with one in particular that are best saved for after the children have gone to bed."}, {"id": 106, "text": "Joseph needs to convince the owner of this ranch to sell the property so that his company can develop a distribution center. Callie, the owner, doesn't want anything to do with that. So, in order to get close to her and convince her, Joseph poses a ranch boy (I think).We all know how this is gonna to turn out since reading the premise. It's predictable. But it was a sweet movie. Reading the title you expect it to be all happy, Chrismassy, and joyful movie. It wasn't anything like that. Christmas isn't a big part of it, this could have happened in any time of they year and it's actually not relevant when it takes place. There are sad moments that are part of Callie's history, maybe unnecesary but still adds to the plot. My only major complaint, probably, is that we needed a few more laughs.I like when actors are involved in the production so kudos to Lauren (and Josh) for writing, producing and acting in this. If you are fan of romance/chick-flick movies, you'll probably like it."}, {"id": 107, "text": "Predictable and has the usual festive cheese, but it actually works well by the end.I wasn't convinced by the opening chunk of 'A California Christmas', with the obvious plot set-up and iffy cast performances. However, from about the midway point, the film gradually gets better. The onscreen talent slowly grow into their roles. That's no doubt helped by the barrage of heart it attempts, most of which comes off.Lauren Swickard, who also wrote this, is good in the role of Callie. She stars alongside husband Josh Swickard. Given they are together in real life, it is little surprise they have nice chemistry. Ali Afshar, David Del Rio and Amanda Detmer support adequately.It's sweet enough, all in all. It keeps to the right side of the line between enjoyment and boredom, at least in my opinion. Could've done with more Christmas vibes though, given the title and all that..."}, {"id": 108, "text": "Here is the same old cheesy romance drama, where one person pretends to be someone else to gain the confidence of the other (exactly opposite and douchy thing to do when you want to earn the confidence don't you think?) Duh, you don't earn confidence by lying about who you are in the first place (Big eye roll).Both the actors can't act. They don't even have appropriate expressions on their faces (I know they both are pretty but I need some emotions) The dialogues are stupid, the supportive cast was not smart apart from maybe the mother of the actress.Anyways so frankly, I feel I wasted my time even watching the movie coz they had covered everything in the trailer itself. And the story is so cliched and repeated so many times that I want to say , bring something original please. This cassette has been played so many times and is so old age that it was predictable beyond imagination.P.s. the actress is the screenwriter. Can't believe when you are not good at one thing, you are allowed to do two things at a time? No words."}], "reviews_amount": 109}