{"name": "Operation Christmas Drop", "titleId": "tt13236566", "reviews": [{"id": 0, "text": "As a romantic comedy, this movie is middling... but as a story of members of the Armed Forces finding ways to help others when they themselves are far from home on the holidays - a story that happens to be true - this story is hard to beat."}, {"id": 1, "text": "I really dug this movie for a myriad of reasons. The leads had great chemistry with each, the scenery of Guam was beyond gorgeous and it was something genuinely pleasant to watch. 2020 been stressful enough and sometimes you just want to enjoy a movie that doesn't require you to be invested. Hopefully, this draws more attention to the beautiful territory of Guam and it's people."}, {"id": 2, "text": "This is my first Christmas movie of the 2020 holiday season and what a great way to kick the festivities off.It wasn't as corny/sappy as the usual Hallmark/Lifetime Christmas movies tend to be (which I love) but instead had a slightly more realistic feel to it. I didn't feel amazing heat between Eri and Klaws and I believe that was intentional because the primary focus was the Christmas drop. I could have used a little more spice between them but overall the movie was solid and predictable.I am giving it a 6.5 on my Lifetime/Hallmark/Holiday movie scale."}, {"id": 3, "text": "A run of the mill Romantic comedy that isn't original, but ticks most of the boxes, the acting was okay but the scenery was amazing. It is a Christmas movie, so you don't need to be Einstein to figure out the ending, but it gives you that warm glow you need. Nice movie to pass the time."}, {"id": 4, "text": "Not sure why this received low review ratings from people. It was a cute christmas movie which was enjoyable to watch. Its nice to see a different style of Christmas movie and also shows what happens in the real world. Kat and Alexanders chemistry was nice to see and id love them to make a second movie."}, {"id": 5, "text": "I loved this movie. It's such a heartwarming and touching message based on the real Christmas Drop done by the US Department of Defense. It's a unique story and a reminder of the kindness we need more of in the world. Well done Netflix!"}, {"id": 6, "text": "This movie wants to come off as a Christmas Romance movie, but it never really gives time to develop the two main characters relationship, until the very end with a stereotypical kiss ending which feels weird because to the audience the two main characters just feel like new friends instead of love interests. It seems to develop a good friendship between an Air Force Captain and a Congress Aid/Assistant. Together they spread the Christmas spirit and generosity with the help of the service men and woman of the American Air Force. The movie is slow and predictable and feels like it wants to be a lifetime movie or a Christian movie. The lovers plot is uninteresting."}, {"id": 7, "text": "It was good enough that I watched it all the way through. Cute moments between characters. Good background that the movie was based on. I just wish it spent more time on the people they were helping and less on the 2 main characters side story."}, {"id": 8, "text": "I kept thinking something wasn't quite coming through with the legitimate sentimental feelings of Christmas. It might be mis-casting with actors that don't have chemistry (I kept thinking what if Kurt Russel and Goldie Hawn were in the roles, how much more humble and regular their love struggle could be, more real). These two aren't bad, though, so it might have been a combination of lax directing style and a script that needed punching up. Too much seem like actors are struggling to be in a good mood, to be kind, to be real. Instead it too often feels preachy because the actors fail to relate the realness of their characters and their backgrounds. It could have worked. I'd like more like it, but done better, less fake sentiment and more real legit love in the lines."}, {"id": 9, "text": "Did anyone else notice Kat Graham's gait instability? I swear she was walking funny the whole movie. My roommate and I just need to know we weren't the only ones that noticed. Great shine on Guam though! Shoutout to the CGI gecko !!"}, {"id": 10, "text": "I was impressed with the actual filming on Guam, the allowed use of base property, DOD personnel, and aircraft (Navy and Air Force)- that lent, to me, an extra level of realism/belief in the message of this movie. Yes, a standard Christmas feel good message with cheesy romance thrown in. But,.... I saw in the movie the message that all military feel when stationed abroad and away from their homes and family---- camaraderie and coming together in support and help of each other and their local community. I appreciate the movie for its message of the true story of assistance provided by USAF in the actual Operation Christmas Drop."}, {"id": 11, "text": "It's a bit early for Christmas movie with this coming out at the beginning of November. This one really missed the mark for me, I already had no real expectations going in, but this movie was over the top cheesy and predictable, not in a good way. From the worst CGI gecko I've ever seen to the random cringey Christmas carols uncomfortably sung by the actors to the overly happy locals and base people, this movie was one of the most generic I've seen."}, {"id": 12, "text": "If you've ever seen a good movie, you will notice this isn't one. Bad acting, awful special effects and too cheesy with al standards things. First few days bad cop, after a while changing the look, changing the way of reacting. Sorry, but this movie sucks."}, {"id": 13, "text": "This movie inaccurately depicts the gorgeous island of Guam. Claiming that the military is a savior for them, when all they do is ruin the land and terrorize the people. On top of the tiresome storyline and terrible portrayal, the moving is plain and boring. No chemistry between the actors and it sounds like a 13 year old on wattpad wrote it. I would give a 0/10 but it's not possible."}, {"id": 14, "text": "I tried to like this movie but I kept getting distracted by the bad acting and the constant thought that Kat Graham either crapped her pants, has the back of an 80 year old or she was drunk while filming because the way she walked had me rolling. Idk but I couldn't stop laughing at the awkwardness of it all."}, {"id": 15, "text": "This was a fun, look at how other countries celebrate Christmas. It also featured our military in an awesome light!! Roger_2020 you need to get a life!"}, {"id": 16, "text": "Based on true events. Great family story, real Christmas spirit."}, {"id": 17, "text": "Too early for Christmas movie and this movie was so boring. OMG the CGI gecko, seriously? It looks so unreal! I immediately stop watching the movie when I saw the CGI gecko. Lol!"}, {"id": 18, "text": "Is this a really long and boring Apple commercial, I've seen macbooks, ipads, imacs, apple watches... The reason I gave it a 3 is because the beautiful landscape shots. Both main actors couldn't be less artificial."}, {"id": 19, "text": "I don't get why the rating is so low? Any movie with Alexander Ludwig in it is good! This is a very christmassie movie with everything you need for christmas. Okay it's not the typical Christmas movie as any other, but you will get the Christmas spirit without the usual snow you see in other movies"}, {"id": 20, "text": "Atrocious. The guy isn't even cute. My christmas is ruined. The only thing that kept me watching is the CGI gecko"}, {"id": 21, "text": "I love Christmas movies... but not this one. Tried 3 times, but I couldn't make it to the end. The acting was some of the worst I've seen. Perhaps different actors could have done better? But the story was slow and dragged on as well."}, {"id": 22, "text": "The male lead is likeable. He is the only one. The female lead is stuffy and a drag on the movie. No romantic chemistry. No Christmas joy. No interesting story. The supporting cast is forgettable. I could not finish this movie."}, {"id": 23, "text": "This was a cute movie and better than some other Netflix holiday movies. The actors are known and good. The dialogue wasn't too corny and ridiculous like some of the others tend to be. The plot made sense and didn't get crazy or unrealistic. It didn't feel forced and it stayed on topic. It was light hearted, but also had a good meaning. If you watch these types of moves expecting something new/different than the usual predictable...why bother watching? These are feel good movies that can put a smile on your face.Kind of wanted more of the development of their romance, but also liked that it wasn't the main focus."}, {"id": 24, "text": "This movie is outrageously predictable and not very entertaining."}, {"id": 25, "text": "Ok, Let me take a deep breath. Kat/Erica's dressing, bad acting and hair got me sick. Totally lost in the movie because their face expressions don't match the situations. I think i can act now."}, {"id": 26, "text": "This is a great movie with a great cast for what it is. I honestly did not expect it to be this good. It tells a great Christmas and a love story. It also contains a lot of beautiful scenery. This movie is absolutely adorable and gives you a sense of the Christmas spirit of giving back."}, {"id": 27, "text": "Yes it was simple, predictable and twee but what's so wrong with that? We all need a little dose of sweetness and light, this film gave me just that. I love that Operation Christmas Drop is a real thing and as a military wife (British) its wonderful to see the armed forces in their humanitarian role."}, {"id": 28, "text": "An interesting proposal for Christmas... there are many people who cannot be with families during holidays....especially in a year like 2020 I hope people stay safe and enjoy the movie"}, {"id": 29, "text": "I didnt know the operation is true story, very heartwarming looking people helping the others"}, {"id": 30, "text": "Operation Christmas Drop was a film like i knowed what it will be,unfortunetly we got in a season were we are getting a tone of Christmas based films that feel the same and that we saw a million times before.But this film at least had some cute leads who had good chemistry between them and at least that thing worked in a good sort of a way.Story in other hand was very predictable and i wasnt surprised by any kind of directorial decision and remark.But at least this film was little better then some previous films that we got last year so there is that"}, {"id": 31, "text": "It is not necessarily a bad movie (although the CGI gecko was atrocious!) But it is a pretty standard Christmas story wrapped up in the tropics and military garb. The most redeeming quality if the movie, and the only reason I would ever watch it again,are the shoutouts to the real people and historical events that's inspire the movie, which appear just before the credits roll."}, {"id": 32, "text": "This movie is shot at Anderson AFB on the Island of Guam, so the scenery is beautiful. Even more so is the beauty of the effort of The United States Air Force and the U.S. Dept. of Defense. The message is clear."}, {"id": 33, "text": "This shows how servicemen and women around the world are helping their fellowman. It also shows one side of many politicians. She said,  These are not my voters"}, {"id": 34, "text": "I enjoyed this movie as it was just enough different than the standard formula. The casting was a nice choice and the location was not some small town! Yeah, it was a small island, but whatever. The main characters were intelligent and there was not some dumb wishy washy boyfriend. The main character doesn't give up everything and change her life, nor does she need to. It was a little slow at times but I just hit fast forward a tad."}, {"id": 35, "text": "Best movie I have ever seen! I love them, love the story and they were so cute together. Love it, love it, love it"}, {"id": 36, "text": "I thought this movie was great! It was touching seeing the true story of the work the military does on that island to bring joy to families with very little for Christmas. I thought Kat Graham and Alexander Ludwig played their roles very well. I highly recommend this movie to anyone who loves good Christmas movies!"}, {"id": 37, "text": "How amazing is this real life program - I was privileged to learn about it via this beautifully shot film - what gorgeous scenery and cinematography. Doesn't win an academy award but how amazing is the message and portrayal of a wonderful humanitarian effort. Don't miss the awesome real life of the operation during the credits.Great to see Kat Graham shining as usual. Watch for Brother David - it is really him."}, {"id": 38, "text": "I liked this movie. It had a nice cast and a nice message. Worth the watch for a subtle Christmas themed moved. Cute little rom-com."}, {"id": 39, "text": "This film is nothing unique but it is a fun it tells the story of something extraordinary that was true it is boring and bland at some parts the relationship drags on at some part the comedy is sometimes flat and your generic romance comedy overall it's a fun joyride for the family and especially in military members of a family I would give it a 77% and it depends on the person you are if you want to watch it"}, {"id": 40, "text": "This seemed more like a documentary than a movie. It was quite boring for me to watch, it just seemed like it was all about the military and how they serve. The romance and attachment seemed odd and thrown in . It is nice to see Amazon doing Christmas and some clean content movies but this was too documentary! I feel like if you are like me and don't like documentaries, you won't like this either."}, {"id": 41, "text": "The story background is interesting but the movie was sooo boring, no action at all and all the scenes and the ending were so predictable."}, {"id": 42, "text": "I absolutely loved this movie. It really captured the Christmas spirit. And the love story was so wholesome. But now they have to make a second movie so we can see how they will stay together."}, {"id": 43, "text": "You wanna tell me they didn't had enough money for a real geko?"}, {"id": 44, "text": "The supporting actors are all Canadians who work at both Van Helsing and the Hallmark Factory. The plot is Hallmark. The acting is Hallmark. Even the music is Hallmark. Nothing wrong with it. Just don't expect it to be Scorsese. And it's based on the true humanitarian drops in Melanesia, and the real Brother Bruce is in the movie. They show photos of the real people doing the real Drop during the closing credits. The scenery is stunning, the real military hardware and the CGI gecko set it apart from the usual Hallmark. Enjoy it for what it is. 85 minutes of mindless and innocuous fun."}, {"id": 45, "text": "This movie was so encouraging; demonstrating the incredible job our military personnel do on the frontline; wasn't really a romance story, but well done and well told"}, {"id": 46, "text": "The scenery was absolutely beautiful. Without a doubt the scenery is the best part of the movie. I can't give much more of a review than that because I fell asleep after 30 minutes into it."}, {"id": 47, "text": "This would have to be one of the top Xmas movies I have seen. Nearly a (real) tearjerker. Based on a great (true) story, lovely characters, beautiful scenery, very positive messages. What a fabulous movie. Don't miss this one!"}, {"id": 48, "text": "Loved it to the core!! Just created an IMDb account to write a review for this movie that it deserves. I agree its a simple story but there is definitely some magic to it, the overall story, the sense of truth to it and overall feeling that this movie projects is just truly awesome!!"}, {"id": 49, "text": "In these times filled with uncertainty and nothing much to look forward to I was waiting for this movie to hit netflix for sometime now to get me in to the Christmas spirit. The usual christmas movie staples of snow, hot chocolate, ice skating and cookie backing were traded for beautiful beaches, sunshine, snorkelling and coconut shavings for snow! Living in a tropical country myself this rang closer to home. The lead actors were brilliant and had wonderful chemistry and the captain wih his twinkling eyes and smile truly made you want to just stop everything you were doing at the moment and go do somebody a Christmas good turn right away. The romance was secondary and the true essence of the film of paying it forward and helping people who were less fortunate than you shone through without being too sappy. And also it helped rekindle the Christmas spirit not only in our leading lady and the congresswoman but also in me. It also helped bring to the spotlight the very real operation Christmas drop which has been happening since 1951. It has surely earned a place in my list of go to Christmas movies from here forward."}, {"id": 50, "text": "First of all, the CGI gecko was absolutely ridiculous. It was so bad that I laughed and thought it was going to be a Disney-like character in the film. Maybe that it would start talking to them. I dont know. Somebody should get that artist over to Disney. My biggest complaint, which I havent seen anyone talking about, is that they dropped the CARDBOARD boxes in the middle of the water...filled with supplies like clothing, medicine, and whatever the hell else. They couldn't drop them on the actual island? Maybe move over 20ft and hit the beach? Or how about something a little more robust than cardboard boxes? It just doesn't add up to me."}, {"id": 51, "text": "Sweet, warm and finely executed this Christmas set rom com is a fresh surprise. The pair of protagonists are really good and appealing, the story resonates to familiar themes with accuracy and magical realism. it's funny, lovable and emotional (it subtly depicts the effects of being apart from Loved ones, especially during holidays). Perfect for all ages."}, {"id": 52, "text": "I like a good romantic comedy, but this is so far from a good romantic comedy. Had to turn it off because it was just so bad."}, {"id": 53, "text": "This film creates an aura of home half way around the world and captures the Christmas spirit on a tropical island big tick!"}, {"id": 54, "text": "As an Australian who loves a hot Christmas I loved that this was an American rom com without all the annoying snow plots I can't relate too or enjoy. The scenery is beautiful and the message of helping people over the holidays is both happy and inspiring in a year where neighbours may be doing it tough. The highlight for me is that it's a Christmas movie without a love declaration. It's still cheesy, portrays unrealistic scenarios, and has ridiculously young hot people in bathers but at the end of the day, it made me smile and feel happy. That's all I really want over the holiday season!"}, {"id": 55, "text": "This movie is all things that make a Christmas movie a Christmas movie. The cheesy super sweet dialogue, the over the top Christmas decorations, and of course the romance. What makes this movie stand apart, however, is the true depiction of what military families experience away from home. We do whatever we can to make it feel like home by sharing joy and love with others. This will definitely be a holiday movie we watch for years to come."}, {"id": 56, "text": "I like military movies and I love Christmas, so this was a win win choice to pick.I really liked it. I like both leads anyway and I liked the story. It would be so cool to be a part of something that amazing in real life. Bringing happiness and joy to people who aren't as privileged as others. So nice.I'm glad I watched it and will watch it again."}, {"id": 57, "text": "A generic Christmas comedy. It is about a girl who goes to an island to see if the procedures they are performing are functional or to close it, discovering the unexpected. Quality. Entertaining Parsimonious at times. Light jokes. It does not focus on the love story, it goes to situations. The problem is that the ending is the most trite, the performances are linear, the moments that should be the most emotional pass without meaning. The message he tries to give is good, about giving to others and rediscovering what made us choose what we are professionally, but with the precarious actions that he has, he does not succeed. Some effects are not fully achieved. It shows data of this type of operations which turns it into a fiction based on a real situation. Sunday."}, {"id": 58, "text": "5/10 - nice real-life military tradition doesn't make for a good Christmas romance"}, {"id": 59, "text": "Admittedly it's a cheesy Christmas movie. But it's a fun one for the genre.But the thing that REALLY ruins it? The saturation used to make the airman look tanned everyone ends up looking unreal and not very human.Again: for the genre it's alright."}, {"id": 60, "text": "I'm mouth less and this movie made me to feel like it's a Christmas. Love this movie and the chemistry between the strict officer and the captain 😍. Help the one who's not have that too. Help the one who is not having that too."}, {"id": 61, "text": "To start with, I went into watching this movie, thinking it would be your typical super cheesy but cute Christmas Movie. And for the genre of movie it is, I have it a high rating because, it gave me all the feels. An entertaining portrayal of the essence of the Chistmas Spirit. It also contains some eye candy, as most christmas movies do😏. A great movie to sit back with a glass of wine, and enjoy to warm and fuzzy Christmas feelings."}, {"id": 62, "text": "Just saw the film and was expecting a good entertaining film, unfortunately Operation Christmas Drop was neither of it. The definition of the characters was weak and the script was appalling. Why did netflix make this movie? I strongly recommend to avoid seeing this film to anyone it might ruin your xmas holidays!"}, {"id": 63, "text": "The movie has good intentions, but the lack of drama or conflict in the story are big problems."}, {"id": 64, "text": "I immediately was taken aback by the fact that it was a very realistic situation (these movies are often so implausible). But then it went on to be sweet and fun. I really enjoyed it."}, {"id": 65, "text": "Christmas romance movies commonly focus on recasting a career woman through a series of (challenging) events back towards finding their true self as a wife and mother figure. Whilst the narrative has changed over the decades this one clearly follows this mould. This film completely drenches the awful treatment of the residents of Guam island by the US military in a sickly treakle of sentimentality. Best avoided over the festive period."}, {"id": 66, "text": "It is historically movie! Try be romantic with Beyoncé (Katrina Graham) I am Johnny bravo(Alexander Ludwig)! Very bad choice of actors! Screenplay is not strong enough + to many unnecessary dialogue and some of them is verey childishly dialogues and behavior!Biggest Thanks for Christmas drops you doing great job. is that only one time of the year?!!"}, {"id": 67, "text": "Poor audio, visuals, directing, and writing. sorry."}, {"id": 68, "text": "Just a great movie. Just sit back and watch it. Enjoy it for what it is, something we need during these times. Heart warming."}, {"id": 69, "text": "Nice good feel movie. Shows the spirit of christmas. Excellent acting great scenery. Good feel excellent for everybody."}, {"id": 70, "text": "I was expecting a typical sappy rom com type film that you often get this time of the year on TV, and it did kind of start out like that, but has the movie went on it became so much more then that, the movie is about a good cause for Christmas and going against the odds works well here. The setting itself becomes a character, makes you feel like your really there and Kat Graham and Alexander Ludwig started out with no chemistry, but it got better has the movie went on. Virginia Madsen is also good in her role also. If your looking for a delightful holiday film for the whole family then give Operation Christmas Drop a look."}, {"id": 71, "text": "Put your jaded Covid/election souls to rest for bit. This is a genuine happy movie based upon a true story. Just let yourself enjoy it. Well done, Netflix we all needed this."}, {"id": 72, "text": "While of course there is romance, that is not the true plot of this feel-good, honest-to-goodness, and enjoyable Christmas movie that the whole family can enjoy. Based on the real-life Operation Christmas Drop that our US Military has been carrying out for decades, Netflix gives light to a wonderful, humanitarian project and the men and women of the Armed Forces that make it so- as well as the people it touches and the real people who help along the way.I would highly recommend that anyone who enjoys a real happy ending to watch. It still has the typical Hallmark-style clichés: dead mother, distant family, single workaholic woman, etc, but it brings them together nicely in a tropical holiday event.Thanks, Netflix, for a story worthy of the spirit of Christmas."}, {"id": 73, "text": "True story ! Upbeat Christmas movie. Heart warming with real live Air Force mission in Guam."}, {"id": 74, "text": "I've just started watching this and their animosity towards each other is really genuine and I love it. Not that cat mouse thing that's so played out. Like with the events true frustration and annoyance and not lingering over long shots on them. Working at a male dominated career I understand her attitude and her whole personality. Which is like the movie so far genuine and not fakely played out. I love Kat in this movie I feel like this is more her she did a good job."}, {"id": 75, "text": "Better than the typical Hallmark Christmas movie. There is truth at the root of it all. Enjoyable way to spend and evening."}, {"id": 76, "text": "I have watched MANY holiday movies already this year and this and Holidate were the first two that felt like real movies and not bad Hallmark movies. The setting is beautiful, the acting is pretty good, and the fact that it's loosely based on a true story is super inspirational. It was a great uplifting movie for 2020"}, {"id": 77, "text": "It's a little on the cheesy side and predictable-but so are every other Christmas movie.The big thing about this movie is that it is based on a real military operation that happens every year, which makes the overall story feel authentic.Great work."}, {"id": 78, "text": "The actress's acting was awful!!!!! I couldn't watch the whole movie sorry"}, {"id": 79, "text": "I honestly loved this one. And knowing that is based on true facts, it makes me really emotional. I liked the actors, too. I was surprised by how well the main male actor is acting. I will definetely check his other movies out. I remember him from The Hunger Games. Please, watch this movie, I think you'll really enjoy it. It is one of the most beautiful Christmas movies I've seen in the past few years. Give it a try. You might be surprised (in a positive way)."}, {"id": 80, "text": "Pretty cringy, the gecko was cool, but looked like they paid a college student to do the CGI. Predictable, about as bad as you would expect for a Christmas movie, better production quality than average but doesn't make up for the tired plot. Acting wasn't the worst, but the one reviewer below was clearly Alexander Ludwigs mom."}, {"id": 81, "text": "A lovely film that is well worth watching especially at Christmas. A real feel good movie that was also very informative as well to understand the actions of the American forces on a Pacific island. Had no idea so many people live on Guam. Well worth watching"}, {"id": 82, "text": "A basic Hallmark movie that Hallmark passed on because it couldn't be filmed in Canada without changing the whole script. ;-P"}, {"id": 83, "text": "First, I love Kat Graham so I wanted to give this one a chance. But I love a lot of snow and Christmas in the background of Christmas movies. I doubted one set in Guam would be able to pull it off. That was wrong. Plus the whole vibe and then the message of this one was nothing but what the Christmas Spirit and holiday should look like for everyone, no matter where they are. I also enjoyed the acting. This was a hit for me all the way around. Really glad I turned it on."}, {"id": 84, "text": "I truly loved this movie. This movie created a sense of Christmas spirit in which is hard to have this year considering how 2020 has turned out. The characters were so intuned for each role and were the perfect fit. This film is definitely a spirit lifter and a pleasure to watch!"}, {"id": 85, "text": "This movie is a complete waste of time and my taxpayers money. I cannot believe I wasted all this time watching it. Actually it was my girlfriend who forced me and now I will have the worst Christmas ever."}, {"id": 86, "text": "Cute family movie for a late night. Pretty lame plot but entertaining and pretty fun. 5/10"}, {"id": 87, "text": "This was just a horrible movie. And the gecko? What the actual f..... Glad I fell asleep and missed the last 30 minutes. Dont watch. I got no idea why people give this movie 7/8."}, {"id": 88, "text": "I feel like the ending was unfinished as it ended so subtly I expected there to be more"}, {"id": 89, "text": "First of all, not using CGi or at least limiting the use is a great bonus. More movies should do that. It's a lite movie with a great story. The love story is a bit cheesy. But a soils 8 for a holiday movie."}, {"id": 90, "text": "I guess its tough to get a part after playing a huge part for years in vikings. Im trying to watch this, but all I see is Bjorn, and im expecting lagertha to bust out any minute."}, {"id": 91, "text": "To much (emotionless) dialogue, crappy acting, story was boring, extremely ugly Christmas decorations like omg is it so hard to have at least 2 matching light string Jesus, lipless guy, to cheesy, main character walk like Shrek. Lost interest after about half an hour. Only good thing I can mention are the main character's sunglasses they are gorg."}, {"id": 92, "text": "... but she had no chemistry whatsoever with the male lead in this one. I thought it was supposed to be romantic, but it wasn't. Not even cheesy romantic. Just a boring family movie."}, {"id": 93, "text": "I try to rate/assess movies against other movies in the genre as opposed to comparing them to movies in general. So, how did this film compare to other Christmas romance films? It was...OK. I mean, it was a decent film, not the best I have seen nor the worst. It was a nice story, a caring story. And the script/dialogue was not bad. The acting was pretty good too. I am a fan of the Vampire Diaries and Vikings, the TV series that the two leads are known for. Kat Graham's performance was strong; she does a good job in such roles. Alexander Ludwig was not bad. To be honest, it was a bit strange seeing him in this genre of film after watching him for years in Vikings. But he did OK, though I am not sure this is the genre for him. The chemistry between them (the leads) was pretty good as well, which is important in a romance film. The supporting cast was strong. Fans of Battlestar Galactica will be happy (and maybe surprised) to see Aaron Douglas (as the Mayor) in the film. The scenery (filming location) was quite beautiful. I especially enjoyed the drop from the cargo plane at the end of the film. It was a nice scene. Overall, it was a decent film that Netflix has added to its original Christmas movie collection. Worth a watch if you want to get in the Christmas spirit."}, {"id": 94, "text": "Initial Thoughts: In the age old war of Netflix's quantity vs quality. I feel like this film fell on the quality side. Based on the real life, OPERATION CHRISTMAS DROP, this film is definitely a feel good, heart-warming movie that can be enjoyed by the entire family as a month before Christmas, Christmas movie. Though the acting and chemistry between actors seemed almost fake, or forced, they were still able to bring about a decent movie.Pros: The story, for me, is incredible as it uses the real life OPERATION CHRISTMAS DROP as the inspiration for the movie. Emotions were strong with regards to the Christmas spirit and trying look out for those who struggle, especially around the Christmas season. Though the acting wasn't outstanding, it was just strong enough to bring this one home to a happy ending.Cons: There was hardly any CGI used in this film, but the little that was is enough to mention. The gecko they used for the film should've been real as opposed to the awkward VR looking one they had. Besides bad CGI the chemistry between actors was weak. On their own they seemed to be great, but the romantic interaction they should've had was not. Any time they were together it felt awkward, forced, and uncomfortable the entire time.Overall: I'd say if you're looking for a decent quality, family movie that doesn't have a bunch of romance in it, than this one would be for you. Would I recommend watching this film specifically as a Christmas movie? No, I wouldn't, but the story is great as it speaks about being selfless and doing what you can, and what makes you happy, to bringing joy to those around you."}, {"id": 95, "text": "If the US Military were ever to do a rose-tinted promotional video, then this would certainly serve that purpose. Kat Graham (Erica) is the ambitious aide to a Congresswoman (Virginia Madsen) who is looking to save money by shutting down surplus military facilities. When she spots an article featuring pilot Capt. Andrew (Alexander Ludwig) complete with Santa hat describing their Polynesian Christmas Drop, the Scrooge-like politician despatches her assistant to their idyllic island base to write a report that will shut the whole thing down. On arrival, however - her horizons change as she realises that she has the hots for the handsome Ludwig and that there is a heck of a lot more to the goings-on on the island than she had originally thought. We are never in doubt as to the outcome; but the two stars do gel, Ludwig has some charm without his Viking leathers, and the story has a gently comedic, Christmas feel good factor that nods to the somewhat crucial combined operations of US, Japanese and Australian forces that supply (not just at Christmas) many of the tiny islands and atolls in the Pacific at actually very little additional expense to anybody. Sure it's sentimental, but it's the time of year for it..."}, {"id": 96, "text": "In a word: Boring!I will say I did enjoy Kat Graham and Alexander Ludwig in the lead roles, I thought they worked well together. They are, unfortunately, the only plus points I have for 'Operation Christmas Drop'.It really is just so dull. The way they set the plot up is weak, with it instantly becoming obvious what is on the way. You are just waiting for Graham's character to switch, which she actually does quite early on. So the rest of the film, until the 'big moment', is filled with nothingness... just pointless filler.The real life story that inspired this is quite cool, but this doesn't do it any justice sadly. It isn't even anything negative, at least to me, but there's little to nothing positive about it either."}], "reviews_amount": 97}