{"name": "Sacred Cow: The Nutritional, Environmental and Ethical Case for Better Meat", "titleId": "tt13177004", "reviews": [{"id": 0, "text": "This film said nothing I did not already know, but it said it eloquently, thoughtfully and beautifully. The only way humans have a future on this planet is to reverse the damage we have done to our ecosystem. Repairing anything requires first understanding it, then you have to do what that understanding tells you. There is no ecosystem anywhere on earth that does not include animals, so animals will have to play a part in the regeneration of our planet. Any system of agriculture that does not include animals is destined to fail. Thank you very much to the entire team behind The Sacred Cow, and all the farmers around the world who are helping in the fight to save our sacred planet."}, {"id": 1, "text": "Dear Diana and Rob. And all the people involved.What an amazing, sober, informative, thought provoking and giving film you have made. I am proud to have supported you and will gladly share this essential message to everyone I know. Also the vegan ones 😊. I look so much forward to this spreading across the world. It's a really important message and I sense you are driving one of the most important movements in our time.Thank you!"}, {"id": 2, "text": "This documentary is a must-watch for everyone as it will help you understand the food-chain process. I liked the way this documentary is compiled, answering all the contradictory issues step by step. I would recommend this film to be shown to school children as well to help them understand the source of their food better."}, {"id": 3, "text": "The film perfectly reflects the contradictory views in the public consciousness. It is not easy to navigate between them, in this it helps to find the right path, following the principle of striving for balance in nature."}, {"id": 4, "text": "This movie debunks the Vegan propaganda about animal agriculture being the biggest culprit behind global warming &amp; land desertification. The truth is that ruminant animals revitalize &amp; restore land damaged by industrial farming &amp; help sequester carbon in the soil. Several farmers &amp; even some prominent ex-Vegans are interviewed in the documentary. Facts are provided to show that meat IS a healthy choice for human consumption -- we've been eating meat for more than 3 millions years! Animal foods contain at least 10 essential nutrients that are simply not available from plants. But you have to raise those cows, pigs &amp; sheep outside on pasture, the way nature intended, in order to regenerate the land &amp; produce healthy, nutritious meat for us to eat."}, {"id": 5, "text": "A must see for anyone interested in health, lifestyle and saving the planet."}, {"id": 6, "text": "We watched this film for a homeschool lesson to coincide with a habitat, ecosystem, sustainability unit for my kindergartner and 4th grader. We live in a dairy/cattle farm community and this film really wrapped a nice bow around all the things we are learning about in a way that my kids can apply it. It was very informative. I've been anxiously waiting for this to become available. Thank you for bringing this to the world."}, {"id": 7, "text": "This documentary explains regenerative farming and how it's actually good for the planet. I had heard about Polyface Farm before and was glad to see they were represented. We have got to do better for this planet by supporting farmers who practice regenerative farming."}, {"id": 8, "text": "Grateful to the farmers forging new ground in responsible farming practices and for those willing to participate in telling their story. The work is grueling and high risk: we are the beneficiaries. Thanks for the efforts of the producers to get this project completed."}, {"id": 9, "text": "If the world watch this, the world would change. There is so much hope when we see so many people doing such incredible things to heal the soil and thus heal all of us. We have to use this type of knowledge to demand change. Not just for those who can afford it, but for all. Thank you Diana for producing this. You have done an incredible thing."}, {"id": 10, "text": "Such a well done movie that shines a light on an industry that's basically a mystery. I used to be of the school of thought that all meat was bad, but I found my way back to meat, and wanted a better understanding of meat and all it's components. This movie presents an informative snapshot on some of the pressing issues and actionable steps. I'm a big fan of regenerative farming and will continue to support regenerative meat. Thanks for this movie!"}, {"id": 11, "text": "I am so grateful for the important work of the producers of this documentary. I just read the book Sacred Cow and the documentary succeeds in portraying the essence of the book. Our future depends on regenerative farming practices, both for our nutritional health and ecology."}, {"id": 12, "text": "Very happy to watch this documentary! The promise of regenerative farming is amazing but talked about very little! It exposes some of the flaws of the veggie movement without being all aggressive and the movie itself isn't super depressing as some of these documentaries can be. I liked it!"}, {"id": 13, "text": "I'm a vegan and I loved this film because it thoughtfully addresses several of the things I'm concerned with; climate change, food nutrition/quality, compassion for animals, and family farms. Regenerative farming is a key to a sustainable future. Thank you for spreading the word about regenerative farming."}, {"id": 14, "text": "This documentary really resonated in me. The interviews, scenes and explanations really make clear sense to a natural way of proper farming practice with livestock being a key part in restoring nature and soil, improving our climate, justifying some nutrient myths and misconceptions of ethical meat production (it's way more different to conventional meat, which is wrong). The messages are very clear to me, and seeing sceneries of the regenerative farming practices are emotional and empowering. I'm really glad that this documentary was produced because the world needs to understand our needs for regenerative farming with livestock, how this practice can correct the climate balance and soil health can be restored and why we eat high-quality, ethically-farmed meat. That goes for both people who are meat-eaters on one side and vegans on the other side as there are commonalities looked at."}, {"id": 15, "text": "Finally a science based program that highlights how regenerative ag is a key part of feeding our future and that we require a balanced science based approach to agriculture. Very well done! We need more like this one."}, {"id": 16, "text": "A brilliant and thought provoking journey. The importance of the subject must not be underestimated if farmers are to continue to be able to feed the world. Of concern is the narrative being pushed those with vested interest in the artificial meat business, including politicians. Thank you for putting out this film."}, {"id": 17, "text": "If you watched and liked The Big Little Farm, then you will definitely enjoy Sacred Cow. We need a lot more educational information like this to reduce processed food and eliminate single farming. Great job."}, {"id": 18, "text": "The past 20+ years we have been improving our soil by Carbon Ranching-practicing agroforestry in the tropics. Sacred Cow dispels the myths that have resulted from lumping all animal agriculture as one. Successful farmers are diversified farmers! Thanks for spreading the word."}, {"id": 19, "text": "Amazing film that details a very bright option for our future as a planet."}, {"id": 20, "text": "A quality documentary well worth your time. Insightful and visceral."}, {"id": 21, "text": "They did a great job in collecting data, stories, and experts. I thought it was a little poor to only talk to 1 (ex)vegan and not go into more detail on how people can actually do quite well as vegetarians. also there seemed to be a slight idea that its either pasture reared meat or chemical agriculture. you can grow food without animal inputs it just takes more cover cropping and the correct climate or rebuilding fallows. The message is good but might be a little polarizing and I was asking myself could a vegan watch this and not feel patronized and I wasn't sure. If you are vegan... watch it and leave a review! peace and climate justice for all. well done on the movie."}, {"id": 22, "text": "This was an incredibly well done film highlighting the importance of animal nutrition and the REAL impact both conventional and regenerative ag has on the environment, and the potential for regenerative ag to save our planet. It was refreshing to watch a film on this topic that felt objective and presented facts and realistic solutions instead of the typical myopic vegan propaganda films like cowspiracy and game changers etc that want everyone to quit eating meat like that will solve all our problems.Big ups to Diana and Robb and everyone involved in their film, the book, and the regenerative ag movement!!"}, {"id": 23, "text": "Everyone who values health, preservation of the environment, and animal welfare should watch this documentary. There's a lot of misinformation and outright lies about the nutritional qualities of meat and animal fats floating around, and this movie is excellent in presenting an all-encompassing view on the subject. I hope many people will be able to see this and get a chance to question the prevailing narrative that's been dominating the mass media and government's nutritional guidelines all over the world."}, {"id": 24, "text": "Very well done and an extremely important message. Everybody needs to hear this."}, {"id": 25, "text": "An interesting film. As a meat lover, but also sometimes wary of where my food is sourced, it was wonderful to see that, even though there was a matter-of-fact attitude that the animal was to be killed and consumed, that the welfare of the animals was paramount. There was a lesson. of sorts, to be learned from the slug lady, but a little tenuous."}, {"id": 26, "text": "I enjoyed this documentary a lot. It impacted me so much that at the end I told myself when I'm done with my corporate job, I wanna be a farmer. It was full of useful information, coming from trusted sources (for example, scientists, research etc). The story line was well structured. I hope this documentary reaches as many people as possible!"}, {"id": 27, "text": "Having seen this film twice now and each time feeling hopeful for the future. This film needs to be seen by everyone not just people who already lean in this direction. City people have lost their connection with where food and nature come from and this film tries to bring that connection back. Looking forward to seeing it many more times."}, {"id": 28, "text": "Sacred Cow is the key to a sacred and everlasting Earth. This is an excellent documentary, and a must watch for anyone interested in preserving a healthy and sustainable way of life, not only for us in the present, but for the future. Sacred Cow is a great reason to eschew corporate and government greed and return to quality of life. Watch it and then tell a friend to watch it. You won't be disappointed."}, {"id": 29, "text": "A must watch for everyone, carnivoes, vegans and everyone in between, if we want to fix the problems that plague us all. We can save our planet and ensure better treatment for animals whilst preserving the health of humanity. The book is just as brilliant."}, {"id": 30, "text": "Nowadays it's easy to look anywhere and find a ton of problems with society and the way we are interacting as humans. This documentary teases apart some of the nutritional issues that are affecting the health of our population and planet. Not only does it shine a light on the problems we are currently facing but also proposes an avenue for solving them. A+ *****"}, {"id": 31, "text": "I started with the book, loved it, put the bar very high. But I have to say, the movie delivered very well, super high quality."}, {"id": 32, "text": "Well thought out, well produced and full of great info. Sacred Cow will open a lot of eyes and help create a more sustainable future for our planet. Thank you."}, {"id": 33, "text": "This film is a perfect representation of how human ingenuity is often a Trojan horse for hubris. There's no need no to reinvent the wheel when it comes to nature's balance which has been fine tuned after millions of years. All things must die. The world is binary. There are predators and prey. We must chose to live in harmony with reality or drive ourselves into extinction. Eat meat and thrive."}, {"id": 34, "text": "Great film about why our meat is important to us as humans and to the circle of life and earth as a whole. We really enjoyed watching it and it is very informative."}, {"id": 35, "text": "Thank you for giving the information we all need. So helpful to balance the story's we are told from the media. Facts are what is needed and action is required. Seeing real families and individuals working was very impactful."}, {"id": 36, "text": "Sacred Cow joins the other high quality, high fit and finish documentaries which may be able to save the planet from the current war on the earth method of agriculture embraced worldwide.Livestock isn't the problem, livestock on the land is the cure. No life on the land (re-wilding) will only result in poor soils and ratty sites priming for destruction by water, wind &amp; fire."}, {"id": 37, "text": "Well worth the watch! I shared the invitation to view all over the place. Common sense and nature instead of extremism."}, {"id": 38, "text": "Very interesting and inspirational. There is hope for the planet. Thanks for all the work to make it. I am a carnivore and buy my meat at our local butcher."}, {"id": 39, "text": "Regenerative farming s the answer to the threat of not being able to feed the planet. This movie shows beautifully how properly managed ruminants like cows and sheep restore dead and depleted soil. It shows that nurturing Mother Nature's cycles builds soil and creates high-quality food. The scene with the business card and arable vs. non-arable land was particularly useful in solidifying the concept that we need to create food on non-arable land, and this is where the animals thrive. It also addresses many of the difficult questions around ethics of eating meat. Highly recommended!"}, {"id": 40, "text": "Honest, thoughtful, well put together. Compelling viewing"}, {"id": 41, "text": "A very clear and easy way to understand where our food come from and how can Farmers contribute to the healying of the planet by, in the meanwhile producing secure and good quality food. Also show the respect that it is needed to animal food production. A must see, if you are interested in a consistently healying of OUR PLANET."}, {"id": 42, "text": "I was already aware of a good bit of the information in this movie, but was also happy to find new information and explanations of regenerative farming, the health benefits of eating responsibly raised meats, and the beautiful explanation of the circle of life on our planet. I have and will continue to recommend this film to anyone who will listen."}, {"id": 43, "text": "A positive film exposing the folly of the black and white arguement of meat or no meat. It's how we treat the meat - and as a consequence how we nurture our soil and how we provide nutrition not just fodder to humans. This film is eager to share so much information it is a bit bitty in places but the overall theme is so positive. Agricultural practices can be the solution not the problem to our environmental catastrophe. Animals (ruminants) have been part of our world for millennia and we need to mimic nature to save nature. The film also debunks the health scares surrounding meat. As Zoe Harcombe says - surely our modern diseases of diabetes, cancer and obesity are more likely to be related to modern foods than meat that we have been eating since Homo sapiens evolved!"}, {"id": 44, "text": "This film brings an important perspective to the discussion about sustainable agriculture but leaves out many important arguments and other sides of the story. Would suit it very well to adress all aspects of the issue."}, {"id": 45, "text": "Excellent film documenting how important it is for us to understand why humans eat meat. I didn't know protesters were bullying small business, ethically minded butcher shops. The ignorant continue to create a culture of intimidation and refuse to learn from others. I love how this film highlights small farmers and their methods of treating the animals and land with respect and gratitude. This is a film which calls for healthy people, healthy animals and a healthy planet, through the lens of reality and not some fluffy fantasy world where everything is unicorns and rainbows. More people need to see this movie."}, {"id": 46, "text": "Such a touching and educational film about the truth around pasture raised beef and regenerative agriculture."}, {"id": 47, "text": "Honestly, when I watched it, I thought that nothing in the film is out of ordinary. Growing up with farmer grandparents in 80s and early 90s Poland, I've ran from cows and was attacked by poultry - but I've heard a lot about crop rotation, seen the cows grazing and all that stuff - something that disappeared in the meantime.Many people eat meat but at the same time agree with everything they are bombarded with by the media and they are baffled when someone starts talking about it. The vegan ideas became normal, while defending meat seems wrong and people don't understand what is the point. The film is a very good starting point, synthesizing the simple arguments. It is US-centric, obviosly, but unfortunately the US leads the way whether it's right or wrong."}, {"id": 48, "text": "I totally agree with eating meat raised in a Regenerative way. I have chickens and rabbits my chickens free range and go in a coop at night my rabbits are in tractors that I move daily. I throw all my scraps from my kitchen in my coop. Twice a year my husband cleans the coop and everything goes on the garden in the fall and spring. Ive been doing the no till method for about 3 seasons. My soil has tons of earthworms and looks so much better! We have more of a homestead then a farm. We have 2.59 acres that have wild chives ,grapes, blackberries, autumn olive, and tons of edible and Medicinal plants growing. I eventually want to rotate goats also at some point. I believe in this style of farming and think it will save the soil and our future. People are opening there eyes slowly but surely. I really hope the Subsidized farmers jump on board. Great movie! its people like you that are saving the planet!!"}, {"id": 49, "text": "Considering how potentially inflammatory the subject matter of this film is, Sacred Cow is accurate, thoughtful, balanced and devoid of sensationalism. It looks livestock as an integral part of the planet's ecosystem and biodiversity, and how regenerative agriculture reverses desertification and sequesters carbon (amongst other things). I completely recommend the film to everyone, particularly those who have watched and believed the inaccurate and manipulative vegan propaganda films such as What the Health, Cowspiracy, Game Changers etc."}, {"id": 50, "text": "Congratulations on a great film - very well told with the origins of industrial agriculture and the implications well spelt out. Then moving through to Regenerative Ag. with all the benefits - probably could have been told a bit more strongly- nutrient density and soil capacities to hold water and nutrients, but with a strong focus on animal welfare and environmental benefits of having cattle - especially the new work and re think on the impact that methane has on global warming. I really want everyone to see this film!"}, {"id": 51, "text": "Whatever you choose to eat it's important to understand the system that produces that food. The body of science on regenerative agriculture has been expanding very quickly. What we thought was the responsible thing to do in 2005 is quite different in 2020. As long as humans have been on the Earth they have been eating as have all the animals, insects, fish, anything that is alive. How we eat affects the systems we are a part of. Understanding how we affect those systems will affect our choices. Making a choice before you understand the system becomes foolhardy as we face a rapidly changing planet through the climate crisis. You don't have to eat animals, but animals must be part of the system if humans are to continue on the planet."}, {"id": 52, "text": "I loved the film and feel that it is a wonderful, thoughtful documentary. I am a huge fan or Diana and Robb. They have done a wonderful job with this film. I know from consuming their other content that they are passionate about helping people and communities. The film covered so many critical aspects of the meat discussion and provides excellent solutions. The information presented is measured and easy to understand for all audience levels. My only concern is that the content containing animal production including slaughter will deter inquisitive vegans from viewing this valuable content. But I don't think the film would be the same without it."}, {"id": 53, "text": "I've been following the authors of the book for years. Eagerly I waited for the film to be released. It absolutely exceeded my expectation. More often than not movies based on a book are disappointing. This is a case for a movie fulfilling the book. It's not only educational, but a story of renewal told eloquently and captured my attention to the very end! I hope everyone takes the time to watch it - more than once! So much information is packed into this documentary."}, {"id": 54, "text": "A wholistic and integrative look at food production and consumption, a far cry from the dogmatic and simplistic meat vs vegan war fueled on by corrupt media and corporate interests. A humbling but inspiring look at the place of humans in nature."}, {"id": 55, "text": "The movie was wonderful.It explains how, when, and why the food supply chain is the way it is.It exposes what is wrong about the current agriculture processes and what their damages are.It provides example of how livestock farmers' ideals meet those of vegans, and that sustainable, humane farming is the only way to treat an animal with dignity and respect.100% would recommend. Should be showed in schools!"}, {"id": 56, "text": "Like the Sarengeti Rules, another must see documentary, this film lays out plainly the argument that ruminants can regenerate the planet and keep humans fed. It isn't livestock farming that is the problem, it is all factory farming. The answer is regenerative farming. What is that? Watch this beautiful, inspiring film."}, {"id": 57, "text": "A well researched film and a much needed balanced perspective to eating meat. Definitely helps to have the science to back up the discussions that meat is not the cause of the end of the world. Will be getting as many people as I can to spread the word."}, {"id": 58, "text": "Such great information. Well balanced. Well done.need movies like this. Even if it is against the grain we need to be able to see evidence and have intelligent conversations about things. Not one way is right. Let's talk."}, {"id": 59, "text": "A beautifully made film and clearly presented argument in favour of regenerative agriculture to heal the earth and our bodies. It debunks so much of the false narrative around eating meat. I loved every minute of it. I highly recommend reading the book as well."}, {"id": 60, "text": "I'm so happy you've created this amazing documentary style video. It's easy to watch and understand and nails home how critical animals are to ensure a balanced eco system.Regenative Farming is the only viable solution moving forward."}, {"id": 61, "text": "Loved this film. It's so exciting and inspiring to see that the land will respond when you give it what it needs. I'm in awe of the farmers who take such pride in what they produce. Their work is gruelling, and society seldom gives them the support and plaudits they deserve.Sacred Cow was a valuable education in just an hour and twenty minutes. I was very happy to see the first farming couple on screen return at the end of the film with a new approach and sense of fulfillment in their work."}, {"id": 62, "text": "This film is chock full of important information on how we can restore our precious topsoil by returning to the practice of growing animals on grass. I'm a former vegan whose physical and mental health suffered on that diet. Returning to a traditional diet of meat and veg restored me and has helped me successfully endure cancer treatment and enabled me to quickly recover from COVID.The film is also beautifully shot and I loved learning more about small farms. These farmers truly love the land and animals and respect the natural circle of life. Great job!!"}, {"id": 63, "text": "A must watch doc! Beautifully written and produced, this riveting film lays out a compelling case for cattle production via sustainably managed grazing."}, {"id": 64, "text": "This is an absolutely critical film in a world with so much conflicting, inaccurate, and dubious/insidious information (and films). Sacred Cow takes a completely fair, balanced, and fact-supported view of the nutritional, environmental, and ethical case for better meat. A must watch for carnivores, omnivores, and vegetarians/vegans alike!"}, {"id": 65, "text": "This show is so very needed now. It challenges assumptions that meat is unhealthy and somehow less virtuous than plant foods and shows the harmful impact of the myth that animal agriculture is hurting the planet when in fact, it is the answer! The movie is logically and seamlessly composed, visually stunning, and presents solid science rather than relying on sensational, emotional arguments. And then, of course, it has that beautiful human touch that makes it relatable and stirs consciousness. Thank you Rob and Diane for this labor of love! I wish it was required viewing! I know my kids must!"}, {"id": 66, "text": "We need more films like this, that aim to set the record straight. There is so much one-sided information being promoted by so-called credible sources. This documentary aims to move balance back to center by presenting the not so often heard narrative. Great work Diana Rodgers, Robb Wolf, etc."}, {"id": 67, "text": "Very informative and well put together documentary. Unlike the recent vegan propaganda films backed by big food corporations, who claim eating vegan will save the planet, this film points out the actual science behind regenerative farming and debunks big food's spin on it. There was nothing i didn't already know in this film but can now use this to point my friends in the right direction to see how they've been previously brainwashed."}, {"id": 68, "text": "Working with nature and mimicking natural systems that have been in place for eons makes perfect sense. People who are so out of touch with nature and have no understanding of what goes into producing the food that they eat tend to believe that technology can solve all of the world's problems. This film highlights the environmental and ethical benefits of regenerative agriculture. True grassroots funding as well. I really hope that this film will reach far and wide to move regenerative agriculture forward."}, {"id": 69, "text": "I wish this was a mandatory watch over a mandatory vaccine."}, {"id": 70, "text": "We've used managed grazing principles on our ranch for 35 years and have seen first hand the ecological benefits of doing so from increased water infiltration, to increased wildlife species to increased native diversity. This movie does a great job of explaining agricultural problems and solutions that affect human health in a way that everyone can understand. I like that it tackles all the angles: nutrition, environment and animal rights with compassion and sensitivity. I wasn't done watching it and I sent the link to urban friends who I know are concerned about good health, both personal and planetary. The book is also excellent--very well researched and documented. Highly recommend both!"}, {"id": 71, "text": "I really enjoyed Sacred Cow and learned a lot about the history of farming as well as our current problems and the science behind some solutions to being making farming more environmental, sustainable and ethical. I especially appreciated the interview with the couple who owned a local butcher shop and who reached out to some vegan protestors, pointing out that they really were fighting against the same enemy. I can't wait to watch it again, take some notes and discuss it with friends."}, {"id": 72, "text": "This lovely film has gorgeous images of peaceful cows, lush pastures, and explanations by grounded, practical, and knowledgeable people who are finding a way through our environmental crises. This film conveys immense hope and reassurance. It is as satisfying as if finally satisfying one's red meat cravings after being vegetarian for many years with eating a regeneratively-raised beef burger."}, {"id": 73, "text": "Very well put together and easily digestible by any viewer. If even a fraction of the population shifted towards animal based nutrition and supporting regenerative agriculture, the overall health of America would increase substantially."}, {"id": 74, "text": "Fantastic common sense documentary The only way forward for us all"}, {"id": 75, "text": "Great film that displays the power of regenerative agriculture. It takes into account non fist world populations that are generally left out of the discussion."}, {"id": 76, "text": "Well done! This documentary exposed all the hidden parts of big agriculture that I've been trying to share with my family. I shared your link with several and they watched it too! Thank you for the time and efforts you put into making this documentary! Eating better sourced foods is so important to me as I value my health and the health of my family. Keep up the great work!"}, {"id": 77, "text": "A clear, objective look at these crucial issues. This perspective is one that isn't supported by billions of big food dollars, and we're exceptionally lucky that Rogers dug into it all on our behalf. On that basis it'd be rude not to watch it! When you see the big picture laid out in this way, there's a tangible feeling that the truth is so obvious. How could we have allowed things to go so wrong?"}, {"id": 78, "text": "Bringing people together and staying away from finger pointing and blaming « the other » is such a refreshing framework to experience.This documentary is a great conversation started around animal respect, sustainability and ecology.Highly, highly recommended"}, {"id": 79, "text": "Watching this documentary is critical to those who are concerned about the health of our food supply chain. It effectively counters the arguments made by some that eating meat is unethical and harmful to the environment, and also provides support that a diet lacking in meat can be detrimental to one's health. Everyone who is considering eliminating meat from their diets should watch this film before making that choice."}, {"id": 80, "text": "Excellent overview of the most important perspectives on global health, a grass roots, honest approach to solving a crisis that spands from issues of the global environment, animal welfare, to the human chronic disease epidemic. An absolute must see. Let's go!"}, {"id": 81, "text": "Thank you for a well put together video showing the importance of humane multi animal farming- for the animals and our environment. Would love to see this introduced to high school and college classrooms, where there is such a push towards veganism. I enjoyed the film very much. I was already familiar with Joel Salatin and admire his passion for humane sustainable farming methods."}, {"id": 82, "text": "Beautiful film-made me cry to see the farmers and their commitment to our planet."}, {"id": 83, "text": "I learned so much from watching this film. It's a complicated issue for many, and I love how it deals with the ethics of eating animals and the health of the planet. Those two issues matter to me and were pushing me towards being a vegetarian for many years. It's important to put both issues in the proper perspective and not just follow propaganda that is in the media. I also was not doing my body any favors and was becoming quite unwell. Putting the life of an animal above our own well being is backwards thinking. I love that we can treat animals as sacred by providing a beautiful life for them and also respecting our own needs, and doing both with dignity, just as the indigenous cultures did, long before this land was colonized. People forget about the millions of bison that lived on this land and kept it verdant until they were destroyed. Thank you for sharing this knowledge with the world, we need it."}, {"id": 84, "text": "I love that it isn't one sided. They were great about bringing in multiple view points and legitimate information.I think it is very important for everyone to watch and to question what is actually going on in the industry.Will definitely watch again in the future."}, {"id": 85, "text": "OMG... I love this film. It's on the same line than Kiss the Ground, but also talks about the nutricional case for meat. I was so exited to watch it, and it reach every single expectations I had."}, {"id": 86, "text": "Wonderful film, I actually teared up a couple times because of how authentic and moving this film was. There is real meaning and purpose behind this film and people are passionate about what they do. As a future RD (starting internship 2021) I am so frustrated with our food system, with our government, with BS propaganda, with fake science, with fast food and big corporations. WE HAVE THE POWER, SCIENCE, and EVIDENCE to turn this train wreck around. We can support local, we can educate ourselves, and we can honor our food. This concept is not strange, think about our ancestors and the Native Americans who honored the earth and the animals that provided them sustenance. I hope to have my own land and do my part one day along with educating the public and local farmers/ranchers. Great job, this is a labor of love."}, {"id": 87, "text": "I highly recommend this to every single person on this planet able to view it. A perfect non bias documentary on what we all need to know and learn about. Thank you so much Diana, for opening my eyes to even more issues I should have always been aware of. This documentary will hopefully change the world before it's too late. Thank you for creating this masterpiece 🖤"}, {"id": 88, "text": "I thought the ideas were presented non-dogmatically and reasonably. And it didn't veer off into health freedom issues like some of the libertarian anti-science types that are on the fringes of the healthy food movement (Weston Price foundation anti-vaxers I mean you). I would have liked some discussion of the withdrawn UN study on cows and methane though. Also, while I appreciate the critique of factory-farmed foods, there was no discussion of a more healthy type of social organization of food production on a large scale.I'm writing this per Diane's request to leave a review. I'd give it a high mark but not an A+ or even an A - more like a B+."}, {"id": 89, "text": "In a world where movies like Game Changers can make blatantly false claims without disclosing financial incentives and conflicts of interest for the movie producers, or the lack of good data, all without backlash from the mainstream media, then it is my hope that movies like this will change the myopic American view of the world.Stealing from Robb, Regenerative cattle ranching is one of our best tools at mitigating climate change."}, {"id": 90, "text": "This documentary left me in tears and gave me hope for the future of our planet. Watch the documentary, then read the book!"}, {"id": 91, "text": "The film is great in many aspects but what makes this film so special is it's ability to give the facts in a non biased way!! We all know sustainable farming practices and eating meat is healthier for us than a vegan diet, these are scientific facts, but the film delivers the goods and science in a non biased way and allows the viewer to take in the facts and make an informed decision for themselves. Also in case you didn't catch it the film is narrated by non other than Nick MF Offerman!!! Thank you for the early screener last month and I wish nothing but success for the film!! Oh and buy the book! I bought it right after viewing the film and goes along well with many other reads on the same subject. Cheers!"}, {"id": 92, "text": "Sacred Cow is a well rounded look at the environmental, socio-economic and human health concerns surrounding our food systems and the choices we make. It is so refreshing to see the topic addressed by people who understand the vast complexities of whole ecosystem dynamics. We all eat and we all need to be having these conversations. The beautiful imagery that accompanies the film and the inspiring stories of people working for a more sustainable food system make the film a joy to watch."}, {"id": 93, "text": "As someone who has tried to transition to a plant-based diet and became rather sick, I'm so glad that this movie has come out. I chose to eat meat again but felt so torn about it, but when I found the information presented by the producer of Sacred Cow (Diana Rodgers), I suddenly realised how misinformed I had been.This movie presents so many arguments for eating ethically-produced meat. I feel like evangelising for it all over because it's a disturbing fact how much veganism is growing like a cult and harming many people and our environment.I like the way the movie showed real, compassionate people practicing animal agriculture. Quite a significant amount of information was presented in a short amount of time. There were two small changes that I would have liked - a longer interview with Lierre Keith of The Vegetarian Myth. I thought that more needed to be shown about the importance of eating meat for our health.The other thing, is I was concerned about all the visuals of raw meat in the beginning of the movie - I was concerned it would put vegans off and they wouldn't continue to watch the movie. I showed it to my older kids as they're all for veganism although they don't practice it in my house - they have chosen not to inconvenience me. They still weren't convinced because the vegan propoganda is strong in their age group, but...the environmental information really opened their eyes and I think it did get them thinking. I'm hoping that it will prevent them from making that unhealthy step in the future. One of the most vital pieces of information shared was how mass crop agriculture also requires death and that you can't get away from it, so it's better to do it compassionately and ethically instead of chopping up mice and rabbits in combine harvesters. I really hope that sustainable agriculture can become a worldwide movement."}, {"id": 94, "text": "This documentary is and ode to meat consumption, and it's so rriddled with pseudo-science, sophisms and errors, that I can't help but think that it's industry founded.I was very surprised that they critic (with strawman) the EAT Lancet study on sustainable diet even though they interviewed the man who directed it, Walter Willett. But haven't ask him any question on this subject.It stars a lot of well known quacks in the nutritional field (Zoe Harcombe, Chris Kresser, Nina Teicholz to name a few) which have been disavowed many times. Who spout the same non-sense they've been spouting for years.Diet ideologues should really stop making documentaries, it's as bad as the vegan counterpart Cowspiracy, if not worst."}, {"id": 95, "text": "This film is incredible and so important/needed right now! More and more people I encounter are either currently vegan or contemplating going vegan and their reasoning is usually related to thinking that the removal of animal products from their diet is ethical and more environmentally responsible. This film does an amazing job at creating clear content filled with research backed information that de-clutters this topic. This message MUST be shared!"}, {"id": 96, "text": "Finally a film that proves once and for all how important animals are to our ecosystem and the health of the human race!! We can and should raise animals in a way that honors both of these things, and this film helps explain why! Thank you for all of the hard work and research everyone did to get this information out!!"}, {"id": 97, "text": "Must watch doc that needs a lot more main stream attention."}, {"id": 98, "text": "It's about time the truth is taught. If this film does not spread like wildfire then I fear for our planet and humankind. The proof is so clear that we need to change our ways with the way we feed ourselves and care for our planet and mono-cropping is obviously not the way. There's a cycle of live through regenerative agricultural for a reason. This is the way to sustain us and our environment and it's deplorable that our health, food supply and planet have become politicized. Thank you Diana Rogers for this necessary lifesaving work! Please continue to spread the word and let's all take a stand for regenerative agriculture and proper human nutrition."}, {"id": 99, "text": "I think everyone needs to watch this film. As an environmentalist and former vegan, I believed (like many others) that meat was the enemy. Years of studying nutrition led me to the work of Diane Rodgers and Robb Wolf, and the realization that sustainable farming methods are the only way forward- both for our health and our Earth."}, {"id": 100, "text": "This documentary was a very thought provoking and thoughtfully produced expose. I think it does a great job of identifying the claims made by both sides and using the science as well as common sense to demystify the arguments."}, {"id": 101, "text": "I preorder the book so I got an early screening of Sacred Cow and I was so impressed, everything is explained in a way that is easy to understand and once you understand what's going on, it's so eye opening, I love what Diana and Robb have done and I'm so hoping more people get to see this movie. Well done!"}, {"id": 102, "text": "After listening to Diana Rodgers be interviewed in early 2020, I had been keenly waiting to watch this film/ It did not disappoint. It was a motivating and informational resource to me as I've been transitioning from a vegetarian diet to one that supports local farmers and hunting."}, {"id": 103, "text": "Many ancestral foods have been demonized by big agribusiness and anti-meat advocates. They claim their products are healthier, better for the environment, and more affordable. Is that really so?This docufilm is a great argument against the last 50 years of mainstream media bias."}, {"id": 104, "text": "I'm already knowledgeable on the topics covered in Sacred Cow but I thoroughly enjoyed watching it with my son. The message is important and well presented. I would recommend this documentary to anyone wanting to be an advocate for our environment!"}, {"id": 105, "text": "Finally. A movie that discusses sustainable agriculture from a science and environmental perspective, rather than the emotive. It shows how very wrong the path we are following is and how are moving away from nature and sustainability rather than towards it when we attempt to exclude animals from the food chain. I very much hope that this movie will get people using their heads in regard to the sustainability of our future food supplies. We need to be working with nature, not against it. Hopefully it is not too late to make the changes."}, {"id": 106, "text": "This film provides a holistic solution to our food crisis, a solution that respects the environment and reaffirms our relationship to that environment. Solutions that ignore this relationship, solutions that make us more and more dependent on modified and factory made foods will only further destroy our precious earth and take away our control over what we eat. Working with nature and not against her surely is the right solution."}, {"id": 107, "text": "Sacred Cow presents an overwhelmingly convincing argument on the case for better meat. From debunking myths, intimate interviews with farmers, and objectively factual conversations with scientists and soil experts, Diana Rodgers and Co really did a fantastic job with this one. I've recommended the movie to all my followers on socials, stating it as the most important film to watch for those interested, or wanting to learn more, on the best path forward for the health of the planet and all living things that occupy it-- including us. I'm getting hardcore vegan backlash, but the film has gone over why it may be tough for that community to shift in thought......."}, {"id": 108, "text": "This documentary was very thoughtfully put together and is absolutely wonderful. As a farmer and someone very concerned for the environment, I thought that they did a great job of explaining the relationship between animals and humans, and how we can save our beautiful earth without eliminating our precious farm animals. This film also explains the value of animal life, and honouring our animals after they sacrifice their lives for us, which I really appreciated. Thank you to the team behind Sacred Cow for this amazing documentary!"}, {"id": 109, "text": "This movie gives a voice to people who are hard at work listening to the wisdom of the earth and revitalizing the soil with smart grazing methods. I especially loved that it highlighted how raising cattle right can benefit malnourished people in poor countries and reverse desertification."}, {"id": 110, "text": "Amazingly..... political views of the farms and farmers were never brought up and for good reason. The director made sure to keep the movie on track about regenerative farming and the benefits to ALL planetary humans and the animals that inhabit it. At the end of the day this movie quickly encapsulates and informs us with no righteousness. It addresses the problem with agriculture today and how to help sustain it in the millenia to come!"}, {"id": 111, "text": "As a vet I found this film thought provoking in the way the information was presented. There was nothing that I was not already aware of but it does lay out the reasons for why agriculture and grazing animals in particular have a role to play in mitigating climate change and in biodiverse and regenerative systems. The farmers are not the villains, and we need to explain that climate cooling will not be possible without the farmers - they feed us and they are the custodians of the land we need to sequester carbon."}, {"id": 112, "text": "This movie was so well-written, well thought out, and beautifully directed. I highly recommend watching it, whether you think animals shouldn't be killed for food, or if you eat meat regularly."}, {"id": 113, "text": "We need more documentaries like this across all major streaming platforms. The true narrative must get out to the greater public."}, {"id": 114, "text": "Sacred Cow is exactly what's needed in this day and age where deliberate misinformation and lies about meat is so prevalent in society. The film lays out the environmental, ethical and health arguments of why meat is not only important but an essential part of the human diet in a way that is easy to understand for everyone. This film is truly a gem of information and I highly recommend it."}, {"id": 115, "text": "Great documentary, but would improve integrity by mentioning that several experts interviewed in this video are supported by or related to the meat industry."}, {"id": 116, "text": "No matter how old you are or what beliefs you have around food and environment, this piece asks the right questions. What a wonderful work!"}, {"id": 117, "text": "Hi Diana, Although the movie is made with lot of research &amp; insightful, it does not clearly give a particular direct message (no climax). It should clearly state meat &amp; meatless as sustainable with animals helping grow agricultural but at the same time, killing animals as a source of food should be minimal ( if not completely banned)"}, {"id": 118, "text": "The film was amazing. It just highlights how far we have come as a race. And what we can achieve if we begin to not for ourselves but the planet. I just hope we can achieve this vision. Because if we don't the human race won't survive. this film was really enlighting."}, {"id": 119, "text": "The production was very well-executed and engaging, and conveys valuable information for the bettering of humanity through proper animal husbandry. Very much enjoyed this, and highly recommend it!"}, {"id": 120, "text": "Eye opening information. I am going to be careful who I get meat from. Make sure it is grass fed. This film also inspires me to make my own farm someday."}, {"id": 121, "text": "A very balanced documentary, explaining how ruminate agriculture is part of a sustainable solution. It left me feeling very hopeful for the future of agriculture, and feeding our planet!"}, {"id": 122, "text": "Beautifully produced and covered the topic in a balanced and authoritative way. All vegans should watch it!"}, {"id": 123, "text": "Before I could even finish the film I was searching for local farms in my area to buy direct. This film has changed the way I look at food."}, {"id": 124, "text": "No hype. Just plain simple well executed truths by those who know that truth from living it first hand. My vegetarian days had me mostly in the depths of despair and depression. I grew up on wild meat and fish. It was the bigger portion on my plate at most meals on our family ranch. Guilt took me on many other food paths the wreaked havoc with my health. Good sense brought me back to what it was I most needed. All my meat is locally sourced. I know my food growers because I do believe when food is grown as it should be it will do me well. I look forward to the day when we will see more regenerative farmers bringing us a full spectrum of nutrient dense clean foods. Grateful for all those right now who are paving the way for others to do likewise and by doing so are pushing back on the food systems that have made so many people unwell. Clearly we can do so much better."}, {"id": 125, "text": "My son recommended this movie and I am so glad he did!! It was moving, touching and inspiring! I was moved to tears in some parts! It's a movement that I hope takes hold! When this film resonates with you - you can't not want to be a part of the regenerative movement!!! It a MUST WATCH!"}, {"id": 126, "text": "As a carnivorous environmentalist, I appreciate how this movie challenges our preconceived notions about the impact of cattle on climate. Amazing cinematography and editing but most important great storytelling."}, {"id": 127, "text": "The presentation shows motivation, sentiment and response of consumers and farmers, but does not highlight enough the interests of industrial commercial companies who profit from exploiting the motivation and response of consumers. Sacred Cow is genius title. It points out how plant based diet for the world ignores the sacred -- core of sustainable agriculture --regenerative ecology made possible by ruminants -cows. I consider this film fundamental for adult education and analysis; but it needs a prequel for children, addressing the cycle of life lived with integrity and respect as stewards and defenders of life on this fragile earth, our island home. Thank you! all who made this production possible."}, {"id": 128, "text": "This film was great in showing how we need better farming systems, and animals are an integral part of this. One thing I learned in particular was there is no such thing as vegan vegetables, as all farming practices use bone meal, blood meal fish emulsion to amend soils, especially those without animals grazing on them."}, {"id": 129, "text": "I learned so much from this documentary. I appreciated the intelligent humanistic approach. While the details were difficult to hear at times they were presented without gory visuals. It has also inspired conversation with Vegan friends! Well done!"}, {"id": 130, "text": "This is one of those films that should be shown in every school, catering college and to all involved in diet, nutrition and even climate matters. What's so great about animals? Watch the film. What can farmers contribute to our wellbeing? Watch the film."}, {"id": 131, "text": "Started the film &amp; soon others were watching along. The film ties it all together. I will be buying the book!"}, {"id": 132, "text": "Growing up on a sheep ranch, I would feel guilty seeing the mainstream media project that red meat was bad for health and the earth. I am so appreciative of the effort to get this current information out. If I would have seen this as a child, I would have probably went into sheep ranching earlier in my life. But now I am pursuing it later and life and very hopeful for the future of producing good meat, raised well, and the work being put into these animals being appreciated by the public."}, {"id": 133, "text": "What a beautiful film. I'd heard good things about it but was surprised by many things -- the loving attention paid to the art of butchering at the beginning (what a great beginning!), And hearing from ranchers around the world at the end was delightful."}, {"id": 134, "text": "It shows the true arguments for a sustainable future in agriculture and the vital necessity to eat and produce meat, in a human way. It also shows the dangerous lies of the food industry, which only encouraging malnutrition across the world... Indeed, being vegan is worse for the planet, and for you!! than having a healthy and balanced diet. Excellent explanations, excellent arguments, a whole lot of common sense, much needed in a world where the younger people are in desperate search of values and are being endoctrinated by the food industry, while what we all search is respect for the ecology and the environment. Share it without hesitating to your vegan neighbours, friends, colleagues, husbands, wifes, ... We need to teach this at school, and we need to hijack the endoctrination going on."}, {"id": 135, "text": "I found the perspective of regenerative farming very helpful and hopeful, providing a constructive way for us to look after and being connected to the land while reaping the nutritional and ethical benefits. A point for improvement would have been to see some more perspectives about the benefits of meat in our diets."}, {"id": 136, "text": "Our Health is connected to our food and how's it grown....this movie should be shown in schools and be a part of our kids education...I truly believe when we understand where our food comes from and how our Farmers can produce sufficient food for our planet and we support the process of Sustainable Farming that not only includes but needs Cows we can change how we view food and change our health ...From a Holistic Nutritionist"}, {"id": 137, "text": "A provocative and factual documentary that takes an in depth look at global food systems and potential solutions to a serious problem. Excellent. Well done."}, {"id": 138, "text": "Absolutely amazing! Must watch! The truth about meat and how it's vital to healthy living."}, {"id": 139, "text": "I enjoyed the doc and certainly appreciated the reminder that the decision to eat meat should not be based on the mass produced/farmed meat industry alone. I appreciate that in a holistic farming model, animals are a key contributor to healthy sustainable farming. I also buy-in to the argument that good quality meat can be part of a healthy balanced diet. I believe regardless of the diet you choose, ideally you would want to eat food thats been farmed ethically, responsibly and sustainably. However, that is a privilege that only a minority can afford and given the current reality that people want (and in many cases can only afford) cheap food, the current model of meat (and vegetable) production and processing is a big problem. Therein lies the conundrum for me...until we can transition to more humane and sustainable meat production, eating little or no meat is a better choice for the planet and for good health"}, {"id": 140, "text": "This film is much-needed and has been a long time coming. If you've been swayed by vegan propaganda-type films regarding the welfare of animals and the health benefits of plant agriculture (as I certainly was), you owe it to yourself and the well-being of our planet to watch this film. You'll see that the nutritional benefits of meat consumption are unparalleled by plant consumption, but most importantly, you'll understand that regenerative farmers hold the best interest of their animals close to heart. It is a beautiful, synchronized dance that can serve our planet and our own sustenance in a very sacred way. What a perfect title! I was moved to tears by the emotions and respect of the farmers for their livestock. Everyone should watch this, whether omnivore, carnivore, or vegan. Information is knowledge. This film will help you have intelligent conversations about our food supply and the way decisions are made in regard to food quality."}, {"id": 141, "text": "I very much looked forward to seeing this film. Overall it was very good. On the plus side it was a soft sell. The info was there but unless you were already familiar with the physiology and farming practices etc. I think the impact could be missed or at the least have less effect. I had hoped it would be more hard hitting but after viewing I changed my tune. Given all the hyperbole during the election I had had enough. I do wish however that more time would have been spent on soil destruction and the ill health of our society and the fact that our environment can be saved cheaply and effectively by regenerative faming and changing our farm bill to reflect on good farming practices rather than factory farming."}, {"id": 142, "text": "Could have improved by adding a little enthusiasm."}, {"id": 143, "text": "Thanks for the science, common sense and message that you send, it really wants to connect you to the most natural, sustainable and REAL way of living."}, {"id": 144, "text": "This is truly the case for better meat. It gives great insight on how meat can be sustainably produced and therefor how it should be produced. This is the way forward for the heslth of our planet and it's populatin. Great film"}, {"id": 145, "text": "Thank you to everyone involved in this movie!!! It is so refreshing and encouraging to hear these perspectives and know there are so many incredibly intelligent and passionate people out there advocating for real, nutritious food and sustainable farming practices. I have been recommending this documentary to others and hope it will make it onto mainstream streaming platforms. The information in the film is so important, particularly in this time of COVID-19 (and potential future pandemics) when protecting our health is especially critical."}, {"id": 146, "text": "The film just makes clear, that people in the city have lost contact with the countryside and do not understand where the food comes from. To me the scene where a factory using fossil fuel next to a cow grazing summarizes the whole issue why the cow is so important. I loved that representation. Big questions arise about nutrition policies and knowledge by the general population."}, {"id": 147, "text": "Not the first time I've seen films related to this topic, but there's always more to learn. This is a great companion to Kiss the Ground. I was especially interested in the comments of the former vegan. It was a perspective I hadn't considered before. Th as his so much for your passion and helping to educate those of us who don't farm but hopefully can write to government representatives at all levels to promote changes in Farm subsidies to encourage regenerative agriculture rather than monoculture agriculture."}, {"id": 148, "text": "This movie does a few good things, and does so skillfully in the movie. First, it shows how animals contribute to and benefit from the land. Farm country is devoid of animals running and pooping on the fields. We have the worst of both worlds, with chemical fertilizers replacing the animals, who themselves live cooped up on factory farms. The movie also makes the point that African communities need their animals for more balanced nutrition that comes from the animals concentrating nutrients through their roles as herbivores. Where the movie runs into trouble is a lack of integration of its concepts. The movie correctly says that western agriculture (and animal culture) is a disaster for the planet and for health, and declining in nutrition. But the movie does not state the obvious -- westerners need drastically less meat, and Africans and other less modern societies need more. The movie lovingly shows butchers that care about the animals and know how to make a plate of yummy beef. And it takes on a pretty dim view of veganism. But it needed to make estimates of what a good western diet should be, and answer questions about whether Atkins or paleo make sense, or should be just cut our meat consumption by half or more."}, {"id": 149, "text": "With all the misinformation on beef, this film is a must see for anyone who wants to be informed, especially those who adhere to a vegan diet. You are what what you eat eats! Plants cannot grow without animals and grazing animals are such a beautiful part of our ecosystem."}, {"id": 150, "text": "Preaching to the choir, here, really. I live in Te Waipounamu, Aotearoa in the middle of arable and livestock agriculture and feel that I am well informed. We've been mob stocking cattle for years. It only makes sense. On our property, weeds in the paddock are trull guardians of the soil. e certainly don't wast time, chemicals or diesel removing them. No arable farmer in the district doesn't run store lambs (in their thousands) on winter crops. I understand the NorthAmerican bias in the movie and I watched it with the rather jaundiced eye of a well educated human living in godzone. I know it isn't part of message of this great movie but a mention of human overpopulation wouldn't ave gone astray, IMHO."}, {"id": 151, "text": "The general public is so disconnected and under educated about their food. This film helps to make that connection and break down the misinformation. We have a long way to go but this is a good start. Our health and our planet depend on work like this."}, {"id": 152, "text": "Diana and crew really shoot it from the hip here. Risky subject, delicate delivery, big impact. Show to this to all of your friends and family"}, {"id": 153, "text": "Its good to have document that goes against this vegan agenda that destroys our health and enviroment. We come from nature, we belong to nature, make the nature the biggest part of you life, thats how we stay healthy and happy. Man-made ideas of how we should live dont go with what man needs to thrive."}, {"id": 154, "text": "A really fabulous film! It gives me hope that we can do so much more for this world we live in. It should be shown in schools."}, {"id": 155, "text": "Unlike cowspyracy etc this gives a balanced argument not just the facts to support your argument but all the information"}, {"id": 156, "text": "Amazing short film about the importance of proper land management and how we can restore biodiversity AND feed the world."}, {"id": 157, "text": "In a world where the norm seems to be films like The Game Changers and Cowspiracy which are light on facts and, well, science. It is refreshing to see a nuanced argument for sustainable farming which includes meat! Thanks for this well made and thoughtful film."}, {"id": 158, "text": "An intelligent and unbiased explanation of regenerative culture and the impacts of mono crops and industrial foods on the environment and humans. Sometimes people think they are doing the right thing, the most ethical thing but actually, their actions are causing more harm than they can even imagine..."}, {"id": 159, "text": "Timely and timeless, the premise of The Sacred Cow is to promote health. Health of the individual, the small farm, the community and the planet. Faced with such diametrically opposed choices about our diet and our environment, we owe it to ourselves, and to the planet, to try to mimic nature as much as possible. Mother Earth is a generous teacher, when we listen and learn."}, {"id": 160, "text": "Wow, this was a very well done Regenerative Agriculture movie that should be digestible by the masses.Well done Producer and Director, Diana Rogers, for taking on this complex subject. She masterfully delivered this topic artfully with the taste and consideration necessary to move the popular needle towards balanced stewardship and responsible permaculture.What a wonderful treat to see the familiar face of Joel Salatin delivering yet another calm, no-nonsense, reasoned message ready to resonate with anyone ready to listen. Hope and prosperity will abound to those that do through a medium a Farmer, not often found."}, {"id": 161, "text": "This film does a wonderful job of unpacking an important topic. I highly recommend watching with friends."}, {"id": 162, "text": "A beautiful film that provides accurate, up-to-date science about ruminant animals and climate change. And also providing a different point of view on nutritional science in a gentle way. I have been interested in sustainable agriculture for a while and I am very happy that there is now a film to provide that information."}, {"id": 163, "text": "Particularly enjoyed the inclusion of the global movement. Thank you for getting this conversation started."}, {"id": 164, "text": "The film does a good job of showcasing some of the environmental benefits of regeneratively managed livestock when grazed in an appropriate setting. It also contributes to the ongoing public debate around the ethics of our food choices by highlighting some of the false dichotomies that grow out of a disconnect between consumers and the food systems they both rely up and critique, while also showing how, despite wider criticism of farmers for failings of land stewardship and animal welfare, many of those embracing regenerative agriculture are driven by a desire to address exactly these issues..However, some of the good aspects of the film, were overshadowed by the attack that is mounted, on several fronts, against people who choose not to include meat and other animal products in their diets. As well as drawing attention away from the more interesting parts of the film, it also trades on over-generalisations, errors, and equivocations (an example of the latter being the strand of argument that turns around the claim that all life depends upon death).Ironically, a number of the central arguments raised in the documentary, including a number that form part of this 'anti-vegan' thrust, also work both ways - but the film's producers either do not notice this or choose to overlook it.Because diet is such an emotive issue, whether we're vegans (who the film target), vegetarians, omnivores, carnivores or whatever, that often becomes an important part of our identity, which can make it more difficult for us to accept evidence that contradicts the beliefs that are tied up with that, and make us more susceptibility to things like confirmation bias. Sadly a growing number of people within regenerative agriculture feel pressure to define themselves in relation to vegans (often a proxy not for activists who oppose the killing of animals, which would include many vegetarians as well, and members of the food industry pushing plant-based foods, ostensibly on environmental and ethical grounds, but in reality for purely economic reasons)..I do not feel that it is uncharitable to say that that is also true of those who made this film.The film rightly pushes back against accounts of the environmental impact of different diets that vilify livestock - and ruminants in particular - while failing to distinguish between those managed regeneratively and those in conventional, industrial animal agriculture. It also highlight some of the big problems with monocrop agriculture in non-mixed systems, when they are heavily reliant upon environmentally harmful inputs (fertilizers, pesticides, fungicides, etc.). But when it comes to cropping systems, it also fails to distinguish the good from the bad, the monoculture field-crop systems from the more sophisticated and environmentally regenerative permaculture, agro-ecological, agro-forestry or indigenous systems that don't necessarily incorporate livestock. We see a similar failure to think beyond the industrial agricultural paradigm in Frank Mitloehner's claims that you cannot grow crops on the two thirds of available agricultural land defined, under current systems, as marginal or non-arable - a claim which, anyone who has looked into the reasons that land is classified in the way it is, or has studied alternative and indigenous food systems, can see is clearly false..Finally, after deconstructing the narrative that red meat drives various health problems and rightly shifting the focus onto highly processed foods instead, the film goes on to include spurious and inadequately evidences claims about plant-based diets being de facto bad for people's health. Many people can get benefits from the inclusion of some meat in their diet, but there isn't really any solid data that shows that everyone's diet MUST of necessity include meat to satisfy their nutritional requirements, or to support Zoe Harcombe wildly exaggerated claim that, it's 'only a matter of time before something in vegans' health suffers'."}, {"id": 165, "text": "Don't forget to 'like' Ray's Paleo Pittsburgh on facebook!"}, {"id": 166, "text": "I would love to see this documentary watched far and wide, especially by youth who have not yet been brainwashed! It gives very good information and the down side of the current trend towards plant based meats that, if anything, isn't stated strongly enough. I felt there was so much good information in this documentary that I also bought the book, which promises to cover the issues in even more depth. I do believe regenerative farming can bring back the health of the land, and it follows that it will also bring back human health which has been deteriorating even in, or maybe especially in, the most developed countries. Thank you for producing this wealth of information!"}, {"id": 167, "text": "Regenerative Agriculture is the way forward and the answer to many problems throughout our world and societies... this film proves it with data, facts, and science!"}, {"id": 168, "text": "In this era of fake news, choosing your own reality and specious conclusions derived from epidemiology it is my hope that this movie reaches the wide audience it deserves. I don't think most people realize how broken our soil is because of industrialized mono cropping and that it's impossible to produce sustainable nutrient dense food without animals. If you believe that a plant based food supply is healthy, sustainable and environmentally friendly, Sacred Cow will challenge those beliefs with thorough and compelling evidence."}, {"id": 169, "text": "This film is a whole system, all things considered, enlightening and hope filled film that dives into the meat industry from angles that are honest on both the downfalls (industrial ag) but more interestingly, all of the benefits of meat to the planet and our bodies. It also tackles the ethical side of things that often is portrayed super black and white where in reality, there's soooo much grey space. Watched with my 8 year old daughter and it captivated her and challenged her to consider her meals and actually eat her dinner that night."}, {"id": 170, "text": "I appreciate the balanced view points offered in Sacred Cow. I watched with my 12 and 8 year old kids and thughtful questions were asked throughout. I think it was especially eye opening for my 12 year old because we discuss food quality and gardening often. She enjoys growing our own food in our backyard and our kids participate in taking care of the good we grow. I can't reccomend this film enough (that goes for nutivores, omnivores, and vegetarians/vegans). I would love to see this shared in the public schools. Will reccomend the film (and book) to our friends."}, {"id": 171, "text": "Diana Rogers has created a masterful glimpse into the broad topic of regenerative agriculture, from the nerdy science of the nutrition guidelines (and those woeful errors) to the inspirational stories of farmers and ranchers around the world. So many inspirational stories of ranchers who have turned around the story of their work, their land, and the future of food and farming. Yes the future lies in science, but not the isolated test tube, but rather the real life unfolding of how regenerative agriculture will restore vitality to the land and lives of the farmers and our food system. Bravo, well done! Applause! Happy Tears!! Grateful grins and hearty laughter. THANK YOU for making this film."}, {"id": 172, "text": "Well done ! I am a Health Practitioner in Functional Medicine and have been following Dr.Mark Hyman, Dr.Mercola and so many other experts for years . I am a firm believer of restoring agriculture to a natural state where animals and plants work together to give us the most nutrient dense foods while saving the planet . Loved how you put it all together in this fabulous movie . It was important also to have a discussion with an ex-vegan. So many vegans will hit their wall after a few years and realize only then their deficiencies and disorders due to their poor nutrition . We are omnivores and this will never change . Also , I was inspired and surprised to see how far regenerative farming is expanding here and throughout the world . Quite encouraging . Thank you 🙏"}, {"id": 173, "text": "This film is needed now more than ever. There is so much confusing and conflicting information out there regarding food, diet and health. There are moral questions posed by every diet. We can only make the best choice for ourselves when all information is taken into consideration."}, {"id": 174, "text": "Informative and more objective than many of them films over the last few yrs. My only critique is while I'm likely more informed then most, I do wish there was a little more science in this film supporting the importance of animal protien. Because this film is more straight down the middle, it would've been great to provide scientific truths to truly inform the public unseen in previous films."}, {"id": 175, "text": "This film is well produced and presents the information in an informative and entertaining way. I think that this should be shown in schools to teach the younger generation about the current state of agriculture, how we got here, and what we can do to address the fallout from our current system."}, {"id": 176, "text": "This film is SUCH an important documentary. I love how it de-sensationalizes extreme diets and dives into the complexity of nutrition and climate change. I only wish it were slightly longer and dove a little deeper into the science. Perhaps a future film could also talk about sourcing meat and the various labels that get places on meat (grass fed vs pasture raised etc).Thank you so much for this important film. I will definitely recommend it to many of my friends and family!"}, {"id": 177, "text": "As many decry climate change and blame cattle and other ruminants as contributors, this eye opening documentary offers the concept of regenerative farming not only as a way to halt the destruction of our soil but as a possible long-term solution to this global problem. Learning how this way of grazing actually sequesters carbon back into the soil was stunning. Seeing the farmers and ranchers advocate for more humane treatment of animals and their desire to move away from heartless mass butchering practices was encouraging. Watching well intentioned folks change their minds about these processes after gaining a fuller picture of the practices and hearing farmers' testimony about the inevitable cycle of life and death was so informative. There is something here for people on both sides of these issues. I kept on open heart and mind as I viewed wanting to hear from those working the land and raising the animals while seeking real change and answers to some of these very hard questions. High recommended viewing."}, {"id": 178, "text": "An incredible documentary! I have been passionate about human health and the environment and how these connect for most of my life. I am passionate about how humans have lost connection to nature and how this has lead to a decline in human health but also that of our planet. This documentary perfectly tackles these issues and the ending was absolutely incredible and gave me SO MUCH HOPE for the future of regenerative agriculture! Many people I respect in this film! WATCH you will NOT REGRET!"}, {"id": 179, "text": "A great introduction into a world of information that a lot of people are missing out on. I have been following Joel Salatin, Robb Wolf , and many others for several years, and try to spread the word to anyone that will listen. This film gives a great overview of this very important message. Thank you for continuing to try educate the world!"}, {"id": 180, "text": "For starters, this film is beautifully shot and thoughtfully edited. The sound editing and music are first rate. Subject wise, this film and its subject matter should be an essential part of any nutrition or agriculture curriculum."}, {"id": 181, "text": "I've known for a long while that I am a meat eater. I get very ill if I try vegan. I didn't realize that eating meat, if purchased from sustainable farms, would help heal our planet. Very logical movie that has caused me to do a lot more research into this subject. I'm finding and reading studies that have been done. We are also going to start changing the way we shop to buy more from local, sustainable, farms."}, {"id": 182, "text": "I love how this movie has point of views from all sides. It's a great watch and I think it should be required in schools. It's so scary what we are doing to our earth and its amazing how much misinformation is out there. This movie puts the information out there without any dogma or shame to any group. It just shows perhaps a different perspective of what people think to be true. Great work!!"}, {"id": 183, "text": "I really enjoyed the solutions following the problems they addressed in this film practical and I love that many other farmers are jumping on board to ditch industrial ways of farming and turning to regenerative. Awesome film!!"}, {"id": 184, "text": "I found this documentary extremely informative on the subject of the food chain process and how with modern farming our foods are no longer what they once were before the use of GMO seeds and fertilizers which have drained our farm soils of the basic nutrients our bodies require for good health."}, {"id": 185, "text": "I have solved all of my many health problems from eating a high fat ruminant diet in the past 6 years including hypothyroidism, metabolic syndrome and pre-diabetes. So this movie was preaching to the choir.However, I never knew about 'regenerative' farming and the importance of ruminants to ecology and restoring the Earth to her former glory. Humans with good intentions have allowed deserts to grow and the quality of food to diminish.This film could be the kickoff to many sequels. I had never considered the malicious aggressiveness of many vegans to be devolution, but it is. I love it when someone comes along and puts my thinking back on the right track."}, {"id": 186, "text": "I thought that this movie was beautifully made, BUT, also very slanted in one direction. I would have liked to see more scientific proof against the theory that meat is bad for us. Just because it was done for thousands of years doesn't mean it's the right way forward. Also, the ex-vegan claiming about back issues due to diet, I would have liked more info on why this happened. And also why some do thrive on vegan diets, while others have issues.I know, and think most of us know, that processed food is not the most healthy choice, and while the idea of using a more sustainable and regenerative farming method sounds good to me in theory, I would have liked to hear more about the downsides to this type of farming. I for instance worry about the scalability and global affordability of this."}, {"id": 187, "text": "I am so grateful to the meticulous fact finding and checking in this film. This is an essential education for so many."}, {"id": 188, "text": "This film makes a powerful case for eating animals raised the way nature intended. There has been an ongoing debate between those who believe in a plant-based diet and those who tout the benefits of meat. Lost in this debate is a discussion of the quality of the meat, it's nutritional content, and the value allowing animals to express their true nature. People who believe that eating meat is inherently bad for the environment may think twice about the root cause after watching this film, especially because there were such a wide range of credible experts interviewed."}, {"id": 189, "text": "This is a fantastic watch... truth... no lies. Take a fairy step back and look at the reality... my fav quote is about modern foods create modern diseases... of course they do!"}, {"id": 190, "text": "This film shows clearly how agriculture and the climate are linked in a way that many people do not understand due to years of misinformation. It shows that ruminant animals (cows, goats, sheep, bison, etc) are key in restoring land, capturing carbon, and providing food in the only sustainable way. The film debunks myths we've been told, like meat is bad for the environment and is unhealthy. Excellent interviews and visuals to bring these messages home. Thank you for making this film!"}, {"id": 191, "text": "Amazing documentary.Great to see the truth come outCongratulations to all involved"}, {"id": 192, "text": "There's hope. So often, we only see and hear doomsday messages. This film not only provided insight and perspective on the underlying issue of evil, greed and the mistreatment of animals. It also offered a solution to help heal the earth. Loved it!"}, {"id": 193, "text": "Not my steaks, the preview. While they are preaching to the choir here, I have to say after watching this that I wish I could order my meat from them. I didn't see anywhere online that they ship. Am I correct? Keep up the work. There are thousands of us carnivores behind you!"}, {"id": 194, "text": "I'm skeptical of documentaries that fear-monger and play on your emotions. This provided facts, and hopeful stories and ideas for cows can be a part of regenerating the world that we've been destroying. A must watch!"}, {"id": 195, "text": "I have read the book as well, but found the film much easier to grasp and appreciate the diversity of sources that this film covers.All food involves death, it is about choosing that death wellSeeing the changes in soil that regen agriculture can cause was really cool."}, {"id": 196, "text": "This film was less pro-beef propaganda and more truth about the simple fact that nature is smarter than we are. It uses the beef boycott scenario as a pointed example of the wisdom in following nature's lead to a better, cleaner, healthier, simpler way to live life in a more sustainable way. Kudos to the folks who invested time, energy, and money to share this truth!"}, {"id": 197, "text": "I think this documentary makes it plain to see that industrial plant agriculture is not good for the environment and that regenerative animal agriculture actually helps the environment recover. This matches my first hand experience having gone to hundreds of different farms across my country. The cattle farms I go to feel like a more natural environment with many different creatures making it their home. Monocrop farms are quiet and the only life seems to be the one plant that the farmer planted in his ploughed fields, every other animal or plant is an enemy to the farmer and is a problem that they want to remove. I wish the documentary could have shown the sugar cane farms I have been to. They do have small animals running around in the dense underbrush between the cane stalks despite the farmers best efforts to remove them but when they burn the field for harvest, all the animals get burnt to death in a ring of fire and it creates a huge column of smoke that can be seen for miles. I saw at least 10 of these columns everyday for the whole month I was working in sugar cane country. Now that can't be sustainable."}, {"id": 198, "text": "I really liked the documentary. It addresses two very important points: Beef as excellent nutrition, and cattle (and other ruminant animals) as the only method of healing the earth. If you care about the topics of nutrition and the environment, then you would like this documentary. Further, I'd recommend reading Alchemy of Air by Thomas Hager, Dirt, the Erosion of Civilizations by David Montgomery, and Peter Zeihan's books."}, {"id": 199, "text": "Good intentions and appeals to common sense and our better nature but.... lacks details and arguments on how we move forward from our current position of industrialised agriculture. Issues like how do we bring about the capital shift needed (without draconian enforcement); what are the downside risks (e.g. can we effectively feed the world with this approach or will we potentially risk plummeting the world into food wars). All forms of change will produce unexpected results and to ignore the possibility has and will lead to disaster. Perhaps another film is already in the making or conceptualised that addresses these issues an allows for a broader and more nuanced discussion."}, {"id": 200, "text": "I couldn't help but think when I was watching Sacred Cow just how important this film actually is. The fact that it was a beautiful film and very well done was icing on the cake. The concept of regenerative agriculture and how that is necessary for the future of our global food system is not something that we hear talked about often. Also, the idea that so many of us are removed from nature and where our food comes from, and how that causes a lot of ignorance was a very gracious take on such a polarizing issue. I highly recommend Sacred Cow to meat eater and non meat eater alike. Great job guys!"}, {"id": 201, "text": "Thank you to Diana and Robb for making this much needed movie and to everyone else that contributed. I loved that you linked all the environmental, health and political factors together and did not shy away from the issues that still need to be addressed. I really hope this opens the eyes of the general population and vegan / vegetarians that consume their foods without any thought of its impacts. My only negative is that I would not have opened the movie with the butcher and images of meat. I feel this will put some people off and they wont get pass that first scene and then will miss all the very important information explained in this beautiful documentary. If you could recut the first section and put it towards the middle when the couple are talking about the vegan protestors and start with the mass cropping scene/section that would be a much gentler introduction."}, {"id": 202, "text": "Not only educational, but well made. Both my boyfriend and i enjoyed watching it."}, {"id": 203, "text": "The best thing I've watched this year. If you care about how our food (plant or meat) is grown and its impact on our earth then this is for you 👏🏼"}, {"id": 204, "text": "This movie was beautifully done and spoke to the truth about regenerative farming and how ruminant animals are part of keeping our world healthy. My dad was a soil conservationist for over 30 years, and I remember him being so passionate about helping farmers to improve their soil. He passed away last October and I know he would have enjoyed this movie and would have hoped this message spread far and wide. I also loved the scenery and focus on compassionate farmers. Definitely pulled on the heartstrings but was not overboard on drama. Well done!"}, {"id": 205, "text": "This was a great movie for challenging commonly held beliefs that meat is bad for your health and even worse for the planet. I've always felt vaguely guilty for eating meat, eggs, dairy etc, but I've tried both vegetarian and vegan and gained weight and felt sick. Definitely going to look into sourcing grass fed meat after watching this movie."}, {"id": 206, "text": "Ms. Rodgers does an excellent job of giving a well supported narrative of the current state of raising, slaughtering and eating animals as well as some of the topics around the impact on our environment - ancestral/evolutionary role of ruminants in the human diet, how ruminants play a key role in the natural cycles of life and diversity of species, the role of farmers who recognize that the industrial system has many shortcomings (to say the least), how regenerative farming is key to restoring our lands and providing farmers with the rewarding lifestyle they have led for generations (my family were farmers), the nutritional benefits of eating meat and more. It is my hope that people who see this film will walk away with a sense of how it's not about meat vs veggies, but rather how we treat the land, how we respect the animals that nourish us, and particularly, that we must follow the science in these matters. The corporate media's portrayal of these issues is severely lacking or misleading at best. This issue is so important and this film will give you some quality information to chew on. ;-)"}, {"id": 207, "text": "All vegans, meat eaters, farmers, and the environmentally conscious should watch this. Hopefully we can make the world a better place. Loses one star as a couple of things weren't explained deeply enough for me, eg the cow gases vs fossil fuel gases. That seemed more like a theory than scientific fact (whatever that is - as we know science often is wrong primarily due to scientists wanting to be right and advance their careers / cause)."}, {"id": 208, "text": "This documentary touches everything that's important from every viewpoint. If you have even the slightest curiosity in how meat should be in the future, this is a great starting point."}, {"id": 209, "text": "I believe that every person vegan or meat eater should watch this film. I think it has a lot of great things to say. However, I feel it could have gone more into why meat eating is needed for this framework, as well as, more in depth into why meat eating is healthy/required. Maybe the book goes more into this. I would have liked to see more on dairy farming, as well."}, {"id": 210, "text": "As a functional nutritionist, I see a lot of problems in our food supply. So much so that it is overwhelming to think of how we can overcome the mess we find ourselves in as a society that is sick and leaving the world much much worse for the next generation.This movie gave me hope because we see the stories of real people that are making an impact in sustainable, regenerative farming. Bringing a movie like this to the public is key to the awareness we need to make changes that better our health today and the health of our collective future."}, {"id": 211, "text": "This film explains how the cycle of life works. Or how it is supposed to work. Ethical practices, regenerative livestock grazing... We can, WE MUST, do better. Get educated. Educate your children because factory farming, corn, and soy will kill us. Working with nature and the land will save us."}, {"id": 212, "text": "So clear and concise : how to heal the planet. why vegans cannot get rid of animals to have the earth covered in veg. they need to learn. How to rebalance the soil and the ecosystem. a very good film that all young people must watch for a better understanding on how they can change all lands for the better."}, {"id": 213, "text": "This is a must see for anyone considering going vegan. This is a must see for anyone who knows we need to change our food system. Just watch it! It is a must see!"}, {"id": 214, "text": "Sacred Cow clearly explained the details concerning the role cows and other ruminants play in our food chain and in the balanced ecology of the world. The film gracefully avoided upsetting scenes from factory farms and slaughter houses. It also was genuinely respectful of vegans. I highly recommend it if you have questions about cows as a food source or as contributors to global warming."}, {"id": 215, "text": "Excellent series of points outlining the benefits of a food subject that appears to have been short-sightedly vilified."}, {"id": 216, "text": "Great documentary..a must see for farmers and food consumers. Farming practise has always evolved..change is part of farming and will continue to be. Sacred cow brings together the knowledge and how to apply it to farm sustainably."}, {"id": 217, "text": "This movie is a great starting off point for learning about the basics of regenerative farming, some of the issues with Big Ag created just in the last century, and what some farmers are already successfully doing. It's beautiful to see how younger folks are turning toward a truly regenerative farming system -- indeed a return to how it was done since the agricultural revolution until recently. I can also recommend this film to individuals interested in including more meat -or simply better meat- into their diet and lifestyle. This movie is a great watch for friends and families to spark deeper-level conversations about what we purchase, why, and what our purchase is supporting. Overall, I enjoyed the film Sacred Cow. It gently grazes the surface of topics covered in depth by the book. If you haven't read the book, that's truly where all the magic is... and where the sustainable and environmentally-friendly green-washing of is revealed. If you watch this film and feel something spark inside of you, Buy The Book. You won't regret it."}, {"id": 218, "text": "I really enjoyed this movie. I felt that its depiction of the beef industry is quite accurate, and it truly compels me to personally be a part of the solution on my own property. The days of depending on the meat industry to do the right thing are over, and I was greatly encouraged to see that there are meat processors in America that try to do the right and humane thing. I hope that if we all come together across this country, we can bring about change. We want better, and we can do better. We have pioneers who are forging the path before us to prove this."}, {"id": 219, "text": "There's a right way to do something in the wrong way to do something. When it comes to human interactions with nature, the right way to do something aligns with nature as closely as possible otherwise the consequences are numerous and profound. This movie shows the right way to address the meat situation so it doesn't cause an environmental catastrophe but helps prevent it."}, {"id": 220, "text": "Really great watch and so so important for our generation and those to come"}, {"id": 221, "text": "I had the good fortune to watch a sneak preview of this movie about a month ago. I re-watched it again this weekend. This story is one that is rarely told by big media or any social media. Our view of food, food production, farming, and land management as severely skewed as a collective species. Rarely do people know where their food comes from. Rarely do people understand how deplorable factory farming is. Rarely do people understand how wonderful animal husbandry and regenerative agriculture can be for us and our planet. This movie is a companion to the book of the same title. I promise you and anyone who watches or reads will not be disappointed. Excellent work by all involved in making this excellent film and book."}, {"id": 222, "text": "Because of this movie I am motivated to seek to purchase foods from farms which practice regenerative farming and I am motivated to produce more of my own food as well. I will encourage the farmers I know to watch this movie and to implement regenerative practices. Perhaps there is hope for saving our land after all!"}, {"id": 223, "text": "Aside from the bad and misleading dietary advice we have gotten for years about red meat, this is also a powerful statement on how the common assumptions about its environmental impact are also wrong. A strong and balanced corrective on the real impact and potential of cattle farming on the environment. Beautifully filmed, this was also a surprisingly moving presentation on the potential of responsible meat production to help heal the environment, especially in allowing us to hear the global voices of real farmers, butchers, meat processors, etc..., dedicated to ethical and environmentally sustainable practices! A terrific documentary!"}, {"id": 224, "text": "This documentary has come, not a moment too soon. It craves a much wider audience, particularly amongst our (international) political leaders, and especially amongst the supposedly woke celebrities. As you suggest, schools &amp; centers of learning generally, are important targets. Question? I am UK based, if I contribute to further funding, will that be reflected in the spreading of this important message locally/worldwide. Thank You!"}, {"id": 225, "text": "What an eye opening documentary regarding a topic that brings strong feelings about from many. I whole heartedly believe this way of regenerative agriculture is the only way forward without killing the planet, the animals and humans. It brings up so many good points and gives people a sense of how they can help by supporting the correct farms with their purchases. Way to go!"}, {"id": 226, "text": "A must-watch for anyone who eats food, animal or otherwise"}, {"id": 227, "text": "My family has been raising cows for 110 years on non-arable land on the high plains. Thank you for sharing the story behind how bovine animals can improve the environment and feed the world. I wish all people who decide their food choices on 2 minute sound bites from the media, would take the time to watch this impactful movie."}, {"id": 228, "text": "It was very informative and makes perfect since. Loved the fact its stresses the importance of the quality of our food, not only plants but animal as well. I do hope this does get into our schools."}, {"id": 229, "text": "There is so much bad news about the environment, and this lovely film is refreshingly orientated towards a better farming future. It gently nudges the vegan movement off the environmental moral high ground but does not present information as dogma or doctrine. My favourite bits were seeing the desert in Mexico become fertile again, and Lierre Keith talking about lettuces and slug murder."}, {"id": 230, "text": "This cleverly constructed documentary fills in a lot of gaps for me in the arguments for regenerative agriculture and the rearing of animals and the eating of meat. The explanations are clearly presented and the results of how successful, carefully managed landscapes, using domesticated grazing animals, can dramatically improve our sadly degraded soils in many areas of the world. Areas specifically that would be unsuitable for arable farming. This film fills me with hope that we can start to restore the health of ourselves, our soils and our planet by managing the way food is produced in a more regenerative manner. Shared and shared and shared."}, {"id": 231, "text": "I watched this film with great interest as I am a nutritional therapist practising in the UK, who is constantly seeing clients who have gone vegan for myriad reasons and are finding it really hard to stay optimally healthy. I have always adopted a nose to tail ethical stance to eating meat and find it incomprehensible that an ancestral diet, produced ethically and eaten fresh, local and in season can posibly be the cause of either chronic disease or ecological damage. It is so good now to have this balanced and accessible view of the discussion to give clients (and students) to watch without personally becoming part of the argument. Not only that, but it is a joyous and uplifting watch. Many thanks."}, {"id": 232, "text": "I found this documentary so informative I shared it with my family, who said they enjoyed it as well. I'm committed to eating locally and seeking out sustainably raised meat. I appreciated the explanation of regenerative agriculture and the demonstrations of how rain water is held into the soil when it is done correctly."}, {"id": 233, "text": "Absolutely loved this documentary. These days it's hard to find positions that are not either at the extreme end of being plant-based or full-blown carnivore. This documentary shows the importance of both plants and animals and how we can preserver the cycle of life. I wish there we were movies like this where people could learn the real, unbiased important facts without all the emotional attachment that drive extremist views."}, {"id": 234, "text": "This is a great film. Presents the facts clearly in a methodical and apparently unbiased way. Counters the myths regularly voiced about vegans and animal husbandry. Everyone should watch it Thanks. Great work"}, {"id": 235, "text": "People need to see this. It is eye opening and far from the narrative we have been given."}, {"id": 236, "text": "A very good feature of how better processes are needed not isolated diets. Everything exists for a reason, and everything in moderation. This goes for sugar, fat, fruit, vegetables and meat. They are all needed and this film lays out why. Grab some beef jerky, a beer and sit back and get ready to be informed. Well done Diana and Crew. Thanks"}, {"id": 237, "text": "Very worthwhile viewing.It shares sizeable overlap with similar works - notably 'Eating Animals' by JS Foer of which there was no mention (I have not read book that accompanies this film). Surely too the seminal the work of Temple Grandin merits more than one cursory mention? Am worried the film presents itself as the definitive work in a long movement that is actually a collection of like minded works in a developing movement."}, {"id": 238, "text": "Being humble, having respect for natures law and live our lives with respect for the eco-system is a balance that needs to be met. The film tells that story really well, not aggressive but informative. With real people struggling with the real issue of sustainability. It all interconnects and we as a species can only so long disrubt these laws before it will all correct itself. I love the cattle and I love my meat, I love the regenerative and the sustainability. A film everyone should watch!!"}, {"id": 239, "text": "Although I am already aware of most points in this film im happy to see that they were very sensitive to the beliefs of other points of view and stuck to the facts. Also it was interesting to see from a whole world perspective not just from a western view."}, {"id": 240, "text": "We have been disconnected from our food we take it for granted. This movie brings it all back. Literally made me cry to see how connected we all are."}, {"id": 241, "text": "I hope this movie will not just preach to the converted, it's a very good overview and will hopefully be shown widely enough to help the simplistic Plant Based answer to health and saving the planet. Biological systems are complex and nuanced and this movie gives some great examples of this."}, {"id": 242, "text": "A documentary taking the opposite view to the wildly commercialized and financed vegan movement. Offers a unique perspective as to why humans are herbivores and should simply stay that way for optimal health."}, {"id": 243, "text": "This film did a great job of keeping a balanced view without bashing anyone's dietary choices. I can see how it will be triggering for some but if you can put your ideology aside and really listen, you'll recognise how important this work is and how much meat eaters and non meat eaters are singing from the same hymn sheet. We will achieve far more working together on what truly matters for the future of the planet, and indeed the human race."}, {"id": 244, "text": "I was never on the fence of the meat versus plant debate but the idea of meat being bad for the planet and our health and plant's were much better didn't seem scientifically based in reality. I purchased the book end gave it a read through and the authors really gave me a clear picture of what really happens to get our food from the farm to our plate. What it also tells you is how ruminant animals help aid in land conservation and soil regeneration which aids in reversing climate change. What I really appreciated about the movie is how it debunks the idea that being a vegan is morally superior, when a lot of these people who mean well, don't realize all the things that have to die, the plants included in order for them to eat. What I really appreciated about the video is that it makes the case for better, ethical meat production, and how this can help keep us healthy why feeding us, and conserve the planet."}, {"id": 245, "text": "A thoughtful effort to share why animals, in particular cows are being demonized on many fronts. While the fact that we have evolved and thrived due to our consumption of meats is indisputable, processed food businesses have benefited by blaming animal fats and meats for all matter of ills - environmental and health related. All aspects of food production demand examination at this point - meat included, and this film explains how well managed grazing and animal husbandry practices exist and are being revitalized across the planet, highlighting the benefits that animals have always provided to the life-cycle. It's a great and optimistic film created with deep respect for those asking that animals be treated with respect and dignity. The passion behind the vegetarian and vegan movement has its roots in compassion - but nature will always demand what it demands. This film reminds us that we need to shed the hubris that disconnects us from our intimate relationship with planet Earth and her workings."}, {"id": 246, "text": "When my oldest child was in HS, his Health teacher forced the class to watch 'An Inconvenient Truth'. While that mockumentary was full of self-serving lies and pleas to one's emotions rather than intellect, 'Sacred Cow' offers an insightful presentation of a renewed approach to addressing our failing health, destructive agricultural system, and misunderstood causes of climate change (which has never happened before in the 4-6 billion year history of this planet). Every student should watch this, as our youth will be either the harbingers of doom or catalysts of positive change. My only change would be to more deeply highlight the seed and pesticide companies behind our catastrophic monocropping and the severe damages they've caused our farmers and environment. I'll take cow farts over Monsanto's Glyphosate every day of the week."}, {"id": 247, "text": "A wide-ranging explanation of why farming animals is actually a good thing (when done right) for the soil, carbon reduction, and human health. Reviews misconceptions that can lead people to think that only veganism or vegetarian can be good for the planet and good for your health. Good information, interesting interviews with experts, and engaging stories."}, {"id": 248, "text": "This movie was very easy to watch. It was very pleasant and informative. The visuals were very good. I've been interested in the topic for a long time, and certainly a fan of Joel Salatin, and I still learned some new things, especially about the use of land for cattle."}, {"id": 249, "text": "For a documentary this movie didn't leave me depressed after watching. Potentially the most important info for the food system in my lifetime. It can't really be argued that meat isn't vital for its nutritional value, but the moral issue of industrial meat production is what creates conflict. Can't argue with returning agriculture to how it was in the first half of the last century, especially if it produces more income for the farmers and returns land to usability."}, {"id": 250, "text": "This film showed beautifully the value of regenerative agriculture. It also debunked so many myths around meat consumption and farming. I loved how it not only showed regenerative farms and how much benefit they gives the environment but also how traditional farms are able to make the switch to regenerative. My favorite part was how the animal's last day should be just as kind as the rest of their life and the value of humane slaughtering and showing reverence to the animal for giving it's life for our nourishment."}, {"id": 251, "text": "This excellent documentary shows the real cause of agricultural climate emissions and cattle have little to do with it. Poor farming practices that allow widespread soil degradation and loss of carbon and microflora in the soil is the real problem. This films shows that there is a solution that we can use right now."}, {"id": 252, "text": "Full disclosure: I am a PhD level agricultural scientist. I am sympathetic to the regenerative agriculture movement. I think this film does a decent job of explaining that animals are part of natural nutrient cycles. I also think that people should know that livestock can be raised on land that is not suitable for other forms of agriculture. Where the film fell short for me was addressing the methane emission issue - I think this issue was glossed over. Evidence does exist that raising livestock using regenerative methods can at least break even with respect to carbon emissions. But overall I think the film is a great contribution to the debate about meat vs. meatless diets, and regenerative agriculture. I think that vegans can be a little divorced from reality, which is that all animals kill to survive. This film makes that point especially well. Another tidbit: I was a vegetarian for 15 years and I believe the diet destroyed my health. Some people, because of genetics, make poor vegetarians and I am one of these people."}, {"id": 253, "text": "A unifying examination of our dilemmas, and a hopeful exploration of our future potential. Drawing on decades of research, millennia of history, and the intricacies of individual human experiences, this film points a way forward that we can all feel good about. Plus, lots of wonderful cinematography."}, {"id": 254, "text": "Thoughtful, thought-provoking, enlightening, objective, fact and science based; humanistic and unflinching, it generally avoids politics and political grandstanding and instead is pro-animal, pro-environment, pro-humanity rather than being against exclusively plant-based nutrition. It is respectful rather than arrogant. Should be essential viewing in high schools and colleges. See it and urge others to."}, {"id": 255, "text": "This excellent film gives a clear and understandable explanation of how nature actually works, and by how following the path of regenerative agriculture we have a way to restore environmental balance. It covers so many aspects of the meat question - ethical concerns, environmental concerns, human health concerns - with sound science and a compassionate view. Highly recommend for all citizens!"}, {"id": 256, "text": "Watch this film. Very interesting and inspiring! Learn about environmentalism that makes sense!"}, {"id": 257, "text": "Unlike so many grand global schemes to save the planet, this approach to integrated and regenerative animal agriculture is intensely local and pragmatic. We need this information to counter the faddish plant-based craze that is so environmentally destructive. Well done, Diana and team!"}, {"id": 258, "text": "The Sacred Cow is an excellent movie, that shows how agriculture, environment and nutrition are all closely related. This is all done using from an objective perspective based on science. It is not a one-sided movie that takes sides. It also uncovers how the industry and large companies are steering the public into certain directions.Robb and Diana did an outstandig job with this movie. The movie is not only showing what is wrong with the current food system, but it also provides a solution that is science based and sustainable."}, {"id": 259, "text": "A very nicely done adjunct to the book. I would recommend everyone who has not done so to read the book."}, {"id": 260, "text": "We need more films like this...super information and mind opening. should be a required watch for everybody. touches on controversial themes - diet has become so tied to personal identity - without directly vilifying anybody, simply attempting to open our eyes."}, {"id": 261, "text": "This movie should be a must see for everyone who cares about their health and cares about the environment. Their is an answer to our Worlds health problems and the environment that is being destroyed. If you are a Vegan please watch with an open mind, ethical Omnivores and Vegans have a lot in common. I have recommended this to some of my congress and senators members. It really is a deep dive into the world of Agriculture and Farming."}, {"id": 262, "text": "I'm so glad I watched the film. I thought I knew much of the information already but I was suprised to find out that I still had a lot to learn. The film presents the different viewpoints intelligently and thoughtfully. There is so much misinformation floating about. This movie beautifully and eloquently clarifies the issues and makes a case for a more hopeful, sustainable future."}, {"id": 263, "text": "The movie contains extremely important informations, which are contrary to mainstream narrative. The message is science based and delivered with understanding and compassion to those who disagree. Sacred Cow introduces planty of different people involved in food production in various ways. I'm recomending to watch the film to everyone who is interested in healthy food from any perspective, including ethics, ecology and nutrition."}, {"id": 264, "text": "I have watched many 'documentaries' and read several books on this subject, and can say this is brilliant. A calm, intelligent, educational movie on why we all need to work together for the good of our planet. Will definitely recommend to my friends who tell me cows are ruining the planet. Will definitely watch it again myself."}, {"id": 265, "text": "If you care about our nature and animal life but not sure how to navigate in the whole environmental debate watch this for perspective."}, {"id": 266, "text": "This film does a beautiful job of exposing our opportunity to recreate a healthy food ecosystem. It does so in a way that shouldn't alienate anyone who's listening with an open mind. Your health and your planet will thank you for watching. It's that important."}, {"id": 267, "text": "Really enjoyed this film. As a small scale beef farmer from Great Britain that uses grazed grass for the majority of feed I was beginning to despair at the seemingly never ending drip drip of meat is bad coming from the media and other vested interest organisations. Especially knowing that pretty much all the figures used by processed vegan alternative companies to try and vilify red meat are reached with some pretty creative accounting. Sacred cow presents a balanced, easy to understand approach to explain how and why red meat is good for us and the planet if done correctly. Should be shown in schools as part of the curriculum in my opinion."}, {"id": 268, "text": "I saw the film and it was awesome. A lot of good info passed in a kind and professional way. Well done to you, Rob and all others involved in the film."}, {"id": 269, "text": "So refreshing to watch a movie without bias. This documentary presents common sense information and scientific facts. We have lost our way in the last 100 years with agricultural farming and extremist food cults and the food industry trying to push their agenda on us. I'm so happy to see that logical, common sense ideas are beginning to prevail."}, {"id": 270, "text": "This is a very interesting and thought-provoking film, well put together. My only criticism is that it does too little to address the more intensive meat rearing practices which are abhorrent to meat-eaters and non meat-eaters alike."}, {"id": 271, "text": "Finally someone telling us the truth about how we can restore and live in harmony with nature. Very well done, captivating and educational. Must watch! Thanks Diana and Robb!"}, {"id": 272, "text": "We need more films like this to publicize this very important message. My daughter, who has a passion for animals, wanted to explore the path of becoming a regenerative farmer after seeing this. That's quite an endorsement."}, {"id": 273, "text": "Very important perspective to spread in this day and age, showing the faults of going too extreme in any direction along with these ideological diet movements. This shows a balance of the best of both worlds here: maximizing nutritional intake while also minimizing the long-term negative effects on the planet. Hopefully these ideas continue to spread!"}, {"id": 274, "text": "For 30 years I've gone from being a vegetarian, vegan &amp; currently a pescatarian; &amp; while I've never really cared for eating meat because of taste, &amp; texture, I SO appreciate the sustainability and awareness of the farmers around the world to choose something besides raising their herds &amp; driving them to a huge, inhumane slaughterhouse. And while I'd NEVER eat 'regular' meats raised in horrendous conditions, I can at least appreciate the love and care these farmers put into their farming practices: both the animals and the fields."}, {"id": 275, "text": "My girlfriend and I watched the movie last night. I run an Ecology Center &amp; Farm School in New England and also am a health coach / personal trainer. I have long awaited this film, which does a wonderful job of introducing an ecological and science based argument for regenerative agriculture! This film will be one we show to older summer camp and farm school students for many years as we teach the principles of environmental conservation, homesteading, food security, and optimizing human health while healing the planet! Also looking forward to recommending for my health coaching clients who hear nothing by processed and plant-based from the big food marketing machine!"}, {"id": 276, "text": "Beautiful way to show a problem that concerns to us all. I watched it yesterday and I am still thinking about the topic..."}, {"id": 277, "text": "Finally... another view on meat. With nuance, science-based, ... everyone who wants to have an opinion on the subject should see this film. Very well done. I am looking forward to more of this !"}, {"id": 278, "text": "Several years ago, I listened to a podcast about a senior farmer from Africa who said that the problem with ruminants wasn't their existence but their management. This movie confirms that in spades! We've been eating mostly meat for a few years now, mostly local ethically raised and slaughtered and our health is great. We verbalize our gratitude to the animals at every meal, realizing that we are part of the chain of events attempting to live in harmony."}, {"id": 279, "text": "I loved the film. So much that I didn't know and now I need to learn."}, {"id": 280, "text": "Brilliant view on the industry everyone loves to hate. A reasonable and import voice to be heard."}, {"id": 281, "text": "Well explained and comprehensive considering you don't have a lot of time to get it all said. Especially the part in the story visiting a 3rd world country where it's explained that you can't treat these people so inconsideratly and take away their access to animal products and just assume that their lives will go on unchanged. There is way too much interference as it is"}, {"id": 282, "text": "The evidence overwhelmingly proves we need to start looking at history to move into the future. Our planet and our people are the sickest they have ever been. Such a measured, considerate doco, without judgement or blame. Education is the key, from the farm gate to the supermarket shelf. When will our leaders and politicians have the guts and determination to mandate and support changes. As consumers we have the power to choose the products we buy, and drive change as an end user. This is the information we need our kids to be learning in schools."}, {"id": 283, "text": "I enjoyed the film and appreciated learning about all the different resources it takes to create fake meat which is clearly unsustainable. I have been inspired to visit my local butcher and create a relationship with them, who in turn, have a relationship with the farmer and the cow. If I can begin to cut out all of the people in between (plus fossil fuels and chemical companies), I think I I will really be eating the sacred cow. I don't eat a lot of meat now, but this is all making sense ! I recently took a permaculture course and Im taking a soil advocacy course. Several professionals, scientists, historians, environmentalists, etc are beginning to say the same thing, It is not the Cow, it is the How. We should all eat less meat in general and say a prayer! Cycle of life. Using holistic management is the ONLY way to continue with good manufacturing in agricultural practices. Well done and Thanks again!!! I hope this film is well received and wakes more people up. Im on board."}, {"id": 284, "text": "Sacred Cow and Kiss the Ground are arguably the two most important documentary films of recent times. They need to be seen by more people - especially vegans!"}, {"id": 285, "text": "This film manages to be both entertaining and informative while tackling a very important and controversial subject. So refreshing to learn actual facts instead of propaganda! I highly recommend this to everyone, hardcore carnivores and vegans alike. The bottom line - we need to know where our food comes from and how it is produced, and we need to care about that. Thanks for making this film."}, {"id": 286, "text": "Things I already knew or thought about before I saw Sacred Cow:A) factory farming bad b) sustainable farming good c) presently, whole foods are best for humans d) plenty of people cannot live nutritionally optimal lives on vegan diet, but some can. Genetics? Unknown. e) should we regularly kill animals, to feed humanity, if there were a perfect nutritious alternative - even if killing animals in the most humane way possible was perfectly sustainable?Things I thought about having seen the film:1. In Defense of Paleoesque Diets - While Kresser and Wolf are, imho, well respected paleo research warriors, having mostly them two, plus the single woman with the health problem / vegan conundrum, is a tiny sample - but I realize it's tough to cram all that data driven stuff into a 1.5 hour movie.2. While I really liked the footage of Joel Salatin using multi-animal synergistic mobbed grazing, him flipping out over Beyond &amp; Impossible burger got kind of conflated in there with the idea of 'lab grown meat'. The majority of humans probably don't know that there is a race to produce true 'meat' from cell cultures right now, in a lab, that is biologically as identical to actual meat as possible. This is different from the conjurings of veggie-style-processed Beyond &amp; Impossible Burgers. He's right that from a sustainability standpoint, the Beyond &amp; Impossible Burgers have the same problems as any other veggie grown thing, but the cost of true lab grown meat, while presently super huge, is something that scientists are trying to overcome. Would it be safe? Unknown.3. I know this movie is about why having sustainable animal raising &amp; eating is good for humanity, and there is mention of monoculture = bad, but surely there is some other type of veggie-based food growing option to consider. Hydroponics?4. Sort of feel like the movie should have been called 'Sacred Grazers' instead of 'cow'. : ) Although I presume this is because there are places cows can graze nutrient content from that other animals cannot - like the gentleman who did the cool paper folding demo of total Earth land that (according to him) cannot be used to grow anything else, plus the benefit to the land as a result of their grazings vs say, pigs or chickens or antelope."}, {"id": 287, "text": "Sacred Cow is a refreshing look at our food systems where meat, specifically beef, is concerned. The agenda is the health officials our soil and bodies. They bring nuance back to the discussion, and their slogan, it's not the cow, it's the how perfectly exemplifies this. Sacred Cow is a powerful course correction in a world of misinformation around meat and the environmental impact or ruminant agriculture."}, {"id": 288, "text": "I will be sharing this incredibly thoughtful and insightgul movie with friends and family."}, {"id": 289, "text": "What a terrific film! It is extremely well done. I think it is respectful of vegetarians but provides evidence and arguments how agriculture that incorporates animals can be ethical, productive, healthy, and good for the planet."}, {"id": 290, "text": "This really is a must watch for anyone concerned about their health. This is a non political very intelligent non offensive look at all aspects of what people put in their bodies. One thing that stood out for me was the lack of nutrition in school lunches and the effect it has on our children. I grew up on a dairy 40-50 years ago. There was no rotational grazing, just feed the cows, milk the cows. I'm sure if the science were around back then our country would not be in the condition it is today. It's not all doom and gloom however. The silver lining is that it doesn't take long to for the environment to heal itself if we take care of it.Thank you for this intelligent, informative show."}, {"id": 291, "text": "I'm so glad I watched this film. If you're wanting to expand your thinking while doing your part to heal the earth; this film will fit the bill. I especially enjoyed seeing farmers explaining how they feel about the current sate of affairs and their hope for the future. Highly recommend!"}, {"id": 292, "text": "Loved this documentary. Was actually surprised at how it came across regarding animal cruelty and the need to farm and ranch better."}, {"id": 293, "text": "I grew up on a dairy/hog/chicken and later beef farm that used many regenerative practices during the 70s and 80s. But also witnessed the chemical revolution that occurred and the race to produce greater yields. The race that led to less crop rotation, greater Fall ground prep, removal of fence lines to optimize land usage, much greater run off and ditches filling up with premium top soil. Feet of topsoil washing off into the creeks and rivers. Destruction of pheasant habitat by removal of sloughs and fence lines. I saw local farmers running into greater debt to keep up with the production race and even suicides in the great dairy collapse because of the ridiculous government programs that are still in place. I am glad someone produced a documentary with this content."}, {"id": 294, "text": "This film brings to light issues that are seldom discussed on a broad scale these days. It illuminates the lack of connection with our food that prevents us from making sensible decisions about what to eat, and provides solutions for that problem. It's kind, it's balanced, it's truthful and so full of hope. What a labor of love by the creators; I am SO grateful for this film."}, {"id": 295, "text": "Sacred cow does a great job at reframing the polarised mindset that plants are good and meat is bad. The world is not black and white and this docu takes the viewer by the hand and gently but clearly leads to that insight. It makes a strong case for the crucial importance of returning to regenerative agriculture. Well balanced and enjoyable to watch."}, {"id": 296, "text": "Thank you for a thoughtful facts-based documentary with farmers/supporters of food and environmental sustainability giving very personal yet global messages of hope to those of us who have intuitively known that ruminants have an important part to play in a sustainable ecology and that our part, as farmers, is to engage in sensitive management with these fine animals, of our precious land resource. We very much hope you are able to get this programme out to as wide an audience as possible. It has given us hope."}, {"id": 297, "text": "It was remarkably refreshing to see this movie, telling stories of human lives as well as animal lives through the lens of a greater interconnected collective. I found it deeply moving to have elements of emotional poignancy tied to the very real lives of the humans and animals portrayed in this movie combined with the scientific knowledge and insights shared by many working to solve the nuanced and complex issues around sustainable agriculture. The movie instilled a resolve that we must come together to help solve these deep ecological issues, independent of one's personal food choices. No matter the ratio of animal to plant foods one chooses to eat, the film adeptly illustrates that our answers to these ecological challenges requires diversity, with inputs from all forms of life."}, {"id": 298, "text": "This film gave me hope in these seemingly dark times. It so nice to to see counter narrative to the plant based movement but also to see how actually the vegan and the paleodiet fades actually agree on 90% of the motivations for changing their diets to be healthier and more sustainable."}, {"id": 299, "text": "I was very pleased with the movie and it's cinematography. Alan Savoury could've been mentioned and a bit more focus on international project than just the U.S. Except these minor critiques it was a very well made informative movie that is gonna save me lots of discussions about the basics of regenerative agriculture and the vegan propaganda regarding sustainability in the future. Well done!!!"}, {"id": 300, "text": "His is an important film that needs to be seen by the population! It gives such good information about the way we raise and process meat. It was so thoughtful, and thorough for the whole process, including agriculture production! Everyone should watch this film!"}, {"id": 301, "text": "Great film, very informative and a nice counter to the mainstream Vegan/ big agri corp propaganda!!"}, {"id": 302, "text": "This documentary was very well put together! It was enlightening to learn about regenerative farming and will be beneficial for both sides to learn! I appreciate all you have done and hope this documentary makes it to the big screen!!"}, {"id": 303, "text": "Very well done documentary! Do you know what you are eating? This film gives hope and inspire farmers to join this way, the nature way!"}, {"id": 304, "text": "The best film I have seen in a long time bar none. Such a great contrast to all of the You must become vegan for the good of you and the planet view point. I am sure there will be the nay sayers and try to strip the value from the film, but the message is so clear. I am have been in the food industry all of my working life and heavily involved in food development. This is the most impactful, meaningful content I have seen for years. Well Done Diana and team."}, {"id": 305, "text": "This film does an outstanding job of exposing the truth about how animal products contribute to human health and the proper raising of animals contributes to the health of our ecosystem, much to the contrary of what 'plant based diet' (ie 'vegan') proponents claim."}, {"id": 306, "text": "Sacred Cow is a very informative documentary that corrects several misconceptions about animal agriculture. I viewed it as an animal scientist who taught 23 different animal agriculture courses and performed animal experiments over a 29 year career. Upon retirement I wrote a textbook on Horse Pasture Management. Now I am teaching a course in Sustainable Practices in Agriculture. I have highly recommended Sacred Cow to my students. It is unfortunate that I don't have time to fit an 80 minute video into the three weeks left in this semester. Next year I will make it required viewing. It really helps answer the difficult question of how and why we should continue animal agriculture as part of new efforts in sustainable and regenerative agriculture. It might be a little long for some viewers. Very well done."}, {"id": 307, "text": "I love this film. It contained all the information we need to create a better world. If one is interested in nature, the environment, happy animals and healthy food and a more natural life style, this film is a must-see. Love seeing grass-roots movements growing and having a positive impact on our world."}, {"id": 308, "text": "For most of my 65 years, I have avoided meat for health and environmental reasons. It's nice to finally see the other side."}, {"id": 309, "text": "The one chance we have to feed our hungry, save our own health and the health of our planet is through regenerative farming. Sacred Cow gives us a closer look at what we can do to make it happen."}, {"id": 310, "text": "For anyone really interested in the wellbeing of our planet, animals, their own and their families' health...all the important knowledge is in here! Highly recommend watching with the whole family and sharing it with everyone you know!"}, {"id": 311, "text": "Loved the film because it stressed the need for a biological approach to land management and showcases how important and ancient animal husbandry is."}, {"id": 312, "text": "In these highly acrimonious times it takes real courage to produce a work that refutes politically correct conventional wisdom. With Sacred Cow multiple mythologies are challenged and systematically refuted. Instead we learn about the incredible benefits to the environment and human health of managed ruminant grazing and consumption of the wholesome animal products. The film relies on men and women around the globe who have devoted their lives to the study of human health and to the practice of management intensive cattle and sheep grazing. Their real world experience contrasts starkly with the vacuous reporting and hysterical commentary on the myths of red meat consumption and the purported evils of cattle. I recommend that this film be given the maximum exposure possible, including in all of our schools."}, {"id": 313, "text": "One of the most important films to see, ever. As we realize how the earth works, and the importance of ruminants to the planet, its climate and our health, we become stronger and improve the earth. So few of the population really get it even though it's critical to survival. So many are spouting misinformation that damages the planet, the climate and people's health. I will try to get as many people as possible to watch this movie."}, {"id": 314, "text": "I am not an expert or professional in any field relevant to agriculture or nutrition, however, both of these topics have been of much interest to me for many years. As a proponent of functional medicine and whole living, I cannot express enough how important I think it is for more professionals like Sacred Cow creator Diana Rogers to create accessible content that sheds a clear light on the perceived issues around eating red meat, as well as the very real issues with modern agriculture. I have been following Ms. Rogers' work for some time now and found Sacred Cow to be an informative and equally inspiring production which I think can (and should) make an impact across the nutritional world. Sacred Cow is approachable, factual, very well researched, and deserves the attention of anyone striving to see a clear view into one of the most important issues faced by world health today. I will definitely recommend and share among my friends."}, {"id": 315, "text": "Beef is extraordinarily nutritious and the best food suited for 2/3 of agricultural land. So The goal is to transition how it's grown to regenerative grazing, which apparently could produce 30% more beef than current demand without even needing any of the corn and soy fields. This makes so much sense! 9 stars for the information!"}, {"id": 316, "text": "This is definitely a though provoking and should see movie for everyone. Our future generations need to understand how the earth needs to heal and what we can do to help this process. It is such an important subject."}, {"id": 317, "text": "This documentary is a must-see for those who think we are being told the truth when we hear over and over again that meat is bad for health and bad for the environment. And for meat eaters, it may be hard to face the cruel truth about how a factory farm raises and slaughters the animals we eat, but this is a necessary awareness if we are to see widespread reform in how we raise animals for the food supply. There IS a better way, as this film so clearly shows."}, {"id": 318, "text": "Once again we as a society find ourselves miseducated, misguided and filled with false beliefs construed intentionally by by business, in this case big food. This is a beautifully crafted movie, well thought out and explained without bias."}, {"id": 319, "text": "Everyone needs to see this film. This needs to be shown in school rooms"}, {"id": 320, "text": "Really good very informative. Great film. Will watch it again soon."}, {"id": 321, "text": "The movie brought a respectful, balanced view to this debate. It didn't shy away from the real underlying conflicts to the issue. Yes, there is shared, common ground between the those who wish to eat meat ethically and those who would abstain."}, {"id": 322, "text": "Definitely Makes sense on how things used to work and how things should work,,have a watch yourself :)"}, {"id": 323, "text": "Amazing to actually hear the truth:)) Everyone on this planet should watch and pay attention"}, {"id": 324, "text": "Hits all the topics on this issue. She is correct about a non-meat community and their beliefs about not killing animals which I respect. But some of us like animal meat and if we are going to eat meat let's raise and process them humanely and save the planet. Let's make America healthy with food and the environment."}, {"id": 325, "text": "Wow, what a brave &amp; balanced documentary - very well presented! Thank you Diane &amp; your whole team of collaborators. This is positive &amp; responsible education. I know I'll be sharing this with those close to me &amp; know we will all learn so much from it. This is definitely going to help me make informed decisions and take correct action in my daily living &amp; future endeavours! Many thanks - your efforts are truly appreciated!"}, {"id": 326, "text": "There is nothing more important in life than family and health. This movie addresses the dilemma of how to fix our broken, unsustainable food system, as well as highlighting what proper eating entails, which just happens to align with regenerative farming practices. This film is so important, that everyone should view it, it should be required in schools to educate the next generations, and government bureaucrats should heed the warnings and lessons it provides. If we don't wake up, the environment will continue to degrade, humans will continue to experience a decline in health, and we may reach a point where we can't fix things without losing a significant part of the population. I for one choose health and embrace the lessons in this film. They are that vital for all of us. Highly recommended!"}, {"id": 327, "text": "I was waiting for this doc-film! I loved it! It is able to explain important and complicated concept in easy, logic, scientific and understandable way. I think every person, vegan-vegetarian or not should see it...but people with a vegan lifestyle has to watch it. It switches on many lightbulbs ! The is far more beyond what peolpe may think to know about the environment and animal cycle..there is to much superficialities in regards to this and this film has the capacity to clarify it! I follow the work ok Diana Rodgers and Robb Wolf since a couple of years and I appreciate everything they bring in the know. Thank you for this huge work! Rock on!"}, {"id": 328, "text": "This isn't an in-your-face guilt documentary but a well-reasoned rebuttal. It won't move the needle for those already deep in the vegan/vegetarian camp but may help those being pressured to give up meat to due their own research.Remember the anthropological record has not found (at least to this date) any strictly vegetarians in our human ancestors and ancient societies who relied heavily on grains, show evidence of poor health. If your health depends upon taking supplements to augment a limited diet, how exactly is that considered better? You don't eat meat because bad for the earth yet support a massive fossil-fuel powered supplement industry. Bit of irony?"}, {"id": 329, "text": "The discussions of regenerative agriculture are spot on.But the film loses persuasive power by unnecessarily digging in at vegetarians and vegans. It's not a matter of fact, it's a matter of framing. If you're looking to convert people, don't poke at them."}, {"id": 330, "text": "This really needs to go mainstream. I would like to see it on Netflix so everyone can view it. A realistic solution to the worlds food problem which also maintains the worlds health and the environment. Fantastic effort."}, {"id": 331, "text": "Because this film takes a more nuanced, balanced approach to the discussion on meat consumption, it likely won't get the headlines and viewership that many sensationalist health documentaries have in recent years. But it absolutely deserves them.Understand that this film isn't just about proving that eating meat is good. It's not an attack on vegans. It has a much more thoughtful and complex argument than that. The film is about saving our health and the planet from the dangers of processed foods and industrial monocultures. It's about respecting the principles of ecology and finding unique solutions such as regenerative agriculture to restore our soil and our health. I found the message to be extremely compelling, and I hope that viewers who are vegan or vegetarian will have an open mind to the ideas presented!"}, {"id": 332, "text": "An important message delivered in a beautiful film. A must see!!!!"}, {"id": 333, "text": "An ambitious attempt to reveal the solution to food and health sustainability for the future. The second half of the documentary was particularly interesting and informative. Great to see that the concept of regenerative agriculture/farming/health is catching on all over the world. A huge topic that deserves a follow up effort. I hope you feel inspired to produce a sequel 🙂"}, {"id": 334, "text": "What a surprise to learn more about regenerative agricultural and soil conservation. A real eye-opener that held my interest throughput in offering a new perspective. I highly recommend spending a little time to learn from this beautifully created film."}, {"id": 335, "text": "Great documentary. It moves at a good pace and covers its material in an interesting way. Sacred Cow presents the facts without demonization of opposing viewpoints. Regenerative agriculture is our only hope! Great way to understand the ethics of a meat based diet."}, {"id": 336, "text": "This is a compelling watch, highlighting as it does, the contrast between industrialised destructive agriculture &amp; regenerative practices that are completely sustainable.What really enthralled me though, was the extended post film interview with the ex vegan who once she had investigated for herself, discovered things weren't as black &amp; white as often portrayed. She is very frank about how a 'religious' adherence to veganism &amp; seeing life only through a vegan lens has cost her dearly in terms of her health."}, {"id": 337, "text": "Good, pretty moderate take, they acknowledge some people do well on vegetarian, and multiple times that people should eat more plants. Felt pretty fair, wish it could have had some more studies (especially on carbon/methane cycles) rather than stories but maybe that's what the book has. My take away is manufacturing and industry are great for most things but not our health and biology; we are a 2 million year old machine and if we want to run optimally we have to feed ourselves what we are evolved to eat."}, {"id": 338, "text": "Well done documentary with a powerful message. Balanced approach to saving our planet and the health of the people, while demanding ethical treatment and gratitude towards the animals that provide our nutrition. I have asked all the people in my life to watch this film now."}, {"id": 339, "text": "Film goes deep on debunking the mainstream narrative on nutrition and the extreme dysfunction of modern agribusiness and the horrendous treatment of animals. It does a beautiful job showing how we fix decades of soil destruction with ruminant animals, treating animals humanely while rebuilding the family farm. Net/net - they beautifully illustrate that regenerative agriculture is the (only) path forward for mankind"}, {"id": 340, "text": "Having been on a keto diet for the past three months, I'm very much a carnivore, so I found this film very informative, infact, eye opening in many respects.The environmental issues raised were clearly addressed. I wasn't sure what to expect but the film held my interest right to the end. Full marks is the least it deserves."}, {"id": 341, "text": "Subj: an incredibly important documentary Thank you Diana and Robb for sharing the science of food and agriculture in a world now where most of this has become a belief system. Just yesterday Trust for America's Health reported yet another increase in obesity among adults and children. This is a curve we have not yet flattened. We need to reinstitute real foods into the schools and revise the dietary guidelines based around traditional food which is unprocessed and comes from local farms in plant and animal variety. It takes courage to go against the grain so to speak but I applaud your courage. Mark Cucuzzella- professor at West Virginia University School of Medicine"}, {"id": 342, "text": "Brilliant film, gives reasons for optimism for us all. Slightly too long perhaps... Needs to be seen in every school in the land, to counter the false narrative peddled by vegans, and #TheGreatReset."}, {"id": 343, "text": "In a world of separation, desperation and an ideological focus labeled 'sustainable', driven by money and profit rather than awareness, the world desperately needs this documentary. Very professional and down to earth."}, {"id": 344, "text": "What a great movie. Just pure educational facts with no negative spins. I appreciate all of the hard work that went into the creation. As a Functional Nutritional Therapy Practitioner, I admire all of the experts who are featured in this film. Thank you for all of your hard work!"}, {"id": 345, "text": "A fantastic introduction into the multi-faceted world of regenerative agriculture, and the flow on effects it can have on our world and our health. If you are a human that eats food, I highly recommend you watch this film."}, {"id": 346, "text": "This documentary presents very well what some of us have been advocating. Regenerative agriculture is the way to go to produce healthy food for humans and animals, and to heal our severely polluted environment due to toxic chemicals everywhere. Every vegetarian and vegan should watch this film to understand why they should not condemn us omnivores and impose their way on others. This documentary ought to be shown on mainstream media."}, {"id": 347, "text": "Enjoyed watching and listening to some known farmers like Joel at Polyface Farms and learning from new ones. This information needs to be shared with all on this world 🌎 Let's save it one farm at a time/"}, {"id": 348, "text": "So good! What an amazing animal for the health of humans and the environment. This had me ready to move to some acreage and start my own little farm. So inspiring and thank you to all those farmers out there working their asses off and doing everything right to bring us high quality, nutrient dense sustenance."}, {"id": 349, "text": "I'm from NZ and pleased many of our farmers have good practices and grass fed cattle"}, {"id": 350, "text": "This is quite possibly the best, and most important food/agriculture/environment documentaries ever produced. It easily explains the importance of properly produced meat for the ecosystem and our nutrition. Watch this."}, {"id": 351, "text": "A film that's been badly needed for some time. Very useful in helping people better understand how proper farming practices need animals to build productive ecosystems that improve the quality of our land and our health. There is so much misleading information on the health aspects of eating meat, the need for animals to build healthy souls and improve our environment. This film does a great job leveraging many leading experts in these areas such as Allen Williams, Joel Salatin, and Mark Hyman."}, {"id": 352, "text": "This documentary reaches deep into our life on this planet, well beyond departure points of nutrition, farming, food production. It questions the very essence of our existence or rather co-existence with all other beings. I came away with a deep sense of peace and hope listening to other people sharing their life journey and vision. I know deep inside of me they speak/live from that place, common to all of us, where the life meaning comes from, where it can be accessed for real. I thank all who produced this film and cared to share this truly good news with the world, with me. It is a confirmation of what I know, the encouragement in my own journey, a proverbial cup of cold water offered to a traveler."}, {"id": 353, "text": "I appreciated the solutions non-guilt proactive orientation of this documentary.It was done smartly &amp; even if I have been in the health industry I learned a few things and have even more appreciation for the intelligence of farm productivity going towards the health of the earth.This was a very needed documentary, thank you!"}, {"id": 354, "text": "Shows all angles on the benefits of regenerative agriculture, the science and why the world needs this shift in agriculture so much."}, {"id": 355, "text": "Sumed up perfectly what is wrong with today's culture of consumption. More people need to watch this. Reconnect with nature"}, {"id": 356, "text": "Beautifully produced and highly informed. It's great to see more of this information coming up to the surface. Thank you so much for this work."}, {"id": 357, "text": "Could have done maybe with more vegans (or ex-vegans) who maybe didn't have such severe health problems as the woman in this film, since I think it might make a difference whether you adopt this diet in later life or in your teens as she did. However, I loved it, and will try to get the vegans in my life who are committed to their diet on environmental or 'non-exploitative' grounds to watch it. So far I've avoided arguing with them, but this film really made me see that how much information they're missing. They're really privileging the big animials over the small (to say nothing of insects!), and not acknowledging the land disposession of humans who need to raise animals in places where edible plants don't grow very well. I hope this gets a much wider audience."}, {"id": 358, "text": "I was a vegan for 10.5 years until a few weeks ago. I thought i would be a vegan for the rest of my life! It started with me listening to podcasts on Wise Traditions. I was led to believe that it was the animal products that are causing cancer, heart disease etc... However after listening to podcast after podcast and now after watching Sacred Cow I am 100 % convinced it is the opposite of that. Its the fake food, the lack of much needed nutrients the dangerous oils that are causing the illnesses. The confirmation for me was watching this film. I have such a huge appreciation for farmers now more then ever. I can eat healthy pasture raised animal products without feeling guilty. It makes leaving the vegan lifestyle so much easier for me. Thank you so much for all the hard work that was put into the making of this film and the vital information that viewers need to hear. Everyone should watch this film! God gave us animals and when they are cared for properly He blesses them for our bodies health and sustenance. Thank you thank you thank you!!!"}, {"id": 359, "text": "Well done - such a good representation of the facts of life :-)"}, {"id": 360, "text": "First off to fellow animal lovers don't worry this film does not get into graphic animal virus and it is not propaganda to sanitize factory farming, which the creators fully support as inhumane. This film is groundbreaking and well documents our engrained misperceptions about meat ie ruminant animals who live good lives do not cause cancer to eat and everything' you have heard about cow farts killing the earth is false. We cannot survive as a healthy ecosystem with monocultures that have no meat and yet we see oligarchs positioning to have us eat GMO meat and heavily processed  magic meat riddled w glyphosate etc. Wake up and watch this brilliant doco"}, {"id": 361, "text": "Great production and people are showing respect for the animals and the value of the ecosystem. I totally agree that we need the biodiversity and be connected to what we eat. As a vegan myself I got disappointed in the vegetarian girls story that I don't feel is representing the majority of people's experience going plant based."}, {"id": 362, "text": "I knew that this film would be well researched and produced and, after viewing, I am happy to say that the end result is beyond impressive. Wonderful cinematography is paired with a well constructed story that shows how and why regenerative farming is so important for our food supply and for our planet. Essential viewing for anyone who cares about good nutrition, the environment and how sustainable and ethical livestock farming fits into the overall picture. Congratulations to Director and Producer Diana Rodgers for bringing your vision to completion!"}, {"id": 363, "text": "Pretty good film, well worth the watch. About time the sympathetic farmers and the all natural meet producers have started a fight back. I've been waiting some time for this, the vegans have been stomping all over the propaganda front while we sit and do nothing. It highlights that there are good people out there, small farmers doing the right thing. Nice balance of scientific detail with enjoyable easy watching."}, {"id": 364, "text": "I grew up on a farm over 60 years ago and I'm pretty sure we didn't have to deal with these issues... We were a meat and potatoes kind of family, growing our own fruits and vegetables... I've spent years eating processed foods and it has really harmed my health. I've been eating carnivore for 7 weeks now and have begun to heal from severe inflammation in my joints and my asthma has greatly improved!! It saddens me to see all of the plant-based fake meat in the market. Plant food has become inedible to me because of food sensitivities... I'm grateful to the farmers and all those helping keep the cattle industry going."}, {"id": 365, "text": "I feel this film is an accessible means to discover the truth of food and farming. It touches on the history and the inherited system borne of war in the last century last century. The film compassionately describes what needs to be done with farming, globally, to ensure food and water security and the film shows that we have what we need to significantly tackle the climate emergency, through the intelligent management of farmed animals used to improve the land, with all the benefits to the ecosystem this represents. Well worth watching."}, {"id": 366, "text": "The reason why I give it a 10 star is because this may be the most important topic we all should be talking about . And sadly there is a huge division between vegan earth defenders and the people in to regenerative agriculture. I tend to say no one has to eat meat if it's not feeling good for them abs their path in this life . But we need animals for a closed cycle of growing food . I've been studying this information fir a few years now and in a time where do many things feel hopeless at times , this gives me hope and strength to keep on going . Thank you for putting all this work in to this movie . Now I want to do the best I can to share this information with farmers here in Northern California.."}, {"id": 367, "text": "I LOVED this film! You clarified so much for me...so much of what I suspected, but had no evidence. It really hit home when one farmer noted he realized he'd best learn to grow animals since every vegetable he had ever grown needed animal byproducts to flourish. And that the once rich earth of the plains didn't get that way with years of growing kale. Wow! Thank you for your commitment to bringing this crazy world back down to ground."}, {"id": 368, "text": "Finally, the whole story I've been waiting for someone to tell. This film sums it all up, and shows a realistic way forward for our planet and for our health."}, {"id": 369, "text": "Thank you for getting out this message in an entertaining and professional way and adding to the re-education of America and the world."}, {"id": 370, "text": "Interesting and should be watched by those interested in nutrition and the world food problem..."}, {"id": 371, "text": "This documentary came just at the right time. The vegan propaganda is slowly eroding the planet from farmable soil and this film offers a quick and natural solution.It's truly a breath of fresh air watching this film. It leaves you with a feeling of hope and puts into words what you have already known deep inside. Definitely worth a family watch-session, especially with the kids to help explain how important ruminant animals are for the well being of not only people but the planet as well. Wonderful job!"}, {"id": 372, "text": "We need to go back to the basics of what stewardship means. A great film with a balanced view. Plants and animals are to be raised together for our good and that of the planet. Helping people young and old to have thriving sustainable farms benefits everyone."}, {"id": 373, "text": "Enjoyed the highlights of working farmers, and insights into where &amp; how our meat comes from. Great commentary from doctors, vegetarians and butchers. It's very eye opening on the 'behind the scenes' of what farmers are trying to do/the right way. Most of us have no idea of the struggles. Thank you for creating &amp; sharing this!"}, {"id": 374, "text": "A good documentary/movie showing the important ecosystem relationships. Great job by everyone involved, laying down some truth about factory farming, monocrop ag. and cattle management vs. regenerative agriculture methods. Going back to basics, back to the origins on how we used to take care of the land and the animals. A must watch for everyone out there!"}, {"id": 375, "text": "I knew long ago that this type of ranching and farming was possible, but it saddened me that no on was doing it. NOW I have hope!!! Regenerative Agriculture is spreading. This is one piece of what can make it possible for humans to not destroy Planet Earth. We still have to move on industry and transportation, but without upgrading our food production, the others can't happen. Thanks for regenerating my hope! Gratefully, Stephanie"}, {"id": 376, "text": "This movie was really informative and it didn't seem to have a hidden agenda. I appreciated the testimonials and the scientific research that was presented. This is definitely a must see no matter what you believe about meat!"}, {"id": 377, "text": "This documentary is very insightful and bring to the surface many issues and solutions for the poor sourcing and sustainment of our food."}, {"id": 378, "text": "I thought it was a great documentary that details what is happening with regenerative culture! I believe that as consumers we must adapt our consumption habits towards more environmentally conscious ones. Congratulations!"}, {"id": 379, "text": "Great documentary! Highly recommend everyone watch it."}, {"id": 380, "text": "Regenerative agriculture so much more than I thought and how important it is for the health of our planet! I loved the interviews of the farmers, experts and the people selling the products. I, myself buy organic, grass-fed beef, pasture raised poultry and eggs. It's very important to me, how the animals are treated, before I eat them. Vegan propagandists needs to understand that the production of vegan food items, kills all types of animals.Thank you, for all the work that went into the making of this movie and spreading the truth!"}, {"id": 381, "text": "I watched the entire movie and my husband joined me for the final half hour. His comment was how honest and thoughtful the issues were presented. We have always enjoyed eating meat - especially beef - but until the past few years never really thought about the impact of commercial industrialized farming.As retired seniors living in an urban area - I must confess that budget has influenced our choices more than quality &amp; sustainability. It will take some sleuthing and effort to find sources of healthy &amp; sustainable yet affordable meat &amp; produce. Not always easy for city seniors!"}, {"id": 382, "text": "A good overview of a complex industry. Honest,thought provoking, non judgemental. It enables viewers to add to their understanding, introducing them to different aspects of animal agriculture."}, {"id": 383, "text": "Definitely a must watch for anyone interested in farming, the environment, nutrition and concern for animal welfare. This documentary is a welcoming side dish to the excellent book. I would liked to have heard more from Diana herself, and more about the nutritional case for meat, however the film was overall very informational and an easy watch."}, {"id": 384, "text": "I read the book before seeing the movie, and I loved both! Even though we're in a time filled with worry and needing change, this movie is surprisingly feel good and left me feeling hopeful for our future. I want to watch it again and show everyone I know!"}, {"id": 385, "text": "This film is so beautifully and responsibly done. It provides the balanced information we have needed to make an informed decision about eating meat. It proves that there is a better way to provide meat to the world that not only does not destroy our environment but actually helps restore it. Thank you to everyone on the team that produced this film and please continue your efforts to get the truth out to the world."}, {"id": 386, "text": "This was such an incredible film and one I hope everyone watches! I have been waiting for the film To come out after watching interviews with the filmmaker and reading their book. I really appreciated the balanced approach to meat and the conversation about sustainable and ethical farming. My 8 year-old daughter ended up watching it with me which I think is also important as we start these conversations earlier with our children. Thank you for the time and effort you took to make this film. I also loved the female representation in the film which was focused on farming ! Nice work!"}, {"id": 387, "text": "Really enjoyed watching this Film it was not boring at any point. Such a great look into whats wrong with our opinion of meat."}, {"id": 388, "text": "The film is a very accessible companion to the book; it covers the same arguments but with fewer numbers and detail to support its case. That said it is a very well argued and presented overview of the compelling argument for regenerative agriculture and the indispensable role that livestock should play in our food system and diets. It is a careful and high quality production with short but effective participation by some of the key protagonists of the LCHF movement. All in all a very good way to seduce skeptics and even, maybe, change a few minds."}, {"id": 389, "text": "Such a powerful and moving film. It filled huge gaps in my knowledge and will certainly help me to articulate what I feel/believe about these issues. The book is ordered!"}, {"id": 390, "text": "A lot of this information was known to me being a paleo advocate, however it is fantastic to have all the info in one place with visuals. Really well done and I hope the message is spread quickly."}, {"id": 391, "text": "A must watch for everyone on this planet if we are going to move in the right direction to save this planet."}, {"id": 392, "text": "Well researched, providing balanced viewpoints from both sides of the eating argument and back with solid scientific evidence, this documentary gives sound reasons for why regenerative agriculture as the only way forward.IF you are a meat eater, well raised meat is better for you and the planet. IF you are a vegan, well raised meat is better for the planet."}, {"id": 393, "text": "So much good information about why it's important to eat meat. I watched with my kids (12 and 9) because many of their friends have become vegetarians and I wanted them to understand why it's important to eat correctly raised meat. They learned a lot! They had a lot of questions (which I love) and I'm buying the Meat Curious additional videos now."}, {"id": 394, "text": "While I found the balanced non-aggressive approach appealing, considering how aggressive the vegan community can be towards meat-eating supporters, I expected it to go a little bit deeper into highlighting the science and research that backs up its main points. 1) animals are an integral part of the soil cycle, and therefore of all the food production and 2) that animal products are not only not bad for your health but also essential. Very well produced as well."}, {"id": 395, "text": "Addressing the oversimplification applied in documentaries such as Cowspiracy. Makes you truly realise there is no harm free way of eating and that it is the path of least harm overall that should be taken not just one narrow perspective of least harm."}, {"id": 396, "text": "Among fellow omnivores, I ran into quite a few people who feel guilty for eating meat. I think it's important to think about the way that meat is produced, and sometimes this feels economically impossible. All of the energy being put into anti-meat activism would be so much more humanely employed to move into pro-regenerative activism. I was looking forward to this film, but figured that it would mostly feature talking heads. The location shooting and overhead shots illustrated the arguments better than I expected. I think I needed to picture some of these new practices to get a sense of how they could work."}, {"id": 397, "text": "This film provides a much needed look at both the current problem and a hopeful solution to our current farming system. With so many well-intentioned people eliminating meat from their diet because they think they are helping both their health and the environment, Sacred Cow provides a starting place for much needed questioning."}, {"id": 398, "text": "I loved Sacred Cow. It's a complex subject that's treated with the depth and nuance that it deserves. It's also a beautifully movie, very well done."}, {"id": 399, "text": "Excellent movie with lots of information I never knew about Regenerative Agriculture until now. We can clearly see how the modern agricultural practices are destroying the nature.This movie shows the problems and the solutions also. A must watch for all including vegetarians and vegans I am a vegetarian but support meat eating for those who want to. Keep it up guys for the excellent production quality and information."}, {"id": 400, "text": "How do we get out of an ideological and reactionary perspective on food?!?This film takes any viewer that is at least 1% curious about how to feed the planet while preserving it on a journey of discovery and reflection.What I most enjoyed was that the case was made scientifically and not emotionally. If you don't want to eat meat that is cool...but, I think you should put as much effort into understanding how damaging to the environment any type of eating mindset is.The truth is that mono cropping is destroying the planet and endangering our species (and all the rest of them). That vegetarian diet wouldn't work if you didn't have tons and tons of fossil fuels and plastics to get it to you...let along the pesticides."}, {"id": 401, "text": "Informative and well researched. Hopefully this will spark overdue conversations and start collaborative work with different communities to achieve better outcome for our land and health."}, {"id": 402, "text": "If you want to understand the truth about livestock and how they are part of the solution and not the problem which is what vegan ideologues want you to believe then this film is a good informative watch. Vegans are hurting themselves and the planet and attempting to take the moral high ground at the same time."}, {"id": 403, "text": "If you want to learn about how to help the world &amp; your health, watch Sacred Cow! Such good information and interviews with experts of science and people (farmers) using the science successfully."}, {"id": 404, "text": "It is similar to the scientists that discovered that earth was round, the truth is so obvious and yet you have to explain basic facts about nature to people. It is well known fact that rotating animal pastures is regenerating land and making it more fertile, locking carbon underground. We know these facts for thousands of years, yet we choose to ignore them and use chemicals to grow food in order to maximise profits of few. Meat is unprocessed, very cheap and highly nutritious food where little profits are to be made by processors. It isn't addictive in a way sugar is and we don't overeat it. Therefore it will never attract such funding as the one for the famous vegan documentary. Sadly for the earth, regenerative farming will not be chosen as option to save the humanity although it is the obvious solution. There is just not enough profit in meat. I highly recommend watching the documentary to re-learn some basic facts about nature and agriculture."}, {"id": 405, "text": "Its good to see a film that tells the truth about the importance of meat in our diet. Great to see we can raise livestock and also heal the planet at the same time."}, {"id": 406, "text": "Wow, every individual that has ever thought about the ethics/health of red meat (aka nearly every human ever) should watch this documentary. The diversity of perspectives, angles, and nations considered is comprehensive and compelling. The case for ruminant meat as a means of human nutrition and saving the planet makes sense and this film documents this using personal stories and scientific data. All I want to do after watching this is move to rural Colorado and start a regenerative farm."}, {"id": 407, "text": "DIana Rodgers and her team have done a wonderful job displaying the truth when it comes to the meat vs vegan debate. They show the nuance of regenerative agriculture and the actual detriment that monocrop agriculture and veganism has to our health and environment. They are so brave to actually speak the truth against the mainstream media headlines and they back it up with research and real experts in functional medicine. This should be required viewing in schools, particularly medical schools!!"}, {"id": 408, "text": "Very eye-opening. Great discussion of the benefits of regenerative agriculture and the importance of meat to our health."}, {"id": 409, "text": "This is real farmers, real people, real research! I love this! I am so happy this has come out at the right time as my 9 year old is being persuaded by her peers to be a vegan. A must watch and read the book for more detail! Thank you for working so hard on all of this!"}, {"id": 410, "text": "This is a great way to easily show someone completely unfamiliar to regenerative ag what it's all about, but still intriguing and hopeful if you're fully up to speed. Gives hope that not only is it possible, but there are people who are doing it all over the world. I hope this gets wide distribution, people need to see this!"}, {"id": 411, "text": "Very good information. Gives you a deeper appreciation for the life cycle and the life that feeds you. Beneficial information for everyone. I definitely want to support local farmers that care for the environment and their animals and the value they give."}, {"id": 412, "text": "Thoroughly enjoyed this film. Good to get a clear honest approach to a message being put out by those who really just don't know the truth. I myself keep sheep here in West Wales and it was good to see a neighbour, Patrick Holden taking part."}, {"id": 413, "text": "I whole heartedly agree with what was presented in this documentary. I do think you have an uphill battle going forward! The world economic forum is totally working towards eliminating eating meat, and as a result promoting vegan/carbs, therefore getting us all sick and hastening our death that much sooner...all in the plan. I can remember as a young child requesting a slice of deli meat on my breakfast toast, instead of eating porridge...because it satisfied longer. This century we have tried to change what has been done for thousands of years and ruined our land, health and society! Excellent film. Get the word out, even to a few!"}, {"id": 414, "text": "I loved the book and the documentary did it justice. My only complaint was that it was not longer and packed with more detail. I guess I'll have to wait for Sacred Cow part 2 :)."}, {"id": 415, "text": "Thank you for making this well thought-out documentary. It is easy to understand, even for children, and I wish all people would take the time to watch it. Some of the statements from the farmers and the way it shows them treating their animals, made me tear up. It gives me hope that even large-scale farmers are considering switching to regenerative agriculture. Keep up the good work!"}, {"id": 416, "text": "I love that this film respectfully shows why it's incorrect to demonise cows for the earths climate problems. A wonderful film explaining the path we need to follow, to look after the earth and keep eating in a nutrient dense way."}, {"id": 417, "text": "What a great movie! This is the solution for the planet, not artificial, processed 'impossible burger' and al. A wholistic approach to farming benefiting all landscape and animals. The nutritional aspect is absolutely correct and fly in the face of 'medical' authorities sold to food manufacturers and 'foundations' run by powerful and rich men. A win win for the planet and humanity! Well done!"}, {"id": 418, "text": "A wonderful film, eloquently explaining through a variety of experts, the wrongs in our food production system from both a health and environmental perspective."}, {"id": 419, "text": "Only complaint I have is I couldn't watch it again straight away! As soon as it's available I'll be buying it. I hope it reaches the people who need it."}, {"id": 420, "text": "A brilliant film that explains how sustainable/regenerative ranching/farming can save the planet."}, {"id": 421, "text": "This documentary adds much needed nuance to the meat debate."}, {"id": 422, "text": "This film will open your eyes to industrial farming and compare it with sustainable farming for livestock. It explores how livestock done correctly is both part of the solution to the environment and poverty. And as well, how unprocessed meat as well as vegetables has such a positive impact on your health. This documentary could be so much longer but it's at a good length to watch it in one sitting. Enjoy!!"}, {"id": 423, "text": "Very well done! Explains the circle of life very clearly and why we as humans cannot continue to get it wrong. Life and death are part of EVERYTHING."}, {"id": 424, "text": "Sacred Cow is a much needed documentary that elucidates the importance of ruminants in supporting ecological and bodily systems. We live in a time where ways of eating (e.g. vegan and carnivore) have become highly politicized. These rigid and divisive narratives keep from the nuanced understandings that Sacred Cow dips it's toes into."}, {"id": 425, "text": "I really enjoed watching Sacred Cow. Very informative and well made!"}, {"id": 426, "text": "This film was a delight to watch, packed with important information and a hopeful outlook. I was to watch it many times as there is so much to take in and so many stories of hope. Thanks for making this film - now how do we get everyone to watch it??"}, {"id": 427, "text": "Well made documentary. Everyone should watch this movie. The amount of great information contained within has me watching it a second time just so I don't miss anything."}, {"id": 428, "text": "I have followed Robb Wolf's work since his first book and original podcasts and became aware of Diana Rogers through his podcast and social media.Switching from the conventional North American diet and going Paleo/Primal was a game-changer for my physical and mental health. I am hoping that as more science-based information like this comes out, this way of farming and eating becomes more mainstream. Unfortunately, the only people that will pay to watch this are those that are interested in this topic. Vegans, vegetarians, animal rights activists etc will not watch this because it will not confirm their biases. Just like I thought the docu-drama The Game Changers was a load of garbage based on personal opinion, not science, the vegans out there will feel the same about this movie. The difference is the science backs this movie. This movie needs to get on Netflix or Prime in order for all walks of life to see this, otherwise it's only preaching to the choir."}, {"id": 429, "text": "This documentary gives me hope that regenerative agriculture can be the solution for the war between veganism and meat consumption. Regenerative agriculture needs to be taught to all farmers so that one day most of the worlds meat can come from places that use these techniques. Regenerative agriculture refutes all the myths the media has been telling you...that meat is unhealthy for you, unhealthy for the environment, and unhealthy for the animal. We cannot allow schools and other institutions to get rid of meat...we need to change our farming practices where it is a win-win for humans, the earth, and animals."}, {"id": 430, "text": "This is such an important topic. The misinformation campaign going on against meat gives humanely raised meat / animals a bad rap. I would have liked the docu to dive a little more into the health advantages of eating pasture raised, grass fed &amp; finished and non-gmo. There is a distinct difference. Obviously, there is only so much you can put into a film's time allotment, so I get it.The regenerative farming movement is inspiring. I am excited at how it seems to truly be gaining tractions. This book and docu movie can only help. Keep up the good fight. Must see!"}, {"id": 431, "text": "In this film they are talking about so simple fundamental truths, which is so dificult for young adults to understand. And in my opinion Joel Salatin that situation named very well deevoliution to disconnectedness."}, {"id": 432, "text": "Love hearing the truth about our food supply rather than all the agenda driven propaganda."}, {"id": 433, "text": "One of the most important documentaries of the year. A must watch!!!!"}, {"id": 434, "text": "I'm honored to be a minor funder of this important movie (fun to see my name, amongst many, in the end credits!)! It didn't rely on sensationalism and graphic visuals to be impactful--just real people, good research, and simple truths.The book was really great, and goes more in depth, but it was wonderful to see and hear the experts speaking (many of whom I was already familiar, and/or whose books I've read and/or I've heard in Podcasts), and to see and hear the passion and struggles and successes of the farmers and others in the meat-producing industries.Watch this movie, read the book, then go out and support the people who are providing us real and actionable information, and who are growing and processing the meat that will nourish us properly, and help save our environment for future generations."}, {"id": 435, "text": "An excellent counterargument to those that say grazing animals have no part in preserving our planet. This movie is well-laid out and backed by excellent research to support regenerative agriculture and, in fact, points out that there is really no alternative. Love the movie and the book by the same name. Watch it!"}, {"id": 436, "text": "Sacred Cow is a great documentary that not only shares the perspectives of both meat-eaters and plant-based eaters in a fair way, but also bridges the divide between these two parties by recommending regenerative farming, which is a GREAT option for all! It's a great way to open non-judgmental and honest discussion between plant-based eaters and meat-eaters and look for SOLUTIONS together, rather than focus on who is right or wrong. It focuses on the REAL cause of the many health issues we have (which is processed foods made from foods that are grown in nutrient-deficient environments that are harming the environment). When we can all come together and work on one sustainable solution, we can ALL win!! THANK YOU Diana Rodgers and Robb Wolf for such an incredible documentary!"}, {"id": 437, "text": "The big reason i eat less meat is because of the ways animals are treated from the beginning of their life to the end when they are 'processed' for human consumption. these living beings are treated as a commodity, something to be used as human will dictates. this is how humans have viewed our planet for far too long a time. this film shows how some humans are looking at the entire way life feeds life on the planet and works on ways to help bring human consumption/human existence back into balance to live with the earth, not just on it. it is a film everyone, from meat eater to vegan, should view. it is a thoughtful, penetrating way of respectfully walking on this planet."}, {"id": 438, "text": "Of course it is a bummer that the people who will watch this more or less already know these things. I just really, really, really hope that others see this as well and it helps stop the perpetual insidious dogma that has infected our society and made so many people and the state of agriculture so unhealthy."}, {"id": 439, "text": "Dear Diana, Rob, all of you who have worked on the film,You have done a magnificent job. I am happy and proud that open-minded and smart people like you have been able to show the hands-on face of regenerative agriculture. It was about time that a well documented film gave a truthful and inspiring counter-argument to the vegan propaganda and animal welfare activists. Things can be done better and you have shown it in spades. The film beautifully complements your book. I thought it would somehow follow the line the of the book and I was pleasantly surprised to discover that it offers a different angle, the face of farmers and meat producers, real people who already know how to live in harmony with their land. You have my warm thanks and gratitude."}, {"id": 440, "text": "This was a really wholesome showcase of how humans and animals can work together for the betterment of the entire ecosystem. Doesn't try to insult Vegans but provides a range of different solid points on how mimicking nature can be beneficial for the planet. People nowadays reference studies that look at specifics and not the whole picture. It's easy to be on the extreme. Things are not black or white, there's many shades of grey in between and this documentary was a great example of that."}, {"id": 441, "text": "I loved this film. Well done! Makes me want to own a farm."}, {"id": 442, "text": "This documentary was an excellent introduction to the complexity of our food systems and provides much needed nuance when talking about vegan and ethical issues. Shows us laymans just how disconnected we have become with what we eat. Amazing guests, and really well produced. Can thoroughly recommend!"}, {"id": 443, "text": "The Sacred Cow covers an impossibly complicated subject quite well. It delves into all of the issues surrounding the meat consumption debate. From farming to nutrition to processing. The movie travels the world to see how other countries produce meat. It reveals the destruction of the earth caused by veganism without insulting the vegan; the movie tries to educate the public in a compassionate way. I feel It skims the surface of so many issues surrounding the consumption of meat, but it might take an entire college course to cover them in detail. At the very least Sacred Cow opens the door to enlighten so many people that are out of touch with their food due to suburban and urban living. I feel it ends a bit abruptly, but maybe that's because it leaves the viewer wanting to know more."}, {"id": 444, "text": "A film that helps educate how storing Carbon in the soil not only helps in the battle against Climate Cancer destroying our ecosystem but also contributes towards a healthy society."}, {"id": 445, "text": "I watched the film today. There were some scenes that really touched my heart. Thank you so much for shedding a new light on regenerative agriculture. Monocropping is unsustainable for certain. I went to Iowa a couple of summers ago. I really wanted to roll down the windows of the car but when I did... I didn't smell earth at all. I smelled a chemical shitstorm. There IS a better way."}, {"id": 446, "text": "In a short amount of time the movie explained the problem of processed food and monoagriculture, and the regenerative agricultural solution. It was gentle with the misguided vegan and anti meat movements. It could have done a better job at explaining how animal foods and particularly red meat got vilified."}, {"id": 447, "text": "The film was well made and I enjoyed watching it. Very informative and should be watched by misguided vegans and anyone who cares about where there food comes from and how its handled."}, {"id": 448, "text": "A beautiful message of people's stories with regenerative agriculture. The film is hopeful and simple with hard truths to realise for us all. I look forward to the change that will come from this. Also enjoyed the world views in the film. Showing that it is not only a US-centric concern, but that we are all in this together from all the continents. Thank you to Diana Rodgers and Robb Wolf for all the work put it into this. I watched this in one go. Could not turn it off."}, {"id": 449, "text": "True documentary not a propaganda film. Media has so been influenced by a small minded portion of the whole balance of life picture that this film is a breath of fresh air. Knowing truly how nature works we see the place of animals and humans in the balance and, whether you choose to eat meat or not, how critical animals are to our food supply. We have nearly decimated our farm lands with modern farming methods. This movie shows a way back to healthy agriculture and animal protein as an option if you so choose."}, {"id": 450, "text": "The solution to our health problems and climate change is staring us in the face. Sacred Cow explains the problems facing the world, and provides a solution. The answer lies in the soil."}, {"id": 451, "text": "Diana, I was fortunate and did not have any issues.Let me take the opportunity to tell you how awesome the film is. I am a small hobby grass fed cattle rancher and have been going regenerative for about 3 years now. The film the major important issues about health, the environment and the farming economy in a straightforward and convincible way. I have recommended it to several people already. I am anxious to see the follow up interviews.Highly recommend."}, {"id": 452, "text": "Beautiful hope but is it a sustainable production system for providing meat to the whole world population? I fear that only privileged wealthy people could have access to meat due to the reduced intensity of farming. Anyway, this is the direction, provided that we are not inventing another nutrition divide between who can and who cannot afford the economic cost of reducing the environmental impact. I believe science could help the transition towards a better meat. Francesco"}, {"id": 453, "text": "It shows a way we can really rebuild a sustainable food system with humans as part of the natural life cycle. Shows the importance of our food choices and how meat (especially red meat) it's not the enemy, but instead the problem of how we are producing food in general and especially cattle raising. Best of all, they explain to us the solution in a very easy way."}, {"id": 454, "text": "Absolutely amazing presentation of a very hot issue nowadays with all the climate change movement discussion worldwide. I have to admit that this particular film - as well as the awesome sacred cow book - gives a largely previously unknown perspective of the problem for the majority of people, which I find both very exciting and interesting at the same time. As long as the viewer keeps an open mind and uses common sense I'm sure it will be very hard to ignore the facts that are presented here. Great thanks to both authors and all the stuff behind the scenes for making this amazing film !"}, {"id": 455, "text": "I just finished watching this outstanding film. Superbly produced, shot, narrated, &amp; edited.It concisely addresses so many of the misconceptions (including some economic impacts) about our current agriculture and farming systems.If you want to learn what I think is ultimately the only (certainly the best) way to feed our planet's growing population, this is it"}, {"id": 456, "text": "This Documentary is passionate, brave and intellectually honest. It brings up real experiences, beautiful results from farmers. It explains with simple words some of the common biased believes and in some parts, it engage with respect the act of killing a being, with gentle, honest and shocking empathy."}, {"id": 457, "text": "With the vegan propaganda film space already filled with four big titles: Cowspiracy, What The Health, Forks Over Knives and The Game Changers, this movie is long overdue! It is one thing to encourage people to eat a lot more plant foods, and entirely another to send a message that meat is bad. I am particularly alarmed when high school and college kids--who are notoriously lousy and inconsistent eaters--completely eliminate animal products from their diets in response to one of these movies. To be a healthy vegan (and not everyone can be; this is highly individual) is to be very disciplined and focused, and to have access to supplements that you remember to take on a regular basis. Not the definition of your average young person. I fear the vegan movement is doing more for the processed food industry than it's doing for people's health or for the planet. Thank you Diana Rogers and team for your very hard work on getting this film made. Bravo!"}, {"id": 458, "text": "Very important content, demonstrated and explained skillfully and in an intriguing way. I only wish they went in to healthfulness of a vegetarian diet more. They talk about health and culture of vegans, and I wanted to hear more about the effects of a vegetarian diet. Many inspiring stories were told and it makes me want to find a ranch to work on this summer rather than the veggie farms I've been on!"}, {"id": 459, "text": "It became painful to watch the blatant misinformation being shared by individuals not at all qualified to speak on their topics. One example being the former vegan blaming a bulging disc on whole food plant based eating. By that logic only non meat eaters are afflicted with bulging discs. That's simply absurd. I could no longer listen to the propaganda after the young farmer described his assisting a sow in birthing after watching a Youtube video -- talk about an experienced/qualified source to speak about farming -- who then went further to say that all organic farming uses animal products for fertilizer. Having come from a farming family, farming in the sixties involved the use of crop rotation and cover cropping, not bone meal. The local organic farm near me now uses those same time tested methods along with animal manure, not bone meal, chicken feathers, blood meal, etc. It's this type of poorly researched programming that calls into question the validity of all documentaries and leads to further public confusion."}, {"id": 460, "text": "The movie was just facts on top facts without a good storyline to get and keep attention of the viewer. Compare it with 'The Game Changers' although that movie twisted all the facts it was nevertheless a really well made movie. Sacred Cow was so boring to watch i'm so disappointed, it will never come close to other well made vegan documentaries. Quite unfortunate, vegans win again."}, {"id": 461, "text": "It is true that such regenerative agriculture is far better than current livestock rearing techniques but there was so much bias and misinformation in this. Vegans made out to be black or white and not understanding that death occurs with plant production is ill-informed. Also no mention of the number of crops grown purely to feed livestock. No mention of what percentage of livestock rearing is done via regenerative agriculture and so the message just came across as 'keep eating meat' even though the vast majority in not done in such ways. Suggesting that scientists are so dumb that when they do studies linking red meat to certain cancers and heart disease that they don't take account of other factors. Ridiculing all the peer review studies that show that meat is not required at any stage in life for health and growth. No mention that even is all livestock rearing goes the way of regenerative agriculture then either far less meat would be produced so people would have to cut down their meat consumption, or that far more land would need to be used, that goes against all environmental principles. There is a reasonable message woth regenerative agriculture but is not to be found in this film. It is just a way to put doubt into people's minds so they keep eating vast amounts of meat..."}, {"id": 462, "text": "I thought this film was beautifully made, however the content and message seemed to be quite one-sided and reactionary. To me it seemed to be a simple attempt to attack anti-meat messaging. While I understand why the regenerative farming industry would feel the need to do that in light of recent trends and ideologies, I felt it went too far one way and as a result, did not appear objective. I am a huge fan of regenerative farming and totally agree that it should replace intensive farming but presenting it as the only way forward seems unreasonable. While the film decried the notion that anyone should even consider reducing their meat intake, there was no evidence presented that suggested this system could meet the world's current (let alone future) demand for meat. After looking at food sustainability for a number of years I now, I really believe there is a place for many solutions to exist alongside each other. These include: 1) A reduction of global meat intake - particularly among the highest meat consuming countries and socioeconomic groups. This will involve accepting that people can live very healthy lives without consuming meat if they wish to. Meatless Monday IS relevant for the many people who were brought up eating meat 3x day and 7 days a week. 2) Substituting monocropping with sustainable vertical farming systems where possible and where regenerative farming may not work 3) Supporting the development of sustainable meat alternatives such as plant-based and cell-based, to augment supply. (Cell-based meat is not in production yet, so to say it is unsustainable is premature - especially as sustainability is a primary goal. There are many methods and approaches being investigated in this field that were not covered in the film) Regenerative farming is an infinitely better way to farm animals than is the norm today. However, it is just one of many approaches needed to make food production, particularly meat, more sustainable and reduced consumption is one of these. While I know the vegan, anti-meat lobby can seem very intolerant and one sided, fighting back with the same singlemindedness has reduced the impact of the film for me. I look forward to one in the future that is a bit more balanced."}, {"id": 463, "text": "An empty attack against plant-based diets based on misleading information."}, {"id": 464, "text": "Dear Diana and Robb and all participants to this wonderful movie,Thank you for your hard work.I consider regenerative agriculture to be one of the most important movements in our lifetime, and this movie makes the case in a beautiful, thoughtful and loving manner. As Frederic Leroy has so pointedly demonstrated with his research on the concerted efforts by the ideological driven anti-meat movement represented by the World Economic Forum and the EATLANCET folks, we are up against a well-oiled, well financed propaganda machine. I speak to you as an ex-vegan who had been influenced by what Nina Teicholz's paradigm shifting book The Big Fat Surprise has shown to be pseudo-science; the fallacy that meat is harmful. I still at times struggle with the reality that industrial livestock operations are extremely harmful to both cattle and the environment, and it's a moral tradeoff at times. This movie really makes the point that things can be done differently, no, need to be done differently or else we will all fail. I am grateful to all of you for your efforts, I am sure often at great personal costs, to educate the world how we can do better, for all of our sakes.Regards from Haarlem, the Netherlands.Jeroen Sluiter"}, {"id": 465, "text": "The science and wisdom in this book take you through what's broken with our mass production, profit driven, mono-cultural, farming systems and that path to ultimate destruction. But it also shows us there is hope for the future.Smaller, bio-diverse, farms using greater, organic based, regenerative farming and grazing practices, and less chemical fertilizers and pesticides, to produce good healthy food, can survive and flourish and re-invigorate our rural communities.The free range, pasture fed cow plays a vital role in getting the carbon out of the atmosphere and back into the soil to a greater depth (ie. 1-2 meters, instead of 20-30 centimeters), greatly increasing it's fertility, water holding capacity and the number of micro-organisms, necessary to grow healthy, sustainable food.Since buying my small, run down farm in Tasmania 2yrs ago I've been tapping into the many resources (in Australia and around the world), out there to follow regenerative farming and grazing practices, to improve the bio-diversity of my soil. It's already paying dividends, my paddocks are thick and lush, and my cows are fat and happy. I rotate my whole herd as one group, around seven paddocks (a different one each week), mimicking the migration of a wild herd of buffalo, and after the cows have moved on, that's when the magic happens. The earthworms, dung beetles and micro flora and fauna do all the work, sequestering the carbon, but they couldn't do it without the cows.I can testify that regenerative farming works. Mother nature's been doing it for millions of years, we just have to stop working against her and help her do her thing. A marriage of our husbandry of the land with nature, and the love and respect for the plants and animals in our care.I don't know any local farmer or grazier that doesn't care greatly for his land and his animals. But I don't know a large corporate company that does. You can make a difference by supporting your local farmers and producers.I sold my house in Canberra two years ago and bought a small 92 acre farm in Northern Tasmania, to try to survive the inevitable, oncoming ravages of global warming. But reading this book, it's given me renewed faith that mankind can still have a future, but we must act now.Alan"}, {"id": 466, "text": "I am very interested in the topic of food production, and one of the issues is the fact that it has become a plant vs meat battle, that is being played out via media, social media and various other platforms for propaganda.Being single minded or closed minded is never going to solve anything. All conflicts are eventually solved by dialogue and some give and take. The plant based activists need to realise that there is an environmental cost, a loss of life cost and a personal health cost to their diet, and that eating small amounts of meat that was raised in a natural environment is actually a win on all of these levels.From a farming perspective, farmers and more importantly governments and multi national corporations need to realise that how a large proportion of farming is currently being done is also wrong from an environmental perspective, from a loss of life perspective and from a health perspective. So when you look at these opposed stand points, the negative realities of both sides are actually very similar.So if you could stop the gesturing and pontification, the solution is fairly simple - produce food as nature intended, let nature repair the environment, stimulate life and provide healthy nutritious food regardless of whether it is plant or meat based. This film is a good step in the right direction.Remember the words of Nelson Mandela - Education is the greatest weapon known to man!!!"}, {"id": 467, "text": "This film is very well done and balances information and entertainment and argument in a very inclusive non-combative approach. Its not just some pushback for meat. Not by any means. This is the film that can redirect the conversation from a naive debate between killing animals or not, to a look at sustainable agriculture vs the current extractive damaging system that is failing us, destroying land and farmers and public health as well as causing cruel suffering.. Recognizing that whether the industrial system is used for plants alone or for all forms of food, that animals do and will suffer as their habitatis are eliminated with massive industrial ag. That our whole system needs to incorporate time tested approaches that we can live with, thrive under. This film shows that as long as we isolate ruminants and other animals from our land and farms that we will never be able to feed ourselves, nor will we find our place in the web of life. The farmland itself is deteriorating without well managed animals. To eliminate ruminants from the food chain is not good for them nor our health, but simply a misplaced idealism based on isolated, disconnected naivity from disconnected (though caring) citizens who have lost perspective on nature, traditional agriculture and the needs for nutrition. worldwide, not just in rich countries.This film does some heavy lifting that society needs desparately in order to work through the food and farming mess we are in. Its a joy to watch. See it!"}, {"id": 468, "text": "This film is a full-throated defense of eating meat. If you have any radical vegans in your life and need an argument to try to persuade them to abandon their lifestyle or accept yours, this film is it. I was hoping for more of an environmental analysis of regenerative farming, and unfortunately this film comes up shallow. There is only a small section on the carbon impact of beef (and nothing comparing it to other forms of meat eating). And although there is some good footage of regenerative grazing techniques, the film doesn't look at the resources consumed by beef farming or at alternative uses of resources and land. Perhaps this is necessary. The film covers a good deal of ground, from obesity to humane slaughtering techniques to restoring the Chihuahuan desert to 3rd world malnutrition. But for each topic, I found myself wanting more depth. It's hard to talk about the demonization of meat and fat in the American diet without talking about our overreliance on corn and sugar. And is veganism really the same problem as eating too much Fruity Pebbles? Is eating Fruity Pebbles the same problem as factory farming? Is factory farming the same problem as the paucity of nutritional supplements in the 3rd world? Is the paucity of supplements the same problem as using fossil fuels? Instead of a detailed look at how we might solve any of these problems (e.g. land regeneration, obesity, malnutrition, climate change), we just get a panacea: eating meat is good for everything if you do it right. That's a necessary argument if you're confronting an extremist who wants to eliminate all meat from Berkeley, CA by 2020, or if you have someone who needs reassurance that eating even a grass-fed, sustainably raised burger won't damage their enviro street cred. But if you want to persuade someone who thinks that meat is okay -- even nutritious! -- in moderation, but is concerned about land use or climate change, you'll need a different film."}, {"id": 469, "text": "It was about time to make a movie about modern agriculture and it's devastating effects on our environment. At the same time the simplified debate about animal husbandry that is occurring at the moment and let to the rise of meat replacement products as well as meat taxes, was in need of a nuanced update. This all comes together in our total disconnection from food production during the last 60 years. Diana Rogers and her colleagues are doing a tremendous job in connecting the these narratives to paint a very clear picture. The status quo is non sustainable and our future will depend on regenerative agriculture to feed humanity while preserving our planet. Just like that, the film gives hope for a sustainable future if people start to understand the fundamentals of food production. They cover all important topics and take a very unbiased position towards nutrition in general. Their interview partners are well selected and those personal stories carry the complicated topic. Cinematically the film is well made for a independently funded documentation. Every citizen of this earth should see the movie and learn about this very essential topic of our life."}, {"id": 470, "text": "It is without doubt that most with a set agenda do not provide unbiased information - especially as it relates to agendas set out by vegans.This documentary does the exact opposite and provides factual information to show the following (without bashing anyone like The Game Changers did):Balanced living works. This is not about eating hords of processed factory farmed meat. It's about sustainability. It's about eating and honoring the animal. It's about no hypocrisy as it relates to food choice. You can't say you refuse to kill living things for your own livelihood, yet use all sorts of pesticides to kill organisms that feed on plant-based food.This is an absolute must watch to educate anyone and everyone on these most important facts - traditional ways work. Balance works. We are meant to live &amp; eat in this way to achieve optimal health."}, {"id": 471, "text": "While the actual filming was beautiful, the movie was unfortunately a very biased view of the food related issues we face as we try to save the planet and the health of individuals. Joel Salatin and other small farmers are very correct about the need for carefully managed farms. The food choice is not one of vegan vs animals. We will always need ruminants to keep our soil viable. That much is obvious and the large CAFO operations need to become a thing of the past. The real problem is with the existence of food corporations which create, market and sell food-like products to our children and all of us who are forced to shop in markets full of nothing else. It is very possible to not only survive, but thrive (children included) on a vegan diet as long as it comes from whole foods. Millions of people all over the planet have done it successfully for hundreds of years. The choice is between real, whole food and non nutritious products that only make us sick. Our government should stop subsidizing these entities immediately. Meat eating is fine for many, but it isn't the issue that is killing us. I wish the film had focused on that instead of pitting vegan against meat eaters. That approach has never been and never will be helpful."}, {"id": 472, "text": "Everybuddy wants to eat a nutritious diet that is sustainably and ethically produced. Vegans would have you believe the only way to do this is by excluding all animal products from your diet, but that's not the whole picture. Sacred Cow brings together many scholars, but more importantly, many ranchers and farmers who are using pre-industrial practices to keep livestock working with the land. Sacred Cow addresses the fat phobia that has made us afraid of meat at least one day off the week, leading us to exclude a nutrient-dense food from our plates. The horrors of industrial animal agriculture and production for maximum profit have made us question the ethics of eating any animal product whatsoever, even honey. What this documentary does is help us see the relationship between animals and the land and how that can be managed for the benefit of both. It also faces us with the dilemma that vegans entirely avoid: something has to die for something else to live. We are part of a cycle and we must learn to act as morally and respectfully as possible for the higher purpose of raising healthy generations to come in a whole ecosystem. It's a big subject and hard to fully address in one piece but Sacred Cow succeeds in raising the question: what if vegans don't have all the answers?"}, {"id": 473, "text": "With the seeming hegemony of the Marxists and vegan ideologies dominating the cultural narrative of food production and climate change, this film challenges all the assumptions underlying them in a thoughtful and rigorous manner. The passion of the director comes across throughout and I found myself growing into the film and becoming more engrossed in it. It tells a story of where we are and how we got here and then does a good job of telling us how we can get out of the mess that we find ourselves in. It presents the current situation we seem to be in as one that is serious and the consequences this could have on food production and climate as one that needs to be taken as such, but not in the way in which media organisations such as the BBC and the Guardian present to us.Whilst there is a lot of optimism to be found in the film of what we need to do and can do, I did come away thinking that the vegans could still run away with things and that it may not work out the way it should do. The presentation of the facts was rigorous and it took the time to present the opposing arguments coming from the vegans and then deconstruct them.A butchers near me got attacked with graffiti labelling him as a murderer scrawled all over his shop so the only criticism I have is that at times more could have been said about the cult of veganism and the actions that some of them go to in order to defend their ideology. See what Extinction Rebellion get up to as further examples of this."}, {"id": 474, "text": "You could make a whole film about how bad the cash crops are, depleting the land, chemical fertilizers, chemical insecticides, chemical weed control, GMO plants....destroying all life around these massive crops. And most people dont want to look at that part of it. They will only point at those nasty CAFOs. and yea they are disgusting and a horrible place for any animal, I would not want to get my food from there. I am very glad im in Texas and my farmer is only 80 miles away, they use these rotating techniques, and produce great stuff. eggs, pork, poultry, and beef..Im also glad I found out I do pretty good on a 95% meat diet.. I eat so much less now. one meal a day vs 3 meals a day and snacks.. I also have 0 food waste. the amount of wasted food here is also disgusting, and, yea, figuring out what to eat with all the info on the web is seriously maddening. For me, eating beef and not having to take any supplements, or any meds, or anything else is a huge win. Also 1lb of grass fed/finished ground beef may run $10. and some pastured eggs at 5-7$ a dzn. I can eat on $12 a day... how much is the standard American diet? breakfast 5, lunch 10, dinner 10, snacks 5, spoilage of all those fruits and vege you didnt eat in time???? Yes I do get labs done a few times a year, they are all normal. Were getting to the point where you cant bring up politics, religion, and food on the web, people seem to have all the facts no matter what you say lately... but cmon guys we dont even know how to eat yet!"}, {"id": 475, "text": "Everyone who eats meat would love to buy only grass-fed beef, but many families can't afford it. To get an entire nation on board with this excellent concept, the regenerative stock raisers will need to find ways to achieve economies of scale to bring prices down in order to compete with and supplant big corporate farms and their supply chain of gigantic, unsanitary feed lots that are geared to meet the daily demands for meat by millions of Americans.To achieve these economies of scale, the huge agribusiness corporations raising and selling the most meat today will have to be shown that it's in their best financial interest to switch to better ways of raising beef. Since this is a public health issue, causing illnesses that cost Americans billions in healthcare owing to poor nutrition, the federal government could consider developing supported programs to convert the millions of Midwest corn and soy fields from cattle-feed operations to using those rangelands in a regenerative way.I'm from Nebraska, with ancestors who began farming in Nebraska Territory in the 1850s. In the late '40s &amp; early '50s I spent summers on my great grandparents farm in Seward County. They had a Farmall tractor but still plowed with draft horses, had kerosene-lanterns for light, had well-water pumps in the kitchen, a wood stove and no electricity, and a miserable outhouse. As a kid it looked like living the dream to me, until it later dawned that farming is a tough business. Even today farmers plowing in air-conditioned tractors with stereo music and computers with satellite connections still deal with the same challenges to stay profitable with whatever economies of scale are at hand. These modern-day farmers too will need convincing that regenerative techniques are the best way to preserve their land and still turn a profit."}, {"id": 476, "text": "Hi Diana,I loved your movie! I have passed it on to many of my vegan family members.I raise highland cattle on grass and garden scraps and am totally familiar with with all your concepts. I and my animals eat only organic also raise bees. My neighbours to the north and east of me are conventional farmers. The neighbour west of me is almost organic. He doesn't use GMO and uses Joel Salatin's method of pasture rotation. A few years back my neighbour to the east of me sprayed all his hay with round-up and killed my 14 hives outright. I was devastated. Within a few weeks I started losing cattle. It seems as if they were all directly sprayed. Even though there is a buffer zone which is a hedge, it's never enough. The wind of course came from the east. Within 2 months we lost a calf, then her mother ( my trained Milker) a bull and 2 more cows! I have since talked to the neighbours wife (who has thyroid cancer) given her a tour of my farm and gave her some honey. Showed her the hives and explained what happened. She was shocked and said of course it was not her husband but an employee. I approached the situation with love and did not accuse. Nevertheless the damage is done, they have returned the field to hay and haven't sprayed that field since. I'm sure there are many stories out there.Thank you for your determination in coming out with a movie like this. Windswept Acres"}, {"id": 477, "text": "With the demonization of red meat on human health, and cows on the environment...we need many voices to speak the truth. I am a 60 year old who mainly followed the American Dietary Guidelines until about 6 years ago, when I elected to go 'keto'. Animal meat &amp; fat is a mainstay of my diet. All bio-markers register optimal health now.I put the Sacred Cow on par with other recent documentaries on meat, animals, and the environment (Biggest Little Farm, Kiss the Ground, The Need to Grow). I hope our new president and his climate and agricultural cabinet watch these films too. We desperately need big changes to incentivize the promotion of sustainable agriculture and the dismantling of big ag and factory farms (concentrated animal feeding operations) to save our planet and promote healthier food sources.A similar message is being delivered through these cinematic productions, I hope powerful people in the position to effect big change start paying attention and take action.THANK YOU for making Sacred Cow!!"}, {"id": 478, "text": "At first I have to say this documentary promotes a pretty good idea of how we could turn agricultural economics into something sustainable which everyone and everything could benefit from. But I'm seriously wondering who this documentary is aimed at. I'm pretty sure most vegans will switch off after the initial few scenes from inside of a butcher shop. Yet the film continues to show vegans demonstrating, the harmfull production of fake meat and an interview of an ex vegan. There are some valuable insights here, no doubt. But obviously the production of mono cultures is also an important step in the very harmful practice of factory farming. While this is also illustrated in the film, it fails to communicate how much of an impact factory farming has. Veganism seems to be just a symptom of a malfuctioning system of food production. People new to the matter won't grasp this I'm afraid. Furthermore I think this documentary could easily be cut down to an hour. Some content is repeated or does not have any informative value. Of course I don't expect documentaries to be dispassionate but I don't like that the film wants to guide you to a certain opinion using emotional music in the end. I see that music is a powerful tool to lead emotions in movies but it always feels cheap in documentaries. And I feel like there should be another whole documentary explaining how these ideas practically work for the masses. They just claim it will work but not exactly how it will work. How to support regenerative farming if you're living like the majority (poor and in a big city). So in the end there's some valuable info but it seems it's made for people who are already on the same page with those who made the film."}, {"id": 479, "text": "I very much enjoyed watching this as a sneak preview. Having lost over 200 pounds and got my health back after 30+ years, a lot of the themes in here were familiar to me and things I absolutely agree with in principle.My confirmation bias did let me watch it and see more evidence of what I believe but my wife felt a little differently. Personally, though I didn't see it so much, she did feel it was a bit heavy on the one-sided bias. Even though she agreed with most of what she saw, she felt that the vegan/vegetarian aspect wasn't presented as a legitimate other side of the argument. I was fine with that as that was not the purpose of the film. If I want to hear that debate I will reload a Gary Taubes and Joel Kahn podcasts.I think the best point of the whole thing is really with how it starts out.....What if what we are arguing about is the wrong thing.I truly enjoyed it and will likely watch it again."}, {"id": 480, "text": "As a sheep producer that raises pasture fed and finished lambs using regenerative farming, I was glad to see this movie address the environmental aspects. My hope is that every school child who is being fed the Climate Change and Plantbased Food narratives would watch this. I very much appreciated the interview with the former vegan who stated that being a vegan was an identity and being exposed to other viewpoints resulted in very uncomfortable cognitive dissonance. I would have liked the film to have dug deeper on how plant based foods processing is destroying the land through monoculture. Many will disagree but showing humane slaughter of animals at the new abbatoir they profiled would have further supported the focus on humane raising of livestock. Many vegans have watched the inhuman slaughtering on YouTube; they need to see the other side. Vegans that I know also focus on premature deaths of animals not realizing the consequences of letting domestic animals live out their lives debilitated by degenerative aging diseases. (Compare wild animals.) All in all this was an excellent film and I realize that they did have to cut out a lot of content but a little more length would have given some of the issues more teeth. The film gave me information that I can integrate in my conversations with customers and I will be reading the book for more detail."}, {"id": 481, "text": "Beautiful, inspirational, well-edited, positive, constructive, and respectful. It does not condescend to the viewer or waste our time. It does not scapegoat anyone. It asks us all to find common ground, do better and points the way. Highly recommended.I am very familiar with all the topics discussed therein (having researched them independently for most of my adult life, and yes I am an ex-Diet For A Small Planet vegeterian who used to believe in the logical fallacies underlying, well, any diet, ideological or otherwise - for more on this, read Fred Provenza's book, Nourishment), and it barely scratches the surface. There was almost zero new information in this film for me, but I felt and appreciated the care and respect and ethical integrity to its subject, interviewees, conflict, and viewers, all.That was my biggest concern going in (especially with a provocative name like sacred cow): I am utterly and completely tired of people using documentary to distort, reduce, scapegoat, inflate controversy and associated egos. And I feel relieved to report this, much like the recent Gather, about indigenous food sovereignty, is not one of those documentaries... you know the ones that leave you feeling a little ethically disgusted for having consumed them, like junk food marketed as a health food. Nor was it vapidly uplifting, like noncaloric sweeteners. This documentary is nutritional polemic, and the more of it you digest, the deeper you go, the more it will nourish you, us, and the planet. They pull us in the opposite direction of the Race to the Bottom of the Brainstem (ref Center for Humane Tech).I have no affiliations whatsoever with the film makers or anyone interviewed, though I know about and have come across several of them independently. I feel immense gratitude for the clear labor of love and respect on behalf of people and planet.9 stars only because nothing is perfect. I will give the commercial release 10 stars if it includes the full interviews, etc, as featured extras. If the book is as well written, edited and researched, it should also be well-worth your time and money."}, {"id": 482, "text": "I am a Food Scientist who has lot of issues with the food system. Minimally-nutritious processed food has overtaken the grocery store based on being cheap and convenient. Monocultures are the scourge of the earth. Animals should be eaten but in very sustainable, ethical and balanced manner. By balanced manner I mean as it relates to the food pyramid. I that I have had access to a lot solid science over my 35 year career and I believe that Americans eat way more meat than is what nutritionally needed and that was not addressed in the movie. What does the film team believe in regards to this?I am also an environmentalist and some of the messaging in this movie falls a little short in my opinion. Are we to embrace all of this pasturing and grazing in lieu of native animals and ecosystems? Do deer and moose and elk and buffalo and apex predators have a place in this vision? Our continent evolved with these animals as part of the chain and I felt that this was not explored. The heartwarming critter cams showing coyote's and skunks are one thing, but those animals actually thrive in suburban and urban areas already. Rural America was home to other species that I think still lose in this cow-centric model.As an animal welfare advocate and a factory farm/corporate ag hater, I do believe that the movie addresses these issues very well. It was my main reason for the high rating. I struggled, however (as it appears the film makers did as well) with whether to show the actual kill step in the new, humane meat processing plant. At age 23 I spent 30 minutes on a kill floor in a downtown Milwaukee kill floor; from stun station to tripe washing machines. That always stuck with me and for the last 37 years I have continued to eat beef despite seeing it. I feel blessed to be able to make this decision with full disclosure of the behind the scenes peek at slaughtering. Does the film aim to avoid backlash by not showing the first 4 steps in that slaughter house? Are they afraid they will lose their viewer by showing the truth of what that looks like? Avoiding that pivotal part of the conversation does not show courage.When covering the whole methane conversation, the light hearted approach rubbed me the wrong way. Showing scientist laughing at people who have embraced this apparently-incorrect belief doesn't help the cause. Discuss it seriously. Also, even as a scientist, I did not understand the argument about petroleum-based methane somehow being CHEMICALLY different than cow-created methane. I still feel like methane is methane, until you explain this more, and forget the scoffing and laughing in the conversation.That early segment on the food industry making foods so flavorful that they are like a drug is a bit out of place. What does that have to do with cows? Using flavor potentiating ingredients could actually be part of the solution. You can use less meat and more of these umami, satisfying flavor ingredients to make up for eating less meat. Many of them, such as yeast extracts, are primarily protein and extracted amino acids, and not artificial nor hocus pocus.Overall this film gives me the permission to eat sustainably raised, local beef; something I try to do anyway. It doesn't, however, touch upon the sub-topics listed above and it doesn't give any solutions for at least reducing our amount of beef in order to re-establish more native ecosystems, complete with large mammals that would compete with cows for resources and allowing for predators that might impact herd yield."}, {"id": 483, "text": "Hi DianeI really enjoyed your film - thankyou for all your hard work! I myself studied Agribusiness at university and until recently was a beef farmers wife! Regenerative Agriculture has been something I have taken a keen interest in for a long time and am always being met with resistance whenever the topic is broached with conventional farmers.If I may offer one piece of constructive feedback for you to consider for future films..... All of the interviews with small scale, tree changing farmers (as they would be called in Australia) dont add a lot of value even though their individual stories are great and positive. My reason for saying this is that commercial farmers...and the ones needing to change the most, will not do so by seeing small, intensive farmers demonstrated.There really needs to be a focus I believe on the larger commercial farmers and how they have transitioned from conventional to regenerative...what were the challenges and what were the triumphs and how has that affected their bottom line? I believe this is what commercial farmers want to see. They dont want to hear this from me as I am not farming and they dont want to hear it from tree changers they want to hear it first hand from those that have done it on a big scale.I love Joel Selatin and how he demonstrated what it means on his farm with the way he uses tape to move the cattle around in small paddocks etc and how the other animals follow along behind. More of that would take this movement to the next level I believe. Even if your second film was all about that.....what several large scale farmers transition etc....that would be phenomenal.Cant wait to see more of your work. I have promoted it on Facebook and have ordered your book and cant wait to promote it once its on Netflix.Best wishes and thanks for being a change agent for our plant."}, {"id": 484, "text": "Nicely done, yet, it comes across as appearing to do the same predatory marketing &amp; squelching of opponents, manipulating public emotions, as has been so long-done by the mega-meat &amp; AgriBiz industries Yes, nutrition can come from meats...but industrialized meat industries are doing it very badly, &amp; the organ meats w/most nutrition, are almost completely missing from store offerings...and unsafe to eat raw...the only good way to get that. There ARE Very good reasons to optimize plant-based diets, but not everyone can, for various reasons. Our digestive system physically proves we are better suited to vegan, but, we can be Omnivores. But even 10,000 years of cultivating grains, and plus what AgriBiz has done, has ruined humans fully adapting genetically to eating it. And NO ONE eats like traditional Inuits...not even most Inuits...THAT would be a natural Keto diet. But there are some good, temporary, medical-needs reasons to choose a simulated keto diet. Please avoid trashing sound science that supports eating plant-based diets-that has been well-founded &amp; proven, for literally thousands of years. Not all fake meats are bad. The products that are bad, could be corrected and made using Organically grown plant-source foods...MAYbe. I do NOT want everyone relegated to only eating various formulas of Soylent...the 1st one of which, is in stores now. Let's not devolve to the green version! This documovie seemed to castigate all fake meats; that copies a bad trick same like AgriBiz does by predatory marketing, &amp; lying about organic raised produce, ....PLEASE use truths, real data from reputable, repeatable research, &amp; avoid devolving into the same industrial flummery/fakery as the industries that need corrected &amp; remediated! I want to re-watch it, to hear it better/more fully. Your Limiting rewatching it, builds false followings, &amp; prevents lucid critiques of content-the very oligarchal dictatorship behaviors we need to overturn."}, {"id": 485, "text": "This documentary easily makes the case that ruminators are a natural contributor to a healthy diet and environment. Even the question of the much-maligned cow fart is answered with logic and science.I'm a meat eater so it's not as if I needed to be convinced but to me much of the case for continuing to eat meat as our ancestors did for thousands of years is common sense. Sustainable farming simply follows nature's example by moving cattle around pastures in a similar way that bison roamed freely in the past, naturally fertilizing the soil as they go, encouraging regrowth and eliminating or reducing the need for chemical fertilizers that are often used in corn and soy production. Cattle can also be kept on land that is not arable and cannot be farmed with crops, so they are not taking anything away from crop-farming.As noted in the documentary, meat eaters want the ethical treatment of animals too. It was good to see farmers working together to design an ethical slaughterhouse. These farmers care about their animals and treat them well and, as one farmer said, he wants the animals' last day to be as good as all the rest."}, {"id": 486, "text": "This film did an excellent job of countering the messages the processed food industry and other groups perpetuate regarding healthy and environmentally friendly foods. Meat has been a part of the human diet long before the advent of modern agriculture and the food industry, yet it is demonized as unhealthy and damaging to the environment. It is clear that balance is a defining principle in most aspects of the physical world and that we have generally forgotten the important role of grazing animals in the maintenance of healthy soil that promotes the growth of crops that are nutritionally replete. It is the cycle of life that has been going on since well before humankind came along to provide modern tweaks that have generally led to practices that increase crop yields but add toxins to and reduce nutrients in food. With the advent of modern agriculture, food has been more abundant but less nutritious than ever and the food industry has promoted many food products that are contributing to the explosion of obesity and chronic diseases. It was very interesting to see the juxtaposition of vegan activism with the farmers and butchers who take such care of and have such reverence for the animals they raise and butcher for their sustenance. No matter whether it is an animal or a plant, we must kill something to live and many animals are sacrificed to ensure good produce yields even they are not directly consumed. We must keep these things in mind when we make choices about the food we buy and eat. Sustainable agriculture as emphasized by this film is critically important to the health of plants, animals, humans, and the planet as a whole."}, {"id": 487, "text": "Thank you for bringing a more balanced and nuanced look at the problem and solutions.Until people can see past their bias and ask tough questions about where and how their food is grown and raised the battle lines will continue from a totally emotional and irrational place.What vegans and vegetarians miss is that no one wants to harm the planet or torture animals needlessly. Furthermore, we the consumer are largely responsible.I would like to think that if vegans saw the connection between factory farming and their plates they would choose differently. That is they saw how much the earth needs grazing animals to complete the cycle we could then focus on improving the quality of life of the animals in that cycle.Again thank you, lets push back against the WEF and globalist vegan agenda."}, {"id": 488, "text": "I learned a lot from this documentary film about the issues around meat consumption. It did start to shift some of my concerns about the impact of meat on climate change and the environment. The documentary was relatively balanced, not a one sided propaganda piece. Great to see also the issues of livestock raising in Africa/Kenya. What could have improved this documentary, and information to viewers would have been addressing three issues. One is cutting of rainforests in the Amazon and elsewhere for cattle production. Second is whether current and growing demand for beef can be met entirely through grass-fed operations. All those huge concentrated feedlots briefly shown in the film, if they all close, what will happen to prices and availability, especially with rising demand in developing countries? Third is a deeper discussion of the effect of burbing/farting cows releasing methane into the air. All very good to say it is a natural cycle, not as bad as release of CO2 from digging up fossil fuels, but would be good to cite studies if grassfed operations are neutral or net contributors to global warming or not. This was not clear. Finally, I was skeptical of the assertion that grassfed beef would be on land not suited for agriculture, which is a larger area than crop land. Although briefly mentioned, a better argument is to shift to mixed farming where animal production is integrated with crops and trees, and where animals do not compete with crops. This should have been given more attention."}, {"id": 489, "text": "Even for those who live in this vineyard, Sacred Cow delivers. Emotionally, the flow of young farmers around the world producing grass-fed meat had the biggest impact on me. The facts and science throughout the film are sound, although of course not complete. Only so much can be covered in a one documentary. The reviews to date provide ample reasons to expand viewership, so I want to flag two other considerations. First, the film could give rise to the notion that converting worn out farmland and range to healthy, productive pastures and fields is easy. It is not. It takes time and capital. The path is tricky, and mistakes will be made. For every farmer in the US that has gone down the road and benefited and persisted, several more have tried and been unable to bring land back. For this reason, both markets and policy will need to provide helping hands if the transition is to occur on a large enough scale to deliver the food-nutritional value, animal welfare, environmental, and rural community benefits the film highlights. Second, there are bound to be many people in the Biden Administration who get it, and who will deploy their skills to try to change the the playing field. One essential step is to stop propping up failing CAFOs. There is zero chance that regulation will meaningfully hasten their being put out to pasture (pardon the pun). Only raw economics will get this job done. And this will happen only if taxpayers stop subsidizing their largely futile efforts to deal with waste, crowding, and inhuman conditions for both animals and workers. A second essential step is to forge a bipartisan agreement around redirecting a sizable portion of current farm subsidies to a national soil health and soil carbon sequestration program. A new deal for an age-old problem, but one path almost everyone recognizes as vital, and one that will deliver many other benefits over time.Chuck Benbrook"}, {"id": 490, "text": "My wife and I watched the film. I appreciated the hard work and thoughtfulness put into this important topic.My wife has a tendency toward being a vegetarian, so learning from her experience of viewing the film was insightful for me. The video did encourage her to decide to include meat in her diet a little more often. The part of the video that showed the way livestock are generally handled today was upsetting to her, with the hope that adding respect into the cycle of life was vital. The closing comments from the young farming couple from the NE and their reverence for their animals was encouraging. My wife and I have talked about the value of adding livestock to our land management strategies on a full-time basis versus a seasonal approach so the film encouraged this direction. In this regard, I would say the film was a success in getting a message across.For me, I have been involved with this work for 40 years now. I also do consensus building work. My takeaways were that there was too much emphasis placed on the issue of the vegans versus ranching. I think it would have been a stronger story if less power was given to ideology versus to rational thought. I do fully realize that there is an ideology issue, which the film brought out, but there was too much power given to that issue. I think the important components of the story, and the storytellers' messages, many who are friends from over the years, were good. I just think not focusing so much on the vegan movement and more on why the earth and humans need this component of life could have been more powerful.Of course, the video is done, so not sure how valuable this input is. All in all, it's a great video and I hope that it circulates well. There is a very strong misunderstanding in our society, including in the upper reaches of the US government, about the role of the ungulate and predator in restoring ecologic wellbeing while increasing rural and national wealth. This film does certainly add to the ability to shift awareness. Thank you."}, {"id": 491, "text": "On the recommendation of my neurologist, I bought the Sacred Cow book when it was released a few months ago. It fell very much fell in line with my way of thinking and gave me a much better understanding of the process of how meat ends up on my plate and what industrial farming is doing to the land.As for the film, my expectations were low. There are a lot of subpar, repetitive documentaries out there. This was not one of them. Beautifully produced, shot, and edited. Well thought-out and never preachy. My husband and I enjoyed every minute and even got teary in places (hubby won't admit it, but I saw). We run a small Mercantile in Winslow Arizona where there is a serious lack of healthy food options. Post-COVID, we started hunting for organic and specialty foods to stock in our store and every Thursday we do home delivery of glass bottled milk and grocery. We now want to add sustainably raised meat to the mix. It's a poor community but we want to do our best to get people eating better.If more farmers like the couple at the beginning of the film would make the change our world would be greatly impacted for the better. Many thanks to the filmmakers"}, {"id": 492, "text": "I was a vegetarian for 4 years, it started when I adopted my first dog and lived in the city. I was so emotionally attached to my dog that I decided not to eat animals anymore. I started considering an alternative route towards being environmentally conscious and sustainable when I moved to the Swedish countryside. I researched the same topics as the movie and soon I switched to eating meat once again but this time getting it from local, sustainable small farms. At the same time I stopped eating any kind of processed food completely. I really got touched by this movie as it depicted my own personal journey so well. It gives a clean summary of what went wrong in our world and how we can heal it via going back to the traditional and harmonious relation we once had.I think the movie tries its best not to be offensive towards vegans, but it still fails to do so. Furthermore, it could have diferenciate between the vegans who eat clean only and at least directly are not responsible for animal killing and the increasing number of vegans who goes right away into substituting their meat intake from fake unhealthy ultra-processed foods. Being vegan in its purest form is not easy for many, for all those people who cannot simply give up on meat getting their meat from sustainable sources is just so much more healthy and wiser than supporting big food conglomerates and buying their products made of toxic cheap garbage.The movie raises one main question: what do we want? Do we really picture huge monocoltural plantations with lifeless depleted soil and giant labs where our fake meat is being produced instead of harmonious natural scenes where our animals are roaming our green and healthy fields? Unfortunately, we are all pushed towards the first one although I assume most people would prefer the second."}, {"id": 493, "text": "Unfortunately, after years of the low-fat diet and cholesterol dogma, a large amount of prejudice has developed against red meat. To look at the issue from a regenerative agriculture viewpoint helps to bring the advantages and facts into the light. Our food system has come to rely on hyper-palatable, highly processed foods, based on seed-based mono-crops, supported by chemical fertilizers, herbicides and petro-chemicals. We've excelled at creating mountains of nutritionally poor foods which are making most of us sick with obesity, diabetes, heart disease, cancer and Alzheimer's disease. We need to return to nutritionally dense foods. Ruminant animals have been supporting humans for a long time.As a Family Physician, I have spent the past ten years using good nutrition as my main medical therapy. I have seen a low carb approach work tremendously well to treat diseases and also prevent them. I applaud Diana and Robb for working so hard to help show the world the rich benefits that ruminant animals can provide.The quality of film was impressive. Great cinematography. Many knowledgeable experts were interviewed. The pace of the film was very nice. Very easy to watch. Great job!"}, {"id": 494, "text": "Since we replaced dietary fats that we've been eating for more than a million years, first with industrial seed oils (Crisco was the first about 100 years ago) and later with high fructose corn syrup, we've just become fatter, sicker and more malnourished. Now, more than ever we need a strong defense against the proliferation of toxins everywhere. Industrial farming is not only cruel to the very alive and sentient animals, and the workers and farmers, but is literally destroying our soil and creating what is essentially a worldwide dust bowl.Unfortunately there is a food chain and animals are part of that food chain. I know if I raised farm animals, I would probably just keep them until they died a natural death. The idea of slaughtering animals is horrifying to say the least. But the farmers showcased in Sacred Cow give me hope because they believe that their animals should not only lead a safe, happy and dignified life, but also a compassionate end. Those are the farmers we should all support and - with our wallets - encourage more of them to reject industrial farming and switch to regenerative farming. I loved this movie and hope that it makes it squarely into the mainstream to counter the propaganda of Big Food (now owned by the tobacco companies)."}, {"id": 495, "text": "As a former vegan, who had no option than to go full carnivore in order to cure serious health conditions, I gradually understood that not only had I been mislead to believe that red meat is bad for your health, but also that the narrative about plants being better then meat for the environment and the animalts was not really true. It has been hard to try to make family and friends understand my new views, there is just so much to explain that is quite complicated. I had high expectations for this movie but I was overwhelmed by how well it managed to explain these things, while at the same time being really enjoyable to watch even for someone who already believe in its message. Now I have something to show others to make them understand what I believe is the best way forward for all off us.For all sceptical vegans and vegetarians I really recommend also watching the full length interview with former vegan Lierre Kieth, preferably before the movie. The movie does not really deal with how someone can be emotionally ok with killing an animal to eat it but the interview does."}, {"id": 496, "text": "Anyone interested in making an informed choice about how to behave and what choices to make with regards to climate change, public health, nutrition and ethics about the current food systems in our world would benefit from seeing this film and trying to understand the perspectives shown in this film.There is a positive moral, ethical, environmental, nutritional and public health case to be made for regenerative agriculture including animals as part of an ancient and modern way of farming.This film is not anti vegan: it is anti propaganda. For every complex problem there will be many simple positions which on the surface seem valid but do not stand up to closer scrutiny.There are solutions within our grasp for two of the calamities of our times: climate change and the pandemic of chronic disease including obesity and type two diabetes.This is a hopeful, optimistic, informative and thought provoking film.Thank you Diana Rodgers, Robb Wolf and everyone involved in the labour of love, truth, science and hope that is this film"}, {"id": 497, "text": "It's a well-written, well-balanced and well-paced film making a case for raising better meat.It's not cloying or melodramatic, and reminds (or teaches) us about the inevitable cycles of life and death, even in how we raise our food.I liked how the film covered many aspects of the ranching industry, from the importance of healthy soils on which the animals (should) graze, all the way to how they are harvested. Interviews with experts in various disciplines, from lunatic farmers (Joel Salatin and Polyface Farm are featured prominently), to soil biologists, to paleo-leaning nutritional experts. The treatment of rather militant vegans in one segment was surprisingly respectful, as the two parties find common ground. It also points out the history and idiosyncrasies in the federal nutritional guidelines (again, without going to conspiracies or attacking those behind it)."}, {"id": 498, "text": "I'm a recovering pre-diabetic obese (i.e., normal) American who used to eat the standard healthy American diet (SAD) and struggled to maintain my health.I learned better about three years ago, dropped an astounding amount of weight and got rid of a lot of issues that were undoubtedly related to chronic inflammation. I now have a better-than-average knowledge of nutrition and how the food we eat and the water we drink affects our health and well being. Even so, I'm not a farmer or a rancher; I had some vague generic concept of the food chain that mainly centered around what stuff to avoid in the grocery store.Sacred Cow filled in huge gaps in my knowledge I didn't even know were there, was very well presented and easy to understand. This is a valuable resource both for every person, from carnivore to vegetarian, to help understand not only where your meat comes from, but where your vegetables come from."}, {"id": 499, "text": "Ms. Rodgers, Well I just finished watching the film and it was informative, joyful, inspiring, and a pure joy to experience. My hopes are for you and these wonderful humans who participated, worked, and supported this needed reset of our worlds ways grows to the point of encompassing the earth and healing our lands, people, animals, and God's entire creation. Bravo on just an excellent job capturing a fair assessment of where we are at and more importantly where we should go firmly yet, gently. I loved all of those people in the film each connected together by heartstrings and felt their passion and dedication in their expressions of reasons to work in this field in this way. It affirmed their love for a kinder, more ethical approach to raising food, and a truer sense of love of their neighbors and planet. Well done! I have a request that via this e-mail give each and everyone of them a heartfelt hug from me. They deserve as do you as many hugs as you need to continue on. I did miss seeing more of White Oak Pastures as they are very dear to my heart in what they do and have a lot to offer as I would imagine almost all involved have. May you all have the courage to continue as this culture climate, Great Reset, by the globalists will oppose you as this is more a people for the people and people for the planet kind of thing and though they talk the talk and quack like similar ducks as those impassioned folks in the film they are not. May the good Lord watch over you all!Sincerely,Mike Moore"}, {"id": 500, "text": "As an Organic Regenerative Farmer in the Scottish Borders, I found this movie managed to highlight some of the key issues that need to be considered by all in relation to our food systems. It also makes them understandable for people from all walks of life. In my first class at Agricultural College in 1978, the first words I heard were :  As Farmers and Land Managers you are Stewards of the Land and you have a responsibility to make sure you leave the Land for the next generations in a better state than when you started. This movie guides us in that direction. With widespread distribution ,it may help to reconnect those that are so disconnected with the land and food production. We all need to again become, as Slow Food manifesto explains, co- producers, by helping us make better choices in our food consumption and drive change in our food production.We are part of an ecosystem which has got out of balance. This movie helps demonstrate that.Well done to all that have put positive effort and energy in making the movie and Good luck in bringing it to the attention of many more people. We shall be doing our bit at Peelham Farm"}, {"id": 501, "text": "I'm not a farmer or rancher but this book/movie makes me want to be. I watched the documentary but am not yet finished with the book. I hunt a lot and my dad preached conservation since I can remember. Hunting (and fishing) are how 80%+ of my family's meat is sourced. Knowing where your food comes from and how it makes it to your plate is one of my favorite things about hunting. I respect and honor the animals I hunt, so I can easily relate to the folks in the video who speak with such deference about the animals they raise, knowing they will eventually harvest them for food.The amount of research and rationale that went into Sacred Cow is impressive and I can't fathom how (or why) someone would challenge it. In recent years, I've seen a movement in my community (East Texas) toward locally sourced meat and produce, to the extent items are available. I love going into a butcher shop and knowing a neighbor sourced the beef or pork. And I've noticed the crowd at our local farmer's market grow in recent years. Change starts in your own home and smaller communities, so keep spreading the word! I'll be recommending Sacred Cow to anyone I have the opportunity to share a meal."}, {"id": 502, "text": "Thanks Diana and Robb for this work.Starting from the scientific givens and cultural history, and working towards solution suggestions that work in the modern era, the film is an engaging treatment of one of the defining problems for the 21st century: how to use the single planet to feed its human crew and their future generations.While most of the film used examples and contributions from USA - Africa and Europe were also represented. Since lower-tech, human-society-centric farming is the answer, the candidate solutions were scalable across the globe.I found it balanced and restrained, pointing out the consequences of the various ideas, from vegan to omnivore. The scientific contributions were of high quality and thought-provoking.A worthy addition to the discussions."}, {"id": 503, "text": "Full disclosure, I did not learn about regenerative agriculture from this movie, I was one of the thousands that contributed a small amount to help make it. My hope, however, is that others will come to understand just how important this solution is for the health of our soil and planet and ourselves.The makers of this film went out of their way to make the arguments for regenerative agriculture and the role of animal products in our diets without punching at the opposition. It would, no doubt, get more attention if the makers played the game the way some on the other side do but they smartly recognize that we all have the same goals and need to engage not enrage.The movie is intelligent, nuanced, and on the right side of history. We need this information now more than ever. Solutions are hard to come by these days but that's exactly what the approach is here. Please watch it and decide for yourselves."}, {"id": 504, "text": "This wonderful film is a much needed weight to counter the media-heavy narrative carried by plant-based and heavily processed foods.It leaves one with bigger questions. How do we use policy to enlarge grazing tracts so that they become viable for managed ruminant movement on scale?How do we re-integrate wilderness into these spaces?And how do we begin to prioritise the supply of nutritional foods to those who need it? We can no longer be satisfied with the poorest eating a bowl of rice or pap.And how do we ensure the quality of life and quality of death of each animal?We need to manage our land better. We need to manage our population better."}, {"id": 505, "text": "Nice cinematography. And now the issues with this film. A lack of interviews with experts and scientists. A lot of farmers and and the token ex-vegan who never really was. The film provided good coverage of a limited scope of arguments/topics, conveniently ommitting to include those that don't agree with the message of the film, to the point where this should be considered propaganda. The spin applied to chosen topics was at times humerous. The film didn't deal with scalability of high welfare animal farming, or talk quantatively about the output of it's proposed solutions, or the economic consequences of abandoning the high efficiency of intensive animal farming. Nor did the film talk about the general ethics of animal husbandry, in any form. Nor were any scientific studies mentioned in rebuttal to the new wave of pro-plant based studies the film talks about, neither were the accusations of disease risk in meat properly addressed. My only conclusion is that this film seeks to validate the middle class hypocrisy of paying more for better meat, while leaving the global equitable food system problem to anyone not trying to boost falling meat sales. Don't take my word for it, this'll surely be debunked elsewhere."}, {"id": 506, "text": "There were some good bits in this film, and useful contributions from farmers and food producers who are doing their best to do right by animals, their communities and their environment. It was only a handful of contributors that let the film down, but they are the ones that revealed the true motivations and left the less informed viewer with a false impression.Full disclosure, I eat some meat, and consider it a valuable contribution to my diet, but as an environmental and health scientist - some of the claims of this film are tenuous - at best.Granted, many claims by vegan societies are misleading, especially if you are based in the UK like me where our animal health and welfare standards are higher than in the US. And it's also fair to say that some parts of the media like to sensationalise findings about the health impacts of certain things in our diet, including meat. However, that's no excuse to dismiss it. There's no doubt that most of us in the West would benefit from more vegetables (as said in the film), but it's also true that many of us would be healthier if we reduced our meat consumption. This film skirts around that - giving the impression that health problems associated with excess meat consumption can be pinned on processed foods and sugars. And while I accept that not everyone suits a vegan diet, and that a healthy vegan diet can be very hard work, the impression that it's automatically very bad for everyone is false.The presentation of the fast vs slow carbon cycles was also misleading. Yes, some sustainable farming practices will lead to carbon sequestering, but mass meat production, including the production of feed stocks, contributes massively to climate change, and excess water use. Greenhouse emissions from most meat production vastly outweigh any drawdown. That the cows are younger than the plants that created the oil is irrelevant when there's more going into the air than coming out of it. Even when methane breaks down (half life is 9 years, so considerable) it breaks down into carbon dioxide and water, which are also greenhouse gases. Carbon dioxide has a half life of 100 years in the atmosphere.The idea that it's dangerous for schools to adopt Meat Free Monday was the biggest red flag about the insincerity of the documentary. It may be fair to say that for the poorest people in developing countries the benefits of occasional meat, eggs and dairy are considerable, but to segue from that into saying it's essential for every school meal to contain meat is nonsense. If a person eating meat is malnourished, the problem isn't a shortage of meat.The truth is that if we want to follow a diet that's kinder to our own health, and the planet then as a population we should eat less meat and only meat which has been reared ethically, and in a way that supports, not degenerates the environment.This film would have been much better if it had been more honest and admitted we need to limit our meat consumption and encouraged viewers to ditch the mass produced stuff. It left me thinking that the film wasn't intended to promote ethical meat production, but was using ethical meat production to greenwash all meat production.I had high hopes for this film, and think it's a shame that an opportunity to present a positive message was wasted, except it's become obvious to me that the point of the film was to encourage meat consumption. No wonder people are so sceptical of the food industry!A better film for those with an interest in the environmental benefits of soil health and regenerative farming is Kiss the Ground."}, {"id": 507, "text": "While this documentary (and the accompanying book) does a good job of gathering and presenting information regarding an ideal (and globally unachievable) better meat model, be warned that the package it comes with is filled with convenient half truths and distortions of facts designed to fool less informed viewers.More than a few items jump to mind (as someone who has spent the better part of the last year informing myself on both sides of the meat debate): a) the meatless movement DOES NOT seek to disfranchise poorer nations and communities who depend on meat consumption for nutrition - quite the contrary, arguments are constantly made even by the most hardcore parts of the movement towards the importance of policy making aimed at empowering such communities before a full transition would take place. b) it is NOT true that meat agriculture relies on soil that would be useless anyways - I am certain that most people are aware of the current situation in the Amazon. c) when defending the death is natural argument, the documentary conveniently forgets to mention that all animals raised for their products (either meat or even milk) are slaughtered at a very early fraction of what would be their natural life spans.It is perfectly understandable that people who do not wish to give up meat but are uncomfortable by the implications of its consumption will flock to this documentary. After all, it would be lovely to have our burgers not ethically but also environmentally and scientifically justified.However, achieving comfort by accepting a distortion of reality does not bring us anywhere. Regardless of where you stand in the meat-eating debate - whether you are a hardcore vegan, a ride-or-die steak lover or simply someone who is trying to understand where your food comes from and its impact in our world, surely we all appreciate our documentaries to be objective and honest, otherwise one is just as well served by looking for information in fictionalized dramas."}], "reviews_amount": 508}