{"name": "Paava Kadhaigal", "titleId": "tt13206988", "reviews": [{"id": 0, "text": "First story directed by Sudha kongara,the story happens in 90s Coimbatore taka about transgender men love shown by humidity is good and the other storys followed showed the different people in tamil society faceses with honours killings is good. It's is a good anthology to watch"}, {"id": 1, "text": "Don't guess that all the 4 shorts are tragedy based on the title and promotions. Vignesh Shivn's short is entertaining and has humor though it covers LGBT. GVMs part has his trademark voice over though I felt someone else could have played the father. Sudha Kongara's short set in the 80s captures brilliantly the love and hate relationship. But, the impactful one is Vetrimaran's last short with brilliant cinematography and Prakash Raj's signature acting. It covers what the whole family has to go through because of the lead lady Sai Pallavi. This anthology is definitely better than the other ones available in Netflix India!!"}, {"id": 2, "text": "This beautiful Movie Shows the Reality of Indian Society. Every Episode is brilliantly written and Executed. Just Watch it Guys."}, {"id": 3, "text": "A sheer compilation of bloody truths about the so called traditional practices, which are the actual sins of the society in India."}, {"id": 4, "text": "It's been a while since I have seen something as riveting as this from the Tamil movie industry, it takes a lot of heart to make such movies to compensate for all the ills the rest of us choose to ignore just because they are uncomfortable truths, truths that don't fit into the scheme of things that was labelled for us by the past to believe in, as our culture, as our tradition and our way of life. Life is all about the future that you may or may not experience. Every breath you take , every effort that you put in is with the hope that an experience that you have always been seeking awaits you in the end, and that experience would be meaningless if your efforts are burdened with the faults of the past, coming face to face with efforts such as these, efforts that seek your attention towards the present human condition is what will help you experience the future in the way a thinking human being with a lot of heart is meant to.. i appreciate the effort that has gone into making these 4 shorts ..."}, {"id": 5, "text": "Vetrimaran movie was very realistic and direction was comparatively better than other short stories. Vignesh Sivan movie was entertaining with comedy but was emotionally wandering. Sudha movie was offbeat and good. Gautam Menon film struggled like it was not his cup of coffee. Vetrimaran Oor Iravu - 5/5 Kalki kochein movie - 4/5 Sudha Kongara movie - 3.5/5 Gautam Menon movie - 3/5"}, {"id": 6, "text": "Mirror to our society.watch it you won't be disappointed"}, {"id": 7, "text": "This collection of 4 short films has 3 stories that are of very good quality. The one directed by Vignesh Shivan on the other hand is a stench rotten apple. Simply avoid that one and it's a fabulous collection of works."}, {"id": 8, "text": "A fantastic anthology from Tamil industry. Sudha kongara, Gautham Menon and Vetrimaran rocked! The 2nd director I don't remember his name, his story was funny and somewhat good. People who gonna watch dubbed version, watch it in og language coz Kalidas, Sai pallavi, Prakash raj, Simran did a marvelous job which you'll miss in dubbed versions. 7.4/10"}, {"id": 9, "text": "Very true and real story... Our country beautiful movie and very good performance all of you"}, {"id": 10, "text": "Vetrimaran will make you tremble.!!!!! - 10/10 Vignesh shivan did his best to give the message and sprinkled humour! 8/10 Sudha's part is missing something! 8/10 GVM should have better stuck himself with his elite urban drama! making things go down south was messy and unrealistic !!! 6.5/10"}, {"id": 11, "text": "If you have a strong heart please watch it. The 4 films was hard hitting especially Thangam and Or iravu was so hard hitting. The detailing on this films that are shown well executed. 2nd film was little bit hard but predictable but on the end 'TWIST'. A Wholesome Emotional Package and a Strong Message on 4 films. Must Watch."}, {"id": 12, "text": "Great Attempt Vetrimaran,SudhaKongara &amp; GVM makes perfect Story&amp;Screenplay. Great socialMsg from the Movie. All the scenes are realistics. VigneshShivn story is Little bit not going according to these Three. Actors Does Very well Outstanding. Finally Climax makes Masterpiece💥"}, {"id": 13, "text": "A must watch They have captured the reality as it is."}, {"id": 14, "text": "Sudha mam and vetrimaaran sir parts are just amazing, kalidaas jayaram, prakash raj and sai pallavi are amazing this series show the reality of what people did for thinking of honor in India, very sad but true"}, {"id": 15, "text": "It is as close to the reality as it could. Be it Sathaar's one-way crush/love, Aadh n Jothi's typical twin fights, Mathi's dilemma of being ostracized and Raj's egoistic honorComing to story line, Thangam is pure love. Love Panna is fun revenge. Vaanmagal slightly disturbing. Oor Iravu is absolute honor killing.Overall, it depicts the women (trans) of India, there are people for them but still they are fighting their own battles. There are few concerned but at the end they are left alone to perish.Direction - It is unfair to rate the directors, they all did their best. All of them did a good job, its just some story touches you more than the other."}, {"id": 16, "text": "Especially my fav is Thangam. khalidas, shantanu Acting was awesome. Anjali was rocking performance. Gvm script and Acting speaks really. Last one is little boring. So only I gave 8/10 ."}, {"id": 17, "text": "It clearly shows the homophobia , casteism in this country , the direction , story and the videography was phenomenal . It's a must watch . Hopefully this reduces the homophobia in this country"}, {"id": 18, "text": "Vetrimaran and sudha kongra are fabulous . But Gowtham menon was disappointing by giving some unwanted jokes inbetween a good scene . Vignesh sivan was totally bad as expected as he done before"}, {"id": 19, "text": "I gave 10 stars for tamil cinema came out of regular commercial movie...!! I love this anthology movie becozz of unique stories and fantastic castings... Especially transgender role,short guy,anjali,prakash raj,sai palavi.. Must watchable and should appreciate this kind of movies.."}, {"id": 20, "text": "Reflects the bad side of our society! Heart wrenched! Emotions captured so well! So glad to see a Tamil series with such a bold concept!"}, {"id": 21, "text": "If you have relatives who are bigoted about taboo subjects then make them watch this short films. If they are still being a dinosaur about this subjects even after watching this heart breaking stories then it's time to disown them. Only once I laughed (you will too and thanks to Kalki for that amazing curse word delivery) while for the rest of the episodes it was an emotional rollercoaster. Excellent direction, story telling and production. Everyone will have their own favourites but for me Sai Pallavi's performance was another level and I cried for a while even after her episode was over. Other excellent performers were Simran, Kalidas, Prakash Raj, Kalki and the young actress who played youngest daughter of Simran (sorry I don't the name of this actress)."}, {"id": 22, "text": "One hell of a ride it is, very heart wrenching but true to it core. All 4 stories in this anthology are masterpieces, directed and performed very well, perfect background scores and cinematography. It's pretty dark stuff so might leave you with a heavy heart, but it keeps you engrossed and does not resort to nudity and violence to lure audiences. If I had to pick one of them as my most favorite it has to be Thangam (Pride), take a bow Kalidas Jayaram; nonetheless all of them were mind-blowing! Glad India is making such content!"}, {"id": 23, "text": "Its not a movie for entertainment but everyone in India must watch. It clearly explains how social pressure makes people do things they dont like (includes killings) well said, hates off"}, {"id": 24, "text": "The beauty of this series is the way each stories have been told by perfectly balancing the relationships, showing mirror to the society and showing the inner animalistic behaviour of a human. This did not disappoint me as it shows a mirror to the society as what is really wrong it might be gender, patriarchy,religion and what not.Kudos to the actors and the people involved."}, {"id": 25, "text": "An outstanding collection of emotionally gripping short stories.. Loves the experience and the effort of the cast and crew.. The first and last episode had almost got me tears.. As usual Vetrimaaran steals the show with the amazing story telling.. Kalidas is evolving as an actor now.. Definitely worth your time.."}, {"id": 26, "text": "Such an beautiful anthology.....embraces the value of humanity"}, {"id": 27, "text": "Gowtham vasudevamenon sir episode literally I'm cryed 😍😍"}, {"id": 28, "text": "All 4 stories are amazing in their own depiction and kudos to all the directors for touching upon those subjects. Kalidas Jayaram simply nailed it with his performance and he deserves every bit of success. He owned the character and the nuances of it."}, {"id": 29, "text": "Hope this is the first step in changing the deep rooted society of inequality and injustice. Explains very well the behavior of each and every one of us during situations like this in our family and how we are spoiling our own family for the sake of community, society and the people who are no where to help us in such scenarios... Massive hit on exact crimes which are prevalent., People from Bollywood were comparing this against the Lust stories which is no where near to Paava Kathaigal. Our Tamil directors have the guts to show the reality, truth, inequalities in the society using the latest medium - OTT platforms, rather than showing the cheap lust which has become the so called modern as shown in lust stories.. for the North Indians...."}, {"id": 30, "text": "Sudha Kongara using a gem like Kalidas Jayaram, delivers one of the best stories.Prakash Raj, the best actor every seen working with Brave Unsettling Director like Vetrimaaran sir always gives high hopes and delivers best.GVM, himself behind the camera and also being as actor, gives us a smooth troublesome journey along with Simran.Vighnesh Shivan, the chill guy among all, plays around with Dark Humour makes us laugh and think."}, {"id": 31, "text": "Regional content and their reviews are often meleading and this series is the prime example of that! Poorly written parts and same old stories with poor performances takes it further down and that way this should be placed as one of the worst series of recent times. Stories which are there in this series have appeared numerous times on the screen and here they served the utmost mediocre versions of those things!! I can't really digest the obsession of this directiors to repeat the same rhetoric again and again, and indirectly ingest that regression into the minds of common people of the rural areas!"}, {"id": 32, "text": "Streaming platforms allow young directors and writers, globally, to come up with fresh new ideas and interesting films that meet the expectations of a global audience. This series meets none of those expectations and should have ended up a rubbish heap somewhere....maybe you tube!"}, {"id": 33, "text": "This was very well directed and scripted with some outstanding performances. Dark in some parts and terribly tragic in others. A reflection of the archaic norms that some societies force upon people."}, {"id": 34, "text": "I wasted my time on 2,3,4 episode....First episode is the only one which is well written and executed....Remainings are not that upto mark of first one considering direction and script"}, {"id": 35, "text": "The highlight of all the episodes is the first one for sure. Second one could have been better it was disappointing and last one was good and I don't wanna talk about gvm one."}, {"id": 36, "text": "Sudha Kongara's Thangam is the perfect start to Netflix's four-episode Paava Kadhaigal. It establishes the anthology's theme in the broadest and loosest sense, and this theme is honour: maanam. Among the first images we get is that of Sathaar (Kalidas Jayaram) admiring himself in a mirror. Himself is probably not the right word. Sathaar would prefer herself. She is saving up for a gender-reassignment surgery and refers to herself in the feminine, which must have been incredibly difficult to deal with in 1981, the time the film is set in. But then, with Sathaar, I suppose there wasn't exactly an option. With her swinging gait and lilting speech, she is not manly in the conventional sense - whether she wanted it or not, she was always out. And so she probably thought she might as well go all out: line her eyes with kohl, dye her lips with betel juice, and hope that her love (for a man) is reciprocated.READ THE FULL ARTICLE ON FILM COMPANION"}, {"id": 37, "text": "This one has set the bar.Paava kadhaigal wonderfully portrays todays reality.What makes this even more heartbreaking is the fact that most of these are based on true incidents and there might be so many more left unrecognised.This movie shines light on our sad reality and hopefully changes the minds of some people."}, {"id": 38, "text": "This is the mirror to show the india. This is the true events wich happened daily in india ."}, {"id": 39, "text": "There are a very few minus points in this anthology. Unlike the recent anthology in Amazon - putham puthu kaalai - which had 3 interesting and 2 totally boring episodes - this had all the 4 episodes engaging. The first one 'Thangam' is from Sudha Kongara. It has a period setting (I dont understand the need for this. Does this mean that the current situation for transgenders have changed in villages? If yes, then its good. ) We get a very good performance from Kalidas and Shantanu. It shows the feelings of transgenders and that they have a heart too. The second installment is from Vignesh sivan and it is the odd man out in this quadruple of films. Vignesh sivan has added a lot of humour to this dark story. And it works. But, 1 problem is everything is taken so easily in this short. Even Anjali's death and the fact that its her father who murdered her is taken so easily by the other Anjali and all the people over there. They all just move on as though it was just some minor toothache problem. You can enjoy this short, if you dont expect any message or ethics. Out of the 4, this is the most entertaining and has the most different approach and gives the otherwise-very-serious and horrific-anthology a slight comic relief. But, the fact that the villain gets away with all his murders so easily is something that we cant accept. There are a few other loopholes too. BTW, the GoT inspired character is interesting and funny. But, when such people are already discriminated and isolated in our society, depicting them as a negative, venomous-people-who-wont-let-others-live-happily is something that might affect them further. The final twist was nice. Third is Gowtham Menon's Vaanmagal, which has the most relevant and a much needed story for our society. That way it touches our hearts. It was surprising to see such a lower-middle-class-family story from Gowtham Menon. However, the director takes a long time to create the setting needed for the actual story to begin. That tested my patience. Also, though Gowtham was a great pair with Simran, some other actor in the place of Gowtham would have added more weight and meaning to the whole proceeding. Fourth and the 'best' of the lot is VetriMaaran's 'Oor Iravu'. It shows the ground reality as such. What leads to the terrible honour killing and the aftermath of it. Sai Pallavi and Prakash Raj were terrific. To me, the character of Sumathi looks like a selfish person who never cared to find out what happened to her family members even after she settled down safely with her boyfriend (now her husband).This is my understanding of the story **spoiler** - There is a conservative family which belongs to a casteist society. One of their daughters has fallen in love with a low caste boy and runs away with him, as thats the only way she can get to live with the love of her heart. Sumathi is now leading a rich, modern and independent lifestyle in a city and hardly cares for her family.Even after she settles down safely, she doesnt care about her sister's future or her parents lives. How her father deals with her is the rest of the story. To me, Sumathy looks like a selfish opportunist who is done with her parents because she needs nothing from them any more. Whatever she could get from them (like education and a good childhood life), she had already taken, and now, she only needs her husband. For instance, Sumathi's stoic reaction to her sister's loss of education because of her eloping away is due to guilt or is it due to her selfishness? If she had cared at all, she could have found out about the wellbeing of her family through some friend in the village (I mean, it is always possible to just find it , but still manage to keep herself hidden from her family). She had the choice. She says 'appa, I will make them study and get them married to nice men' only when it was a matter of life and death and she had to say it to save herself. Also, she doesnt show any signs of happiness on seeing her father in her apartment. So, in the last scene when she goes through that trauma, I didnt feel as much sorry for her as should have been. But, I guess this is really what the director wanted to tell us. Because we often think that the inflictor is evil and is leading a happy life after the honour killing and that the victim is a spotless, chaste, umblemished, pure person. The director here has tried to give the real picture of both the inflictor and the inflicted in an honour killing. We all know that honour killing is horrifying and evil. However, what we dont know is that, people who indulge in honour killing are not happily doing it. Even they are deeply affected. Also the victim is not a 100% pure person either. The biggest culprit here is the casteist society which needs to change."}, {"id": 40, "text": "All 4 movies are good in their own way just watch it."}, {"id": 41, "text": "Every episode will shed u tears n every tear worth it..... Go n njoy this...... No more second thoughts....!! Every actor played great n super fit...... Wat a flick...!! Worth watching.....!!!!"}, {"id": 42, "text": "Four well told stories with common threads of honour, dissociation of family ties and a force of hand by the baseless social rules.Paava Kadhaigal - is intense and makes one reflect on the human condition and how little we can really do to change it.Without picking favourites, Thangam - a story of sacrifice and unconditional love in an unforgiving situation - was beautifully illustrated. It was brave to leave out the pivotal incident - just the protagonist walking toward an imminent end.Oru Iravu - a poetic slow burn of emotions - where we are taken into plot where family ties and love take a turn towards an honour killing. Honour killings are familiar to the Indian landscape. Prakash Raj plays the role of the father with both love and remorse beautifully.Vaanmagal - Was great to see Gautam Menon play a role in this segment. What resonated with me was the role of the mother - played by Simran. A mother jostling within the societal limitations and the love for her daughters.En Fin -Love Pannaa Uttranum - A bit of dark humour doesn't soften the blow of the shocking plot. While centered around love and acceptance - the story speaks volumes of claws of a misguided cast system the entitlements it brings.As one reflects - we have ask ourselves - Have we really come far or have we created systems and roots that weigh us down..."}, {"id": 43, "text": "The only downside is s01 has only 4 episodes. 😔 We're familiar with the every events in our society. I wish the first season has at least 10 episodes like any other shows. I can't wait to watch another season."}, {"id": 44, "text": "I am a cinephile in the honest sense of the word. I have navigated every inch of ground of Indian film universe. I consume Indian cinema unabashedly. Without any inhibitions, without any pretense and without and apologies. However, I have hardly watched anything like Paava Kadhaigal. It is an honest representation of a society as abominable as India. As an Indian, I was angry, I was ashamed and I was immensely sad. Go watch it. Otherwise, not watching it like being born but having never experienced light."}, {"id": 45, "text": "Best life fact script that we all want realize in our real life."}, {"id": 46, "text": "The three directors- Sudha kongara, GVM and Vetri Maaran are the best and have proven again they are best in-class. Kalidas top-notch performance. And Vignesh Shivan proves he is not a good director time and again. Few YouTube short films are better than Vignesh Shivan's direction."}, {"id": 47, "text": "All story and shortfilms contain good dialogue and depth."}, {"id": 48, "text": "Vetri - Ultimate direction and cast Vignesh - Entertaining with message Sudha - it's all about Sathaaaaaar... amazing talent!!!! GVM - Good climax.. except for the fact Gautam and simran did not do just to the role.. it was good."}, {"id": 49, "text": "I have never bothered to give any reviews to any movie I ever watched. I just paused the first episode at 25 minutes to write this review. I had to. I have watched several Hollywood &amp; Bollywood movies, this will go down as one of the most soul shaking acting by Kalidas Jayram. His acting has just the right intensity to deliver something so real, the emotional journey he takes us through in such a short interval of time goes to show the class of this actor.As far as the series goes I have just watched the first 25 mins so far and I have high hopes from other episodes. I am quite sure I won't be disappointed. This rating was just for the first 25 minutes of the viewing and for the masterclass acting by kalidas jayram"}, {"id": 50, "text": "Paava Kadhaigal got me emotional on various scenes. It gives voices to the issues which are usually buried under the blanket of societal norms. All the 4 stories are beautifully executed. The whole concept of honour being considered as an important factor than humanity is clearly shown in this series."}, {"id": 51, "text": "Really excellent movies..vetrimaran just nailed it .."}, {"id": 52, "text": "Ever want an ending to be different...hope the ending is not just what you watched?"}, {"id": 53, "text": "Except vetrimara episode, I don't feel intense in any episodes, especially the movie with Anjali was extremely spoiled by the directions. When you touch base such sensitive topics, the movie should convey the same intense with audience."}, {"id": 54, "text": "Watching this will make understand why Vetrimaaran is one of the best director in Indian cinema. None of the other episodes made as impact as his episode. The quality his episode provided with respect of other episodes was huge. All the performances were great. 1st episode by Sudha Kongara was okay with a great performance by Kalidas Jayaram. 2nd episode sucked and I didn't like the performances too. 3rd episode by GVM was also disappointing. Then comes the master Vetrimaaran with his heartbreaking final episode which will steal our heart."}, {"id": 55, "text": "Well as u can see the heading it's just a copy with some dark and intense scenes but there was nothing new coz I have already seen all kf this before. Dissapointed. Nothing new plus weak plots."}, {"id": 56, "text": "Paava kadhaigal... What a title.. Title is negative as so the series except vignesh sivn story.. Already society is full of negativity and sadness then here comes the series with negativity impacting the society as extra.. With a bunch of talented directors and actors why can't netflix show some positivity in this gloomy covid situation..."}, {"id": 57, "text": "I liked only Thangam movie, other short movies are boring. Nothing new to offer but some performance was good! Not everyones cup of tea, yes this cant be served for me as a whole!"}, {"id": 58, "text": "Though the direction and everything was good. the stories was full of negativity and motivating ppl toward bad things. Worst series ever."}, {"id": 59, "text": "The sensibility required to pull off these themes are not pervasive in the mainstream film industry. To stand outside and judge the actions of our own culture involves owning our vulnerabilities. There is no objective point of view from where we show what actually is happening. We can only show a subjective point of view and say this is how my subjectivity is relevant. Only one film in this anthology really allows its characters this reflection, that is Vaanmagal, and that too through a backdoor. Watch A Touch of Sin (2013), another anthology about judging one's own culture, if you want this sensibility."}, {"id": 60, "text": "Story is good by why all stories are negative as if all humans are deeply suffering and good people will always suffer. We all have so much difficulties in our life. Atleast in movies show us something to enjoy without worrying. We will be happy for a while without any worry. Why focus on the few problems thats happening in the world while there are so many good things happening than bad things."}, {"id": 61, "text": "4 stories. 4 directors. For me there were only 2 positives. One is the director Sudha Second, to see Sai and Prakash Raj together.I expected a perfect casting, since it's only a 40 minute story telling sequence. But utterly disappointed. Sudha maa'm is a splendid director. She can even make a dead wood act well. Vignesh Sivan's second was bang average. Gautam Vasudev Menon's third was made with a good plot but ended poorly. They message was clear but it should have been something different visually. Vetri Maaran's last was the best of the lot just because of the casting I would say.Overall, this package is a waste of time. I wrote this, just because I am annoyed."}, {"id": 62, "text": "'Discrimination' is a word that has become a part of our vocabulary for years now and practised in our society for as long as we know. Paava Kadhaigal that hits Netflix today brings together 4 of the most woke and noteworthy Tamil filmmakers Sudha Kongara, Vignesh Shivan, Gautham Menon and Vetrimaaran to create an anthology that portrays shades of discrimination and what it costs to the people who dream. While Sudha's Thangam left me shattered, read on to know what I felt about the others."}, {"id": 63, "text": "Some films leave a mark for their warmth and positivity. Some do because they make you feel terrible. Paava Kadhaigal is a film in the latter category where the purpose of each filmmaker (it's an anthology of four stories) is to evoke a sense of dread, disgust, and sadness, and they succeed in making us feel so. Honour-killing is the central thread that runs through each of the segments, but the directors add various nuances to their respective lead characters (apart from their distinct film-making styles i.e.) rendering them all unique and memorable. Family isn't the safest place for the leading ladies in Paava Kadhaigal, especially when they've decided to swim against the flow. Does that count as sin?Thangam: An excellent show by Kalidas Jayaram (playing a transgender) drives this segment. This is an actor I've grown up seeing perform miraculously as a child artist but never got to shine as an adult. In Thangam, he gets his due. Shades of that original brilliance were felt in his character Sathaar, who is detested by nearly everyone in the village except for a best friend (played by Shantanu). Apart from the honour-killing aspect, it also tackles gender and religious issues without overcooking them. It does get a little dramatic towards the end, but as in Sudha Kongara's Suriya-starrer Soorarai Pottru, the despair is wholly felt.Love Panna Uttranum: A dark comedy segment with a few Vignesh Shivan™ flourishes, this one keeps things unpredictable. It may be the weirdest of the lot, but it also made me laugh (the dwarf who played the main thug is splendid!) and feel perturbed at the same time. It's likely to be viewed as weak when compared to the plot strength of the rest of the segments, but at least Vignesh was sure of what he wanted to portray. The dialogues are inventive and the quirky camerawork supplements the tone of the segment well.Vaanmagal: A Gautham Menon film is usually one where family represents the safest zone for anyone. In this segment, he tries to subvert the idea, especially with a strong showing from himself (he's doing just fine as an actor) and Simran. Yet, it didn't strike me as a believable notion, especially knowing Menon and his familial signatures. There's a musical interlude, but thankfully no voiceover narration. It gets blood-soaked towards the end and comes packed with a twist that toys with our perception - one that didn't have the same level of impact as the other episodes.Oor Iravu: As far as the theme of honour-killing goes, this one is the most conventional. And that is if you conveniently forget the massive spoiler that was shown at the beginning of Vaanmagal. Vetrimaaran's powerful storytelling and choice of frames are worthy of many a discussion. He ignores the musical interludes of the previous segments, uses musical score minimally, and plays with two timelines effectively. This is also where the agony (associated with honour-killing) is showcased in chilling detail. Prakash Raj and Sai Pallavi are both brilliant here.In totality, Paava Kadhaigal is one of the stronger anthologies to have come out in 2020. It is dark and disturbing for sure but in the hands of these talented filmmakers, the quality of work is solid."}, {"id": 64, "text": "When it comes to the topic of protecting one's own Pride,Honour and dignity ,human beings are selfish and show their true colours even though they pretend to be 'united' and 'secular'.Paava Kadhaigal tells the devastating stories of four different incidents with the same core theme of protecting one's Pride,Honor and Dignity and how these four families would go to any extent to protect them.Thangam ,the first segment directed by Sudha Kongara is a hard hitting one, the emotional story of Sathaar,a transgender played by Kalidas Jayaram will leave you devastated. Set in 1981 Coimbatore ,the period was perfect and very convincing for the story.Shanthanu does a neat job as Saravanan,all the characters were seemingly real.The direction,score,visuals,writing all were top notch.The only negative I found was that the ending was pretty disturbing and dark ,for an extremely sensitive person like me would weep in the corner crying and thinking about Sathaar .My rating for My rating-4.75/5Love Panna Uttranum, The second segment directed by Vignesh Shivan feels like a 35 minute scene taken from the middle of a movie.This is more of a dark comedy type which is not my cup of tea,but it was not too bad.The segment was entertaining in its own way.The dwarf character was really hilarious and probably the only saving element of the segment.Anjali and Kalki does a pretty decent job as a lesbian pair fighting for their father to accept them.The writing was witty and emotional in equal portions.The characters were half baked and some characters were directly inspired like the rapper Bhavani was an exact copy of Snoop Dogg.Overall it was enjoyable. My rating-3.25/5Vaanmagal,directed by Gautham Vasudev Menon.A middle class family's dilemma when their pre-teen daughter is kidnapped and physically abused by her brother's college mate,the segment then progresses on how the family reacts to the incidents and its aftermath .GVM has done a fair job in directing and portraying the emotions of a heartbroken father at the same time. Simran's performance as an orthodox Tamil mother was the main highlight of the segment along with other actors who has done their part with full dedication. Simran's character 'Mathi' tries to inculcate her values into her daughter,Your body is like a temple and you must learn to protect it is what she teaches her daughter.GVM's segment is something where I had high expectations but it slightly disappointed me especially towards the end .The score, visuals and dialogues were situational but the only negative I felt was that the tension shown in the movie was not seemingly believable and the climax was abrupt and aimless.Overall watch it for the story and performances My rating-3.75/5Oor Iravu ,directed by Vetrimaaran.The best among the four and the most 'disturbing' segment.Estranged from her family, Sumathi a now pregnant woman elopes with a man of different caste against her family's will.Her father brings her home to put up a baby shower function, the events following her arrival in her family home remains the crux of the story.Sai Pallavi and Prakash Raj has done a fabulous job in making the characters seem believable .The scenes where Sumathi gets poisoned and begs for help will really churn your stomach and make you cry.Vetrimaran - A level 999 master in his craft has molded out an intense,gut-wrenching and disturbing segment which has some incredible performances,fast paced storytelling,thrilling score and portrays a very dark side of our society . My rating -5/5"}, {"id": 65, "text": "This is exactly the type of content Tamil cinema and India in general needs. If you take a look on banned movies in India, you'll see a lot of movies featuring LGBT content. This anthology is a voice for the voiceless. Paava Kadhaigal shows four short films that'll cover the barriers in our society.Although for my taste it was little bit too rushed, Sudha Kongara's segment Thangam was good. Especially the character Sathaar and the actor Kalidas Jayaram were a delight. After Superdeluxe finally there's another transgender character - emphasis is on character - with actual feelings, dreams and desires.Vignesh Sivan's segment Love Panna Uttranum was a little disappointing for me. It's a dark comedy. The title makes it very clear what it's about. It wasn't bad, but the direction was very unclear.Now a big surprise for me was Gautham Vasudev Menon's Vaanmagal. This was my favorite. I'm not big fan of GVM's recent movies. But finally he's back - fantastic storytelling with his characteristics, but they didn't feel forced. I had goosebumps till the end. I believe this short film about woman's safety covers aspects not everyone talks about. The whole cast and crew was great. My favorite here.And the last one Oor Iravu, directed by Vetrimaaran, was fantastic. He's known for gritty and realistic storytelling. This is a perfect example. Sai Pallavi and Prakash Raj absolutely hooked me. And only rarely you'll see such an organic character development without forced perspectives.Hats off and thank you to everyone involved. I think all of these shorts made it very clear that those who have a voice have to share their voice. Change doesn't happen without any change. So this is hopefully not only a little change for the film industry, but for the society, too."}, {"id": 66, "text": "Paava Kadhaigal is yet Netflix anthology film. This time these short films revolve around a central theme of sin and honour.The four films have four different take on this concept. Out of the four, Oor Iravu and Thangam are easily better than the other two. Prakash Raj's performance in OorIravu sets a benchmark. Whereas, Kalidas Jayaram's performance in Thangam seems promising. Technically speaking the last film stands out from the rest. The only short film which is edited, directed and performed meticulously. Otherwise every other film has some problems, specially Love Panna Uttranum (2nd short). It has an incoherent screenplay which continuously shifts tone and hence not very pleasant to follow.Similarly, every other short apart from the last one, seems exploitative of the themes they are presenting. But having said that, this film pushes the envelope of good cinema and poses genuine questions to audience.A good watch."}, {"id": 67, "text": "I'm gonna tell about 4 stories separately1. Sudha Kongara- This ep turned out to be brilliant only and only because of Kalidas Jayaram, he nailed the role of Sathaar2. Vignesh Shivan- Okay this one was not anything emotional, but it fits to the mood exactly, humour worked out at parts and the message has been received3. Gautham Menon- Never thought he would look good look and match acting levels of Simran ma'am, this story worked out well too4. Vetrimaaran- Oh man this was soo heart breaking, even though knowing what would happen at last, I simply couldn't control my tears, Prakash Raj and Sai Pallavi lived in their rolesLastly, this is the best movie of 2020. Thank you Netflix for giving us this great thing to end this year on a high note"}], "reviews_amount": 68}