{"name": "Funny Boy", "titleId": "tt13345636", "reviews": [{"id": 0, "text": "This doesn't represent the srilankan tamils.the language they speak is not at all Tamil."}, {"id": 1, "text": "What language is it that they are supposed to be speaking? Tamil? This is not how Sri Lankan Tamils speak. Tamil is not spoken like this anywhere. This is not only disrespectful to all the Tamils, but spoils the whole movie experience :("}, {"id": 2, "text": "Engaging stories come from diving deep into the personality of a life or event. The more we lean into the details, the more universal truths of human existence are revealed.This movie was clearly made by a director with no connection to the issues at stake, and it flops because it tries to tell a universal story about a person who really deserved to have their own story told .. The book is a quick read but it is much more nuanced. This film is just another boring, flat take on a story we have all heard before."}, {"id": 3, "text": "A movie that capitalises of Tamil people and their struggle was made, without any Tamils and instead with the Sri Lankan regime that commited the genocide against the Tamils. The actors in the movie cannot even speak Tamil. The director Deepa Mehta even belittles the Tamils, who fled from the war in an interview and silence or ignore any valid criticism from the Tamil community. Def not worth watching a movie like that."}, {"id": 4, "text": "The entire setup is a joke. This movie puts you asleep in no time! You get a feel that someone who does not anything about that space, the country, the people is doing a film on that matter. If I had one word to describe this it would be fake. If I had two, I would say not authentic."}, {"id": 5, "text": "Totally disappointed. Didn't focus on what Tamils faced and fought for. What else can we expect from this poor director"}, {"id": 6, "text": "Butchered the beautiful Tamil language. I love Deepa Mehta's work, I watched 'Water' and was so amazed. So I was surprised that Deepa Mehta made this movie! No attention for details and zero efforts taken in learning the proper pronunciation of Tamil words."}, {"id": 7, "text": "Save your time and watch a better movie. The director is someone who is corrupt."}, {"id": 8, "text": "This movie is an imposition. The Tamil language is so beautiful, but in the movie it is dragged into the dirt by non-Tamil actors. To make a film about Tamil history without native Tamil-speaking actors, that's a shame.In the scene in which the song Paatu paadava (one of the greatest Tamil songs) is sung: your ears bleed. How dare they...The movie is not recommended. 0/10 points"}, {"id": 9, "text": "Horrible interpretation and representation of the book. Waste of time."}, {"id": 10, "text": "This movie was an absolute disappointment. It silences and oppresses the very people the movie is about... It makes a mockery of the genocide against Tamil people by the Sinhalese government. Not one Tamil creative was casted for the main cast. If you support this movie, you are supporting ignorance and racism."}, {"id": 11, "text": "Disappointing. Director Deepa Mehta has done little research into what is required to make this story honest. Lack of Tamil actors, butchering the Tamil language, collaborating with the government that supported the genocide of Tamils, using people if the same race as the perpetrators of the riots shows lack of understanding, empathy and simply lazy casting..Someone else should remake this film and it probably will turn out better."}, {"id": 12, "text": "This is a great book that deserve to be protayed fairly. Disappointing that the director has not apologised by the lack of representation"}, {"id": 13, "text": "The misrepresentation of Tamil characters by pakistani and sinhala actors is awful and the tamil in this film is atrocious.. nobody wants a movie by a genocide enabler that mehta is.."}, {"id": 14, "text": "The amateur acting skills in this visibly low budget book adaptation are painfully funny, reminding you of a sincere but mediocre film school project. I am disappointed in Metha, a usually reliable director of issue based movies, for allowing the bland and one dimensional acting to stay.This is all way before the unconscionable and sadly laughable Tamil language spoken in the film. The accents are so silly sounding, we could not help laughing each time they spoke. If making non-native Tamil speakers speak was going to bring a sense of authenticity to the project, it was an abject failure.We sadly could not get passed these glaring errors to even discuss the subject the film was trying to preach. The grossly unfair treatment of the Tamil people in Sri Lanka, and the fact that being gay is illegal in the country."}, {"id": 15, "text": "This movie is terrible. Western audiences will love it because they are probably unaware of the reality this movie tries to depict (see rotten tomatoes ratings), but oh boy is this film a joke. The Tamil spoken in the movie is spoken 99% by non-Tamil actors. And the Tamil spoken in the movie sounds completely out of place! This movie is not made for the people it claim to represent at all! They couldn't cast Tamil actors/actresses for the movie, but could film in Sri Lanka? The director Deepa Mehta's motives have been questioned by numerous human rights groups and activists due to her close connection to the ex SriLankan President who is an alleged war criminal that oversaw the genocide of Tamils - the very community, and the race issue this movie depicts. How ironic is this movie. I can't believe movies like this get made in the west, for the west and go on to win awards. Absolutely distasteful."}, {"id": 16, "text": "The film is promoted as a tamil movie My mother tongue is tamil and I needed English subtitles to understand the tamil spoken you know the quality of the film. A big no I would recommend not wasting ur precious time in this movie A director Deepa Mehta could have done way better"}, {"id": 17, "text": "Not only does this movie seem like a play directed by a teenager, having spoken tamil fluently at home, I needed subtitles to understand what's being said in the movie."}, {"id": 18, "text": "Mehta collaborated with the genocidal Sri Lankan government which systemically murdered tens of thousands of Tamils. In a movie supposedly about Tamils, the leading protagonists are all Sinhala, the Tamil dialogue is horribly done, and clearly there was no effort made to actually consult Tamils during its production. This movie is especially awful considering Mehta's (who is Punjabi and not Tamil) erasure of Tamil suffering and trauma. Do not watch this movie."}, {"id": 19, "text": "I just watched this film, and I enjoyed it so much I rushed here to give it my rating - My decided rating usually reflects the overall IMDb score. Therefore, I was surprised to find a 5.5 score. However, I saw that one person gave Funny Boy a 1-star rating based on the fact the language spoken was incorrect. Seriously? This film does not bill itself as a true story; it is a work of fiction set in a location and period of historical significance. But even so, no mature person rates a film based on one flaw. What about cinematography, the plot, the dialogue, the acting, etc. All these things should inform a person's score. Therefore, this film deserves a far better score than what it presently has."}, {"id": 20, "text": "Film really did justice to an incredible book that touches on several important issues.Hope it will be a real contender at the Oscars."}, {"id": 21, "text": "Watched this movie on CBC Gem and was APPALLED by the lack of accuracy in regards to the novel 'Funny Boy' and historical events that led to the Sri Lankan Civil War and Genocide of Tamils. After watching the movie, I checked the cast and was surprised to see that the roles of Sri Lankan Tamils were played by North Indians, Pakistani and Sinhalese actors instead of actual Tamil actors. The dubbing of these actors were quite atrocious as well. They could not speak Tamil at all. I'm quite interested to see how this movie will turn out since it is also Canada's Tamil Language International Movie Oscar submission."}, {"id": 22, "text": "Many aspects of this film are fascinating, like the scenery and location shots. Cannot speak to the 'Tamil' voice/accent issue which is of concern to many. I did read that there has been a lot of voice dubbing which would explain why, at times, the spoken English(unsubtitled) is difficult to understand. The meat market scene is presented without appropriate context. I found the scenes where the main character was jumped back and forth in age to be annoying rather that developmental. However, the film does seem to capture well the trauma of being caught up in ethnic/religious disputes."}, {"id": 23, "text": "A love story for turbulent times. I thoroughly enjoyed this film. It was a gentle film, Beautifully photographed, well acted and gave one a clear picture of how it must've been at that time. The love stories were all excellent and evocative."}, {"id": 24, "text": "You like it or hate it... the director is an international fame and loved her other works esp Water which was also nominated for Oscar ....this movie is based on a book by Shyam Selvadurai.. it is a coming-of-age story of a boy in 1970s Sri Lanka amidst uprisings, tensions between Tamils and Sinhalese, ethnic riots... although, author stated that it is not really his biography but it does appear as his personal narrative when I read about him.. but disappointed with the middle-of-the-road and 1980s style direction, performances are average too... a multitask watch..."}, {"id": 25, "text": "After reading all the below reviews it seems that Tamilians got offended just because of the language spoken in the movie. Are you guys really a viewer or trollers?"}, {"id": 26, "text": "In 2020, the two ingredients guaranteed to interest the aging voting members of the Academy are, BLM centric issues and to a lesser extent queer discrimination. Both neatly packaged in this lightweight movie by Deepa Mehta, best known for her Elements trilogy. The film is directionless, it doesn't really try to question or answer any of the long standing issues Sri Lanka has with its minorities and its intolerance of homosexuality, instead, we are given some half baked Reader's Digest-esq entertainment that's neither well directed or scripted. If you said this was Mehta's first effort, it would have made sense. As for most of the actors, according to IMDB, it *was* indeed their first attempt at the big screen, and it is obvious. Stilted english, strangely over pronounced, the amateur actors were excruciatingly 'aware' of the rolling camera, making the audience both smile and cringe, like one would do watching your teenage niece acting Juliet in the local church fundraiser.Not being a Tamil language speaker, I can't say anything about the accents used, however, reading the multiple reviews by native Tamil speakers that have uniformly panned the way the language was brutally mangled, I consider myself lucky.My takeaway; it's a bit of pseudo Bollywood fluff with unfortunately not enough song and dance routines to make it slightly more memorable."}, {"id": 27, "text": "Arjun is Tamil boy who realises he's gay in a country that criminalises people like him. The movie follows his life from childhood to young manhood, set in Sri Lanka during the ethnic war that resulted in somewhere between 100,000 and 150,000 deaths, and one million Tamils migrating to India, Canada, and other countries. The story is one damn thing after another. The messiness, almost incoherence of the script, mimics this, but also distances us from the characters, who become objects moved around by events that they don't and can't control. Arjun's relationship with Shean doesn't free either of them, it's at best a brief time of mutual joy which can't resist the politics surrounding it. The acting is uniformly very good, helping us Westerners understand a culture so different and yet oddly similar to our own. I get the impression that Mehta had a clear vision of what she wanted, and it wasn't a neatly structured plot tied up with a neat bow of a resolution. I think she also wanted to show how avoiding politics is no defence. The movie was engaging despite itself, the kind that tosses up half-recalled scenes when you least expect them. Worth watching, even if only to get a vague notion of what it's like to live in a different society than your own. I read a number of attacks on this movie, all of which focused on two points, and which all betrayed that the critics had political axes to grind. Pity."}, {"id": 28, "text": "So many 1 star reviews from people who have not even watched the film. Don't go by these empty-handed reviewers: please watch the film before passing judgment. The film is a perfect balance of personal and political. The cinematography and acting is brilliantly executed. For those curious about the controversy, I encourage you to look up for yourself, interviews conducted with the writer himself on the topic (Shyam Selvadurai). He is from a mixed race household (Sinhalese/Tamil), and his intent with the film was to show *his own story* of a young boy's sexual awakening in Sri Lanka that coincided with the start of a long civil war. For people to try and manipulate his story to serve their political agenda is utterly absurd!It is a shame that this gorgeous film is getting unfair flack in the media from particular fringe groups who are interested in only stirring divisiveness and conflict, which is contrary to the spirit and vision of this beautiful film; one of South Asian solidarity and togetherness."}, {"id": 29, "text": "Funny boy is something most Sri Lankan teenagers (who grew up in the late 80s and 90s ) can relate to. We lived most of our lives through a devastating civil war for over a decade. We suppressed so much during this time. Watching the main character struggle with expressing himself is so relatable it hurts! As much as I love Nimmi Harasgama, I think Brandon Ingram, Rehan Mudannayake and Aaarush Nand are definitely divas to watch out for!I understand the controversy surrounding the casting, but as a Sri Lankan I stand by the artist's decision. It is a beautiful story Deepa Mehta wanted to share with us, and we need to respect the creative team and their decisions.I wish the entire cast and crew the very best at the upcoming Academy awards! YOU GUYS HAVE MY VOTES! ( this includes my 10,000 other personalities.)keep slaaaying!"}, {"id": 30, "text": "Prolific Indian filmmaker Deepa Mehta's latest achievement is a tender coming of age gay story with a strong political backdrop. Set in late 70's-early 80's it depicts the horrors of racial prejudice against members of a Tamil community in the awakening of the civil war in Sri Lanka. The narrative focuses on the development and sexual arise of a young boy, who since his early ages demonstrates his interest in the feminine universe, as well as a courageous expressiveness of his true personality. As a kid he battled bullying in school and prejudice at home, while his parents are engaged in the political conflicts; as a young man he discovered the fascination of American/British pop culture, while developing his first romance with a lonely richer boy; As the crisis intensifies and most of his community are threatened and attacked, they plan a escape to Canada, interfering somehow in the boy's sudden process of figuring out his identity and place in the world. The director unveils social, political, gender and cultural issues seen through Arjie's boyhood and varied experiences with a world he doesn't belong to. It's only at the moments of intimacy and entertainment provided by his encounters with his boyfriend, and the acceptance found on his aunt's approach that bring him a sense of ease. Canada's Official entry for the Best International Film at the 2021 Oscars, Mehta composes an affecting, lively and free-spirited, historically accurate and family-friendly LGBTQ tale."}, {"id": 31, "text": "I plead ignorance to what happened in Sri Lanka, prior to watching this movie. I understand if people are disappointed if it wasn't Tamil people playing the parts. But I'm SO glad I ignored 95% of the reviews on here. This is a good movie. People are rating it so poorly because of politics (as I say, they may have a point but that's not *my* point).I'm confident the majority of 1 star reviews are written by a few people with multiple accounts. It's a shame, as if I had listened to them - and avoided the movie, I wouldn't have learned what happened. I am now (because of this movie) more aware and have since read up on what happened. That wouldn't have happened without this movie.But anyway! I was gutted when this ended, and it made me feel plenty of emotions. I got angry, I got upset when I related to the little gay boy so much, I laughed at the brazenness of the sparring kids, and I mourned what happened between the two people.If like me you're looking for a movie that will make you feel and make you think - I'd definitely recommend Funny Boy."}, {"id": 32, "text": "This is a movie set mostly in Colombo in the 70's and early 80's. It is about sexual awakening and sexuality, racial prejudice and violence, but above all, it is a about forbidden love that crosses racial boundaries. Full marks to the director, producer and script writers who successfully weave a complex story which will appeal to a wide audience, not just a Sri Lankan one. Surely, this has to be a strong contender at the academy awards. Little Arjie played by Arush Nand is absolutely delightful. There are strong performances by Agam Darshi as the streetwise aunt Radha who loves and nurtures little Arjie, and Nimmi Harasgama as a typical Sri Lankan mum who is burdened with societal pressures and expectations. The older Arjie played by Brandon Ingram is somewhat unconvincing, but overall, the movie is highly recommended.As someone who lived in Colombo during the 60's and 70's when ethnic problems were starting to get serious, I can understand only too well the kind of thinking that prompts certain viewers to give this movie a zero or 1 rating. Please don't be put off by such comments, it is well worth viewing.As for those who complain about casting non-Tamils in Tamil roles or the lack of authenticity of spoken Tamil, I wonder how upset they would be if they were to learn that Irish actor and Oscar winner Liam Neeson played German industrialist Oskar Schindler in Schindler's List, or that Oscar nominee Marlon Brando who is of German, Dutch, English and Irish ancestry played Sicilian Don Vito Corleone in The Godfather! They'd be absolutely livid! Besides, is there a good pool of Sri Lankan Tamil actors who could fill these roles? Maybe there is, then again maybe not. Regardless, Deepa Mehta and Shyam Selvadurai have brought us a gem."}], "reviews_amount": 33}