{"name": "Totally Under Control", "titleId": "tt13065386", "reviews": [{"id": 0, "text": "Was this an informative documentary? I say yes. Was it a pleasure to watch? I say no. Do I agree in a political way with the facts they try to depict? Well, I can check all of that myself.I see ratings of 1´s and 2´s because people don´t like to see Trump being criticized, but what does an opinion has to do with facts? Look it up, check it, if you find errors write them in your review. But to slash something because it doesn't fit your views, that´s kind of silly to me.I think it´s worth to watch but don´t expect to be happy at the end. Because this is about the failure of a corrupt system and the people managing it."}, {"id": 1, "text": "The truth is out now -- if any doubt remains for the masses of non-voters (100 million in 2016) and the undecided. This meticulous film can be wince-inducing as it carefully assembles the disgusting FACTS that finally make it clearly understandable just how the US government, corrupted under Trump, completely failed us with their shockingly pathetic, deadly mishandling of the pandemic response. Those who have been on the front lines are seen &amp; heard leveling with the people, telling it like it is. Not to be overlooked by any sane individual. Get the word out."}, {"id": 2, "text": "Much of what is covered in the film is known, or could be known with some research. The value of Totally Under Control is the way the film lays out, step by step, the timeline of this tragedy. Here's hoping that we do, in fact, learn from this horror show and take steps to be better prepared for future emergencies, whether pandemics or other natural disasters. The more the public questions leaders and demands transparency, the better."}, {"id": 3, "text": "The world health organization offered tests for free that the world was using in January and February. Those were refused...wanted to make their own for some rea$on?"}, {"id": 4, "text": "Not living in the US, I wondered how 220,000 people died needlessly so fast. This movie shows the exact timeline, the responses by the negligent Trump government to a tee and in detail. This shows how a manager of the most important country in the world had COVID 'Totally Out Of Control'! Like in this movie &amp; in books the loss of life due to COVID-19 will be forever remembered like the Spanish Flu of 1918. This is one of best documentaries I have watched and will recommend to my friends and family. Well done NEON!!! 👍😊"}, {"id": 5, "text": "The film really gets in there and shows just how badly Trump's response to Covid has been (220,000 dead Americans when I wrote this) If America had a different POTUS during all of this, so many wouldn't have died. Not that Trump ever really tried, but now he and the sycophantic Republicans have completely given up on containing Covid. We won't forget."}, {"id": 6, "text": "I would give it 11 stars if I could. I encourage all to watch this film and take away what you will. Concise, comprehensible and intellectually laid out timeline of the USA's pandemic response with hindsight to help see the situation clearly. Provides insight into the incompetence of those in charge of the pandemic response."}, {"id": 7, "text": "If you really want to know why so many Americans died from COVID-19, this will spell it out. In a just world, this would be the prosecution's opening statement in a Nuremberg style trial against Trump and his cohorts. The timelines are so fresh, you will remember a lot of what is depicted in this film from personal experience. What the filmmakers provide is the behind the scenes machinations of the Trump administration and lines them up with what we were allowed to see at the time. While this infuriating information will not make it any easier to cope with the damage soon-to-be-ex-president Trump inflicted on this country, I am quite certain that the long arm of justice will grab him, and make sure he spends the rest of his life in jail. Hey, we got Osama bin Laden, and he only killed 3000 Americans!"}, {"id": 8, "text": "Excellent documentary detailing the US pandemic response comparing what the Trump Administration did with the public health pandemic response playbook that the CDC created years ago (and updates on an annual basis). South Korea followed it and has had less than 25% of the death rate that we have had with no national lockdown needed.The conclusion voiced by Dr. Tom Friedan, the former CDC Director 2009-2017: There's a misconception that public health failed. The truth is that political leaders failed to follow public health guidance, and that's what caused avoidable disease, death and economic destruction.And while I don't want to spoil anything, at the end of the film they play an audio clip of President Trump saying how dangerous and deadly the coronavirus is on February 7th (to Bob Woodward.) It's in his own words! You'd have to have lived under a rock the last eight months if you don't know that completely contradicts much of what he's said publicly. I was also surprised to learn that we had an American N95 mask manufacturer here in the USA that not only warned the administration repeatedly of impending PPE shortages before the coronavirus even was making people sick in China, but he volunteered to make 7 million masks a month to cover healthcare workers early on as long as he could get some assurances from the government and they refused repeatedly.What upset me the most? That every scientist or medical professional who shares information that doesn't conform to the Administration's party line is silenced or fired. You can't trust the CDC, the FDA, FEMA, and who knows who else that falls under Executive Branch purview. This is how great democracies fall into demagoguery. And that's a slippery slope to tyranny."}, {"id": 9, "text": "Please avoid all reviews giving this 1/10. The blind will call everything and anything Trump has done wrong 'fake news' . The documentary is extremely disturbing . The way the Trump government repeatedly dropped the ball is incredible. Trump blaming Obama for empty shelves while he had 3.5 years and did nothing. Hiring his son in law to track down PPE with zero experience and zero results. Trump only agreeing to give California governor some testing swabs if he personally got on TV and praised him publicly. The insight from experts who weren't listened to frustrates anyone with a modicum of intelligence. Concise and easily laid out for all to see. This should be compulsory viewing. I'm so lucky I am not living in America. What a mess!"}, {"id": 10, "text": "Trumps response to the pandemic wasnt just awful, he should legit be charged with murdering the ppl hes sworn to protect!! He literally made it worse with every decision he made. He makes us as Americans look so bad, hes not just a terrible human being but a terrible leader as well!!"}, {"id": 11, "text": "I am in no way biased or care about American politics as I am not American,I do think this movie does nothing more than show how a government cares more about money and re-election than the health and safety of its citizens. It also appears the majority of those who support Trump tend to follow his every word like sheep. So when you get a president who states that he does not believe in science and medicine... well you are going to get a lot of his followers that blindly follow his words and in turn creating a more un-educated countryIn the end this seems like a propaganda film strategically placed mere weeks before an election, but at the same time the film is based on facts.7.1"}, {"id": 12, "text": "If you want the truth about Covid19, how it started, what Trump did wrong. Watch this. Thousands should not have died. It's pathetic that it happened, it didn't need to be this way 2020. There was a perfect plan made up in the Obama term. It should have been followed, today it should be followed. Trump does not agree."}, {"id": 13, "text": "Is this documentary biased against Trump? I would not use the word biased. Does it tell what he did wrong? Yes. And it's scary. This is the Halloween season and I watch lots of scary movies at this time of year, and this was the scariest thing I've seen. This is not fake news. These are not reporters, these are real people stepping forward and speaking of what they have seen, what they did, what they warned. These are people who could go to jail for speaking out after they signed non-disclosure agreements, but they felt that they had to speak out. I thought I knew more or less what has gone on, but the depth of the corruption is mind-boggling! Powerful. And I am going to have nightmares tonight."}, {"id": 14, "text": "Excellent take on what really happened in the early stages of the pandemic."}, {"id": 15, "text": "A close up look at Donald Trump's administration is rarely pretty, and Alex Gibney's documentary makes the clear case that the United States government's response to the COVID-19 crisis has been suboptimal in no small part due to the whims of its leader. COVID has of course caused problems worldwide, but this account of the needless damage done by disregarding scientific and professional advice must be paintful to watch for anyone who has lost a loved one. Gibney doesn't shout his conclusion, but neither does he fudge it. One day, we will wonder how we allowed this to happen."}, {"id": 16, "text": "You wont find a nother summarizing feature documentary at this level till the besserwissers cocludes in a couple of years why this happened and where we failed etc etc when all the numbers and data are processed and the rebuild of the new normal can/have start.i think alex gibney and his team of filmakers presents the best of the best on the science and the humanistic basis, where death is death and not money and politics, and revealing political systems that spreads fear among beaurocrats that being afraid to get sacked and merely keeps sweettalking to their bosses just to keep their jobs leaving the rest of the population at risk for all its/your worth...absolutely nothingso put the politics aside when viewing this film, its a stunning moment of truthlearning. with high recommendations from the still grumpy old nurse with the neck gaither ready at all times"}, {"id": 17, "text": "The story of what happens when you try to respond to a scientific phenomenon with a political agenda - inevitably, you lose badly. Exposes levels of mismanagement and incompetence that are beyond shocking."}, {"id": 18, "text": "Shamefully biased and agenda driven. More of an elitist hit piece than a documentary."}, {"id": 19, "text": "All lies about a disease that leaked from a lab in China but with a 99.99% survival rate. The truth is the president restricted all travel from China in January while Pelosi said come shop in Chinatown and Biden called him a Xenophobe. Democratic Governors sent positive cases to old folks homes and had the largest death rates. Trump sent 2 Naval Hospital ships to LA and NYC, the hardest hit - they sat unused for a month. Here is more spin and lies. Skip this, save your soul."}, {"id": 20, "text": "When understanding 2020, this will be a good place to start. Totally Under Control covers the beginning response of the Trump administration really well, but in a fast-moving world, it's already outdated now. This did provide a good behind-the-scenes view of the chaos that was happening, and the things I learned shocked me."}, {"id": 21, "text": "Was this made by CNN?? The biggest load of kacka I've ever watched. Literally could find a rebuttal to every single statement made in this so called documentary. We were warned??? What about the leader of the WHO telling us not to worry about it in March. The part that it's dangerous to a specific demographic. The part that if your immune system is even half healthy you're gona be ok. The part that they've ruined people's lives with lockdowns and restrictions. This should be banned."}, {"id": 22, "text": "The entertainment industry and its traditional left-wing slant maintain their stance without fail in this garbage that is being labelled as a documentary. And what a coincidence that this just happened to be released 3 weeks prior to the election. I gave it a 2 out of 10 ONLY because some of it may have some truth to it."}, {"id": 23, "text": "I gave 3 stars, not because I protect Trump. I'm not even US citizen. I give it low score because it politicizes the epidemic. And, please correct me if I'm wrong, was it Trump supporters who since beginning of October are flooding the streets of US cities ignoring the pandemics? So yeah. It's a twosided story"}, {"id": 24, "text": "Remember Dr. Nancy Messonnier? Exactly. But there she was, the face of the CDC, warning of pandemic and closures necessary to contain it, back in February. FEBRUARY!Messonnier was swiftly swept under the Trump carpet where all science based experts reside. It is a big carpet, with a growing bump. Huge bump. That is the sad crux of this documentary, a thorough, blow by blow spine-chilling COVID-19 dateline, and the shocking ineptitude and dangerous apathy from the Trump government (if you can call it that) in response. Not much new here for anyone keeping up with the news, fake or not, but when presented in a calm, simmering sequence, plays out like a bloody horror movie. Which, let's face it, it is.Totally Under Control is an impressive cinematic achievement, stretched out like a real time news program, brimming with startlingly blunt interviews, thorough investigations, slick editing, and stunning clips. The parade of despondent experts daunting. The series of unfortunate events mind-boggling.Just to rub salt deeper into the festering wound, an alternate reality, the successful South Korean response to the virus is not just eluded to, but is presented in all it's meticulous glory. A cold hard slap to the face of American foolishness. Ouch.A series of bungles, lies, incompetencies, and cover ups, lead to a catastrophe most are still trying to properly comprehend. This is an utterly infuriating watch. A strong drink might help.The dictatorial and abusive power wielded by the president is at the rotten core of this calamity, and filmmaker Alex Gibney eagerly lets The Don indict himself throughout. Repeatedly. Important agencies bow to his whims, try to massage (in vain) disasters, and for the most part, dare not contradict or question Trump for fear of reprisal. Those who do, are quickly dispatched. Fact or fiction? The lines are blurry.Will a devastating pandemic that threatens to hurl America into full blown depression finally sway the Kool Aid drinkers, or is this the end of the greatest country in the world? We are about to find out. This important film is ample warning, and a primo election primer.hipCRANK"}, {"id": 25, "text": "Terrifying, just terrifying. Shows how politics is, unfortunately, being put ahead of science, data and opinion of professionals. But it also shows how should we all act in that cases, shown on the case of South Korea. It's very distrubing to see what scientist say goverment should do and see what goverment actually does to look like they have control over everything and to remain in power. This problem is not only present in United States. But what we see this administration do is just shocking.This documentary, because of the stories of medical personel and people from scientific world, is sensational. One of the best points of this movie is of course the way producers made this movie. They took every possible security measures when they were talking to people. That is one of the reasons this movie captivated me. In 2020 this movie is definitely must see.You can't look away from the screen for 2 hours. It's shocking, it's terrifying and it's just our reality in 2020. Stay safe, wear mask. We will overcome this."}, {"id": 26, "text": "At the risk of sounding hyperbolic... this is a masterpiece of a documentary.It's beyond urgent, and indeed, in time that may prove to be its undoing. I'd estimate that the filming for this was probably finished around June/July, so even at release there's important things it couldn't cover (Trump's own positive test to the virus is a footnote that appears right before the end credits). And with the story of COVID-19 still ongoing, there will inevitably be more changes and dramatic revelations to come.But for now, this is vital, compelling, compulsively watchable, expertly edited, and undeniably stomach-churning stuff. I don't doubt that there is some bias likely present within this documentary, but as something that presents an argument- even if it is by and large one side- it's exceptional. The argument is presented brilliantly. Some may disagree with its ultimate point- it's inevitable, in this year of absolutely insane societal division- but I'd urge everybody to at least give it a watch, and make up their own mind once it's over.I want to straight up beg Netflix to buy the rights to this, because 99% of the time, when you tell somebody about a film or a tv show, the question is: Is it on Netflix? That's how so many people I know watch everything they watch, and a film like this needs to reach as many people as possible as soon as possible. I was anticipating it, based on the strength of Alex Gibney's other documentaries, but I assume most other people won't be willing to part with AUS $6.99 to rent it on iTunes- currently the only way someone in my part of the world can watch it legally."}, {"id": 27, "text": "On January 28th of this year I read an article in the Washington Post about a novel corona virus circulating in China that was killing people. This information was leaked to the Post by U.S. intelligence sources. I ordered masks and gloves that same day.Despite continuing to learn about this virus as it rapidly spread from my state, Washington, across the whole U.S., the government instituted no comprehensive plan to employ our medical and scientific community in an all-out effort to confront this deadly epidemic. It was up to each state and each citizen to go it alone. Our psycho leader is out to lunch.This film informed me about a lot I didn't know about what went on, behind the scenes, between the outbreak in Wuhan, China and the first reported case in the U.S. -- and beyond. Learning that Trump knew all about it in January is only the half of it. This film fills in all the blanks and lets the medical and scientific experts explain the frustration they felt. The mask-maker shares his exasperation and sorrow. The volunteer reveals the craven nature of Kushner Inc.This documentary was so well presented. Gibney did a masterful job of exposing this dark, shameful part of our national history. Still, there are millions of people, Trump followers/Fox News watchers, who refuse to see how corrupt and evil he and his administration have been. They are responsible for thousands of sick, disabled, and dead people who trusted in such an immoral person who doesn't care about any of them."}, {"id": 28, "text": "Even though I had seen other documentaries on this pandemic, this was the best crafted version, and contains new material, such as the Asian American mathematician expert on the exponential nature of pandemics who knew when they found the first coronavirus case in Seattle, that there were a lot more. It reminded me of the time we had people working on our house and one of them came to me and said they found a dead flying termite in some debris, and told me, if they find one, it means there are a lot more. We had to have the entire house tented. South Korea tented their country. We did not. South Korea listened to the scientists. We did not. This documentary lays that all out and a lot more. How the Trump administration hired a lot of kids to help procure PPE but they them no guidance and no authority. Only when a scientist accidently communicated the reality of the crisis and tanked the stock market, was Trump forced to acknowledge what the rest of the world already knew. The Center for Disease Control made serious errors with the testing rollout, and the government needlessly exposed thousands of Americans to the pandemic by not even using the pandemic playbook developed by the Obama administration. Hillary Clinton in June 2016 had warned about an inexperienced president not knowing what to do if a real crisis hit. This accounting of out response has not only tarnished our scientific reputation but our leadership reputation. And to make matters worse, if governors wanted resources from the federal government they had to personally call Trump, and then publicly thank him."}, {"id": 29, "text": "I've seen a lot of disaster movies, especially since the pandemic uprooted our lives, and I've always been bemused that the first instinct of authorities is to avoid a panic. Always, this means lying to the public regarding the impending doom. The public's ignorance, then, leads to their being unprepared for the disaster, of which the only thing standing in the way is luck and competent governance. Leave it to Hollywood, I suppose, to think up something that ridiculously paternalistic and self-defeating. Or, I don't know, maybe it's too much to consider that what is good governance is an informed public and authorities that don't egregiously lie--just pathological hoodwinking and concerted campaigns of misinformation every spiteful word out of their mouths. To that end, Totally Under Control compares the pandemic response of South Korea, with their tens of thousands of confirmed cases and hundreds of confirmed deaths related to COVID-19, as of this writing, to that of the United States, with millions of such cases and hundreds of thousands of deaths. Even though the American population is over six times that of Korea, the numbers are striking, but not surprising--certainly not after reviewing this two-hours summation of an utter abdication of governing over the past year, if not the past four. This documentary being released a few weeks before the country's presidential election was, of course, intentional. Good.I appreciate well-executed dramatic irony in fiction, which might help explain why I dislike characters stealing it from me when they keep what is a minor role in these movies, of the public, in the dark to avoid panic. Totally Under Control reverses, doubles and redoubles this irony. Now, we know how this movie ends, so we begin by viewing interviews of experts and key figures, news footage and narration setting the stage of when we didn't know. At first, the doctors knew what the public didn't, but eventually we learned, too. But, the strangest thing is that the lead, along with some of his main supporting cast, continues the irony by appearing to know nothing. He calls it a Democratic hoax and blames the disaster of the response on blue states, but pretends to have the virus totally under control, all the while overseeing bureaucratic ineptitude and a breakdown of supply chains for personal protective equipment, making masks an issue of politics, as well as of availability, while hocking snake oil, muzzling scientists and organizational experts in favor of promoting political hacks. And the surprise twist, by way of Bob Woodward interview, is that he knew how bad the virus was the whole time, but he still gets infected, anyways. It's not that he didn't know; it's that he didn't care. It would make for dramatic fiction, but as our depressing reality, it's truly horrifying.Standard expositional narration and talking heads nonetheless, this is a well-constructed documentary, too. Hardly every bit of mismanagement known is covered in the concise overview of the past months' news stories, let alone what one might wonder will date the movie with any future revelations. For one, I assume there will come a time when the pool of prominent interview subjects will be larger due to subsiding fears over job security, let alone the limitations otherwise imposed by a pandemic and without some distance from the subject. I especially appreciate the reflexive nature of the views of the socially-distanced and plastic-wrapped camera set-ups for the interviews--and at least one that is delivered to the interviewee. The world isn't normal, so why would the filmmaking be, either. It's this, of a documentary about the pandemic made during it, that will continue to set it apart.One matter I take some issue with, however, is the attempt at something of a positive note: that we may learn from this trauma. Indeed, part of South Korea's more-effective response may be attributed to their recent experience with contagion, such as the MERS outbreak in 2015, and maybe the world over will perform better if such viruses and pandemics do become ever more prevalent, although that's not an optimistic view, either. But, the documentary also brings up the most recent and relevant global catastrophe to our current situation, the 1918 Influenza pandemic. Unfortunately, even though I like to think I appreciate history, I knew very little before 2020 about the so-called Spanish flu, or the forgotten pandemic, as others aptly put it. Of late, however, my research has included silent films from that era, and if not forgotten, it was either largely neglected or lost--as most silent films are now. All of which is to say that I'm not going to get my hopes up for two weeks that we've learned our lesson, so to speak, let alone remembering any lesson over another century after a pandemic. Hopefully, the final irony won't be that we know more now than we know in the future, but this is a good start--primary sourcing that may serve as a record for years and generations to come."}, {"id": 30, "text": "This is a controversial topic. A lot of people have criticized the Trump administration's handling of the pandemic while others have praised it. This film goes for the critical approach while also presenting evidence to back this up. I'll try my best to keep personal politics out of it and review it as a documentary but as a documentary, it succeeded. There is a lot of bombshell information here that the public should see. The US's response to this pandemic was absolutely terrible and this highlights what exactly happened. On surface level, some might assume that this film only attacks President Trump and conservatives but you would be wrong. This film attacks both sides for its handling like Congress's stalling to get a stimulus passed and Obama's handling of the national stockpile. The information is presented in an interesting and engaging way 75% of the time. For the other 25%, it had a hard time keeping me engaged because it was telling me information that I already knew or the documentary had presented earlier but what this documentary does well is land bombshell after bombshell after bombshell. I don't want to spoil any of these bombshells. My only other issue was some weird editing and stylistic choices that felt off at times but it's more of a nitpick. I urge you guys to check this out and to hear out the information although if you consider yourself right leaning, you might not like it as much."}, {"id": 31, "text": "All media is leftist propaganda. They ever show Nancy Pelosi telling everyone to come.down to chinatown in February? No. There's video of that..or how about Biden calling Trump a xenophobe for closing down travel to china? Left that out. Or how about colossal idiot andrew cuomo forcing infected elderly into nursing homes subsequently murdering them? Nevermind he had the gall to write a book praising his handling (denying his crime) of Covid. This is pathetic and sad. Biden or Hilary wouldve killed millions. Want to know how I know? Idiot Obama ignored H1N1 even after 60million contracted. Why was there no panic then? He covered it up. It was by LUCK it wasnt more disastrous. Let me see a documentary on that. Oh theyll never make it. Smooth Jazz has a contract with Netflix to help pay for his $15million marthas vineyard house as Michelle Obama claims White flight. It doesn't surprise me this exists. The Left have to bury their accountability to leep funding the people who run their machines. Others demand honesty and truth. The morons who believe this is reporting: keep living in fear. Something tells me you've never done anything with your lives except play victim. The rest of us will keep living."}, {"id": 32, "text": "Totally biased from the left piece of junk which would air well on CNN or MSNBC 24/7. Speaking of the early days of COVID daily briefings only one of ours news networks would even show them (FOX) This documentary celebrates the World Health Organization (W.H.O) and especially CHINA and SOUTH KOREA's 'rapid response' to the virus. I just googled deaths from Covid today 11/16/2020. US - 246 thousand (out of around 331 million people). China has a population of around 1.5 billion people tightly packed into one country. China Covid deaths today? 4,634 (seriously?) South Korea population 51 million. Deaths? 464 Another reviewer stated this 'documentary' was financed by Netflix. I love good honest documentaries but this is like watching a Joe Biden campaign ad for 2 hours. They don't even interview Dr. Fauci who said don't wear a mask, wear a mask, seen in a ballpark 'not wearing a mask' and is now on the cover of VOGUE and probably Time Magazines man of the year soon. Watch at your own risk because you'll only see one view of this pandemic and who is ultimately to blame. But remember while watching this. Orange man bad! Vote for Joe!! p.s. I wear a mask but just want a good objective documentary and this imho is a 'hit piece'."}], "reviews_amount": 33}