{"name": "Putham Pudhu Kaalai", "titleId": "tt13087958", "reviews": [{"id": 0, "text": "Barring the first and last shorts from Sudha Kongara and Karthik Subbaraj, others are quite normal and not that engaging. The signature styles of every director is visible though we know only the titles. While most of the shorts deal with emotions and separation during the lockdown, the last short - Miracle dealing with petty theft is absolutely hilarious and well written. Good one from Amazon Prime!!"}, {"id": 1, "text": "This anthology movie is a collection of five different stories based on lockdown memories. I enjoyed the first and the last story - others didn't work for me.It was a feel-good attempt to bring a smile on your face."}, {"id": 2, "text": "Direction-- great by all, writing--excellent, acting-- good , Music-- great, cinematography-- outstanding, makeup and costumes-- great, production design--good Overall heart touching stories with pleasant visuals, soulful music and superb performances."}, {"id": 3, "text": "If not for the 'big names', it wouldn't be appreciated.. Waste of time &amp; money.. Better stuff to watch in Prime itself.."}, {"id": 4, "text": "All of the stories were put together very well. Each of them with a common theme of Love, Ageism, Hope and second chances were so very well etched. Some of the stories did lacked in the substance and didn't exict but overall it was such a brezzy watch. In the other aspects such as acting, cinematography, it was so very well done.My order goes like: 1. Rajiv Menon (Reunion) 2. Karthick subburaj (Miracle) 3. Sudha Kongara (ilamai idho idho) 4. Gvm (Avarum Nanum) 5. Sudha Manirathnam (Coffee, anyone)"}, {"id": 5, "text": "A not so good series of a short film. Maybe because they were all shot in a hurry due to this pandemic situation, not sure but that's how it felt. No film stood out and every single short film looked nothing more or better than the usual ones showcased on Youtube"}, {"id": 6, "text": "Liked all the stories, last one was my most favourite."}, {"id": 7, "text": "Watch the last one and skip rest. Last one is neatly done. Comic relief, engaging with a cute twist. 1 star for rest four. My rating is purely for the last one. Well done."}, {"id": 8, "text": "1 - Good 6/10 2. Ok 4/10 3.Horrible 2/10 4.Pathetic 1/10 5. Ok 4/10"}, {"id": 9, "text": "Really liked the order in which the movies were arranged. Suhasini's Coffee anyone is just fantastic, loved it! The feel it gave, and the performance of the artists.. It was an amazing experience! And the ending by Karthik's Miracle, just bliss..😄"}, {"id": 10, "text": "Gautam Menon's ms baskar version the best , what an acting from Bhaskar , the way he created the emotions and yet not allowed it to slip away , he brilliantly controlled itBest acting I have seen by any actor across the world in last 5 years or so"}, {"id": 11, "text": "A movie was simply well and good, I specially love the acting of kalidoss jayaram, he acted as jayaram. Each story ends with a smile and positive and the vibe of the movie is great and I submerged in love with this."}, {"id": 12, "text": "All 5 movies with the different stories. One good watch after a long time. Rajiv Menon's Reunion and karthick subburaj's Miracle was my favourites. It's worth the watch. Give it a go you'll really like it"}, {"id": 13, "text": "By far the best movie made on covid topic..Really hits the chord..All except the last story are top notch unraveling the thredas of personal relationships subtly.."}, {"id": 14, "text": "Putham Pudhu Kaalai is a Tamil 2020 movie based on the lockdown. It is a collection of 5 stories.All of the 5 stories are feel good stories. Depicts various happenings in the lives of different people. And how lockdown has made an impact in many lives.Overall, average movie. Can be given a miss."}, {"id": 15, "text": "Liked all the five parts. All made me feel good in one way or other. Sudha Kongara, Gautham Vasudev Menon, Rajiv Menon and Suhasini Maniratnam are showed their talents. But I think Karthik Subbaraj's story and narration should have to be improved. Overall a good collection."}, {"id": 16, "text": "Screenplay And Acting Were Too Bad Except For 'Miracle'.So Many Great Directors But Karthik Subbaraj And Crew Tops From Them In This Anthology."}, {"id": 17, "text": "Good Movie. Everybody acted well in the movie. Songs and BGM in the movie were not good. Some stories were interesting and thrilling. Some stories were so boring and lagging. Good Movie."}, {"id": 18, "text": "No comments, simply waste, it's very boring, they tried to give new thing but it was failed"}, {"id": 19, "text": "All 4 are good except the one Suhasini directed. Felt very artificial"}, {"id": 20, "text": "Love is pure - weather between 2 friends , between siblings , between parents and children , or toward parents ... each story captures at least one or more of all these aspects of life itself ! Except the rare spots where the script did not engage to reality , it's a movie well worth your time and lingers on in the mind for a long time with pleasant memories from the movie to ones own life stories - after all every person's life is a true story worthy of narration &amp; interpretation.."}, {"id": 21, "text": "1. Miracle: Its brilliant filled with karthik subbaraj mark all over. Its quirky and gives us that unpredictable feeling while watching throughout. 2. Illamo illai idho: Yesteryear pair jayaram and urvashi are back with a bang. Urvashi is fabulous as usual and jayaram finally plays something suiting his age. Kalidas and kalyani bring that cuteness all over. 3. Avarum/avalum naanum: MS Bhaskar carries the whole short film on his shoulders. His classy performance covers up the flaws in the script. 4. Coffee, anyone: Many are calling it the weakest, but i liked this one. Only, i wondered about the purpose of shruthi hassan's character. Otherwise, this has some bonding scenes which are heartwarming. 5. Reunion: For me, this one was the weakest. I don't know what the director wanted to convey, the script didn't have any head or tail. I couldn't connect with this at all. Verdict : Except miracle, rest of the short films fall under predictable feel good urban category."}, {"id": 22, "text": "Amazon Prime Video's #PuthamPudhuKaalai is precisely what I needed right now. This Anthology movie follows 5 stories relevant to Corona times (also known as 2020). My favorite of the lot (it was a toss up really) is GVM's 'Avarum Nanum' that follows the reunion between a retired scientist and his grand daughter and the mending of their troubled relationship. Sudha Kongara's (Ilamai Idho Idho) follows the real life father-son duo of Jayaram and Kalidas as the younger and older versions of the same character. It was good to see Uravasi back in action as well. It a fun segment. Rajiv Menon's Reunion provided a different perspective where a chanced encounter between two school friends resulted in a very interesting dynamic between them and the guy's mother. Loved Andrea's, Leela's and Gurucharan's acting in this one. Sudha Manirathnam's 'Coffee, anyone' is all about three sisters and parents. Sudha managed to keep it light hearted throughout despite the premise of the story. Karthick subburaj's 'Miracle' is the fun gangsta segment with the obvious twists and witty dialogues. I did love this one as well."}, {"id": 23, "text": "I was yearning for a good original tamil movie for a long time. Putham Pudhu Kaalai filled in the vacuum.The stories are well made and relevant to the times.Thoroughly enjoyed everything except the last one..."}, {"id": 24, "text": "All 5 stories are awesome and breezy. Nice ride. Miracle is hilarious punch. Avalum Naanum and Naanum Avalum and Coffee any one are Emotional punch. Reunion and Ilamai itho itho are Lovely punch.All directors, cinematographers and actors done well on their part. Expecting more."}, {"id": 25, "text": "Pls don't watch I don't likePls don't watch I don't likePls don't watch I don't like"}, {"id": 26, "text": "Miracle is the miracle in this anthology. Just skip coffee with anyone which is the worst piece not sure why still she wants to direct a movie with no talents"}, {"id": 27, "text": "In the segment of short films, he has a proven experience compared to others. The way the very first scene started in Miracle title, it made me think of another slow dialogue based short story following after watching 4 already. But, it just kick started in the very next scene and you can't miss any of the scenes, comedies etc. Nice link from first scene till end with short and sweet story line (little predictable though). Gudos to Karthik. Others were good, but not upto the mark. I can't say first 4 are story based, there's no story on them, just some piece of messages, couple of them may be subjective to some set of people. Probably Miracle story is kept in the end just to make sure viewers are happy while leaving."}, {"id": 28, "text": "Overacting and Disgusting Segment was Coffee with anyone. Anu and Shruti were good. But Suhasini's acting is very bad. That is why nobody like that segment. By Rank: 1-Avarum Naanum - 8/10 2-Miracle -7.9/10 3-Reunion - 7.6/10 4-Ilamai Idho Idho - 7.5/10 Wasted Content - Coffee with anyone - 4.5/10"}, {"id": 29, "text": "Putham Pudhu Kaalai is a beautiful anthology exploring human relationships set during &amp; after the infamous lockdown of 2020. Directed by veterans and young filmmakers the movie is a blend of youth &amp; experience. Putham Pudhu Kaalai is gentle &amp; delicate in treatment, yet delivers its heart touching messages on love, family, relationships, compassion, optimism, understanding and bonding to name a few. It helps that the movies is written in a way that it appeals all age groups.Cinematography is excellent throughout all five stories and forms the backbone in storytelling. Editing is very neat and has no lags despite the movie being a anthology. Production design, costumes and makeup are good too. However though good the the music does gets goofier sometimes. Screenplay is deeply engrossing and very well written to keep the viewer fully immersed. All the actors &amp; directors have done a wonderful work, which we usually don't get to see in Tamil movies.Overall, Puthum Pudhu Kaalai is very progressive and a rare gem of cinema to hit Tamil screens. The movie asks all the right questions time and again, fully touching the viewers soul. Absolutely recommended and a definite must watch for all movie lovers and not only Tamil cinema fans. A complete family movie, wish they made more like these in Tamil."}, {"id": 30, "text": "Putham Pudhu Kaalai is a fresh breath of air among the recent online platform streaming releases.. 5directors joined hands for short tales of love, hope and warmth.. My favourite of the anthology is Sudha Kongara's Ilamai Idho Idho - breezy love story of a young and elder couples, well acted and delightfully narrated out of her comfort zone!Avarum Naanum(GVM) - Heart warming tale of granddaughter(Ritu) and uncle(MS Basker aced it).. Kanna Thoothu Poda track(Govind Vasantha) in Bombay Jayshree voice is sheer bliss!Reunion(Rajiv Menon) - Story of a reunion between 2 school mates, one of them affected by covid, moments of despair and repair.. Neatly done!Coffee anyone(Suhasini) - Story of 3sisters and relationship with their ill mother and care taking father.. this was missing the emotional depth, fall short for me but still okayish!Miracle(Karthik Subbaraj) - Man ends the anthology with a smart cracker! Humourous with his trademark touch of twist! Fun ride!Overall, a brilliant attempt and feel-good narratives of people relationships amidst this covid outbreak with beautiful music score all over it, well delivered! More of this please!"}, {"id": 31, "text": "Putham Pudhu Kaalai turned out to competently made, given the expertise of the directors helming it, but some of the storylines didn't exactly require a lockdown backdrop and would have worked fine as standalone shorts. The anthology starts strong with Ilamai Idho Idho, featuring Jayaram, Kalidas, Kalyani, and Urvashi. While it's about two senior citizens rediscovering love, there's novelty in the way it's presented: through the eyes of their younger selves. It works due to the cute chemistry that both the young and senior actors share, and while not too layered, the generally breezy nature of the narration helps.The second story Avarum Naanum - Avalum Naanum is about a grandfather and a granddaughter reconnecting with each other after many years. Once again, Gautham Menon resorts to using voiceovers, not trusting his ensemble to let the relationship and its nuances unravel on its own. It does get better, thanks to a stunning Ritu Verma and an ever-dependable M S Bhaskar. The story doesn't peak, yet has its beautifully emotional moments. The circumstances of the lockdown don't really add to the story though.The third story Coffee, Anyone? is my least favorite pick. On paper, this story must have sounded truly heart-warming. But on screen, it appears rather dull. The lockdown is of no consequence to the plot. There's a heavy dose of melodrama and a lot of ideas (like the youngest daughter running away from home, the oldest daughter's son being dyslexic, and late pregnancy) that are only briefly touched upon. The performances too, feel a little forced.The fourth story Reunion sees two college friends (one, a doctor with a super progressive mom, and the other, a bar singer) Sadhana and Vikram, unexpectedly reuniting at the latter's house because of the lockdown. When Sadhana's coke addiction is exposed, it doesn't write her off as an unrelatable person. Rajiv, instead, takes a more informed stand at the whole thing and tackles it better than most filmmakers would. That closing freeze-frame was a nice touch!The final and most interesting story among the lot, Miracle is directed by Karthik Subbaraj. This is the only story that moves out of its indoorsy comfort zone and revolves around a couple of thieves and a struggling filmmaker. With quirky dialogue and a funny last-minute twist, Miracle benefits from the bromistry between Bobby Simhaa and Sharath Ravi. It also stands out as the only story that veers away from the upper-middle-classness of the rest.On the whole, Putham Pudhu Kaalai is a mixed bag, but thankfully one with more positives than shortcomings."}, {"id": 32, "text": "Putham Pudhu Kaalai is a superbly compiled anthology film, taking the audience along a varied emotional journey with each story.Picking up subjects like a budding romance between two senior citizens and slapstick comedy, to the emotions behind coming to terms with death and bereavement, the 5 directors have come together to deliver a charming potpourri that entertains and also leaves behind a lasting impact.Out of the five different storylines, I felt that Shruti Hassan really shone in the segment 'Coffee, Anyone?' directed by Suhasini Maniratnam.M.S Bhaskar's nuanced performance as a lonely grandfather in Gautham Menon's 'Avarum Naanun - Avalum Naanum' and Andrea Jeremiah's captivating portrayal of a drug-addicted aspiring musician in Rajiv Menon's 'Reunion' were the other highlights.Considering that the creators not only shot within the restrictions of a lockdown but rather used that context to extract heartwarming stories deserves commendation.Recommended."}, {"id": 33, "text": "With an anthology like this there are always going to favourites; for me those were the stroies that Sudha, GVM and Karthik bought to life. Although all the stories did stick with an underlying message that focuses on humans trying to redeem themselves or re-invent themselves into new begginings in the time of such devastation and loss, not all resonates on the same level. It was a brilliant move by Sudha to tell the love story of 2 middle aged adults through young and older versions. It made me feel connected to a story in a deeper level, even though I am in my early twenties I was still able to feel the passion that brought these two people together. As a viewer it shows how powerful and energetic love makes you feel when you both whole heartedly in it and how it can easily fade with doubts and intolerance - A beatiful contrast, that doesnt say being old means you are automatically unromantic and grumpy, but instead it shows how it transforms you. It was nice to see a natural dynamic of father and son on screen that is required by the story (Jayaram and Kalidas), instead of sometimes forced and cringey duos on Kollywood screen.GVM on the other hand made me cry for the first time since I watched Varanam Ayyaram as a 9 year old boy, and this time my whole family felt it. Both M S Bhaskar (Seriously under rated) and Ritu Varma killed their performance with ease.The story at last Karthik S was the real stand out, it had a level of comedic element that karthik worked out flawlessly. Karthik and Bobby dynamic is yet to disappoint me. The characters were naive but yet sensible enough to feel real, while the other stories overwhelmingly focus on people who have structure to their life this focuses on the utter disfunctions of two unemployeed bachelors who are struggling to make ends meet. Even though not alot of us were affected to this extent, it subtly touches on the struggles of humans enough for you to emphathize with them.The two stories in between by Suhashini M and Rajiv M were bit of a disappointment, they had this disconnect from the viewer that I personally know affected everyone who watched the movie with me. The story tries to tell the story of struggling old parents through the eyes of their daughters, but I feel like it could have been better for the story to be told from the parents presepctive as all three daughters just didnt feel like strong characters or rather they didnt have enought time establish them. Rajiv could have seriously considered toning it down with the cringey reciting of poems, it took me way out of the movie; made it feel more corny and cringey but still not as bad as the Cringe Sisters from the Suhashini movie. I really wished they spent more time with Andreas character and her addiction seems like a wasted potential.Worth the watch just for the 3 movies that worked."}, {"id": 34, "text": "My rating for the 1st film-9/10 Superb performance, liked it very muchMy rating for the 2nd film-8/10 I liked the story, nice performanceMy rating for the 3rd film-6/10 AverageMy rating for the 4th film-4/10 BoringMy rating for the 5th film-9/10 The bestOverall rating-8/10As they made three short films very much engaging I would say you can watch this film with family."}, {"id": 35, "text": "Sudha Kongara's Ilamai Idho Idho is my favorite among the five. The idea of older people in love is not new but the way it's executed is totally fresh. And it's really sweet and entertaining. Happy to see Kalidas Jayaram improving his acting skills. This is probably his best performance so far. Jayaram and Urvasi are very convincing as two older people in love. Kalyani Priyadarshan is a promising talent. Rating : 3.5/5Gautham Menon's Avarum Naanum/Avalum Naanum is his best work after a long time. M.S.Bhasker nailed it with his acting skills. Kanna is safe in Ritu Varma's hands. Only flaws about the movie was the music and the structure of dialogues. Some dialogues felt unrealistic and the music was annoying. Yep. That's how I felt. Rating : 3/5Suhasini Maniratnam's Coffee Anyone is my least favorite. I don't know why they chose such a script. In the opening scene, Saras(Anu Hasan) is describing about her mother to her sister and father. Why in the world would someone talk like that? She's telling things which her father and sister already knows. The whole movie felt pretentious. And sometimes ridiculous. Rating : 1/5Rajiv Menon's Reunion was just okay. You can just sit through it. Doesn't have much to offer. The reactions of the character's doesn't feel realistic at all. Rating : 2.25/5Karthik Subbaraj's Miracle was just like the other KS films. It's a funny tale told with background of two robbers who are waiting for a miracle which will make them rich. It's a decent and entertaining watch. Rating 3/5"}, {"id": 36, "text": "Putham Pudhu Kaalai is an anthology with 5 stories during lockdown. They all have feel-good vibes and they'll definitely succeed to give you a bliss of hope and joy in these hard times. Though I'm a bit disappointed, it's definitely worth watching.The only big let down for me was Suhasini's segment Coffee, anyone? - a family is in conflict with the treatment of a mother who is in a coma - if I didn't misunderstand it, the story and message seem stubborn. The characters/acting felt unnatural.In Gautham Vasudev Menon's Avarum Naanum my highlight was M.S. Baskhar. A granddaughter fills in the gap in a lost connection between father and daughter. It was decent, but I still couldn't connect enough with the characters. For feature length it would've been better I think.The other three were great. In Rajiv Menon's Reunion - two friends have grown apart and they reunite - Andrea's performance was amazing! Sudha Kongara conveyed the impact of love beautifully in Ilamai Idho Idho with a great story, although I was a bit overwhelmed by so many songs.The show stealer in my opinion was Karthik Subbaraj' Miracle. A very fun movie with Karthik's usual characteristics that'll give you this magical satisfaction. Great acting. Even more amazing considering the limitations.In general it's incredible they've achieved this. My disappointment is only a result of high expectations. It was still a lot of fun. This is a great direction for Tamil cinema. Have a great time and stay safe!"}], "reviews_amount": 37}