{"name": "Shehri Gabru", "titleId": "tt13410842", "reviews": [{"id": 0, "text": "Nice attempt by whole cast &amp; crew.. all actors have done well. &amp; direction too."}, {"id": 1, "text": "This movie had no sense what so ever. It was absolute rubbish. The story made no sense. The acting was ridiculous. Everyone seemed like they were friends or family of the director/producer to have achieved this role. If you are wondering about the high rating, you can have a look at all the reviewers who rated it highly, and see how many other movies they have rated. That's right, all the reviewers have only rated this one movie ever, and rated it 10 out of 10. This should tell you how the rating has been manipulated. My review won't even get published because I am speaking the truth. Don't waste your time on this rubbish."}, {"id": 2, "text": "Ye film bht hi jhakas lagi mujhe I love that type cinema nice Characters Robo and Badshah"}, {"id": 3, "text": "The movie served complete justice to the time invested. A full on entertainment movie with an unpredictable ending. I could barely find any flaws in the movie. Really had a great time watching it with my family. Good work team Jovial!"}, {"id": 4, "text": "Everybody has done a great job. Keep going like this. All the best"}, {"id": 5, "text": "In starting Guitar guy really did awesome acting. I expect his role in further movie."}, {"id": 6, "text": "Story line, characters everything is on top..... complete package of entertainment.....😎👍"}, {"id": 7, "text": "Work done by everyone is amazing. Keep going.. Loved the acting of guitar guy at the starting"}, {"id": 8, "text": "Great performance Akshay Kaushal. You killed it with your looks. You're acting was top notch. Proud of you. Now waiting to see you on big screen"}, {"id": 9, "text": "Amazing short film on mx player after a long period. Great entertainment 🔥"}, {"id": 10, "text": "It's a debut movie for everyone, they all did a fantastic job congratulations Team Jovial."}, {"id": 11, "text": "It's a debut movie for everyone and they all did a phenomenal work. Congratulations Team Jovial"}, {"id": 12, "text": "Amazing Hindi Film Three unemployed bachelors and two local goons leading their life separately, get a deadline of seven days to pay a large amount of money. To gather the amount in such a short span they attempt illegal ways that put them in a more complicated situation when their paths cross over."}, {"id": 13, "text": "The guitar scene was hold perfectly. Good to watch."}, {"id": 14, "text": "Amazing team work, actors are good and screenplay is good"}, {"id": 15, "text": "Nice entertaining moive ..really enjoyed ! It was fun to watch ...with light comedy . Nice job every one"}, {"id": 16, "text": "Really nice work. A must watch movie during the time of this pandemic. Great entertainer.."}, {"id": 17, "text": "Awesome work Sanjeet Sadh, very nice start...Our blessings are with you Keep it Up..."}, {"id": 18, "text": "Loved the role of guitar guy in starting. Everybody has done a great job. Keep going like this. All the best :)"}, {"id": 19, "text": "The movie served complete justice to the time invested. A full on entertainment movie with an unpredictable ending. I could barely find any flaws in the movie. Really had a great time watching it with my family. Good work team Jovial!"}, {"id": 20, "text": "Very nice movie. Liked the start of the movie. Enjoyed aloy."}, {"id": 21, "text": "I must say a must watch movie, it's a combination of high end drama, comedy. You can find everything in this movie for a good leisure time. Good work guys 👍 The person with guitar in the starting of the movie did well ,inspite of a short move provided. Would love to see more of his work in future. 💯💯"}, {"id": 22, "text": "It's fabulous movie on bachelor, unemployment, Jugaaad, struggle , love don't have a word to describe this movie , loved it , totally worth watching."}, {"id": 23, "text": "Cinematography is really nice, nicely done and story is really interesting and inspiring. Great work, keep it up."}, {"id": 24, "text": "🍿 really good story and acting was amazing. And starting was amazing and especially the guitarist boy stupendous performance"}, {"id": 25, "text": "Actors are best. Nice movie. Worth watching. Story plot is well presented throughout the movie."}, {"id": 26, "text": "Wonderful work done by all the actors. Great sense of humour and excitement in every scene. Loved it! 🤘"}, {"id": 27, "text": "Great movie, I enjoyed a lot....very entertaining....grt work done by all the actors"}, {"id": 28, "text": "That is a great experience to watch a fine plot with good acting skills by all young actors."}, {"id": 29, "text": "Everybody has done a great job. Keep going like this. All the best"}, {"id": 30, "text": "Its a good movie with great comic timing. Must watch for everyone. Keep up the good work Jovial"}, {"id": 31, "text": "Great all round performance by all. Good work Jovial Production.👍👍"}, {"id": 32, "text": "Nice direction, nice acting by actors total satisfy by watching this movie Nice work!"}, {"id": 33, "text": "It's an amazing film with so many hilarious moments. Watch it for it's compelling cast &amp; superb storyline. All the cast has done a great job but a special mention to Sanjeet Sadh for his amazing acting. Loved this film throughout. Watch it now and enjoy the thrilling trip this film will take you on."}, {"id": 34, "text": "Gud efforts by the whole cast.worth watching.gud storyline."}, {"id": 35, "text": "It is a entertaining movie , nice work team Jovial"}, {"id": 36, "text": "Excellent work 👏 nice movie everyone has done great work ....."}, {"id": 37, "text": "Really awesome movie and starting of the movie with guitarist boy scene was amazing.i like the movie and all d best for all team."}, {"id": 38, "text": "Perfect cast as per the role. Comic timing is very good. Overall a good product to watch."}, {"id": 39, "text": "VERY AWESOME MOVIE.🍿🎥 I ENJOYED ALOT WATCHING THIS MOVIE. BEST PART OF THE MOVIE IS THE CHARACTERS. JAVED BHAI AND LAVIT WERE THE BEST ACTOR IN THE FULL MOVIE AND THERE LOOKS WERE ALSO VERY MUCH STUNNING. I ENJOYED WATCHING THIS MOVIE. HOPE YOU GUYS ALSO ENJOY THIS MOVIE."}, {"id": 40, "text": "Amazing fast paced situational comedy. Nice acting by everyone.. Specially Sanjeet Sadh who played Jatin in the movie is in terrific form..his comic timing is top notch ..great future ahead of him.. wish to see him on big screen soon."}, {"id": 41, "text": "Superb movie.. I enjoyed this very much... Evey actor played his role very well"}, {"id": 42, "text": "Excellent job by the whole team.. thrilling performance.. nice attempt by the whole crew members and actor.."}, {"id": 43, "text": "It was an amazing experience to work with the producer, director and crew members of shehri gabru .. After watching this film I really enjoyed the scenario and punches between 3 bachelor's &amp; local goons Robo &amp; Badshah. Must watch this film ..😊"}, {"id": 44, "text": "It was a fantastic experience to watch this movie ."}, {"id": 45, "text": "Awsmmm comedy....... Best character played by jatin ........ Must watch"}, {"id": 46, "text": "Best thing to watch, excellent peace of work nice acting guys go and watch it."}, {"id": 47, "text": "Excellent work and nice movie 😊😊 everyone has done great work 👍"}, {"id": 48, "text": "Wow types.Great Entertainer. Whole line of cast is cool 😎. Throughly enjoyed. It's entertaining."}, {"id": 49, "text": "With this movie I can see a great film maker in making...great team work...you have shown that within no time you will be counted among great film makers. Interesting script...good acting...excellent direction....great work...perfect paisa wasool movie."}, {"id": 50, "text": "I recommend seheri gabru It has great entertainment with suspense and amazing story line. You should watch this."}, {"id": 51, "text": "Amazing movie Had a gala time watching with family"}, {"id": 52, "text": "It is a great movie🍿I loved the ending ......Must watch"}, {"id": 53, "text": "Amazing movie😀 all the characters did a great job Want them to see in other movies too great job great start.😍"}, {"id": 54, "text": "Best short movie, loved it. Must watch. Especially acting of Akshay Kaushal (Superstar)"}, {"id": 55, "text": "The movie was quite good...Great work guyz keep going..."}, {"id": 56, "text": "I really loved the movie and the characters specially robo and badshah ."}, {"id": 57, "text": "Full package of entertainment😊😊😊 Congratulations to all the team member... You guys have done good job. Keep it upWaiting for the next one JV."}, {"id": 58, "text": "Full package of entertainment..😊😊😊 well done guys Waiting for the next one JV"}, {"id": 59, "text": "Loved the role of guitar guy in starting. Awesome work by everyone :)"}], "reviews_amount": 60}