{"name": "Shawn Mendes: In Wonder", "titleId": "tt13276386", "reviews": [{"id": 0, "text": "Fans of Shawn Mendes will find lots to enjoy here. Unfortunately, there is not much in 'Shawn Mendes: In Wonder' for anyone else. The documentary only shows run-of-the-mill problems like imperfection mentality, insecurity, vocal problems, and homesickness, but refuses to reveal anything new, authentic, or interesting about the life of an incredibly popular musician. There is an attempt to add a touch of drama with a scare over Mendes' voice in the last act, but it does all come across as melodramatic rather than an actual concern. Shallow."}, {"id": 1, "text": "This was an unfocused documentary in my opinion. I expected more than this. Wasn't about Mendes' childhood, not much on his family or inspiration. Nothing in depth on any of his relationships or inner thoughts. Just some repetitive concert clips, a visit home and a vocal injury and it's effect on a concert. Maybe they should have just done a concert documentary because this wasn't that interesting. It needed some realness, some insights into his character or something."}, {"id": 2, "text": "I cried throughout the whole documentary, uncontrollably at the end. Not by how I was touched and moved by the documentary but by trying to rip my nails out during watching it."}, {"id": 3, "text": "Don't like it. It's genuinely fake. A lot of people knows what's real or not."}, {"id": 4, "text": "This boy is the definition of the white male privilege, he's so dull and boring and I don't know how he's filling stadiums. The documentary could have explained how he got there, which is what I was really expecting, but instead decided to be a documentary about nothing! There is no message! No story! Congratulations to those involved for filling so much time with so little content, that's a real talent."}, {"id": 5, "text": "I'm not really sure, what I was watching. The documentary seems to lack focus and there isn't really any raw or real conversations from Shawn, it seems very polished. Or maybe he just isn't that interesting. I'm sure fans of his music will adore it and leave loads of (undeserved) 10 star reviews, but if you're not a fan, then don't bother watching it."}, {"id": 6, "text": "I went into this not particularly caring for Shawn but I do also like a few of his songs so I said why not. Unfortunately like many other reviewers have mentioned, this doc has no real focus, plot or point. It wants you to think we are seeing deep inside who Shawn is, how he got to where he is, raw emotions, the usual documentary/biopic storyline etc etc. However, this is almost nothing of the sort. Sure there are scenes of the tour, and there are scenes of him recording. But all that's actually here for display is your average boring straight white male privilege. It doesn't even begin to scratch the surface of who really IS Shawn Mendes. I feel like I know just as much about him as I did before and that's not a very good thing is it?Now, does that make him a bad guy? Not at all. But that doesn't mean you need a feature documentary when you have nothing to show or talk about. I should feel engaged, not bored out of my mind. There is nothing deep here at all, and it is probably one of the most shallow and pointless docs I've seen. Skip this unless you are a diehard fan, because you quite literally won't miss anything."}, {"id": 7, "text": "I really was looking forward to see this documentary because I love Shawn Mendes and his awesome music but unfortunately I didn't like it. It's so boring and useless. It's like it doesn't have a plot and doesn't know where it's going so it just feels messy and unorganized all the time. Also it doesn't have anything interesting to deliver. But it has a few enjoyable moments and some beautiful shots. That's it all."}, {"id": 8, "text": "I couldn't quite figure out what their angle was. There's not enough tour footage for it to be a tour doc, not enough old footage of Shawn for it to be a biopic, etc. So that was quite confusing. I did end up liking it a lot though. If you're not interested in Shawn you probably won't like it, but that doesn't mean it's a bad movie!"}, {"id": 9, "text": "Extremely superficial documentary, not conveying any truth. It seemed more like a staging with awful actors all the time. Shawn Mendes being again the typical average white man who only thinks about success and does not evolve at all, but who is on the rise just for being a standart white man."}, {"id": 10, "text": "I cried a lot, tears of sadness, tears of joy I can't explain how proud I am of this human. I love shawn en what he does from the deepest of my heart. Well done!"}, {"id": 11, "text": "I just loved everything in this documentary, everyone should watch it. is inspiring and exciting, Shawn Mendes is a successful artist !!!"}, {"id": 12, "text": "A great well shot documentary. Feel good and shows how humble and talented Shawn actually is"}, {"id": 13, "text": "In the documentary it is possible to see and even feel a little what he goes through before concerts and tours, which you can feel incredible for having so many people have high expectations of you and hope that this never fail, difficulties with throat problems and the effort to always please everyone, ensuring that it is always an incredible experience to go to your shows, not to mention that we found out more about the history between him and Camila Cabello, we see some important points of his city for him, and his emotion and his difficulties, I certainly loved it too much"}, {"id": 14, "text": "Very happy to feel more connected to my idol, this documentary is so incredible."}, {"id": 15, "text": "If you want to know Shawn Mendes better, watch it. This documentary is sweet and touchy. The soudtrack fits perfectly, videos are so pure, honest and natural. Loved it!"}, {"id": 16, "text": "I find it incredible what a beautiful person and amazing talent he is."}, {"id": 17, "text": "So emotional and beautiful, you can really feel connected with him. everybody should see this!"}, {"id": 18, "text": "This documentary is the incredible and we can see how talented shawn is!!"}, {"id": 19, "text": "É um excelente documentário que nos mostra a jornada pessoal e profissional do artista. Me emocionei e me diverti nos momentos certos."}, {"id": 20, "text": "At a very young age Shawn is a global superstar,he is a kind hearted fellow who cares about his family and friends especially camilla cabello. I liked his music before but after this documentary about his 2019 tour,I'm a fan because believe or not this guy is humble. So if you are a fan or a casual listener of his music this Netflix documentary will be a good watch and learn something about this amazing young man at the start of his phenomenal career."}, {"id": 21, "text": "This couldn't not have been a more beautiful and accurate representation of what Shawns life is like. It portrayed him as the humble, kind , and incredibly talented Canadian that he is. Everyone should watch this documentary, whether you start the movie as a fan, or not. You will finish the movie with immense respect for Shawn."}, {"id": 22, "text": "He's the most sweet and dedicated person in world. So talented and lovely with the fans... deserves all the love, respect, successful and happiness in the world"}, {"id": 23, "text": "All those 10/10 ratings must be Shawn's fans. From a non-Shawn Mendes, this is the most boring documentory ever. Most of the scenes are from his concerts. Despite being boring, he also talked about his life ex: being sick. I would NOT recommend it."}, {"id": 24, "text": "Só perfeito eu o amo, amei a história e todo o drama e a verdade que o cantor transparece durante todo o documentário"}, {"id": 25, "text": "Mendes shows his most vulnerable side as a person and his arrival at success. The scenes with your girlfriend are cute and inspiring. You can feel Shawn's pain at the end of the documentary when he needs to cancel a stadium show... so sad! A work of art is what I say."}, {"id": 26, "text": "Amazing. Emotional.We can see that Shawn is an incredible person and with no doubts a talented artist. We can feel in Shawn' skin in this documentary. I love this so much."}, {"id": 27, "text": "It is a really good documentary and it was worth watching you will enjoy it a lot"}, {"id": 28, "text": "That was a good one. Emotional and based in reality. I mean no fake scenes and feelings."}, {"id": 29, "text": "I come to this without too much too much expectation because at the end of the day, the protagonist of a whole documentary is a 22 year-old. Even if he's world famous, Shawn's still a pretty unproblematic pop singer so I don't expect too much dramas or surprises to come along. A reviewer said that the drama comes across melodramatic and I agree. I think the right mindset coming to this documentary is to not to have too much expectation, to know a little bit about Shawn's personality already (sweet, hopeless romantic, drama-free). Only then you can take it for what it is - a glimpse into Shawn Mendes' year of touring, little bit of family and friends, little bit of famous girlfriend, some aesthetic coming-of-age footage and some good jamming sessions. I do enjoy it though, as much enjoyment as you can have watching a documentary about a modern pop singer with some success."}, {"id": 30, "text": "It is just like a copy version of Taylor Swift's Miss Americana. Even plots of this film are same as Miss Americana."}, {"id": 31, "text": "Could be better and more emotional. I expected more. I liked seeing more of his ´relationship´ with Camila though....."}, {"id": 32, "text": "5/10 - as a fan of only his greatest hits, this Shawn Mendes documentary does not delve into any real problems of fame and feels remarkably shallow and superficial"}, {"id": 33, "text": "Better than travis Scott one ngl. Like I like both artist, but the travis Scott one was like just sayin his tour and stuff, people know what happens, you can just google it, but at least this gave some special things like Shawn's relationship with camila and stuff. Not the best documentary, but certainly not the worst :/"}, {"id": 34, "text": "I'm a big fan of Shawn's music but I was expecting more into his personal struggles and rise to fame. It was pretty standard music doc without anything real. I like Shawn but it actually made him sound pretentious. I get that's musically talented but the attempts to portray him as just a regular guy fell flat and made him seem a little arrogant.It also glossed over his rise to fame and his MAGCON years. In one sentence they talked about how he went from doing Vines in his bedroom to becoming a superstar but without anything in between.Also we were promised a raw look at Shawn, but didn't really see much. Yeah he likes relaxing with his girlfriend when he's not on tour and doing regular things. Who doesn't? What about his insecurities and anxieties he always talks about? Briefly superficially mentioned.And the end climax where he has to cancel a show in Brazil because of his voice? Seen it before. Bieber's documentary and countless others have shown the same thing. And we know he's okay because he has a new album.In the end it'll please only his hardcore fans but anyone else might find it boring."}, {"id": 35, "text": "The doc shows the life of the amazing singer and how humble and talented he is. Shawn shows the difficulties he goes through and how the life of an artist is not always as perfect as the tabloids try to show. Is a very well shot documentary!"}, {"id": 36, "text": "Shawn Mendes: In Wonder is inspiring. This film is heartfelt and a terrific documentary. We get to see into Shawn's life and how he became the famous singer he is today. Shawn Mendes is very likeable and an amazing singer. Everything seemed genuine, and the music was fantastic. Shawn Mendes will hopefully continue to do great things and be known for how special he is."}, {"id": 37, "text": "Grate life of shawn everyone who love music should watch this once."}, {"id": 38, "text": "I've been a fan of Shawn for a while now and I so wanted to love this, but I couldn't help but feel that this doc was massively lacking in direction. As a fan of Shawn's music, I found it quite enjoyable in a nostalgic way as I attended some of the shows last year (notably the featured London show where he had vocal problems), but when the concert film was released just 24 hours later I found myself wanting more from this. This just appears to be quite a superficial look at the life of Shawn with no real insight with the possible exception of the turmoil of him cancelling a show, which, compared to other documentaries of similar topics felt a little... insignificant?It was impossible for me not to draw comparisons to the last film of this nature I watched - the Miss Americana (Taylor Swift) documentary that I was captivated by. Not only did this span a 13 year career without feeling rushed or shallow, but it also covered several conflicts, political dramas and general non-music events over the course of her career to add a different angle. It's this type of angle that makes documentaries like this interesting and worth watching for non-fans, and is something this film is crying out for. I can't help but wonder (no pun intended) if this came too soon, and might have been better received a few years later into his career when he has more to document than the everyday life of a pop star.That being said, I think it's a good watch for fans - just maybe not anyone else (sorry)."}, {"id": 39, "text": "Shawn is just incredible, the documentary is incredible. I cried a lot 😞"}, {"id": 40, "text": "Raw, emotional, vulnerable, inspiring, powerful and heartfelt!!! A must-see documentary."}, {"id": 41, "text": "So pround of this film and how we could see a little bet how Shawn is in real life!!!"}, {"id": 42, "text": "Shawn is such a beautiful human, the documentary couldn't be better."}, {"id": 43, "text": "This is an inspiring and exciting film showing Shawn's life and showing the truth and how human he is. It's one of the best documentaries I've ever seen, it's beautiful and it's magical."}, {"id": 44, "text": "We got to see a side of Shawn we've never seen before, we got to experience the magical experience of being on stage and also the bad parts that happen behind the curtains. The shots are amazing and so well thought, his voice and energy are beyond beautiful and this whole documentary is just... magical."}, {"id": 45, "text": "Everyone should watch it! The documentary have a lot of emotions and we can feel the real Shawn in all along. It's so powerful and pure."}, {"id": 46, "text": "Bloody amazing. i love shawn mendes. This documentary is a WORK OF ART."}, {"id": 47, "text": "I am big fan of Shawn Mendes and Justin Bieber..❤ I am watching wonder trailer I am so excited for this movie love all ❤"}, {"id": 48, "text": "I love this documentary, its intimate soulful story of a young musician. Definitely recommend to aspiring artists"}, {"id": 49, "text": "By far the best documentary I ever watched, you get to see my manz in humble situations. We get to see some seasoning in his personality and his great wardrobe. With the heartwarming stories of his first love and his first concerts. This movie makes me feel the love he has for the fans. More then anything it motivated me to go to his concert. Great movie to watch with seasonal depression:))))"}, {"id": 50, "text": "This documentary doesn't show us the life of another singer, this shows us a human. We all love Shawn for his amazing music and his really BIG heart, but we probably didn't know what's behind all those songs, so this is more like a view from his heart. Shawn is one of the best artist from now on, and this is why. Everyone needs to watch this even if you're not a fan of him."}, {"id": 51, "text": "Well worth the watch! For any music fans or anyone who is maybe seeking more documentariesI am a massive fan of Shawn Mendes and his music and have been for about 3 years now. His music style is my style and this documentary captures that perfectly in my eyes. It touches on his previous tour, which I went too in Birmingham England, and to see the behind the scenes was fascinating really, how he dealt with the numerous shows around the wait. For a 22-year-old, Shawn speaks with such knowledge and wisdom and that certainly shows in this album. He is certainly personal in this doc and that, again, is interesting to see how he copes with his fame, surrounding himself with loved ones and concentrating on the positives of life.I don't watch many documentaries, but I had to see this, being a huge Shawn fan, and I certainly will start watching more because they capture the true joy of life in all its beautiful forms, much like film but without the dramatic aspects.One more thing to add is that music is one of the few unique things in life that can make all your problems go away and that's what I took away from this documentary, it's something we all celebrate and be a part of together and isn't that amazing!Please see this, a brilliant watch and left me feeling amazing... I will learn the guitar!!Quote(s) - I'm just a guy, and I love music + Drop the ego - Shawn MendesRating - 5/5"}], "reviews_amount": 52}