{"name": "A Place Among the Dead", "titleId": "tt13060796", "reviews": [{"id": 0, "text": "I watched the movie on the word wide virtually premiere and I was thrilled! The film is amazing, surprising, fascinating and moving. Do yourself a favour and watch it too! Juliet Landau and her husband Deverill Weekes and everybody else who is in the movie are really amazing! I am looking forward to watch A PLACE AMONG THE DEAD again and again :)"}, {"id": 1, "text": "Just watched the film A Place Among The Dead which is Juliet Landau and Deverill Weekes debut film and I have to say a huge congratulations on a very thought out, well written, gripping, suspenseful movie, with excellent acting and true professionalism. A must see for anyone and everyone."}, {"id": 2, "text": "I have never seen a film like this in my life - just incredible. I thought the way it tackled the subject of narcissism through the metaphor of vampires was just poetic. Juliet's performance was amazing, so much heart and depth - it was also incredibly brave of her open up about something so personal. I wish there were more real and honest films like this out there. I have watched it three times now, every time I watch I notice something new, and every time I am left in stunned tears."}, {"id": 3, "text": "Juliet Landau's directorial debut is a fantastic take on narcissism, using vampirism as the ultimate metaphor to address this all-too-overlooked issue. Landau also gives a stunning, emotional performance as Jules - a version of Landau herself that reflects her upbringing as the child of celebrities. The film's atmosphere is quite Lynchian (think Mulholland Drive). While it is entertaining and will appeal to Landau's 'Buffy the Vampire Slayer' fans, the themes speak to a much wider audience. Having seen this mesmerising film several times (and discussed it with Landau), I still have questions - which is good, because this is a thought-provoking film that should be pondered and discussed."}, {"id": 4, "text": "I really didn't wanted to miss this movie and did two premieres and I am waiting an other opportunity to watch it again because at every watch you discover things you didn't the previous one. A movie that make you ask yourself a lot of questions, and really unique in the way it deals with narcissism. I really enjoyed this movie and give it a deserved 10/10."}, {"id": 5, "text": "This new film is a fiercely original work that blends documentary, drama, CSI thriller, and horror. If you are expecting a straight out, standard, slasher vampire film, you will likely be disappointed, but if you appreciate films in which the real horror lies more in what is revealed about society and human nature ( such as the Vanishing or Let The Right One In), this is a film not to miss. Hauntingly shot and beautifully acted, A Place Among the Dead is deeply psychological film which can't be watched just once; every viewing adds more layers and challenges your opinion of what in the film is real or imagined and who or what is the true antagonist. I've seen it three times now with different groups and we're still debating it. Don't miss it!"}, {"id": 6, "text": "I got to watch #APlaceAmongTheDead the first night and loved it. Kudos to @julietlandau on the labor of love *insert clapping hands emoji here* I've been a fan of Juliet's since she played Drusilla on Buffy the Vampire Slayer and Angel. Those who know her from that role know that she's got a knack for playing the hauntingly beautiful role. A Place Among The Dead has some of that familiar Juliet from #BTVS and #Angel days, but also shows a different side of her. Juliet masterfully balances both the actor and director hats. If you're the kind of person who stays glued to the tv to watch marathons of shows like Snapped, Forensic Files, Buried in the Backyard, Killer Couples, etc., you'll appreciate and enjoy the mystery that surrounds the film. I highly recommend this film and hope all the #BTVS &amp; #Angel fans watch &amp; support it. #JulietLandau"}, {"id": 7, "text": "A Place Among the Dead was absolutely delicious!!! What a treat! You are AMAZING! I was stunned at the style, the beauty, the creativity, the storytelling, the heartbreak!! BRAVA and all the roses, you must be so, so proud. Congrats on such an incredible and successful debut/screening/premiere! WOW! BRAVAAAAAAA!"}, {"id": 8, "text": "Juliet Landau's directorial debut movie, A Place Among the Dead, had me hooked from the first minute! It's a work of fiction woven through the fabric of reality.The film follows Juliet (or Jules) as she interviews people about vampires. Along the way, she gets caught up in a serial killer case. And as she she becomes ensnared in his web of horror, she finds herself questioning not only her own reality, but the possibility that he may really be a vampire.The writing, the acting, and the film itself blew me away. I could feel every emotion emanating from the screen as if it were my own. Not only was this a terrifying vampire story, but it was also a very accurate display of Narcissism and evil and how the toxicity of both can scar victims for life. I'm sure I'm not the only person who connected with Jules' character on this sort of visceral level.This is definitely going to be a film I break out every Halloween!"}, {"id": 9, "text": "I loved the commentary on narcissism and how Juliet Landau's childhood was woven into the narrative (not everything is as it seems...). I also found Juliet's acting to be visceral, portraying fear that was palpable to the viewer. It was a complex creation, and I loved it all; imagery, message, performance and story."}, {"id": 10, "text": "I watched the incredibly powerful worldwide premiere of A Place Among The Dead. It's Juliet Landau's directorial debut. Expect MANY more amazing films from this multi-talented woman. WOW WOW WOW."}, {"id": 11, "text": "A Place Among the Dead, is a vampire movie with a twist. This film raises soul searching questions about people's most intimate relations. Juliet Landau and Deverill Weekes created a film that explores issues relating to codependency, addiction, and toxic narcissism. This is a beautiful film, with a haunting score by Monica Richards, that enables the audience to explore deep into their hidden psyche."}, {"id": 12, "text": "A Place Among the Dead is unlike anything I've ever seen. Like any great piece of art, it is thought provoking and uses fact, fiction and the fantastical to encourage the viewer to examine the reflections of the film in their own lives. The conditioning and trauma we experience in our childhoods is something that is rarely discussed in our society and this film opens the door to much-needed conversations. Juliet is at her best, her performance is raw, powerful and vulnerable."}, {"id": 13, "text": "Juliet Landau's film A Place Among The Dead was absolute brilliance. I was lucky enough to see the debut of A Place Among The Dead. This film is absolutely stunning. Juliet Landau is outstanding as always. This was Juliets directorial debut and She did a suburb Job. I identified so much with Her character . I felt like I was in My own Mind.The cast is truly a dream cast. A Place Among The Dead is a gothic ballet of emotions, a must see. I have always believed in Psychic Vampires. I am an Empath and they effected me to the point where I get physical and emotional pain. I have long thought of Narcissist as Psychic vampires. This is why Juliet's Film touched me so much.I am definitely watching it again with next live watch. Can't weight to own it and add to My collection."}, {"id": 14, "text": "Juliet Landau's feature film directorial debut explores some dark themes. It's a raw look at narcissism and how one can lose themselves when they find themselves consumed by darkness. Juliet's performance is brilliant. She really opens up and lets the audience see her at her most vulnerable. The cinematography is beautiful. Great cameos by some famous faces playing themselves. The interviews were so natural i thought they were excepts from Landau's unreleased companion project The Undead series which features interviews with writers, actors and directors who have worked on vampire driven projects. But, it turns out, the interviews in the film were actually scripted and performed by the celebrities who were playing hybrid versions of themselves. Sheer brilliance."}, {"id": 15, "text": "This film expertly uses the vampire genre to explore the repercussions of growing up under the sway of narcissism and evil. It is a revealing and often terrifying meld of fact, fiction and the fantastical. If you have ever suffered the under the control of a narcissist this film is a must see. I have seen it 4 times and each viewing has revealed more and more layers it is a powerful piece of film making."}, {"id": 16, "text": "Juliet Landau and Deverill Weekes take us on a captivating and very personal journey into darkness... wait - is that a spark of light? I was deeply touched by the movie. I can very much relate to Jules' past (and present)... A must see! Fari Y., Germany"}, {"id": 17, "text": "Juliet Landau has created a compelling film - a study of narcissism with the narcissists portrayed as vampires. Containing personal images from her childhood along with horrible quotes she had to live with and endure growing up, Juliet plays a version of herself not so well grounded - bound up with feelings of inadequacy and a need to please from her childhood. This Jules becomes obsessed with the deaths of several young girls and makes it her mission to find the killer whom she believes to be a vampire, although the police are calling him a serial killer. The film features conversations with many people who have written about vampires or been involved with films about them including Anne Rice, Gary Oldman and Joss Whedon. I found the film very emotionally compelling - I wanted to be able to comfort and heal the young Juliet and as the older Jules made bad decision after bad decision I wanted to reach into the screen and shake her. I loved the film and can't wait to be able to own a copy and rewatch it."}, {"id": 18, "text": "This is one of the best movies that I have watched this year. Juliet Landau explores themes of mystery, crime, the supernatural and narcissism in this 77 minute epic. It keeps you guessing from one moment to the next and still even at the end, we think we've seen the man who she is looking for, but we still don't really know who Darcel is.A fantastic mix of a crime thriller, vampire horror and documentary. Some parts are filmed amateur style in a similar vein to Blair Witch project. You believe you are in the room witnessing the moment. The soundtrack is excellent and fits with the action the audience sees.I was immensely captivated by the brilliant and convincing acting from all of the cast, but the lead actor and director of this movie, Juliet Landau shines in her emotional and believable performance which will certainly captivate and enthrall you. Everyone needs to watch this film."}, {"id": 19, "text": "A truly original work that encourages not only insightful and thought-provoking discussion about the nature and repercussions of narcissism but also deep self-reflection about the effects of narcissism in the viewers' own life and experiences. A fantastically meaningful work from a wonderful artist and team"}, {"id": 20, "text": "This is a masterpiece of a film and is amazing in terms of how it deals with sensitive themes and issues I recommend everyone sees it"}, {"id": 21, "text": "Billed as a conventional horror ,this film is much more than that - it's more of a personal odyssey with vampirism a cipher for the narcissism that has influenced the Director's younger life. It has some great shots, great actors and really interesting and insightful observations on the harmful and enervating effects of self-obsession. Not easy to watch in places but always interesting, and with some genuine shocks for horror fans. Strongly recommended..."}, {"id": 22, "text": "I was looking forward watching this movie starring Juliet Landau. I must admit I was very curious to watch it and didn't know what to expect as I always try to avoid spoilers before watching a movie. After watching, I was mindblown as it's a movie dealing with narcissism and it makes you really think hard about it afterwards in a way you've even never thought about it before. From the beginning to the end, I was fascinated by everything not only by how the story unfolds but how every aspect of the film was made. A must watch, you won't regret it."}, {"id": 23, "text": "I watched #APlaceAmongTheDead and loved it. With such an amazing cast I Highly recommend it. Hope all the #Angel &amp; #BTVS fans watch &amp; enjoy it as I did. #JulietLandau"}, {"id": 24, "text": "I was lucky enough to attend the virtual Premiere of A Place Among the Dead where I enjoyed cameos from 'vampire royalty' - from Anne Rice and Charlaine Harris to Joss Whedon, Julie Benz, Principal Snyder and even the Mayor of Sunnydale!Juliet's portrayal of Drusilla in Buffy has always been my favourite female vampire onscreen, so I knew without question this film would be good. I wasn't disappointed, I absolutely adored it!The film is haunting and beautiful, artistic yet thought-provoking and sad. The idea of the vampire as a manipulative narcissist weaves its insidious way cleverly into the plot, almost before you realise. I also liked Gary Oldman's inference that he would only discuss vampires off camera.My only criticism is that I would have made the artwork shown throughout the film, more monochromatic and Gothic - less colourful. (Sorry - art director hat on!)But this film ticks many boxes I think... it's just wonderful! I want to see it again - and possibly again! Amazing work! Congratulations to both Juliet and Dev."}, {"id": 25, "text": "The film was brilliant and had us transfixed, moved and emotional as a lot of us have dealt with narcissism within families. Absolutely superb acting and I wish you so much success with this Juliet, you so deserve it.It was utterly brilliant and very, very moving to the point we were all sat with very watery eyes watching it feeling rather gut wrenched!"}, {"id": 26, "text": "BRILLIANCE PURE BRILLIANCE. I still can not put into words the range of emtions I personally felt watching this movie. Definitely an absolute must see movie. Jorge Anne Weaver"}, {"id": 27, "text": "Moving, thought provoking, leaves you really thinking and definitely want more x"}, {"id": 28, "text": "Juliet Landau's film is a work of brilliance... It is something I will want to watch again and again. Loved every minute of it. Despite the entertainment value, which is compelling, Juliet Landau takes a very bold step in addressing the ill effects of narcissism by drawing from her own family experiences and juxtaposes that narcissism to express the metaphor of the narcissist in the form of a vampire/serial killer. This film is very powerful and gives much to be considered; and I hope this is just the very thing to spark a much needed conversation that is every bit as influential as the #me too movement.Very well done Juliet!"}, {"id": 29, "text": "Don't walk but run to the Oscars with this Cinematic Metaphore, an amazing and unique amalgam of pseudo-Documentary, Narrative, Experimental and even a bit of highly emotional Animation. Juliet Landau's screen presence is simply mesmerising and the film is brilliantly shot and edited with deeply touching Voice Overs, Music and dramatic Sound Effects. It's certainly worth the years of work You have invested in this marvelous film."}, {"id": 30, "text": "This will definitely live on as a cult classic! Such a powerful film. Can't wait to watch this again."}, {"id": 31, "text": "The movie is completely original. Right from the opening to the end, I had no idea what was coming next and was thoroughly engaged in this disturbing drama. I'd seen Juliet Landau's short film TAKING FLIGHT so I was prepared for her distinct non-traditional way with storytelling. I was not prepared to be haunted for days afterward. It's a deeply emotional ride."}, {"id": 32, "text": "A PLACE AMONG THE DEAD is Juliet Landau's amazing, deeply emotional directorial debut - a vampire documentary that explores our obsession with vampires and what they reveal about the human psyche."}, {"id": 33, "text": "This film truly is one of my favorites. From the acting to the directing and cinematography. This film is one of Juliet Landaus best works yet."}, {"id": 34, "text": "I love this film. Simply stunning in every aspect. My favorite aspect is the directing and cinematography of the film. Truly state of the art. Juliet Landaus acting in this film is spectacular. A must see."}, {"id": 35, "text": "You broke all the rules and broke and mended our hearts...With A Place Among the Dead, you have accomplished something unprecedented and chilling. No one has ever driven the spike of truth into the narcissistic vampiric heart as deeply as you have...."}, {"id": 36, "text": "This movie is absolutely terrific. It dug deep into some amazingly hard topics. I will definitely watch again and will recommend it to friends!"}, {"id": 37, "text": "A thriller that took me to a place I have not been in a long time. Amazing writing in using personal and human touches to bring up important topics that people need to hear. I loved the use of vampires as the ultimate Narcissist and y we are fascinated with them. Multiple views are a pleasure."}, {"id": 38, "text": "I was ensnared from the beginning and couldn't be torn away. I've always found horror movies cathartic since I was very young, but this one was particularly eye opening. You will experience raw psychological thrills that will leave your body vibrating. Narcissism is splendidly presented in a dark and visceral manner, and and Juliet Landau perfectly personifies the downward spiral into the abyss. This is a film that leaves the viewer wanting more, many of whom return for multiple viewings to properly analyze the film and find new subtleties which previously went undetected. With striking imagery, haunting dialogue and hidden messages between the lines, a beautiful tapestry is woven to create this transcendent, ethereal feature."}, {"id": 39, "text": "I really didn't know what to expect when watching this movie before watching. It was very eye opening for me, and the subject of narcissism mirrored the soul sucking personality of a hungry sociopathic vampire. The imagery, the music, and the excellent acting conveying the emotion of someone haunted by words burned into them carries a powerful message. I learned from it. Kudos!"}, {"id": 40, "text": "Juliet Landau &amp; Deverill Weekes have created something unique here. This film evokes numerous emotions and ably captures the sensation of having fallen down a rabbit hole as obsession into an investigation leads the protagonist to the brink of madness. Will stay with you long after you've watched."}, {"id": 41, "text": "Juliet Landau and Deverill Weekes hit a home run on this epic movie. The idea and story are superb and expertly executed. The writing, filming, and performances within are spectacular. As the movie goes on it was gripping and held me in to find out the truth.I enjoyed the layers throughout to provoke your thoughts.- Possible reality? Perhaps documentary? Maybe an autobiography? It completely reflects present day times of how the world has turned into a place where sometimes people focus way too much on themselves in many ways.A topical film exposing narcissism in its various forms and how it really affects peoples lives and our society. It is a statement. Go see this film."}, {"id": 42, "text": "Got to see a different style of movie with so many different messages through out,which gives the viewers something to think about and question.Amazing performance from Juliet Landau the different emotions shown in the movie was astounding.plus an all star cast with some great cameos. It's a must see or even if your just curious check it out definitely worth seeing."}, {"id": 43, "text": "From the music to cinematography the writing the fact it was scripted but felt completely natural. All of the people who took part in the film did an amazing job. Juliet's acting was sublime, it was great to see Deverill he was brilliant. A deeply thought provoking film. Using vampires as a metaphor to explore narcissism is truly brilliant. Incredibly brave of both of them to share such a personal story. It really resonated with me."}, {"id": 44, "text": "This film wastes no time in grabbing your attention. I found myself holding my breath right from the beginning. I'm not sure I've released it yet.A fascinating and captivating search for the real among the imaginative, it combines elements of several different genres: Film noir, performance art, Abstract Expressionism. In its presentation, it reminded me of Richard Linklater's *Waking Life* and Madonna's *Blonde Ambition*.It left me feeling at once disturbed and intrigued. In its ability to do that, it is truly a masterpiece."}, {"id": 45, "text": "Stunning and captivating, A Place Among the Dead really spoke to me. I appreciate Juliet's shifting awareness and responses to the dark landscape and delicate and frightening situations she chose to face. Maybe due to my familiarity with narcissism, I felt the film recreated the perplexed and discomposed responses that are common for victims of narcissism and intentionally ill treatment. Just when one shows compassion, she is challenged and questioned for being evil, when she is only trying to navigate her way out of the labyrinth of confusion and psychological torture. I appreciated the many celebrities sharing their perspectives. I highly applaud Juliet for this creation."}, {"id": 46, "text": "A very personal and intimate film which shows Juliet Landau's immense talent as an actress and director.This film offers us a vision of narcissism and evil like never seen before, and with a subtle and personal treatment that makes it all very compelling.The ghosts of the past come back to haunt the present with a tragic end to it, all related to personal experiences and traumas make this film a unique experience. A very nice mix between documentary and fiction.In short: a masterpiece!"}, {"id": 47, "text": "The film really touched me, not only was it great looking and wonderfully acted, it was so easy to watch while hitting on really important and profound things. On a personal level I kept thinking of a horrible sociopathic person I had in my life and just how much you nailed that self obsessed vanity so well in this film. Congrats it was incredible and fun and so cool and smart! I can't wait for the world to see it!!!"}, {"id": 48, "text": "Juliet Landau's A Place Among The Dead is a fascinating motion picture. It was disturbing, gripping and really quite unique in that its incomparable to anything else I've seen in recent years. When was the last time narcissism was tackled in such an original way if at all? The sense of claustrophobia &amp; impending doom remained prevalent throughout the film. It had touches of David Lynch, Jonathan Demme &amp; David Fincher in there. The acting was first rate with the actors all completely believable in their roles. The film REALLY gets under your skin and I mean that in a really positive way. It made me think deeply about many topics eg: deep rooted narcissism, pushing the boundaries of storytelling telling &amp; film as art. A genuinely moving film which will stay with me for a long-time. Well done everyone involved."}, {"id": 49, "text": "Barbara Bain and Martin Landau have always been two of my favorite actors. When I heard their daughter Juliet Landau had just finished her first film, I was very interested in seeing it. Boy, I was not disappointed. As it took me in, I was in a world of film making for a so called Horror movie, and just let it happen to me. And it did. Wow, I said to myself what a talent Juliet Landau is. To think she came up with the new concept of a horror movie is enough; but to write it, to direct it, and then Act in the leading role was a mind blower. I just sat there at the end in a kind of limbo. Just relishing what I had just seen and experienced. Thank you Juliet Landau for a wonderful movie experience. I will be looking forward to your next one!"}, {"id": 50, "text": "'A Place Among The Dead' is An Amazing Movie &amp; a Wonderful performance by The Amazing Juliet Landau Truly incredible Movie I ❤ it"}, {"id": 51, "text": "I loved A Place Among The Dead. The way the story is woven was so beautiful, artistic and original. I was really into the genre blending. Juliet's acting and direction is fantastic. I really enjoyed the cinematography by Deverill Weekes and Akis Konstantakopoulos."}, {"id": 52, "text": "Jesus, Mary and Joseph, Juliet Landau: ...if those whispered wounding words were your reality as a child, I offer both my sincere condolences and abject apology for writing such a glowing review of your father on your FaceBook page.This film was visceral, extremely personal and emotional. The tunnel scene was eerily evocative of Juliet crawling back up the birth canal. What an extraordinary viewing experience; essential for those who have similar demons from a haunted past with which to contend. A really brave piece of work from an insanely talented artist. Huzzah, Juliet, huzzah!!!"}, {"id": 53, "text": "This film is highly unusual in its style, unique, something I haven't seen done before. It was like looking at two realities, the physical reality and the invisible spiritual reality, which was more like looking into someone's mind. Besides being taken on a mysterious and sometimes scary journey by the immensely talented Juliet Landau, I found myself being taken on a personal journey of how I have been affected by, or seduced by, or have created my own emotional evil; how my vanity has put me in a place where love slips away and the negative evil comes to visit. This is a very provacative film and beautifully shot. I really appreciated the camera style. I enjoyed being able to follow things without a new camera angle every 10 seconds. I was fully engaged from beginning to end. Great storytelling, stunning visuals and a compelling soundtrack. Art at its best!"}, {"id": 54, "text": "What this film reveals on screen is only a fraction of what you will feel inside! chilling! suspenseful! terribly insightful to the psyche. I was captivated from moment one!"}, {"id": 55, "text": "Draws you in. Leaves you wanting more. Gives you plenty to talk about. See This Film!!!!"}, {"id": 56, "text": "Kept me on the edge of my seat! Miss Juliet knocks it out of the park!"}, {"id": 57, "text": "A completely original and incredibly ambitious horror film that combines genres might be the most difficult filmmaking to pull off. It's sure to aggravate those looking for straight-forward horror, while needing to satisfy those looking for art. Writer, director and star Juliet Landau is triumphant at balancing all the genres and the ever-shifting tone. It's tight-rope act that few have tried and far fewer have succeeded.Landau is best known for her acclaimed performance as Drusilla in Buffy the Vampire Slayer. A performance that for over 20 years I have been screaming is one of the finest to ever grace television screens. Seeing her alongside Gary Oldman, who for over 20 years I have called the best actor of his generation, is a truly astonishing site to behold. I imagine there has never been a horror film with a cast nearly as talented or recognizable. It also includes cameos from Joss Whedon, Anne Rice, Lance Henricksen, Ron Perlman, Robert Patrick and several others. I half expected to see Bela Lugosi or Bram Stoker resurrected just to make an appearance in this film.After you get passed the wow factor of the cast there is much more to marvel at. Landau is a fantastic director which shouldn't come as a surprise to those who have been following her. The writing stays with you. Fact, fiction, fantasy and horror are interwoven in what at times feels real, at times feels like like a dream, and at times feels like a nightmare. All while the music of Mozart dances from the screen. Real life husband and co-star Deverill Weekes proves to be a talented cinematographer and captures some wonderful imagery. It's the rare movie in which you can't wait to see where it all ends up and everything from entire scenes to brief flashes stay with you long after the credits role.A genre-bending arthouse film like this may not be mainstream, but every fan of horror and every fan of Buffy the Vampire Slayer should watch this immediately and tell all their friends to do the same. This has cult classic written all over it and will be talked about long after the major horror films you see playing on theater screens are forgotten."}, {"id": 58, "text": "I was able to see an advanced screening of Juliet Landau's new film A Place Among the Dead. It's unsettling, intense, mind-bending, and disturbing on multiple levels...which is exactly what makes it work so well as an emotionally charged psychological thriller.Within seconds, A Place Among the Dead captures viewers with an almost hypnotic hook that penetrates deep into the psyche of anyone whose ever felt or been told they are less than. The technique enables the viewer to become emotionally entrenched within the film's first couple of minutes.While it's billed as a vampire film, A Place Among the Dead is much deeper than a story about vampires. Instead, it's an immersive look at narcissism, the concept of evil, and the tendency to blur the line of fact versus fiction through the course of our own inner narrative.Juliet and crew blur their own lines between fact and fiction with scripted interviews from celebrities from within the vampire mythos, a compelling reality TV/real crime storyline, peppered with the occasional use of real names and relationships. The creative decisions to weave fantasy and reality together this way can be unsettling, evoking emotions akin to learning something you held as an indisputable truth is, in fact, completely fabricated.As a person who typically avoids horror films and most thrillers, I had reservations about watching this film...doing so in a well lit room in the middle of the day. But A Place Among the Dead isn't scary so much as it is intensely disturbing in a thought provoking way. I'm glad I had the opportunity to watch it and by taking a chance on this film, I found myself becoming more aware of the core internal messages that I send myself each day."}, {"id": 59, "text": "I've never seen a more truthful brave film. I can't emphasize this enough.You go into this movie expecting a horror and leave baring your soul to whoever will listen. Artistically inventive by sewing genre's together with care. Rather than boxing herself into a style for convention sake, Juliet chooses instead to tell her story the way she wants to. From the onset of the film you know exactly what truth she wants you to hear, and then from there she guides you through all the reasons why. Though the undead do walk in this film, this isn't a reimagining of Drusilla, the Sid &amp; Nancy hybrid vampire from Buffy the Vampire Slayer that Juliet is rightly famous for but instead gives you a study on the diversity of evil.Interwoven throughout this fictional thriller story are some familiar faces of Hollywood's vampirical elite giving their perspectives on evil. These documentary style interviews offer thought provoking moments to the story being told.Juliet makes the case that some people raised by evil become a reflection of those that raised them, while others become emboldened to be anything but that reflection. The film illustrates the challenges one can face when struggling to fight those demons that take root as a child and grow along with you into adulthood.I'm so moved by this film that I'm reminded how incredibly brave Carrie Fisher was with her autobiographies after her Star Wars fame. Inviting the world to see not everything in Hollywood is glitz and glamour even if you're on top. I think the world adored her more for it. In similar fashion I believe this film will have Juliet's fans adore her more for making it."}, {"id": 60, "text": "From the outset, I was taken aback by how deeply personal and incredibly revealing this esoteric film turned out to be. One has to be extraordinarily brave to venture down roads so many of us try to forget ever existed.I found the writing, in the form of the subject's observations and deductions into the evil entity, to be very thought provoking, even memory inducing - dark memories.There are many solid, emotionally jarring performances by, to name a few, Denise Blasor, Janet Chamberlain and, of course, Juliet - particularly in her sorrowful appeal.The film has many layers. My personal interpretation; at its core, is that Hollywood, in its ability, its unwavering success at capturing people amidst their most beautiful and alluring stages of life and suspending them forever in celluloid, is the cloaked vampire of our time.A Place Among the Dead, so aptly titled, is a horror story told from the soul, and set in the very town that devoured it.Bravo."}, {"id": 61, "text": "A Place Among the Dead initially appears to be an intriguing murder mystery; but, if you look closer, you will find it goes much deeper. Juliet Landau plays an alter-ego of herself named Jules who is compulsively drawn to an ongoing serial killer case. It becomes gradually apparent that the horrific narcissistic parental abuse Jules endured in her childhood is actually the root cause of her obsession with the vampire-like murderer and his young female victims. The aftermath of narcissistic parental abuse often leaves children with PTSD, strong empathic traits, chronic self-blame, and overall unhealthy emotional programming that, if not healed, creates a lifetime attraction to (and immersion in) toxic, abusive people and situations. All symbolically apply to Jules. There are additional correlations between vampires and malignant narcissists: they are both abusive, draining of body and soul, and indifferent to pain inflicted on others. Furthermore, the killer's victims have an attraction to the lore of vampires; particularly for their eternal beauty and immortality - inhuman qualities narcissists often impossibly demand from those they abuse. The acting, writing, cinematography and directing are all top-notch. The story is thought-provoking, creative, ambitious and unique; touching on a topic not previously explored within such depths. A Place Among the Dead appears to be a deeply personal and courageous film that gives introspective, brave new meaning to psychological thriller. Pioneering and impressive."}, {"id": 62, "text": "A surprising, original and deeply thought provoking film that will stay with you! Juliet Landau draws upon her history with vampires - she played the insane, psychotic but loveable Drusilla in Buffy the Vampire Slayer and Angel - and uses vampires as a metaphor for narcissists and their toxic effect on people who are under their influence. Juliet's parents Martin Landau and Barbara Bain figure prominently in the film as examples of such personality disorders, whose self absorption and intense criticism permeated her childhood.The film combines fact and fiction to tell the story of Juliet's alter ego Jules, who is researching a documentary about vampires. She and her real life husband and cinematographer Deverill Weekes (Dev) interview Charlaine Harris, Lance Henriksen, Tom Holland, Mariana Klaveno, Kim Newman, Gary Oldman, Robert Patrick, Ron Perlman, Anne Rice, and Joss Whedon on the subject, and their comments are woven into the story.Ignoring advice and warnings from husband and friends (including Gary Oldman), Jules heads to Santa Barbara to research a serial killer who may be a real vampire for inclusion in the documentary.A cat and mouse game between Jules and her subject develops as she pursues the killer, empathizing strongly and identifying with his victims. Jules becomes more and more deeply involved, obsessed and isolated, descending into madness and an ultimate resolution to her disturbed psyche. Juliet's performance is complex and vulnerable.Eerie, deeply atmospheric, with echoes of David Lynch, Blair Witch and film noir, heightened by an excellent soundtrack, it's an exploration of much more than just vampires."}, {"id": 63, "text": "A Place Among The Dead is a very brave, innovative, and interesting exploration of evil and its effects on humanity-a very timely subject, considering the times we're currently living in.Juliet Landau brings a mesmerizing presence to the film, which keeps the viewer off-balance throughout, not knowing whether what we are viewing is reality or fiction.I've seen the film several times, and each time, I take away some new truth about myself, or a better understanding of humanity in general.I've only been truly inspired to my core as an artist twice in my life. Once was meeting Annette Bening, and talking to her about her work, and the other was working with Juliet Landau in this film, and seeing her work in the final product.This movie is a game changer in the genre.Louahn Lowe"}, {"id": 64, "text": "Juliet's directorial debut is a stunning piece of work that comes from the heart. The writing is brilliant. Weaving the memories of the past, how it affects the present, leading the search/investigation in life, for truth and love. And the peace that comes from knowing.This film can lead the viewer into deep introspection, and healing of their own injuries, emotional and physical. Also, open conversations about difficult subjects, the ones we typically choose to hide, that hurt us the most by their shame. No more.Can you believe the talent on this project? For a first time director? Bravo! Juliet. You have a reputation of integrity, that brought people out to work with you, because they like you, and believed in your film.It is a film that needs to be seen over and over again."}, {"id": 65, "text": "I have been a fan of horror for a very long time-it's probably my favorite genre not only for thrills but for what it says about our world. Vampires are always compelling for their symbolism of invasion, of control, of narcissism. We live in a narcissistic culture with a focus on celebrity (this is even stronger than it was in years past) and we are drained-we consume, or are consumed, even as many of us create work online to be seen.This film was enthralling, strange, compelling, clearly very personal, and spoke to the ideas of obsession, celebrity, inner doubt (created by...? it is left to the viewer to decide), and ultimately, a form of self destruction married to a destroyer.It's not a traditional narrative and invoked images from David Lynch, Hitchcock, and Kubrick. It was hard, in some ways, on the viewer, the gaze was relentless.I left it feeling grateful that my obsessions haven't gone that far yet :) but also that I hope to see more from Landau and team."}, {"id": 66, "text": "A Place Among The Dead is a highly personal film and a tour de force by actor, writer, director and producer Juliet Landau.The film will leave you drained and not just due to it being a film based around the vampire mythos. Landau's performance is exhausting in the nervous energy, fear, and emotion she's showing us. You feel it as she does and her lovely, haunted eyes wrench into the camera in a way that reminds me of Toni Collette in Hereditary where you can see the last nerve fraying.A Place Among The Dead may be fictional, but Juliet and Dev Weekes have put much of themselves (literally portraying themselves) in the film. It's hard to describe the movie itself. It's part faux documentary, part found footage, part vampire film, and art film. But it works as not only a movie but also as a metaphor and message to survivors of trauma and narcissistic relationships that you can find yourself and overcome it.Definitely check it out but prepare yourself for the punch to the gut this can be."}, {"id": 67, "text": "Absolutely amazing!!I loved Juliet's and Dev's unique look of the film - A Place Among the Dead was shot beautifully! I loved seeing well known alumni who had played vampires in the past, authors, filmmakers participating in the film sharing their viewpoints I absolutely adored the Q&amp;A and hearing everyone's thoughts and opinions!The way the film was shot, incorporating a documentary with a crime show vibe was nicely done!I'm so stoked I was able to watch this before Halloween! Loved hearing the MAC Pro Makeup Panel! Very insightful!Thanks for putting your heart and soul into this! !Superb! #julietlandau #deverillweekes &lt;3 &lt;3 &lt;3"}, {"id": 68, "text": "A Place Among The Dead is incredible! I don't think I've ever watched something so personal, so stripped back and raw. The emotional energy, woven like a rich tapestry throughout is enthralling and is the golden thread that brings everything together. Juliet leaves nothing behind in her performance... such vulnerability.Shifting from biopic to documentary to dark fantasy, starting out with seemingly different worlds dancing around each other, slowly overlapping, realities blurring until you don't know what's real any more.The movie touches so many issues from how parents shape our formative years, how society and media eats away at us in later life, psychological abuse, the projection of parental desires onto a child, being blamed for their failings, the never-ending quest for youth, quest to be accepted, to be loved, to be worshipped... to be objectified.It really is societies failings laid bare and the dark world of vampirism is the perfect allegory of fear, flesh: our eternal quest to stay beautiful and what we sacrifice to obtain this. The film features a who's who of cult legends such as Gary Oldman, Ron Perlman, Robert Patrick, Lance Henriksen, Joss Whedon, Charlaine Harris and Anne Rice.The attention to detail is immaculate... the performances, the editing, the art, the lighting, the amazing locations. It's crafted with multi-layered stories, which slowly merge throughout until they become one sharp-point right through the heart. Amazing! What a piece of art."}], "reviews_amount": 69}