{"name": "Middle Class Melodies", "titleId": "tt13242960", "reviews": [{"id": 0, "text": "Characters driven fun, humourous, light hearted movie, absolutely worth watching."}, {"id": 1, "text": "Though story looking normal, it has many shades, kids give less rating coz he is vijay deverakondas brother, those kidz dont watch, anyway u didnt like."}, {"id": 2, "text": "Story line was really good and very close to reality. Kudos to the director for keeping maintaining the lite and funny mood through out the movie."}, {"id": 3, "text": "If you have come from middle class family background then it will definitely remind you about your struggling days...wonderful movie to watch and it was entertaining, reality, superb acting and well crafted. Each and every one did a fantastic job..."}, {"id": 4, "text": "You can't take of your smile while watching the movie. I liked it😊 Nice movie Watch with family"}, {"id": 5, "text": "Very good family entertainer. Great script and tight narration. Each and every character is dealt with utmost care and every character has a definition in the story. All the stories of each character has an ending. All good actors. Anand Devarakonda was just above average. Need to improve maturity and expression wise. The fathers character is a stealer of the show. He was so great and wonderful acting. Best thing in this movie is the leafs father and mother character. Overall a very well directed film by Vinod."}, {"id": 6, "text": "Malayalam film industry is making these kind of movies and we are missing them in telugu... Thank you Director and crew for this movie...."}, {"id": 7, "text": "Just go for it second hit for Anand ,pure story telling no nonsense V good performance from cast Well done team good job"}, {"id": 8, "text": "Genuine attempt and simple story ..Father character was too good .."}, {"id": 9, "text": "Acting is good. Movie is based on a routine story line, but you won't get bored. Good job by the director."}, {"id": 10, "text": "The story is about a middle class guy aspiring to start his own hotel. The narration does not lack pace and keeps you entertained throughout. The climax part is absolutely hilarious. One of best from Telugu cinema!!"}, {"id": 11, "text": "After a long time I felt connected with a film and this is that film... Just beautiful' the only good thing happened in 2020 is this film."}, {"id": 12, "text": "The wonder full movie even this movie is whole part of middle class people problems and 1st half is little lag and second half is very good 👌👍 and good ending😊"}, {"id": 13, "text": "We know by trailer what we're signed for and One hour into the movie there is nothing new or solid point to hold on to. We quickly loose interest in the characters. There's no flow or rythm to what's happening in the movie. Coming to the love story we get exactly what we saw in the trailer there's no extra thing in their story. Yes the Nativity is shown nicely but there's nothing strong for showcasing the village or its beauty. Same in the case of acting, main leads tried to act but there isn't anything to act for. The only new and good thing I liked is few charcters and thier storyline. Even though we have seen these types of troops a lot these days but this film showed them in a new way."}, {"id": 14, "text": "Absolutely brilliant, lovely direction, brilliant casting, everyone acted naturally, you will be a part of it throughout. All the characters feel very real, it's a 100% family entertainer, no awkward moments... The movie keeps you engaged right from the start to end.. every character played by every actor is superb!!"}, {"id": 15, "text": "Wonderful climax ,and enjoyed the movie for starting to ending,All the best for next movie"}, {"id": 16, "text": "Very nice cinematography, screenplay, Direction. Very Engaging comedy and Realistic dialogues. Very Well written."}, {"id": 17, "text": "Anand devarakonda and varsha bollama acting super songs also good mostly I like story and screenplay verdict super hit"}, {"id": 18, "text": "Movie is below avg. slow scenes. Story is ok screen play is avg. acting is average apart of hero's father character."}, {"id": 19, "text": "If the movie was 90 - 100 min long instead of 126, it could have been much much better to watch, brilliant ending though"}, {"id": 20, "text": "Well written, down to earth, Need these kind of scripts in Telugu Industry Excellent Direction.. Kudos to Director for bringing best out of every character. But still this is Long Short Film."}, {"id": 21, "text": "This movie is a delight. Kudos to the debut director for managing to distill the nuances of a middle class life. The movie kept me glued to my seat until the end and I enjoyed every moment of it. The cameo of the director at the end is the cherry on the cake. The story grows organically while giving the necessary credence to the character development and doesn't include the usual commercial elements of contemporary movies that prop up the unrealistic plot lines. The movie is well directed. The background score is superb and it will be crime if the crew behind this movie do not churn out more of these gems."}, {"id": 22, "text": "A beautifully made film. Simple story, beautiful moments, brilliant cinematography. Good writing, fresh performances and extremely well directed."}, {"id": 23, "text": "Beautiful movie recollected my school and college days, a typical middle-class family thing with a beautiful story."}, {"id": 24, "text": "Amazing amazing amazing....such a beautiful movie. Hats off to the director. Superb storyline."}, {"id": 25, "text": "It is entertaining and a good movie very watchable"}, {"id": 26, "text": "All the reviews says that the movie is too good, light and comedy but that's straight opposite to the movie.It's one time watchable but certainly don't believe the reviews."}, {"id": 27, "text": "With Guntur as its heart, the story travels along several layers of relationships and the social and religious belief systems. The screenplay is structured in such a way that there are flavours of emotion on screen from one scene to another, from one character to another. It was as if witnessing Dileesh Pothan's freshness splattered on Telugu cinema!Overall, Middle Class Melodies clearly states that the Telugu Cinema and her audience has changed by a huge magnitude, which is exciting indeed! Funny that both the brothers (Anand and Vijay Deverakonda) chose a food-oriented script as their second film as (one of the) lead actor (remember #PelliChoopulu!)Full Review - naveensankaran.home.blog/2020/11/21/middle-class-melodies-heart-warming-piece-of-work/"}, {"id": 28, "text": "Direction and screenplay is just amazing. I haven't seen such a movie in last couple of years. Dialogues are so natural and humorous. You don't think the actors were new. Everyone took part so well. I watched this movie twice. I haven't waterbed any movie twice in last 10 years including bahubali BS. I wasted 120 USD on bahubali to watch with family. I owe so much to this movie."}, {"id": 29, "text": "Even though we see all those situations in our day to day life we wil get connected to the fact in the film and we wil enjoy the content kudos to all the team out there best family entertainer no vulgarity nothing."}, {"id": 30, "text": "Super, brilliant, fantastic- terms which felt shouldnot be used...rather to say a beautiful heart touching one...Kudos to the writing department and direction...Also story not only focused on main protagonist, some other handful characters were too cool...excited to this kind of stuff in telugu cinema"}, {"id": 31, "text": "Fun and entertaining it is.. the punchlines are too good.. love the father son duo. Varsha Bollamma has done good acting too.. movie worth watching with your entire family"}, {"id": 32, "text": "Excellent movie. It brought my childhood memories with food in guntur"}, {"id": 33, "text": "The best movie to watch. Good acting ,nice story,good screenplay."}, {"id": 34, "text": "Just watch the movie! I am sure you would like it.. A simple story but very natural! It like happening in our presence..! Just watch you may like it..!"}, {"id": 35, "text": "Watched this movie without giving any 2nd thought and turns out to be worth watching with your near and dear ones'. This movie is very organic void of all logic defying sequences. And all the actors justified their roles with utmost ease."}, {"id": 36, "text": "Simple review from me is good timepass movie relating to youth of village.....hero role played by Anand Devarakonda is not hero material....with another good acting hero would have made the movie super hit"}, {"id": 37, "text": "Fully connected to this movie. Good watch. Very nice movie after a long time. So touched."}, {"id": 38, "text": "Story narration is beautiful. Everyone is performed well. Some scenes well predictable. No build ups. No kuthu song. Nowdays Telugu cinemas cleverly take another path which is something people wanted. Songs in between scenes superb..."}, {"id": 39, "text": "It's better than akasam ni haddu ra.. because there is a fake screenplay.. but in this movie we felt very real incidents... everyone played their roles very well..no over action like akasam ni haddu ra"}, {"id": 40, "text": "Nice movie perfectly shown middle class melodies. Especially father character is nice."}, {"id": 41, "text": "Anand played his role very well and looks like guy next door... and heroine didn't suit for her role.. especially her slang is not relatable to the girls we see everyday... and overall good content and Worth watching"}, {"id": 42, "text": "A perfect resemblance of middle class family. Thank you for the film. Thoroughly enjoyed with my family."}, {"id": 43, "text": "It's a simple honest very realistic presentation of Telugu movie. Not too much of cinematic nonsense and very refreshing. If you are not trying to find the bees knees, it is a just a good one. Go for it and you will live with it in at least one the scenes."}, {"id": 44, "text": "Very good movie, simple fun story , great direction"}, {"id": 45, "text": "Surprised to see high ratings though. To me, this movie is just had an ordinary Indian story - Nothing unique - Nothing great, just showing a regular Indian life. Anyways, 4 stars for decent acting and humour."}, {"id": 46, "text": "Beautiful writing!! Direction, cinematography, editing and music are good! All the actors nailed the characters..parents of the lead pair, friends and paalu poseti thatha belonged to us..though anand needs to improve on his expressions and dubbing."}, {"id": 47, "text": "There is nothing interesting about the story , no one knows the conflict, few sequences and some scenes are good, All actors did great except Anand Devarakonda, Goparaju Ramana did exceptionally well as Anand's father. Varsha Bollamma is a performer. Locations are very good, Editing is good, cinematography is ok. Music is a minus."}, {"id": 48, "text": "The climax in the movie was super while I watching I can't control laugh"}, {"id": 49, "text": "Simple story with native touch. You can watch on a lazy weekend and wouldn't regret it."}, {"id": 50, "text": "You will love everything about this movie. Very good direction and TopNotch performance from lead actors and feel good songs."}, {"id": 51, "text": "Good movie with nice humor and mixed emotions. Felt very natural and involved throughout the movie. A great watch!"}, {"id": 52, "text": "It has a nice story of middle class family also has a good moral"}, {"id": 53, "text": "Really love the content which is close to evryones Life stry .. struggle love Comedy tragedy everything new narration not routine stry ... Father character highlight... Hero did lot matured performance director vision nd cinematography evrything including music terrifc .."}, {"id": 54, "text": "A movie close to the everyday real life situations and scenarios we see and hear in a typical Telugu or any other Middle Class Family. I personally believe that every artist in the movie has given their best to potray their respective role. Story starts with certain level of humour and carries it till the end."}, {"id": 55, "text": "Good movie with classic story and Anand deverakonda's highlight movie in his two movies It's a super hit movie"}, {"id": 56, "text": "Middle Class Melodies, directed by Vinod Ananthoju, and starring Anand Deverakonda and Varsha Bollamma, is a film you want to quickly watch again the moment you finish watching it. This is not because the plot or its storyline is something we've not seen before - a lot of the comfort one gets from watching this comedy is from the familiarity of it all.READ THE FULL ARTICLE ON FILM COMPANION"}, {"id": 57, "text": "The director directed movie very nice . The heroine is the main role who gave the movie the entire soul ."}, {"id": 58, "text": "Had a good time with family, laughed alot during the movie. 9.8 rating to Acting, Comedy and to a decent genuine story. Overall good story."}, {"id": 59, "text": "It's better! I mean better than recent roasted movies.A middle class guy with an idea setting up a hotel in a town. did he success in pursuing his dream? is the remaining part of the film. that's it! Simple. But, Scenes are good for showing the middle class situations.The script is well written. But, coming to managing the script, director Vinod anantoju is didn't do it well.First half is good, even though second half is snail's slow, it's watchable."}, {"id": 60, "text": "The first this that has to be appreciated about this movie is the taking and quality of cinematography. The supporting characters have lifted the movie throughout with good performances. Overall it is a small story that takes its own time to get us into its world but gives a few good moments here and there to laugh at."}, {"id": 61, "text": "Super movie one time seen mvi love story was beautiful"}, {"id": 62, "text": "Very entertaining..... totally loved it anand acting is super n his father character is awesome entertainment packed mv must watch"}, {"id": 63, "text": "Iam sure that u will laugh through out the movie pakka 💯 percent such a nice ,wonderfull and magical comedy movie after a long time this movie is deserve to be release in theatres what an acting by everyone. Anand devarakonda not even less than his brother vijay and heroine acting is superb and the secens between hero and his father were awesome and fully comedy movie good direction good screenplay....."}, {"id": 64, "text": "Let me start off by saying that this is one of the best movies in Telugu(or maybe all languages) that I have watched this year. The movie stays rooted throughout and completes the character arcs well.It brought back memories from my days in Vijayawada, especially the Guntur slang which is not artificial or forced but fits in perfectly and organically. The slang and mannerisms are on point for almost everyone except Anand, who kind of struggles in getting the accent right.In terms of performances, the lead actors Anand and Varsha have done decently well and for his second film, Anand does a great job in picking such a film and staying as much as possible in a realistic character. The artists in the roles of Anand's father Kondalrao and friend Gopal along with Gautami have also managed to steal the show. The comedy was also well knit into the story and had me in splits at multiple places.Overall, it was satisfying to watch a movie that is breathe of fresh air among the star-studded disappointments from Tollywood that have strong elevations of the hero but weak, predictable and repetitive stories. Adding to movies like Pelli Choopulu, ENE and Agent Sai Srinivasa Atreya, this gem of a movie joins the list."}, {"id": 65, "text": "Kudos to the director for being so authentic to the characters and the nativity of the world around which the story revolves. Except the hero everyone where pretty good their performances. However, heros performance in this movie waa far more better than in dorasani, he has improved himself but still the uncomfort of lack of screen presence sustained from dorasani, he still get the nack of pulling audience to his emotions. Its actually a emotional story and it required a pretty good actor to whom the audience must travel with but he doesnt seem to grab such attention from the viewers infact hero friend, heros father and divya(cell phone shop girl) had succeeded with the same. Especially the father, he just eats up the screen whenever he is in the frame thats what an actor brings to the table for a pretty good story. Music was soothing. Coming to the direction, director has done a very good job. The story, screenplay and direction were so good that you will not get distracted much from the story. Last 20minutes reminded me of the nature of malyalam films where the story changes completely due to some kind of butterfly effect. Varshas character seems to be extrovert in the movie because usually introverts loves to chat with a person rather than speaking to them directly but she does that vice versa. Overall a pretty good one. Lucky fellow sai devarakonda... Banking some good stories under his account."}, {"id": 66, "text": "One of the very good movies I have watched in the recent times. I have watched quite a few famous old classics of world cinema during the last few months and to me this movie proudly stands as one among the best. Any good movie should primarily be capable of capturing the hearts and attention of the audience, stirring the emotions in the process. Any delicacy, if it does not leave a sense of satisfaction after you have finished, is of no good, even if it is made of the finest ingredients and served in the best possible setting. This movie leaves you satisfied. Mind you all the actors are new and the director Vinod Ananthoju is doing his first film. He deserves rich praise for his directional talent. The storyline, cinematography, music, songs, dialogues are all excellent to say the least. With no costly settings or even make up, what the film has achieved is simply superb. Anand Devarakonda has given out a mind boggling performance. I believe he has brought out his heart in the character. Varsha Bollamma, Chaitanya Garikipati, Divya Sripada, Goparaju Ramana, Prem Sagar gave their best performances. I hope and wish that Tollywood should draw inspiration from this film and spend more time on producing good quality films."}, {"id": 67, "text": "FILM: Middle Class Melodies (Telugu language; Watched it on AmazonPrimeVideo platform)Contains: Hotel business, love story and middle class melodiesCan I watch🤔 : Just go for it...been ages since I loved watching a film again and againDirection : Director vinod ananthoju narrates it so well that you will fall in love with the film. A director I would look forward to after Sukumar and Gowtham Thinnanuri. The set, actors, dialogues, situations, story and screenplay are absolutely simple and natural. Just loved every frame of the film. Hopefully the film gets many Nandis.Performances😎: Anand Deverakonda has given his best. He justified his role to the core. Varsha Bollamma was fantastic. Loved the recharge shop scene where she gets frustrated. Goparaju Ramana steals the show. He as a father justified his role to the core. Surabhi Prabhavati as Lakshmi was very good. Prem Sagar as Nageswara Rao, the greedy father was excellent in his role. Chaitanya Garikapati and DivyaSripada were amazing. All other cast members delivered fine performances.#Script📖: Good #Screenplay✒: Good #Editing✂: Good #Length of film ⏰: Good #Cinematography 🎥: Excellent by Sunny Kurapati #Music🎵: Good by Sweekar Agasthi #Lyrics📝: Good #BackgroundScore🎶: Good by R H Vikram #Choreography💃: None #Action or #Fights✊: None#Positives😚: Excellent script, screenplay, performances, music and direction #Negatives😨: Weird but didn't find any negatives#MiddleClassMelodies #MiddleClassMelodiesReviewNo rating.. no revealing of plot... only opinion 😊 Film Reviews by Sri"}], "reviews_amount": 68}