{"name": "Unpaused", "titleId": "tt13491620", "reviews": [{"id": 0, "text": "It's collection of five stories revolving around the current lockdown (in India).My favorites in order. Chand Mubarak &gt; vishaanu &gt; glitch &gt; The Apartment &gt; RAT-A-TAT.A light encounter which is also praiseworthy. Give it a try, you wont be disappointed."}, {"id": 1, "text": "It's a collection of short, unrelated stories, told in the backdrop of Covid pandemic and its effects. The effect is sometimes on relationships, old and new, and sometimes at a socioeconomic point of view, and in others it is just a backdrop.Opinions may vary, and but as my title suggests, you'll like it if you like short stories, about characters that make you think after the story has ended."}, {"id": 2, "text": "I could totally relate with the last 3 stories. Seen it happening with my close ones. Phenomenal acting by everyone. Definitely needs a sequel."}, {"id": 3, "text": "Each story spoke in a different pitch and most importantly each story had it's heart at the right place. My fav are The Glitch by Raj n Dk, Vishanu by Avinash Arun And Chand Mubaarak what a beautiful short film by Nitya Mehra she is ambitious since Baar Baar Dekho and this movie was really towards positive vibe and hope for better. Hats off to all the actors, specially Richa Chaddha in Nikhil Advani's the Apartment , loved Gulshan Devaiah's killer expressions...Watch it you may find yourself in it or you'll learn something"}, {"id": 4, "text": "I don't say lie to anyone, I personally and my whole family loved it"}, {"id": 5, "text": "Very well Knitted stories. Only the first out of five stories is beyond imagination and somewhat boring otherwise its a good collection of five different stories based on Lockdown and Covid-19 experiences. I enjoyed it due to its heart touching, simple and realistic type stories."}, {"id": 6, "text": "Great movie. A must watch. A great way of depicting life during these covid times."}, {"id": 7, "text": "This movie has heart. You will happy after watching this movie."}, {"id": 8, "text": "The stories of this series is fully real. These stories can connect to our heart. I Recommend all of you watch this series. In pandemic situation it can refresh your mind....."}, {"id": 9, "text": "Shardul bharadwaj. Bhai sahabbbb!!! didn't know your name, waited for all the titles to go through till I got your name. You have acted so controlled so much what was required, I hope to see you lots. Ratnajiii is always amazing. And the story was something we all needed peace."}, {"id": 10, "text": "If you are looking for an ensemble of slice-of-life stories that are quirky, funny and close to reality, Unpaused will surely be your cup of tea. Filmed during the ongoing continuum of the pandemic, the anthology features five different segments by Raj &amp; DK, Nikkhil Advani, Tannishtha Chatterjee, Avinash Arun, and Nitya Mehra."}, {"id": 11, "text": "I love watching it for sign Language in Glitch (part of the movie. It is surprising for us!"}, {"id": 12, "text": "Best anthology made in India. I think the catch line should be you can't pause while watching unpaused. All the stories are relatable including the first sci-fi one. Also very well made and acted. The best part is the positive vibe It ends with. A must watch."}, {"id": 13, "text": "It's an extremely enjoyable watch, with 5 very varied stories. Each story has meaning, can be tied to reality, and has moments that are very funny. Every director brought their A-game. Highly recommended."}, {"id": 14, "text": "Except Glitch first short story rest are avoidable. Basically all leftist directors of bollywood came together to make a movie about lockdown and covid and on name of positivity they tried to make sarcastic fun of curfew, thali bajao, showing roza importance, etc. Overall forcing thr leftist twitter propaganda in movie scenario."}, {"id": 15, "text": "A well maintained pace of the stories take you on an unpaused simulation till the end you whish for some more. Amazing small stories of different people which connected to the same situation. Well balanced humanity and the nature of different people. All actors have done their jobs well and natural. A must watch for all film lovers."}, {"id": 16, "text": "Showed effects of lockdown on people's life. Watch it."}, {"id": 17, "text": "Film anthologies on streaming platforms seem to be the flavor of the month. After Paava Kadhaigal in Tamil on Netflix, Putham Pudhu Kaalai, also Tamil on Amazon, comes Unpaused on Amazon - five shorts in Hindi, each one, shot post Covid-19 and dealing with the havoc the virus wrecked on us. The format suits the crisis. The pandemic has upended life so completely that it would be impossible for one narrative to capture the enormity of the tragedy and the change. So five directors - Raj and DK, Nikkhil Advani, Nitya Mehra, Tannishta Chatterjee and Avinash Arun Dhaware - attempt a first response to a moment in history.READ THE FULL ARTICLE ON FILM COMPANION"}, {"id": 18, "text": "Its the combination of stories related to the experiences in lockdown and their moralsthese type of stories were made before also but i think this is the better one as it has big starssome stories are too emotional and are hard to acceptabove all its just timpass"}, {"id": 19, "text": "All the stories touch your heart and reminds us of beautiful moments of life.!! Must watch even if it's slow pacedKudos to the makers.."}, {"id": 20, "text": "The stories are just ok. But some characters have great acting in this movie."}, {"id": 21, "text": "It's something we needed. A ray of hope, a warmth in relations. Some better than the other, yet all stories will make you smile, make you think. Do watch."}, {"id": 22, "text": "They are the real stories behind a real mind and a beautiful way to describe the realistic view......."}, {"id": 23, "text": "Excellent showcasing challenges of common man and how people are still out there to extend their gratitude."}, {"id": 24, "text": "Interest dips after few minutes. Director fails to tell the content in interesting way."}, {"id": 25, "text": "Very boring Don't go by paid promotion Very boring movie"}, {"id": 26, "text": "So boring and depressing. I had to stop watching after 30 mins."}, {"id": 27, "text": "When you invest 1.53 hour in something, you want to see some good work. This movie doesn't look good.In 2nd story. she is using some adultery word. Really?, It's all overacting."}, {"id": 28, "text": "Lost interest after few minutes. Kept waiting for the plot to be better but doesn't happen."}, {"id": 29, "text": "This series is ok and only time pass Covid is some boring"}, {"id": 30, "text": "Just same as title. Nothing else. Stories seems to be ok but then again quite unrealistic biased has added with each story."}, {"id": 31, "text": "Unpaused is an anthology film consisting five different segments of different stories. The first one, Glitch, set in the future where the world has transformed owing to Covid-19 and its variations like Covid-22/Covid-30 (referring to the year of the new virus' inception). It tries to imagine what the world could be like if this dreaded virus stays with us for a long time. It primarily focuses on two young adults trying to kindle their relationship in this new AR/VR world. Ahan (Gulshan Devaiah) is paranoid &amp; fearful or hypo (possibly meaning hypochondriac) as people like him are referred to. On the contrary Alizah (Saiyami Kher) is a brave and bold women. Initially puzzled by how they were matched by the dating app dislike each other, but with time a love story follows. Unlike the old times, religion/family/society type of issues are not hindrances that stop the romantic 'happy ending' for the couple, but new type of challenges that ensue with evolution of a technology &amp; Covid driven world. The second segment is The Apartment in which Devika (Richa Chadda), who runs a successful magazine, finds herself being lonely in the current locked down world, and is depressed with issues that have come in her personal life due to her husband Sahil (Sumeet Vyas). Devika ready to give up, is continuously troubled by Chirag (Ishwak Singh) her new neighbour from downstairs, or so she was told. The following segment, Rat-a-tat showcases a grumpy widowed retired singer Archana (Lillete Dubey), who is not liked by many, and Priyanka (Rinku Rajguru) a production assistant struggling in these Covid times. It shows how the two women befriend &amp; help each other out, in an emotional yet entertaining manner. Vishanu, the fourth segment, portrays the hardships &amp; the brutal truths faced by the not so fortunate section of a society in a developing nation like India. Manish (Abhishek Banerjee) a daily worker, with his family is finding it hard to survive with rare work opportunities and no place to live. He finds a short term fix for his sheltering his family, but with meagre savings to live on wishes to return back to his village, but faces the million dollar question as many people did, how? The concluding segment Chand Mubarak follows the story of an old spinster Uma's (Ratna Pathak Shah) unconventional bond with auto rickshaw driver Rafique (Shardul Bharadwaj), after she befriends him on a spontaneous trip to the medical store late one night, in the abnormally quiet streets of Mumbai. The distinctive stories are amazingly well thought of and brilliantly portrayed by the individual directors. What makes it an emotional and heart-warming watch, is the precision with which the brutal and almost accurate realities faced by the people in these hard times. The pace of all stories is excruciatingly slow, which most certainly works in the favour of the film. All actors are casted fittingly and act out their individual parts in an entreating fashion. With very few successful or even very few anthology movies created in India, this is a very bold &amp; unique step, rightly taken by Amazon Prime Video. The movie has a bigger than usual soundtrack, one would expect from a movie consisting five different stories. Songs may not have been need in some of the scenes, where the soundtrack has been fit into. The order of the segments could have been arranged in a better way, seeing as to the first one is set in the future and the ones preceding it are set in the current period. Omission of this segment altogether could also have worked as it felt too distant with the other four stories. In conclusion, even with its idiosyncrasies the movie is a spectacular watch. It is relatable to the totally of the population, as each &amp; everyone went through that torrid period. By the end of the film one feels a sense of pride and gratitude, reminiscing how we all got through that period. It is a must-watch for everyone. Acting- 9 Casting- 9.5 Cinematography- 8.5 Dialogue- 7 Directing- 9 Editing &amp; Effects- 8 Sound &amp; Music- 7.5 Story- 8.5 Storytelling- 10 Rating- 9.5"}, {"id": 32, "text": "As all of us begin to look at ways to negotiate life in the uncertain lane, the pinprick of anxiety grapples with the jab of hope. And yet, there's a cloud that hovers, breaking that pinhole of agitated particles struggling to reach our lives and light it up. Amidst this dystopian hide-and-seek comes Amazon Prime with its-latest-in-its-anthology quiver, the five-storied Unpaused. The timing of its streaming, coming as it does on the cusp of year-end holidays, couldn't have been better. And yet, what does this holiday period-for those of us lucky enough to avail of it-mean? Is it just another milestone we pass, mostly low and grumpy, much like we did earlier during Valentine's Day?In writer Reshu Nath and director duo Krishna D.K. and Raj Nidimoru's opening act, The Glitch, a look into a world that's whizzed past multiple Covid iterations, the lover's Cupid day has been binned by the government, and all that exists now is a tasteless, odorless, augmented dating system. Taking sly digs at all that's troubling about the political dispensation, Raj-D.K. get a cracker opening with Ahan (Gulshan Devaiah) meeting Alisha (Saiyyami Kher) in a bar. The bar signage is typical Raj-D.K. humor, as is the blind date tête-à-tête that ends rather abruptly. Devaiah, who turned self-deprecation into fine art with the riotous series Afsos, sparkles with the same self-doubt that Amol Palekar did in his middle-class, fidgety outings in the 70s. He's the highlight here, even as Kher brings in a vulnerability that's twinned by a largely unseen grit. Even if the energy flags a bit, the directors score when they show what it is to be a new-gen, trauma-induced hypochondriac. Falling in love in the best of times isn't a cakewalk. But when you're a hypo serenading your love warrior with sign language, talking to your AI-powered bot can feel like a hug and online certifications a blanket of inane warmth. If there's anything that can truly overcome biting loneliness, it's face-to-face interaction.That initial thread of despondency streaks into the next segment (The Apartment) that's also the weakest amongst all. This, despite a magnificent performance by Richa Chadda, playing an upper class, wronged wife and firebrand media entrepreneur. And that's because with writer Sanyuktha Chawla Shaikh director Nikkhil Advani seems to force the pandemic canvas-and their undisguised disdain for the Indian Prime Minister's call to honor the people at the forefront of the pandemic by banging plates and clapping-on to a fractured marriage. That fracture, in turn, makes Chadda's character of dought into one wracked by self-doubt, leading her to tie the knot. Across her neck, from a fan. Raging at her husband's blazing indiscretions (Sumeet Vyas plays the hubby), she drowns herself in some good-looking whiskey and ciggies and then decides to tie the aforesaid knot. Until a knock on the door by a pestilent lower floor neighbor (Ishwak Singh, likable, but also handed a character that looks more smug than concerned) and forced conversations lead to an astounding moment of self-discovery and strength for her. If it all sounds trite, it's because it is.Fortunately, Devika Bhagat's story, Rat-A-Tat, directed by Tannishta Chaterjee, is more natural, looking at the fractured lens of isolation that most of us are destined for, one way and some time or the other. That such solo life tracks are usually self-inflicted is what Archana (Lillette Dubey) and Priyanka (Rinku Rajguru) discover in an old-Bombay-styled apartment that's got some stunning nursery designs and greenery. As the young and not-so-young ladies cohabit, they unpack their personal baggage to reveal a mutual trauma of experiencing loss-losing out what you love doing and losing the one you love. Both the actors lend an air of casual mist to their acts, making this simplistic story stick, albeit a bit shakily.Vishaanu (Virus) is perhaps the most troubling of them all. It's also the most paradoxical in its irony. Looking at the devastation the pandemic and the sudden lockdown wreaked on migrant labor across India, the story ushers you into a crippling economic anachronism that the majority of the country lives in and lives out. Construction worker and painter Manish (a terrific Abhishek Banerjee) wants to return to his town Bhagwada in the state of Rajasthan with his wife Seema (Geetika Vidhya Olhan) and son Monu (Pallas Prajapati) and has to shell out big money for the operation. With nowhere to go in the meantime, the family's hush-hush holed up in the model (or sample) apartment in the building under construction where Manish was working before the lockdown. (Watch out for a superb cameo by Hemant Kher, last seen in the terrific Scam 1992: The Harshad Mehta Story.) It is this irony-workers creating plush living places that they can never be part of-that plays out to stunning effect, especially when Seema lives out a spa fantasy in the apartment. A brief, suspended animation of reality before it all goes down the drain. Olhan is in stunning form, gripping you by the collar in every frame she's in. And the darkest irony that writer Shubham and director Avinash Arun Dhaware roll your way? There may not be enough currency in worn-out wallets, but there's more than enough data tangoing around on cell phones.But the best in Unpaused is reserved for the last. Director Nitya Mehra, writing with Vidur Nauriyal and Tarun Dudeja, rides out a predictable yet warm story of middle-aged, well to do loner Uma (Ratna Pathak Shah) who eats canned food for sustenance and consumes cable TV for company, and suffers from a stiff upper lip (that requires no medication) and a stiff upper neck (that does). That she finally loosens up a bit from the clutches of both malaises is thanks to autorickshaw driver Rafique (Shardul Bharadwaj) whose vehicle she lands up in thanks to the lockdown and a conscientious Mumbai cop (Satish Naikodi). As Uma begins to rely on Rafique for errands-a beautiful, symbiotic, and organic relationship that forms the crux of transport relief for so many in Maximum City-the veil of class begins to slip away. Rafique's given to banter and doling out unsolicited-but well-meaning-advice, Uma's façade is stony silences and spondylosis-triggered grimaces, and they slowly get around to sharing their pain and celebrations. Both actors are terrific-Ratna Pathak Shah makes you go Ouch every time the rickshaw rattles and shakes, while her frozen countenance hides solidified emotional pain. Bharadwaj is tops, his performance heart-warming, natural, and melting defenses. If Chand Mubarak (Have a Blessed Night of the New Moon) doesn't make you misty-eyed and hug yourself, I don't know what will this year.Unpaused, then, is a mixed bag of stories with a similar effect in the way they play out. It's uneven, but it works. Much like our lives at all times, but more so now, it soars in parts, crashes in others, and yet is connected by a worn-out string of heartbreaking loneliness.Read all my reviews at lifeisacinemahalldotcom"}, {"id": 33, "text": "Unpaused is an anthology of five short stories, underpinning the everlasting nature of deep human bonding, scoring a victory over the pandemic caused by an unrelenting, maleficent virus out to ravage life. With a running time of 114 minutes, it gives us a delectable variety of essays, nature of relationships, the spirit of fightback and even a potential ray of hope in these times of hardships.Glitch directed by Raj &amp; DK is futuristic and perhaps even somewhat morbid. Set in 2030, it delves with the lives of a warrior Ayesha (frontline worker), almost an outcast because of her profession, and a hypo, a nervous, edgy, overcautious and hyperactive Ahan. It's a little difficult to relate to at this stage, but not altogether impossible the way things are shaping up.Apartment is directed by Nikkhil Advani and showcases the complex situation of a top notch magazine owner, whose successful and celebrity husband has been accused of multiple counts of sexual molestation by her own junior staff members, and she finds her life at a crossroads. She tries committing suicide twice and on both occasions her action is strangely aborted by the interruption caused by a young man who claims that he lives in the apartment below and is troubled by water leaking from her balcony.Rat-a-Tat, directed by Tannishtha Chatterjee is the story of bonding between two unlikely individuals, a grumpy senior citizen Archana, and an effervescent twenty-something Priyanka, hailing from different cultures, but living in the same complex. It's delightful and heartwarming to see how the two women cozy up to each other amid fears of infection and lockdown.Comparatively, Vishaanu directed by Avinash Arun was meant to capture the plight of the migrant and homeless workers during the lockdown, but despite fantastic performances by Abhishek Banerjee and Geetika Ohilya didn't create the impression it was intended to.I guess one leaves the best for the last, and didn't Chaand Mubarak directed by Nitya Mehra take the honours in style. Ratna Parhak Shah plays Uma, a hardened, edgy and tough spinster living alone by choice and Shardul Bharadwaj plays Rafiq, a migrant auto rickshaw driver. The essay narrates how the two form a bond over a few encounters that underscores unconditional affection and familiarity, and signifies the victory of the human spirit.Don't miss Unpaused, it has a few sterling performances and will leave you with a warm and happy feeling."}, {"id": 34, "text": "Unpaused is a wonderful collection of five beautifully crafted short movies that underlines the struggles, confusion, fear, helplessness, anger, loneliness, distress, vulnerability and cowardice that struck our lives once the COVID-19 induced lockdown was announced. the anthology, knitted by a slew of terrific performances, is a pertinent commentary on a pandemic and its depredations.Cinematography is excellent in all segments, with near perfect production production colouring that is among the best in 2020 Indian cinema. Editing is crisp and neat, making sure none of the five segments drag unnecessarily even one bit. Production design, costumes and makeup were very decent in all segments. Directors Nikkhil Advani, Avinash Arun, Tannishtha Chatterjee, Krishna D.K, Nitya Mehra, Raj Nidimoru have really put in a great effort to ensure good quality returns in their respective segments. Music was subtle and calm throughout the segments depicting the tone of events unfolding within. Acting is generally very good overall, armed with some very good performances by a host of well seasoned actors. With Geetika Vidya Ohlyan performance in Vishaanu segment being the best of the lot. Overall, Unpaused is important because it serves to chronicle this slice of history, that we all took part into. It helps that it is also an enjoyable, insightful affair where we get a peek into the lives of others, during the pandemic, both rich and poor and see how they conquered their vulnerability. At a run time of 114 for five segments, Unpaused is a breeze that will remind us of our own fear &amp; helplessness during March &amp; April 2020. 7.7 stars out of 10 for the beautiful presentation of heart touching stories."}, {"id": 35, "text": "Films made during the ongoing pandemic (such as C U Soon, Putham Pudhu Kaalai, and more) came with their own set of challenges: to stay relevant and current while addressing viewers from a relatable emotional standpoint. Unpaused definitely won't be timeless but if someone in the future were to look back at the year 2020 and its nuances, a film such as this would be a worthwhile reference. Here's a collection of five stories (minus one) where the central character is the coronavirus. Let's break them down one by one.Glitch: Probably the wackiest and most innovative among the lot, Glitch talks about finding love during prolonged stretches of isolation. Set in the future, technology has improved and dating has gone virtual (thanks to AR &amp; VR), but a legit vaccine is yet to be found. Raj &amp; D.K give their leads (played by Saiyami Kher and Gulshan Devaiah) some thoughtful texture, and the story plays out in a funny-yet-relatable manner and ends with the quintessential 'aww' moment, without plunging into any sort of melodrama.The Apartment: Directed by Nikkhil Advani, this is the only segment which didn't require a pandemic setting - sexual harassments (in the corporate world), broken marriages, and suicidal tendencies have existed long before the virus outbreak. The depth in plot and characters is certainly lacking, but the performances keep it float. The narrative too is adequately paced and manages to keep viewers engaged throughout, ending on a solid note.Rat-A-Tat: Tannishtha Chatterjee helms this one, where neighbouring ladies (from two distinct generations) get off on the wrong foot, eventually warming up to each other. Reminding me of the inter-generational warmth spread in few of Putham Pudhu Kaalai's stories, the segment also dives deeper into the notion of women being alone by choice - something that's relatively less explored in Indian cinema. Rinku Rajguru and Lilette Dubey play their parts well enough.Vishaanu: Cinematographer Avinash Arun Dhaware (known best for Pataal Lok) tells the story of an immigrant labourer's family and their struggles (to get home) and the little joys they indulge in. The immigrant family is now holed up in a sample, unoccupied flat, exploring the luxuries of the rich while wondering how they can relocate back to their village. Conceived and performed in convincing fashion (by Abhishek Banerjee &amp; Geetika Vidya Ohlyan), I found this episode to be the anthology's standout piece.Chaand Mubarak: A well-off but lone (and ageing) woman strikes a bond with a rickshaw driver during their trips to the supermarkets and medical stores. As expected, the segment begins with a sense of class bias (and dissent between strangers), but the two get to know each other better over their differing interests and backgrounds. The result is a positive evolution for both with the burgeoning realization that living independently or having your family living elsewhere can mean different things to different people. While the plot may seem a tad unrealistic, the performances are earnest.Overall, Unpaused is worth a watch even if it may not stand the test of time. The pandemic has left its mark on cinema, and Unpaused could well be one of its not-bad outcomes."}, {"id": 36, "text": "In its five-part anthology, Unposed mixes all the news from lockdown-related topics of isolation, loneliness, resilience, which have made headlines with average results in this terrible virus-ridden year. Each story is complementary to the other, and the way they are laid out is simple.The film starts at a high point with glitches and ends better with Chand Mubarak. I liked the last two the most.Coming into Gulshan Devaiah's film is his routine, picks yet another character and plays it so well that we can't even imagine touching anyone else. Ishwaq Singh's performance is a bonus.Lilette Dubey never manages to spark happiness again with her appearance as a charmer. Full points for Rinku Rajguru to stand out not only among Lillet's aura but also for her tremendous talent. Abhishek Banerjee has always been an underrated gem for me in many films.Ratna Pathak Shah plays the lone Maya Sarabhai in the film. My greatest path among this talented group of people is to become Shardul Bhardwaj. Acting opposite Ratna Pathak Shah is difficult and hopefully, you will notice. Shardul makes the most of the limited he gets.Raj and DK take a modern route to tell their version of the story and love a lot about their world. Nikhil Advani is deep and basic to his story.Tannishtha Chatterjee's Rat-A-Tat is dialogue-heavy, and its writing really helps keep the intrigue alive. Avinash Arun Bong is a small sub-plot from Bong-Jun-Ho's 'Parasite'. Nitya Mehra lets her characters do major lift-ups while keeping everything original. The background score is equally good in every story.Beautifully lost with unprecedented performance, the anthology deserves more as a whole package."}, {"id": 37, "text": "Unpaused Anthology FilmThis is an anthology film consisting of 5 diffrent short films revolving around the message of Hope based on the scenario of Covid The star cast it self of this Anthology film is a treat to watch which consists of Gulshan Deviah,Sayami Kher, Abhisekh Banerjee ,Richa Chadha,Sumeet Vyaas,Ratna Pathak and many more Well the music department of all the short films are good I personally liked all the songs too much Coming to story and Direction here is a zig zag graph few are good and well executed and some are just average Well i will end this review with the list of the films i liked the most to which i didn't find that great But its to be said that over all its a good one time watch you will not be disappointed infact you will find it realtable to the new daily life and heart warming as the message revolves around not loosing hope in this tough times Well thats it As said here is my priority order 1.Glitch 2.Vishanoo 3.Chaand Mubarak 4.The Apartment 5.Rat-A-Tat"}], "reviews_amount": 38}