{"name": "Welcome Home", "titleId": "tt13381376", "reviews": [{"id": 0, "text": "Pretty good. Somewhat reminded me of Tobe Hooper's 1978 horror classic THE TEXAS CHAINSAW MASSACRE but little less gritty or raw and without any chainsaw or machete wielding maniacs. Liked the way they didn't try to right away rip off TCM, instead built a disturbing, yet relatable, well executed horror film that includes contexts like patriarchy, child abuse &amp; dysfunctional family dynamics with Indian settings &amp; characters."}, {"id": 1, "text": "The most disturbing movie of 2020. Cannot imagine such a briliant movie performance to screenplay everything seems to be perfect.hatsoff to Sony LIV. After scam 1992 this movie is a very good one"}, {"id": 2, "text": "If you don't know the real story. Then this movie is our of box for you... Based on real story. This movie contains lot of suspense... In the beginning I thought you'd movie is horror movie but it is not. Just wanna say must watch and learn something."}, {"id": 3, "text": "Why will anybody go back to a place that has evil vibes without any preparation? Illogical script. This illogical-ity crops every now and then. Watched movie in fast forward mode. Realised that it was too brutal and left a bad taste in my mouth."}, {"id": 4, "text": "Really scary and disturbing , movie has many plots where your heart stops for moment, In Indian movie you dont see this quite often , remarkable acting by all the star cast , must watch for horror lovers , will give you goosebumps for sure"}, {"id": 5, "text": "Two ordinary females have taken the required census data but the next day they made plan re-visiting the dangerous looking far flung deserted house without any reason.............does not make any sense.... mostly reviews here planted...not worth watching at all....."}, {"id": 6, "text": "Welcome Home is such a smart yet scary idea. A well written script and story provides a horrific take on Sony liv. It is well acted by all the leads, and as a viewer you will be on the edge of your seat and feeling tension the whole time.But for 90 mins it's easy watching, with a decent plot line and a good baddie. I wouldn't say it's that predictable, its got some good twists towards the end and ends with an 'ooh didn't see that coming' moment."}, {"id": 7, "text": "Kudos to director for a brave attempt to showcase Dark side of society. Story is not so fresh we have seen similar concepts in Hollywood but what stands out in This social thriller is domestic violence against women &amp; child shown in gripping manner. The dialogues used to convey message/describe violence in protagonists lives seems bit forced/unnatural. More light on villains mentality could have made it much better film. Lets find Dead body scene in middle was stupidity 😢 Nevertheless its a nice attempt &amp; deserves applause."}, {"id": 8, "text": "How anyone so much irresponsible, no logic to script drag over and over. Crime Petrol better than this. Nothing impressive sometimes I feel I'm watching crime Petrol 2 hr episode LOL."}, {"id": 9, "text": "Worst story line . Waste of time . Bollywood will always be behind the lines creative quality thriller unlike South Indian industries"}, {"id": 10, "text": "What ? based on true events ? how these two dumb teachers can be so stupid.. movie is good but not real story"}, {"id": 11, "text": "What a masterpiece. Great acting by all of the actors."}, {"id": 12, "text": "Just watch it. It's bold and will keep you hooked until the very last minute. Not even a single dull moment. HOWEVER, it is very disturbing and graphic."}, {"id": 13, "text": "This movie is slasher &amp; psychological horror. This according to me is totally a fresh concept untouched by Bollywood. This movie in afraid to showcase the reality. The type of feminism and dirty patriarchal society shown in the movie is tremendous. This must be watched."}, {"id": 14, "text": "It's an utter waste movie. Don't waste your time. Good luck."}, {"id": 15, "text": "Don't waste your precious 2 hours. Dull screenplay. 1 liner story stretched too far."}, {"id": 16, "text": "Utterly senseless. I was trying to compare to tumbad but my bad this film is a waste. The storyline is so so flawed"}, {"id": 17, "text": "Great Attempt, based on true reality, acting is quite good and above all strong thriller from beginning to end will definitely let you love the film."}, {"id": 18, "text": "I am not believing that it is an Indian movie. Everything fantastic ,if you start watching you'll watch till the end, emotional, revenge drama."}, {"id": 19, "text": "Nothing to comment on story as it is from true case, but the way they focused on Tilak, Kalawa, geeta, krishna, gods in background I thought it might link with the killer, but as usual it is a agenda driven movie, all those things was unnecessary for story but director paid great details to link it to Hinduism, if real crime was actually linked with gods or religion than I am fine with this."}, {"id": 20, "text": "No masala, no reel life dialogues, just a reality. Because in real life, when someone in trouble, they fear, they shout, they think but no sit to make dialogues. This is a master piece where reality actually depicted how one can work in all odd conditions. There is no hero / Superman/ fully strengthen in real life n we need to work on our own strength. A thought with touching reality..."}, {"id": 21, "text": "I saw the teaser and i was like, not for everyone, really !! let's give it a shot and i would say it's a good thriller movie but as the warning says it's not for everyone well it's true but if you are a big movie buff like me you will saw it comin, !! The writing could have been little bit better, anyways it's a good thriller one time watch. A very decent try from sony liv in this genre."}, {"id": 22, "text": "This Paresh Rawal produced thriller directed by Pushkar Mahabal is the most disturbing film of recent times. The film features brilliant performances by the entire cast. You'll just hate the character of Boloram Das.This film is not at all for everyone, please don't watch it if you're faint - hearted. The most unfortunate thing is that the movie is inspired by true events. Once again Not For Everyone."}, {"id": 23, "text": "Welcome home movie makers are making fool of all audiences. Movie poster, movie teaser and disclaimer are mentioned the movie is horror but this is not. the movie content is very pathetic, horrible ok I agreed the movie thing is based on true story but why you make the movie of using this content. This movie is giving negative message totally negative content. The movie is showing bad impression for our society . If any kind of things in happen our society so we have media, news reports who discovered that kind of news to all audiences but you are showing this things or content as an entertainment this is so wrong."}, {"id": 24, "text": "Welcome home movie makers are making fool of all audiences. Movie poster, movie teaser and disclaimer are mentioned the movie is horror but this is not. the movie content is very pathetic, horrible ok I agreed the movie thing is based on true story but why you make the movie of using this content. This movie is giving negative message totally negative content. The movie is showing bad impression for our society . If any kind of things in happen our society so we have media, news reports who discovered that kind of news to all audiences but you are showing this things or content as an entertainment this is so wrong."}, {"id": 25, "text": "Good Screenplay and acting which thrilled you through out movie but movie failed as human Horror but Good One time Watch"}, {"id": 26, "text": "Watch only if you want to feel depressed ,alone, disheartened.😭"}, {"id": 27, "text": "What a movie ..... it's not a movie it's a masterpiece ....if you don't watch this please go and watch ...."}, {"id": 28, "text": "Tbh I've never seen a hindi movie like this. It's not for everyone, there's violence and scenes that some people might not feel comfortable with. But if u r okay with that kind of stuff then I think u should go ahead and watch this movie."}, {"id": 29, "text": "I'mspeechless after watching this thriller.Acting level is definitely next level and some goosebumps scene holy crap. I never watched like this before. Deducting one star only for slow track."}, {"id": 30, "text": "It's crazy how trash is getting increased everywhere after tiktok got banned. it was a dustbin for humanity but looks like director escaped that trashbin and thought they can litter internet by joining other platforms and pushing a mindless plot.waste of TIME. SKIP"}, {"id": 31, "text": "This movie is just out of this world , brilliant work by all of them , just I can say that this movie is most horrible movie of the India, faint hearted should never watch this movie"}, {"id": 32, "text": "Best movie each scene made me pray to god ....really Amazing scenes taken with best acting....this one can make any one feel scared"}, {"id": 33, "text": "One of the best Indian movie I have ever seen . Full of thrill .Based on True Story. And value of time ... MUST WATCH ..."}, {"id": 34, "text": "That both Neha and Anuja are rustic and refined - dressed in loose salwars with pleated dupattas covering their bosoms, oily hair pulled back in a tight ponytail and no make-up - has been established in their respective introductory scenes. Life in a staunch patriarchal household must have hardened them and turned these two young girls into docile individuals. We say this as that aspect of their personas surface when they bob without protest, sob under their breaths and take verbal thrashings from the male members of their respective families for wanting to hold on to their jobs or returning late from work. One day, the duo is sent to a long list of hamlets as census enumerators. On their way home, at a crucial junction, Neha reconfirms with Anuja if she still wants to go to that only house in a far-off village. The latter responds in positive. On reaching the somewhat deplorable building, the two exchange quick whispers about this family of four being 'very, very odd' and scoot. But a person's initial demons are hard to get over, and the bruises on childlike Prerna (Tina Bhatia) reopen old wounds. After much cajoling, Neha gives in to Anuja's demand: they are going back for a thorough inspection and rescue a heavily pregnant Prerna, who is also clearly combatting mental health issues. That family is sociopathy personified and the house, a house of terrors. Director Pushkar Mahabal's 'Welcome Home' has an air of eerie silence looming over his story (written by Ankita Narang), which is juxtaposed against the heinous and senseless crimes that are mercilessly carried out by the paanch saal ka maun vrat-ee patriarch Ghanshyam (Shashi Bhushan) with his kook of a cook, Bhola (Boloram Das). Ironically, Ghanshyam is a loyal devotee of the Almighty and is often seen engrossed in chanting deep prayers in the hallway while in a room adjacent to the temple are two innocent, helpless humans begging for their lives - such is the intensity of his narcissistic God complex.Mahabal has portrayed Bhola as the creepiest amongst all and embodies the spirit of a nymphomaniac - asking from time to time, yeh ladkiyan jhoot bolti hain, main jaun unke paas, bhaiya? Main jaun? Main jaun?... He is a sex-deprived and extremely deranged character; writer Narang has shown no leniency and gone to extreme lengths to develop this role and unleash the megalomaniac tendencies in him. Bholoram Das internalises the characteristic traits of a man you wouldn't want to be in the same room with for a split second. Shashi Bhushan works in tandem with Das and together, they give the viewers an insight into the twisted world of pseudo machismo and toxic masculinity."}, {"id": 35, "text": "Acting, writing, music was brilliant, but must stop making such kind of out of box violent movies"}, {"id": 36, "text": "Amazing and fabulous screenplay and direction with mind-blowing performances by everyone"}, {"id": 37, "text": "After a long time have seen a great thriller coming out of india..!! The depiction has been very realistic. The reality is brutal so is the movie. The screenplay, direction, cinematography and acting needs a special mention, that too with a movie of such minimalistic budget. Need more engaging thrillers like this which has a message at the end."}, {"id": 38, "text": "Story, acting, direction, background music all things are top notch. something's are predictable but you'll enjoy it. you should watch this if you're horror, thriller fan."}, {"id": 39, "text": "It is such a classic ...i dont remember when i last watched such a good thriller in indian cinema. It completely shatters you nd blows your mind. While watching i had goosebumps. Great one. OTT gives opportunity to these movies, really appreciate it. And the work by the actors are perfect."}, {"id": 40, "text": "Very less movie in India are able to show the things the way they are. Amazing movie, bit too gory for my taste but loved it completely."}, {"id": 41, "text": "Yes... Fat jayegi. What a fantastic masterpiece of a movie. It is the BEST horror/mystery movie ever made in india. Please must watch this movie. These type of films are very very rare in india. You'll forget the shining, the Conjuring and all of Hollywood movies after watching this movie. A true horror movie without any jump scare without any bhoot/ghost. Great acting great directing great background music. Everything is perfect."}, {"id": 42, "text": "Easily one of the most uncomfortable movie watching experience of my life......And that is exactly what one craves for in a dark thriller! The camerawork, screenplay and editing is top notch that eventually makes this a fine piece of cinema. There are no supernatural elements, monsters or jump scares in this one- just the story and its narration are enough to unsettle most. Though some viewers may find the gore and violence a bit disturbing. Overall, the performances are excellent (especially the antagonists- Old Mother, Ghanshyam and Bhola) but there are a few scenes where the two protagonists end up hamming while portraying pain and fear. The only other negative one found was the liberal and exaggerated use of the background score to incite fear- that could have been toned down and the film would have still been as scary as it was intended to. Once you watch it- be sure the story will stay with you for days. And watch it you must!"}, {"id": 43, "text": "Excellent movie, the whole plot of the movie was great it's very disturbing but must watch movie, there are scenes of violence which may not be to everyone's liking but it was required and the end is really satisfying. The actors have done a great job and you really feel their fear and the tension in the whole movie is really great, the excellent background music only adds to the whole atmosphere, overall a very good movie."}, {"id": 44, "text": "There are many films on sexual abusement But in this the reality revealed that most of the abuse are done by the known person to the victim! This is what they have shown where all actually not observed this! Story line up is 🔥 Totally a clean movie with 💯 of work! Everything is gud at their field. Thank you"}, {"id": 45, "text": "Movie is superbly made. Every minute is grippy and thrilling. Various moments throughout the movie are bone chilling. Very satisfying ending. Such great performances by all the actors. Truly amazed by karishma irani, Had never seen her in such a avtar. This movie is a must watch for everyone."}, {"id": 46, "text": "This is not horror, first of all. Secondly, I do not have words to explain the emotions I felt throughout the movie."}, {"id": 47, "text": "For me it was bit disturbing but I can't ignore that they tried excellently well and the message was strong."}, {"id": 48, "text": "What a movie.... six months ago I watched a movie get out and I'm always thinks why bollywood not making a film like this.... And today I saw this movie this is brilliant I know this movie have some issues in some areas but come on guys we have to support this kind of movie's so we can get more movie's like this... Peace"}, {"id": 49, "text": "Everytime i watch a horror movoe, i laugh loudly. because of the Ghosts. how they present ghosts the funny way, i think it's so funny! that's why i love to watch thriller type movie. but this one is so fearful &amp; very lovely way to scear. i loved this. 🖤🖤"}, {"id": 50, "text": "It is much better than any other movies in Indian horror / thriller movie"}, {"id": 51, "text": "I don't have words to describe this movie in few sentences.I almost lived every second of the movie, it is so grippy that it keeps you attached to the movie till the end.The amount of cruelty and trauma shown in the movie is just beyond imagination.I wonder how did they shoot this movie. Salute to those 2 women who survived this trauma and put an end to the crime.Casting and acting 5/5 Direction and location 5/5 Storyline 5/5 (It did sound illogical at few places so one star less - overall 9/10) A Must watch for everyone!!"}, {"id": 52, "text": "🎥Welcome Home 2020Superb Survival Thriller Movie👌 Great Performance From The Entire Cast👏"}, {"id": 53, "text": "This movie explaining our society. I love every character which playing roll.i wanna to say everyone please watch this movie. I promise in this movie you will never disappoint."}, {"id": 54, "text": "Those who like horror-thriller genre this is a must watch. Almost never before in Indian cinema experience. Each character has done amazing job. I don't know why some people are disappointed, maybe they were faint hearted."}, {"id": 55, "text": "Watch it for the dark unsettling theme with screen stealing performances, brilliant camera work and taut direction. The subtle undercurrent of misogyny, patriachy leaves a unpleasant hangover but a eye opener for abysmal child abuse statistics in India."}, {"id": 56, "text": "Never thought Bollywood could make this kind of movie."}, {"id": 57, "text": "Every minute of this movie is engaging, story is lined up in such a way that you can't even distract your self from the screen for a sec. Really afraid that this incident happened in real, felt very bad for all victims of this case. It think after Scam 1992 this is the 2nd best content of Sony liv and many more to come"}, {"id": 58, "text": "This is how movies should be in regards to horror! The story is good gripping and scary!"}, {"id": 59, "text": "When I remembered that this movie is inspired by true events, I was thinking from what conditions survivors or victims must have gone through. It's disturbing. Well, technically this movie is good. Nice direction, Some good pieces of cinematography and colour grading is also good. But one thing that made cinematography look brilliant is its background score. The omnious music made scenes look tense. Cast and performances were good overall, but Kashmira Irani and Boloram das stole the show. The film does not hesitate to show you every gory detail because of which you have been warned, this one is definitely not for everyone, especially the squeamish and sensitive!"}, {"id": 60, "text": "Wawo osm movie This movie is another masterpiece hy sonyliv"}, {"id": 61, "text": "It's a dark concept and shows harsh reality of the society. End is justified. Actors have done a magnificent job. Kudos to the entire team"}, {"id": 62, "text": "I had reached a point where I could declare that Hindi cinema doesn't know the meaning of horror and then came WELCOME HOME.. Spine chilling, nail biting, horror movie which won't let you sleep at night (atleast I didn't sleep the night i watched it).. Kudos to the writer, director, producer, actors and everyone associated with the film.. MUST WATCH..."}, {"id": 63, "text": "Never watched anything like it! On a next level compared to NH10..."}, {"id": 64, "text": "Great Movie, Great Thriller, Great Story line, Great Acting, Great Message, MUST MUST WATCH only on SONY LIV"}, {"id": 65, "text": "Loved the atmosphere of movie.it ingulfs you completely. Its Grippy and gory also. Totally justifying its tag line.highly recommended"}, {"id": 66, "text": "Brace yourself to see raw cinema, natural actors who will make you feel that you are living moment to moment with them. You will actually feel the tention going on &amp; will forget that it's a movie. This movie is definitely not for people 18 below &amp; not for adults who have weak heart. Some of the scenes are so raw &amp; real looking that you have to close your eyes as you can't see through ... Sadly what they have shown is based on a true story. We don't need ghosts to scare us as human is the most dangerous animal on this planet. Must watch for psy thriller lovers."}, {"id": 67, "text": "An unexpected great thriller! Must watch movie from sony liv."}, {"id": 68, "text": "Not for everyone ...well made thriller which will give u chills throughout...this type of films needs recognition in India"}, {"id": 69, "text": "It is not a ghost story but it will scare the hell out of you. The scariest part is all of this is a true story. Anuja and Swarda, the two female leads, are absolutely brilliant. And Anuja gets to explore all the facets of her acting prowess. The character of Bhola is really scary and you hate him, proving how well acted it is. The movie talks a lot about patriarchy throughout the story and that message is very subtly put across the whole movie. This is one of the must watch movie. This might just be better than Tumbad which according to me is as good as any horror movie. If only Sony Liv knew how to promote its content. Sigh!"}, {"id": 70, "text": "I m totally surprised by the cast i don't know anyone no any know star or actor but the performance was good . n d it contains so many ingredients of thriller 🙌"}, {"id": 71, "text": "The making is good, but the story is illogical. Put any average IQ person instead of characters and imagine what would be a normal person will be doing in the same situation, considering the characters are teachers. Acting and making is not bad."}, {"id": 72, "text": "Based on a true story, the ending implies. When the movie starts, we are introduced to a simple, small town woman, Anuja who is about to be married to a toxic man. She is brought up by a misogynist father and she can't see men in any different way. For her, it is how it is, she doesn't control her life, it is left to the men in her life. When she meets another woman at her place of work who seems different from her at the surface, she immediately seeks solace in her friendship. But only later does she find out, even this friend has a misogynist brother who controls her life! There's one scene where the two discuss their mothers. That's solid screen writing. This movie is about Anuja's character arc more than anything else. It's also about how she rids her life of misogyny.We are never told the back story of the psycho family, but as the mystery unveils, the chilling details evolve. This is not the regular run of the mill blood fest, but is an intricately constructed film where deep social issues are explored. Even the family is not shown like cinematic nut jobs. They have their own moral codes and ethics in their own twisted way.This is by far one of the best Indian movies made in this genre, where everything comes together. Solid acting, great script ll, wonderful camera work and editing. Special mention to the music director, Meghdeep Bose for using a mix of silence and nerve wrecking music to communicate the mood.I will not recommend this film to anyone who can't stand gore, violence and adult content. This is too raw. But if you appreciate good cinema and can sit through the gore, you will not be disappointed."}, {"id": 73, "text": "Watched it today and I'm totally bowled over by it. What a world class thriller movie, didn't expect that I would like it so much. A movie that keeps you on the edge of your seat through out. Excellent use of symbols and metaphor that depicts the society that we live in. Every character and scene represents events that is happening in today's world. So proud to see an Indian movie so brilliant. I hate spoilers so without giving out the storyline I would recommend this movie to all the thriller movie fans."}, {"id": 74, "text": "Those who love to watch thriller + Horror movie....watch this...."}, {"id": 75, "text": "Who would go to a place which looks a little suspicious. After they manage to escape, going back to home for a phone was stupidity. Very poor screenplay.Quite disturbing flim, totally time waste flim, please do not waste your 2hrs"}, {"id": 76, "text": "Could not live up to the hype of your. Trailer .. also Could very well see comunist oropoganda and hindu hatred ! Even after that watched the whole movie and honestly the movie was good beginning was ultimate but the rest of the movie was not as good as the trailer or the opening shot !!"}, {"id": 77, "text": "Not at par as promised with trailer Based on true facts but could have been better"}, {"id": 78, "text": "After watching this movie my mind is so disturbed how can grandmother😡😡😡 will see all this happening with granddaughter ..thats so shameful really i am just worried about those girls who tolerate this much torture 😭😭"}, {"id": 79, "text": "The story isn't compelling.. found it to be Grotesque and disengaging. It didn't focus on the issue until the very end and wasn't dealt with in a sensitive manner."}, {"id": 80, "text": "Based on true events this thriller movie is a good watch. Good acting and direction has nicely portrayed the message. This movie keeps you guessing what will happen next and you will certainly won't be bored."}, {"id": 81, "text": "Welcome HomeJust finished watching this little dynamite of a movie and simply had to give a shout out. Once in a while a movie comes along which either makes u laugh or cry or forces you to open your mind and realise certain facts of life. This movie definitely makes you do the latter. The scariest kind of horror is not a malicious spirit or angry soul or demon lurking to kill or possess you... It is the sheer depravity and cruelty that are possible by some human beings. Welcome home brings that kind of worst horror from the dark depths to the fore. The casting is so apt that you refuse to feel that these are actors and not real life characters themselves. The IG pages of the actors will leave you speechless at how well they have portrayed the role. Also checked up online about the director, Pushkar Mahabal. This is apparently the first movie directed by him and to my surprise he was once praised by RGV himself as a talent to watch out for ... Its easy to understand why. He has a deft &amp; uncommercial touch ( it's a compliment ) and the movie benefits from having a stark and grim atmosphere all around. The writer Ankita Narang has given birth to this genius of a script, which while highlighting the social travesties that still exist across the length and breadth of India, also has you rooting for the underdog and has you cheering ( with some expletives thrown in) whenever the underdogs strike back. She is a talent to watch out for. Someone who can write scripts like that in India and has the courage to not water it down for a more universal audience should be applauded.If there were awards for OTT movies, then Boloram Das has already won the villain of the year, Ankita Narang has won best script and Welcome Home is the movie of the year. It won't make you laugh... It's not a breezy popcorn movie.... But, it will get under your skin and show you the brutal travesties that still occur in our country.Must watch !!!"}, {"id": 82, "text": "Slasher films are a rarity in India. And it's only in India that you'll see a giant warning on a slasher film's poster saying the film isn't for the faint-hearted. That warning holds true to those audiences who don't know the existence of the genre in international cinema. Welcome Home is the closest it can get to the Indianized version of Tobe Hooper's cult classic - The Texas Chainsaw Massacre (1974) - minus the latter's all-out brutality. Two government school teachers doing census duty end up at an isolated house where a family with sinister secrets resides.Now, if I were to analyze Welcome Home as a first-time viewer exposed to slashers, I'd now be praising it to the skies for its grittiness, gore, and strong performances. The Pushkar Mahabal directorial (written by Ankita Narang) also adds patriarchal layers to the lives of the lead characters Anuja (Kashmira Irani), Neha (Swarda Thigle), and Prerna (Tina Bhatia), making a strong statement against it. While two of the women are forcibly held against their will, the third has lost her sense of free will. There are at least a couple of bad decisions made by the leads that they obviously regret later.However, the violence isn't held back one bit. It's showcased in all its menacing glory, and blood is shed more times than you can count. While the leads are effective, I found Akshita Arora's (who plays the matriarch of the house, Leela) presence (and stares) the most disconcerting. Boloram Das (who plays the lecherous house-help Bhola) is also solid. What can also be regarded as a positive is how the women (especially Anuja) choose to fight back against this oppressive family of murderers, instead of waiting to be rescued. It's a pretty satisfying finale that Welcome Home has to offer, be it in terms of creating a gory mess as well as (some level of) closure for its leads.The first 30-40 minutes of the film (especially, the 'initial visit' scene) is when the unnerving terror feels palpable. The house looks creepy even during the day, with the musical score making it a little too apparent. In that stretch, there's very little dialogue, but that the family has some twisted secrets is evident. It's when the duo visits the house the second time around that things get a little predictable. It's all thrilling and enjoyable for slasher fanatics regardless, and I'm glad such a film has come out of the Hindi film industry. However, I won't rate it more than 3 stars since I'm not new to slashers, and there's still a long way to go till we get a true cult classic in the genre."}, {"id": 83, "text": "Due to the pandemic situation, we are witnessing very different and unusual content this year on OTT. Welcome Home is one of the hard-hitting cinema and probably the most disturbing psychological thriller ever to come out in Bollywood. As the makers have clearly called it - This movie is not for the faint-hearted, it will actually haunt even once the film gets over.Welcome Home tells the story of two government home teachers, Anuja (Kashmira Irani) and her colleague Neha (Swarda Thigale), who have been given a task to do the census survey of specific areas in the city of Nagpur. While ticking off the houses from their list, Anuja and Neha comes across a lonely house which is situated at a deserted place away from the city.Anuja and Neha reaches the house and knocks on the door, a pregnant lady, Prerna (Tina Bhatia), welcomes them. While taking the survey, they find the suspicious activity in the house which has a weird looking old lady (Akshita Arora) her son (Shashi Bhushan) who is on silence fasting and their ever-smiling and wicked cook (Boloram Das). Curious and yet diligent, on their second visit to the strange house to know more about Prerna, Anuja and Neha gets stuck in the heavy rain and are forced to spend a night in the house. During their stay, unusual events begins to occur which reveals mystery behind the house.Directed by Pushkar Mahabal who has also done a fabulous job in editing as well, Welcome Home is certainly the most disturbing slow-burn pyschological film to come out in Bollywood which is based on true events (Bihar Shelter Home case I guess). The film builds on you as it progresses with excellent writing, haunting background score and brilliant camera work where each and every scene has been executed appropriately and accurately. Screenplay is fantastic, though it becomes little sluggish towards the end.Hats off to the director for making it bold and blunt. Welcome Home is highlighted with brilliant performances starting with Kashmira Irani and Swarda Thigale stealing the limelight with their honest work. Shashi Bhushan and Bolaram Das will haunt you with their brilliant acting even after the movie while Akshita Arora and Tina Bhatia were outstanding with their expression even though they had less dialogue.On the whole, Welcome Home is not easy watch but it will expose the harsh reality of child sexual abuse and it will definitely make you angry. Go for it ... Brilliant work 3.5/5Welcome Home is currently streaming on Sony Liv and is produced by Paresh Rawal, Swaroop Sampat, Playtime Creationn and Monolith"}, {"id": 84, "text": "Welcome Home is unwelcoming for the faint hearted! While exposing regressive thoughts a section of our society shamefully bears for Women; it blatantly exhibits real life heinous acts through a horrific tale. Which makes you feel distressed &amp; shaken to the core!Without any applicable bounds, it showcases Exploitation, Abuse of Women; which is still to this day; largely prominent in discrete parts of our country as well as in this patriarchal society. An engaging storyline intuitively becomes too realistic at times. Highly unpredictable nature at play; the plot bit by bit sucks you right in.Coupled with a tenacious soundscore that helped creating a requisite ambience. Albeit the same composition, in few instances became monotonous and boisterous to listen to. Cinematography is fine if you could ignore the indisputably cramped resources!All of the actors being dauntless &amp; credible; Performances were simply astonishing. Everyone deserves hefty praises of their own. Characterization, especially on those with short tenured appearances; sticks out like a sore thumb.It's a slow burner, as you guys might have already guessed. That being said, if you love unconventional horrors; you will admire its grounded yet impactful narrative. Just beware of those few sequences where it breaks all its shackles, and starts to dwell in a discomforting manner."}, {"id": 85, "text": "Though I am not a big fan of slasher flicks, Welcome Home really impressed me in many ways. There may be hundreds of such movies in Hollywood like this but only a handful movies are like this back home, and Welcome Home definitely is among the top 5 in that genre. The disclaimer at the teaser made me giggle, thinking that it is a marketing ploy, but this movie definitely needs one as it is definitely not for the light/Kind hearted. Lots of things add up since it's based on true events.Screenplay and pacing was great to get us into the groove of the storyline. The director's ace storytelling leaves us on the edge of the seat for a good part of the first hour. Production design, makeup and costumes was excellent. Music and editing though generally good were a little patchy in a few places. Cinematography was very decent. Acting levels were surprisingly good by the two female leads throughout the movie. One has to really appreciate the producers to put money on such a subject, in a country like India.Overall, a gritty and eerie movie throughout, which springs up surprises time and again. Yes, it is riddled with some logical loopholes, but which slasher movie isn't? Need thrills and frills watch this movie with volume turned up in a dimly lit room late night, the sound alone will do a lot of things in our heads. Not suitable for family viewing or for young viewers. For maximum effect better watch it late night with full sound. 6.8/10 stars."}, {"id": 86, "text": "Seldom do you come across a Bollywood splatter film that delivers an astonishingly gruesome and thrilling plot with such grace. Mind you, the this film is not your average run off the mill bollywood thriller flick.The plot centres around Anuja (Kashmira Irani) and Neha (Swarda Thigle) who are teachers at a government school in Nagpur. The two are appointed by government authorities to conduct a census survey of nearby villages. As they are about to wrap up their assignment, they land up on the final house on their list - an outlandish mansion situated in the middle of nowhere. With no neigbours for miles, the house is completely cut off from human civilisation. In spite of their misgivings, Anuja and Sharda decide to enter the outlandish mansion, only to realize that things are not as they seem as.Debutant director Pushkar Mahal has done an outstanding job and never for once do you get the impression that this is his first feature film. Every character has a complex backstory which we learn as the film progresses. The entire cast delivers an exceptional performance but the lead actresses Kashmira Irani and Swarda Thigle merit a special mention due to their riveting performance. The background score is spot on and magnifies the bloodcurling intesity of the film. Overall, this is a thrilling entertainer and definitely deserves more recognition. Watch this if you are looking for a fresh breath of air."}, {"id": 87, "text": "First Thing First After So Many Days I Watched A Good Horror Mystery Thriller The Tag Line Defines It All This Is Not For Faint Hearted This Film Doesn't Have Any Spirits Or Ghosts But This Has Something Which Is More Than That The Story Is Well Written And Directed The Characters Are Enough To Give You Chills And Cherry On The Cake Is Its BGM Which Keeps You Hook Even In The Normal Secnes I Can't Reveal Anything About Story And The Characters As It Will Be A Spoiler And Also Request You To Not Enquire About Them Just Vist This Home And Hope You Return Safe 🙂 This Is Not A Flawless Thriller The Lightings Could Have Been More Accurate As In Some Places Its Too Dark and In Some Places Its Uneven Well This Should Not Stop You To Watch This Coz If Content Is Art Then Sony Liv Is Picasso Of It And In The End I Would Say If You Want To Make Some Films On Feminism And Films About Patriarchy Then Make Something Like ThisWell That's ItThanks"}, {"id": 88, "text": "Welcome Home (Hindi, 2020) Horror, Thriller The new SonyLiv flick is filled with emotions of fear and blood. This creepy movie tells the story of 2 ladies named Anuja and Neha who had frightening experiences when they went to take census count in a secluded house in the middle of nowhere. They went to take the census and felt something was out of place when they had met Prerna, a pregnant lady who told 'Children were born and they die thereafter' when asked about her other kids. There they met 3 more adults who were suspicious of the way they behaved.They stepped out of the house. Later, Anuja had a feeling to go back to that house and Neha at first wasn't interested. But their instincts made them go there. This time, everything is changed. A downpour made them stay for the night and, that was the beginning of their ultimate fears. What happened to them thereafter is the rest of the movie's story.Apart from dealing with a horror subject, the movie directed by Pushkar Mahabal and penned by Ankita pictures the Indian community dominated by men. For example, Anuja's fiance and Neha's brother were the same apart from living in different Indian cities. Their attitude towards women can be seen at the beginning of the film. The sex-starved villainous characters also depict another section called psychos who are not common, yet they consider women as tools for just sex. The male characters in the movie are mostly awful. Maybe they too exist!!At end of the movie, when we realize that the whole incident is based on a true incident, we could feel chilling vibes through our flesh and bone. Welcome Home is well crafted and cut to the chase during the nearly 2 hours of its run time. Welcome Home shouldn't be missed if you are a movie fanatic, especially if you like the movies that chill down the spine that pervaded with an eerie atmosphere.Well, it was too hard to live the life of Prerna!!!"}, {"id": 89, "text": "2 girls escaping but they want to discuss at the doorstep whether there is a dear body or notNo point in hiding where they are from their own knowing people , infact census taking is an official dutyIt's not a so dense forest but even tigers growl 🤣🤣🤣🤣 it's a habited place with even electricity so this scene made me to laughContradicting phone of one girl fells in water and of other girl is left behind in house , typical Indian mode of executing movies ... people forget easily when they are well aware that something is not wrong at that place 😄😄😄THE ONLY SENSIBLE PSYCHOTHRILLER WHICH I REALLY APPRECIATE FROM BOLLYWOOD in recent IS  TUMBAD"}], "reviews_amount": 90}