{"name": "Secrets of the Saqqara Tomb", "titleId": "tt13150630", "reviews": [{"id": 0, "text": "Fascinating documentary with terrific archaeological discoveries. What I liked about this one is the joy of the scientists and their workers as well as the compassion and respect they all held for the long-dead Egyptians. At one point, one of the women scientists says science had it wrong before: the beautiful paintings and statues are not about their ancestors' lives but about their dreams....Because they believed more in the afterlife than they did in the earthly life. Simple yet poignant."}, {"id": 1, "text": "Its really cool to get a real time experience of an excavation site. pretty unfiltered too, without too much overproduction. its shows some of the step by step method of working. havent seen much movies/docu that show this in the same detail, prob becauze this was such a rare occasion.8/10: props"}, {"id": 2, "text": "As I kid I was fascinated with Egyptian history, something I forgot much about as years went on. I was left with that childhood feeling again watching this, truly fascinating history and a mind-blowing discovery. The work involved described very well by all involved. Really enjoyable watch."}, {"id": 3, "text": "This supposed documentary is a real mess. People guessing, handling ancient relics without methodology. Just digging. The top is the supposed scientist that open the sarcophagus under the sunlight, in the dirt. What a mess..."}, {"id": 4, "text": "A lot of this documentary seemed staged and dodgy. I love learning about Egyptian finds and its history, but something about this show left me feeling uneasy. One thing in particular was the lack of wearing gloves when handling artifacts and the lack of care they had when handling them. Bones were tossed and handled with bare hands. Large tools were used to shovel big loads of sand away with chunks of whatever with it to be discarded. It seemed sloppy. Another issue I had was that there was no actual bone analysis done in a lab. There could have been so much more learned about those bones if they had them tested in a lab. Instead a woman sits down on the very site they were found, and lays them out on the floor without a care in the world to try to reassemble them and get to know them. I can't even go there with that....just ridiculous.Then uncovering the mummy out in the desert in the middle of the day with wind and sun and hands all over. The finds were amazing...I will give the film that. The tombs and statues are beautiful and it is mesmerizing to see artifacts that are so old, but they need to be treated as such."}, {"id": 5, "text": "Watching a documentary about ancient history is always a treat. However this one takes you to a ride of lots of emotions, excitement and surprises throughout the whole film. This one is a must watch."}, {"id": 6, "text": "Everything about this feels sophomoric, improvised, and random. The narrative appears to be made up as they go along with no real scientific evidence to support it. No one seems to know what they are doing as they dig up sarcophagi in slopes of sand around the site and bones in shafts of a tomb proclaiming them this person or that person, all the while spinning a weak narrative of ancient conspiracy.Meanwhile these so called archeologists open a three or four thousand year old sarcophagus for the first time and examine it outside in full sunlight! In lieu of a laboratory the bones they find inside the tomb are examined by spreading them out on the dirt floor of the work space.I'm not an archeologist but I find this whole thing implausible as a professional archeological dig and ethically questionable as a documentary."}, {"id": 7, "text": "This was very impressive. Not too long, not too short and explains things how it should be explained. I think this is how a good documentary should look like. Watching this gives us chills when the archeologists find something new about the mummy or any new objects. It makes us think for a lot of time what would have been to live in that era. It's incredible. And we may never find the whole answer."}, {"id": 8, "text": "Too many coincidences to be true ... looks staged and adds nothing to the basic knowledge of the matter ... do not waste your time"}, {"id": 9, "text": "I am conflicted. I am absolutely not convinced of the authenticity, I would not be surprised if everything is staged. If even parts are authentic, it is painfull to see how rough they handle the dig. I would welcome a follow up by a team of true professionals. Either on location or simply as voice over of this documentary."}, {"id": 10, "text": "This is a great documentary that shows not only the progressive uncovering of an astounding discovery but also some of the lives of people who are working on it. These are not foreigners going there with a big budget. These are egyptian folk who have been working on the site for generations and who have something to tell. Beautifully documented and portrayed, and impressive camera work on such dark and dusty conditions."}, {"id": 11, "text": "What you need to understand about this documentary is that the tale is much bigger than what has been told. There is alot here you still need to know and ask about.1 belies more information by time will be revealed on this &amp; by time this discovery will be more clear - it is still a great documentary that I would totally recommend to watch. Enjoy it!!"}, {"id": 12, "text": "If you want to know how to smear out a 5 min story into a 2 hour documentary, this is definitely the movie for you. Endless slomo shots, with bombastic music, of people digging in the dust and finding not realy that special artifacts as an result. They're nice but not that nice and probably ready to be thrown away anyway if you see how they're handling this stuff. There are loads of people speculating about hypothetical subjects. All to give the viewer the idea of this story's going somewhere. But there's just nothing. 'How we found 3000+ mediocre artifacts in a few months' would be a better title for this documentary."}, {"id": 13, "text": "Really great documentary. Awesome camera work to get views as things are being discovered. Hope to see more like this!"}, {"id": 14, "text": "Are the people goofing around in front of the camera really archaeologists?I have watched hundreds of documentaries about Egypt. But, this one is a sheer failure. These so called archaeologists were just fooling around with some daft smiles, doing nothing but tried to show off before the eyes of the viewers.They are like circus clowns who have recently got the boot and had no job to do. The worst is, like always, haughty Salima with her grotesque hand movements as if she is manhandling the qualities of a sheep.Disappointing."}, {"id": 15, "text": "Too much time spent on trying to show how modern Egyptians live in a place called Egypt and do Egyptian stuff. Fine, you want to do a social documentary about daily Egyptian life, call if Day in the Life of an Egyptian. Don't tease a archeological discovery documentary then show tons of unrelated crap intermixed with mini cut scenes of the most incompetent archeologists on the planet."}, {"id": 16, "text": "What I saw is nothing about archeological workers or technicians it is all about some random lost guys that had somehow the luck to be there. They dig and guess about everything. They did not know nothing about anything. I would not be surprised if they find some fresh dead body from a recent murder case that happened in 2017 and say that they GUESS that it is some mummy from 600 BC. It is a total disapointment to see those guys wondering aloud about and guessing around and handling all those relics with no respect or even the care all of those need. The director spent too many minutes listening about diggers life, about what they do or what their relatives did before them. Itnisna real shame. This is not wirth unfortunately not now not what so ever. All those guys handled it without a clue whatbis that. What we can learn is a part of Egypt history is lost because all those diggers and us because of this director. What a shame."}, {"id": 17, "text": "About 10 minutes into the documentary I paused it to search on Youtube. Is this another Treasures from the Wreck of the Unbelievable? Fool me once I thought. Realized it was real and proceeded to watch.I really enjoyed the history of the site BUT it all seemed very staged. It was not an organic finding an amazing tomb experience. Seemed staged and overly edited. The human connections (Boss, Doctor) were appreciated... But the rest just felt contrived to me.."}, {"id": 18, "text": "So sad that it's overdone. Real facts and a real discovery...but although this is real, this documentary makes it looks fake,"}, {"id": 19, "text": "While not being an expert in any way , I still find it painful to watch how poorly the site is excavated . Items several thousand years old are damaged due to poor handling , a few of many examples here:-A tomb has its wooden end cover damaged due to clumsy handling by the head archaeologist who , all though its on film , claims he did not course it...-A coffin is opened outside,in sunlight,exposing a 3500 year old mumie.-Items are handled without gloves though out the dig.-A grave chamber with ancient carvings and statues is used as workstation for later finds in other tombs .There seems to be no photo documentation of he site/dig what so ever , besides what Netflix do.Safety on site is non existing , one of many examples being shafts several meters deep are left uncovered in crowded work areas.The wild guessing of so called experts , as for an example when determining malaria to be the death cause ,on bone remains only is forensic nonsense , as is that an entire family should suddently perish like that due to a semi contagious decease. The credits in the end mentioning this bollux again is great reminder of how you just wasted 2 hours of your life watching this."}, {"id": 20, "text": "I'm not an archeologist and even I know that this is not how it's done. If they actually did the dig this way I shutter to think of the damage done to this site. Amount of history destroyed by these people playing professionals is astounding.I'm disappointed."}, {"id": 21, "text": "Pretty standard fly on the wall documentary. While I did enjoy the subject matter and some of the beautiful shots of the landscape, the film feels a bit long and lacks structure in my opinion. Overall a good watch if you like ancient Egyptian history but not captivating for all viewers."}, {"id": 22, "text": "I was half watching 10 mins in, even in the background or when I glanced over nothing particularly interesting was happening.This tomb is worse then others already discovered. There were some nice shots, and opening the sarcophagus. But my god, this could have easily been condensed into 30 mins."}, {"id": 23, "text": "Never watch a documentary with the word secret in the title"}, {"id": 24, "text": "Really bad and not matching with the actual site conditions"}, {"id": 25, "text": "Some parts about the discovery of the tomb and the artefacts inside were absolutely fascinating!However I feel that for the run time, it doesn't ever actually explain or tell you all that much... There's nothing about the history of the area, what they are doing at the site, nothing to create context.However some genuine archaeological firsts are made and that's very interesting, as is just physically being able to see live new discoveries being made / unearthed.I enjoyed it because I love ancient history, but if you're new to it, you'll find this pretty boring!"}, {"id": 26, "text": "Perfect, loved it................................."}, {"id": 27, "text": "The documentary is too technical and not able to relate to. Its all hypothesis and nothing concrete. It never answers Why?. May be, that is how archaeology is. One thing, I witnessed, is they all love their jobs no matter whether they find (or) not find anything. That's the take away from this documentary."}, {"id": 28, "text": "The documentary showed an amazing site and was well shot. It was not very scientific in it's approach and the conduct of the excavations depicted looked a bit amateur in what was shown in the film gangs hacking the ground with mattocks rather than carefully excavating and recording having said that the spirit of the people involved was very charming which was well shown in the film."}, {"id": 29, "text": "You really feel the excitement for the team. Just be sure to preserve and protect what we find. Would love to see a sequel to this, hopefully continued funding."}, {"id": 30, "text": "James Tovell and his team made an amazing job: the testimonies selection, the milestones, the music, the light, everything makes you feel a part of this endeavour. To create such an atmosphere keeping the camera lens clean is a real feat to accomplish. The feelings of awe and wonder, altogether with the empathy the viewer ends up sharing with the Egyptian team, is the highest accomplishment a documentarist can have. Well done. A must see."}, {"id": 31, "text": "I just finished watching, and I rushed here to givee it a 10. I found the documentary amazing, I loved the people that worked in the site, a lot of passion to the work, and emotion. I always loved Egyptian culture and history, especially ancient. But then, I read some reviews talking about the archeologycal methods applied, about how they didn't wear gloves for example, and exposing the mummy etc. I actually thought it was weird they touched the artifacts and bones with their bare hands, but I simply didn't mind, I thought well, they know better. But it turns out they didnt. Anyway, I really liked the film."}, {"id": 32, "text": "Interesting archeology document, but covering rather basic knowledge about ancient egypt and far too long (almost 2h) for presented content. Trailer is actually more exciting than movie :)"}, {"id": 33, "text": "Ok I won't lie this wasn't the most technologically advanced documentary on ancient Egypt that I've ever seen. Alot of people seemed put off by some of the methods used but that didn't bother me much. There were also claims that it felt staged but I didn't feel that way either, perhaps I'm not looking into it that deeply. What I really liked was the human connection, these people were working hard and using what they had. I didn't mind seeing some aspects of the lives of certain team members. It made me remember that these are ordinary people in an extraordinary place. I did enjoy this doc and I hope people give it a chance."}, {"id": 34, "text": "So this is by far the best documentary that has been on Netflix in...well a very long time. It is scant on details of ancient Egypt and shiny stuff. This is a story of the middle men the upper-working class of people and covers a life and the family of the man whose tomb is found. You may have seen many reviews with low scores. They are the elitest watchers, the ones that think they know best how to do anything. Do not pay attention to them. This is a wonderful show with many details of the life of this man, as much as can be know so early. I know a very small amount of this era and this history and this was a very good show of the times and the digging and work of finding these things and working out (the beginning part at any rate) what their lives were like and how they lived and died. The belief systems of these people were extremely fluid from era to era. This show is well worth the watch for a lay-person. It is not full of super minutia and boring detail. Do not listen to the negative people and their BS. Watch and enjoy."}, {"id": 35, "text": "What a great discovery ! wondering if they were true about malaria first case in history !"}, {"id": 36, "text": "Too many what the hell situations to be a true documentary but still a good piece to learn more about ancient Egypt. Take it with a pinch of salt."}, {"id": 37, "text": "Making a documentary from the perspective of the hard working workers is just an amazing job. Great documentary."}, {"id": 38, "text": "Really enjoyed it! I'm glad I'm not the only one questioning the lack of gloves/articling. That said, this was incredible to watch and their discoveries are amazing. I really hope there is a follow-up!"}, {"id": 39, "text": "There has been criticism of the less than clinical excavation methods. A bit unfair that. The artifacts have endured for 3000 plus years. They're pretty robust. Methods aside is the commentary and cast of characters involved in the dig. One scientist is obviously Oxbridge educated but her aside this is regular Egyptians delighting in their ancestors.Good for them. The English is a tad short of fluent but the discovery doesn't need flowery language. It speaks for itself, it's nothing short of amazing, humbling even. Next thing is go visit in person. Not during Ramadan obviously."}, {"id": 40, "text": "When I was younger I wanted to be an archaeologist, I don't know what made this desire blossom in me, and watching this film came to me with incredible nostalgia and the certainty that it was good not to have continued my childish desire, to work under the ground or under intense sun. Are not my thing, passionate documentary about these discoveries, in which we are sent 4500 years ago, fantastic..."}, {"id": 41, "text": "At first, i don't interested at ancient egypt things. After watching this, it's actually cool. I've got a bit picture of the archeologist's job and the others. Still prefer this documentary in series. 2 hour doesn't enough for the information. And i think they missing something for the details."}, {"id": 42, "text": "It is very nice, actually I felt the same emotion when the archeologists found something in the Saqqara. If you love egypt / mummy documentaries, this is for you."}, {"id": 43, "text": "Its a good documentary film, from this film I just learned that in Saqqara there are many historical remains of ancient Egypt. I think Saqqara is a lost city"}, {"id": 44, "text": "The old Egyptians mad all of this effort to live a second life after death and here they are after thousands years of death coming back to the living world to last among the living as legends"}, {"id": 45, "text": "An interesting documentary on the finds at saqqara, providing good background information and visuals. Very good quality and close-ups, felt like you were there. An enjoyable watch."}, {"id": 46, "text": "This was cool to see first hand of the discovery's.. I learned a lot from watching it.. the visuals are impressive also. If you like history you will enjoy this"}, {"id": 47, "text": "What a great tomb to explore in 2019 this is one of the best documentaries i have watched in 2020 and if u interested with egyptology, this is what u need to watch."}, {"id": 48, "text": "This is a great documentary for people interested in the subject, but don't expect any scientific information or anything new. I throughly enjoyed this docu but it could be better!"}, {"id": 49, "text": "This is my very first documentary on Archeology &amp; I love it."}, {"id": 50, "text": "I've looked forward to this film for a while now. Unfortunately, this suffers from a few major things that stop it from being epic.Recently, I've thought that Netflix multi episodes shows/documentaries could be trimmed down into less episodes or just a 2hr film. This is totally opposite. There is a ton of information here, but the director has unfortunately placed it all over the place. It is very sporadic in its editing and jumps all over the place. Leaving the viewer asking more questions than are being answered. Multi episodes broken into more condensed/direct and specific areas of the dig would be much better serving for the audience.With that being said, I've never wished for a narrator more in any documentary I've ever seen. A narrator would help with tying all of the vast information presented here. Also, to explain what, where and why we are seeing some of the things as well as more explanation of why the Egyptians did some of the thing they did. There is some explanation, but again, it's sporadic and all over the place.I won't even get into the anxiety I was feeling watching the archaeologists jump around and seem to randomly dig and kinda just toss around (without fully documenting, at least what we see) artifacts and mummies. Again, this may be the bad editing/directing.Bottom line, the whole thing seems extremely rushed and disjointed.Now the good, I STILL RECCOMEND that you watch this if you are at all interested in this kind of thing. It's is beautifully shot and shows some amazing things that you do really feel like you are seeing for the first time with the archaeologists. Some images/items that you will never forget. I just wish it was put together better."}, {"id": 51, "text": "It's a Netflix show so we should probably expect entertainment over rigorous archaeology, however.... this show was problematic.To start with, it's a highly interesting discovery and site. Theres a lot of interesting finds that are significant for history of Egypt especially in the tomb of Wahtye. As another reviewer said, the excavators seem very enthusiastic and keen- and as Egyptians, so they should be. I liked that Egyptians were involved in this dig, and that it was filmed largely in Arabic. This is their nations history, so that's important and refreshing.However!There were so many elements that were questionable in terms of history and archaeology.* the forced 'conspiracy' theory is a stretch. Trying not to add a spoiler- the 'conspiracy' around the scene of the man and woman at the offering table- their conclusions are weird. The logical conclusion is it is his dad? But their first and second conclusion seem very unfounded. it made me question their credentials, their logical capability, and/or the highly constructed nature of the doco. Are they playing up conspiracy for viewers?* they kept touching things without gloves. Like what? Archaeology 101 is wear gloves - our hands have oils which can be destructive to artefacts. My high school archaeology students know this....* they opened a sarcophagus /exposed a mummy, in the middle of the desert / sunlight, compromising preservation. Oh and its 'discovery' seemed highly staged along with the nicely placed ushabtis in the background.* there appeared to be little record keeping and site photography. I know they were filming, but archaeological records and reports require mappings, site surveys, diagrams and photos. I can concede some of this *may* have been edited for audience 'interest', but given everything else, I'm not betting a lot on it.The narrative and conclusions of a conspiracy are dodgy, or at least, not well formed in the doco. The structure, 'script'/dialogue and editing is highly popularised for the non academic.The final WTH, was at the end, when archaeologists were thanking Wahtye for a lifetime discovery, and saying he'd be happy you dug him up and made him famous? Um no.Wahtye and his fellow citizens spent a long time putting effort into their tombs and burials for a reason. They needed to be well stocked, appropriately decorated, mummy contained and preserved, in order for their spirits (ka,ba,akh) to survive. Archaeology disrupts that. Wahtye would probably be furious. You disturbed his tomb. You dug up and dumped his, and his families bones in crates, before playing with them to assemble them. I find it interesting an Egyptologist would claim he'd be happy with it.In all, it's an interesting discovery, and if you aren't an historian/archaeologist/or interested in those professions, you'll probably find this fabulous. If you have any knowledge or experience in these fields, you'll probably be face palming a lot.But still, you should probably watch it for the fabulous footage of the tomb and some amazing finds there (no spoilers!)."}, {"id": 52, "text": "Probably 60% or 65% of my video watching time is spent on documentaries. It's a fascinating world and there's just so little time and so much to know, as they say. Ancient history is right up there near the top of my interests. How can a documentary that covers something like new discoveries regarding ancient Egypt be anything but absolutely spellbinding? Well, just watch SECRETS OF THE SAQQARA TOMB and you'll find out. I would not have thought it possible.I've been looking forward to this particular documentary for about a month. A large, undisturbed tomb from four thousand five hundred years ago? Holy moly, let me at it. This is going to be epic! I'm probably going to need a ball peen hammer to pound down all the goosebumps!Turns out not. Instead, we got this crap.SECRETS OF THE SAQQARA TOMB is The. Worst. documentary on ancient Egypt I have ever seen, bar none.My expectation was that the program would be about the Saqqara tomb. Mostly it turns out that the Saqqara tomb is relegated to being the set or backdrop for where we can learn about what a dirt digger thinks while digging dirt and how his son is going to be a digger, too. And then there's this guy who rides his motorcycle to the excavation every day with his boss on the back seat and how interesting it is to ride from the city center out to the desert. Why, we even get to spend a lot of time riding along with him. And his boss. Gosh, I learned a lot about the Saqqara tomb from that. I learned, for example, that people who don't know how to make documentaries should be forcibly restrained from making documentaries.Then there were the incessant appalling flights of fantasy where they pick up a fragment of bone or a pottery shard or a statuette and wax eloquent on what all of this might mean or all the things they might learn from it. No ACTUAL learning or genuine meaning, mind you.In attempting to glean SOMETHING about what would seem to be a phenomenal find such as the Saqqara tomb, I get nothing listening to a digger wax philosophical about his life or hearing the foreman talk about how being a foreman is the family business, handed down father to son. Literally. Absolutely. Nothing. What. So. Ever.Turning a mooing herd of grad students loose on this discovery would have yielded far, far more informative insights and information than this Keystone Kops version of what was supposed to be an archaeological excavation.I suppose there are probably lots of people who would be interested in a show entitled Deep Thoughts on The Meaning of Life According to a Glump of Random People at an Archaeological Dig, but none of them would be me. As far as I'm concerned, advertising a show about a fabulous new archaeological discovery and then filling the program with 90% human interest BS is just misrepresentation of the first order. I'm pretty sure what happened was that they got to the end of the thing and realized that very little useful information had been uncovered and so they threw a human interest angle at it, a theme, to distract from how scientifically lame was the entire affair."}, {"id": 53, "text": ".....just finished watching a highly anticipated Netflix documentary related to the 2019 archaeological excavations in the Saqqara necropolis. Saqqara is renowned as the site of the step pyramid and is surrounded by a virtual city of the dead dedicated to human and animal burials. The depth of digging and conservation to be done will take at least another two centuries to get anywhere near knowing the sheer scale of the buried sites.This documentary is perhaps the most arousing cinematic communication of the true grit and wonderment of archaeology since John Romer's Ancient lives. The music was subtle and complimented the scenes beautifully. The reverence of the Egyptian archaeologists for their heritage was palpable however I saw a little rough handling here and there that could have been avoided. Time was a luxury the huge state funded team did not have.A certain unique animal mummy could have had the dignity of a plastic crate large enough to hold him. They cut that scene the moment it was plonked into an ill fitting crate. I guess I'm just dreaming of what I would do in that situation as handling my own mummified cat on the rare times she is moved is something of special significance to me.Watch this documentary and be patient. It takes time to excavate and the extra time this doco takes to tell the story lets the story lap at your feet like a tide of intrigue until you are totally immersed in an ancient world."}, {"id": 54, "text": "I'm disappointed with Secrets of the Saqqara Tomb, mainly because the vaunted secrets remain ... well ... secrets. What little new information this documentary contains is scattered and disorganized. There are some nice visuals, but in the absence of explanation and context, viewers don't learn much. It's frustrating to watch a documentary and come away with far more questions than answers.Aside from some rank speculation about a possible malaria epidemic (the first in known history were it proved) and the discovery of a mummified lion cub, what's really new here? What new information can we glean from the tomb's pristine state? What's the full story the hieroglyphics tell rather than just the mystery they present regarding for whom the tomb was originally intended? Where does this find fit within the timeline of world and Egyptian history, and how does it enlighten us about contemporaneous Egyptian culture?Unlike most documentaries of its kind, there is precious little in the way of expository animation and illustration, and it's sorely missed. How would the tomb complex and its environment have appeared at the time of completion? What would its inhabitants have looked like? What are the tomb's dimensions? Where, specifically, is it located and where is it in relation to more famous sites? Should the viewer have to stop the movie to consult a map?Moreover, how are archaelogists applying scientific technologies, both old and new, and what exciting things do those technologies reveal? Cat mummy X-rays are great, but isn't there more?Bottom line: I don't know, and I ought to after investing two hours in a documentary film.Unfortunately, the focus of this documentary was the archeologists and not the artifacts, and that's not what was promised. The workers' story might have been an interesting aside, but no more than an aside, were it somehow related to class and labor among the ancients. The poor and seemingly unsafe conditions under which the diggers are toiling today echo what we know about class and labor in ancient Egypt, and this irony is wholly lost on the filmmakers.Occasionally, this documentary loses all semblance of focus and wanders into pure irrelevance. Do we really need no know how much an archeologist loves his 4-year-old daughter, and how his fear of losing her makes him exactly the same as an ancient Egyptian? No, because we already know the collective pathos surrounding the loss of a child is universal. Is one archeologist's quaint story about being rejected by his pet cats after unearthing a pile of mummified felines significant? I'll go out on a limb and say it's not only insignificant, but it's also of questionable veracity.Perhaps, oddly enough, the finding of the Saqqara Tomb hasn't aged for long enough to support a documentary film. One hopes we'll learn more in time."}, {"id": 55, "text": "I understand the need to know what people went through 3 to 4 thousand or more years ago. What I will never understand is why it's so important to desecrate a persons grave? Why do we feel the need to take apart a final resting place that it is very obvious that those people wanted to live beyond, into the afterlife? Why? The wall of hieroglyphics says a lot. It tells their story.Okay, I'm someone working on this discovery and recovery for historic proportions. I have lived my life in this region as my forefathers have. Don't you think that the people digging through this persons grave site ask themselves why are we disturbing this sacred ground? To what purpose? Money, fame, discovery to find something new?I watch these programs all of the time and again, I ask myself this same question, why are we doing this? To what purpose does this negate the practice of grave robbers and let the future disrupt our ancestors?I hope that by disrupting these tombs it is worth the basis of explaining the reason why we do this? Again, why?As far as another movie of grave disruption is concerned, I give it my best. Same destruction, different part of the desert. I hope it is worth it."}, {"id": 56, "text": "The basic mode of Netflix, as I'm discovering lately, is a kind of softly produced cable TV with inclusive values. The target is a broad audience that a while ago would have simply watched what was on TV.Here's the softening effect. In a documentary about important archeological discovery, we have lush, polished images of the interior of the tomb as if Russell Crowe was about to walk in for a scene. I miss an eye that actually discovers as they did, the awe of having a presence.It's the same thrill that tickles archeologists the world over as they dig; not just acquiring knowledge of distant mores of life, the way a biologist would, but standing in the middle of tangible things that suggest world, broaden horizon. You'll notice this is a recurring fascination in the film. People really stood here, touched this, played this ancient board game that no one has touched for 4000 years. The mummy laying before us is an actual person from ancient Egypt. It' vividly shows how objects are enlivened by the world they suggest. So it defeats the whole point to give us images with the same feel as the movie version.And this softening extends in how we come around to discover; we want to find out the 'story' behind this place, archeologists explain to us time and again. There are four burial shafts inside the tomb, and once we dig down to the bottom, we discover ordinary human beings who loved and suffered; an ailing father who probably had to bury his children. Instead I find myself captivated more by the notion of world these people inhabited, which is completely unlike ours today; the complete certainty of living in world that is just a first life that extends into next, a whole life building up to this rocketing of the body in the afterlife.These are not just decorations on walls, one of the archeologists explains to us. They're 'dreams'. More akin to film than painting, I would add, how we peruse film. Will we ever again be able to be moved to such deep belief as these people? Rather than the overt familiarizing of whether or not someone died from malaria, or did they have lion cubs in Egypt, there's a more interesting one here about how we wave abstract worlds into being."}], "reviews_amount": 57}