{"name": "376 D", "titleId": "tt13178692", "reviews": [{"id": 0, "text": "At first I wasn't thinking of watching this movie due to all the new casting but having alot of free time in wfh I thought of giving it a try and seriously I am not disappointed. Its not just that the story is new but also the acting from all the debutant actors is terrific and specially both the lawyers. You wont waste your time watching this movie. Do give it a try."}, {"id": 1, "text": "The subject matter of the movie is brave, thought provocking, sensitive and an eye opener. I congratulate the makers to show such courage and the actors who are mostly debutants and brilliant, especially both the lawyers. The court room scenes are very intense and realistic. No unwanted and unreal drama has been added like other movies in filming court room scenes which makes the movie more realistic. The main hero of the movie is script which is very interesting and unique. A must watch..... Vaibhav Pareek Ex- Law Officer Geology and Mining Department, Govt of Gujarat. Presently practicing as an advocate in High Court of Gujarat"}, {"id": 2, "text": "The subject matter of the movie is brave, thought provocking, sensitive and an eye opener. I congratulate the makers to show such courage and the actors who are mostly debutants and brilliant, especially both the lawyers. The court room scenes are very intense and realistic. No unwanted and unreal drama has been added like other movies in filming court room scenes which makes the movie more realistic. The main hero of the movie is script which is very interesting and unique. A must watch..... Vaibhav Pareek Ex- Law Officer Geology and Mining Department, Govt of Gujarat. Presently practicing as an advocate in High Court of Gujarat"}, {"id": 3, "text": "It reflects the psychological aspects that a victim,its family and near ones go through during criminal litigation , its a wonderful movie wherein minutest legal intricacies have been comprehensively portrayed on screen,hats off to the homework done by the team in doing such profound work off-screen and on-screen."}, {"id": 4, "text": "Wow! What a film! Kudos to the makers, actors and the whole team for delivering such an amazing work of cinema. I'm a filmy buff but I never have seen such a strong, realistic court room drama till now. The concept, story line, performances show the depth of involvement of the whole team. It's a must watch."}, {"id": 5, "text": "Excellent movie. Nice concept. This movie shows how our judiciary faces challenges and how it judges on the basis of eyewitnesses and evidence. Work of all characters is excellent."}, {"id": 6, "text": "At first I thought this would be like any other movie with same story but I was so wrong. Dont want to put spoilers so wont disclose things but this movie really made me think. There are so many things we are so ignorant about. And our minds have been so conditioned by false-propagandas that we simply fail to see &amp; understand certain problems/struggles. Everything was pretty realistic and great, including the court-room scenes, unlike cheeky bollywood films where court-room scenes are so extravaganza with lawyers doing crazy things to make a point. I learnt something new. This movie is not only informative but I think it will overall make you a better - a less-judgmental person. I definitely recommend watching it!"}, {"id": 7, "text": "After a long time a nice Court room drama movie has appeared on the screen. Everyone has played very nice and important role, contributing in their own way. The court room scenes are Very Organic and Natural. The argument in the court are very genuine and realistic. I think this movie would be first of its own kind addressing the issue which has never been addressed in our society."}, {"id": 8, "text": "Fact &amp; true.. exlent concept , every one must watch this movie"}, {"id": 9, "text": "Being a law professional, after reading the title of movie, i watched it by assuming that it must be a film, based on some case; but after watching it, i found it a movie based on unique subject matter. Our legislature must consider to amend criminal law, by considering the concerns raised in the movie.The movie is amazingly directed. All the characters of the movie have justified their respective roles; especially the roles played by Advocates, the Judge and the psychiatrist. The direction is quite impressive. No where movie is becoming boring. In fact its a well played court room drama and i must say both the advocates have played it so natural that it gives real life court room experience. Highly recommended Must Watch movie."}, {"id": 10, "text": "Movie take you into the reality of problem faced by common man whose last hope is on judiciary... the best part of whole movie is that it able to show the practical problem faced in effective implementation of JUSTICE  . It was well directed and acted by its whole team members....Adv Siddharth Karwasra Rajasthan High Court Jodhpur"}, {"id": 11, "text": "Though rape on male victims has been prevalent since centuries and no law on their side, it has come into light just few years back and a huge taboo yet. The movie is based on the male victims' struggles and how the society sees them, no different than female victims, rather not being the victim at all as there has been no law on their side since centuries .. The actors have played their roles very well , amazing acting and also was quite impressed by the court scene which were quite realistic (being a lawyer myself) and very much on point in terms of law and their arguments and verdict. A movie worth watching and applauding 👏🏼👏🏼👏🏼"}, {"id": 12, "text": "Can say story is bit different. Songs are superb.I like advocate Anand 's role."}, {"id": 13, "text": "It is an unique concept movie which shows the real story which never came out....also grt songs of the movie and super court room drama....must watch it"}, {"id": 14, "text": "A movie that breaks barriers and gives an insight into the functionality of the judiciary system in India. The initial storyline starts well and later catches pace as the courtroom scenes begin.Amazing work by the creative writer and director of the movie. Most importantly, kudos to every individual both at the back-end and front runners who added relentless dedication to make this movie a brilliant watch.In a nutshell, the movie is definitely a good watch!"}, {"id": 15, "text": "Must watch movie at this Time It's about the sequences happening in India"}, {"id": 16, "text": "I must say, 376 D has put an end to the debate when it used to be always said that Indian Movies court room scenes are unrealistic. 376D is as close as it can get to bringing the court room act on screen. Not only it is realistic but watching this movie can act highly beneficial to young lawyers in learning the art of cross-examination in a criminal trial. I myself in the law profession for about 8 years had a chance to learn a lot by simply watching the movie. Loved every bit of it. The movie has taken up very bold subject which was never discussed before. I highly recommend this movie for all law students, lawyers and law enthusiasts. Great work. Puneet Siddhartha B.SL. LL.B., LL.M. (England)"}, {"id": 17, "text": "Shout out to Robin Singh Sikarwar and Gunveen Kaur for writing and directing such a bold and untouched subject. Both Sumit Singh and Priyanka Sharma were outstanding as Public Prosecutor and Defense lawyer respectively. Would definitely love to see Sumit Singh in the big screen again. Loved the performances."}, {"id": 18, "text": "One of the best movie watched recently.Story line is amazing and new . It's another movie in the list which has shown the reality of how the low level issues are dealt in our society.Looking forward for more stories like this one from the writers.All in all must watch ."}, {"id": 19, "text": "It's a great story, the problem is direction it's horrible, direction is so bad you stop watching it in between"}, {"id": 20, "text": "It is a film with a good acting and a strong story line and the lead actor Vivek Kumar has got tremendous performance and Deeksha Joshi's performance has also been very impressed. The weak link of the film is its background music in all court scenes. It felt like somewhere the background was weakening the music scenes but still a very good and excellent film, the film is a film made on the subject of gang rape."}, {"id": 21, "text": "Good movie, must watch...very genuine court room drama...."}, {"id": 22, "text": "All new actors, mostly unknown. But what a brilliant movie. What a story line. It's a very brave and bold attempt for the society. I would urge everyone to see this movie.Team 376 D you did wonders. Jitni Tareef karoon woh kum hai."}, {"id": 23, "text": "Just finished watching the movie. Very coherent story and kept me engaged throughout. Beautifully written and everyone's acting is superb.Vivek in particular shines in the movie. His expression especially the crying scene in the beginning shows his years of training and NSD background. There has been many movies on court room drama and crime against women but what makes this movie different is the imagination of writer/director Gunveen and Robin. A man hardly experiences the daily trauma that a woman has to face daily and for Vivek to take up this challenging role and doing justice to his act shows that with this movie, a STAR is born. We have got our next Irfan Khan.Sumit ,Deeksha and Priyanka also acted extremely well. Music was okay. Subject is little bold for mass but it's made very beautifully. Overall it was a great watch."}, {"id": 24, "text": "376 D raises a question for justice. It is true cimema."}, {"id": 25, "text": "Excellent ...must watch ... everything writing ,direction and performance all are up to their best 👍"}, {"id": 26, "text": "Found the theme exciting but didnt provoke interesting..good work by the actors though"}, {"id": 27, "text": "Good movie to watch for especially the court room drama and the movie deals with a solid serious subject a must watch movie acting from all characters have done bravely."}, {"id": 28, "text": "Excellent movie.... Beautiful and heart touching songs....must watch 😍😍"}, {"id": 29, "text": "If you love to watch courtroom drama then it may be good. But there have been so many movies with much better courtroom drama. The biggest drawback is that there is no thrill no suspense. If they wanted to put forth topic of male gang rape, then why you showed boys disguised as girls. If you want a bold topic then keep it bold, why choose middle way! Story doesn't falls in either category. Writer should be clear in mind."}, {"id": 30, "text": "The movie is superbly written and directed. At no moment I felt that it is a work of all new writers and new directorial team. Must must watch if u want to see the reality of world."}, {"id": 31, "text": "An unnecessary movie with nothing to show. avoid at all costs, waste of time and energy."}, {"id": 32, "text": "Rape in any of its forms is horrific, this line from one of the pivotal scenes in the movie is what describes the drive of its story appropriately. It's difficult to imagine what a victim of rape goes through. What it means to be violated with force and malicious intent! What effect does it have on an individual's psyche? If gender of the victim plays a role in any capacity whatsoever! Does law provide an adequate cover for every victim? The film hovers around such issues and thus is an important and relevant story. Every victim relies on a collective understanding of a crime and criminal in order to get justice, but we as a group of civilised human beings have absolutely no idea how any trauma affects a particular person. All of this makes for a matter worth probing, and 376 D makes a courageous effort.It's a story of 2 brothers, and a girl whose relationship to them is the bedrock of their existence in a make-or-break entanglement of a big city. A series of unusual incidents through a night shakes their lives irrevocably. There's an attempt to physically assault and gang rape. If you consider this a spoiler, the story really actually begins after this. It's not a suspense film, it's not an overtly dramatic film, it's a film about a traumatising incident, and the after effects that follow in the wake of loss, legality, and everyday life.376 D takes its name from a specific section in law that deals with gang rape. After watching the movie, I can safely say that the movie is aptly titled, because the focus is really on the legal recourse. The characters do not reveal much about their individual lives or their pasts, other than around the incident. We are left with a fight that rests solely on a narrative that places all its bets on moving forward. The debutant directors, Gunveen Kaur and Robin Sikarwar, deserve praise for their commitment to a vision of raw, unembellished truth.The performances in the film speak, but whether they echo or not is a subjective opinion. Vivek Kumar as Sanju calls upon emotions and anxiety with considerable satisfaction, Naman Anand as Devi is brief but vibrant enough, while Deeksha Joshi as Sandhya punches with what she's got. The two lawyers played by Sumit Singh Sikarwar (as Mr. Keshav Anand), and Priyanka Sharma (as Ms. Shalini) do quite a lot of heavy lifting in a true-to-life portrayal of courtroom proceedings. Their presence and arguments bring a refreshing change of pace from what we have known as court dramas.It's impossible to talk about this film without its music &amp; lyrics. The songs are impactful, heartwarming, and liven up the background of these characters who seem stuck in their web of 'reasonable doubts'. Kudos to the entire team!It's not easy to survive in this growing world of consumerism and rabid development. It strips people of their identities. There are millions of Sanjus &amp; Devis out there who live in a demanding city with an income that doesn't attract any sort of influence. They might be getting wronged in one way or another. And although it seems like a theoretical idea that reformative justice would take place &amp; compensate for their losses, there may just be a sweet release of emancipation in justice that empowers and lets one move ahead with life. The film's climax imagines and captures this for a beautiful brief moment."}, {"id": 33, "text": "This movie addresses a topic not explored earlier. It really picks up pace and engages the viewer from the time the legal proceedings / the court-room scenes begin.This project has been helmed by debutante directors but the quality of certain aspects of the movie such as the lighting and camerawork were really polished and effective in major part of the film... it reflected the mood of the film very aptly, even enhanced it.Many first timers mess up the background music or dont pay much attention to it. But in this movie, the bgm was very effective in many parts.The dialogs in the courtroom scenes seemed less dramatic than the usual Hindi movie style which was a refreshing change. It made the scenes more real and effective. The movie is backed by some top writing and sharp research.Hope these makers get to create more such riveting content!"}, {"id": 34, "text": "#376D A courtroom drama without the unnecessary drama!This film is a must watch for anyone who has ever been in a court room and everyone who hasn't.It is the most realistic depiction of the legal process in the country that we have come across. We appear in courts as well as hold quasi judicial powers in the line of our duty. And this film has touched us at our very core.We are blown away by the amount of research that has gone into it. It is as accurate as it is engaging.The performances are strong but nuanced and understated at the same time.There are so many layers and messages that are conveyed with each well shot frame.Do yourselves a favor and watch this masterpiece"}, {"id": 35, "text": "This is a movie which talks about actual scenario of the Indian Judiciary, how lawyers work and how things move in courtIt is not a typical masala court room movie like Daamini or Jolly LLB where in the characters life outside court is covered more and court scenes are covered lessThis is an outright court room movie The story builds a little slowly and it picks up pace when it reaches the courtThe writing team have done a good amount of research how a case is argued in court, which is not usually heard of in Indian CinemaIt has been made on tight budget and it shows, had it been backed by a good production house it would have done wonders (considering the production team does not change the script :-))Good performances by the cast considering as it is a first movie for some of themAll in all a good movie, definitely a watch"}, {"id": 36, "text": "I have worked as an investigator in premier institutions like DRI, CBI and ED and have fair experience of investigation, evidence and law and I find that most of the Indian movies are far far away from reality when it comes to investigation and court room.I am pleasantly surprised to find that this new movie 376 D is refreshingly realistic and gripping. I must complement the entire team for coming up with such a gripping, intense and technically correct movie.The story is unique, screen play is gripping and acting of the lead characters is natural and flawless.I also loved the music and songs.Overall a wonderful and gripping movie."}, {"id": 37, "text": "376D is a heart touching film. It is a film based on social issue. It is based on the heinous crime gangrape happening in the society. This film shows that when a girl is raped, the whole society and system have sympathy with her, but when a boy is gangraped, how does the whole system makes fun of him and how much he stumbles to get justice. The film puts a question mark on all other systems including the police and judiciary. The film also shows the condition of lower courts and the way they function. While watching the film, it seems as if we are sitting in the court room. It shows how on the basis of money, the defense tries to entangle the case in the strings of law by standing up to the renowned lawyer and how the public prosecutor win the case with his understanding. At the end, the judge's decision makes us think a lot. All the actors in this film have performed very well. The dialogues of the film are excellent. Its songs are also heart touching. Films on such social issues should come up from time to time. The entire film keeps the audience tied for 2 hours. I thank the producer-director of the film that they have made a film giving a message to the society. Everyone should must watch this film once."}], "reviews_amount": 38}