{"name": "Oceans Apart: Greed, Betrayal and Pacific Island Rugby", "titleId": "tt13411840", "reviews": [{"id": 0, "text": "This doc exposes the inequalities and injustices built into international rugby (as well as corruption in Pacific Island rugby at a national level). You don't need to care about rugby to be interested in this story."}, {"id": 1, "text": "Like many of the players from the region this documentary is hard hitting and will hopefully have a big impact.It clearly shows the inequality and obvious imbalance in power that exists in the rugby hierarchy which is not open to change.Shows that rugby is ran at the top by people who do not encompass the values that rugby prides itself on"}, {"id": 2, "text": "It's a shame this documentary has to exist, but it does a great job of exposing the corruption in world rugby and highlighting the struggles faced by Pacific Islanders. A very well-made documentary, let's hope it makes a difference to how Tier 2 teams are treated"}, {"id": 3, "text": "Simply brilliant. A deep thought provoking informative piece that's exposes the self serving nature of tier one nations. It also shows the incompetence of World Rugby and their willingness to restrict the growth of the game for short term financial gain and not long term sustainability."}, {"id": 4, "text": "Watched this documentary and the spriit of the Pacific Islanders shines through. The tier 1 nations should be ashamed and right this wrong now."}, {"id": 5, "text": "What an amazing, eye opening watch into Pacific rugby. The documentary is a truthful story, that gives so many valuable and deserving people a voice that they haven't had in the same way before. Dan Leo gives light to such an important topic and Callum Drummond's cinematography brings the story to life in an amazing way."}, {"id": 6, "text": "Tier One administrators need to watch this doc and hang their head in shame at the appalling treatment of Tier 2 nations. Added to that the internal greed of the Pacific Islanders own administrators who appear to be prime ministers etc and you see the appalling treatment of players who are used and abused and ultimately thrown away once they retire. Sadly these players if they have any sense aspire to play for tier 1 nations rather than their own countries due to the money and being able to provide for their families.Dan Leo does a great job in this doc highlighting the disparity that exists and I hope it will help their cause."}, {"id": 7, "text": "A brilliantly-made documentary on a minimal budget. Inspiring and alarming; shocking and heart-warming. A must-watch for anyone with a passing interest in global sport.Some very important issues highlighted which must be addressed by those with power."}, {"id": 8, "text": "If you're interested in rugby, then this is a must-watch. Dan's eloquent, humble and insightful. The arguments are strong, but I suppose the real question is how can you help? Share the movie, tell people, buy the PRPW merchandise, all of the above?"}, {"id": 9, "text": "A fantastic documentary which highlights the exploitation of the Pacific Islanders by one of the biggest sports in the world. Changes in rugby are needed and needed now!"}, {"id": 10, "text": "A beautifully filmed documentary that shines a spotlight on the exploitation of Pacific Islanders in rugby.This documentary has the potential to drive significant change as it challenges the status quo within the old boys club that is World Rugby. How can it continue that in a game between Samoa v England, the RFU can earn £4m but the Samoan players are only paid £60?"}, {"id": 11, "text": "So sad to watch but well played Dan Leo. Honestly can't believe how weak World Rugby seem in terms of growing the game."}, {"id": 12, "text": "Enlightening look into the struggles of tier 2 nations. As a fan of tier 1 rugby I had no idea how unjust the system is, particularly to such prolific rugby countries as the pacific islands"}, {"id": 13, "text": "If you love rugby or equality you'll enjoy this documentary. An honest and straight forward look into the challenges, corruption and hope behind rugby."}, {"id": 14, "text": "Really hope this will open the eyes of everyone involved in world rugby. Amazed these countries don't get anywhere close to a fair price of tickets sales when they are what bring people in, it watch the best of the best play rugby. Keep up the good work and hopefully you'll have the world of rugby behind you to give everyone a fair share."}, {"id": 15, "text": "Love my rugby, but I never knew that this is how we treat the great island nations."}, {"id": 16, "text": "Rugby values are a huge part of what the game brings to everyone involved. Fans, players, youngsters getting into the game love the sport because of its values. To see the governing bodies not behaving in a way that is true to those values is ugly to see. This documentary turns the lens on what the powerful incumbents don't want people to see. The story is told by a passionate and brave man who impacts his career and risks his personal safety to stand up for what is right. Everyone in the rugby family; fan, player and official should watch this and play an active part in helping to make the changes necessary for a level playing field."}, {"id": 17, "text": "This was a well-spent hour. Dan Leo has done an immense job in raising the awareness about rugby in the Pacific Islands, how they only have very limited resources and are terribly treated as the poor relation by the gin-swilling blazers at World Rugby. They are a governing body that doesn't really want the game to grow globally. If they did, Leo wouldn't have to make a documentary such as this, exposing what is really going on in the game."}, {"id": 18, "text": "Eye opener to world rugby. World rugby need to be accountable for their actions"}, {"id": 19, "text": "Fantastic. Dan Leo is Fantastic. The story is sad, but has to be told."}, {"id": 20, "text": "Truly eye opening and amazing documentary. There needs to be change"}, {"id": 21, "text": "Direct, to the point and an honestly felt review that helps rugby fans around the world to understand the journeys of players from a remote part of the world into spotlight of the global game. It's not all champagne and starlight - the truth is touching, warming and honourable. Well worth a watch. Well done Dan Leo - Keep doing what you do...."}, {"id": 22, "text": "Highlights the vast difference between tier 1 and tier 2/3 nations. A must watch. As an international rugby and premiership rugby fan I was shocked by the corruption and ignorance in our game."}, {"id": 23, "text": "If you love rugby or support you need to watch this and see how some of the greatest countries In our game are treated!"}, {"id": 24, "text": "This film exposes the greed, corruption and cronyism at the heart of World Rugby's ruling body and the injustice of its treatment of the Pacific Island Players. The elite nations, who turn a blind eye out of self interest, are complicit in this betrayal of their fellow players. This needs to change."}, {"id": 25, "text": "This documentary is a real eye opener to all sports fans, but especially rugby fans. The core values of the game are not being carried out by those who are not only paid but tasked with guiding the game to the highest levels. Definitely recommend and please share with all of your friends/family who have an interest in sport/rugby."}, {"id": 26, "text": "A Fantastic insight into the game we love and how the part of the world that produces some of the best ,if not the best players in the world, are getting a raw deal.Definitely worth a watch"}, {"id": 27, "text": "Brutally exposing the inequality in the rugby between the tier one old guard and the developing nations who provide so much of the playing base in the professional game, and the resistance to the changes necessary to support those players and nations."}, {"id": 28, "text": "It shows the though reality of the South Pacific Rugby system, corruption cases and complicity of top sport officials. Worth the watch."}, {"id": 29, "text": "For anyone with skin in the professional game. Dan Leo has shone a spotlight on the inequalities and the commoditisation of Pacific Island players."}, {"id": 30, "text": "I had an abstract notion that the Pacific Islands got a raw deal from World Rugby and the Tier 1 nations but this film really opened my eyes to how bad things are and how great the need for reform to ensure a fair deal is.Recommend this for any rugby fan."}, {"id": 31, "text": "Well done to Dan Leo for bringing this story to the attention of the wider world. Incredibly sad to see the way the Pacific Islands are currently treated and the leaders of World Rugby and the Tier 1 RFU's sacrificing rugby's core values for naked greed and self interest. Hopefully this film will act as a catalyst for real change."}, {"id": 32, "text": "A very good insight on how World Rugby and Tier 1 Nations are blocking Tier 2 and 3 development. Hopefully this documentary will put pressure on World Rugby for change to happen."}, {"id": 33, "text": "If you like sport; watch this. Injustice &amp; corruption are not fair. Sport should be competitive- so the field needs to be level.....get educated &amp; act 🏉💪🏼"}, {"id": 34, "text": "Amazing work done by Dan Leo &amp; team to bring this film out. I found it a real eye opener to the treatment of Pacific Island rugby players and hopefully this will help change things for the better. World Rugby Council should be one country one vote! 🇫🇯🇹🇴🇼🇸"}, {"id": 35, "text": "Fantastic documentary about fairness, corruption and equality in rugby. Really challenges the values of rugby and presents huge opportunity for change. Plus some beautiful footage of the Pacific Islands. Well worth a watch."}, {"id": 36, "text": "Fantastic documentary which really shows the struggles of the Pacific nations in the current game. Highlights some real key issues."}, {"id": 37, "text": "Powerful documentary, we must help these countries 🙏"}, {"id": 38, "text": "Very clear and concise in the plight of the island nations. Hugely interesting and eye opening!"}, {"id": 39, "text": "Unacceptable what the pacific islands have to go through and the corruption and greed that is rife. Something needs to be done and world rugby needs to live up to those rugby values ..... sort it out"}, {"id": 40, "text": "If you like and follow rugby, it wouldn't be any surprise to know that the majority of the worlds top players originate from the pacific island nations of Tonga, Fiji and Manu Samoa. This documentary through the accounts of past and present island players, shares a glimpse of the harsh social-economic realities they face to represent their countries.Pros: -Brilliant narrative -Links with current affairs -Direct interviews with heads of state and game.Cons: -Pursuit of being subjective at the cost of narrator and Samoan legend Dan Leo. -Production could had been a bit tidier ie filming and interview scenes."}, {"id": 41, "text": "I love rugby - and I was shocked by the unfairness built into international rugby and the way we pay the Pacific Island teams get ripped off when they play at Twickenham. Everyone in the game should be ashamed."}, {"id": 42, "text": "Oceans Apart is a must see film, providing and exposing an insight into the need for change within World Rugby for the Pacific Islands. Dan Leo has been one of the leading lights, to try and highlight the support needed for the Pacific Islanders rugby, so that they can continue to grow and develop. Through the Pacific Rugby Players Welfare he has achieved much required support for the players, who often have to ply thier trade overseas. What is required is a much more even playing field and in turn enhance the values that rugby aligns itself within the game."}, {"id": 43, "text": "Eye-opening and concerning programme about the failure of our sport to uphold it's own principles. Revealing, simple and well-made TV. Would like to see more in the future as, hopefully, things change for Pacific rugby. If you're a rugby person, you should watch this and add your support."}, {"id": 44, "text": "A hard hitting look at the state of Pacific Island Rugby Unions, and the continuing exploitative practices that World Rugby allows to continue towards these struggling Unions. The values that World Rugby preaches is merely lip service to a rugby public ignorant on how World Rugby truly governs."}, {"id": 45, "text": "Wake up WR, wake up Bill Beaumont, wake up Brett Gosper; transparency, checks and balances (good governance) are foundations to fairness and growth of the game. Exploitation is not. It's WORLD Rugby!"}, {"id": 46, "text": "This documentary isn't just relevant for rugby fans but for the global sporting community. It has genuinely left me with a profound sense that things need to change alongside the sense of shock at the reality of the situation in some aspects. Never, in all my naivety, did I realise things were like this.And throughout all of the raw negative insights into the corruption and greed within Pacific Island organisations and World Rugby we are blessed to see such a beautiful country with such incredible people."}, {"id": 47, "text": "Dan Leo is doing a great service by raising awareness of the exploitation and inequality taking place. Pretty shocked at how toothless World Rugby are. The proposals put forward seem fair and achievable if there is a will to do so. Be better!!"}, {"id": 48, "text": "This was such an incredible documentary. Thought provoking and heartbreaking. World rugby is sadly failing the pacific island rugby players, and more needs to be done to address equal pay and voting status. Allowing rugby players to return to their home nation to play would be a huge development for pacific islands. Thank you to Dan Leo for this wonderful documentary. I hope World Rugby addresses these issues soon."}, {"id": 49, "text": "Thank you for producing this film, the fight must not stop here."}, {"id": 50, "text": "Fantastic documentary identifying the massive gaps and injustice of World Rugby. Quite shocked at the revelations of pay for islanders and genuinely upset that a national team resorted to busk outside a Scottish restaurant to fund a meal - how can that happen in the UK and all over the world.Well done Dan."}, {"id": 51, "text": "Ever willingly paid eye-watering amounts of cash to watch international rugby matches? I have. Happy to do so to watch superstars from the Pacific Islands. Guess what? They won't see any of it. These stars light up our our leagues as well as the international competitions. Let Dan Leo open your eyes to the challenges they face both at home and abroad. It's a thoroughly absorbing film but be warned, you'll be raging at the gobsmacking injustices. All power to Dan Leo and the work he's doing, despite the cost to his career and the personal risks involved. Do hope this gets enough exposure to be the catalyst for real change by World Rugby Union and its members. A must-see for rugby fans or anyone interested to uncover the darker machinations of multi-million pound international sport."}, {"id": 52, "text": "You don't need to be a rugby fan to watch this. This highlights the inconsistencies and inequalities of those that have vs those that don't. The Pacific Islands contribute the largest percentage of top flight rugby players, but receive the least in support from their own respective unions and world rugby too. This needs to change."}, {"id": 53, "text": "I love rugby, it has been a force for change in my life. It's now time for me to be a force for change in rugby. This documentary has opened my eyes and my mind to see what my Rugby Union and other Tier 1 countries are doing to Pacific Nations. I'm ashamed of my Union and World Rugby for perpetuating such hardship and inequality. Take a bow Dan Leo, 60 minutes flew by in what felt like 5. So captivating and powerful. Everyone needs to see this."}, {"id": 54, "text": "Both eye opening and infuriating. Dan Leo attempts to expose and change the inequalities the Pacific nations face on the world rugby stage. Spread the word and show solidarity and support"}, {"id": 55, "text": "This was such an eye opener. As a proud Welsh rugby fan, someone who includes Faletau as one of their favourite players, this highlighted to me what damage was being done to rugby in the Pacific Islands. At no fault of the players. More people need to be aware of the magnitude of the problem so World Rugby can be forced to stop the problem here. Make this the last generation of rugby players who have to leave the home behind to make a decent living."}, {"id": 56, "text": "An astonishing must watch documentary exposing the sheer inequality, corruption &amp; greed facing the most giving &amp; gifted rugby players on the planet, being those from the island nations of the South Pacific."}, {"id": 57, "text": "Amazing documentary highlighting the issues faced by island nations. Really hope this can be the catalyst for change and rugby to be the inclusive sport it claims to be."}, {"id": 58, "text": "Measured, fascinating documentary exposing vast inequality in rugby which really needs exposing and sorting. Dan Leo is eye-opening in his revelations of the treatment of Pacific Island players and the platitudes dished back at him by those in charge really raise the hackles. This needs to be watched by every rugby fan, and world rugby need to be taken to account. Well done Dan and all involved for your bravery and self-sacrifice bringing this to people's attention. Don't let him down people - watch, and learn, and then act."}, {"id": 59, "text": "Highly recommend this documentary. It provides an excellent insight into a huge issue that needs more awareness! A must watch."}, {"id": 60, "text": "Incredibly eye opening documentary about the plight of Rugby in the Pacific Nations and its inability to gain a foothold in the international game. Do not miss the chance to see this... it will change your perspective on the values supposedly held by World Rugby and England Rugby (the largest Rugby Union in the world)"}, {"id": 61, "text": "A real eye opener, a must watch for any rugby. Highly recommended. Great work"}, {"id": 62, "text": "This documentary highlights the corrupt issues that plague the Pacific Island rugby unions. Anyone with any connections to Rugby needs to ask what they can do to help these struggling players receive the fair treatment they deserve. Very well put together and credit Daniel for speaking up and being the spearhead to help PI players who are taken advantage of, not just at home but across the world."}, {"id": 63, "text": "An extremely informative, emotive &amp; at times shocking documentary about the plight of Pacific Islands Rugby, the massive amount of high quality players they produce for the world game. The current World Rugby system, which smacks of a colonial past, exploits these nations &amp; the players when they should be supporting &amp; developing the game for the benefit of all. T1 nations must do more &amp; give T2 nations a fair share of game receipts as a minimum. The fact the the World Rugby CEO made a disparaging comment about 'what really is a tier 2 nation' in his interview shows the ignorance which exists. Highly recommend any rugby fan views this film."}, {"id": 64, "text": "This documentary is a must-see for those who like rugby and those who don't. A real eye-opener and a very important watch. I knew nothing about the corruption and unfairness behind World Rugby, this is a very powerful documentary and I can't recommend it enough"}, {"id": 65, "text": "Great viewing and real look in to the problems pacific islanders face as rugby players/contact sportsmen."}, {"id": 66, "text": "Shocking! The rugby world must stand together to right these wrongs. Well done Dan on all you are doing"}, {"id": 67, "text": "The eternal rugby question is surely: - Did God make Pacific Islanders to play rugby? OR Did God invent rugby for the Pacific Islanders? In many ways the answer is immaterial. Just thank God both exist.Sadly their treatment by World Rugby is not God like. Dan Leo's film shows how poorly they are treated. They are men of faith who value family and friendship. In fact they treat friends as family. (I have been blessed by knowing many PIs.) This documentary tore my heart in two. Change is essential."}, {"id": 68, "text": "Brilliant thought provoking documentary 👏 👍world rugby needs to listen and act on its words"}, {"id": 69, "text": "Great watch, highly recommended! So sad how these nations are treated by their own unions and world rugby, it needs to change!"}, {"id": 70, "text": "A must watch for any sports fan - so many problems in the game which can easily be sorted to give island teams the finance and success they deserve."}, {"id": 71, "text": "For all fans of rugby, this documentary is a must watch. It has been made by former Manu Samoa player &amp; Pacific Welfare CEO Daniel Leo. When our Pacific nations rugby teams perform poorly, many of us often lay blame squarely on the management &amp; governance. While crucial improvements must be made in those areas, Daniel's documentary shows the unfairness and inequities that are built into international rugby bodies and governance structures, that effectively work to suppress Pacific rugby unions, teams, players and the game at large. Despite rugby's public image of inclusion, egalitarianism and offering a step up for Pacific players, the worldwide structure does not live up to its glossy reputation. Watch it for yourself to see, if these inconsistencies are akin to modern day colonialism, slavery or structural racism, as inferred or argued by some of the film's commentators."}, {"id": 72, "text": "The film was wonderfully produced and loved the setting. Hope the film sets out to achieve its goals, that is to ensure Pacific Islands sports athletes get their fair share."}, {"id": 73, "text": "Incredibly eye opening documentary. The injustices that the Pacific islands rugby community endure are awful and this documentary investigates how the situation has come about, and what can be done to solve it."}, {"id": 74, "text": "A fascinating documentary into how the Pacific island teams are treated on the world stage. Extremely thought provoking and highlights the fact more needs to be done."}, {"id": 75, "text": "Really interesting watch, just imagine the funding was equal. The Pacific Islanders nations would definitely be amongst the top 5.... which probably worries the the tier 1 nation the most to prevent helping."}, {"id": 76, "text": "All rugby fans should watch. Truly shocking. Thinking of boycotting next England vs Islanders encounters at twicks until a fair amount is redistributed. We love rugby for it's values, we all need to prove it and it starts with us fans."}, {"id": 77, "text": "In my view good film making encourages the viewer to consider things and where possible make change. In terms of sporting commentaries, this is right up there. A must see !"}, {"id": 78, "text": "This is a much watch and will make anyone question the true values of our beloved game"}, {"id": 79, "text": "Oceans Apart is a revelation. The worldwide rugby family needs to know about the corruption and betrayal of the Island nations that is shown in this film."}, {"id": 80, "text": "Dan's journey through this documentary focuses on the issues of the Pacific Islands, but is just as applicable to every non-tier 1 nation that plays the game. A strong call for change in the governance of the game."}, {"id": 81, "text": "An important story, magnificently told.What Dan has managed to do in this film, is fantastic. A must watch for diehard and casual fans, and will even provide great insight to non sport fans."}, {"id": 82, "text": "An important documentary that lays bare the way developed rugby Nations have exploited small island states rugby and corrupted the administrators. As a keen England rugby fan I was shocked by the RFU's response. If rugby is to grow these inequities need to be address."}, {"id": 83, "text": "Dan Leo delivers the message perfectly and clearly, great insight into the battles faced by the islanders."}, {"id": 84, "text": "Almost all Tier 1 fans are probably aware there is an issue in the Pacific Islands but also probably completely oblivious to How bad it really is. This is a must watch and paints World Rugby in a particularly bad light - pressure needs to stay on them to change it! An £80 match fee vs the £20k+ that England players receive is crazy, especially given the quality of the talent in the Pacific Islands!"}, {"id": 85, "text": "Rugby is better with a level playing field.The pacific islands are our game's richest talent pool, but systemic problems and self interests of a few continue to stun her development.For rugby to be a global game, this needs to change.Watch this heartfelt documentary to hear the stories."}, {"id": 86, "text": "Even if you aren't interested in rugby, This documentary is outstanding. Dan shows a side of rugby that is ignored and brushed under the carpet. Professionally made, produced and can't recommend it highly enough."}, {"id": 87, "text": "An uncomfortable view of the state rugby in the pacific islands, who contribute so much to our great game. Although they provide the majority of professional rugby players around the world, the pacific islands are left to beg and plead for scraps at the table, where world rugby continue to capitalise from them and exploit them by providing no funding or support, and radically skewed contributions to the visitors in the rare occasions where they are afforded the opportunity to play tier 1 nations out of a World Cup year (Samoa vs england at Twickenham, for example). World rugby's neglect of the pacific islands, combined with the corruption and poor administration in-house means that more and more talented players are forced to chase their dreams abroad where they can earn a decent living for themselves and their families, weakening their home nations, strengthening their adopted nations and moving further away from a global game than ever before. Hang your head in shame world rugby."}, {"id": 88, "text": "Like so many rugby fans I like to think rugby values means something - Not blind to gaps nor to the great things in other sports - but this lifts the lid on a shameful side of world rugby"}, {"id": 89, "text": "An incredibly informative documentary detailing the current issues that face Pacific Island rugby. Hosted by Dan Leo (Samoa Rugby), the film does a fantastic job of highlighting the struggles that the three countries of Samoa, Fiji and Tonga are fighting with.Whether you love rugby or not, it's impossible to watch this film and not give your heart to the players who remain abused by the system they have given so much to. WATCH. THIS. FILM."}, {"id": 90, "text": "An excellent documentary getting to the heart of a problem, that many are aware of but none do anything about. World Rugby needs to look at themselves, the interview with Gosper was shocking, what a shallow and short-sighted individual. One of the top tier nations needs to stand up to world rugby.Well done Dan Leo and all those who are supporting PRWP"}, {"id": 91, "text": "Unbelievable story that doesn't get nearly enough attention."}, {"id": 92, "text": "Massively mixed feelings about watching this. Almost 30 years as a huge rugby fan and I didnt know almost any of what was covered. I'm grateful to know now, but I really don't like knowing it. Exposing corruption and feeble excuses, World Rugby should hang their heads in shame and members should be actively driving change.Refreshingly simple, calm, direct and honest in how it was put together and I hope the support for both the PRPW and Polynesian teams is amplified as a consequence."}, {"id": 93, "text": "Brilliant documentary Dan. You speak the truth! Keep up the hard work you are doing, it will come good."}, {"id": 94, "text": "This is a story that needs to be told widely. How can people who thrill and entertain so many be so badly treated? Dan Leo is not the perfect interviewer, but his passion is white hot. (Although he did hold back from knocking the smirk off Brett Gosper's face...so the man's clearly got iron discipline).If you love rugby, don't miss this. If you hate injustice, don't miss this. Just watch this. Tell your friends."}, {"id": 95, "text": "It's horrendous what our Pasifika players have to go through especially being so far away from the support of family. The fact that clubs capitalise on their vulnerabilities makes this even more hard to watch because it hits so close to home for most. Vinaka vakalevu Dan and team for this very important documentary that the world needs to see."}, {"id": 96, "text": "Well worth a watch. Interesting insight to the inequality in world rugby."}, {"id": 97, "text": "A beautifully shot documentary, with former international rugby player, Dan Leo asking the questions that, the leaders of the game don't want asked and seemingly don't want to answer. A powerful piece which should rock the sport to its core."}, {"id": 98, "text": "Thought this was a really good documentary, both in terms of highlighting some of the structural inequalities that exist within World Rugby, contrary to their stated values. It highlighted a damning picture of self-interest from the world's richest and most powerful unions.But it also focused on some very human elements, including the fallout for players who have had to play for a pittance in earnings."}, {"id": 99, "text": "Dan Leo does a superb job explaining the plight of Pacific Island rugby players with a clear call to action. Anyone who is a fan of rugby should watch this and ask their our rugby unions why change hasn't happened. Dan is a worthy narrator and brings in a balanced view point. Highly recommended!!"}, {"id": 100, "text": "Rugby values are a huge part of what the game brings to everyone involved. Fans, players, youngsters getting into the game love the sport because of its values. To see the governing bodies not behaving in a way that is true to those values is ugly to see. This documentary turns the lens on what the powerful incumbents don't want people to see. The story is told by a passionate and brave man who impacts his career and risks his personal safety to stand up for what is right. Everyone in the rugby family; fan, player and official should watch this and play an active part in helping to make the changes necessary for a level playing field."}, {"id": 101, "text": "A powerful film that the whole rugby world needs to see. For a game that prides itself on cultures, respect, values etc... this film exposes the truths Well done Daniel Leo"}, {"id": 102, "text": "A great documentary exposing the greed and exploitation of the Pacific Islands. I hope this becomes a series and at the the end I hope to see positive change and success for the Pacific Nations!"}, {"id": 103, "text": "I love my rugby and this film is truly heart breaking. The Pacific nation players deserve so much more. Keep up the great work and keep highlighting this issue."}, {"id": 104, "text": "What an amazing, eye opening watch into Pacific rugby. The documentary is a truthful story, that gives so many valuable and deserving people a voice that they haven't had in the same way before. Dan Leo gives light to such an important topic and Callum Drummond's cinematography brings the story to life in an amazing way."}, {"id": 105, "text": "Brilliant insight into the shocking governance of the game. The access Dan Leo has is amazing: former international players and coaches, journalists, World Rugby CEO and even the Prime Minister of Samoa. The nations of the Pacific need to be heard, and this is a brave first step."}, {"id": 106, "text": "Really well put together doc highlighting the corruption &amp; unfairness in World Rugby. Dan Leo does a fantastic job of hosting &amp; leading the charge on a crucial mission for the Pacific Island Rugby players &amp; their families."}, {"id": 107, "text": "Hard hitting piece about the criminal inequality in International Rugby"}, {"id": 108, "text": "Its very sad to see this is such a huge problem. Well done to all bringing this issue to light."}, {"id": 109, "text": "Daniel Leo shines a light on the worldwide exploitation of Pacific Island rugby players in this thoughtful and compelling documentary. The players and their families are merely seen a commodities by established unions. World Rugby is correctly portrayed as a complicit and clearly have no intention of making any meaningful change. A well crafted and informative documentary. Perhaps this will be the catalyst for change?"}, {"id": 110, "text": "Excellent documentary with an insight into the difficulties Pacific Island rugby players face in just trying to pursue a career (a career that is key to the economic model of the islands. Up to 20% of Fiji GDP was from overseas players sending money home). It was the hopelessness of the situation that was stark.even if more money is shared, they face so much corruption from within their own game. The islands are key to the whole game so a must watch for anyone remotely interested in rugby."}, {"id": 111, "text": "Brilliant. Stirs up so many emotions. Shock, anger, disbelief to name a few. Can't believe stuff like this is happening today. Embarrassed to be a supporter of a Tier 1 nation and disgusted by actions/inaction of RFU and world rugby"}, {"id": 112, "text": "Dan's passion for seeing the fair treatment and equal standing of the pacific nations come through in this compelling documentary. It is sad to see the challenges that some players face when making decisions to support their families and villages back on the islands but it is heartwarming to know that guys like Dan are fighting to make a difference."}, {"id": 113, "text": "This is one of the most moving and inspiring sports documentary I have seen. Pressure from the rugby community must continue to help eradicate the hypocrisy from World Rugby. Change must happen to give more support to the Pacific Islanders and tier 2 nations but hopefully this amazing documentary is a step in the right direction"}, {"id": 114, "text": "Phenomenal documentary on the powerhouses of World Rugby keeping the tier 2 nations exactly where they want them. Exploitation of Pacific Island players is rife, given their contribution to the game. Incredibly bold of Pacific Rugby Players Welfare to bring these fundamental inequalities in the game to light!!"}, {"id": 115, "text": "Oceans apart is utterly eye opening. It says a lot about the divide between tier 1 and 2/3 nations and leaves you wanting to do more than just speak about this disappointing situation. The Pacific offer some of the best players in the world and they deserve so much more. Rugby minded or not please give this a watch and make up your own mind on what needs to be done to help develop the game we all love."}, {"id": 116, "text": "Excellently written and produced documentary highlighting the struggles that Pacific Island rugby players go through to play for their country. Highlighted a number of inequalities Island players face daily.Dan Leo was excellent is his descriptions of the struggles faced.Brilliant must watch."}, {"id": 117, "text": "Fantastic documentary showing what life is really like in the Pacific Islands regarding their rugby. They need all the suppose they need so please watch and support"}, {"id": 118, "text": "Dan's powerful documentary uncovers the inequalities in the World Rugby governance holding back the game's progress"}, {"id": 119, "text": "The Pacific Island nations provide world rugby and many of world rugby's elite teams with players of magic. This documentary brings, at last, the inequalities and exploitation behind the Flying Fijians, Manu Samoa and Tonga to the wider public consciousness. Passionately told by those at the coalface, at personal risk in many cases, campaigner and ambassador Dan Leo exposes hypocrisy and corruption at the heart of the international game. This film lays bare the myth that rugby's values set it apart as the true beautiful game."}, {"id": 120, "text": "Being a massive rugby fan &amp; having played with/against my fair share of Fijians over the years whilst serving in the Army. I've always had an interest in Pacific Nations rugby due to their personality, contribution &amp; flair.This documentary highlights how badly treated the Pacific Nations rugby unions are treated &amp; it is not only shocking but a real shame.We should be working with these nations to make them stronger &amp; allow them to be more competitive on the international stage. Allowing a team from the Pacific Islands into Super Rugby is merely a drop in the ocean of what needs to be done.Hopefully some people of real importance high up in the unions see this &amp; make some changes as a result.Off the back of this documentary I would love to volunteer my time &amp; potentially do some coaching in the beautiful Pacific islands."}, {"id": 121, "text": "Dan Leo is a trailblazer. We will look back one day and realize that what he did here moved the sport of rugby union forward. Thank you for dedicating 4 years of your life to this cause!Let's end modern day colonialism in the sport and get Bill Boomer Beaumont and his cronies (Brett Gosper you snickering weasel...) out of World Rugby so the game can actually grow!It's sickening how hard the European powers are trying to hold onto their power. Perhaps they are scared of what the international game would look like if the playing field were even ...Bravo to Dan. Two thumbs up. If you play rugby union or are involved in the game, you need to watch this film."}, {"id": 122, "text": "Rugby is a global, professional game where the richest countries pay their players $30,000 dollars a game and the players who hit the top can make $1 million+ per year to play - not huge in soccer or NFL/NBA terms, but life changing for people in the poorer countries which provide a huge % of professional players: Samoa, Tonga and Fiji. Think NFL without pads and imagine the potential for injury and early life disability - and then think what you'd need to be paid to risk that. Unless you're a famous player, you might even find that your country doesn't pay you and ends up owing you money for leaving your home to tour - and the people you play against on that tour will earn more from one game than your family might see in a year. Daniel Leo's concise documentary tries to get to the bottom of why Samoan, Tongan and Fijian rugby players are treated like commodities to be used and discarded - it has an even tone but it's hard not to feel the injustice and despair of those who put their bodies on the line for their families, but get exploited by almost everyone running the game. A must watch if you are interested in rugby, sport or Pacific culture."}, {"id": 123, "text": "It's not often that a doco hits hard on issues that have been developing for decades. Especially when there is a power struggle and mountain of inertia to overcome.The inequity and one-sided approach by the bigger, more powerful unions is like modern slavery. Treating human beings as commodities, and feeding them crumbs, takes us back to the days of the coliseum.Dan is a visionary and his purpose runs deep. It is clear he wants to create shifts for his people. A must see doco! Rich, meaningful, and progressive. For anyone interested in equity and fairness, to create change in the world, this doco is for you.Mauri Ora!The Maori Mystic"}, {"id": 124, "text": "Having been involved in rugby for most of my life and understanding how the values of rugby can support and develop people through their lives, it was eye opening to see how people in the Pacific Nations are treated at the highest level of the sport. The documentary is a must watch for rugby fans. It shows that there is a lot more for rugby to do to create a true world sport. Where the values of the sport need to be at the forefront and not just some nice words.The documentary does a good job at showing just how many organisations are involved in trying to work through all these issues.I hope another documentary can be made in a few years where positive actions made to address the issues highlighted.It's also got me really keen on watching Pacific Island rugby. I hope their are ways to watch this."}, {"id": 125, "text": "An Amazing documentary a true eye opener. That should be seen world wide. A truely remarkable insight into the reality of International Rugby and the plundering of the Pacific Islands rugby talent, along with the uneven playing field they endure. This situation needs to change immediately World Rugby has a duty of care to all players. This shows rugby's core values to be a joke and it's a disgrace to quote those values before each International game, especially as World Rugby itself is violating its own values. Come on Sir Billy Beaumont step up lead the World in making a positive change for the good of the Game and the good of all players from all nations. I am a 60 year old lady who started watching her dad play rugby for a local town at the age of 5. I was bought up believing in the its values. Now after seeing this documentary I'm ashamed. How can we treat other teams with such disrespect and lack of compassion. One player gets paid thousands and one player gets pounds.!!!!! I can only put it down to greed and corruption. Old boys brigade it's time for you to join the 21st century and step up and put right this travesty. Thank you to all involved in the making of this documentary you are truly brave as is your families. I for one hope to live to see the day when this has been addressed and all teams play on an even playing field with the tools equipment and pay they deserve and need at all levels."}, {"id": 126, "text": "I am so ashamed to say that I have been almost raised to believe that Pacific Island rugby players seek pastures new for the glory of playing for trams such as the All Black's. This documentary really opened my eyes to the harsh reality that the players have no choice.This is hard hitting and many, many issues need addressing and those responsible geld accountable. The game has always taught me the fundamental values it prides itself upon: respect, commitment and fairness. All the while the governing bodies are treating tier 2 teams with the exact opposite.I really hope this changes and will take part in whatever is needed to help do that.On a personal note, as an English rugby player I feel so disappointed in the lack of involvement from the RFU on this documentary."}, {"id": 127, "text": "Dan Leo's documentary provides insightful questions to the situation of Pacific Islands rugby. Calm and balanced, the interviews are open-minded, yet also hold governing bodies to account.The beautiful scenery of Tonga and Samoa really brought the documentary to life, with fascinating local interviewees. The contrast of local facilities with European set-ups was so visually striking.I would also have loved to learn a little more about the situation in Fiji too, but with so much examined elsewhere, I gained insight into the unjust Tier 2 nations system, set up by World Rugby. Watching Brett Gosper squirm out of providing real answers was the highlight of the interviews - summing the entire situation up.Dan Leo has created a great documentary, opening my eyes to the exploitation of Pacific Island players. I have no doubt that Dan will continue pressuring unions and World Rugby to effect change. Hopefully with growing support."}], "reviews_amount": 128}