{"name": "Blackpink: Light Up the Sky", "titleId": "tt13058290", "reviews": [{"id": 0, "text": "I loved Blackpink's documentary so much. It brought me a whole new level of respect and admiration for the girls. Thank you for doing this Netflix . Thank you YG. Thank you BLACKPINK"}, {"id": 1, "text": "Kpop really isn't my thing but this docu has given me insight to what all the fuss is about. The struggles like the genres may be similar across the board but BLACKPINK has such a unique vibe about them and it tickled my fancy. Was it enough to turn me into a solid fan? For now no, but I'm definitely not changing stations if their songs come on the radio and if they have a show I wouldn't mind tuning in either. All the hype by netflix for this docu is justified, enjoyed watching it more than I thought I would."}, {"id": 2, "text": "Just got into BLACKPINK this summer. This doc does a great job showing who they are, where they came come from, and what they are all about."}, {"id": 3, "text": "A great documentary that show their journey from trainee days to today. Good for new blinks who that want to know them better. A lot of surprise clip that we never see. Overall its a good documentary that makes you want more of it."}, {"id": 4, "text": "This is a must watch documentary. Its happy, its sad, its emotional. I dont know what else to say. But im very happy to see them all together like sisters. Bringing stuff for us. This is really inspiring."}, {"id": 5, "text": "Caroline really did a good job in giving us a different point of view of the girls. It showed how Blackpink is not just a band but also a family. It still amazes me how meticulous the process of forming Blackpink and their songs are. No wonder they're huge and global. I can see that they'll be in it in the long run. Also, I liked how they just clicked together as a group. It wasn't forced. Their synergy on screen and off screen are great and I think that's how they work so well together and put off an amazing show everytime. Seeing them work so hard to get what they want makes want to conquer the world myself. They just give you that kind of power after watching them. This was a great documentary for anyone who is really into music. And I mean like real music. And the journey you have to go through is amazing yet very challenging. I would recommend this to aspiring musicians. It gives you that determination to be successful like they are. Good job Caroline!"}, {"id": 6, "text": "I was worried that this would be a promotional, highly curated view into Blackpink's career - but it really felt honest and genuine. The girls show a lot of emotion and don't hide the fact that their job really takes a toll on their health and personal lives. I've never been a Blackpink super fan, just listened to some of their music, but I gained a ton of respect for them after watching this."}, {"id": 7, "text": "They all went through a lot and after watching this I'm much motivated than before, inspired to do well in everything. They are great and worthy to stan i'll never regret supporting them"}, {"id": 8, "text": "One hour 19 minutes not enough for me, if can I want like this every year. Standby tissue when u watching"}, {"id": 9, "text": "This docubis awesome everything is on point. Love it!"}, {"id": 10, "text": "The first thing that comes in my mind is how can someone be sure of what they wanna do in life at such a small age, Lisa being the center her, just at 14 you know what your life should be like. jennie having the most training years, jisoo knowing nothing but exceling in every aspects, rose respecting music. I mean this is so inspiring . This is a huge slap on all the haters, they worked hard and so are here Love you BLACKPINK Also here comes your new fan I m stanning them now yikesss!!!"}, {"id": 11, "text": "Yeah...BLACKPINK is indeed the revolution. I've been following these girls since 2016! The documentary was soo good!! Now i feel like to watching all of their performance videos available on YouTube!:)) I tried my best to hold my tears, but eventually i failed (ofcourse). The direction, editing... everything was sooo perfect! Thanks netflix, thanks BLACKPINK for this amazing documentary!!"}, {"id": 12, "text": "This is the second time i have seen this awesome music title like this after Sky Tour Movie. their visual are so beautiful, 4 members all live very simply and emotionally. I like the way they guide viewers through each level of emotion. Hopefully BLACKPINK will gain more and more success on their career."}, {"id": 13, "text": "New Netflix documentary, brings in 90 minutes a simple documentary, its only challenge is to leave (viewer) stuck on the TV screen, the documentary for those who are already a super fan of Blackpink should not bring much information, but for me it is a very good one for a documentary with a simple idea of introduction the Blackpink group, when the documentary explained the trajectory of the girls without worrying about the time to explain, it was there that i really connected with Blackpink: Light Up the Sky. A competent documentary with your proposal, if it appears in future awards may have a good chance."}, {"id": 14, "text": "Fantastic representation of show business and how to get there through these hard working, beautifully talented women. I was blown away at how hard these girls work for their dreams and fame. I did have moments of frustration watching how they had to separate from their families at such a young age. The women really are extremely loving, caring, devoted, talented pop stars. I have much respect for the hard work and perseverance they endured to reach their goals and stick to them. Each member shared their struggles but they all seem to come together and relate with one another, lovingly. I have to admit, I did cry watching this movie. Great watch if you love inspirational pieces and of course, BLACK PINK!"}, {"id": 15, "text": "Never know how hard k-pop is ..till now I wish these girls find their true happiness after all and be pround of what they doing now. They doing amazing❤"}, {"id": 16, "text": "This is so beautifully made. Props to all that made this possible."}, {"id": 17, "text": "Not really a good delve into the kpop world for non kpop fans, plus i really learned nothing new from this documentary but whatever"}, {"id": 18, "text": "You should try watching this even if you're not a k-pop fan. you'll get to understand the industry, and that k-pop idols are normal humans too, just like us. blackpink has worked so so hard that they now have reached to this point. 79 minutes sure was not enough!"}, {"id": 19, "text": "Was not expecting much, but I ended up loving the girls so much! I didn't want it to end 😩"}, {"id": 20, "text": "Congratulations!!!! Proud blink here!! I'm so proud for blackpink &lt;3&lt;3 Can't wait for more&lt;3CONGRATULATIONS BLACKPINK! YOU NAILED IT!!! I LOVE YOU BLACKPINK!"}, {"id": 21, "text": "I LOVE YOU JISOO I LOVE YOU JENNIE I LOVE YOU ROSÉ I LOVE YOU LISA I LOVE YOU BLACKPINK ......more than anything in this world :')"}, {"id": 22, "text": "Proud of you girls. Blackpink in your areaJisoo Jennie Lisa RoseYour are our lifeline and we will always support you"}, {"id": 23, "text": "I honestly cried hearing the pinks' stories. They've come so far. I'm so proud of them.Thanking netflix for coming up with this. It feels like I know the pinks better now but at the same time I don't."}, {"id": 24, "text": "I really love this documentary! I feel like I am more connected with Blackpink. I enjoyed it so much!"}, {"id": 25, "text": "I love Blackpink so much , they really hard worked and i love this documentary .."}, {"id": 26, "text": "I am a proud fan. Really want to see u guys in a concert. Hope to see u, soon."}, {"id": 27, "text": "Thank you Caroline to shown us the true side of the girls. I am amazed with their journey. Can you imagine 14-15 years old teenager work for 12-14 hours a day and just got 1 day off in 2 weeks? Oh god. I give all my respect to blackpink for their work hard, their amazing Music. I never like KPOP in my life. I am 40 years old and I feel I am too old for KPOP things. But blackpink! Their vibe, their unique, their attitudes, something I can't deny. Good job blackpink 👏💅. God blessed you kids 😘"}, {"id": 28, "text": "If you re kpopers or non kpopers, this documentary represent the struggle of your idol to be become they are today,"}, {"id": 29, "text": "I realized now how far they have achieved. Their awards, popularity, trends, great music are all well deserved. They have come this far because they keep themselves on the ground. They respected each other's artists and companies that makes kpop well known. That's what artists attitude should be like. They respect everyone and acknowledge them. I know this is just the beginning. They will achieve more because of their passion and attitude."}, {"id": 30, "text": "These girls didn't just gave us their music, talents, skills, and what they performed on stage. But what I love about them, through watching this film, they gave us their almost whole story and journey of their life. And that is so genuine. I love how it begins and don't want to end it, that I would rather want to look for more and know more about them. It just gave me the vibes while watching, of that feeling like I almost know them since they started. I was touched and inspired by their authenticity and being genuine of their passion and hardworks. I'm so proud of them. Keep it up and stay healthy despite of your work. Lovelots!💕🤗 By the way, I'm not an official blink but by watching them, can I call myself now like that?😍😘"}, {"id": 31, "text": "I learned a lot from BLACKPINK documentary from here. We understand that if you want to pursue your ideals you have to really stuggle and never give up whatever the obstacles are."}, {"id": 32, "text": "A documentary that is well-packaged by Caroline Suh, apart from me being a BLACKPINK fan, here I see from the side of the audience who doesn't know anything about them. At first, I thought it was like in a documentary that I watched before, I thought it would only make the audience just feel their sadness, but beyond my expectations, Caroline showed their journey which inspired me from their hard works and behind why they worked hard, which made me happy too, seeing that as Jisoo said .. not everyone can be what they want and destined for it, regardless of their job as an idol, but they are so happy when doing it, that's why what they present to their fans is so conveyed with sincere, because they do the work they love, and they like what they do. I think, this can be watched by anyone, from all people, not just for a K-pop fan, because as Jisoo said music is universal, it's not about who .. it's about what they want to convey to listeners. I hope they consistently provide positive content like this to all people. Well done BLACKPINK and Caroline, it's really a blast."}, {"id": 33, "text": "79 minutes become 3 hours when watching this. Pause everytime the subtitle got me mind blowing"}, {"id": 34, "text": "Just finished watching the documentary, loved it! and also happy that this industry is finally giving the chances to female bands as well.Blackpink in your area! Big Big Big fan love... Blinks...."}, {"id": 35, "text": "Beautiful documentary that humanizes and shows who one of the world's biggest and best groups are behind the scenes."}, {"id": 36, "text": "The ending makes me cry when they talk about getting married and having babies. Im not disappointed. STAN BLACKPINK"}, {"id": 37, "text": "The documentary shined most when it got intimate and honestly depicted the inner struggles of the girls. It is inspiring how they persevered for their dream, and continue to push themselves to make music that depicts their passion."}, {"id": 38, "text": "I love how the film look so natural and they just being them self. I thought I know blackpink lot, but after watching this film, I surprised that they went many boundaries in their teenager age. Oh god, they deserve what they have now."}, {"id": 39, "text": "Idk how to describe my feelings about this documentary, the girls really worked so hard to make their dreams come true. At this point, they're really incredible with their talent and also with their music. Jennie, Jisoo, Rosé and Lisa have their own style and character. Thank you Blackpink for exisiting! Keep up the good work!!!! Blackpink is the revolution!! Thanks for being my inspiration!!! We need to make our dreams come true and yes.. Never give up till you make it happen!!! (:"}, {"id": 40, "text": "Feeling really really emotional, this documentary is so amazing, thank you so much for making this, and i hope there will be another sequel because this is just the beginning, right? Lots of love for the girls, and everyone around them &lt;3"}, {"id": 41, "text": "This documentary made me love the girls even more! Witnessing their journey to success is such a beautiful sight to see."}, {"id": 42, "text": "This documentary makes me love the girls even more"}, {"id": 43, "text": "So recomended to watch in case you want to know the struggling of four girls from four different worlds to reach their dream"}, {"id": 44, "text": "Of all the sacrifices and efforts, the hardships, the sweats? It's no wonder they dominate the world now. At 14 I couldn't even commute on my own! While they'll already taking the steps to make their dreams come true.The story is an inspiration to all aspiring artist. Talent is not enough. As quoted by Tim Notke -Hard work beats talent when talent doesn't work hard. and for me that is KPOP. And that's what makes BLACKPINK a killer because they have both."}, {"id": 45, "text": "I know blackpink for only their music, AND AFTER THIS MOVIE I BECOME THEIR SUPER DIE HARD FANS"}, {"id": 46, "text": "I have always been a fan of Blackpink and seeing their documentary made me love them even more. I never knew how much someone would need to sacrifice to become a global Kpop phenomenon. This documentary made me realise that no matter where you're from, your dreams are always valid. I wish Blackpink all the very best for the future."}, {"id": 47, "text": "I like so much, its made me knew that how hard their ways to the high popularity like now. all sadness and hardness can brought them to be crush girl. I believe, they are strengtest girls."}, {"id": 48, "text": "They didn't hide their true selves and show the fans that they are also just like us. Idols are people too. I didn't know I could love blackpink more but then I watched this documentary. It was so real. More please."}, {"id": 49, "text": "I really really liked this documentary. The way they talked about themselves and talked about how their other members helped them in their times of need is amazing. Jennie is usually shy on outside , but always stays well determined inside. Jisoo always takes care of the other members and don't show her vunerable side to others so easily. Rose wants to write and compose songs , but she's so shy about it whether we like them or not. And lastly Lisa , the smallest one of the four and also the stage killer one too. She always creates the positive vibe around her and always motivates others. I loved you guys since starting my graduation , I love guys now and I will love you guys forever. Wherever you are and whatever you are doing , if you ever feeling down or get lost track , don't ever forget that we BLINKS are always stay with you , love and support you Girls 😘💗"}, {"id": 50, "text": "It was so beautiful to witness both the good and bad that make up their story, both the struggles and the successes. 'Light Up The Sky' was incredible and enlightening."}, {"id": 51, "text": "The best documentary ever I really love it BLACKPINK PAVED THEIR OWN WAY I"}, {"id": 52, "text": "Blackpink's dedication and determination really shines through in the light up the sky. They were never going to give up."}, {"id": 53, "text": "A peak behind the curtain of the biggest musical act of this generation... This documentary feels a little bit like an introduction to new fans, rather than an in-depth exploration for actual fans. It is fascinating to see these extraordinarily talented girls, behind the scenes, from discovery to debut to worldwide success. I just wish it had dug deeper. Perhaps that will come in a film a decade from now."}, {"id": 54, "text": "For years i have been Stanning Kpop, BLACKPINK is my BIAS.I really liked this documentary. Their stories can warm your heart and inspire a lot of people to fight and work hard to achieve their dreams. how they got recruited as trainees to how they keep up with the idol life. YOU NEVER KNOW. How they struggle and tears pain,Why do they get so much hate? They worked so hard.their work, dedication, and love for each other that they were able to rise up and become the global stars they are today. Their success journey shows why they deserve this success.THANK YOU FOR NOT GIVING UP,RESPECT. they're the biggest kpop girl group! Thank you for this wonderful documentary NETFLIX, I love Blackpink, and I'd always be BLINK no matter what happens with Blackpink in the future. LOOK UP THE SKY. it's a Bird. it's a Plane"}, {"id": 55, "text": "I just finished watching this documentary and I am in tears! These girls are very talented and deserve everything. I am so proud of how far they've come and will continue to support them till the end! Thank you Caroline Suh for this amazing documentary and thank you Blackpink for sharing your story!"}, {"id": 56, "text": "Why its only a trailer?? How can i see the full documentary video? Anyone here that can help me? Plsss"}, {"id": 57, "text": "Not to compare but as an inspiration that it is not only talent, visuals, good ethics but also endless hard work that makes Blackpink the Queen of kpop and the biggest girl group today."}, {"id": 58, "text": "I will always remember that my youth was accompanied by 4 great girls who have meaning in my life. Thank you for fighting for such a long time. Thank you for not giving up. Thankyou so much! We love you Jisoo, Jennie, Rosé, Lisa"}, {"id": 59, "text": "The only one documentary i watch. kpopers or not you should watch it!!"}, {"id": 60, "text": "I'll be forever proud of these girls! Worth the watch and support. Emotional throughout watching the documentary."}, {"id": 61, "text": "I guess I want more episodes after seeing the documentary. Blackpink makes us so curious about everything."}, {"id": 62, "text": "The transition of this documentary is very well executed. I like that there's a segment where it introduced each member and tells tge story of each of everyone"}, {"id": 63, "text": "We don't get to see a lot of blackpink offstage, and even them talking about themselves. I was surprised to find out I relate alot to Jisoo and jennie, especially to Jisoo. Being the outcast of the family and being called ugly/monkey is nothing to feel good about. I knowing how big in success and how beautiful Jisoo is now truly inspires me. Blackpink are my inspiration and motivation to keep going. I'd would've gone crazy and hurt my self if it weren't for them. I'll forever be grateful to them, I love them so so much. Even more than my own family 🤧."}, {"id": 64, "text": "The story of Blackpink is showed the story of struggles and success. It will enlighten everyone What is K-pop?, How the group formed?, to know them individually and as a group. That even though each has differences they are powerful as group. It also has the relatable things, feeling and thoughts as a person. It's really inspiring, not limited to their industry but to everyone who have dreams that you can make it possible with hard work."}, {"id": 65, "text": "A nice way to learn more about Blackpink! Every member shows who they are and their struggles becoming a star. Worth a watch or two ;)"}, {"id": 66, "text": "The documentary is exactly from what they world needs to know who BLACKPINK in reality are. As the director Caroline Suh said This documentary humanizes the girls by totally tossing away their image of cool, badass and rich and showing the real BLACKPINK - 4 girls with a dream who left their countries and hometowns to do what they love the most - sing. It shows an exclusive footage of their trainee days and personal interviews with the girls opening up about their real feelings and emotions, their bond between each other and the obstacles they needed to go through to be where they're now. Watching this made me admire and feel proud of BLACKPINK even more than before because everything they do is filled with nothing but love and respect for music and their fans."}, {"id": 67, "text": "Very inspiring and motivational movie! It makes you think about how one decision can change your life in so many ways. I liked it because I felt the love, and respect of the girls towards each other."}, {"id": 68, "text": "Everything you could've asked for in a BLACKPINK documentary.Beyond the music, the choreography and the visuals,Jennie, Jisoo, Rose and Lisa reveal their personal struggles growing up as a trainee at YG and living away from home. Through intimate conversations and never before seen pre-debut videos, we get an glimpse of the hard work that happens behind the scenes.If you haven't already, after this documentary...You realize Rose, Lisa, Jennie and Jisoo were destined to be together. They were destined to become BLACKPINK."}, {"id": 69, "text": "It really helps you see the real them and how hardworking they actually are. I love them so much and I'm so proud. I recommend this documentary so much. Please watch it and see the real BLACKPINK!"}, {"id": 70, "text": "A very compelling story about their experiences, struggles to become blackpink."}, {"id": 71, "text": "This documentary will make you feel a rush. Starts a bit squeaky for me, but the transitions and story-telling as it goes on, it gets better, then ends with a very satisfying ending. Speaking as a BLINK, this is what we've been asking for years! You will be very proud of what they've come. Overall, I definitely would recommend this even to non-fans. A watch worth your time."}, {"id": 72, "text": "This documentary showed that it's not an easy journey for the 4 girls that came from 4 different world to achieve their dreams. It gave emotional roller coaster ride, also brings an inspiration, motivation, self-love, and beauty of friendship to me. Definitely not regretted every min spend here. Well done director and blackpink for successfully delivered this amazing story."}, {"id": 73, "text": "This documentary was so enjoyable to watch! It amazed me so much getting in depth with blackpink. As a blink, this documentary was great to watch because i want more people to know blackpink is more than just there success."}, {"id": 74, "text": "Watched it twice and i'll never get tired of watching it. I love the girls so much"}, {"id": 75, "text": "For me personally I have always felt a bond between the girls of BLACKPINK. By that I mean I never put them down because just like many other Kpop groups they've gone through struggles, training, and a point to where they felt they needed to give up. This documentary just shined a light in the shadows that they had hidden away from us blinks. In some sense I feel that I can relate to them because just like us they have emotions and a life that others don't get to see. And seeing them talk about how they struggle made me realize they're human just like us. They're a group of girls trying to make a great change to the world. No matter what as a Blink I'm always going to stick by them. The film made me cry in some parts because thinking about it I'm not ready to grow up and I'm not ready for them to either. In a way I'm not ready for our girls to think about having a life that isn't related to them being BLACKPINK. But no matter what and no matter the decisions they make. I know that forever and always blinks will be there for them just as they are here for us."}, {"id": 76, "text": "A documentary about 4 different girls that happen to create a new atmosphere of music not just in their country (SoKor) but to the whole wide world. This documentary not just focuses on their humble beginning but also how does kpop started being global. What charm does this 4 girls have to be loved by many people, moreover, people who is not into kpop before (like me). They've change my view into this genre. And even though I already watched a lot of videos and blogs about them, this documentary really did gave us blinks an insight on their personal hardships and in depth work etiquette. This documentary really is a bow down from us fans. My love for this girls grow deeper and deeper and as always, so proud of them."}, {"id": 77, "text": "Congrats to everyone who's been part of the documentary! So good!"}, {"id": 78, "text": "This was such a beautiful and well-shot documentary - from start to finish. It captured such authentic moments and showcased BLACKPINK in a soft and natural light. We got to see the real BLACKPINK and I couldn't help but relate to them even more. They were honest and real throughout this documentary. This just proves how hard these ladies had to work (and continue to work) in order to get to where they are today - at the top. I'll definitely be watching this again and I would strongly recommend this documentary to others! It's a film that will make you smile and laugh in one moment and cry in the next."}, {"id": 79, "text": "After watching this I'm falling for them more n more. They motivated me to follow my dreams, nothing is going to come at u easily you have to work hard for it and not give up at any cost. Best part is they appreciated those artists who made k-pop bigger. Their success journey shows why they deserve this success. RESPECT."}, {"id": 80, "text": "I hope more Documentary like this. It was so good."}, {"id": 81, "text": "The story about music, dream, passion and all in between...Its vulnerable but at the same time inspire you to never give up in pursuing for what you truly believe in."}, {"id": 82, "text": "Just wanna say best documentary ever. Felt all the emotion that i haven't felt on these 4 years. Ps i cried alot. Idk i am smaller than them but i felt like proud mom watching their children grow up throughout the video. Just wanna say love you blackpink and always keep the positive energy that you guys have right now."}, {"id": 83, "text": "I truly feel the girls are the best girls fit for BLACKPINK"}, {"id": 84, "text": "For new fans this is a must, this documentary will give you a raw peek into their personal lives. how they were made, how they were shaped, and how they are destined to be the sensational ladies they are today. to not-so-new fans this will remind you why you love and idolize the girls in the first place."}, {"id": 85, "text": "The inspiring documentary movie, BLACKPINK is the best! never forgotten this serving to us, blinks love y'all"}, {"id": 86, "text": "Good documentary that introduce you into K-pop and one of the most successful group"}, {"id": 87, "text": "I'm going to note my own favourite parts or anything that stood out:-At the beginning each member has their own interview. We get to see more of each of them.-I love Rosie's Australian accent so much.-Jisoo gets her makeup done at a shop and asks if she lost her baby fat. The makeup artist says she did and Jisoo says she should eat ramen tonight. She wants to keep that youthful baby look.-Their predebut videos...I've seen them on YouTube and it gives us a glimpse of them before BLACKPINK, when they were children.-Their outfits, particularly the ones in the YG predebut dance practice videos and Coachella looks TOO PERFECT - their bodies look so sexy-Jennie working out and explaining she gets sick easily was insightful.-Jisoo's hair in this one clip where they had a rehearsal looked perfect - so much volume.-Teddy Park looks so cool. He is this cute guy who was a K-pop member. He now produces every song of BLACKPINK's. So talented. He wears a mask in the film.-Lisa speaking Thai sounds just so cool.-Jisoo says it is hard because when they aren't working she feels she should be. When she is her body needs to rest.-It feels like they are being chased - what should we do now after finishing something.-Coachella was perfection. Lisa tells the audience she thinks she will remember this moment for the rest of her life.The girls talk about the reality of being idols. At their last stop on their tour Rosie says she knows they only see what is on stage and not so much of behind the scenes. She tears up and Jisoo dabs all their tears away.These four girls are such good role models. Lisa talks about her concerns about being a good enough role model - she reminisces the first time she went back to Thailand and everyone wants to be her. All the members are so kind...you can see it in their eyes and facial expressions.Another thing I can take away as well is to HAVE FUN with what you are doing. I want to try this with everything I do.One of the members says even if they grow old and get replaced by a younger generation, if ppl remember them and how brightly they shone, that is all that matters. They sit at a restaurant together at the end and talk about what life in their forties will be like. Married definitely, kids maybe. Or Rosie says they can marry later in life."}, {"id": 88, "text": "I was so excited watching the documentary that I was looking forward to it. It is incredible to see that side so human, so vulnerable and so humble of them, that it reflects how BLACKPINK has changed our lives in such a short time. This is their month and they are breaking everything, and that includes all the records they have and to have; her Album is a marvel and is a world trend. And everything they have achieved they have earned precisely these years based on every drop of sweat, tears, effort and teamwork. I LOVE to see them together as the REAL SISTERS, because that is, ONE FAMILY; just as we are for them. That is why I love them and will continue to support them day by day, in every moment, in every place for the rest of my life and I am proud to be a Blink."}, {"id": 89, "text": "This document gets me in tear. It shows the other side of the girls, they work so hard and dedicated their youth to chase their passion. Overall, it is very worthy to watch &lt;3"}, {"id": 90, "text": "Blackpink in your area you all 🗿✌ U must watch dis great show even if u r not blink😇"}, {"id": 91, "text": "This movie make me wanna doing something for mylife. Thanks blackpink, now i knew it, TO GET YOURE DREAMS, YOU MUST WORK HARD!"}, {"id": 92, "text": "GAMAU PULANG MAUNYA DIGOYANGDi Radio Aku Dengar Lagu Kesayangan Mu Kututupi Telingaku Dengan Dua Tanganku Biarlah Cepat Berlalu Dan Kugadaikan Cintaku Kugantungkan Cintaku Yeee.. Kugadaikan Cintaku .... Kugantungkan Cintaku .. Kugadaikan Cintaku ...."}, {"id": 93, "text": "🌟🌟🌟🌟🌟🌟🌟🌟🌟🌟 after watching this blackpink documentary, my love for them reached the buttom of the sea.. :( I can't breathe... they're so genuine and i love how they really love each other like a real family... To: jennie i know your only child but look u have now 3 sisters from another mother. &lt;3 Just stay strong and find the Happiness and Love that u'r looking for .and please stay healthy... we blinks will support y'all whatever happens in the future we're always at u're back guys.. Remember real blinks will never leave blackpink forevaahh!! *hugsss blinks also wants to see ya all get married and have pretty kids."}, {"id": 94, "text": "So so so so so nice light up the sky. I can not inggris and i want say CONGTARULATION ON YOUR SUCCESS🙏🏻🙏🏻🙏🏻"}, {"id": 95, "text": "This was such a good documentary. I felt we could see the girls in other light, and how they were and their true feelings. It made me appreciate the girls so much more"}, {"id": 96, "text": "As a blink for just 1 year this made me cry many times and it really let us see what BLACKPINK really is like, the pre-debut footages made me realize how much I love them. Let's keep supporting them!!!"}, {"id": 97, "text": "Overall good, I got to know them more through this and made me love them too much now."}, {"id": 98, "text": "Shows unseen footage from their trainee days, just how much hard work they have to endure to be at least be able to debut.Shows the synergy, the deep relationship and friendship of the girls.Shows just how raw and humane they can be, being vulnerable and honest with the things that is happening in their careersOverall, gives you in depth of how passionate they are as artist and not just some company robots they perceived to be. And how the hate the girls are getting for being what they are is purely superficial. Because they are more than just a girl group but they are some of the most passionate, hardworking individuals that are lucky enough to be doing what they love"}, {"id": 99, "text": "This documentary sheds a new light how we see blackpink as a group and individually. They started training at the age of 13 or 14 and with no certainty if they will debut but now they are considered as one of the biggest artist in the industry."}, {"id": 100, "text": "I think whats beautiful about this documentary is that even if you're a non fan, you can actually watch this and feel equally inspired and indulged like the fans. These girls (and the people who put work behind) are such ideal people for who have dreams and are passionate about it. Additionally they also show you how a neverending bond can be created between people who share the same passion as you."}, {"id": 101, "text": "Being a blink, this film made me cry countless times, i wish it was a bit longer though."}, {"id": 102, "text": "The best documentary i've seen so far. You can see in their efforts that its not really easy. But its all worth it. 💕"}, {"id": 103, "text": "As a blink, i've got to learn more about them. They showed up their vulnerable side of them and it's hard for someone to do that. So hats off to them. BLACKPINK Jisoo Jennie Rosé and Lisa, i love you and i'll stay till the end. 💖"}, {"id": 104, "text": "It was really great seeing the heartbreaking journey of the biggest girl group in the world. Beautifully directed and the girls themselves are very sweet and humble despite of their global success. An inspiration to young girls all over the world."}, {"id": 105, "text": "After watching this i think i found my confidence to pursue what i want. big hands to blackpink for being my inspiration! i will love you girls forever 🖤💖"}, {"id": 106, "text": "This documentary really makes you appreciate the time, effort and hard work these four girls put into their training. It also shows their determination to succeed and find their feet in the music industry. The blackpink girls come across as genuine, funny and quite frankly, adorable. Rosé's creativity and perfectionism shines throughout the documentary as she shares vulnerable moments of herself in the studio. Jennie, comes across as shy but well spoken. She walks the audience through the struggles she's faced and leaves you with the strong impression that she's a hard worker, dedicated to her craft as well as nurturing those around her. The youngest member, lisa, is a ball of sunshine, not just to her members but to the viewers too. Her smile is contagious but throughout the documentary she portrays multiple versions of herself, first as an exceptional trainee, second as an icon and inspiration to people across the globe and third, the member whose happiness holds the group together and keeps them motivated through difficult times. I was particularly fascinated by jisoo, she's reserved and quiet, Teddy refers to her as street smart. She looks as though she is always observing everyone and constantly thinking, she's careful about what she chooses to share. It's very obvious she cares for the members and supports them. One of my favourite moments is seeing her open up about her injury at coachella, unknown to fans at the time of her performance, and yet she fights through the pain to deliver a spectacular performance. Jisoo, is a person who hides her pain to be other people's strength. What is evident throughout the documentary is the love, strength and unity of blackpink. It's not your ordinary manufactured group, it is far more organic. From their first meeting, they clicked so well and seemed to move as a pack. These four women have now almost spent 10 years of their lives together, and that unity is reflected in their joint desire to see blackpink succeed. A great watch, it's intimate and honest from the start but remains insightful and inspiration until the end. BLACKPINK are truly incredible."}, {"id": 107, "text": "Just being BLACKPINK already has inspired so many people but to get a glimpse of the journey and struggles they had to go through to be here today as one of the biggest group in the world is incredibly heart warming and truly inspiring."}, {"id": 108, "text": "Hats off to the director Sue for showing a side of Blackpink a lot of people needed to see. loved how open and vulnerable the girls were when they spoke about their personal lives. Seeing all the success they have achieved over the past 4 years was worth it."}, {"id": 109, "text": "Must watch!!! to know more about blackpink, they worked hard for this!!"}, {"id": 110, "text": "I enjoyed this show a lot because I got to see the girl's vulnerable and raw side. I always wish that they take care of themselves while doing what they love you know. Because like at the end of the day they are also human and not just BLACKPINK. Through this show, I got to see all that and I am so glad that they are going through this journey together. i hope for more success on there career and just like what jennie have said this is just the beginning."}, {"id": 111, "text": "BLACKPINK ARE THE BEST GIRLS EVER!!! I'd like to see more of their documentaries or even a movie. It taughts us a lot of experiences and encourage viewers to continue on life and be positive always. I love this!! I highly recommend this. Congrats, Blackpink!! 🖤💗"}, {"id": 112, "text": "Amazing, cried while watching the movie, its so good"}, {"id": 113, "text": "So good omggggg i will watch this documentary again and again"}, {"id": 114, "text": "If it wasn't shocking enough with how skyrocketing Blackpinks success is, this documentary really focuses on the hardships they went through as individuals and as a group. Each member has their own story to tell and how vulnerable it was to achieve what they are now at."}, {"id": 115, "text": "These four girls are so talented &amp; amazing, no words can describe my thoughts after watching it, I AM SPEECHLESS. They always spread love and positive vibes to others, everyone around the world were just in love with them. Really love this documentary, get inspired from them, make me know that dreams really will come true if we work for it &amp; dont give up ! BLACKPINK in YOUR AREA 🖤💖."}, {"id": 116, "text": "This documentary shows each of the members ' story,dream,struggles,hopes in their journey of being a female Korean idol group called Blackpink which has gained a lot of fans globally,breaks a lot of records and considered as one of the most successful artists today. However, we can also see the other side of the coin when they tell us their worries and thoughts of their future.It makes us think that behind all the glams, perfect image and cool perfomance that we see on the screen/stage,they are also a human who has insecurities like us. It makes us understand them on a different level of depth not just on the surface. I've been their fan since they debuted until now and will continue to do so for the next 40 years and more. I want to be able to say to them that I've been with them when they shone the brightest and will keep remember them as such even when everyone else thinks that they are not relevant anymore. Because Blinks will keep shining for them like the stars that never fails to light up the sky."}, {"id": 117, "text": "These four beautiful girls inspired me a lot after watching this documentary. I could see how they have been through a lot and how did they grow up. I appreciated and so proud of them that they made a lot of hard-working for their dreams come true. And I also love their relationship with each other and cheering. I wish all of you for all the best and stay shine like stars🙏 I love you so much💕💕"}, {"id": 118, "text": "Thank you BLACKPINK for lighting up my sky. I'm sure that 10 years from now, or even 20, I will still cry watching this documentary.Jisoo, Jennie, Rosé and Lisa, the four of you changed my life for the better, and gave a meaning to it that nothing else did."}, {"id": 119, "text": "Its so heart warming to see they finally let us see their struggle. this documentary just make us see the side of them we never see now i feel more closer to them. after watching this i fell in love with them even more"}, {"id": 120, "text": "The best thing i have ever watched . I am watching this every weekend literally for the rest of my life"}, {"id": 121, "text": "This documentary made me love the girls even more. They deserve everything they have right now. 💗🖤"}, {"id": 122, "text": "BEST. that's it. I dont know how to say but this documentation give you new point of view about blackpink"}, {"id": 123, "text": "I never thought I would love them more than I loved them before. We feel more connected to the pinks through this."}, {"id": 124, "text": "This documentary shows how much effort the members of BLACKPINK put in order to become the BLACKPINK they are now. It's moving and inspiring in a way that these women had their pieces of sacrifices to be where they are at the moment. Heart-warming and as a fan, it relives the early years of idolizing this group. Mad respect to their main producer and the people around them for reassuring the girls all the time. Let's stay together for more more years, BLACKPINK!"}, {"id": 125, "text": "Its such an honor to witness the struggling of four girls in a documentary, thank you netflix for makin it happen"}, {"id": 126, "text": "This is so overwhelming, the girls are amazing. People should definitely watch this."}, {"id": 127, "text": "I love it and i love them people who love them please watch this movie this is very recommended you can see how blackpink grow up"}, {"id": 128, "text": "If you dont understand kpop watch this!! Blackpink is such an incridible, hardworking girlgroup on earth. after watching this i fell like the girls deserve everything in the music or kpop industry, while im watching it i fell like im there with them"}, {"id": 129, "text": "U can see all the journey of this girls. All the pain and then become the happiness. From zero to hero and now a SUPERSTAR. I can't describe how much i proud to them."}, {"id": 130, "text": "This film made me cry, this was a great documentary! :')"}, {"id": 131, "text": "This documentary shows the hardworks of four girls with different background to become this worldwide successful. The story of each members really well-delivered. I got emotional while watching this, some moment you will cry and laugh and cry again.Not only about BLACKPINK, at the beginning this doc shows how big kpop influence to the world. I love how this doc not forgeting many artists that already contributed, even from the very start.This documentary really recommended, although you aren't the big fans of blackpink (blinks) or kpopers"}, {"id": 132, "text": "Very touching . i'm so proud of girls, ma girl... i love u so much"}, {"id": 133, "text": "How many times did I cry when I watch the bp documentary 😭"}, {"id": 134, "text": "I have to admit, I was blissfully unaware of this group for a long time. I only heard about them in early 2020, when they came to US shows and a friend of mine told me he was a massive friend of them. He generally likes many things from Asia (no pun intended) - and I totally get it.Now you get to see how this group was formed .. and how many years it took to get them to where they are now! Reminds me of the stories of the boy and girl bands of the past. These girls/women seem to genuinely like each other. It's not always easy to make that observation or be absolutely sure about it. The road to success can be quite draining ... and hopefully you get lucky to meet up with the right people along the way. Very intriguing story not just for fans of the group, though obviously they are the main focus here ... and you get a lot of the group and its individual members ... how they think, how they feel and what they look forward to ..."}, {"id": 135, "text": "It's a great documentary that shows Blackpink not only as Kpop superstars but also as human beings."}, {"id": 136, "text": "It was really good I can know more about blackpink and the story of every member,it is a good show to watch for the people who wants to know more about blackpink and k-pop"}, {"id": 137, "text": "Blackpink is a special Kpop group. I've got into Kpop since 2009. There're so many memories as a fan of Kpop. I can say as a Kpop fan, I've been through a lot. You can not understand every angles of this film if you're not a Kpop fan. Easily for someone who do not know what Kpop is and why every Kpop group has their own colors, why they act cute with their fans, and what K-culture is_ those judge and think this is a boring Doc. Ok if you want to know more about Kpop, I think it's a little too late now (you should have known Kpop 10 years ago at least), but it's fine, keep searching and learning Kpop then when you're good at it you can come back here and watch this Doc again I guarantee you can find the truth how interesting it is. As an ordinary audience, I can not say this is a excellent Doc film, but I'm happy that I'm a Blackpink fan and I watched this with an automatic smile on my face. I'm so so proud. Blackpink've won many awards but they already won a most precious cup, it's all their fans hearts and mine is one of them"}, {"id": 138, "text": "It is a very nice movie for blinks😊😊😊. They tell us about their hardships,teamwork,hardworks,happiness etc everything. Very emotional,inspiring and nice.If you watch this you can know the real personalities of them and they are very nice. It will make you feel better and happy. Go our queens!👸👸👸👸"}, {"id": 139, "text": "Caroline Suh's 'BLACKPINK: Light Up the Sky' is charming and well-produced (YG Entertainment-approved, of course) but skin-deep documentary confirms what most people already know about BLACKPINK and/or the K-Pop industry. There's no real insight beyond snippets of backstage footage during the group's world tour a year ago and some pre-debut videos. Still a treat for any fan of BLACKPINK though."}, {"id": 140, "text": "I think if you're a fan of this group or music genre you will rate this documentary highly but I didn't find the story line all that interesting nor the back stories of each member. It was interesting learning how manufactured these groups are and I respect the hard work that the girls put in. Would I watch this if I wasn't a fan? Nah don't waste 1 hour and 19 minutes of your spare time, surely you can find something better."}, {"id": 141, "text": "Well I liked it. It was nothing special but not bad. We get the idea about BLACKPINK and their rise towarda fame and all. I'm a huge blackpink fan and I was awaiting for this documentary the moment it was announced. Well it wasn't disappointing but it could definitely could have been better. The individual stories of the 4 stars were well explained but I think that Jisoo had a bit less role in the entire documentary. Rosè seemed like the main highlight here. The documentary does gets a bit boring in the middle but it has its parts. Overall it was an average documentary we learn some new things about the group."}, {"id": 142, "text": "Blackpink is the biggest girl group ever and they are only getting started. Queens of kpop. Beautiful documentary."}, {"id": 143, "text": "A side of them i always wanted to see. I sobbed, i laughed, i felt everything they said. The amount of respect i have gained even more for them and how proud i am of these 4 girls who were just meant to be. i love them with all my heart."}, {"id": 144, "text": "Everything usually put out by the girls is extremely polished, but this is a completely different story. Blackpink: light up the sky is a feast for all the fans who would like to see the girls in a more vulnerable way."}, {"id": 145, "text": "It wasn't that much fun as we expected that black pink is a great musical group but still it's OK."}, {"id": 146, "text": "Getting to know about the entire process like from where the girls started out, their training, monthly evaluations, how they came together as a group and how they debuted was quite amazing actually.We get to see how each one of them started and mastered the skills of singing, rapping and dancing and how they make amazing music and engaging music videos for the viewers along with how they dominate the stage with their stage presence and how they enjoy themselves while performing for us.Then after a little sneak peak into their lives as global stars and how they go on with their daily lives and what they aim for future, shows a side of them that tells us that they are just as normal people as we are but with a little more of that determination and a bit more of that drive with which they were able to achieve what they have and are today.Even though I would have wanted to see a bit more about their world tour and how they dealt with the situations they faced while touring, overall I loved the movie."}, {"id": 147, "text": "First of all, I wasn't a fan of Blackpink or K-pop in general when I watched this. There are a few things about this doc I really liked, but there were also some significant cons.First of all, I really fancied the way they made the members look way less 'perfect' than they are portrayed in other media. You get footage of studio sessions, live concerts as well as footage from their time in training. This made the doc feel much more genuine than I initially expected, and makes it a must-watch for any hardcore Blackpink-fan.Another pro of this film is that they definitely don't glorify the k-pop industry. These very charismatic girls tell many a tale of the insane work-hours and other struggles that they experienced in their training and their touring schedule. I found it quite interesting to hear about the insane training facility these girls were in, fighting against very difficult competition and working 28 days a month for 14 hours a day; for YEARS on end.I missed a bit more of this critical view though. The industry itself is extremely commercialized and competitive, and instead of exploring these very serious downsides of the industry, these are only briefly mentioned. I would have liked the doc to have explored these negatives much more, but i guess that wasn't possible (don't want the production company to get a bad rep). The harsh reality of the K-pop industry shines through the cracks of this documentary on occasion: The girls sitting around after a recording session, them crying on stage because of their homesickness and of course their stories about missing out on so much of their childhood and adolescence.The biggest flaw i had with this doc is that it doesn't really go in-depth on any part of the story, and generally lacked a storyline or purpose. I don't feel like i learned a lot about the K-pop industry, nor do i feel like i really got to know this group that much. This film would have benefited from a much longer runtime. The 80 minutes don't give enough time to explore the many interesting facets of this group and the industry as a whole. We get an introduction to each of the girls, get some recording and touring footage, then, before you know it, the credits are already rolling.Overall, i would 100% recommend this movie to fans of Blackpink or K-pop in general. There is a lot of interesting footage of recording, touring and the chemistry between the girls in general.I believe this movie is much less interesting for people that have no knowledge on the subject. I still enjoyed my time watching it, but there for sure are better music-documentaries out there.Overall i'd score it 7/10."}, {"id": 148, "text": "I really loved the way the members genuinely portrayed their feelings, their deep emotions, fears, insecurities, happiness, euphoria, all emotions. They did not try to portray in a 'perfect' way what is portrayed in other media. You get footage from studio sessions, live shows and footage from your training time. This made the document look much more genuine than I expected and makes it a must-see for anyoneAnother professional in this film is that they definitely do not glorify the k-pop industry. These very charismatic girls tell many stories about the insane hours of work and other struggles they faced in their training and tour schedules. I found it very interesting to hear about the insane training center these girls were in, fighting a very difficult competition and working 28 days a month for 14 hours a day; for years on end.The purpose of the documentary focus on girls!The harsh reality of the K-pop industry with female lines becomes even more exciting. You can feel the emotion, you are made to feel all the emotions according to what you are watching and what really happens to them. Now I am absorbing all the feeling I had, information. There were many and my wish was just to thank the Blackpink girls for making this documentary, the direction and the whole production. It was impeccable. And I wanted BLACKPINK to know that they are very precious and that we love them!I would recommend this film 100% to the general public."}, {"id": 149, "text": "As I have followed other artists (over the years (i.e Britney Spears), their stories and documentaries makes you feel that there's this huge gap or you're disconnected to them which is obvious since they are celebrities. Their lifestyles are just unimaginable and so far fetched. But with Blackpink's documentary I did not feel that at all, as a matter of fact some cases presented are very relatable. They are just normal girls who loves to have fun, goof around, be cringey, do silly stuff to amused themselves and just wants to do their best with their work. They don't pretend to have this extraordinary glamorous lifestyle. It's so different considering they're very young and they don't act arrogant that exudes 'I made it and this is how fast I became famous'. I have followed older celebrities who acts like that which is opposite to BP's way 'we don't get it into our heads'. This documentary shows them as human beings, and personally they are very reserved and values their personal space. It's very deep for them to talk about dreams, passion, reality and struggles. The show humanizes them in a sense that it's really heart warming and something fresh to witness right? Also the way they answer is that they're very articulate of expressing what they think.Also I want to point out their friendship. It's more like a family thing where they don't necessarily need to be bestfriends. They bicker, fight and argue too like sisters. They tease and be savage against each other and also respect individual's time off.I love that they didn't cover too much of their personal stuff and added any drama. They highlighted how they persevered and did not give up from a hellish training and the pressure to meet people's expectations. Their tenacity is extremely one of a kind, you can't just have the fighting spirit without the hardships that came along first. I am so happy for them and all that they have achieved. They deserve everything that they have now."}, {"id": 150, "text": "I was really contemplating about giving a review or not but I felt like I needed to share my opinion as a blink. So here we goes, I wasn't really a fan of KPOP, I swear. Idk why, maybe because I don't understand it. But one time, I was scrolling on Twitter and accidentally saw BP. The tweet was kinda controversial since BP was stopped in the middle of their performance and they were sent home, I think. However, I started stanning Blackpink fully in the year 2018 where they released their hit song D4. It was a cultural reset. Like every neighborhood in the Phil just jammed in that song. And that's the beginning of my fangirl life. But it wasn't easy because BP doesn't released song regularly. Like you have to wait. Lol. Sorry, my back story was so long. Going back to the documentary, I always think highly of BP that I neglect to see or perceived them as human like behind the spot light they were daughters, a sister, and a friend to someone. With this documentary, we learn to appreciate more and accept them as a person who also dream, work hard and sacrifice something to achieve whatever they have right now. And I hope more people see that. And most importantly, Blackpink doesn't only give me music, they gave me an experience I'll treasure for the rest of my life. Lastly, thank you to their director for such wonderful, raw and genuine film. What an eye opener"}, {"id": 151, "text": "This documentary show some of their life before they debut, how they striving to reach their goals, and the fate made them together be BLACKPINK and become what they are today. It is uneasy to let the girls gather and work under a group. In addition, they are all came from the different background, have their own language, different lifestyle and so on. But Jisoo Jennie Rosé and Lisa successful to make this happen. How they work in a group, they always discuss with each other, accept each others and always support each other. Cannot deny why they are become a bigger group nowadays, because their relationship and the vibes is true. The vibes always bring to fans a positive vibes.. Love this documentary so much, being touched about how they chasing for their dream and others member who training with them already choose to quit But they still stay and work hard for it. That is the BLACKPINK we see today. We might not how much the burden they receive during the chasing process, until they debut and today still many of haters hate them without any reason, But BLACKPINK will be legend and Mark down in history for the kpop industry, or can said they totally was Global artist. Their hard work deserves all of the love from us. Go to watch it if you haven't yet... You will be touched by this documentary."}, {"id": 152, "text": "The band BLACKPINK is a female idol created by a sizeable Korean agency. Many people around me have prejudices like instant products. However, anyone who had this prejudice against the BLACKPINK, or even those who did not understand the group, will be a fan of them after watching the documentary and supporting their future. Even if people do not become fans of the band, prejudice against the group will naturally be removed. That may be one intention of Caroline Suh, who directed the film.The film focuses on the growth process of BLACKPINK members. Instead of ordinary girls' lives, Caroline calmly looks at them, who choose a harsh trainee's experience. The trainees could only take one day off the 14th, having to endure a few dance classes and two to three vocal classes for 14 hours a day. It is a system that drops out in the middle after monthly presentations and strict evaluations. The members of BLACKPINK have overcome four years (Rose), five years (Jisoo, Lisa), and six years (Jenny) in this system. BLACKPINK is the first team YG has released in 7 years since 2NE1 Group after fierce internal tests and competition. Each member calmly explains how hard it was and how they overcame it. The piece's highlight was geared toward the band's triumphant performance at the Coachella Music Festival in 2019. After the performance, Jenny says, This was a moment where I felt satiated with our work. Like all those training years were worth it!At the end of the Newsis.com review, New Idol, Human BLACKPINK, Reason for Revealing the World. The life of a colorful idol is not easily portrayed from a blank sheet. It is to raise the light that will light up the world in black, which is broken and scratched by wind waves and pain."}, {"id": 153, "text": "On October 14, 2020, I have seen several times since BLACKPINK: Light Up the Sky was released on Netflix at 3 a.m. Eastern time in the United States. The documentary is currently ranked fifth in Netflix's film category after 1 day. The band BLACKPINK is a female idol created by a sizeable Korean agency. That's why many people around me have prejudices about instant products. But anyone who had this prejudice against the BLACKPINK, or even those who had no idea about the group, will be a fan of them after watching the documentary and support their future. Even if people do not become fans of the band, prejudice against the group will naturally be removed. That may be one of the intentions of Caroline Suh, who directed the film.The film focuses on the growth process of BLACKPINK members. Instead of ordinary girls' lives, Caroline calmly looks at them, who choose a harsh trainee's experience. The trainees could only take one day off the 14th, having to endure a few dance classes and two to three vocal classes for 14 hours a day. Moreover, it is a system that drops out in the middle after monthly presentations and strict evaluations. The members of BLACKPINK have overcome four years (Rose), five years (Jisoo, Lisa), and six years (Jenny) in this system. BLACKPINK is the first team YG has released in 17 years since 2NE1 Group after fierce internal tests and competition. In the process, each member calmly explains how hard it was and how they overcame it. The piece's highlight is geared toward the band's triumphant performance at the Coachella Music Festival in 2019. After the performance, Jenny says, This was a moment where I felt satiated with our work. Like all those training years were worth it!Currently, BLACKPINK is ranked No. 1 on Billboard Artist 100. Since the section launched in 2014, no girl group has made it. Furthermore, all eight songs from their first album The Album are on the Billboard Global Chart 200. The work, BLACKPINK: Light Up the Sky, is not a glorification of fiction without it.At the end of the Newsis.com review, New Idol, Human BLACKPINK, Reason for Revealing the World.The life of a colorful idol is not easily portrayed from a blank sheet. It is to raise the light that will light up the world in black, which is broken and scratched by wind waves and pain."}, {"id": 154, "text": "I CAN'T PUT INTO WORDS HOW MUCH I ADMIRE THESE 4 GIRLS!!! I'm a straight male; I never had to go through issues like ageism, racism or sexism in my life. I can't relate to these 4 awesome girls on those points. But I CAN RELATE to Having a dream, Trying to give 100% to achieve something, Sacrificing whole life to it and being in pure hopefulness with patience. As seeing on this DOCUMENTARTY and other stuff, Of course, I wasn't and isn't anywhere near what these girls have achieved. The Efforts and The hard-work they gave... THIS DOCUMENTARY WAS A ROLLERCOASTER OF EMOTIONS!!!I always loved All the girls from Blackpink: Jisoo Unnie, Jennie Kim, Lalisa Manoban and Park Chaeyoung - also known as Rose. I have Always loved their songs, but what made me follow them, adore them and feel for them and be proud of them was knowing their personalities. They are so pure, hopeful, lovely, cute, pretty in-and-out with confidence of a lifetime. Above all, bright with Determination and Positive Thinking. This Documentary shows us a lot of it; it's indeed a very well executed one at that. As a Blink, I really enjoyed it.As a human being - I'm so proud of these 4 girls, standing for what they want, working their hardest to achieve it and being the powerful girls they are - I have nothing but love and admiration. You girls deserve everything you have! Keep motivating Males and females Around the globe with your awesome work and talent! Keep Lighting up the Sky!!!"}, {"id": 155, "text": "I'm not a BlackPink fan but I enjoyed this documentary. If you don't know about the Kpop industry or you are just starting to get into Kpop then you should definitely watch this. It's very informative with what you have to do to get into the Kpop industry and how hard it is on Kpop idols, the Kpop industry is very different and isn't anything like what you have to do to become a singer in the west. Each Kpop company is different too so it's interesting to see what YG is like. Since I'm not a fan I actually surprisingly liked seeing the journey the girls went though from being kids to debuting!!Good starter if you are only just becoming interested in Kpop since BlackPink are such a popular group, have very different and interesting music and can also speak multiple languages, they are a very watchable group. For any BlackPink fans obviously you're gonna wanna watch this documentary!!Netflix definitely need more Kpop releases!!! Enjoyed this documentary, it's very well made. I do wish they could have put more performances in though but at the same time it's not a concert movie (Netflix get on with releasing Kpop concert DVD's please!!!!) :)"}], "reviews_amount": 156}