{"name": "Folklore: The Long Pond Studio Sessions", "titleId": "tt13524234", "reviews": [{"id": 0, "text": "Folklore will hit different now. I already consider it a masterpiece: the lyrics are perfect, the arrangement is out of this world, and her vocals are more angelical than ever before. But seeing the passion and the talent behind the making process of this album is delightful. I didn't even notice that it was almost 2 hours long because it is so good to watch them talking about the details it has. Thank you for showing us what is like to really create a body of work from scratch and turn into one of your best albums to date, if not the best one."}, {"id": 1, "text": "Talented, brilliant, incredible, amazing, show stopping, spectacular, never the same, totally unique, completely not ever been done before"}, {"id": 2, "text": "Amazing, I really adored the way she explained what went through her head when she was writing a song. Its like seeing how a masterpiece is made"}, {"id": 3, "text": "Don't have anything bad to say bout this...just...my tears ricochet destroyed me"}, {"id": 4, "text": "Ended Mustin , Kanye , Kim , Hailey , Scootrat...One of her best album"}, {"id": 5, "text": "Her voice was so raw and beautiful i'm in love also thank u joe alwynps i hope taylor and joe didn't eat meredith"}, {"id": 6, "text": "This entire session is an enthralling, jaw dropping, ethereal experience! Her soul soothing voice just makes it even more better"}, {"id": 7, "text": "Such a beautiful film and it perfectly filmed on how they're explaining every inch of the songs from folklore. Taylor Swift once again proving she is one of the greatest songwriter of all time. She sounds angelic and incredible! It's highly recommended"}, {"id": 8, "text": "Speechless! Masterpiece. Deserved more awards! Buy. folklore on itunes stream it on spotify"}, {"id": 9, "text": "Was not interested in folklore at first but after seeing the movie, I listened to folklore twice. Easily my favourite album of TS. Worth the time😍😍😍"}, {"id": 10, "text": "This entire in-studio session was an amazing mesmerizing experience. I'm a sucker for acoustic performances and miss Swift did not disappoint."}, {"id": 11, "text": "Ever since folklore released, I've been wanting an intimate live performance and behind the scenes of every song and this movie is exactly that. Taylor's vocals are AMAZING and the way they explained every track made folklore even more special to me. This album is a masterpiece and is one of my all time favourites. I'm so glad the movie was just as good. Its definitely worth the watch if you're a fellow folklore enthusiast!"}, {"id": 12, "text": "I love the way she explained all these songs, how she made them, what are the meanings behind those every song, it makes every songs are more enjoyable and it's so calming to listen her sing them live. Love it."}, {"id": 13, "text": "This is an amazing, raw, unfiltered and intricate side of Taylor's songwriting prowess. Definitely one of the best songwriter and artist of our time. A huge respect."}, {"id": 14, "text": "This film really gives you a deeper and more comprehensive understanding of the mindset taylor was in while creating this album and how it all came along. And the revelations are really interesting as well 👀"}, {"id": 15, "text": "I like it so much. She's so talented :) I love her"}, {"id": 16, "text": "Name another artist this generation who can write like this. Deserves album of the year I don't care."}, {"id": 17, "text": "It's so aesthetically pleasing, it's always amazing to get to know the stories behind the songs and what was the artist thinking about when they made it. Taylor vocals were flawless and Aaron and jack production were amazing, i enjoyed it so much."}, {"id": 18, "text": "When we all thought folklore is what we needed during this hard time, little did we know Taylor's stripped down performance of each tracks on her latest album can be so calming. I enjoyed watching this film very much."}, {"id": 19, "text": "I think we all kinda needed this, not cause the studio version is boring now, but, there's a kind of deep human connection to live performances. She is by far one of the best performers and storytellers out there."}, {"id": 20, "text": "Such an intimate moment, amazing performance, the raw emotion, and the story behind it. Truly a genius artist and musician."}, {"id": 21, "text": "Wow!! Still my mood is sinking in and awestruck after watching Folklore on disney plus. Its an ultimate masterpiece and just feeling the vibes it has created. Taylor Swift is a musical genius blessed by god. Cheers to aaron dessner and jack antonoff for bringing out such an album.I just loved the way Taylor Swift waves her hand while singing the line meet me behind the mall during performance of August song.. It was damn cute to watch!!"}, {"id": 22, "text": "Therapy isn't necessary when i can just face plant on my bed and scream while folklore is on repeat in the background. stream folklore, besties. &lt;3"}, {"id": 23, "text": "The album songs sounded soo good, and it was soo pleasant to understand the story behind each song. Loved it miss swift"}, {"id": 24, "text": "Masterpiece album, beautiful context, beautiful and delicate."}, {"id": 25, "text": "I love this movie that Taylor has gifted us. She explained the little details and background of each song on the folklore album.A great insider look to the genius mind of Taylor Swift and making of the folklore album. I signed up for Disney Plus just to watch this movie. 😁"}, {"id": 26, "text": "Totally astonished.I can't believe Taylor songwriting creation level is on another level.She can do whatever she wants with her guitar.She doesn't need to prove she can do as a lyricist,composer,producer,singer,director anymore.Literally this album've already proved she is more high level than any her peers"}, {"id": 27, "text": "She is amazing. This is by far and without any discussion her best body of work. Deserves Grammy Album of the year. The lyrics are so welk written."}, {"id": 28, "text": "Taylor Swift sings and explains every track of her brand new album folklore with her collaborators jack antonoff and aaron dessner. I already knew that folklore (written during the first lockdown) is one of the best musical project of this year, but this film made me appreciate it even more. Definitely recommend!"}, {"id": 29, "text": "It is a very fascinating film that showcased the artist's talent very well. It's very meaningful and every minute is simply breathtaking."}, {"id": 30, "text": "Only Taylor Swift can make a documentary with only three people And you enjoy it"}, {"id": 31, "text": "Greatest artist of all time? Maybe. More albums like folklore please."}, {"id": 32, "text": "Her voice matured so much since fearless and speak now *--* Folklore shows again why Taylor is one of the best songwriters of her generation. The lyrics is hauntingly beautiful, and of course the amazing production of Aaron Dessner and Jack Antonoff.Masterpiece."}, {"id": 33, "text": "All the lyrics start to make sense on a different level after listening to the backstory of each song."}, {"id": 34, "text": "At one point she talks about poets that escaped their burdensome existence and lived in cottages around a lake. In some ways, this intimate insight into the creation of a very personal album achieved that and more. Everything that made this strange year to happen was beautifully poured into seventeen songs that offered hope when I needed it the most."}, {"id": 35, "text": "Taylor Swift is one of the greatest songwriters of all time and getting to hear her explain the inspiration behind these genius songs is an absolute treat. And her chemistry with Jack and Aaron is so fun to watch. So cozy and such a wonderful thing to watch during the holidays."}, {"id": 36, "text": "She's the greatest of her time. I was really impressed with the other collaborators as well. They all fit together perfectly. This is one of THE greatest albums of the 21st century. Seriously, who even comes close right now? I had chills during the entire show."}, {"id": 37, "text": "The way this film make me love even more folklore and taylor!!!!! omg is everything we all need in this time. thank you taylor"}, {"id": 38, "text": "Ahhh. I thought folklore couldn't get any better until i heard this.!!! MAGICAL!!!"}, {"id": 39, "text": "I live for these acoustic performances. Taylor, Jack and Aaron are literal musical geniuses."}, {"id": 40, "text": "Oh my god. I had No idea this film was going to be sooo beautiful and interesting and most of all ear and eye pleasing. She is a true artist. This shows her capability. Amazing. No words"}, {"id": 41, "text": "This album is the perfect one for a stripped down instrumental performance. What are you waiting for?"}, {"id": 42, "text": "This feels surreal. This studio session surpassed the original version. Justin's voice make my bussy go WAP plus they're like bacon and egg on exile.exile, august, my tears ricochet, cardigan &amp; peace are my faves."}, {"id": 43, "text": "I always loved Swift's storytelling, but with the AOTY nominee folklore she is really going on another level"}, {"id": 44, "text": "Taylor really encapsulated so many emotions in her album. The doc is such a great insight of the process and her ideas. The vocals snapped but the dynamics between the writers and producers etc is just so special. Truly an experience✨"}, {"id": 45, "text": "This movie tells us why folklore is the album of the year and one of the finest works ever to exist. This movie gives an insight to how genius and artistic Taylor Swift is and why she deserves all the success."}, {"id": 46, "text": "Good job taylor. just kinda bummed that cruel summer was never played live but anyw this is so therapeutic for me thank you"}, {"id": 47, "text": "Taylor's vocals are just insanely amazing + the meaning behind all the songs... This is just perfect, I have no words."}, {"id": 48, "text": "Folklore is undoubtedly the best album of the year, is shocking, beautiful, sad and full of mystery that needed to be talked about in a documental like this one. Even though you haven't heard the album, it's awesome to discover each song alongside Taylor, Jack and Aaron 's stories. Finally, Taylor, please don't ever stop making music...because you showed us colors you know we can't see with anyone else. Congrats."}, {"id": 49, "text": "I don't know about you, but folk has a great value in my life. folklore, the album contains songs that carries stories, even perspectives. So when you get to know the reason behind those stories, it gives you goosebumps, leaves you shoked. So for a ride like that with Taylor Swift's melodious voice and her amazing songwriting skills, watch this session. Highly recommended"}, {"id": 50, "text": "I didn't even start watching but i know how its gonna go."}, {"id": 51, "text": "Taylor Swift is not a very interesting person, but folklore is a really great album. Take that as you will."}, {"id": 52, "text": "The album was more than enough, but then Taylor Swift made us even more happier by bringing this. I was speechless when I saw this, still am."}, {"id": 53, "text": "Truly stunning,such an amazing album, being a huge national fan and Taylor fan this is beyond expectations."}, {"id": 54, "text": "She sounded amazing and everyone was on point! It was fun and great seeing all three of them together playing music!"}, {"id": 55, "text": "Taylor's album is amazing, this documentary made me like the album even more, she was very perceptive about the documentary, I'm sure many people liked the album watching the documentary or will like it as soon as they see it. No doubt it's one of Taylor's best albums."}, {"id": 56, "text": "What an incredible movie. Seeing Taylor, Jack and Aaron talking about the process of making this stellar album was great!"}, {"id": 57, "text": "There are no words to describe taylor's brilliance and writing, I had a few good cries"}, {"id": 58, "text": "💯Because this is very perfect album, especially this year so much bad happen, and Taylor Swift change my preference for worse Year to Unforgettable year for releasing an incredible album Love You Taylor, and thank Joe Alwyn aka William Bowery for making her Happy"}, {"id": 59, "text": "Beautiful. She's incredible. Folklore is the best album of 2020 and noone can argue about that."}, {"id": 60, "text": "Probably one of the best concert film she made. They explained how the songs on the album was made, Taylor sang the songs one ny one, and the ambience of the movie really felt like you're with them."}, {"id": 61, "text": "Love it. Love it. Love it.In all my years of being a Taylor fan, honestly I never imagined her work could or even needed to get any better. But man!!! Did she prove me wrong.She is good. She is really good. She is great. A living legend.This film is raw, to the core, touch your soul kind of amazing. Taylor like you've seen her before, at her greatest, but better. If that makes sense.# Grammys Album of the year......"}, {"id": 62, "text": "This is my very first review ever and I had to write it, not because I have the illusion that I can capture with words the sense and magnificence of this album but because I feel humble and in awe that I' am able to sneak into Taylor's brilliance, even in small snippets. A truly inspiring artist and a beautiful human being."}, {"id": 63, "text": "I didn't think I could love this album anymore, but these live performances have given me a whole new appreciation for it. Taylor (and Justin!) sound amazing and I was almost moved to tears for certain songs. Had goosebumps nearly the whole way through. It was also really special to hear about the story/process behind every song; this is obviously such a personal album to Taylor, and yet one that manages to simultaneously be so relatable to so many people. This is her best work and she should be incredibly proud of it. Really recommend this film to anyone who's a fan of Taylor, or a fan of music in general. Hearing them talk about how the album came together is magical, and I will probably be rewatching this over and over again."}, {"id": 64, "text": "Something above great. From the very start to the end it was so great"}, {"id": 65, "text": "As I'm in my mid 40s it's not surprising I've bever been a fan of taylor swift before but the whole album is so calming, poetic, and beautifully written. The film itself is so emotional and exciting. Reccomended to everyone!"}, {"id": 66, "text": "Every song on the album Folklore got explained very well, the story behind it makes this album more than just crying to the songs, but more to the story behind it."}, {"id": 67, "text": "If you want me to keep my food down during a holiday don't put on a Taylor Swift special. If you want me to keep paying $7 a month for Disney+ instead of pirating it for free. Keep putting Taylor Swift specials on and see how quick I cancel my subscription."}, {"id": 68, "text": "I loved every second of it! I love the way she has gone out of her way (again) to bring us Swifties an album during the era of COVID-19. Taylor Swift is one of the most talented artists in the world and everyone should give folklore a chance. 🖤"}, {"id": 69, "text": "Actual hipsters let Taylor Swift pretend to be as profound as them ... and by the end, through their generosity, you see Taylor in a new light. Their chemistry materializes slowly as well, which is true to life. Take the song with the guy from Bon Iver. I've always enjoyed (and made fun of enjoying) Taylor. But Bon Iver feels more substantial and artful. But the guy works with her on a track, which feels like a condescension (but he doesn't act like it, because he's a gracious person). And then she hangs, and I see a new and exciting potential direction for Swift in the next decade. Her lyrical fun is still there, but with a bit more imagination and - oddly - depth. The collaborators eyes seem to glaze over occasionally, but therein lies their transformative generosity."}, {"id": 70, "text": "Whether you're a Taylor fan or not, this storytelling is masterful. Even if you leave out the soul-stirring songs and meaningful lyrics, this film accomplishes something we've not seen since in our generation's most trying times of wars, uncertainty, cultural and racial division. It jerks us awake to the fact that we, together, are living in one of those dire climates with COVID. The Vietnam War had Dylan to peel back our humanity and think about peace. John Lennon, too, lays bear how we really should treat one another.In that caliber, and perhaps born from desperation, Taylor Swift invites us to be a part of this experience with other artists who collaborate. A part of this moment in history. In isolation, she manages to look further inward and blossoms an idea to turn a vulnerable situation into a new-normal discovery.At the same time, she distinguishes herself yet again as a pure song-writer and artist. There's little doubt that other artists will re-think their true purpose for music creation. Shouldn't all artist be driven to create for the sake of the art, and less about the business motivation. Wouldn't that be nice. This is what happens when you remove the ego and affluent side of the process and bring back simplicity, purity.The ensemble of song and phrasing leave you with a lasting impression that there are others who are experiencing what you are going through. That's powerful. And that's enduring.Taylor Swift is a rare gift."}, {"id": 71, "text": "Folklore, the 8th Taylor Swift's album, surprise-released on July 23rd, is a already a critically-acclaimed record and the longest-running number 1 album of the year (8 weeks). Besides that, her work was most notably praised by her six 2021 GRAMMY nominations, which proves artists longevity and high relatability during the time of the global pandemic. With this release, Swift took her songwriting and singing skills to the next level, by recording a full-length film, which consists of a live performance of all 17 tracks, a short talk about the writing process and overall album recording and most importantly, a discussion about every song on the album between Taylor Swift and one of the writers. The live performances truly show the beautifulness of Swift's voice accompanied by a few instruments. The production also reveals the enigmatic process of recording an album during the pandemic. What's most fascinating and absorbing, is the explanation made by Taylor and either Jack or Aaron (or even all of them), track by track, right before each performance. They show the viewer the other side of those rich and meaningful lyrics and also encourages to dive even more deeply into this body of work. In conclusion, this films shows the viewer a new perspective on the album and its diversity in lyrics. It also provides a deep insight into the album-making process during the pandemic, which adds a sense of mysteriousness because of its unusuality. Because of that this film deserves its appraise."}], "reviews_amount": 72}