{"name": "321 Action", "titleId": "tt13423846", "reviews": [{"id": 0, "text": "Idk why they didn't invest that money on something else like opening a grocery or even a car wash so they can wash there cars for free instead of making a cringe movie with the most cringiest actors ever!!!! U will feel the disgust and dive deeply in the cringe ocean when u spent 10 seconds watching that thing... i don't even know if I should call it a movie."}, {"id": 1, "text": "Boooooo boooo boooo booo obooo literary trash. the worst movie ive ever seen in my life. I just want to... u know erase my memory or back to the past to change my decision."}, {"id": 2, "text": "Its a bad movie dont even think to watch it........."}, {"id": 3, "text": "I think social media celebrities should never go acting. This is so ridiculous!"}, {"id": 4, "text": "The actors are gathered from Friday Market. Each actor says i am more trash than the other. Save your eyes from this pollution."}, {"id": 5, "text": "At first the cast crew need to learn the basics of acting because if i brought someone from the streets he'll act way more better than them. And the director, writers, also the guy who buy them a coffee should be ashamed for helping to produce this disaster."}, {"id": 6, "text": "If your want to die see the movie 👎🏼👎🏼👎🏼👎🏼👎🏼👎🏼👎🏼👎🏼👎🏼👎🏼👎🏼👎🏼👎🏼👎🏼👎🏼👎🏼👎🏼👎🏼👎🏼👎🏼"}, {"id": 7, "text": "This shouldn't exist its just a waist of 3.5 million dollars"}, {"id": 8, "text": "Because it doesn't EXIST!! Lord have mercy on whoever bought a ticket"}, {"id": 9, "text": "Why did his parents not go to sleep that nigh? . . . ."}, {"id": 10, "text": "If you want to punish yourself, continue the movie"}, {"id": 11, "text": "This is the worst movie I ever saw. Very very very bad"}, {"id": 12, "text": "Don't watch this for your own physical and memtal health"}, {"id": 13, "text": "I rated it1 star, if their is minus rating I would do it anytime anyplace."}, {"id": 14, "text": "I would never recommend this movie even to my enemies"}, {"id": 15, "text": "The first step to make a good movie is to choose good cast , Saudi Arabia has so many great actors and actresses to represent it in cinema , I believe that Bandaritta would do it much better than those socks ."}, {"id": 16, "text": "Please stop this chaos. each what we see is chaos . ans not related for our art and our custom . celebrities of clowning on social media are leading the scene in Saudi cinema ... this is a shame, nature and realism"}, {"id": 17, "text": "Bad movie I do not recommend it They are not actors"}, {"id": 18, "text": "If you read this I wanna give you this advice, save your money and spend your money on something else but don't even think to spend one SR to watch this movie. To be honest, even if they will pay me to watch this movie I will refuse."}, {"id": 19, "text": "It's the worst movie ever in the world 👎🏽 Don't ever repeat my mistake by watching it"}, {"id": 20, "text": "Bad work, bad directing, not supposed to be shown in the cinema"}, {"id": 21, "text": "Whoever wants to become blind and depressed and try to commit suicide must take the risk and watch this mean movie"}, {"id": 22, "text": "Most of the social media celebrities are a bubble Save your time and money"}, {"id": 23, "text": "This movie is not worth spending not even a cent onif they paid me money to watch it id still refuseif you're famous id doesnt mean you can act or make a movie there's only one way i can recommend this movie is if you having trouble to sleep or insomnia its a good way to put you right to sleep but be careful you might get nightmares"}, {"id": 24, "text": "The cast is the worst I've ever seen so of course the acting is the worst acting of all time , the writing is horrible absolutely horrible there is literally literally nothing good in this bad excuse for a movie you all should be ashamed to make this garbage and call it a movie every thing literally sucked save your mental health and don't even consider watching this trash even to see how bad it is just don't it's not good for your money, health, eyes."}, {"id": 25, "text": "Collecting social media influencers and film them together wont make you a producer!"}, {"id": 26, "text": "Oh my god , it's one of the worst movies in the history if it's not the worst"}, {"id": 27, "text": "Ma tab3t alfilm bs wa9'7 anh z8 mn almmthlen ( m3lesh ani katb k4a bs 3yal alklb mo msmo7 tktb 3rbe )"}, {"id": 28, "text": "Be careful don't watch the movie u could kill yourself rather than watching this cringe movie"}, {"id": 29, "text": "This movie is a CRINGE i can't believe that this was on cinema"}, {"id": 30, "text": "The worst moive and the category should be different it horr moive for the cinema"}, {"id": 31, "text": "Is boring movie and is old idea bad actors No more comment"}, {"id": 32, "text": "Celebrities are the worst in acting. They must throw this movie in the garbage."}, {"id": 33, "text": "Stay safe DO NOT watch this if you care about your health."}, {"id": 34, "text": "Nothing in this movie deserves your time,Just feeling sorry for the time i wasted 😭"}, {"id": 35, "text": "Maybe you are one of those people who like torturing themselves!"}, {"id": 36, "text": "One of the most horrible movies ever I will never ever see it again"}, {"id": 37, "text": "Do not waste your time or your money with this film. All of them are social media influencers with zero knowledge about film and cinematography."}, {"id": 38, "text": "Amateur acting. Disastrous writing. Weird scenario. Literally everything in this movie was disgraceful. I felt embarrassed through watching this garbage. I apologize to the Saudi cinema on behalf of the director and the cast... I feel ashamed"}, {"id": 39, "text": "How can they be allowed to film and selled in cinemas .."}, {"id": 40, "text": "Just sucks trust me don't think Watching It pls for ur self"}, {"id": 41, "text": "Actually to be honest the movie deserve -10/10 The actors are amateurs, just amateurs."}, {"id": 42, "text": "Wasting time and money to see such as movies like that. Very bad with Dyler and others like him."}, {"id": 43, "text": "Very very very bad I feel disgusted looking at the actors"}, {"id": 44, "text": "Don't even think to watch it hahaha I don't like it"}, {"id": 45, "text": "I'd rather watch paint dry. So bad, and Dayler is the worst actor ever and believe me when I say eveeeer. I've watched more than 10000 movies and I've never seen such bad acting. The director should sell fish in the fish market, not directing movies."}, {"id": 46, "text": "This Movie Is So so Bad, Don't watch this movie and waste your time"}, {"id": 47, "text": "This movie is nonsense This movie is nonsense This movie is nonsense This movie is nonsense"}, {"id": 48, "text": "Tbh, I haven't seen the movie! I'm just judging by their faces on the poster"}, {"id": 49, "text": "It is ridiculous that this movie costs 13 million riyal to make"}, {"id": 50, "text": "We are in 2020 and this movie let you know we are 1950 with those actors"}, {"id": 51, "text": "Pathetic acting, i am sure they brought the director and the actors randomly from the streets"}, {"id": 52, "text": "Maysa Mughrabi is a great actress, but she chose the worst people in the world for this movie 👎🏻👎🏻"}, {"id": 53, "text": "There are no actors and actresses, and there is no new story. I think social media celebrities, some of them do not have the talent for acting. Movie story is expendable. The basis of the success of any film is the choice of a story, an actor and a director that makes the viewer pay a ticket to watch the movie."}, {"id": 54, "text": "ITS NOT THAT BAD IF YOU'RE BLIND OR DEAF OR BOTH, 3 OF MY FRIENDS HATED IT AND ONE OF THEM WATCHES ANIME"}, {"id": 55, "text": "Booo obooo literary trash. the worst movie ive ever seen in my life. I just want to... u know erase my memory or back to the past to change my decision."}, {"id": 56, "text": "Every thing about the movie is bad, especially the cast that they have chosen"}, {"id": 57, "text": "👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻"}, {"id": 58, "text": "I don't need to explain look at the cast, bad wouldn't begin to describe this catastrophe"}, {"id": 59, "text": "A movie that is not worth watching at allNobody knows these actors"}, {"id": 60, "text": "The name of the movie says a lot. i'd prefer to see trump naked than to see this trash"}, {"id": 61, "text": "The movie and all cast is garbage. Don't lose your time"}, {"id": 62, "text": "The movie was very bad. I was alone in the Saudi cinema"}, {"id": 63, "text": "The worst movie in history, the worst actors in the world, damn them"}, {"id": 64, "text": "A group of unsuccessful fools 👎🏻👎🏻👎🏻👎🏻👎🏻"}, {"id": 65, "text": "It's just so bad! even if you want to waste your time with anything don't watch it."}, {"id": 66, "text": "Chdudiduufudufufuffuufufufufufufuufifififififififiifififif"}, {"id": 67, "text": "I need to give this movie 0 out of 10 if possible, but 1 will do for now. Oh and BTW, I never watched the movie. No plans to waste my time on this disaster."}, {"id": 68, "text": "I'd rather watch SpongeBob than watch this bad movie"}, {"id": 69, "text": "Terrible scenario terrible dialog and most importantly cast Unbearable performance. Thats what you get when you cast a bunch of ridiculous so called social media celebrities"}, {"id": 70, "text": "This movie is very Zabbal Daylr is zabbal Cast are zabbalin"}, {"id": 71, "text": "I only watched the beginning and it was so bad I didn't even could watch the rest of it"}, {"id": 72, "text": "What a just saw is a garbage , i want a refund of my money"}, {"id": 73, "text": "Hahhahwhgghhhhzhhzzhshshsbsbs sndhxudususususushshsbsdbbeebwb"}, {"id": 74, "text": "The worst thing I have ever seen, the actors are ****** , it will be better if you watch cartons more than this shot"}, {"id": 75, "text": "If there is less than a star I would rate less. It is TRASH"}, {"id": 76, "text": "The worst movie I've seen in my life💩💩 Don't waste your time and money🤒🤒"}, {"id": 77, "text": "This movie is a joke,also it deserves Razzies Award"}, {"id": 78, "text": "It's bad movieVery bad movie, I wasted my time watching it"}, {"id": 79, "text": "It's garbage and the cast don't know how to actSave your money and your time"}, {"id": 80, "text": "The cast 👎🏼i wanna clean my eyes after watching The movie"}, {"id": 81, "text": "This movie is very baaaddddd 😭🤢🤢🤢🤢🤢don't see this movie for your life"}, {"id": 82, "text": "Truly i can't find words to describe how worse these movie is , its just like to open the rotten garbage with a nasty smell and u cant close it before of the pollution air comes from that garbage and thats air could kills you if you stay just a few seconds around it"}, {"id": 83, "text": "Man i would rather bleed to death rather then watch this movie"}, {"id": 84, "text": "There is more movies deserve your time (I know my English is bad ;)"}, {"id": 85, "text": "If you want Punishing your self go to see this ridiculous movie"}, {"id": 86, "text": "Unlike the room this movie isn't watchable not even for laughing at the poor acting"}, {"id": 87, "text": "Hideous action , writing , directed poorly, one star is way good for it . What a joke!!"}, {"id": 88, "text": "You know those types of movies/shows you want to forget so you can re-watch them and enjoy them? well this movie you will wish you could forget it and never watch it again"}, {"id": 89, "text": "Social media celebrities should never go act in movis ever all the cast are ao bad its waest of time"}, {"id": 90, "text": "If you want to punish yourself, watch this movie......."}, {"id": 91, "text": "They gave me money so I gave them 1star hnmnmnmnmnmnmnnmnmnmnmnmnnmnn"}, {"id": 92, "text": "Do not watch this movie unless you wanna punish yourself.This is waist of time and money."}, {"id": 93, "text": "How in earth these are actors?! Just stop it , many people don't watch you in social media that is free , why would they pay to watch you now?"}, {"id": 94, "text": "I fall asleep during this boring show. I recommend to anyone who's planning to watch the movie is to stare at a wall. Literally the movie is so boring and the act is so cringey"}, {"id": 95, "text": "Trash and trash and trash and trash and super trash"}, {"id": 96, "text": "I didn't see the movie, but everyone is evaluating the movie as a star, so I rated his star on what they said with the blond horse haah"}, {"id": 97, "text": "I'm so sad i can't rate this zero.. i rate it one witch is tooooooo much for such a movie.."}, {"id": 98, "text": "When you want hate your life just watch it When you want hate your life just watch it When you want hate your life just watch it"}, {"id": 99, "text": "Don't watch it it's the worst film I've ever seen Waste of time and money"}, {"id": 100, "text": "This movie should win a reward (the worst movie ever made)"}, {"id": 101, "text": "This is the worst movie in the history its literally trash oh fk I'm so regret and I feel bad to my 2 hours that i lost it from my life to watch this fking movie. My will to my son is never ever watch this movie. I can't stop cursing this fknig movie just don't watch it period."}, {"id": 102, "text": "Its one of the worst saudi movies, save your money and your time ."}, {"id": 103, "text": "The movie was so bad that they had to give me a free ticket to watch it"}, {"id": 104, "text": "Seriously,, Snapchattes doing films now?!!! Most of the cast is trash celebrities : /"}, {"id": 105, "text": "Very or tide🤣🤣🤣🤣 anyway really its so so so bad"}, {"id": 106, "text": "Very baaaaaaaad Very baaaaaaaad Very baaaaaaaad Very baaaaaaaad Very baaaaaaaad"}, {"id": 107, "text": "This movie is bad that even my eyes start burning after watching it"}, {"id": 108, "text": "IMDP, please avail a zero rating as an exceptional case for this"}, {"id": 109, "text": "Baaaaad af dont waste ur time !!!! Worst movie ever seen"}, {"id": 110, "text": "Nothing in this movie deserves your time,Just feeling sorry for the time i wasted 😭"}, {"id": 111, "text": "Cinema is not just money. You have the worst and the passion of the world."}, {"id": 112, "text": "Very very very bad I do not recommend it Repeated repetition of the morbidity"}, {"id": 113, "text": "One of the worst movies!!!!!! no no no don't think big no If there is less than 1 I will rate it."}, {"id": 114, "text": "I wasted my time watching this boring movie 1 hour and half of wasting time"}, {"id": 115, "text": "It's horrible to watch even the trailer!! MY EYES!!!"}, {"id": 116, "text": "Do you want to sleep??? Just watch National Geographic"}, {"id": 117, "text": "This movie is a disgrace to movie industry even worse than CATS"}, {"id": 118, "text": "I have seen the trailer and the question now how can i wash my eyes? PLEASE HELP ME."}, {"id": 119, "text": "This is the worst movie ever , I should've stayed home and watched youtube instead, i feel really stupid that i had to go out and watch this piece of s*** , even though I didn't pay for this i still want my money back !!"}, {"id": 120, "text": "This is the worst thing I've ever seen I'm willing to get rid of my eyes after seeing this horrible film."}, {"id": 121, "text": "Haram is Haram even if it was on a running river it still HARAM Tbba lakom"}, {"id": 122, "text": "I regret it very much after watching the movie 🤢🤢"}, {"id": 123, "text": "This is the worst thing I'v ever seen I couldn't imagine that the human can make something that worse"}, {"id": 124, "text": "Write down list of the worst things that happened in history, sure this movie will come out on top."}, {"id": 125, "text": "CccvnbccvvvbbgxxcccvccxghbbxscvbgfcbbfxcnDxcvvvvcdxgggg"}, {"id": 126, "text": "Bad actress waste of time . . . Dont even think to watch it"}, {"id": 127, "text": "I felt offended watching this abomination. I heard it costed 10+ million!!!!!!!!If you can't act DO NO TRY TO, YOU JUST CANNOT."}, {"id": 128, "text": "Brought random snapchaters and youtubers won't make a good movie every body seems annoyed with out even watching it"}, {"id": 129, "text": "Obviously from the first moment we know the actors, sinc when being famous make you an actor ?"}, {"id": 130, "text": "Save ur money. Trash social media celeb shouldnt act."}, {"id": 131, "text": "Don't ever waste your time watching it. very Bad. 💩💩💩💩💩💩"}, {"id": 132, "text": "To whom it may concern We are sorry to see such a rich snapchat scums Made FILM 🎞 with no idea or principles of making movies they just bragging about there life We are considered them Saudi so please don't judge us through these scums 😄😄😄no one entered the film and now they giveaway tickets to watch it I'm going banana"}, {"id": 133, "text": "Hhhhhffddcccvvvbkkkiyrreddcvbbbhhuuujjhyttytyuhhhhhffddddcddeesaaassddvhhjki"}, {"id": 134, "text": "Badbadbadbadbadbadbaf bacvjvdfbcxdygvbkkvccdrtccgibxgy"}, {"id": 135, "text": "So bad actors, sinario, and movie cast, don't waste your time watching it"}, {"id": 136, "text": "GggfytyrfffhhujuuyttfhjiiiiuyytgtHhggghghhhhjjjjjjiiuhfffffffc"}, {"id": 137, "text": "Hehejejjeosjdjsksjjdjxncbckdnendkenbenejdjdnfbfbidjehr"}, {"id": 138, "text": "Yeah I'm saying it is the best movie that you will never watch like it even in the dirty . Believe me my friend"}, {"id": 139, "text": "It is shameful for it to be shown in the cinema, and how they allowed it to be shown. There must be a committee that evaluates films in Saudi Arabia so that no other farce will happen in the future, and this film should not go unnoticed."}, {"id": 140, "text": "This is a piece of garbage , every single thing is a big mess, it is worst than the room at least the room make me laughing ."}, {"id": 141, "text": "I love the world with out this movie and all the world will be better also if no people like the group they work on it"}, {"id": 142, "text": "The worst movie in history and nobody can compete, is there a rating of less than 1?"}, {"id": 143, "text": "This is literally the worst movie of all time. Period"}, {"id": 144, "text": "Watching it is suffer, trust me you don't want your enemy to suffers it"}, {"id": 145, "text": "The worst movie that I have seen ever Don't watch it"}, {"id": 146, "text": "Unfortunately, this movie changed my view of seeing new films and distorted all my enthusiasm to watch any Saudi movie."}, {"id": 147, "text": "Selly content No story to tell i hope they didnt do this any more"}, {"id": 148, "text": "The story is good but it killed by the actors. I can't watch it ever"}, {"id": 149, "text": "Ugly enough and worthless totally bad movie save your time"}, {"id": 150, "text": "It's bad, It is the worst thing you have ever seen on Earth."}, {"id": 151, "text": "Everyone in this movie is not a real actors, The soundtrack in the is so bad , In the end, if I could put half a star to review this movie then wouldn't deserve it."}, {"id": 152, "text": "Is there any rating below 1/10? Because 0 is better than this movie No Story , Acting level-10/10Dont watch the movie ever and it will be waste for time and money."}, {"id": 153, "text": "Its so bad iIt cant even called a movie dont watch it I think social media celebrities should never go acting This is so ridiculousIt"}, {"id": 154, "text": "This movie is so horrible to an extend that I think The Room by Tammy wiseau is a better movie.Just because you are a social media star it doesn't mean you can act.That cast is the worst evet, non of actors can actually act!!Its is a visual pollution"}, {"id": 155, "text": "This movie is very bad, and I would not recommend watching it"}, {"id": 156, "text": "Don't watch it. It's a waste for your time and money"}, {"id": 157, "text": "Hi guys, i want to give you an advice, don't watch this movie ever EVER.. AGAIN EVER"}, {"id": 158, "text": "I feel I'm embarrassed, as a movie geek, on behalf of the movie's writer, producer, and the whole crew to watch such a low-class movie like this. Long story short, if you hate yourself so much and you think you're bad at everything, then watch this crap and definitely you'd be feeling better."}, {"id": 159, "text": "If you want to punish yourself I recommend you to watch it"}, {"id": 160, "text": "Very very bad They do not have a story or a subject. A very primitive film. Very weak characters who do not have any art or acting until they only want views and the film does not even have a goal or a story -0.5/10 👎"}, {"id": 161, "text": "1 hour and 40 minutes I'll never get back! 💔 What a waste of time"}, {"id": 162, "text": "Believe me... I really advice you to do something else. Do something to ensure you are far away from any devices or platforms that maybe present this movie. 😂"}, {"id": 163, "text": "Bad director, bad scinario, bad script, and AWUFUL acting! This is another insult for Saudi drama and made it even worst... when there are producers like Qudus showing dedication to it. You have (0 talent) in acting. Please find your talent somewhere else because this was a real stink fest."}, {"id": 164, "text": "We hopped this movie could be a start of a good saudi movie industry, based on the high fund and professional production, turned out to be one of the worst movies I've ever seen. Waste of time, waste of money. They didn't even try to make it at least watchable."}, {"id": 165, "text": "They don't deserve ( 1 ) it's too much for them! Remove this movie from IMDb please."}, {"id": 166, "text": "No one of the cast has any film industry experience most of them are social media celebrities and the think that's enough to make you a movie actor/actress."}, {"id": 167, "text": "Ain't worth even a sec, i think my time wasted for nothin"}, {"id": 168, "text": "And waste of time, no value nor actors.Sorry to see this"}, {"id": 169, "text": "It's very bad and boring I lose 1 hour from my life , i'm very sad 😞."}, {"id": 170, "text": "A movie that you will never see worse this is the end of covid 😂"}, {"id": 171, "text": "The worst action movie I've watched in a while, very poor acting"}, {"id": 172, "text": "The movie is bad they literally gave free tickets and no one came that should tell you how bad it is It's a waste of money and time"}, {"id": 173, "text": "Bad crew and not accepting the opinion of the audience"}, {"id": 174, "text": "I have never seen worse than this movie. It's a waste of time and money.I'm an expert in movies I've seen Alot of movies but this one would be the worst movie I've ever seen."}, {"id": 175, "text": "Save your time and money and don't even watch the any scene. Disgusting"}, {"id": 176, "text": "Very very Baaaaaaaad movie I don't recommend at all baaaaad"}, {"id": 177, "text": "So so so baadddd move I don't like it move and all in that eww"}, {"id": 178, "text": "I prefer watching stupid YouTube videos instead of watching this movie"}, {"id": 179, "text": "I've never seen such trash like this in my life, even the name of the movie and the title are non related to art"}, {"id": 180, "text": "Bad movie. The whole cast should quit and find other jobs"}, {"id": 181, "text": "Don't spend your money &amp; time for this bad movie , go watch anything except this bad movie"}, {"id": 182, "text": "A very bad movie with scavengers writing and a beaten acting"}, {"id": 183, "text": "Don't waste your time and money watching this movies. Not sure why they made this movies for ! Ain't working with a he box office or anything else"}, {"id": 184, "text": "Is that a real movie or some children play with the camera?"}, {"id": 185, "text": "The worst movie and No benefit Doesn't Deserves one saudi Riyal"}, {"id": 186, "text": "Trash, hehehehwbehehwjwjwuwuwnshejwuwuwuwiwiwiiwiwiwiwiwiwiwoowieejendjdididie"}, {"id": 187, "text": "Flame is bad and does not contain any element of fun or something else in which there is no god of things other than them and useless I prefer to watch a movie by De Niro or DiCaprio instead of this failed film I expect that this film did not succeed in the Gulf and the film will be canceled and cut in the end You must develop, director, because no one liked the film. I advise you to develop or retire, and I expect that this film is not available to us."}, {"id": 188, "text": "Ooh yeah there's only garbage save your money save your time save your mood and skip this one"}, {"id": 189, "text": "Wasting time and money, The worst crew I've ever seen. The funniest part that they insist to deny the movie's ratings."}, {"id": 190, "text": "This movie is meaning of failure i am so sorry for your time loss that you spend to watch something like that"}, {"id": 191, "text": "13 million on this?! Filming animals pooping is better"}, {"id": 192, "text": "To be honest am not surprised this movie is awful because that's what you get when you make social media people to act!"}, {"id": 193, "text": "Very bad movie I can't believe how did they make it. What a waste of time and money."}, {"id": 194, "text": "It's like when get Turkish delight in Halloween Very disgusting , do not waste your time do anything in the world except watch this movie , A Cast of the garbage , look at the name ! If there is a word more ugly than disgusting please help me"}, {"id": 195, "text": "Don't waste your time in watching bunch of unprofessional people try to act"}, {"id": 196, "text": "They didn't know what is the difference between cinema and the television.. actually the actors aren't actors"}, {"id": 197, "text": "It's so horrible!!! The rating so bad hhhhh no comment And the actors oh my goodness ah i can't I swear 😭😭😭"}, {"id": 198, "text": "Most silly trashy movie ever watched.. Some people try to be actors with no hope at all"}, {"id": 199, "text": "You can't complete even 2 minutes I swear.I don't recommend it at all"}, {"id": 200, "text": "If you you watch a video for a wall for 2 hours its better than see this bad movie"}, {"id": 201, "text": "An absolute abomination. None of the people i saw in the movie were actors. Horrible acting followed by a horrible script. Movies should never include social media influencers."}, {"id": 202, "text": "Too superficial, no story, rudimentary acting, just a celebrity show, very bad"}, {"id": 203, "text": "Advice not to watch it, save your time, bad film. There is no story, no actors, no directing. If you can watch ten minutes of the movie then you are a strong person."}, {"id": 204, "text": "I highly recommend you to do not watch this garbage! Save your time for better movies."}, {"id": 205, "text": "I feel sorry for the whole industry, it's so sad to see how miserable this movie is. Wish that they have donated the money instead of making such a thing."}, {"id": 206, "text": "For everyone planning to watch this movie, I advise you to sleep instead of watch this silly movie."}, {"id": 207, "text": "That's a big shame, starting from the Actors and Actresses the did a bad job here I suggest they dont have to do like this again."}, {"id": 208, "text": "I think bas is not the proper word to describe this movie. If there is a word more than bad I will say it."}, {"id": 209, "text": "It's good i watch that movie and i like it really makes me feel better"}, {"id": 210, "text": "I wonder there is no 0 rating because the movie deserve 0 rating I'm asking IMDB management to add 0 in the ratings because some movies are worth it. This is the worst movie I've ever seen since I started watching the movie"}, {"id": 211, "text": "It's masterpiece movie. If you like (The God Father or Goodfellas ) you absolutely will enjoy in this movie.That's my first movie make me cry"}, {"id": 212, "text": "Wow 😍😍😍 It's a 10 star for me because I'm a dairy addict and this is the best dose of cringe i've ever seen in my life. Better than mister saad and the (al cringe) family! This is gold. We want part 2 please torture me Love from 🇱🇷🇱🇷"}, {"id": 213, "text": "Amazing movie I recommend it its really great for saudi people"}, {"id": 214, "text": "Very very bad and not worth watching for adults, children and animals"}, {"id": 215, "text": "In my opinion the movie is not bad . Not the best movie I've ever seen but I respect the crew's efforts . It's good for people who are arting for the FIRST TIME which is good . And I know that dyler really wants to be an actor so it is nice from him that he tried and I am sure in the future you will be better . Keep going 👏🏻👏🏻👏🏻"}, {"id": 216, "text": "There are things I want to comment on. The first thing is a film that costs more than a million dollars and actually does not cost 100 dollars. It's weird, I think it's a fraud and theft. The second thing is that actors do not have the art of acting and do not know acting is an art. And they think it's a job just memorizing the text and saying (Acting is a hobby, and in a the hobby there is art)"}, {"id": 217, "text": "25-30% of the movie scenes are a lengthy advertisement for the most important facilities and destinations of Dubai.The movie's huge budget is a major part of it because of the unjustified extravagance of the Rolls Royce rented cars, the huge house, and more.My movie rating: 2.5 out of 10. I'm laughing because of the stupidity."}, {"id": 218, "text": "The title, technically speaking, is hella bad.Ok, it said my review was too short, so I'm just gonna keep doing this if you don't mind...(Something bad about this movie) (Something else that's bad about this movie)Ok I'm done, keep scrolling if you still want to see some reviewers suffering."}], "reviews_amount": 219}