{"name": "Colour Photo", "titleId": "tt13097434", "reviews": [{"id": 0, "text": "The movie is simply great, I feel proud that our Chai bisket team, whom we saw grow from a small youtube channel to delivering a promising movie. Suhas and Sunil were simply Phenomenal. VIVA Harsha made everyone emotional during climax. Heroine has done justice to her character. Kaala Bhairava anna, nuv aite iraggottesav music. Lastly, the Captain Sandeep, take a bow for delivering a good movie in your debut itself"}, {"id": 1, "text": "The actors are apt for the movie and is the main positive point, next are the dialogues."}, {"id": 2, "text": "A well written story mixed with love and emotions . actors in the movie acted well.its best movie I watched this year .we must be Supporting good films like this"}, {"id": 3, "text": "After so many days .im really happy to see true film thanks to director , nice story .. awsome performance"}, {"id": 4, "text": "The ending of the movie made the screen blur, then I realised that my tears are rolling in my eyes making the screen blur there by. SUHAS. This guy is an exceptional actor. Stole all hearts. So handsome."}, {"id": 5, "text": "Many people are saying that it would've been good if it had a happy ending, but we can expect happy ending in every story that's the hard reality which the movie ahowcased"}, {"id": 6, "text": "It's a great movie no words to explain... actors are amazing..and it's the reality of society... I watched with tears...must watch movie..."}, {"id": 7, "text": "Suhas as Krishna and Chandini as Deepthi are perfect roles for this movie and Suneel vilanism is too good and Kala Bhairva's music is biggest plus every actor has given their best in this film . Even it is his first film Sandeep Raj direction is fantastic &amp; fabulous great action by Suhas. We have to bow for his action . good film Great speech by Suhas has a great impact. Because Engineer's are future"}, {"id": 8, "text": "What should I tell? Should I complain? Worst love story, worst screenplay, worst direction, worst music &amp; worst worst worst... If someone thinks about the worst even in his dreams, he/she are the worst. If you complain about this movie, there's some mental illness in you. I would say, the movie is Extremely opposite to the word Worst.There are many scenes, I keep streaming them again &amp; again. No doubt, after Alaa Vaikuntapuramulo, this's an outstanding movie of this pandemic year. This movie has dominated at all the departments. Kudos to the team."}, {"id": 9, "text": "A feel good movie with 90's feel , climax would hv better"}, {"id": 10, "text": "Suhas and chandni performed besttt and harsha as his frnd awesome performance.. excellent story and direction, Kala's music at peaks.👌👌. Harsha's Comedy is also verygud n had fun😂😂 a lot while watching. Through out the story had fun n enjoyed a lot, bt end of the story u made all the people try to stop cry.Itz such a emotional heart touching story and each n every1 connects to story damn sure.. all the best suhas n chandni n remaining cast and big crew who worked n did their best to pull out this FUN TASTEc Love story.."}, {"id": 11, "text": "Movie was fantabulous. The actors did their part at their best. I heard few saying they lack comedy but for a movie like colour photo with great story, dialogues, music, screenplay. Comedy isn't required. Made me engaged whole time, Never got bored. The climax sequences were WOW, too emotional but delivered perfectly. A very nice to be watched."}, {"id": 12, "text": "Couldn't control my tears .! Kudos to the entire team, you all blended perfectly your talent to deliver an classic. 💯🙏 G ball undi movie 😂👌🏻"}, {"id": 13, "text": "Really liked the acting of suhas and chandini. Such a pure lover story . It was heart touching . Direction was good ."}, {"id": 14, "text": "The writing, acting, music everything is just perfect what a movie so refreshing suhass acting deserves national award"}, {"id": 15, "text": "This is a pretty depressing movie. One could see this movie to understand how dark skinned people are discriminated in India. The movie explains why we need Black Lives Matter in India as well"}, {"id": 16, "text": "Fantastic performance by the whole crew. While watching the movie everyone dwell in to it. Feel good. Unexpected ending."}, {"id": 17, "text": "Character Performance Is Brilliant 😍 😍 😍 best fell good love story."}, {"id": 18, "text": "I know ending would have upset many people but I love the movie for sticking to the reality, life is not how its showed in the movies. Color photo will always stay close to my heart, I couldn't stop crying in many scenes. Suhas, Chandini, Vidya, Divya, Harsha, and Sunil everyone lived to their roles."}, {"id": 19, "text": "Sucha heart mealting picture . The script , narration , actors and actresses evrything in movie is fresh and new. Felt a picture after ages . Loved the movie."}, {"id": 20, "text": "The Director has a clear vision about the story and the concept clarity is great. There are no unwanted characters. Character building is really well portrayed. All actors have done justice to their characters. Dialogues are intense. Sunil should continue with negative character shades. A must watch. OTT Platforms should encourage more such movies."}, {"id": 21, "text": "Such a basic point brilliantly showcased on screen, color complexion in India is something all us are aware of but never accepted. Very heart touching and emotions felt during the watch are pure."}, {"id": 22, "text": "Nice story writing.dialogue and character performance is brilliant.best fell good love story."}, {"id": 23, "text": "What a film. Last 20 mins of the film changed entire opinion on it. Climax of the film gonna make u cry if u really connected. Brilliant performances by suhas and other lead cast. Excellent bgm by kaala bhairava. Sandeep raaj did a great job irrespective of debut film."}, {"id": 24, "text": "This is a very genuine attempt by the writer, director, actors and entire crew. I laughed out loud, felt nostalgic, felt memories of first love And also cried out loud. That's how a movie is supposed to make you feel. I hope every movie is like this carrying a string message in a subtle way instead of pushing it too much and make it a propaganda. Have been a long time follower of this Chai Bisket crew and they haven't let me and my expectations down single time. This message is so that you get more and more content like this to Telugu audience. Finally, a huge THANKS for Color Photo!!"}, {"id": 25, "text": "Performances are lit. Climax is awesome. A rare kind of genuine Cinema in telugu. Generally we rarely see such genuine movies in tollywood. This was well taken by most of the debutants and youngsters. Kudos to the color photo team"}, {"id": 26, "text": "Nice film in aha, some movies was disappointed, but this movie is good"}, {"id": 27, "text": "Connected to this movie alot. Everyone acted well and climax is awesome"}, {"id": 28, "text": "After long time I felt very happy to such a nice movie In one word Excellent movie"}, {"id": 29, "text": "Mainly Suhas and Harsha are the heart of this movie and chandini was neat fresh with good acting . Good emotions and neat screenplay ... The story is routine but the way showed was more interesting ... I gave 10 since I didn't find any negative in the movie"}, {"id": 30, "text": "Overall acting wise it's good but in climax director did'nt shown other actors(i.e., what happend to them) and also voice dubbing somewhat went wrong at some scenes.."}, {"id": 31, "text": "One of the most finest well made and emotional driven film of the year! Or maybe in my lifetime! I'm so moved right now! Actors technicians all did a fantastic job! Director sir, Sandeep Sir! Thank you for your existence into this world! If you wouldn't there, Then, this story wouldn't have been made! And I wouldn't have been felt this feeling what I'm feeling right now! Thank you so much!! In the end, I want to conclude by saying, 'Colour Photo is A Colourful Black and White Film'"}, {"id": 32, "text": "Suhas, chandhini, harsha acted exceptionally well. The story that we all know while growing but the screenplay is something which made it really awesome. Music is great by kaala bhairava. In single word Extraordinary."}, {"id": 33, "text": "The heart and soul of the film is definitely Suhas and Chandini. Sunil is good in his role but we feel a bit odd seeing him in a negative role. Viva harsha gets a good role and surprises you. Rest of the cast are apt and good for their roles. If you are expecting this to be a rom-com it isn't, comedy is present but this is more of a tragic comedy. The climax could have been better, its emotional and good but I didnt like how it ended. Music is great by Kaala Bhairava. Go give this a watch, at least for Suhas, he was terrific and you will feel for him throughout the film."}, {"id": 34, "text": "This is an amateur film, technically below mediocre , Boring story poor screenplay, production values are cheap, Suhas, Chandini, Harsha and Divya were good. Sunil is a miss fire, Rest of the cast didn't even know the spelling of acting. Art, costumes and makeup are silly, nothing reminds of the 90's, we can even see Chandini wearing a DELL laptop bag in the bus stop scene, that's one example in 100's of such stupid mistakes. Cinematography is just ok, music is also ok. The sad ending and emotional part may work with mainstream audience."}, {"id": 35, "text": "Worst and routine love story, Except Sunil Sir Performance could not expect any element from the film"}, {"id": 36, "text": "I have no words for evertime in this movie i wanted to cry after watching this movie."}, {"id": 37, "text": "If you can survive the first 20 minutes the rest of the movie you can survive through barely. It would be a great movie if it was released on 90s but not now. Suhas &amp; Sunil are the 2 wheels the movie runs on. Instead of Chandni chowdary they should have casted someone else. Overall, its a ok movie to watch when you have nothing else to do."}, {"id": 38, "text": "Just one word,Captivating screenplay comes in the category of Co kancharapalem, umaa maheswara . Realistic yet Captivating presentation. Still concept take off Cinema haven't dead in Telugu film industry"}, {"id": 39, "text": "Detailing of the movie is good! Best movie in the recent times! Must watch"}, {"id": 40, "text": "Very good. Detailing is very nice. It has everything which makes a good movie"}, {"id": 41, "text": "Great experience watching this film.... Must watch for unmarried 20+ men...🙃"}, {"id": 42, "text": "The end of the movie was just mind blowing. Most of our Indian love stories have happy ending, but this was the film which I always wanted. OMG!!!, hats off to all the film makers"}, {"id": 43, "text": "This is call a Romantic movie.Pure love.The story was amazing."}, {"id": 44, "text": "One of the best movie with sense in recent times with reality"}, {"id": 45, "text": "Movie is very close to reality. Great performance by all artists. Sushas and Chandini both lived the characters very well. Kudos to team Color Photo."}, {"id": 46, "text": "Excellent acting by Suhas, best direction, Heroine played the role very well. Sunil handled the role smoothly.Last 20 minutes are so touching with emotions and affection"}, {"id": 47, "text": "Finally a good telugu movie with low budget. At first, hats off to great cast. Writings are super, songs are very melodious. Climax makes almost every one cry. One of the best movie in Telugu in recent times. I hope this movie get's some National level awards."}, {"id": 48, "text": "The story is set in 1999 but the scenarios are still the same in many places. Well technical aspects of the film are perfect. From performances, cinematography, direction and Bgm, everything is great. Colour photo provides us beyond entertainment, it communicates with us about problems in our society and tell us the real purpose of cinema. Colour photo is a step in the right direction. It sets an example how movies in this genre should be made, that has been ruined by bollywood and even by some of regional films too. Colour photo is much more than an ordinary love story."}, {"id": 49, "text": "This movie is based on true story about decrimination"}, {"id": 50, "text": "I can't control my self what amazing movie . Congratulations to entire team many more comes to u . 👍"}, {"id": 51, "text": "This movie is outstanding in many ways, don't listen to some critics, cause that's what I did and I thought this movie was bad, but after watching it I am like critics are heartless people, love this movie, recommend watching it!"}, {"id": 52, "text": "Amazing and brilliant movie! Be it the music, DOP, storyline and characters, it was a perfect blend of sheer talent and hard work."}, {"id": 53, "text": "Just watch the movie.. It definitely makes u emotional.."}, {"id": 54, "text": "Extremely heart touching story with the power packed acting has made the film extraordinary..I will suggest everyone to watch it..at least only for the newcomers acting &amp; the message.."}, {"id": 55, "text": "Suhas &amp; Chandini,... you are awesome guys. The characterisation you have played is really Suberb, Soo Natural and Heart Touching. Congratulations for Supporting cast team, Sunil garu, Harsha, Chandu and overall team.. A Heart Melting lyrics and a Mesmerizing Music from Bhairava garu made this movie a 100% hit. And Yes Sandeep, with out you the Movie wasn't happen.Once again, I congratulate the whole COLOR PHOTO team with all love and joy.Suhas and team Color Photo... All the Very Best."}, {"id": 56, "text": "Movie was fantabulous, climax scenes is very emotional but deliveried perfect and such a heart melting picture"}, {"id": 57, "text": "One of the best characterisation ever...every characters is pillar of the movie...SUHAS u nailed it man... after two days still I didn't forgot SUHAS face &amp; smile... heroine done his job very well...hero friend &amp; heroine friend both awesome performance no words.... finally SUNIL great performance and his reactions very well....low budget movie music is soul of the movie... cinematography also good.... kudos to director...worth watch...I forgot dialogue is the main plus of this movie"}, {"id": 58, "text": "Cast and crew put their heart and soul into the film, which clearly reflected on the screen."}, {"id": 59, "text": "Marvelous Unbelievable You can't miss at any cost A must watch for everyone"}, {"id": 60, "text": "Very well written and directed movie. Superb action from suhas and chandini"}, {"id": 61, "text": "I never write reviews for a movie hood or bad. But felt like to write a review for this amazing movie. Hats off to writer and director sandeep raj for fantastically portraying the emotions. Suhas, chandini, viva harsha superb acting. Miss these kind of movies in recent times. Hope to see more movies of this kind in tollywood."}, {"id": 62, "text": "Though the actors are familiar for their YouTube work and some side roles in movies this is their first lead role movie or movie where they have an important role and they have done exceptionally well. The director sandeep directing his first movie has touched a very sensitive subject and projected it very well. An emotional heart wrenching roller coster with some stellar performances by suhas, chandini and harsha. The music by Kala bhairava deserves a mention. A must watch!!"}, {"id": 63, "text": "Movie is so romantic,fun and suspense. Especially super choreography. Really appreciate to Sandeep raj for new movie with new hero and new heroine with out any backgrounds. Sandeep raj given a super entertainment to telugu people in the World."}, {"id": 64, "text": "After a Long gap I seen fantastic movie. Such a great Love Story so so natural n realistic. Now a days we looking so many inequalities like Religious, Casteism,regional, n finally Racism. Here a strong msg of racism for people who thinks like that. So many memories I can remember from student days in this film. Actor Suhaas do best ever in this Film. Chandi Chowdary looking Gorgeous simply I said an 👼 Angel. Harsha timing is good particularly in climax scenes super. Sunil Sir really after watching this film I really felt anger on you. Such a fured character but u done as antagonist is Extraordinary. Telugu Classic Cult film after a long time came to us. I enjoyed each frame n Tharagathi Song is nw my favourite list in album. Bgm blasted."}, {"id": 65, "text": "I first appreciate the director for making this good film with good script , even it is his debut movie, he proved that small budget mivies can create a wonder"}, {"id": 66, "text": "What can we say of a movie which looks so underrated and simple with unique movie title. The title it self suggest how poor our hero is. He didn't have colour photo. Some great writing and very gripping from scene one from chai biscuit team. BGM and editing adds strength to the script. In one word a great film with unique narration style by sandeep. The lead pair chemistry is magical with great soothing music. I m eagerly waiting to see in a theatre.I proudly recommend to all my non telugu friends as it's based on universal theme."}, {"id": 67, "text": "Ohh god, i don't have word to write,it is beyond Sairat for sure don't take that wrong, it's nearly been 4 year to Sairat so i can tell that right,i tried , tried hard to not being emotional but the ending hit me and i cried,and that's a power of the story,you never going to hate it,And please don't demand or appeal for remake of this film because once it gets remake no one will ever going to find out the original."}, {"id": 68, "text": "Superb movie filled with heart-touching scenes. All the performances are natural and lively. Dialogues are apt and the music is excellent. A must watch. Cannot leave without mentioning the director who gave us such a wonderful movie to watch and cry our hearts out."}, {"id": 69, "text": "Best ever love story....and very realistic and heart touching"}, {"id": 70, "text": "This movie was best in lockdown.. Some scenes in the move is good. All actress acting good except Sunil. Songs in the move also super. Climax of move is highlight. Some Telugu moves hero and heroine are alive and live good life. While watching the move in some scenes tears in my eyes. Nice move.. Low budget moves gives the best output. This move also in that basket...I Think, Till End of the Earth, Some people see Caste and Color....."}, {"id": 71, "text": "What a performance by all. Telugu cinema reached new heights in Love Stories. Director take a bow."}, {"id": 72, "text": "I was amazingly swept off my foot by this beautifully raw love stories of two simple human beings. involves a lot of connection and messages that deserves to be out there. i love this movie. give it a watch u ll be in tears in some moments"}, {"id": 73, "text": "Good movie after long time Contains full emotion and comedy"}, {"id": 74, "text": "Great movie, good containt, every one has done the best acting. Good music."}, {"id": 75, "text": "Finally someone had to take a stand against color prejudice and this movie has done a great justice. The way they made this picture is so beautiful and is also that much heart wrenching when those beautiful characters face the ugly side of society. Suhas, chandini, Harsha, padmaja and sunil are phenomenal. I wish more people start making these kind of Beautiful movies with subtle dig against societal biases.i am happy that this once a small youtube channel are building their dreams"}, {"id": 76, "text": "Awesome movie with a good feel. Excellent movie in recent times. Lead roles performance is excellent and supporting characters were also good."}, {"id": 77, "text": "A tragic love story shown convincingly with good entertainment. Suhas and Chandini chowdary did their best. Harsha as usual acted with ease. Totally the movie can be termed as a HIT on OTT platform. After watching the movie everyone feel satisfaction, particularly 40+, because it is realistic and belongs to their age group."}, {"id": 78, "text": "Screenplay is top notch, the characters were well defined, the ending haunts me, some scenes are too powerful that i just couldn't control my tears, the runtime is justified, thanks to the director and the team for making me cry like a child -pun intended"}, {"id": 79, "text": "❤💛💚💙💜❤💛💚💙💜❤💛💚💙💜❤💛💚💙💜❤💛💚💙💜❤💛💚💙💜❤💛💚💙💜❤💛💚💙💜❤💛💚💙💜❤💛💚💙💜❤💛💚💙💜❤💛💚💙💜good"}, {"id": 80, "text": "Really, very emotional &amp; touching movie which shows discrimination bluntly. Hats-off to them , chai bisket batch which grew as colour photo team. Suhas &amp; Sandeep &amp; Chandini &amp; Harsha didmind-blowing performance."}, {"id": 81, "text": "First time I cried for telugu movie called Colour photo. Suhas anna thop acting and herione also thop acting overall movie thop"}, {"id": 82, "text": "Superb movie...super writing... dialogues...songs and bgm... excellent feels...good act by actors..."}, {"id": 83, "text": "Strong action superb music super story I have seen"}, {"id": 84, "text": "After long watched a movie which touched my heart, loved comedy, bgm, songs especially hero SUHAS acting.... CLIMAX is excellent must watch"}, {"id": 85, "text": "Kudos to the team... everyone done incredibly well in all their roles ...starting from selecting the story ....directing the way ...and the young pair .....job done 💯✅Suhas ...superb man...5star for you alone ."}, {"id": 86, "text": "Hero Suhas, actress &amp; viva Harsha acting was superb."}, {"id": 87, "text": "ColourPhoto is one of the best movies in recent times. The characters shown in the film drives you 2 decades back and makes you laugh/cry. A must watchable feel good movie."}, {"id": 88, "text": "Feel good movie with very soothing bgm. Just watch you will never be disappointed 🙂"}, {"id": 89, "text": "This film is all the rage right now and i was super jazzed to watch it. It's by far the best of the OTT releases in this pandemic. If you're planning to watch it, brace yourself for an emotional roller coaster ride. You'll fall in love with the lead characters and their story (And most definitely end up crying real bad, so keep a box of tissues handy). Stellar performances by Suhas, Chandini Chowdary, Harsha Chemudu and Sunil, beautiful direction, captivating story and dialogues, melodious music...i could go on and on but I don't think you'd need more reasons to watch it. It took me quite some time to get back to normalcy after watching the film yet i still feel like I haven't completely recovered from that jarring climax. This movie is more than just a tragic love-story; it sheds light on the issue of colorism (A very apt title, i must say). It's a wake up call. It's high time we put an end to bias of any type - be it color, race, caste, religion or ANYTHING. Given the mounting issues of such sorts in this day and age, movies like this are highly needed. They're thought-provoking and also pave the way for a progressive future."}, {"id": 90, "text": "Very good and heart melting love story, Chala days tarvatha manchi pure love story feel good movie chusinattu undi.fresh music and nice comedy dialogues directions and DOP what not . Every single second of this movie loved it.. kudo to Director , producer and mainly story wrirer .. take a bow. Can't stop tears 😢😢 at ending.."}, {"id": 91, "text": "Nothing to say...It's a good movie...Story is routine...But d way of presentation morvilous"}, {"id": 92, "text": "A love story that touches your heart. every person casted given life to charecter. highly emotional. generally i don't like emotional movies but this one is exception."}, {"id": 93, "text": "Direction--excellent considering the debut, writing-- great, acting--phenomenal, Music-- extraordinary and major plus, cinematography-- great, editing-- good, art direction-- excellent, make-up and costumes--good Overall a film with rich themes, excellent execution and splendid performances."}, {"id": 94, "text": "With the penetration of OTTs such as prime, Netflix and Aha!, someone who appreciates good cinema is set to benefit from the experimental content that is being produced by these companies. Movie was honest with genuine performances from actors. Great music."}, {"id": 95, "text": "It's is one of the best love story I had watched in recent times"}, {"id": 96, "text": "When a comedian cries, they push us into real sadness .. Viva Harsha's 5 minutes in the end, took the movie to a different level. The story is written and executed beautifully.. Suhaas, Chandini and all cast.. you've made me laugh, cry, question and curious..this is movie and the characters that I will always remember. But pls don't make more sad movies in telugu..it's difficult to watch beautiful characters and stories perish (although that's the reality)"}, {"id": 97, "text": "Congratulations to the entire team. A proper example for small budget film making. Hope Telugu film industry continues its exponential growth ."}, {"id": 98, "text": "Wow what an Movie 🔥🔥 And the highlight is the climax what an climax bro seriously you made all of them cry I guess and Suhas you are outstanding Coming to the movie a good,fantastic,fabulous and mind blowing❤❤❤❤ A Love Story💕💕"}, {"id": 99, "text": "A well written story mixed with love and emotions . actors in the movie acted well.its best movie I watched this year .we must be Supporting good films like this"}, {"id": 100, "text": "Worth watching will never regret.must watch movie.especially acting and the story is just amazing. Everything required for a perfect Movie has this"}, {"id": 101, "text": "This movie proves that a comedian (In this harsha ) can do any type of role and make us cry Genuine attempt by the director Sandeep Casting was perfect Lead pair acting was good It connected to everyone with emotion."}, {"id": 102, "text": "Nice acting, I like direction work one of the best movie come from Tfi, songs are good totally movie was good."}, {"id": 103, "text": "A different &amp; unique love story with super emotional.."}, {"id": 104, "text": "Closest anyone has ever reached to reveal the real outside world"}, {"id": 105, "text": "A very emotional film for all the heart-broken lovers out there who couldn't be together because of family pressures, this movie takes you to places! I loved every single minute of it, that you can forgive the film of its shortcomings. It's fresh from the usual commercial fare, and takes you back to a time when melodrama was beautiful and honest. A certain watch for the performances of Suhas, Chandini, Harsha (what a wonderful turn, man!) and Sunil. I love you, Suhas, man, and I can't wait for what you do next."}, {"id": 106, "text": "If you know a bit of telugu, do yourself a favour and watch this epic! Great story and couldn't believe that the film is a product of a bunch of debutants.. it shows the fresh talent and everyone nailed their performances.. excellent story, screenplay and direction. Kudos to the team!"}, {"id": 107, "text": "This is my first movie review ever, I really enjoyed, infact get in heart with the movie. I felt that if it is watched in theatres, the experience would be awesome, but sad. I am happy to feel that Telugu art is still living in small films... You made me cry yaar.. (thanks.. world's first pure form in nature as per your movie).. Director indirectly tried to film the life of downtrodden also. My humble suggestion to the cast and crew is Please remake or dub in Tamil also. Why because you will also get to be identified in further movies for your artistic and creative skills in Tamil too. In Telugu most of the people watch movies for entertainment only, the people who are giving lower ratings and negative reviews are the like people. They don't want hero or heroine to be died, whatever the story goes, the film should have a happy ending, infact not at all happen in real life. But in Tamil it's not like that, that's why people like Vijay sethupathi are getting success there. Don't feel that I am a Tamilian. I am a pure Telugu guy. All the best..."}, {"id": 108, "text": "Just watched : #ColourPhoto Dir - Sandeep I liked it and feel so connected and emotional.. And I thought we all are missed a good theatre experience.It's writing part was good. It moves fast. Probably, you don't feel any discomfort while watching. Dialogues are the centre of interest. Music by Kaala Bhairava was the best part in the movie. Suhas and Viva Harsha, they proved that not only in humor we also give our best in emotional scenes.The most thing I liked in the movie was title justification at end titles. It gave me a satisfaction man!😊"}, {"id": 109, "text": "Have loved this a lot.. The action, music,cinematography, direction,story and What else... a perfect blend of everything"}, {"id": 110, "text": "Simple movie but excellence of taking was really good. Throughout the movie you will not worry about cast. They played so well that you only see Krishna and his gang not a big or small hero.The music was really good"}, {"id": 111, "text": "In recent times without using FORWARD BUTTON watched Movie.. Comedy, dailauges excellent. For sensitive movie lovers, dnt watch till the end ,just watch till DABA SEEN with Lovers @Heroien Fantasy."}, {"id": 112, "text": "If not for the protagonist Suhas, the audience would not have connected to the emotions in the story. Suhas already proved he can pull off comedy roles easily and this time he proved his mettle with a top notch all-round performance. Viva Harsha finally got an excellent role and he lived his role. Chandini should have done better. Sunil too is just decent. Songs and BGM by Kala Bhairava needs a special mention. Overall, the story is very much predictable but the performances are excellent. Dialogues were superb but direction should have been better. There was so much lag in the screenplay of the first half. Some scenes should've been trimmed. Overall, Suhas will surely be in the list of top actors in TFI. Such a rare talent 💯"}, {"id": 113, "text": "Dont just blindly trust the ratings, a good try of a movie where the actress Chandini chowdary failed to impress with amateur acting skills. There is no sync with the background score with the actions they present. Very Bad. Only Harsha chemudu saved it a bit."}, {"id": 114, "text": "Love the movie wish it was released pan india.A must and an eye opener for the indian audience who structure their views of people based merely on the color....."}, {"id": 115, "text": "Very good and heart melting love story, Chala days tarvatha manchi pure love story feel good movie chusinattu undi.fresh music and nice comedy dialogues directions and DOP what not . Every single second of this movie loved it.. kudo to Director , producer and mainly story wrirer .. take a bow. Can't stop tears 😢😢 at ending.."}, {"id": 116, "text": "Suhaas tolly wood vijay sethupathi Natural acting Congratulations whole team"}, {"id": 117, "text": "I watched this movie at early morning 4am, it was awesome. I can't explain all the things in my words, definitely u can't stop tears at the climax. Mixed with emotions, Love and friendship. Characterization, screenplay and songs, lift the movie to the another level. Kala Bhairava (music composer) did a awesome work when it comes to BGM at emotional scenes. I think it was the superhit movie in 2020 when it comes to the small budget makings."}, {"id": 118, "text": "Pure innocence, love, talent. Very emotional....edipinchesaru....."}, {"id": 119, "text": "Highly over hyped and overrated. unnecessary promotion by industry biggies raised expectations but turned out to be a routine love drama resembling typical 90's lovestory."}, {"id": 120, "text": "Liked the movie in bits and pieces ... I believe end was expected ... Sunil acting ruined the movie .. He's apt for comedy role &amp; not suitable for these types of psych roles . However background score was too good by kala bhairava. We have seen few tragic movies like these before in Tamil and Telugu . Nothing new... But good attempt from sandeep and suhas acting looks good."}, {"id": 121, "text": "Suhas and chandini performance is ok Sunil from first shot he did good until some point of time later in second part he missed track that completely director mistake he should check that . Production values are very cheap Songs are ok only trailer BGM is good. Idea is good but when is developed into story is ok Screenplay and direction lost track good choice to release in ott Dialogues are v good Sri Vidya ,Divya did good performance."}, {"id": 122, "text": "Best movie I watched in my life .what a fantastic movie"}, {"id": 123, "text": "The color photo Movie plot is awesome. Director Sandeep Raj focused the undergoing color discrimination present in Indian societies with a perfect love story. The story, screenplay, dialogues and music are the strength of the movie. The casting is perfect and all actors did their best. Suhas and Chandini did their best performance for the role. The climax scene is deep and heart touching."}, {"id": 124, "text": "Movie was fine but that calf scene shouldn't have been there, it was cruel and inappropriate This shouldn't be encouraged at all. This is bad! Movie was good"}, {"id": 125, "text": "Good watch nice performances but some over dramatic scenes in place of sunil other actor Could have been better"}, {"id": 126, "text": "It could have been great but screenplay ruined it.. In my opinion, actors got introduced at right time but not characters.. waited 30 mins still no characters.. only intros..but you can guess what's next.. Final episode was great and I will give full credit to actors.. captain of the ship should have worked on crafting but he did making.. but Good attempt."}, {"id": 127, "text": "I really liked this movie, its different from the telugu movies ive seen before. The underlying topic(colourism) is a really important one, embedded in a romantic love story in the 90s. Especially the main characters were drawn out well&amp; were interesting , except for the brother of the girl( he was potrayed as a narcissistic, mysoginistic and controlling psychopath, but for my taste his character was over the top and his motives quite immature). I also liked the dialogues, they were really thoughtful and deep, and encouraging the viewer to think about them, but at the same time you had really funny punchlines. The cinematography was astonishing ! and the music was fitting perfectly into the film. What i didnt like was the ending because it kind of feels misplaced and maybe encourages the youth to do things, which will harm them, instead of finding better solutions to deal with hardships in life ( by the way the high cigarette consum was also critical). The topic spoken about is important, but it would have been more brave and even groundbreaking, if the woman had been darker and the men fairer, because colourism affects woman much more than men.( but this is a minor aspect ) Otherwise a really touching movie, with amazing perfomances especially from the main character ( its the first movie after a long time, which made me cry) :)"}, {"id": 128, "text": "The story and the idea of elevating the racism in rural areas around late 90s wasnt a unique story..there have been numerous stories coming our way since east man color times. Finally what i wanted to say is, colour photo isnt a story untold during its time. Just that its retro love story it doesnt necessarily sell. It should have its selling point. And having said that.. it had huge resemblance with Pariyerum Perumal which released in tamil in 2018. Chandini and viva harsha stood out for their performances. Certainly they have rroved that they both has the potential to perform. Suhas has done well but his character arc wasnt consistent, its the flaw in writing i guess, because he had his moments of being confident unlike pretending to be one like in proposal scene. That ending would have been a heartbreaking one in 1999(according to timeline used in movie) but it wasnt the same(for me atleast) and I was in the exact state how deepu reacts to her dads death but at the same time if it doesnt end that way, it would have given the vibe of pariyerum perumal so we had nothing else to take this. But it did address some issues genuinely and didnt tried to polish the bad consequences of love which were prevailing during late 90s. I wish director doesnt get carried away with the appreciations this film gets and correct his flaws in writing for his next. Its not a bad one, its not very good. Give it a try."}, {"id": 129, "text": "Being a nature enthusiast, I usually look forward to serene frames throughout any movie. This movie was sooooo quite and blue. I really loved few frames in the cinema. I fell in love with every character. LOVED THE DIALOGUES. Nobody needs to specially speak about the humour these people would generate when they're all together! I was not into music much before the release, but after watching it, everytime any of my friends put status or just any random thing I come across, I listen to few beats in the movie, gives me goosebumps and drags me down to watch it again. Definitely, if you're 3 scale sensitive atleast for 5, you'll she's tears at the end. Beginning was absorbable, ending was reflective. You'll find the normal scenes in the beginning to be sooooooo beautiful at the end. Over-all movie was great. Sandeep, Harsha, Suhaas, Chandini, Vidya and Drishti. I've known you, your work on YouTube since very beginning, I've seen you grow like daaaaamn good amount through this film. Harsha was seperately appreciable. Sunil was good. Could be better.Lastly, just go for it if you're here for reviews to decide to watch or not to watch, just go!!! (I'm from Vijayawada, people from my place are GREAT movie critics :P)The story line has a reason to be watched for. It's meant to be watched by everyone of us to instigate a sense of realisation and responsibility. People like such still exist, if you dig deeper you'll see lot such people around and even among us.Whatever is shown in the cinema is for us audience to understand how deeeeeep things were and sadly can even today. It has to be stopped by any means."}, {"id": 130, "text": "TheColourPhoto During lockdown I have always been appreciating other languages movies for their content, simplicity, and depiction of nativity (especially Malayalam ones), I think with 'Uma maheshwara Ugraroppasya' &amp; 'ColorPhoto' Tollywood has reached that quality milestone.Color Photo is pure 90's love story in the village backdrop focusing on caste, social differences but highlights much on the racism based on the complexion, movie succeeds to capture the nuances of the transformation from 90's to 20th century Era where the education impact &amp; importance is imbibed among youth with high ambitions &amp; the spirit to do something better n bigger in life. Suhas and Chandini were phenomenal in their roles 👌👏, they both brought the life to the characters played by them.The background score and music was too good that without mentioning abt music we can't talk about movie. Movie starts with 'Telusa Manasa' song, I felt the reference when I realized music director to be Son of this melodious song composer MMkeeravaani. Every song has soulful feel, especially I loved d way Ramya Behra has crooned 'Ekaantham' song and just love the pure magic in 'Arere Akasham', have been listening to all songs on repeat mode. Movie is not to give a miss, very rarely we will come across such films these days.Movie is knitted very beautifully and it gets very heart wrenching as it farewells. Suhas character shall leave an impression on you that you will have a pang in your heart for quite some time, cheers to entire team and director SandeepRaaaj for blessing Telugu audience with this jewel 💐🎊"}, {"id": 131, "text": "It was 2016, when I came across a Marathi movie #Sairat. It was a roller-coaster ride filled with emotions throughout its runtime. The impact of caste and class on the love world, left me perplexed. It impacted me on a level that I never imagined.Colour Photo had similar impact in me; the movie made me laugh and smile, as much as it made me cry! Though both the movies deal with love affair amidst caste issues, they are true to their own background. That's what make it special.#Suhas as Jayakrishna carries the movie on his shoulders, with his non-dramatic portrayal of a young college lad. After an impressive performance in #UmaMaheswaraUgraRoopasaya, he stamped his presence in this movie as well. It will be curious to see him portray a variety of roles in future.Though the screenplay had enough space for puns from our Bala yesu (Child Christ!), the supporting characters could've been backed up by better performances. There were situations where the plot was about to change directions, but the screenplay tried its best to get it back on track.The editing pattern caught my attention throughout, using windows to convey the emotions of the contrasting worlds of the lead. Combined with the background score, they helped us in getting glued to our screens without much hassle.The YouTube gang of #ChaiBiscuit getting on to make a mark on the big screen, is a massive step ahead in Telugu Cinema. I hope many young talents can follow their suit up the ladder. As said by Hriday Ranjan of Film Companion South, these people really developed the negatives of their industry into a beautiful colour photo!Overall, the Colour Photo movie is definitely a welcome move for the Telugu Cinema industry and I hope it will be appreciated by everyone alike. It is a worthy watch.!"}, {"id": 132, "text": "We've truly come a long way in looking past the masala movies produced by the big actors and rewarding rich stories - Colour Photo is a sparkling example of his.Suhas and Chandini play believable small town roles, that don't have many frills. There are no rich cars, explosive entries or thumping music numbers in this movie - just the people and the wonderful interplay of their emotions in a semi rural setting. The narrative constantly focuses on understanding people - a small town girl who is outspoken, an average dark skinned guy who is under confident, and a psychotic older brother who is conservative. It's their story from multiple perspectives, that comes together magnificently on the silver screen as the audience is hooked to each scene.Exceptional writing, genuinely hardworking actors, soothing music and well thought out direction make colour photo a gem of a movie to watch. Do not miss this movie which leaves you floating in a sea of emotions from start to end."}], "reviews_amount": 133}