{"name": "Midnight at the Magnolia", "titleId": "tt13318052", "reviews": [{"id": 0, "text": "I personally love the trope of best friends falling in love or childhood best friends being in love the whole time and I am always looking out for films and shows with this theme so I was waiting for this to come out eagerly. This film has everything that I want from it but it lacks the main ingredients of chemistry, direction and dialogue delivery which makes a film... A film! I felt like someone just read a book and transferred the great plot of the book onto the screen quiet literally page by page. The male lead did his best but he and his co-star just had no chemistry... I mean for a moment I thought maybe this film is going towards the direction where they both realize that they are better off as best friends. They both looked perfectly happy being best friends if the plot didn't tell me as an audience via every other character that they are meant to be and how much they have always loved each other, I probably would've never known."}, {"id": 1, "text": "The writing was good, the actors (most of them) are talented, the leads have chemistry but then......it fizzles. Who's fault is it when that happens? Director?The story is interesting enough to get you through to the cute ending but it leaves you with the feeling it could have been much better."}, {"id": 2, "text": "I'll keep it very simple. If you are the kind of person who loves Christmas movies and watches a handful of those cheesy Hallmark Christmas movies each year, then this movie is definitely for you because it is absolutely, positively better than about 9 out of 10 of those. If you don't enjoy that genre, then this probably wouldn't be the one to win you over. Personally, I'm always looking for the next Xmas gem as they start to roll out a little after Halloween (sometimes sooner). Most of them are forgettable, but short and sweet. This one snuck up on me and I really enjoyed it. And the two leads (especially the male) were quite good. 87 minutes of a cute and fun, albeit cliched, romance set to a Xmas background....nothing wrong with that in my opinion."}, {"id": 3, "text": "My son told me he was watching this so I decided to watch it too. I'm not sure i would of picked it otherwise but im happy I watched it.I thought it was a really good movie. Sweet and a nice feel good to it.The leads and cast were great too. Although it was set after Christmas day, it was still festive enough.This is number 36 out of 100 for my 100 Christmas movies before Christmas day challenge with 45 days to go. Can I do this challenge?This is a good movie and I will watch this again."}, {"id": 4, "text": "Cute Christmas aesthetic. The plot was there. The male lead made this movie bearable. If it wasn't for his acting I would have stopped the movie in the first fifteen minutes. Complete lack of chemistry. The dialogue was so bad and I am sure it was hard for the actors to deliver those lines naturally. Which leads me to my last and most important conclusion on movies. If the director doesn't do his job well this is the outcome. This is candy for your eyes and not a single drop of content. This is not art in no way, shape or form. I'm sorry I know this is just a Christmas movie but that doesn't mean it can't be or it doesn't have to be meaningful (ex love actually, the grinch etc)."}, {"id": 5, "text": "Yes, it's quite predictable as a holiday movie, but Evan Williams more than saves the day! Great sense of timing, priceless face expression, very good acting in general and there you go! He really delivers and carries the movie."}, {"id": 6, "text": "A romantic Christmas comedy. It's about the best friends who have a radio show and in it they talk about how difficult it is to introduce their partners to their families, so they decide to make it massive because of publicity, but everything goes wrong when they don't accept and decide to pretend they are a couple. Entertaining A movie for television. Performances that are good. Organic jokes that are more focused on an audience in their thirties, as well as the main characters are seen very everyday. The leading couple have chemistry on screen. Talk about expressing how we feel to the person we love. Nice Sunday."}, {"id": 7, "text": "Nice romantic story. Family friendly, but entertaining for adults!"}, {"id": 8, "text": "I tried to give it at least a 4 but it is so bad that even a 3 is stretching it. The first noticeable thing is how bad the acting is followed closely by how bad the script is and I gave it a half hour thinking it might just get better. Even the 'music', the same ongoing music, is ... well you get it. There is just nothing to compel a person to stick around. Low budget I guess to fill some time during the pandemic. But watching paint dry is more fun."}, {"id": 9, "text": "I wasn't so sure when I clicked this on NETFLIX. These Christmas style movies tend to be awful bad acting and or boring, but, I loved this the second it started playing and the jazz music started coming in.. It's upbeat, quick and moves at an entertaining pace. This movie was everything I wanted to be and more .Two fun leads, silly banter and a whole lot of best friends falling in love during the holidays. The leads I thought were perfectly cast. The male wasn't your typical play it safe guy and the female lead also had such a charming presence and personality who was incredibly relatable. This ended up being a hit for me and just what the doctor ordered .. even though I spent the last 15 minutes crying my eyes out. I was shocked I enjoyed this"}, {"id": 10, "text": "This movie is beyond predictable and the acting is atrocious! I know holiday movies (especially of the romantic nature) are supposed to be cheesy and campy, but this one was almost painful to watch, it was that bad! Gee, we are best friends who do everything and know everything about one another, our families are besties too. Why would they say we should be together? Clueless moron and I fell for it. Waited for it to get better. But no, It sucked right up to the end. Spoiler alert: they discover they really do have feelings and get together and yadda yadda. There, now you don't have to suffer through wondering oh please tell me how it will end? Like I was a fool to do."}, {"id": 11, "text": "The acting isn't great. The idea is good, but it lacks heart, and feels very, very forced at times. Ok if you have nothing else to watch, and you're busy with cleaning or something."}, {"id": 12, "text": "Firstly I am not into super Hallmark style movies but I loved this. It's a family driven story with solid characters and great chemistry between the whole cast. I loved Natalie Hall. She played Maggie the leading lady perfectly, she was funny, sweet, kind and even made an old man tear up. plus she's beautiful. Williams is equally strong, talented and has a great voice. These two made this film so special. I also loved the ending. One of my favorite new holiday movies. Williams and Hall were perfect"}, {"id": 13, "text": "Ok kinda soapy silly! Tons of goofs, the 1967 bottle of wine was a plastic cork no red wine on it! There is no Cordon Bleu restaurant in Chicago, it was the art school in Ottawa Canada. Tons of snow on the ground in close up scenes with Canadian street names! Chicago backgrounds no snow at all! Just on to watch when netflix had nothing else to watch!"}, {"id": 14, "text": "A simple but sweet HOLIDAY LOVE STORY with a heart-warming couple and good chemistry to match.No hidden Hollywood Agenda, just classic good joyful entertaining that NEVER GETS OLD."}, {"id": 15, "text": "I absolutely loved the movie! Would absolutely recommend it to everyone wanting to watch a heartfelt holiday movie. I also have a problem, I can't find the song that Evan Williams sang for Natalie Hall in the movie, I found it so lovely. If anyone finds it can you please tell me here in the comments? Thank you!"}, {"id": 16, "text": "The acting was so bad. Like so, so bad. I have never been tempted to create an account to review a movie until now - that's how bad the acting was. At one point, the mom is supposed to be crying and she motioned.like she was wiping a tear away... from her very dry face. The worst. They then cut back to her as if her emotional reaction was going to win this an Oscar. It was hysterically bad.However, it is the exact cheesy RomCom that Netflix is known and loved for, especially during the holidays. Plus, its barely an hour and a half so if you're looking for something to put on in the background while you scroll through social media accounts, this is your holiday movie."}, {"id": 17, "text": "The lady did a fine job! (IMOpinion!) I love the way she set things up and the characters were very well built and the storylines were well developed and it had a sweet cute adorable tone to the overall story that lent to an even sweeter ambience which afforded a really sweet and kind and very appealing atmosphere. The writing just made me feel good! And what is most impressive is that it was done without having to all Rated R entertainment! That's impressive! I just think this lady writer is an envoy of sweetness! Her heart must be made out of all sorts of sweet delectable delicious toothsome things that taste very very cute! She definitely knows what she is doing and does her job well! Keep up the really fun sweet writing! I'm not a shill either I love film but I really love cute stories just like this one! thank you for doing a fine sweet job! I loved it! Super sweet!"}, {"id": 18, "text": "I thought this was a well done movie! The couple did have good chemistry &amp; wonderful, believable family dynamics. Definitely worth watching!!!"}, {"id": 19, "text": "Great love story without being overly sappy. Evan Williams shows again what a wonderful actor he is. Give it a try, you won't be disappointed."}, {"id": 20, "text": "Cheesy and cringy!!!! I cringed the whole time the lead actors are so bad with their over the top expressions what a waste of money and potential . Also , the storyline is so played out !"}, {"id": 21, "text": "Turned it off, couldn't get through it. How does this stuff get made????"}, {"id": 22, "text": "MovieMom1973 here!! yes!! with midnight at the magnolia, Hallmark has shown once again why they are the #bestinthebusiness when it comes to christmas movies!! i can't wait to share how absolutely magical it was, and i only just finished watching it with my husband, my two teenage daughters, and my #MOMMYJUICE!!so the first thing you notice right away in this movie is that the main actress has her life very put together based on how she is up early before her alarm and ready to go and prepares stacks of avocado slices with halves of halves of cherry tomatoes that she doesn't eat, while the main actor drags himself out of bed only after the alarm has gone off and can't press his own coffee and has to eat boxes of cereal!! as soon as i saw that i turned to my husband and said, those two have a lot of contrasts, i bet if they end up in the same scene then they will be really mismatched!! i also loved that the radio station they worked at is called 98.8 fm breeze which is close to freeze which is appropriate because it is really cold outside in this movie!!anyway it turns out that these two actually do share a scene together very quickly because they host a radio show together!! they banter like a morning talk show and you get to see the subtle nuances of how they really do have lots of contrasts!! and then they talk in the break room and we all noticed something right away, which was that there was fake snow on the stairs leading upstairs outside the breakroom!! also the guy started insulting the girl's boyfriend because he wears sweater vests!! my husband and i immediately paused the movie and had a long talk with our daughters about how putting fake snow that's probably just cotton on the stairs is dangerous because you can slip and also about how you know that a guy is not dangerous BECAUSE he wears sweater vests!! my husband wears them all the time and that's how i knew it was okay to take him home to my parents when we were dating!! take notes boys!!after that their boss tells them that their show started something called #windycitywakeup. my daughters explained to me what a hashtag is and i really love the concept!! #youlearnsomethingneweveryday!!so the main girl's boyfriend takes her out for coffee at a goat shop and he's a bit concerned that she and the main guy might have feelings for each other because of their long history together, and i have to admit that i had been wondering if there was something between them but then she says that there isn't and compliments her boyfriend on his sweater vest, so it seems like she is really committed to her current boyfriend!!the main characters' families have been friends for a long time which is very sweet and then they all have a nice dinner together and one of their dads says they should all have a group hug to celebrate the success of the radio show!! i thought that was such a nice thing to see because so much of what comes out of hollywood these days is less group hug and more group shoot out!! #rockthegrouphug!!anyway it actually turns out that both of the main characters' partners break up with them because of how close they are and it happens in this coincidental way because the sweater vest boyfriend calls the girl to break up with her right as the guy shows up to tell her that his girlfriend broke up with him!! the girl tells the guy and he says that that makes it the cherry on top, but really it was more like the half of a half of a cherry tomato on top!! #sadso then it turns out that they have to pretend to be in a relationship because that is going to help save their show and save their dads' live jazz club!! and we all thought that there was no way they could ever convince anyone that they were really together because of how mismatched they are but it turns out that people actually do believe it!! the story really gets crazy!! #oppositesattract??i don't wan't to spoil the whole movie of course but there are other interesting things to note!! like how when they go to a fancy dinner the girl has white wine and the guy has red wine and it matches how she is blonde and he has darker hair!!i really do have to say just how so sweet it is that these two souls find their way to each other in the end because i want my daughters to find their way to a man like that like jack someday because you could tell he really loves maggie because he took her mother's engagement ring and apologized to her for how neither of them wanted to date each other before until she realized she had loved him and he didn't know he had loved her too!! #SWOON!!so in conclusion this one of the absolute best Hallmark movies i have seen to date!! don't pay attention to the FAKE reviews that clearly have not watched this movie because it is such a relatable romance that they clearly have NOT watched the same movie!! okay!! MovieMom signing off for now!!#MovieMom1973 #REALreviewer #reviewercommunity #talktoyourchildren #HallmarkHERO #MOMMYJUICE!!"}, {"id": 23, "text": "This Movie was super cute. I love Natalie Hall in all her movies. I know her the best from Charmed where she is so funny on the show and Winter Princess. These two had chemistry and I really felt for both these characters. The singing scene was my favorite, and the scene with Maggie and her dad. This is the perfect Christmas flick."}, {"id": 24, "text": "I enjoyed this despite Natalie Hall, who has never impressed me with her looks or, for some reason, her roles. Her acting in this was competent and sometimes pretty good. She had good chemistry with her male lead, the very appealing Evan Williams. He was outstanding. He really brought his part to life."}, {"id": 25, "text": "I truly enjoyed this. The acting was surprisingly good. I recommend it."}, {"id": 26, "text": "It's a classic romantic movie but with comedy characteristics. I will with another critic, it's better than hallmark movies. I liked it a lot. It isn't so cheesy. I recommend it without thought"}, {"id": 27, "text": "Honestly for a Hallmark-esc Christmas movie, it wasn't THAT horrible. It held my attention, and wasn't bad enough to a laughable extent.Why doesn't anyone make a Good Christmas movie?"}, {"id": 28, "text": "Two talk show radio hosts and long time best friends get them selves in to a situation where they have to introduce their significant others to their families live on the radio. Unfortunately both of their significant others break up with them, queue the fake relationship...one for which their families and everyone who knows them is super happy about. Then come the misunderstandings and past mistakes. I am sure it comes as no surprise to hear that this feel good holiday movie is all wrapped up with a satisfying happy ending."}, {"id": 29, "text": "Quite good movie to watch it with your girlfriend/friends when you want to get in to the christmas mood! Dont have expectations for something very good here! Sometimes guys we dont need actually something else! Just relax and watch a romantic movie!"}, {"id": 30, "text": "The movie is so bad that it's funny. It has it's moments, good acting though a bit over board at times. Watch it. It gets better towards the end."}, {"id": 31, "text": "I commend some of the other reviewers on here who lasted through the entire movie. My wife and I liked Natalie Hall in A Charming Christmas Town and had high hopes for this movie. We barely lasted 15 minutes before realizing how awful the script was. The characters were also not believable and just reciting cutesy lines while mugging for the camera. The leads had zero chemistry and just kept uttering nonsense that didn't amount to anything."}, {"id": 32, "text": "As soon as I saw it coming, i skipped to the final scene. Worst boy gets girl scene ever. Bad writing, and horrible chemistry. Worst first kiss ever."}, {"id": 33, "text": "Wait, did I tune into hallmark? What a white bread bland movie... is it a comedy??? Nope, unless you are in kindergarten. Forced acting, weak writing, overall lame. Don't waste your time unless you have insomnia, this will cure it. Hey wonder bread, Christmas called and wants it's crust back. YAWN"}, {"id": 34, "text": "Evan Williams was great in Versailles. I could not get through 20 mins of this but binged on Versailles for hours."}, {"id": 35, "text": "I prefer holidate for same kind, main is the same and not too funny. Many choice not this one"}, {"id": 36, "text": "Stopped after few minutes because of EXTREMELY RANDOM shot of OSLO even tho the movie is set in Chicago (and apparently filmed in Ottawa)...idk this just kinda ruined everything, it's like filming a movie set in Paris and then randomly putting a shot from New York and thinking people wouldn't notice. Really stupid move. Also pretty bad acting so far."}, {"id": 37, "text": "The Idea is great but the acting!!!!!!! Oh god I couldn't even finish the movie because of it. There is no chemistry between the actors and it's like they just memorized their line !!!!"}, {"id": 38, "text": "I 'm really love a good Holiday Hallmark movie. Midnight at the Magnolia isn't one of them. Bad acting, a bland story, and absolutely zero surprises...I'd skip this one."}, {"id": 39, "text": "Don't understand the negative. Maybe because it wasn't vulgar?? It was a nice, clean movie."}, {"id": 40, "text": "I loved this movie! The couple really sold me on their relationship, I was invested. Their families were so cute, caring and supportive. I actually got teary eyed towards the end and this rarely happens. The ending made me smile and I actually cheered and clapped at the end! Way to go Netflix, please do more of these movies!!!"}, {"id": 41, "text": "The acting wasn't great, which doesn't really matter to me with cheesy holiday films but the plot just missed the key moments. Things didn't flow and the storyline jumped from A to B with total disconnect. There were a lot of scenes that were ALMOST good but just didn't have the dialog and/or chemistry to pull it off. It was bland."}, {"id": 42, "text": "Very beatiful and chill movie. I think i will propose my girlfriend😂"}, {"id": 43, "text": "There's nothing good about this movie. The acting, directing, dialogue, EVERY SINGLE THING is AWFUL. Don't waste your time"}, {"id": 44, "text": "I love Christmas romance movies and the childhood friends falling in love theme makes it my type of movie. This one however is not well executed. The characters have no chemistry whatsoever and it's hard to believe that they are best friends. The male actor deserves some credit but the script is wooden. The song at the end was nice and the proposal scene but those still couldn't save this. Watch if you're bored."}, {"id": 45, "text": "I've seen A LOT of these movies, so it's really hard for one to stand out. I rarely get all the feels, but this movie had them. I loved the chemistry between the two leads. It even had me in tears for the last 20 minutes of the movie because it was so believable. This is one of the few must watch Christmas romances."}, {"id": 46, "text": "Nothing original in this movie, but it does what it'd supposed to for a romance, makes you feel good. I won't give away the ending."}, {"id": 47, "text": "I'm seriously taking the time to review so people don't waste there time and if you really need to Watch the first ten minutes and the last ten minutes so you don't feel you've wasted any of your lifetime"}, {"id": 48, "text": "I think this movie was made for kids under 6 years old. It is the only reason I find by watching the movie."}, {"id": 49, "text": "This has got to be the worst acting I have ever seen, especially by the lead female! The most predictable plot of all time... I predicted the ending about 5 minutes in. Zero chemistry between any of the characters. I only watched the whole thing out of boredom... but I suggest you don't waste your time!"}, {"id": 50, "text": "The acting was bad. I felt like they are reading the scenario from behind. The proposal scene was so fake. They were good friends. I couldn't feel the chemistry between them. It is maybe a good movie if you just want to spend your time for nothing. Not more."}, {"id": 51, "text": "I wasn't sure how this film would end up. The boy meets girl had a slight twist on the plot and it was a good watch. The two leads were great in the roles and the film did not seem to drag (as many of these types of films do). Give it a go, it's a decent Holiday themed film."}, {"id": 52, "text": "I enjoy Hallmark style Christmas movies and this one was good. The plot was a little predictable, but the actors and writing were mostly believable. A sweet film about the classic trope of lovers to friends."}, {"id": 53, "text": "A cliche, simple, not so complicated story. This is a perfect holiday family movie. The story is simple, acting is good, locations are beautiful and is a perfect combination of humour and love. Enjoyed watching this one."}, {"id": 54, "text": "Do not rent this movie for more than a minute, thats all you will need to work out what happens.. From the writing to the acting to the clueless characters and back to the writing , this film is terrible. I would take issue with those who say this film is predictable. I am not sure anyone could predict how terrible this was. I have watched just over half the film and think I may switch it off and finish the dusting instead. I am sure that would be much more enjoyable."}, {"id": 55, "text": "The movie is a well done movie like what you would see on the Hallmark Channel, not that there is anything wrong with that."}, {"id": 56, "text": "Hall and Evans pulled off this movie perfectly. It was campy and light but they balanced it out with how much they loved each other and their deeper more complex moments. I feel like the actors knew what they were doing in this genre and style which you don't often see with these movies. Script was cute and quick. This is a good movie to watch if you want something light and to see two actors enjoying each other. Don't watch this if your not into this style of movie."}, {"id": 57, "text": "These two actors r the wires. Could have put two better people together for this movie. No cemetery AT all between these toooooo. There is NO Love between these two,no passion. I watched it and I felt nothing between these two, Nothing not even when they were talking at that moment close to them most of all. Just nothing between these two. Could u have found two people that should be better at best friends or even brother and sister more than lovesers, come on this was the worse movie about falling in Love for anyone. They r so opposite more then I have seen in a couple in a loooong time."}, {"id": 58, "text": "Of course we know these 2 will eventually get together but that is ALL Rom Coms. The best part of this movie is the chemistry between Natalie Hall and Evan Williams. They effortlessly have chemistry and it is seen throughout the film. They also can actually act which does not appear in these type of movies unless there are well-known actors. And the writing isn't cheesy like other holiday Christmas movies. The storyline plays out well and the twist and turn are expected but great. I especially liked the ending tying the engagement ring to the end. Everyone has their opinions but for this LA, Latina woman, it hit everything I needed for a Christmas movie!"}, {"id": 59, "text": "Predictable as heck but SO cute. Had me smiling pretty much all the way through. Definitely worth a watch if you love a good romantic christmas flick."}, {"id": 60, "text": "I just saw the trailer and I am no longer interested in seeing the movie. It showed me everything. There seems to be no surprises left. So there's no way I'm watching this Hallmark movie now."}, {"id": 61, "text": "MarVista Entertainment is the production company for this film, which primarily makes made-for-television movies for, e.g., Lifetime, UPtv, Hallmark, ION and so on. And this includes a number of Christmas movies. So, my expectations were adjusted accordingly. That said, I enjoyed this Christmas movie. The story was fun and cute. The script/dialogue was good. The acting was strong. And the scenery, props and sets were of the same quality of a typical Hallmark or Lifetime Christmas movie, well-polished and festive. I might have even shed a tear or two at the New Year's Eve party at the Magnolia (near the end of the movie). In short, the movie pulled me in quite quickly; at no point was I, e.g., looking for my iPad. In terms of acting, this is the second Christmas movie that I have seen Natalie Hall in this 2020 Christmas movie season. She was also in A Very Charming Christmas Town (a Lifetime original Christmas movie), which was of the same quality to this one. I think she performs well in this genre of film, so when I saw her at the top of the bill, I was looking forward to seeing this movie. Overall, I thought she had a strong performance as Maggie; it was convincing. Evan Williams (as Jack) was also pretty good in this one, though I thought he was a bit less convincing towards the end, the scene where his future father-in-law (played by Steve Cumyn) gave him the ring. What stands out for me is their dialogue, their interaction, their banter. Unlike some reviewers on here, I thought they had good chemistry. It was one of the elements of the movie I enjoyed most. The supporting cast had a pretty good performance as well. All in all, it is a cute, funny, and entertaining movie, a nice new edition to Netflix's Christmas movie catalogue/lineup."}, {"id": 62, "text": "This one wasn't terrible, but it wasn't the best, either. It has a pet-peeve of mine: forced love story. I was shocked when Quinn admitted she has been in love with Jack for her whole life. (Not a spoiler, it's obvious.) She didn't seem in love with him at all. This movie thought it could use words and that would register in our minds as chemistry. It doesn't work like that. As for this whole radio show thing, what even..? Who on earth would be interested in a meet the parents segment... ON NYE? Not I, said the cat.The acting coming from the side characters is horrendous. When they made an announcement that was supposedly really big, the wows coming from the family was not convincing at all.As for the positives, I thought that Jack was a model love interest for these types of films. He wasn't a deplorable male character just there for staring at, I actually thought he was an okay guy. I have more to say on this film, but I believe I don't have much more description for it. I say just watch it for yourself and see If you like it."}, {"id": 63, "text": "This romantic movie has a bit of a backward problem. It is one of the first *good friends turn into more* movies where I bought the *good friends* way better than the romance. The move has two characters who have been friends forever and happen to have an AM radio show in Chicago. But this doesn't quite work for me. How does that happen? Ie. your best friend from childhood gets a hosting job with you on radio? Seems improbable. Since all their listeners want them together anyway, they get the great idea to pretend to be a couple to boost ratings and get a syndication deal. The only problem is that this movie failed to provide any hint of a romance. The main male character, Jack, is wonderful but he doesn't do any of the particular things men in love do. No long looks at his beautiful best friend. No jealousy at other people looking at his hot BFF. In fact he doesn't seem to be interested in the female lead at all. The female lead is not particularly a great actress but I do buy that she has always had a thing for Jack which is getting in the way of other relationships. It isn't bad, and it is enjoyable. but you won't really get the UST you might be looking for."}, {"id": 64, "text": "Let me just say that I absolutely LOVE schmaltzy Christmas movies and am more than willing to ignore plot holes or inconsistencies if the story and the actors draw me in. Unfortunately, that didn't happen here.The leads were fine - they came across as realistic long-time friends. The rest of the cast, and the casting were huge issues for me. The acting was TERRIBLE...it was very difficult to watch, in my opinion, and just highlighted the issues with the script.National frenzy to see two local-market MORNING RADIO hosts host a TELEVISED nighttime New Years Eve party? When the duo had been airing in the national MORNING market for less than a week? With the premise for the sold out get-together being to watch those radio hosts introduce their families to their significant others? I am not sure what these people think folks do on NYE, but it's not this.The parents' failing jazz club is selected as the party venue, but somehow the strugglingckub owners are responsible for paying the high dollar entertainment booked by the radio syndicate. Yet somehowthe syndicate handles the ticket sales. The daughter encourages her father to buy a new tux literally seconds after telling him to watch expenses and stay on budget.I'm sure it all wound up happily ever after...hopefully including payment for the dads and a revival for their club. Unfortunately, I just couldn't make it more than halfway."}], "reviews_amount": 65}