{"name": "Nirbandham", "titleId": "tt13231270", "reviews": [{"id": 0, "text": "It's raw and realistic movie this shows how people's are struggled in 2020 lockdown and how girls are brave and how to be strong. finally BSK one man show.. 👌👌👌"}, {"id": 1, "text": "High on Emotions.. If you like Raw intense movies go for it.. Genuine effort which address some issues we're facing in society, lock down struggles.Kudos Bandi Saroj Kumar.. One Man Behind this.."}, {"id": 2, "text": "Wonderful writing and direction! Kudos to the entire cast and crew."}, {"id": 3, "text": "Nirbandham is the best relastic movie I have never seen so far in telugu and it depicts the actual situations of the India during lockdown (For full review check my Instagram @flick_suggestion"}, {"id": 4, "text": "Kiraaaak movie annaaaaa loved watching the movie. Amazing characterization screenplay good content. Just one word AMAZING."}, {"id": 5, "text": "I rarely give ratings to the movies.. Definitely we need to support realistic stories.. Talent director's like BSK { new Age RGV}Stunning direction &amp; Emotional dialogue.Content is outstanding.. expecting more &amp; more realistic contents..Awaiting for pravaham movie"}, {"id": 6, "text": "It's raw and realistic movie it's not just movie it shows how people's are struggled in 2020 lockdown and how girls are strong and how to be strong...."}, {"id": 7, "text": "Realistic, raw and bold film and will last one of the best and underrated movies from Telugu"}, {"id": 8, "text": "Bandi Saroj Kumar wrote a bold content on present situation. He portrayed every character very realistic and natural. That boy character is wonderful. That boy character shows, how much bad things are impact on future generations. Everybody perform very well. Please watch and share."}, {"id": 9, "text": "Very raw and realistic.The way director potrayed the characters are bold and amazing. Movie deals with social issues in society."}, {"id": 10, "text": "Telugu movie based on current issues, lockdown, politics... great attempt by BSK"}, {"id": 11, "text": "Nirbhandham is an interesting bold attempt , script , music, colors , photography, acting at top notch.Bold and Brave ..Kudos to the Creator Bandi Saroj Kumar and his team."}, {"id": 12, "text": "The real emotion carried through out the movie. Apart from few bad words every one should watch the movie and get to know how is the present society."}, {"id": 13, "text": "Every body talks about language used in this movie, but it's the reality of life. I loved it very much, though why I reduced 1 star is for making values(may its very much better in the given budget)."}, {"id": 14, "text": "Just see once and u will get to know how pure it is"}, {"id": 15, "text": "The best part of the movie I have liked is portraying Ambedkar as a beacon of change. Hitherto religious symbols or hymns or religious books have been used in movies to showcase mending of ways of characters on silver screen. It's a welcome change that a legal luminary was symbolised for reformation. Also, the movie director has symbolically shown that DrAmbedkar is much relevant and he is the need of the hour in the present political and social chaotic situation. The director must be congratulated for his boldness."}, {"id": 16, "text": "Very Raw and Realistic film. Must Watch film. Every Women should watch this film"}, {"id": 17, "text": "A new age cinema with bundle of talent behind it. Must watch"}, {"id": 18, "text": "Superb Direction, clarity against the script. It's one man show in every good feel in the movie. You rock #BSK"}, {"id": 19, "text": "The movie was very good. The screenplay, writing everything was executeed very well. Go watch it."}, {"id": 20, "text": "Raw af. Watch and contribute this indie film maker"}, {"id": 21, "text": "In my point of view this film is a gem. It's a underrated masterpiece. One of the best film on this Pandemic. I was wondered why few film blogs including some critics are not focused in this one. When comparing with few worst OTT release films it's a much watch one and also content wise it's a sensational one. With just a very lowest budget &amp; less production values we never imagine a film like this. All credit goes to underrated film maker Bandi Saroj Kumar, a great technician with high potential. He created a sensation and a way to many aspiring film makers who's having content but no support. With his idea few aspiring makers started like this. Especially Telugu film industry need more film makers like Saroj. As a audience I'm telling that this film deserve more attention. Plot point and taking is really excellent. Antharleenangaa unna sandheshaanni ardhamcheskunte e film mind lo nundi konni days podhu. Go for it. Must watch and highly recommended film."}, {"id": 22, "text": "The movie was really awesome . it's showed the reality of lockdown and the society around us worth watching the movie"}, {"id": 23, "text": "A film which is based on real incidents which remain unheard nd unseen #Bsk you are an actor bro👏"}, {"id": 24, "text": "What a realistic movie.... No words for your movie taking..."}, {"id": 25, "text": "Raw and Rustic . Brillant take on So Many Subjects at the Same Time Making Aware.Art is Always Bold in World Cinema it relifects Society"}, {"id": 26, "text": "The movie is excellent. After Arjun Reddy this is next Arjun Reddy I can say. It's very rare in tollywood to get content oriented movies but this was one of them. Bold, emotional and extraordinary performances by everyone. Good job BSK all the best for next movie."}, {"id": 27, "text": "Film revolves around the main character Ranjith, and his life events. Brilliant writing and direction. You should watch it to feel it."}, {"id": 28, "text": "I believe in prevention and awareness in the society than any corporal punishments. Women are the empowerment of our society. Women should be respected, looked upon and followed, because without women there's no Men. So the point is this film portrayed all the downtrodden lives during a pandemic when one country announces lockdown, under current there is a theme of women role in tackling elements like pandemic and harassment of women. This concept should be a series than a movie as the director show his vision rather than unwanted commercial garbage. Please do watch, it's one of the master piece of Telugu cinema."}, {"id": 29, "text": "I like the way he visualized the incidents. The best thing is he never went for skin show or awkward scenes to picturize the rape incident in fact he choose the language to create the similar impact.Great product... Expecting many more and thanks BSK"}, {"id": 30, "text": "Music, photography and action of Saroj Kumar is top class. Must watch film which is based on situations faced by migrant workers during lockdown."}, {"id": 31, "text": "Very naturally shown the evil cultures and people exist in it .Back ground music and colours are nice , main actors tonal quality &amp; diction needs to be improved."}, {"id": 32, "text": "Story telling in dramatic realism, raw and clumsy depiction of recent pandemic scenario with creative liberties."}, {"id": 33, "text": "Awesome screenplay where in characters have never acted in the movie rather they have lived up to the context. Screenplay is completely engaging, and each and every scene is natural and artistic. One lagging is, I personally feel that dialogues would have got the same impact with less abusive words also as the movie connects emotionally to all the audience."}, {"id": 34, "text": "Excellent movie 👌 Making 👌 Music👌 Actors performance 👌 Realistic &amp; Natural 👌 Must Watch Film 👌"}, {"id": 35, "text": "Excellent 👌 movie i never seen before fully suprised when I watch the movie , don't Miss it guys"}, {"id": 36, "text": "This movie gives a socio economic education about the dark spaces between us. The satirical take on political system and our thought process which values money, stature compromising empathy...might make us sit and rethink again. Our failure to be humane looms over us and we could be the next victim. Thought comrades are long gone...happy to see a live one in the director. Regards to the whole team."}, {"id": 37, "text": "Fearless effort...the man behind all emotions... truth is truth... versatile n unique artist...Mahesh Anna u touched ..."}, {"id": 38, "text": "A film which has its own reasons to be named CULT"}, {"id": 39, "text": "Based real incidents the way characters were showed in the film talks about how painful human life's took place in India when conona hits the country, the film deals with unimaginable and worst situations of migrants of indias when they did not avail any help the from governments."}, {"id": 40, "text": "Fantastic, pure reality behaviour of criminal minded people characters shown in the film,Villian ranjith performance was outstanding,his way of speaking was attracted very much to me, inspirable movie for upcoming movie makers.... No more budget+No media support+No celebrity support+But sensation with thinkable content=Nirbandham Movie............"}, {"id": 41, "text": "Great effort by BSK to showcase ground level reality from daily wage labor perspectives using very few characters ; during lockdown in world's biggest democratic country, second biggest country in terms of population but with high poverty rate."}, {"id": 42, "text": "Nirbandam..prior to movie review I would like to review the audience types..there are 3 kinds of audience ..one group is very specific about their kind of cinema..be it comedy , action , fiction and cant enjoy others...second is watch all but very superficially, popcorn movie watchers..and third is true art lovers who can be moved by any sort of film if the content is genuine. This movie is for third category purely...for those kind who got connected to emotion in Satya movie or NH7 not the violence...Nirbandam is purely 18+ movie,its a recent released movie on YouTube directly. By some chance I happened to watch the directors interview first, then the trailer and then the movie..This so far not so famous but technically brilliant director B.saroj kumar who mastered 11 crafts is a gem yet to come to light ..he is the one who directed a critically acclaimed Tamil.movie Porkalam in 2010 mastering 11 crafts.. if u watch the trailer alone most would be come to a conclusion half way thro that it's a attention seeking c grade film...but if u take patience to watch the full trailer and extend the same unbiased mind to watch this 80 min movie u would come out with a heartwrenching story haunting you...its strictly not for those who cannot tolerate cuss words and see the intention behind using such language to depict the truth in raw form. There is not a single frame which is visually disturbing or banking on skin show which is expected by most watching the trailer. The director shows what draws young minds to crime since childhood in a very subtle way without any direct dialogue about it...be it the way they r brought up on streets, child marriage and poor supervision of kids, engaging them since childhood in such activities, criminal psyche,their opinion about women and brainwashing others with their philosophy, unemployment, bad company not realizing that they r messing with someone's lives...its the intention of the direction that drew me to the movie..if u can survive the first 15 min unbiased then will watch the rest with an open mind.. Do watch it, nirbhayanga nirbhandam choodandi..let me know the feedback too."}, {"id": 43, "text": "Honest Film making.. Every aspect was Depicted in most realistic approach and yet staying away from Nudity. Is what Defines your approach and responsibility towards society.Language or Dialect used is apt to the scene and the charecters , in its most natural form Climax stands out...I have watched and payed..Though an art form can't be measured in commercial terms,BUT SURVIVAL of such film-making needs it.All the best and come up with most exciting content. As an Aspiring Filmmaker would like to see you Doing Different genres.. Porkalam shot composition is what we are looking forward to see from you..."}], "reviews_amount": 44}