{"name": "The Phenomenon", "titleId": "tt13095604", "reviews": [{"id": 0, "text": "Highly recommended for anyone interested in the subject of Unidentified Flying Objects. Director James Fox's explosive documentary is one the most credible and revealing films ever made about the long-standing global cover-up and mystery involving unidentified aerial phenomenon. Including shocking never-before-seen testimony from high-ranking government and military officials, NASA Astronauts, and riveting footage, the timely film includes bombshell reveals about UAP incursions at nuclear weapon facilities and the monumental events behind the NY Times' recent disclosure of The Pentagon's secret UFO Program. Providing eye-opening evidence that mankind is not alone in the universe."}, {"id": 1, "text": "I've seen most if not all documentaries on this topic over the last 40 years &amp; this is just a wonderful addition to the subject &amp; one of the best, if not the best!They present some of the most compelling cases with irrefutable evidence, often from high ranking military witnesses, surely they can't all be delusional?Beautifully done, as usual from the lovely James Fox, watch with a non believing friend, they'll have a hard time arguing with you afterwards."}, {"id": 2, "text": "People talking trash need to understand one thing. The importance of this documentary is not in the next new undeniable evidence, its about keeping the awareness on the UFO subject and the fact that we are still waiting for disclosure. And the doc is doing exactly that by delivering the statements of the most credible military/government officials sources in the last 60+ years. Densley packed and on point. Jamie Fox continues to be our hero and fighter for the Truth."}, {"id": 3, "text": "If you're an avid UFO buff, there isn't much new in this documentary. It is, however, an excellent narrative of all the known facts to date. The highlight is definitely the children from the Zimbabwean primary school and their reactions to their contact experience. For anyone interested in the phenomena, this is a must see introduction to the most sinister cover up in human history."}, {"id": 4, "text": "I don't get how this is not the biggest story in the History of Humanity! People are choosing to bury our heads into the sand; and that's never been a solution for anything."}, {"id": 5, "text": "The best ufo and witness testimony video I've ever seen. The whole world is an illusion we've been fed and the lid is coming off. We have brothers and sisters from other planets we've been denying their existence."}, {"id": 6, "text": "I loved the fact that even the old ufo cases where not ones I have seen time after time. The new material covered is done very well. I was glued to the screen. Really presented everything in a great way."}, {"id": 7, "text": "James Fox and his associates have delivered the best UFO documentary to date with The Phenonmenon. It's a linear journey with ample supporting historical sightings and excellent witness corroboration. Though you likely have heard of many of these they are simply better presented here. There are also some you likely never heard of too. They go together quite well. You have big statements such as Senator Harry Reid's bombshell revealing the bulk of what the government actually knows is still tightly suppressed and he knows enough to say this. Christopher Mellon flatly states he is 100% certain we have been visited and there is proof yet to be disclosed. What really is appreciated is the somber seriousness of this documentary. We get, perhaps, in one film the best and most compelling witness testimony gathered together in one place. That makes this film really rise above the whole UFO phenonmenon as a kind of leveraging tool which should spur, finally, some real groundbreaking disclousre. In the mean tine this will do as striking proof that, yes, we are not alone."}, {"id": 8, "text": "Not sure about UFOs/ UAPs - start with this movie.This UFO documentry has the production quality you might associate with PBS or th BBC. In other words, it is serious, compelling and very made. Credible witness and consistency in reporting make this a turning point for the subject.Amazing."}, {"id": 9, "text": "This movie shows us how the coverup started, and that the phenomenon is here. And that the phenomenon continues to be here. I loved to see the Westall school students as adults. And the Ariel.School witnesses too. All credits to James Fox and crew! Definitely a game changer. Watch it!"}, {"id": 10, "text": "I've seen just about every documentary there is about this subject, so naturally I watched this one too! I really liked it, I liked it even more because they avoided the usual frauds and attention seekers in this field. (Maybe with the exception of George Knapp but he was barely featured - thankfully!) So it immediately had more credibility than some of the other docs about the UFO phenomena. If you are interested in the truth or just want to know what's happening in your own backyard this is a good starting point."}, {"id": 11, "text": "For me this was pretty ok. There was some incidents and footage that I'd not seen before (I never knew about Zimbabwe 1994) and that made it interesting for me. There are some high profile names and careers in this, which lifts it a step above the normal tin foil hat brigade. What did annoy me, was that straight from the beginning, there was loads of cheesy background music crowbarred in, which made it quite planky to be honest. Another big mistake by the filmmakers was not offering the film out for rent (in the UK anyway). All you could do was buy it. I mean who wants to own a documentary for £8? I don't and never will. 7/10 does it for me."}, {"id": 12, "text": "Dialoguing with some other reviews here, although they might have advertised that they had more than they delivered, I'm super satisfied with this documentary because it brings the aspect that is missed the most in content about this subject, seriousness. With all the spookiness and drama attached to other documentaries it's hard to concentrate on the actual point, there is real evidence we are already in contact with intelligent ETs. So hand picking all the best evidence, with the most relevant people being interviewed, and doing that in a very professional way was exactly what this subject needed it to be. 10/10 for me"}, {"id": 13, "text": "This is the best documentary film on the subject of UFOs out there!!! Whether you're a seasoned Ufologist or new to the subject there is plenty to see here. No tin foil hat theories or far fetched tales of little green men, just credible cases backed up by government officials and encounters that will leave even the hardest nosed sceptic scratching their head. James Fox has certainly delivered on this one. 10/10"}, {"id": 14, "text": "I think this is by far the most informative documentary about aliens and UFOs. I was a skeptic up until Bob Lazar's interview with Joe Rogan. But this documentary just collected all the evidence and slapped me across the face with it. I am now a believer."}, {"id": 15, "text": "Some of the best cases about what I call the visitor phenomenon well told."}, {"id": 16, "text": "Unfortunately there's no new info in here for anyone already familiar with the subject of UAP's, its more of a compilation of events we already know like the back of our hands. I regret paying the huge fee to watch it.For newbies to UFOlogy it will give a nice overview of the topic, but it begs the question of why they would go looking for it in the first place.Feels like a cash grab on the back of TTSA's work, which is not even mentioned or acknowledged whatsoever."}, {"id": 17, "text": "Just another rehash of already known information. I've seem most of this stock footage about a dozen times in other UFO type series. This is a good overview for people that don't already know all this or haven't seen the info elsewhere."}, {"id": 18, "text": "A very good documentary with confessions from people that would convince the biggest sceptic. Well worth a watch."}, {"id": 19, "text": "First, I saw Joe Rogan experience #1574, free on Spotify where Joe interviews filmmaker James Fox and UFO expert Jacques Vallee. Fascinating, their telling of their EXTENSIVE research, going from the 1940s to 2020. Then, for $4.99 on Prime, I saw their movie, The Phenomenon. It is the most COMPLETE history of Unidentified Flying Objects, on and around our planet, that I've ever seen. The whole film is very interesting, but the 15 minutes at the end Where are you see and hear young school kids in Zimbabwe South Africa, who have seen, close up, a craft that landed and the beings on top of it... YOU WILL BELIEVE. Then, 19 1/2 years later, some of them are brought back together, and they still all agree as to what they saw. I hope that you will see this film. There are many films, photos and 4 stories of CONTACT between humans, and people from somewhere else."}, {"id": 20, "text": "Even the Aliens are warning us that we are killing ourselves and the planet."}, {"id": 21, "text": "This is the definitive documentary on the UFO phenomenon that we have been waiting for, an exhaustive presentation of the best cases and evidence to date. If this doesn't convince you, nothing short of a UFO landing in your backyard will. While there isn't a lot of new information, what is shown is compelling and well-presented. This is the one you should show to skeptics"}, {"id": 22, "text": "This doc delivers. Not just a rehash of a debunked story I heard before. This one actually takes a fresh approach and strives for a little credibility with some reputable witnesses, some ranking military, and government officials. Some cases are new, and some were new to me as I was somehow unaware of the Ariel Encounter. The quality of the documentary is done very well. With Peter Coyote narrating it felt as familiar as any other topic he narrated before. Whether you have a casual interest in this subject, or are a little skeptical you will find this presentation entertaining, and perhaps intriguing to the end."}, {"id": 23, "text": "Not much new materials in this documentary but it does a good job summarizing all the existing materials out there. A good bird's eye view of the entire UFO phenomenon from a historical perspective."}, {"id": 24, "text": "I'm over 50 and this documentary finally convinced me that we are being visited by others of some sort. Whether they are from another planet or the future or something else is of course undetermined. But so many reliable witnesses as well as the captured footage is convincing. If the former Senate majority leader believes then you probably should too. The two events witnessed by multiple children are also very convincing. There is no way you can get 20 or 30 kids to agree on a lie and flawlessly maintain the lie over decades. They very likely have stealth technology, so the one comment that stands out is why are they allowing themselves to be seen at all. My guess would be to prepare us for an eventual public contact. But hey who knows. Maybe their stealth technology is unreliable :)"}, {"id": 25, "text": "I am curious about UFOs but haven't done a lot of research myself (just watched a few documentaries and videos online) and I have to see this one is really teaching me a lot of information and make me ask why UFOs aren't commonly accepted as existing. If you're skeptical or i you wonder whether UFOs are real or only jokes and hoaxes, watch this documentary, you won't regret it. The first time in my life I leave a review on a movie or documentary, because this one deserves it."}, {"id": 26, "text": "I don't normally leave reviews (this might be my first one), however this documentary is the definitive collection of evidence on the subject of UFOs. I have researched the subject out of sheer curiosity for over 10 years, and this film consolidated the most compelling cases I've come to know with the exceptions of a few.Not only that, but the documentary was edited in a way that most effectively depicts each series of events. The one example that stood out to me was how they played the most crucial bit of Charles Halt's audio clip as they recreated the Rendlesham UFO encounter with outstanding quality.If you're a fan of the subject or curious in any way, this documentary is a must-watch. It will catch you up to speed on a large portion of past cases minus some big ones (Kecksburg, Phoenix Lights, Exeter, etc), but also bring you current with more recent revelations (Nimitz). Enjoy!"}, {"id": 27, "text": "One of the best documentary on the subject of UFOs, for those who are interested into it, there is not to much new information, but the stories are put together very skillfully, suggesting that the next step is (partial/full) disclosure in regards to the UFOs."}, {"id": 28, "text": "Heard it all before but Fox , made a higher quality video . If you have not looked into ufos this is a easily digested peace of eye candy . Good production values . The last five minutes of the video could have explained the sighting in Zimbabwe . They have Ariel film of the school but there is no j fixation of where the UFO and aliens got out and walked around in relation to the school kids. I think for the beginner this would be a good UFO film ( video ) to start with ."}, {"id": 29, "text": "Technology and capabilities captured and studied by our government is for OUR benefit and defense and not for general release or distribution."}, {"id": 30, "text": "Best ufo documentary ever . This documentary is very informative and will get you grip right from the off . Especially if you're into the ufo phenomenon"}, {"id": 31, "text": "The phenominon is just more of the same cover up stories that everyone knows about already there is absolutely nothing new or revealing see the unaknowledged its better and more revealing but the same old same old. yes the govt is covering it up.no they dont want to admit they are powerless to stop Ed's from doing whatever they want because the govt wants to stay in power so the turn a blind eye. its a fact"}, {"id": 32, "text": "They live among us even before arrival of our first couple to this planet just15000 years ago. Yes we are aliens and they are the true terrestrial beings and their creation from plasma keeps them invisible from our eyes most of the time. They live among us, below us and above us. Why they gave us a feeler of their presence during second world war coz we used nuke that did not only kill our own breed just like wolves do rather we kill them in abundance. And subsurface nuclear tests kept on killing them. If someone has doubts then one can approach the higher officials of the state. A movie taking the innocent minds away from the true facts. I feel pity. Well do your own research. These flying vessels of these Earthlings (Djinn) appears where there are military dumps of WMD. Still need a clue? Watch the USA map at 29:17 of this documentary video showing the locations of the sightings of UFOs. Those locations were 95% the military dumps of WMDs at that time. :)"}, {"id": 33, "text": "Let me explain. I've had an interest in this subject for many years. I've watched thousands of hours of documentaries, youtube videos, discussions, interviews and so I have to agree with one of the other reviewers here that there was nothing in this movie that was new to me. It's basically the same old stories that have been in every other documentary and TV series. Before its release there was promises of revelations, bombshells and the like and if you're new to the subject then that would seem to be the case, but in reality all these events and incidents have been replayed and revisited in a hundred other documentaries. I did like the animations of various craft. It gave me an idea of what the witnesses were actually seeing at the time, and this is a topic that needs as much exposure as possible to pressure the world's governments into revealing the truth so the more dicussion this movie gets, the better. From the way this was advertised, I was expecting an even more explosive version of Dr Steven Greer's documentary 'Unacknowledged'. Sadly it wasn't the case and it looks like 'Unacknowledged' will remain the pinnacle of UAP exposure movies for some time to come. I gave it seven stars as it was very well put together and will help to get the message out there but it lost three stars for not containing anything new or explosive or anything even resembing a bombshell."}, {"id": 34, "text": "I've been a science guy all my life. A little over 20 years ago I worked the Drake equation with numbers that seemed pretty reasonable to me and came up with N a bit less than 1, meaning that the odds were, we were alone in our galaxy and that other life probably exists in other galaxies, but we're alone here. I caught the David Fravor episode of Joe Rogan Experience and that really kinda did it for me. The thing about this documentary is that the vast majority of the witnesses are sober, serious, credible people. Generals, naval aviators, presidents, senators, defense department officials, missile launch officers, etc. These are not easily excitable whack jobs. What is abundantly clear is that they are out there. They are also, for the most part, not interfering. Here's my theory on it: They made a huge display of force and a hey, here we are back in the early 50s. Then Roswell happened, and the government started trying to suppress discussion of it to the point where it became fringe, whack-job seeming territory. The visitors probably decided that we're not ready for them and backed off. Here's the thing: I think as a species, we're desperately in need of help. I think we're on the fast track to extinction. According to a 2010 Nature article, since 1950, 40% of the phytoplankton in oceans has disappeared due to ocean heating and acidification. Phytoplankton accounts for half of our oxygen supply and it's quickly disappearing. The other half of our oxygen supply is rapidly being burned to the ground and we have an addiction to oil that's making all this worse. And this isn't our only problem. We have lots of them. Nuclear waste, biological weapons (and the capability now for anyone with a few tens of thousands of dollars, to build custom viruses. How long until an psycho biologist wipes us out?). We're doing a lot of things wrong and I think most of us feel overwhelmed by the problems and I think as a species, we're overwhelmed and don't know how to fix these things. We should ask them for help. They're clearly not here to hurt us. Maybe they're just waiting for us to ask the question. I think the UN should send a signal out, doesn't matter where. Just broadcast. They'll get it. If they're inclined to help they will. If they don't, we're no worse off. But if nothing else, maybe us asking for help will also be us admitting we have a problem and that may be a big help too."}, {"id": 35, "text": "Greetings again from the darkness. One has to hand it to documentarian James Fox. He is nothing if not persistent. And persistency is a requirement for anyone involved with researching and reporting UFO sightings that now date back more than 70 years. To give you an idea of Mr. Fox's commitment to the cause, he also directed OUT OF THE BLUE (2003, which was also narrated by Peter Coyote) and I KNOW WHAT I SAW (2009), and produced (with his father Charles) UFO'S: 50 YEARS OF DENIAL (1997).Peter Coyote is back as narrator for Mr. Fox's latest project, apparently inspired by the 2017 New York Times report of the secret Pentagon UFO program called Advanced Aerospace Threat Identification Program (AATIP), which details US Navy Pilots' multiple encounters with Unidentified Flying Objects. And just this year (2020), the US Defense Department confirmed encounters classified as 'unconfirmed'.For many years now, we have heard the claims that, We are not alone in the Universe, and There is something else out there. This film lays out the photographic evidence and the eyewitness testimony, as well as researching the secretive nature of the government on this topic for so long. We hear from some of those affiliated with Project Blue Book, the UFO investigative initiative formulated by the US Air Force. Many pilots and crew have documented what they've seen, and there is even a 1998 interview with Astronaut Gordon Cooper, providing more credibility to the sightings and encounters.The film somewhat works as a timeline, but director Fox chose to bounce around in time, which provides some structure, while also working against a chronological perspective. It goes back to 1947, when pilot Kenneth Arnold reported an encounter with multiple flying saucers in formation near Mount Rainier, and then details more sightings that occurred over the next few decades, including: 1952 invasion of secure airspace, 1955 military pilot William Coleman, 1957 Levelland, Texas sheriff, 1966 landing in Michigan, and the 1966 Congressional hearings. We learn of The case that changed everything, a 1964 New Mexico encounter with Officer Lonnie Zamora, which left evidence such as landing gear imprints, footprints, and a burn area.As you would expect, Dr. Jacques Vallee and Dr. J Allen Hynek are included here. They are two of the foremost experts on UFO research, and Dr. Vallee was the inspiration for Francois Truffaut's Dr. Lacombe in Steven Spielberg's classic CLOSE ENCOUNTERS OF THE THIRD KIND (1977). Director Fox does a nice job mixing the interviews with experts, historians, military personnel, intelligence officers, and eye witnesses - interviews that have taken place over many years. For skeptics, plenty of international work is blended in, as we learn of the students in 1966 Australia, the 1982 Ukrainian nuclear site, and in the Contact section, we hear of 1959 New Guinea where the aliens waved back, and 1994 Zimbabwe, where students reported being communicated with telepathically.Billionaire Laurance Rockefeller held a lifelong interest in UFO's and used his influence during the Clinton Presidency to drive the de-classifying of crucial documents pertaining to the 1947 Roswell, New Mexico incident. We also learn how the government has invoked similar cover stories for the public for many decades ... does weather balloon sound familiar? Harry Reid, Senate Majority leader from 2007-2015 also pushed for more transparency, but even with his insider power, it seems clear some things fall into the Above Top Secret category, and will likely never see the light of the day. That's part of what causes the stigma for those who speak up, and why certain folks remain persistent in uncovering the truth ... it's out there. Cue the X-Files music."}, {"id": 36, "text": "My interest in UFOs spans 60 years. My family was one of those luckily cursed to have had an incontrovertible encounter with . . . a flying saucer. Over the house. Not swamp gas. I write flying saucer to be simply descriptive as to what seven people experienced. You can search for 6 decades, you can read the books and watch the films and talk to people all over the world about their experiences and nearly give up because of the fierce and intentional noise-to-signal ratio. In all that time, this life-altering experience and the conjectures of Jacques Vallee are what kept the searchlight of my inquiry aimed steadily into the dark night. What is PROFOUNDLY important about this film is perhaps too subtle to be appreciated by those hankering for tentacles and explosive revelations. Mellon says it very simply toward the end of the film: (I paraphrase) . . . They are real. They are here. Now. This production erases all the what if's and if only we knew, the when will we get the truth and the government cover ups. Every one of the countless books of conjecture and claim, counterclaim and shocking revelation is NOW rendered irrelevant. It's no longer relevant what we thought we knew. With the (inexplicable???) decision on the part of the US navy to release the films, acknowledge their existence and admit something is in our sovereign airspace about which we know nothing and over which we have no control, the flood of suppressed and murky data have an undeniable gravitational center to which all considerations NOW can aggregate, clarify and ultimately foster informed critical analysis. IF . . . and careful attention must be paid to those faces and the things unsaid but shouted, this new gravitational attractor can unlock the still suppressed and officially denied MUCH LARGER caches of data. (And why are they hidden and by whom?) For those who are informed enough, there remain the many questions skimmed over here in order to make a reasonable first-order revelation for the masses. A watershed moment in world history. . . not that it will be widely realized."}, {"id": 37, "text": "It's impossible for a rational, intelligent person to dismiss the enormous volume of mounting evidence that even a sceptical, inquiring mind would be startled to learn.The film makers collected a seemingly unimpeachable list of scores of corroborating witnesses who described the same account. Dozens who saw the same thing and experienced actual first contact. Career military and public servants who have a lot to lose. Scientists, pilots, clergy, career military, investigators, ordinary people and children.Whether these are extraterrestrial or the future us that in 100 or 1000 years have harnessed quantum mechanics like Einstein, Hawking and others had explored and asserted possible. Existence of new technology has been characterised into the stuff of Science Fiction, moulded into a comedy routine, a cartoon, a Will Smith blockbuster. When you reflect that science fiction has a habit of turning into fact. Reflect how far technology has advanced in the last 20 years and how amazed if we had much of what we do now 20 years earlier. Imagine what our great, great, great grand children will be able to achieve in 150 to 200 years. Who knows if these are really humanoids from space, another dimension or are we being visited by our own future custodians.If you're a sceptic, at the very least you'll take pause. If you're a believer your thirst won't be quenched.One thing is crystal clear - we truely are not alone, and that is strangely comforting."}, {"id": 38, "text": "This is my first review on IMDB, but one I really felt i needed to share.Never in my life have I questioned the reason for our exisitence on Earth. Its incredibly hard to comprehend that another lifeform exists and has been living among us, in our universe, since the beginning of time.The recent news surrounding the Ex-Israeli Space Chief, Haim Eshed revealing that government has been in contact with an alien lifeform for years in secret led me deep into the rabbit hole of researching past UFO encounters.Since watching the film, I am finding it very difficult to class the encounters that were witnessed by the interviewees as false. Case by case, the similarities of these encounters over decades and across the globe are far to consistent for me not to believe. What the witnesses's say seem to remain fairly consistent. However, the government cover ups don't seem so consistent.People are becoming more self-aware in the world we live in today, the government are continually called out for their mistrust and lies. I strongly believe this is no different when on the subject of UFOs and alien lifeforms.As Christopher Mellon states at the beginning of the film, we need to prepare to accept and understand that we are not along in this universe and have not been at all throughout this time.I would urge everyone to watch this film and forge their own opinion of what is really happening here."}, {"id": 39, "text": "The Phenomenon is a recent documentary currently available on demand at Vimeo and on Itunes. The documentary is made by James Fox and narrated by Peter Coyote.The 2017 story in the New York Times shook up the near dormant world of UFO chasers and believers. A main stream media outlet seriously weighed in on the topic, with viable sources and credible video material.This documentary zooms in on some of the major events with footage of people that were present or in function at the time. To name a few; the Rosswell incident of 1947, the Westall sighting in 1966, the Ruwa Zimbabwe incident of 1994 and the tictac UFO event in 2004, the last one was also covered in the NYT article.The Phenomenon is certainly entertaining. The only thing I disliked is the structure of the film, the mishmash of big and small items and chronological ordering left a chaotic impression with me."}, {"id": 40, "text": "One can only hope that the between the stellar cinematography &amp; the cast line up of so many heavily credentialed, credible government &amp; military officials drives home the truth of the ongoing UFO Phenomenon to those who scoff at the idea that we're alone in the universe and on our blue marble!!. A couple of other reviews mentioned that much of the film was the same old stories. Although I too have seen stories in a number of other films, what I very much appreciate in James Fox's work, is that he added material regarding some of them that I have not previously seen. I truly enjoyed the thoughtful manner in which he lined the discussions and witness testimonies up and the seamless story telling harmony in which the witness stories were presented, giving some of them the depth &amp; context that they deserve! The Zimbabwe siting testimonies (then &amp; now as adults, plus their teacher's) was powerfully moving. All in all, I'm a big fan of James Fox's documentaries, having seen most of them. He absolutely &amp; unequivocally did not disappoint in The Phenomenon. I'm not sure what Mr. Fox has up his sleeve for his next project, but I would LOVE to see a collaboration between James Fox &amp; Steven Greer!"}], "reviews_amount": 41}