{"name": "Gatham", "titleId": "tt13105536", "reviews": [{"id": 0, "text": "Crew did a good job...but major negative thing is acting from the cast and their dialog delivery, it seemed so much artificial...but overall a decent movie during normal time...but it's COVID time so it's a good movie for a one time watch...but way better than other Big OTT releases..."}, {"id": 1, "text": "First of all, Congratulations to the Team! Everything in the movie is so good and captivating. I had an great weekend with my family watching this movie. What i really like in this movie is belowA) The way director portrayed the story B) Twists C) Screenplay D) Visuals - LocationsAll the best to the crew members. Good thing is that all you guys are working and apart from your busy schedules, you really took time and worked on this movie. Really a lot of Hardwork gone thru .. I really appreciate all of you and Good Luck!"}, {"id": 2, "text": "It's a copy of Forgotten- 2017 Korean movie. However, it is a great attempt. Cinematography is at its best. The actors didn't act well and doesn't look realistic. Please take it as a constructive feedback."}, {"id": 3, "text": "Very rarely we see psychological and psycho thrillers in telugu. But debutant Kiran gave a neat thriller. Though lead actors faces aren't convincing at first they make us get involved later. Bgm , Cinematography and Visuals are highlight with limited budget. First half is a bit weak with slow pace. Few twists are good. Slow pace overall. Overall a neat thriller by a debutant."}, {"id": 4, "text": "One the best movies in recent time. Give it a watch"}, {"id": 5, "text": "I found the movie good until a point when it seemed so stupid and silly. The father and Meera were trying to escape from an injured man and left a barrel gun right in his hands for him to chase and shoot. Father disarmed him in the snow later but again left him with that gun and started running. Wtf was this?! I won't even mention how absurd this seemed. Again it is shown the Adithi was given was oxygen and other supplies for god knows what reason when the villain duo had already decided to murder her before putting her in the trunk. The last scene made no sense how that trunk metal banged as the driver Laxman had already shot Rishi in the chest from behind and RIshi was dead for sure. Everything was good apart from these silly plotholes. They ruin such good plots with so stupid things."}, {"id": 6, "text": "This is the worst movie ever seen and looks like the movie maker has lot of friends who reviewed it well and am sure they did it against their will. Such a horrible cast and crew, Acting forget about it Movie is terrible and a total disaster."}, {"id": 7, "text": "It is a more than decent product from indie filmmakers who generally are on shoestring budget. Special commendation to Mr. Bhargava (Arjun), who is not an actor but a full time senior Google employee! There shouldn't be comparisons to big banner products as it is difficult to release a product with 1/10th (probably less) of the budget and shoot a thriller movie in USA!Overall good job by the cast and crew."}, {"id": 8, "text": "Really loved the performance of everyone. And it was a great attempt guys! I really liked the dialogue delivery. Loved the cinematic experience!"}, {"id": 9, "text": "Engaging plot, scintillating background score , tight editing , California's picturesque landscapes and natural acting , pick of the actors is Bhargav Poludasu , a debut which would be remembered for long time in Telugu movies . A must watch for anyone interested in meaningful cinema ."}, {"id": 10, "text": "Good plot with some excellent twists and the crime investigation part is good, a nice attempt,the locations user are extraordinary, cast of the film did natural performances,bgm was good and kept us involved throughout the film,finally a good thriller with a decent story."}, {"id": 11, "text": "Sat with enthusiasm to watch the film expecting a good thriller....after a while into the movie writing fails, logic fails, acting fails except for the person who played rishi..."}, {"id": 12, "text": "Making a bakwaas movie and giving good rating by our friends not make movie great. It's worst movie with worst performances. Just do one thing don't waste 1:30 hrs your time."}, {"id": 13, "text": "The movies is good. U can watch movie for the twists. The back ground music is awesome. Go for a try. You might lov e it."}, {"id": 14, "text": "My family enjoyed this thriller movie! and so far this was the good movie that we have watched!"}, {"id": 15, "text": "Considering it is done by non film background folks I appreciate the movie. They had good production values and the screenplay was good. The movie was a little slow for the first 15 min but picked up the pace after that. I especially liked the father's character and how he has been portrayed in the movie."}, {"id": 16, "text": "Movie starts.dark theme. May seem a bit slow in the start but once it progresses it's wow , twists and turns. Truly amazing. Must watch for thriller genre"}, {"id": 17, "text": "The movie's opening is very engaging and intense. Keeps you on your toes all the time. The father, arjun (bhargav) is a complete showrunner and an amazing actor. Unlike the big budget movies with big name actors the story is fresh and engaging. The climax gets a little dragged but is essential to the entire plot to connect the dots. I've really enjoyed this movie and don't let others spoil the story for you. The story, direction and cinematography are really awesome."}, {"id": 18, "text": "This movie has kept me engaged all along. The camera work is superb and actors were great. I definitely recommend this movie as a must watch. Director Kiran has done a wonderful job, camera placements were good they resulted in good scenes, drone footages, car chase sequel is highlight top quality. Kiran and team will do great movies in future. Best wishes."}, {"id": 19, "text": "It looks like Hollywood psychological thriller with Indian cast,but it was directed by Indian director and his team.The visuals and bgm are too good. Cast is new but they perfomed well."}, {"id": 20, "text": "The actors we fresh and did a decent job!Background score and the direction standout when executing a pretty decent thriller story.One of the actors who was a natural was Aditi's father! His action was so natural given that I did not see him in any earlier movies.Now that you have read this review - 'Baaga tired ayinattu vunnaru, velli rest theesukondi, repu maatlaadukundam!:) :)"}, {"id": 21, "text": "It's a well written script with decent execution .. nice thriller"}, {"id": 22, "text": "It was quite entertaining and nicely developed storyline! Give it a watch!"}, {"id": 23, "text": "As a storyline it seems good. But Acting, direction and Screenplay are pathetic. Predictable and uninteresting. Skip this one and do yourself a favor."}, {"id": 24, "text": "I am huge fan of you rakesh bro. I was looking at your movies since 2010 and you have improved so well in this film. Huge respect to our desi folks for making this film this huge success and working so hard for this film. Overall after a long time really enjoyed a thriller! We love you rakesh! Hope we see your movies often!"}, {"id": 25, "text": "Worst acting. Lets start there. No logic whatsoever in the story. Some random things keep happening for absolutely no reason &amp; an explanation follows. Its not about the movie alone. Its about the many reviews written here that makes you wonder whats all these is about."}, {"id": 26, "text": "After a long time we are watching a good thriller! Great performance by Character Rishi. twist was so good and overall the cinematography was excellent!"}, {"id": 27, "text": "Rishi, a patient who just wakes up from an accident without any memory of the past is offered help by Arjun, as their car breaks down on a secluded highway. The story begins to unveil itself as Arjun's past comes into limelight and why is Rishi in Arjun's custody forms rest of the story. Director Kiran has done really well in this film. Meera's performance is impeccable. Definitely worth watching. The movie does contain explicit content, nothing to obscene and unnecessary but be sure to not watch it with kids."}, {"id": 28, "text": "Really a good movie overall, specially with new actors. It make sure to keep you interested with what's next."}, {"id": 29, "text": "The movie has lot of twists but the story is not out of the box. screen play is very engaging .the actors, dop,art department &amp; editing department have done fine job.for a thriller film this bgm is not upto the mark , dissatisfied with the sound department even at the 1st few minutes of the film we get a feeling as if it is dubbed version.overall it is a very good film compared to all the other films released recently..."}, {"id": 30, "text": "You will surely enjoy the movie eventhough they are new team they made movie like professionals it was like watching Hollywood movie for me"}, {"id": 31, "text": "Not worth watching this movie. Better save 2 hr of your time."}, {"id": 32, "text": "The movie is really nice. Must watch one time as every scene is interesting. We willl involve in the story from scene 1 n goes on till the movie ends. Really nice movie"}, {"id": 33, "text": "Gatham is such a terrific movie but I dont understand Why the ratings are low :("}, {"id": 34, "text": "The movie started on a soft note looking more like a elongated short movie. It picked up the pace 30 mins into it and there isn't a boring second until it ends."}, {"id": 35, "text": "Its better avoid this... co copying Hollywood style"}, {"id": 36, "text": "Good thriller movie. Very good attempt by the team."}, {"id": 37, "text": "A convincing psycho thriller released in recent times unlike many others which doesn't make sense at all. Good narration with captivating twists. Visuals and screenplay couldn't be better. Bhargava(Arjun) stole the show and some scenes were exceptional(car chase is my favorite). Definitely worth a watch and Kudos to whole team for a great attempt.."}, {"id": 38, "text": "Well! the trailer may seem a little scary for those of us who are not fond of thriller movies but you've got to watch this one. Fantastic piece of work! Hard to believe its created by a bunch of first time artists... who seem extremely talented.Great work! Team Gatham!"}, {"id": 39, "text": "It has an interesting plot, but the screenplay is dull, the script demands good conversations which lacked in this film, Actors are a big minus except Pooja. Locations are vey nice, Cinematography is good in exterior scenes and bad in interior scenes. Music is just ok. editing is fine."}, {"id": 40, "text": "This movie will keep you guessing until the very end."}, {"id": 41, "text": "Brilliant characterisations, performances and beautifully shot"}, {"id": 42, "text": "The start of the movie is very off beat but as it proceed the twist and turns really makes you feel to keep on watching till the end . The cast of the movie is very new but each of them has played their carecter very well and justified their roles . A must watch movie and clearly a true example of proper Suspence Thriller"}, {"id": 43, "text": "Film starts well and as it progresses story was predictable and length should have been reduced"}, {"id": 44, "text": "Mediocre story. Very bad acting. Weak music. Overall feel is not carried effectively due to lack of proper film execution. But mostly it's the acting and ridiculously forced storylime that brought death to this project"}, {"id": 45, "text": "I heard a lot of praise for Gatham online and watched it finally. I had high expectations and the film met them. What's Good: 1. The story is great. India makes very few suspense thriller movies and a good suspense thriller movie is an exception. This film is one such exception. 2. The performance of all actors is good. 3. The first half of the movie keeps you on the edge of your seat. After that a huge twist comes and you see a flashback. You start thinking the film is becoming predictable but it isn't. The director plays with your mind constantly till the end. 4. There are no songs in the film because the film didn't require them. Due to that the length is 1 hour and forty odd minutes only. What's bad: 1. Although the story is great and unpredictable, after watching the whole movie some people like me will feel it has a lot of happy coincidences which doesn't happen in real life."}, {"id": 46, "text": "The cinematic experience was amazing and this thriller grips your attention until the reveal(s) :). Good job by everyone."}, {"id": 47, "text": "Very well made crime thriller. Keeps you engaged from the first scene. All actors did a fantastic job, especially two lead actors. Quality of the making is good. Background score and screenplay are fantastic. This movie is 200% better than recent high budget movies that I have watched. Overall it's a very good movie to watch. Kudos to the entire crew."}, {"id": 48, "text": "Kudos to the entire team of Gatham for making this Suspense, Psychic thriller movie. At times when you think that this particular character is the main villain then comes the twist and turn and the plot proves you wrong. And the dialogue baaga alisipoyinattu unnaru, kaasepu rest teeskondi repu podunna maatlaadam is the highlight of the movie. Did enjoyed the movie."}, {"id": 49, "text": "WATCH IT Folks.. I have enjoyed it from start to finish!"}, {"id": 50, "text": "Even though the movie was made by all amateurs the visuals are great and the storytelling is awesome. I really love the climax. in terms of visuals the movie is not less than any Hollywood movie. please create that some of the Telugu people in USA are taking pains to make a very good thriller in the times when Amazon prime and Netflix are coming up with mediocre thrillers. all the best for the team."}, {"id": 51, "text": "All acters carrier Best performances good script best screen play great direction and also good dop and background music also finally best thriller like Hollywood range"}, {"id": 52, "text": "Movie is good , you never get bored. The guy who played the girls father role is outstanding he is really superb. The villen imitating vijay devarakonda voice really looks irritating. Overall it's a good movie I'm giving 7 stars"}, {"id": 53, "text": "Regular suspence movie.. But good. Bgm was nice.........."}, {"id": 54, "text": "One of the best suspense thriller movie I saw in recent times in telugu Kudos to the team and the one who played Adithis father character stuck in my head everyone did a fabulous performance"}, {"id": 55, "text": "It's quite possible that you're going to want to stop watching Kiran Reddy's debut film Gatham around the 30-minute mark. It's got every single problem I associate with the 'NRI Film' - the setting is cold and lifeless, the foreign actors appear barely employable and there's no plausible way you're convinced that America is so full of Indians that you can place a Telugu-speaking ensemble there.Read the full article on film companion"}, {"id": 56, "text": "Firstly, congratulations to the entire team of Gatham for this amazing start. The story is amazing and the screenplay is well constructed. Coming to acting, Rakesh bro killed it with his performance. Big fan from Canada bro. Much needed movie to watch in Amazon Prime OTT. I would suggest everyone to watch and experience the intriguing thriller."}, {"id": 57, "text": "This is a great and different approach to a routine one. The background score are another highlight of this movie. As like all the time acting is amazing. And everyone in film needs a special recognition. The background music took the movie into an outstanding way.i really liked the movie. The way the movie went on was really cool. It's a cool and calm and great screenplay contained Psycho Thriller Movie It's an Great Job by Brother kiran kondamadugula..."}, {"id": 58, "text": "Very good try and with such small crew right from the trailer it looks so good and the second half is much more interesting."}, {"id": 59, "text": "Was watching the movie without any expectations and assuming I am watching a low budget movie so I will watch more of a story and not great visuals. But I was proven wrong first things the movie has basics right, Actors did good and story and movie is very engaging and good run time as well. Then the visuals were great, very good locations, some of the best cars as well. I seriously wished to know the budget of the film and if this can be made at a low budget like I assume it's a lesson for some of the commercial movies on what they could make at less budget. Special mention to Bhargavas acting review rasu baga alisipoya Inka velli padkunta"}, {"id": 60, "text": "Must watch movie, loved how the director dealt with the story. Back ground score and Cinematography are top notch."}, {"id": 61, "text": "First of all i am huge fan of you rakesh bro! I am watching your films since 2012, you have improved so well in the acting! I have seen you as the most of the roles as sweet and calm and this movie it showed a different role. and me and my girlfriend enjoyed watching you in this film. we wish you could do more films and more different roles like this. Coming to the movie, cinematography was too goo and applause to all the team that they made this movie so good. After a long time we are watching this great film in amazon prime. Thank you to the team who made so much effort for making this film a great movie."}, {"id": 62, "text": "The whole movie story is as if somebody wrote it in a day. Its as if they just made the movie because crime thrillers are a trend now. Recently a lot of movies are coming up like this. Some psycho committing crimes in a foreign country. Many scenes which happens in the movie feels out of place. So many things are just added to the movie to make the story and none of it makes sense. Also everything happens in a hurry in the movie. It doesnt have a flow. I would also like to point out that the videography, lighting, location etc are good. The performance of the actors are okay, i feel like they can do much better."}, {"id": 63, "text": "Just because movie is trying to imitate a Hollywood thriller doesn't mean it will become one. It's unfortunate that such a good script had bad writing and acting. Disappointed. Skip it."}, {"id": 64, "text": "Not nice it's tooo bad, I don't know why it still has 6.9 on IMDb"}, {"id": 65, "text": "Actors are pathetic. Direction is so poor. It was almost like watching blurred movie. story - copied Actors were poorly chosen and Rishi sounded like wannabe devarkonda. (Purposely did that) His hair style was so bad like he got out of mental hospital. Please take care of appearance which is the most important factor for on screen performance I highly doubt the taste of those who are posting good ratings. Oh I believe it could be friends of friends. 🙄 Please do not misguide movie lovers by posting good reviews for such a poor film.Thanks!"}, {"id": 66, "text": "Interesting movie with plot that makes you wait for the next scene. Definitely a must watch!"}, {"id": 67, "text": "Complete waste of time .No logic and acting was terrible. Ridiculous story .Only good thing about the movie is the location."}, {"id": 68, "text": "Looks like a covid time movie. Amateur attempt to pass time due to loss of job ??. Atleast they could have asked a retired doctor on how to diagnose pregnancy.better luck next time ,👍🏼"}, {"id": 69, "text": "It is a wonderful thriller movie I have seen in this covid situation. Such a perfect script. Though the First half seems to be moving a bit slow, the mystery starts unfolding in the second half justifying and answering every single question left earlier in the beginning. The screenplay is awesome. Rishi's character was so good and didn't expected the character will suddenly change. Great twist and great job everyone!"}, {"id": 70, "text": "It is a wonderful thriller movie I had ever seen in this whole earth. Such a perfect script. Though the First half seems to be moving a bit slow, the mystery starts unfolding in the second half justifying and answering every single question left earlier in the beginning. The screenplay is awesome."}, {"id": 71, "text": "Direction acting - everything's so bad. Series of mysteries, twists - too much of everything. No character building etc."}, {"id": 72, "text": "Great script but detached screenplay, ordinary performances and dubbing spoils it further. A psycho allowing his father to ink him for the reason mentioned is really absurd!"}, {"id": 73, "text": "This movie gives you a certain feel and mood very well written and the color theme like black,brown,red which is used in accordance to the story and characters simply blows your mind Love rishi's performance...this movie has some plot holes but the brilliant direction and proceedings make you overlook it this is how you make a thriller! All the best Rakesh, My mom and my sister is a huge fan of you!"}, {"id": 74, "text": "This movie gives you a certain feel and mood very well written and the color theme like black,brown,red which is used in accordance to the story and characters simply blows your mind Love rishi's performance...this movie has some plot holes but the brilliant direction and proceedings make you overlook it this is how you make a thriller! All the best Rakesh, My mom and my sister is a huge fan of you!"}, {"id": 75, "text": "Twists can change the basic rules of story structure, screenplay rules which is missed where more focused on BGM and Cinematography.Old story tries to make in the new cover but failed due to poor acting, un structured screenplay, main focus from the story totally changed.Giving 6 about the effort and some points which really strikes, for its BGM and cinematography but overall looses."}, {"id": 76, "text": "The story line is similar like FORGOTTEN.....if you have seen forgotten then i think you feel bored..... The soul of the story is same.People played in GATHAM - Meera and the father role played well . Little bit lag in screen play."}, {"id": 77, "text": "Worst acting, but good concept and visuals. Background score is the backbone for the movie"}, {"id": 78, "text": "Not sure who is giving such high reviews.. absolutely bad acting dialogues camera illogical scenes .. its an amateur movie.. 40mins into the movie I'm done..I was hoping some changes will happen but man the reviews on Google cheated me into thinking its a good movie.. sorry but not a good movie by any means .. 1/5 or 3/10 movie at the max"}, {"id": 79, "text": "The start of the movie is very off beat but as it proceed the twist and turns really makes you feel to keep on watching till the end . The cast of the movie is very new but each of them has played their carecter very well and justified their roles . A must watch movie and clearly a true example of proper Suspence Thriller ."}, {"id": 80, "text": "I watched this film after coming across a few very positive reviews and god! I'm never reading film reviews in newspapers, especially from 'the Hindu'.It's a very predictable film. When I say predictable, I mean PREDICTABLE- so much so that it actually annoys you. The acting is stupefying, never seen a film that has worse acting.It calls itself a thriller, haha that's funny. This film will now come to mind every time I come across the word 'thriller' -and I'm sure I'll shudder in terror. Ugh I'm scarred for life.Recalling the film is a torture, I go through this anyway to prevent further agony for all you innocent people who have no clue how excruciating this junk is. Oh brothers and sisters, I hope you take my suggestion, if you don't, I pity you. :p"}, {"id": 81, "text": "With no new movies releasing, movie buffs are having hard time to look out for fresh content....and here is a gem that comes along knocking on Amazon Prime. I started with looking out for a story that can keep you engaged. The production quality, camera shorts that are of international standards pulled my interest. This first was obvious in the opening credits where the scenes are shot with an aerial view. The director Kiran Reddy is knows his job very well. We see a deep influence from Hollywood but that works in favour of the movie as most of the movie markers are in the USA. The movie has its aha moments with twists and turns that can leave you stunned. The lead actor Bhargava Poludasu comes in as a surprise and his transformation to the central character is seamless. He definitely acted with restraint and someone to look out for in future. The other actor Rakesh Galebhe with his looks like Atif Aslam, confuses us for some time, works well for the movie. The movie stayed with me for a while. And somewhere the movie strikes a balance on morality, revenge saga, thriller. If you are searching for content, this movie is will not disappoint at all. Good work Gatham team!"}, {"id": 82, "text": "I think I just saw one of the most irritating films of the year. This is on par with Nishabdam, in its execution of story. Although, this makes more sense than that trash. There is not much story here as half of the film is spent on flashbacks. The main conflict is about a father trying to find his daughter, who probably got murdered at the hands of her boyfriend. And that plot is stretched out to a mind-numbing length of a film, that leaves you exhausted rather than intrigued. The antagonist is one of the most bland and caricature-ish villains put in a Telugu film. By the end of the film, he comes off as laughable. I couldn't stand the actor that played him. The story lacks any urgency and conflict, after the first 20-30 min, since it's all a flashback. And the flashback also has not much urgency, as the protagonists are more worried about getting the information out of the antagonist who's asleep, rather than actually search for the missing daughter. And there are many logical loopholes that you want to go like, Wait! He could've easily done that. She could've easily taken the gun away from him and escaped. And stuff that gives away the dumbness of the proceedings. The beautiful camerawork and the bgm just exist as a gloss, than actually serving the story. Strictly a one time watch for the indie effort, because you may forgot your Gatham and get a headache if you watch it once again."}], "reviews_amount": 83}